         TITLE 'IFCEDSUM-CONTROL MODULE FOR EDIT AND SUM ROUTINES      *00001000
                        '                                               00002000
IFCEDSUM CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IFCEDSUM  78.100'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @12,0                                               0001 00012000
@PSTART  LA    @11,4095(,@12)                                      0001 00013000
         LA    @10,4095(,@11)                                      0001 00014000
         USING @PSTART,@12                                         0001 00015000
         USING @PSTART+4095,@11                                    0001 00016000
         USING @PSTART+8190,@10                                    0001 00017000
         ST    @13,@SA00001+4                                      0001 00018000
         LA    @14,@SA00001                                        0001 00019000
         ST    @14,8(,@13)                                         0001 00020000
         LR    @13,@14                                             0001 00021000
         B     @PB00002                                            0187 00022000
MERDIAN  STM   @14,@12,@SA00002                                    0187 00023000
* IF DEBUG48 = ON & FIRSTHEX = OFF & FRAMEPTR ^= 0 THEN            0192 00024000
         TM    DEBUG48(R2),B'10000000'                             0192 00025000
         BNO   @RF00192                                            0192 00026000
         TM    FIRSTHEX,B'00010000'                                0192 00027000
         BNZ   @RF00192                                            0192 00028000
         L     @14,FRAMEPTR(,R2)                                   0192 00029000
         LTR   @14,@14                                             0192 00030000
         BZ    @RF00192                                            0192 00031000
*  DO;                                                     /*@G51DGVS*/ 00032000
*   GEN(MVC  PRTLINE(26),BUG48); /*MOVE DEBUG48 INTO PRT LINE*/    0194 00033000
         MVC  PRTLINE(26),BUG48                                         00034000
*   CALL PRINTIT;  /*GO PRINT THE DISCRIPTION OF DUMP        @G51DGVS*/ 00035000
         BAL   @14,PRINTIT                                         0195 00036000
*   SAVE7 = R7;/*SAVE THE ADDRESS OF THE RECORD              @G51DGVS*/ 00037000
         ST    R7,SAVE7                                            0196 00038000
*   SAVERLN = RECLNGTH; /*SAVE THE RECORD LENGTH FOR RETURN  @G51DGVS*/ 00039000
         LH    @14,RECLNGTH(,R2)                                   0197 00040000
         ST    @14,SAVERLN                                         0197 00041000
*   R7 =  FRAMEPTR;  /*SET UP THE ADDRESS OF THE FRAME TABLE @G51DGVS*/ 00042000
         L     R7,FRAMEPTR(,R2)                                    0198 00043000
*   RECLNGTH = 384;  /*SET UP THE LENGTH OF THE TABLE        @G51DGVS*/ 00044000
         MVC   RECLNGTH(2,R2),@CH01253                             0199 00045000
*   CALL HEXDUMP;   /*GO HEX DUMP THE FRAME TABLE            @G51DGVS*/ 00046000
         BAL   @14,HEXDUMP                                         0200 00047000
*   FIRSTHEX = ON;  /*SET THE SWITCH SO WE ONLY DO IT ONCE   @G51DGVS*/ 00048000
         OI    FIRSTHEX,B'00010000'                                0201 00049000
*   R7 = SAVE7;     /*RESTORE THE REG TO THE ORGINAL VALUE   @G51DGVS*/ 00050000
         L     R7,SAVE7                                            0202 00051000
*   RECLNGTH = SAVERLN;  /*RESTORE THE RECORD LENGTH         @G51DGVS*/ 00052000
         L     @14,SAVERLN                                         0203 00053000
         STH   @14,RECLNGTH(,R2)                                   0203 00054000
*  END;                                                    /*@G51DGVS*/ 00055000
* IF CORE ^= YES THEN            /*HAVE WE DONE THE GETMAIN FOR FRMS*/  00056000
@RF00192 TM    CORE,B'01000000'                                    0205 00057000
         BO    @RF00205                                            0205 00058000
*  DO;                                                     /*@G51DGVS*/ 00059000
*   RESPECIFY (R0,R15) RESTRICTED;                         /*@G51DGVS*/ 00060000
*   R0 = 2000;   /*THIS IS MIN FOR SUBPOOL  GETMAIN ANWAY    @G51DGVS*/ 00061000
         LA    R0,2000                                             0208 00062000
*   GEN(GETMAIN EC,LV=(0),A=NEWREC,SP=20);                 /*@G51DGVS*/ 00063000
         GETMAIN EC,LV=(0),A=NEWREC,SP=20                               00064000
*   IF R15 ^= ZERO THEN          /*CONTINUE IF WE GOT THE CORE*/   0210 00065000
         LTR   R15,R15                                             0210 00066000
         BZ    @RF00210                                            0210 00067000
*    DO;                                                   /*@G51DGVS*/ 00068000
*     ERROR = R15;               /*THIS WILL STOP THINGS THIS JOB STEP* 00069000
         STH   R15,ERROR                                           0212 00070000
*     CALL IFCMSG(40,ADDR(PRTLINE));/*GO GET THE NEEDED MESSAGE*/  0213 00071000
         LA    @14,PRTLINE                                         0213 00072000
         ST    @14,@AFTEMPS                                        0213 00073000
         L     @15,ADIFCMSG(,R2)                                   0213 00074000
         LA    @01,@AL00213                                        0213 00075000
         BALR  @14,@15                                             0213 00076000
*     CALL PRINTIT;              /*TELL ABOUT THE LACK OF CORE*/   0214 00077000
         BAL   @14,PRINTIT                                         0214 00078000
*    END;                                                  /*@G51DGVS*/ 00079000
*   ELSE                                                           0216 00080000
*     CORE = YES;                /*SET HAVE CORE FLAG        @G51DGVS*/ 00081000
         B     @RC00210                                            0216 00082000
@RF00210 OI    CORE,B'01000000'                                    0216 00083000
*  END;                                                    /*@G51DGVS*/ 00084000
@RC00210 DS    0H                                                  0218 00085000
*  IF  ERROR = ZERO THEN         /*DONT DO IF FAILED ABOVE   @G51DGVS*/ 00086000
@RF00205 LH    @14,ERROR                                           0218 00087000
         LTR   @14,@14                                             0218 00088000
         BNZ   @RF00218                                            0218 00089000
*   DO;                                                    /*@G51DGVS*/ 00090000
*    RESPECIFY (R0,R8,R9) RESTRICTED;                      /*@G51DGVS*/ 00091000
*    R1 = RECLNGTH;              /*SET  UP TO MOVE THE RECORD TO*/ 0221 00092000
         LH    R1,RECLNGTH(,R2)                                    0221 00093000
*    R9 = R1;                    /*THE NEW AREA SO WE CAN READ IN THE*/ 00094000
         LR    R9,R1                                               0222 00095000
*    R0 = NEWREC;                /*FRAME RECORD IF ONE EXIST @G51DGVS*/ 00096000
         L     R0,NEWREC                                           0223 00097000
*    RECMOVE = RECMOVE + ONE;    /*# OF RECORDS THAT WERE MOVED*/  0224 00098000
         LA    @14,1                                               0224 00099000
         AL    @14,RECMOVE                                         0224 00100000
         ST    @14,RECMOVE                                         0224 00101000
*    R8 = R7;                    /*R8 = WHERE REC IS NOW     @G51DGVS*/ 00102000
         LR    R8,R7                                               0225 00103000
*    GEN(MVCL  R0,R8);           /*MOVE THE RECORD TO NEW AREA*/   0226 00104000
         MVCL  R0,R8                                                    00105000
*    RESPECIFY (R8,R9) UNRESTRICTED;                       /*@G51DGVS*/ 00106000
*    RECLNGT1 = RECLNGTH;        /*IFCFRAME WILL NEED THIS VALUE*/ 0228 00107000
         LH    @14,RECLNGTH(,R2)                                   0228 00108000
         ST    @14,RECLNGT1(,R2)                                   0228 00109000
*    R7 = NEWREC;                /*SET POINTER TO DATA RECORD*/    0229 00110000
         L     R7,NEWREC                                           0229 00111000
*    IF FRAMEIN = NO THEN        /*HAVE WE LOADED IFCFRAME YET*/   0230 00112000
         TM    FRAMEIN,B'00100000'                                 0230 00113000
         BNZ   @RF00230                                            0230 00114000
*     DO;                                                  /*@G51DGVS*/ 00115000
*    GEN(LOADEREP EPLOC=FRMNAME);    /* LOAD FRAME ROUTINE   @G51DGVS*/ 00116000
         LOADEREP EPLOC=FRMNAME                                         00117000
*      FRAMEIN = YES;            /*SET FLAG SO AS TO NOT RETURN*/  0233 00118000
         OI    FRAMEIN,B'00100000'                                 0233 00119000
*      FRAMEADD = R0;            /*SAVE THE ADDRESS OF WHERE OS PUT IT* 00120000
         ST    R0,FRAMEADD                                         0234 00121000
*     END;                                                 /*@G51DGVS*/ 00122000
*    CALL FRAME;                 /*GO FIND THE FRAME IF THERE IS ANY*/  00123000
@RF00230 BAL   @14,FRAME                                           0236 00124000
*   END;                                                   /*@G51DGVS*/ 00125000
*RESPECIFY (R0,R1,R15)  UNRESTRICTED;                      /*@G51DGVS*/ 00126000
*END;                                                      /*@G51DGVS*/ 00127000
@EL00002 DS    0H                                                  0239 00128000
@EF00002 DS    0H                                                  0239 00129000
@ER00002 LM    @14,@12,@SA00002                                    0239 00130000
         BR    @14                                                 0239 00131000
*/*******************************************************************/  00132000
*/*    THIS PROC WILL FIND THE SET OF FRAMES NEEDED TO PROCESS THIS */  00133000
*/*    DATA RECORD.  IF THE MODEL-SERIAL # CHECK DOES NOT MATCH THEN*/  00134000
*/*    AN ATTEMPT IS MADE TO FIND A MATCH ON JUST MODEL IF NO MATCH */  00135000
*/*    THEN THERE ARE NOT ANY FRAMES TO EDIT THIS REC WITH, IFCFRAME*/  00136000
*/*    WILL ONLY FORMAT THE HEADER AND THEN HEX DUMP THE RECORD     */  00137000
*/*    DEBUG COUNTS OF THE NUMBER OF FRAMES READ IN ARE KEPT @G51DGVS*/ 00138000
*/*        VALUES PASSED TO IFCFRAME:                        @G51DGVS*/ 00139000
*/*           A.  R5 = ADDRESS OF THE FRAME RECORD           @G51DGVS*/ 00140000
*/*               (0 TELLS IFCFRAME THAT FUTHER FRAMES ARE NOT AVAIBLE* 00141000
*/*           B.  R7 = ADDRESS OF THE DATA RECORD            @G51DGVS*/ 00142000
*/*           C.  R2 = ADDRESS OF THE COMMUNATION TABLE      @G51DGVS*/ 00143000
*/*           D.  RECLNGT1 = LENGTH OF THE DATA RECORD       @G51DGVS*/ 00144000
*/*    IT IS LEFT UP TO IFCFRAME TO SUPPORT DEBUG4 FOR ITS SELF AND */  00145000
*/*    ANY MODULES LINKED CALLED BY IFCFRAME                 @G51DGVS*/ 00146000
*/*                                                          @G51DGVS*/ 00147000
*FRAME: PROC;                                              /*@G51DGVS*/ 00148000
FRAME    STM   @14,@12,@SA00003                                    0240 00149000
*DCL INDEX1 FIXED(31) INIT(0);                             /*@G51DGVS*/ 00150000
*  RESPECIFY (R15) RESTRICTED;                             /*@G51DGVS*/ 00151000
* FOUND = NO;                   /*SET FLAG TO NO FRAMES      @G51DGVS*/ 00152000
         NI    FOUND,B'11110111'                                   0243 00153000
* DO A = 1 BY 1 TO FRAMENUM  WHILE(FOUND = NO);            /*@G51DGVS*/ 00154000
         LA    @14,1                                               0244 00155000
         ST    @14,A                                               0244 00156000
         B     @DE00244                                            0244 00157000
@DL00244 TM    FOUND,B'00001000'                                   0244 00158000
         BNZ   @DC00244                                            0244 00159000
*  IF LRTCPMOD = FRAMECPU(A)  &    /*DOES THE SERIAL/MODEL MATCH*/ 0245 00160000
*     FRAMETYP(A) = 'FF'X THEN   /*ALSO ALL THE FRAMES FOUND BY FILT1*/ 00161000
         LR    @06,@14                                             0245 00162000
         MH    @06,@CH00043                                        0245 00163000
         L     @03,FRAMEPTR(,R2)                                   0245 00164000
         ST    @06,@TF00001                                        0245 00165000
         ALR   @06,@03                                             0245 00166000
         AL    @06,@CF01392                                        0245 00167000
         CLC   LRTCPMOD(5,R7),FRAMECPU-4(@06)                      0245 00168000
         BNE   @RF00245                                            0245 00169000
         AL    @03,@TF00001                                        0245 00170000
         AL    @03,@CF01393                                        0245 00171000
         CLI   FRAMETYP-17(@03),X'FF'                              0245 00172000
         BNE   @RF00245                                            0245 00173000
*   DO;                                                    /*@G51DGVS*/ 00174000
*   INDEX1 = A;                /*SAVE FOR INDEXING LATTER WHILE CORREC* 00175000
         ST    @14,INDEX1                                          0247 00176000
*   FOUND = YES;                  /*FOUND MATCH SO SET TO EXIT*/   0248 00177000
         OI    FOUND,B'00001000'                                   0248 00178000
*   END;                                                   /*@G51DGVS*/ 00179000
* END;                                                     /*@G51DGVS*/ 00180000
@RF00245 LA    @14,1                                               0250 00181000
         AL    @14,A                                               0250 00182000
         ST    @14,A                                               0250 00183000
@DE00244 L     @06,FRAMEPTR(,R2)                                   0250 00184000
         C     @14,FRAMENUM(,@06)                                  0250 00185000
         BNH   @DL00244                                            0250 00186000
@DC00244 DS    0H                                                  0251 00187000
* IF FOUND = NO THEN              /*LETS SEE IF ONLY THE MODEL MATCH*/  00188000
         TM    FOUND,B'00001000'                                   0251 00189000
         BNZ   @RF00251                                            0251 00190000
*  DO A = 1 BY 1 TO FRAMENUM WHILE(FOUND = NO);            /*@G51DGVS*/ 00191000
         LA    @14,1                                               0252 00192000
         ST    @14,A                                               0252 00193000
         B     @DE00252                                            0252 00194000
@DL00252 TM    FOUND,B'00001000'                                   0252 00195000
         BNZ   @DC00252                                            0252 00196000
*   IF LRTMODEL = FRAMEMOD(A) &    /*DOES THE MODEL MATCH    @G51DGVS*/ 00197000
*     FRAMETYP(A) = 'FF'X THEN  /*FILT1 FOUND A COMPLETE SET OF FRM*/   00198000
         LR    @06,@14                                             0253 00199000
         MH    @06,@CH00043                                        0253 00200000
         L     @03,FRAMEPTR(,R2)                                   0253 00201000
         ST    @06,@TF00001                                        0253 00202000
         ALR   @06,@03                                             0253 00203000
         AL    @06,@CF01395                                        0253 00204000
         CLC   LRTMODEL(2,R7),FRAMEMOD-7(@06)                      0253 00205000
         BNE   @RF00253                                            0253 00206000
         AL    @03,@TF00001                                        0253 00207000
         AL    @03,@CF01393                                        0253 00208000
         CLI   FRAMETYP-17(@03),X'FF'                              0253 00209000
         BNE   @RF00253                                            0253 00210000
*    DO;                                                   /*@G51DGVS*/ 00211000
*    SPECILCT = SPECILCT + 1;     /*KEEP TRACK OF THE NUMBER OF THESE*/ 00212000
         LA    @06,1                                               0255 00213000
         AL    @06,SPECILCT                                        0255 00214000
         ST    @06,SPECILCT                                        0255 00215000
*    FOUND = YES;                 /*SET FLAG TO FOUND MATCH  @G51DGVS*/ 00216000
         OI    FOUND,B'00001000'                                   0256 00217000
*    INDEX1 = A;                  /*SAVE FOR INDEXING LATER  @G51DGVS*/ 00218000
         ST    @14,INDEX1                                          0257 00219000
*    END;                                                  /*@G51DGVS*/ 00220000
*  END;                                                    /*@G51DGVS*/ 00221000
@RF00253 LA    @14,1                                               0259 00222000
         AL    @14,A                                               0259 00223000
         ST    @14,A                                               0259 00224000
@DE00252 L     @06,FRAMEPTR(,R2)                                   0259 00225000
         C     @14,FRAMENUM(,@06)                                  0259 00226000
         BNH   @DL00252                                            0259 00227000
@DC00252 DS    0H                                                  0260 00228000
* IF FOUND = YES THEN             /*HAVE TO SET UP THE ADDRESSABILITY*/ 00229000
@RF00251 TM    FOUND,B'00001000'                                   0260 00230000
         BNO   @RF00260                                            0260 00231000
*  DO;                            /*TO THE CCHHRS OF THE FRAME RECORDS* 00232000
*   IF MERDTYP = '1F'X THEN       /*COMPARE 1ST BYTE IN THE SORT ENTRY* 00233000
         CLI   MERDTYP(R4),X'1F'                                   0262 00234000
         BNE   @RF00262                                            0262 00235000
*     LISTPTR = FRAMLOCM(INDEX1); /*IS AN MCF TYPE SET BASED ADDRESS*/  00236000
         L     @14,INDEX1                                          0263 00237000
         MH    @14,@CH00043                                        0263 00238000
         L     @06,FRAMEPTR(,R2)                                   0263 00239000
         AL    @06,@CF01396                                        0263 00240000
         L     @14,FRAMLOCM-20(@14,@06)                            0263 00241000
         ST    @14,LISTPTR                                         0263 00242000
*    ELSE                                                          0264 00243000
*     LISTPTR = FRAMLOCC(INDEX1); /*SET TO AN CCF TYPE       @G51DGVS*/ 00244000
         B     @RC00262                                            0264 00245000
@RF00262 L     @14,INDEX1                                          0264 00246000
         MH    @14,@CH00043                                        0264 00247000
         L     @06,FRAMEPTR(,R2)                                   0264 00248000
         L     @14,FRAMLOCC-24(@14,@06)                            0264 00249000
         ST    @14,LISTPTR                                         0264 00250000
*  END;                                                    /*@G51DGVS*/ 00251000
@RC00262 DS    0H                                                  0266 00252000
*IF FOUND = YES THEN              /*LET IFCFRAME HANDLE IT NOW*/   0266 00253000
@RF00260 TM    FOUND,B'00001000'                                   0266 00254000
         BNO   @RF00266                                            0266 00255000
* DO A = 1 BY 1 TO LISTNUM;       /*= # OF FRAMES IN THIS SET*/    0267 00256000
         LA    @14,1                                               0267 00257000
         ST    @14,A                                               0267 00258000
         B     @DE00267                                            0267 00259000
@DL00267 DS    0H                                                  0268 00260000
*  RECCCHHR = LISTCCHR(A);        /*MOVE THE ADDRESS OF THE NEXT FRAME* 00261000
         MH    @14,@CH00047                                        0268 00262000
         L     @06,LISTPTR                                         0268 00263000
         ALR   @06,@14                                             0268 00264000
         BCTR  @06,0                                               0268 00265000
         MVC   RECCCHHR(5,R2),LISTCCHR-4(@06)                      0268 00266000
*  CALL IOHND(READIRCT);          /*ASK I/O TO READ THE FRAME RECORD*/  00267000
         L     @15,ADIOHND(,R2)                                    0269 00268000
         LA    @01,@AL00269                                        0269 00269000
         BALR  @14,@15                                             0269 00270000
*  IF R15 = ZERO THEN             /*DID WE GET A GOOD READ DIRECT*/     00271000
         LTR   R15,R15                                             0270 00272000
         BNZ   @RF00270                                            0270 00273000
*   DO;                           /*THEN CONTINUE PROCESSING @G51DGVS*/ 00274000
*    IF LRTKEY1 = 'A0'X THEN      /*IS IT AN MCH FRAME             D*/  00275000
         CLI   LRTKEY1(R7),X'A0'                                   0272 00276000
         BNE   @RF00272                                            0272 00277000
*     MCHFRAME = MCHFRAME + ONE;  /*COUNT THE NUMBER OF THESE READ*/    00278000
         LA    @14,1                                               0273 00279000
         AL    @14,MCHFRAME                                        0273 00280000
         ST    @14,MCHFRAME                                        0273 00281000
*    ELSE                                                          0274 00282000
*     CCHFRAME = CCHFRAME + ONE;  /*THEN MUST BE AN CCH FRAME        */ 00283000
         B     @RC00272                                            0274 00284000
@RF00272 LA    @14,1                                               0274 00285000
         AL    @14,CCHFRAME                                        0274 00286000
         ST    @14,CCHFRAME                                        0274 00287000
*    R5 = R7;                     /*IFCFRAME EXPECTS FRAME ADDRESS IN*/ 00288000
@RC00272 LR    R5,R7                                               0275 00289000
*    R7 = NEWREC;                 /*LOAD 7 WITH ADDR OF THE DATA REC */ 00290000
         L     R7,NEWREC                                           0276 00291000
*    R15 = FRAMEADD;              /*LOAD THE ADDRESS OF IFCFRAME*/ 0277 00292000
         L     R15,FRAMEADD                                        0277 00293000
*    GEN(BALR   R14,R15);                                  /*@VS48732*/ 00294000
         BALR   R14,R15                                                 00295000
*   END;                                                   /*@G51DGVS*/ 00296000
*  ELSE                                                            0280 00297000
*   DO;                                                    /*@G51DGVS*/ 00298000
         B     @RC00270                                            0280 00299000
@RF00270 DS    0H                                                  0281 00300000
*   BADFRAME = BADFRAME + ONE;    /*KEEP TRACK OF BAD DIRECT READS*/    00301000
         LA    @14,1                                               0281 00302000
         AL    @14,BADFRAME                                        0281 00303000
         ST    @14,BADFRAME                                        0281 00304000
*  IF A = LISTNUM & LRTNLAST ^= OFF  THEN                          0282 00305000
         L     @14,LISTPTR                                         0282 00306000
         CLC   A(4),LISTNUM(@14)                                   0282 00307000
         BNE   @RF00282                                            0282 00308000
         TM    LRTNLAST(R7),B'10000000'                            0282 00309000
         BZ    @RF00282                                            0282 00310000
*   DO;                                                    /*@G51DGVS*/ 00311000
*    R5 = ZERO;                   /*TELL DONE THIS FRAME SET AND */     00312000
         SLR   R5,R5                                               0284 00313000
*                                 /*THERE WAS NO END FRAME   @G51DGVS*/ 00314000
*    R15 = FRAMEADD;              /*LOAD THE ADDRESS OF IFCFRAME*/ 0285 00315000
         L     R15,FRAMEADD                                        0285 00316000
*    GEN(BALR   R14,R15);                                  /*@VS48732*/ 00317000
         BALR   R14,R15                                                 00318000
*   END;                                                   /*@G51DGVS*/ 00319000
*  END;                                                    /*@G51DGVS*/ 00320000
@RF00282 DS    0H                                                  0289 00321000
* END;                                                     /*@G51DGVS*/ 00322000
@RC00270 LA    @14,1                                               0289 00323000
         AL    @14,A                                               0289 00324000
         ST    @14,A                                               0289 00325000
@DE00267 L     @06,LISTPTR                                         0289 00326000
         C     @14,LISTNUM(,@06)                                   0289 00327000
         BNH   @DL00267                                            0289 00328000
* ELSE                                                             0290 00329000
* DO;                                                      /*@G51DGVS*/ 00330000
         B     @RC00266                                            0290 00331000
@RF00266 DS    0H                                                  0291 00332000
*    R5 = ZERO;                   /*IFCFRAME NOW KNOWS NOTHING FOUND */ 00333000
         SLR   R5,R5                                               0291 00334000
*    R7 = NEWREC;                 /*LOAD 7 WITH ADDR OF THE DATA REC */ 00335000
         L     R7,NEWREC                                           0292 00336000
*    R15 = FRAMEADD;              /*LOAD THE ADDRESS OF IFCFRAME*/ 0293 00337000
         L     R15,FRAMEADD                                        0293 00338000
*    GEN(BALR  R14,R15);          /*TURN CONTROL OVER TO IFCFRAME*/     00339000
         BALR  R14,R15                                                  00340000
* END;                                                     /*@G51DGVS*/ 00341000
* RESPECIFY (R15) UNRESTRICTED;                            /*@G51DGVS*/ 00342000
*END;                                                      /*@G51DGVS*/ 00343000
@EL00003 DS    0H                                                  0297 00344000
@EF00003 DS    0H                                                  0297 00345000
@ER00003 LM    @14,@12,@SA00003                                    0297 00346000
         BR    @14                                                 0297 00347000
*/********************************************************************/ 00348000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 00349000
*/*    THIS PROC WILL PRINT ALL DEBUG DATA                   @Z427VLS*/ 00350000
*/*     A. COUNT OF EACH TYPE OF RECORD                      @Z427VLS*/ 00351000
*/*     B. COUNT OF THE VARIOUS TYPES OF UNKNOWN RECORDS     @Z427VLS*/ 00352000
*/*     C. COUNT OF THE NUMBER OF TIMES MODULES ARE CALLED AND NOT   */ 00353000
*/*        FOUND                                             @Z427VLS*/ 00354000
*/*     D. COUNT OF THE NUMBER OF TIMES EACH PROC IS CALLED  @Z427VLS*/ 00355000
*/*                                                          @Z427VLS*/ 00356000
*PRTDEBUG: PROC;                                           /*@Z427VLS*/ 00357000
PRTDEBUG STM   @14,@12,@SA00004                                    0298 00358000
* SPACING = TRIPLE;                     /*SET SPACING FOR THREE SPACE*/ 00359000
         MVC   SPACING(1),TRIPLE                                   0299 00360000
* MISINFO1 = MISJUNK;                   /*DEBUG0 HEADING     @Z427VLS*/ 00361000
         MVC   MISINFO1(40),MISJUNK                                0300 00362000
* CALL PRINTIT;                                            /*@Z427VLS*/ 00363000
         BAL   @14,PRINTIT                                         0301 00364000
* SPACING = SINGLE;                                        /*@Z427VLS*/ 00365000
         MVC   SPACING(1),SINGLE                                   0302 00366000
* IF NOEDIT ^= ZERO THEN                                           0303 00367000
         L     @06,NOEDIT                                          0303 00368000
         LTR   @06,@06                                             0303 00369000
         BZ    @RF00303                                            0303 00370000
*   DO;                                                    /*@Z427VLS*/ 00371000
*    BINWORD = ENUMFAIL;                /*SET NUMBER TO CONVERT      */ 00372000
         LH    @06,ENUMFAIL                                        0305 00373000
         ST    @06,BINWORD                                         0305 00374000
*    BNDECNUM = FIVE;                   /*SET NUMBER OF CHARS TO CONV*/ 00375000
         MVC   BNDECNUM(4),@CF00047                                0306 00376000
*    DECADDR = ADDR(COUNT1);            /*SET ADDRESS TO PUT NUMBER  */ 00377000
         LA    @06,COUNT1                                          0307 00378000
         ST    @06,DECADDR                                         0307 00379000
*    CALL CONVBIN;                      /*GO CONVERT THE # TO PRINTAB*/ 00380000
         BAL   @14,CONVBIN                                         0308 00381000
*    PRTL1  =  BLDFAIL;                 /*MOVE THE LINE INTO PRINT LN*/ 00382000
         MVI   PRTL1+53,C' '                                       0309 00383000
         MVC   PRTL1+54(13),PRTL1+53                               0309 00384000
         MVC   PRTL1(53),BLDFAIL                                   0309 00385000
*    CALL PRINTIT;                      /*GO PRINT THE LINE  @Z427VLS*/ 00386000
         BAL   @14,PRINTIT                                         0310 00387000
*    TYPE1 = BLANK;                                        /*@Z427VLS*/ 00388000
         MVC   TYPE1(7),BLANK                                      0311 00389000
*    DO I = 9 BY -1 TO 1;               /*SET CONTROLS TO PRINT #'S  */ 00390000
         LA    @06,9                                               0312 00391000
         ST    @06,I                                               0312 00392000
@DL00312 DS    0H                                                  0313 00393000
*      IF EDITFAIL(I) ^= ZERO THEN                                 0313 00394000
         LR    @03,@06                                             0313 00395000
         SLA   @03,2                                               0313 00396000
         L     @03,EDITFAIL-4(@03)                                 0313 00397000
         LTR   @03,@03                                             0313 00398000
         BZ    @RF00313                                            0313 00399000
*        DO;                                               /*@Z427VLS*/ 00400000
*          TYPE11 = RECNAMES(I);        /*MOVE IN THE REC TYPE       */ 00401000
         MH    @06,@CH00045                                        0315 00402000
         LA    @01,RECNAMES-3(@06)                                 0315 00403000
         MVC   TYPE11(3),0(@01)                                    0315 00404000
*          BINWORD = EDITFAIL(I);       /*NUMBER TO CONVERT TO DEC   */ 00405000
         ST    @03,BINWORD                                         0316 00406000
*          CALL CONVBIN;                /*GO CONVERT THE BIN TO DEC  */ 00407000
         BAL   @14,CONVBIN                                         0317 00408000
*         PRTL1 = BLDFAIL;  /*MOVE REC TYPE + COUNT TO PRT LINE*/  0318 00409000
         MVI   PRTL1+53,C' '                                       0318 00410000
         MVC   PRTL1+54(13),PRTL1+53                               0318 00411000
         MVC   PRTL1(53),BLDFAIL                                   0318 00412000
*          CALL PRINTIT;                /*GO PRINT THE LINE  @Z427VLS*/ 00413000
         BAL   @14,PRINTIT                                         0319 00414000
*        END;                                              /*@Z427VLS*/ 00415000
*    END;                                                  /*@Z427VLS*/ 00416000
@RF00313 SLR   @06,@06                                             0321 00417000
         BCTR  @06,0                                               0321 00418000
         AL    @06,I                                               0321 00419000
         ST    @06,I                                               0321 00420000
         LTR   @06,@06                                             0321 00421000
         BP    @DL00312                                            0321 00422000
*    IF ENUMFAIL ^= ZERO THEN           /* ANY NAMES IN BUFFER       */ 00423000
         LH    @06,ENUMFAIL                                        0322 00424000
         LTR   @06,@06                                             0322 00425000
         BZ    @RF00322                                            0322 00426000
*      DO;                                                 /*@Z427VLS*/ 00427000
*        PRTL2 =  EXPL1;                /*MOVE MESSAGE INTO THE BUFF */ 00428000
         MVC   PRTL2(42),EXPL1                                     0324 00429000
*        CALL PRINTIT;                  /*GO AND DO IT(PRINT)        */ 00430000
         BAL   @14,PRINTIT                                         0325 00431000
*        DO X = ENUMFAIL BY -1 TO 1;                       /*@Z427VLS*/ 00432000
         LH    @06,ENUMFAIL                                        0326 00433000
         ST    @06,X                                               0326 00434000
         B     @DE00326                                            0326 00435000
@DL00326 DS    0H                                                  0327 00436000
*          EDVAR = IDXEDIT(X);          /*SET NAME TO FAILED TYPE    */ 00437000
         LR    @03,@06                                             0327 00438000
         SLA   @03,2                                               0327 00439000
         LA    @01,IDXEDIT-4(@03)                                  0327 00440000
         MVC   EDVAR(4),0(@01)                                     0327 00441000
*          PRTLINE((2 +(9 * X)):(10+(9*X)))=LOADED;        /*@Z427VLS*/ 00442000
         LR    @03,@06                                             0328 00443000
         MH    @03,@CH00108                                        0328 00444000
         LA    @01,PRTLINE+1(@03)                                  0328 00445000
         MVI   8(@01),C' '                                         0328 00446000
         MVC   0(8,@01),LOADED                                     0328 00447000
*        END;                                              /*@Z427VLS*/ 00448000
         BCTR  @06,0                                               0329 00449000
         ST    @06,X                                               0329 00450000
@DE00326 LTR   @06,@06                                             0329 00451000
         BP    @DL00326                                            0329 00452000
*       CALL PRINTIT;                   /*PRINT THE LINE JUST BUILT  */ 00453000
         BAL   @14,PRINTIT                                         0330 00454000
*      END;                                                /*@Z427VLS*/ 00455000
*   END;                                                   /*@Z427VLS*/ 00456000
@RF00322 DS    0H                                                  0333 00457000
* IF NOSUMMRY ^= ZERO THEN              /*DID ANY BUILDL FAIL ON SUM */ 00458000
@RF00303 L     @06,NOSUMMRY                                        0333 00459000
         LTR   @06,@06                                             0333 00460000
         BZ    @RF00333                                            0333 00461000
*   DO;                                                    /*@Z427VLS*/ 00462000
*     TYPE1 = TYPE2;                    /*PUT IN THE SUMMARY NAME    */ 00463000
         MVC   TYPE1(7),TYPE2                                      0335 00464000
*     TYPE3 = TYPE2;                    /*PUT IN THE SUMMARY NAME    */ 00465000
         MVC   TYPE3(7),TYPE2                                      0336 00466000
*     BINWORD = SNUMFAIL ;              /*SET # TO BE CONVERTED      */ 00467000
         LH    @06,SNUMFAIL                                        0337 00468000
         ST    @06,BINWORD                                         0337 00469000
*     BNDECNUM = FIVE;                  /*SET # OF PRINT CHARS TO PRT*/ 00470000
         MVC   BNDECNUM(4),@CF00047                                0338 00471000
*     DECADDR = ADDR(COUNT1);           /*SET ADDRESS OF WHERE TO PUT*/ 00472000
         LA    @06,COUNT1                                          0339 00473000
         ST    @06,DECADDR                                         0339 00474000
*     CALL CONVBIN;                     /*GO CONVERT THE DATA        */ 00475000
         BAL   @14,CONVBIN                                         0340 00476000
*     PRTL1  = BLDFAIL;                 /*MOVE DATA INTO PRINT LINE  */ 00477000
         MVI   PRTL1+53,C' '                                       0341 00478000
         MVC   PRTL1+54(13),PRTL1+53                               0341 00479000
         MVC   PRTL1(53),BLDFAIL                                   0341 00480000
*     CALL PRINTIT;                     /*GO PRINT THE MESSAGE       */ 00481000
         BAL   @14,PRINTIT                                         0342 00482000
*     TYPE1 = BLANK;                    /*SET THE ITEMS TO BLANKS    */ 00483000
         MVC   TYPE1(7),BLANK                                      0343 00484000
*     DO I = 9 BY -1 TO 1;                                 /*@Z427VLS*/ 00485000
         LA    @06,9                                               0344 00486000
         ST    @06,I                                               0344 00487000
@DL00344 DS    0H                                                  0345 00488000
*       IF SUMFAIL(I) ^= ZERO THEN                                 0345 00489000
         LR    @03,@06                                             0345 00490000
         SLA   @03,2                                               0345 00491000
         L     @03,SUMFAIL-4(@03)                                  0345 00492000
         LTR   @03,@03                                             0345 00493000
         BZ    @RF00345                                            0345 00494000
*        DO;                                               /*@Z427VLS*/ 00495000
*          TYPE1 = RECNAMES(I);                            /*@Z427VLS*/ 00496000
         MVI   TYPE1+3,C' '                                        0347 00497000
         MVC   TYPE1+4(3),TYPE1+3                                  0347 00498000
         MH    @06,@CH00045                                        0347 00499000
         LA    @01,RECNAMES-3(@06)                                 0347 00500000
         MVC   TYPE1(3),0(@01)                                     0347 00501000
*          BINWORD = SUMFAIL(I);        /*SET UP # TO BE CONVERTED   */ 00502000
         ST    @03,BINWORD                                         0348 00503000
*          CALL CONVBIN;                /*GO AND CONVERT THE # TO PRT*/ 00504000
         BAL   @14,CONVBIN                                         0349 00505000
*          GEN(MVC  PRTLINE(57),BLDFAIL);                  /*@Z427VLS*/ 00506000
         MVC  PRTLINE(57),BLDFAIL                                       00507000
*          CALL PRINTIT;                                   /*@Z427VLS*/ 00508000
         BAL   @14,PRINTIT                                         0351 00509000
*        END;                                              /*@Z427VLS*/ 00510000
*     END;                                                 /*@Z427VLS*/ 00511000
@RF00345 SLR   @06,@06                                             0353 00512000
         BCTR  @06,0                                               0353 00513000
         AL    @06,I                                               0353 00514000
         ST    @06,I                                               0353 00515000
         LTR   @06,@06                                             0353 00516000
         BP    @DL00344                                            0353 00517000
*    IF SNUMFAIL ^= ZERO THEN            /*ANY NAMES IN TABLE        */ 00518000
         LH    @06,SNUMFAIL                                        0354 00519000
         LTR   @06,@06                                             0354 00520000
         BZ    @RF00354                                            0354 00521000
*      DO;                                                 /*@Z427VLS*/ 00522000
*        PRTL2  =  EXPL1;                /*SET UP LINE TO PRINT      */ 00523000
         MVC   PRTL2(42),EXPL1                                     0356 00524000
*        CALL PRINTIT;                   /*GO AND PRINT IT   @Z427VLS*/ 00525000
         BAL   @14,PRINTIT                                         0357 00526000
*        DO X = SNUMFAIL BY -1 TO 1;                       /*@Z427VLS*/ 00527000
         LH    @06,SNUMFAIL                                        0358 00528000
         ST    @06,X                                               0358 00529000
         B     @DE00358                                            0358 00530000
@DL00358 DS    0H                                                  0359 00531000
*          SUMVAR = IDXSUM(X);           /*MOVE 4 BYTES INTO 8 BYTE  */ 00532000
         LR    @03,@06                                             0359 00533000
         SLA   @03,2                                               0359 00534000
         LA    @01,IDXSUM-4(@03)                                   0359 00535000
         MVC   SUMVAR(4),0(@01)                                    0359 00536000
*          PRTLINE((2+(9 * X)):(10 + (9 * X)))= LOADSUM;   /*@Z427VLS*/ 00537000
         LR    @03,@06                                             0360 00538000
         MH    @03,@CH00108                                        0360 00539000
         LA    @01,PRTLINE+1(@03)                                  0360 00540000
         MVI   8(@01),C' '                                         0360 00541000
         MVC   0(8,@01),LOADSUM                                    0360 00542000
*        END;                                              /*@Z427VLS*/ 00543000
         BCTR  @06,0                                               0361 00544000
         ST    @06,X                                               0361 00545000
@DE00358 LTR   @06,@06                                             0361 00546000
         BP    @DL00358                                            0361 00547000
*       CALL PRINTIT;                    /*GO PRINT THE LINE @Z427VLS*/ 00548000
         BAL   @14,PRINTIT                                         0362 00549000
*      END;                                                /*@Z427VLS*/ 00550000
*   END;                                                   /*@Z427VLS*/ 00551000
@RF00354 DS    0H                                                  0365 00552000
*  DECADDR = ADDR(PRTLINE) + 31;         /*WHERE TO PUT CONVERTED    */ 00553000
@RF00333 LA    @06,PRTLINE                                         0365 00554000
         AL    @06,@CF00042                                        0365 00555000
         ST    @06,DECADDR                                         0365 00556000
*  BNDECNUM = SIX;                       /*COULD BE A HIGH COUNT     */ 00557000
         MVC   BNDECNUM(4),@CF00103                                0366 00558000
*  CALL PRINTIT;                         /*PICK UP BLANK LINE        */ 00559000
         BAL   @14,PRINTIT                                         0367 00560000
* DO I = 1 BY 1 TO 20;            /*PRINT 20 LINES OF DEBUG DATA*/ 0368 00561000
         LA    @06,1                                               0368 00562000
         ST    @06,I                                               0368 00563000
@DL00368 DS    0H                                                  0369 00564000
*        MISINFO = PTDEBUG(I);           /*MOVE THE MESSAGE IN TO LIN*/ 00565000
         LR    @03,@06                                             0369 00566000
         MH    @03,@CH00925                                        0369 00567000
         LA    @01,PTDEBUG-29(@03)                                 0369 00568000
         MVC   MISINFO(29),0(@01)                                  0369 00569000
*        BINWORD = MISCOUNT(I);          /*MOVE IN THE NUMBER TO CON */ 00570000
         SLA   @06,2                                               0370 00571000
         L     @06,MISCOUNT-4(@06)                                 0370 00572000
         ST    @06,BINWORD                                         0370 00573000
*        CALL CONVBIN;                   /*GO CONVERT THE NUMBER     */ 00574000
         BAL   @14,CONVBIN                                         0371 00575000
*        CALL PRINTIT;                   /*GO AND PRINT THE LINE     */ 00576000
         BAL   @14,PRINTIT                                         0372 00577000
*  END;                                                    /*@Z427VLS*/ 00578000
         LA    @06,1                                               0373 00579000
         AL    @06,I                                               0373 00580000
         ST    @06,I                                               0373 00581000
         C     @06,@CF00924                                        0373 00582000
         BNH   @DL00368                                            0373 00583000
*  SPACING = DOUBLE;                                       /*@Z427VLS*/ 00584000
         MVC   SPACING(1),DOUBLE                                   0374 00585000
*  CALL PRINTIT;                                           /*@Z427VLS*/ 00586000
         BAL   @14,PRINTIT                                         0375 00587000
*  SPACING = SINGLE;                                       /*@Z427VLS*/ 00588000
         MVC   SPACING(1),SINGLE                                   0376 00589000
*  DECADDR = ADDR(RNUMBER);              /*WHERE TO PUT THE MESSAGE  */ 00590000
         LA    @06,RNUMBER                                         0377 00591000
         ST    @06,DECADDR                                         0377 00592000
*  BNDECNUM = FIVE;                                        /*@Z427VLS*/ 00593000
         MVC   BNDECNUM(4),@CF00047                                0378 00594000
*  DO I = 1 BY 1 TO 9;                  /* DO 9 TYPES OF RECORDS     */ 00595000
         LA    @06,1                                               0379 00596000
         ST    @06,I                                               0379 00597000
@DL00379 DS    0H                                                  0380 00598000
*    IF COUNTTBL(I) ^= ZERO  THEN       /*IF WE HAVE SOMETHING PRINT */ 00599000
         LR    @03,@06                                             0380 00600000
         SLA   @03,2                                               0380 00601000
         L     @03,COUNTTBL-4(@03)                                 0380 00602000
         LTR   @03,@03                                             0380 00603000
         BZ    @RF00380                                            0380 00604000
*      DO;                                                 /*@Z427VLS*/ 00605000
*       BINWORD = COUNTTBL(I);          /*MOVE # TO CONVERT WORD     */ 00606000
         ST    @03,BINWORD                                         0382 00607000
*       RTYP  = RECNAMES(I);            /*MOVE RECORD TYPE INTO FIELD*/ 00608000
         MH    @06,@CH00045                                        0383 00609000
         LA    @03,RECNAMES-3(@06)                                 0383 00610000
         MVC   RTYP(3),0(@03)                                      0383 00611000
*       CALL CONVBIN;                   /*GO CONVERT THE COUNT TO PRT*/ 00612000
         BAL   @14,CONVBIN                                         0384 00613000
*       PRTLINE = DBUG01;               /*MOVE THE LINE TO PRINT BUFF*/ 00614000
         MVI   PRTLINE+53,C' '                                     0385 00615000
         MVC   PRTLINE+54(78),PRTLINE+53                           0385 00616000
         MVC   PRTLINE(53),DBUG01                                  0385 00617000
*       CALL PRINTIT;                   /*GO PRINT THE LINE  @Z427VLS*/ 00618000
         BAL   @14,PRINTIT                                         0386 00619000
*      END;                                                /*@Z427VLS*/ 00620000
*  END;                                                    /*@Z427VLS*/ 00621000
@RF00380 LA    @06,1                                               0388 00622000
         AL    @06,I                                               0388 00623000
         ST    @06,I                                               0388 00624000
         C     @06,@CF00108                                        0388 00625000
         BNH   @DL00379                                            0388 00626000
*GENERATE DATA;                                            /*@Z427VLS*/ 00627000
*END;                                                      /*@Z427VLS*/ 00628000
@EL00004 DS    0H                                                  0390 00629000
@EF00004 DS    0H                                                  0390 00630000
@ER00004 LM    @14,@12,@SA00004                                    0390 00631000
         BR    @14                                                 0390 00632000
*/********************************************************************/ 00633000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 00634000
*/*    THIS PROC WILL CONVERT THE NUMBER IN ITEM BINWORD TO PRINT    */ 00635000
*/*    IF NUMBER IS > THAN NUMBER OF CHARACTERS REQUESTED A 9        */ 00636000
*/*    WILL BE PLACED IN ALL LOCATION                        @Z427VLS*/ 00637000
*/*            ITEM BINWORD  = NUMBER TO CONVERT TO DECIMAL  @Z427VLS*/ 00638000
*/*            ITEM BNDECNUM = NUMBER OF CHARACTERS IN OUTPUT MAX(8) */ 00639000
*/*            ITEM DECADDR  = ADDRESS TO PUT THE PRINTABLE BYTES    */ 00640000
* RESPECIFY (R6,R8,R9) RESTRICTED;                         /*@Z427VLS*/ 00641000
*/*                                                          @Z427VLS*/ 00642000
* CONVBIN:  PROC;                                          /*@Z427VLS*/ 00643000
CONVBIN  STM   @14,@12,@SA00005                                    0392 00644000
*  R8 = BINWORD;                             /*PICK UP NUMBER TO CONV*/ 00645000
         L     R8,BINWORD                                          0393 00646000
*  GEN(CVD   R8,DBLWORK);         /*CONVERT THE BINARY NUMBER        */ 00647000
         CVD   R8,DBLWORK                                               00648000
*  GEN(UNPK    WORK(8),DBLWORK(8));                        /*@Z427VLS*/ 00649000
         UNPK    WORK(8),DBLWORK(8)                                     00650000
*  GEN(OI   WORK+7,X'F0');                                 /*@Z427VLS*/ 00651000
         OI   WORK+7,X'F0'                                              00652000
*  SWITCH1 = OFF;                                          /*@Z427VLS*/ 00653000
         NI    SWITCH1,B'01111111'                                 0397 00654000
*  DO K = 1 BY 1 TO 7 WHILE (SWITCH1 = OFF);               /*@Z427VLS*/ 00655000
         LA    @03,1                                               0398 00656000
         ST    @03,K                                               0398 00657000
@DL00398 TM    SWITCH1,B'10000000'                                 0398 00658000
         BNZ   @DC00398                                            0398 00659000
*   IF WORKOVER(K) = 'F0'X                                         0399 00660000
*     THEN                                                         0399 00661000
         LA    @01,WORKOVER-1(@03)                                 0399 00662000
         CLI   0(@01),X'F0'                                        0399 00663000
         BNE   @RF00399                                            0399 00664000
*       WORKOVER(K) = '40'X;                               /*@Z427VLS*/ 00665000
         LA    @01,WORKOVER-1(@03)                                 0400 00666000
         MVI   0(@01),X'40'                                        0400 00667000
*     ELSE                                                         0401 00668000
*       SWITCH1 = ON;                                      /*@Z427VLS*/ 00669000
         B     @RC00399                                            0401 00670000
@RF00399 OI    SWITCH1,B'10000000'                                 0401 00671000
*  END;                                                    /*@Z427VLS*/ 00672000
@RC00399 LA    @03,1                                               0402 00673000
         AL    @03,K                                               0402 00674000
         ST    @03,K                                               0402 00675000
         C     @03,@CF00105                                        0402 00676000
         BNH   @DL00398                                            0402 00677000
@DC00398 DS    0H                                                  0403 00678000
*  IF (TEN  -K) > BNDECNUM        /*WAS NUMBER LARGER THAN EXPECTED  */ 00679000
*   THEN                                                           0403 00680000
         LA    @03,10                                              0403 00681000
         SL    @03,K                                               0403 00682000
         C     @03,BNDECNUM                                        0403 00683000
         BNH   @RF00403                                            0403 00684000
*     DO;                                                  /*@Z427VLS*/ 00685000
*        GEN(MVI  WORKOVER,X'F9');/*MOVE CHAR 9 INTO OUTPUT  @Z427VLS*/ 00686000
         MVI  WORKOVER,X'F9'                                            00687000
*        GEN(MVC  WORKOVER+1(7),WORKOVER);/*MAKE ENTIRE LINE F9      */ 00688000
         MVC  WORKOVER+1(7),WORKOVER                                    00689000
*     END;                                                 /*@Z427VLS*/ 00690000
*  R8 = ADDR(WORKOVER)+ (EIGHT-BNDECNUM); /* MOVE FROM       @Z427VLS*/ 00691000
@RF00403 LA    R8,WORKOVER                                         0408 00692000
         L     @03,BNDECNUM                                        0408 00693000
         LA    @15,8                                               0408 00694000
         SLR   @15,@03                                             0408 00695000
         ALR   R8,@15                                              0408 00696000
*  R9 = BNDECNUM -1;          /*CORRECT FOR EX DOING MVC # WOULD BE  */ 00697000
         BCTR  @03,0                                               0409 00698000
         LR    R9,@03                                              0409 00699000
*                             /*1 HIGHER THAN THE COMPLIED MVC       */ 00700000
*  R6 = DECADDR;                                           /*@Z427VLS*/ 00701000
         L     R6,DECADDR                                          0410 00702000
*  GEN(EX   R9,MVCINS);       /*DO MOVE USING LENGTH IN R9   @Z427VLS*/ 00703000
         EX   R9,MVCINS                                                 00704000
*  GENERATE DATA;                                          /*@Z427VLS*/ 00705000
*  RESPECIFY (R6) UNRESTRICTED;                            /*@Z427VLS*/ 00706000
*END;                                                      /*@Z427VLS*/ 00707000
@EL00005 DS    0H                                                  0414 00708000
@EF00005 DS    0H                                                  0414 00709000
@ER00005 LM    @14,@12,@SA00005                                    0414 00710000
         BR    @14                                                 0414 00711000
*/********************************************************************/ 00712000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 00713000
*/*    THIS PROC WILL SET THE ADDRESS OF THE PRINT LINE INTO THE     */ 00714000
*/*    COMMUNATION TABLE FOR THE I/O SECTION CALL THE SECTION TO     */ 00715000
*/*    PRINT THE LINE THE RESTORE THE LINE TO BLANKS         @Z427VLS*/ 00716000
*/*                                                          @Z427VLS*/ 00717000
*PRINTIT: PROC;                                            /*@Z427VLS*/ 00718000
PRINTIT  STM   @14,@12,@SA00006                                    0415 00719000
* PRINTADR = ADDR(PRTLINE1);            /*SET UP COMM TABLE WITH ADDR*/ 00720000
         LA    @06,PRTLINE1                                        0416 00721000
         ST    @06,PRINTADR(,R2)                                   0416 00722000
* CALL IOHND(RITEPRTR);              /*SET UP THE ADDRESS OF LINE */    00723000
         L     @15,ADIOHND(,R2)                                    0417 00724000
         LA    @01,@AL00417                                        0417 00725000
         BALR  @14,@15                                             0417 00726000
*END;                                                      /*@Z427VLS*/ 00727000
@EL00006 DS    0H                                                  0418 00728000
@EF00006 DS    0H                                                  0418 00729000
@ER00006 LM    @14,@12,@SA00006                                    0418 00730000
         BR    @14                                                 0418 00731000
*/********************************************************************/ 00732000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 00733000
*/*    THIS PROC WILL PRINT OUT THE INFORMATION REQUIRED TO CLEAN UP */ 00734000
*/*     A. IF A RECORD TYPE REQUESTED AND NOT FOUND USER IS TOLD     */ 00735000
*/*     B. A COUNT OF EACH TYPE OF RECORD IS PRINTED         @Z427VLS*/ 00736000
*/*                                                          @Z427VLS*/ 00737000
*PRINTTUR:   PROC;                                         /*@Z427VLS*/ 00738000
PRINTTUR STM   @14,@12,@SA00007                                    0419 00739000
* CALL PRINTIT;                                            /*@Z427VLS*/ 00740000
         BAL   @14,PRINTIT                                         0420 00741000
* R8 = ZERO;                            /*SET UP THE REGISTERS       */ 00742000
         SLR   R8,R8                                               0421 00743000
* R9 = RECTYPE;                         /*TYPES OF RECORDS REQUESTED */ 00744000
         LH    R9,RECTYPE(,R2)                                     0422 00745000
         N     R9,@CF01399                                         0422 00746000
* SLL(R9,16);                           /*POSITION IN REG FOR SHIFT  */ 00747000
         SLL   R9,16                                               0423 00748000
* DO I = 1 BY  1 TO 9 ;                 /*SET UP CONTROLS FOR PRINT  */ 00749000
         LA    @06,1                                               0424 00750000
         ST    @06,I                                               0424 00751000
@DL00424 DS    0H                                                  0425 00752000
*  SLDL(R8,ONE);                        /*MOVE THE FIRST BIT OVER    */ 00753000
         SLDL  R8,1                                                0425 00754000
*  IF R8 = ON & RTYPCT(I)   = ZERO      /*ANY THING FOUND DURING RUN */ 00755000
*    THEN                                                          0426 00756000
         C     R8,@CF00082                                         0426 00757000
         BNE   @RF00426                                            0426 00758000
         SLA   @06,2                                               0426 00759000
         L     @06,RTYPCT-4(@06)                                   0426 00760000
         LTR   @06,@06                                             0426 00761000
         BNZ   @RF00426                                            0426 00762000
*     DO;                                                  /*@Z427VLS*/ 00763000
*     CALL IFCMSG(81,ADDR(PRTLINE)); /*GO LOAD NEEDED MESSAGE TO PRINT* 00764000
         LA    @06,PRTLINE                                         0428 00765000
         ST    @06,@AFTEMPS+4                                      0428 00766000
         L     @15,ADIFCMSG(,R2)                                   0428 00767000
         LA    @01,@AL00428                                        0428 00768000
         BALR  @14,@15                                             0428 00769000
*      MISSNAME = RECNAMES(I);          /*MOVE IN THE RECORD TYPE    */ 00770000
         L     @06,I                                               0429 00771000
         MH    @06,@CH00045                                        0429 00772000
         LA    @03,RECNAMES-3(@06)                                 0429 00773000
         MVC   MISSNAME(3),0(@03)                                  0429 00774000
*      CALL  PRINTIT;                                      /*@Z427VLS*/ 00775000
         BAL   @14,PRINTIT                                         0430 00776000
*     END;                                                 /*@Z427VLS*/ 00777000
*  R8 = ZERO;                           /*CLEAR BEFOR CONT   @Z427VLS*/ 00778000
@RF00426 SLR   R8,R8                                               0432 00779000
* END;                                                     /*@Z427VLS*/ 00780000
         LA    @06,1                                               0433 00781000
         AL    @06,I                                               0433 00782000
         ST    @06,I                                               0433 00783000
         C     @06,@CF00108                                        0433 00784000
         BNH   @DL00424                                            0433 00785000
* SPACING = DOUBLE;                                        /*@Z427VLS*/ 00786000
         MVC   SPACING(1),DOUBLE                                   0434 00787000
* CALL PRINTIT;                                            /*@Z427VLS*/ 00788000
         BAL   @14,PRINTIT                                         0435 00789000
* SPACING = SINGLE;                                        /*@Z427VLS*/ 00790000
         MVC   SPACING(1),SINGLE                                   0436 00791000
*  DECADDR = ADDR(UNUMBER);             /*WHERE TO PUT CONVERTED #   */ 00792000
         LA    @06,UNUMBER                                         0437 00793000
         ST    @06,DECADDR                                         0437 00794000
* BNDECNUM = 6; /*NUMBER OF CHARACTERS FROM BINARY ITEM      @G51DGVS*/ 00795000
         MVC   BNDECNUM(4),@CF00103                                0438 00796000
*  DO I = 1 BY 1 TO 10;                 /* DO 9 TYPES OF RECORDS     */ 00797000
         LA    @06,1                                               0439 00798000
         ST    @06,I                                               0439 00799000
@DL00439 DS    0H                                                  0440 00800000
*                                     /*+ 1 FOR UKNOWN TYPES @Z427VLS*/ 00801000
*    IF RTYPCT(I) ^= ZERO  THEN       /*IF WE HAVE SOMETHING PRINT */   00802000
         SLA   @06,2                                               0440 00803000
         L     @06,RTYPCT-4(@06)                                   0440 00804000
         LTR   @06,@06                                             0440 00805000
         BZ    @RF00440                                            0440 00806000
*      DO;                                                 /*@Z427VLS*/ 00807000
*     CALL IFCMSG(52,ADDR(PRTLINE)); /*GO LOAD NEEDED MESSAGE TO PRINT* 00808000
         LA    @06,PRTLINE                                         0442 00809000
         ST    @06,@AFTEMPS+4                                      0442 00810000
         L     @15,ADIFCMSG(,R2)                                   0442 00811000
         LA    @01,@AL00442                                        0442 00812000
         BALR  @14,@15                                             0442 00813000
*       BINWORD = RTYPCT(I);            /*MOVE # TO CONVERT WORD     */ 00814000
         L     @06,I                                               0443 00815000
         LR    @03,@06                                             0443 00816000
         SLA   @03,2                                               0443 00817000
         L     @03,RTYPCT-4(@03)                                   0443 00818000
         ST    @03,BINWORD                                         0443 00819000
*       RTYPS = RECNAMES(I);            /*MOVE RECORD TYPE INTO FIELD*/ 00820000
         MH    @06,@CH00045                                        0444 00821000
         LA    @03,RECNAMES-3(@06)                                 0444 00822000
         MVC   RTYPS(3),0(@03)                                     0444 00823000
*       CALL CONVBIN;                   /*GO CONVERT THE COUNT TO PRT*/ 00824000
         BAL   @14,CONVBIN                                         0445 00825000
*       CALL PRINTIT;                   /*GO PRINT THE LINE  @Z427VLS*/ 00826000
         BAL   @14,PRINTIT                                         0446 00827000
*      END;                                                /*@Z427VLS*/ 00828000
*  END;                                                    /*@Z427VLS*/ 00829000
@RF00440 LA    @06,1                                               0448 00830000
         AL    @06,I                                               0448 00831000
         ST    @06,I                                               0448 00832000
         C     @06,@CF00034                                        0448 00833000
         BNH   @DL00439                                            0448 00834000
* CALL PRINTIT;                         /*SPACE BETWEEN PRINT OUTS   */ 00835000
         BAL   @14,PRINTIT                                         0449 00836000
*IF BADRECRD ^= ZERO | BADFRAME ^= ZERO THEN                       0450 00837000
         SLR   @06,@06                                             0450 00838000
         C     @06,BADRECRD                                        0450 00839000
         BNE   @RT00450                                            0450 00840000
         C     @06,BADFRAME                                        0450 00841000
         BE    @RF00450                                            0450 00842000
@RT00450 DS    0H                                                  0451 00843000
*  DO;                                                     /*@Z427VLS*/ 00844000
*   CALL IFCMSG(82,ADDR(PRTLINE)); /*GO LOAD NEEDED MESSAGE TO PRINT*/  00845000
         LA    @06,PRTLINE                                         0452 00846000
         ST    @06,@AFTEMPS+4                                      0452 00847000
         L     @15,ADIFCMSG(,R2)                                   0452 00848000
         LA    @01,@AL00452                                        0452 00849000
         BALR  @14,@15                                             0452 00850000
*  BINWORD = BADRECRD + BADFRAME;                          /*@G51DGVS*/ 00851000
         L     @06,BADRECRD                                        0453 00852000
         AL    @06,BADFRAME                                        0453 00853000
         ST    @06,BINWORD                                         0453 00854000
*   DECADDR = ADDR(NUMFAIL);                               /*@Z427VLS*/ 00855000
         LA    @06,NUMFAIL                                         0454 00856000
         ST    @06,DECADDR                                         0454 00857000
*   BNDECNUM = SIX;                                        /*@Z427VLS*/ 00858000
         MVC   BNDECNUM(4),@CF00103                                0455 00859000
*   CALL CONVBIN;                                          /*@Z427VLS*/ 00860000
         BAL   @14,CONVBIN                                         0456 00861000
*   CALL PRINTIT;                                          /*@Z427VLS*/ 00862000
         BAL   @14,PRINTIT                                         0457 00863000
*  END;                                                    /*@Z427VLS*/ 00864000
* RESPECIFY (R8,R9) UNRESTRICTED;                          /*@Z427VLS*/ 00865000
*END;                                                      /*@Z427VLS*/ 00866000
@EL00007 DS    0H                                                  0460 00867000
@EF00007 DS    0H                                                  0460 00868000
@ER00007 LM    @14,@12,@SA00007                                    0460 00869000
         BR    @14                                                 0460 00870000
*/********************************************************************/ 00871000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 00872000
*/*    THIS PROC WILL MODIFY THE CUA IF IT IS A MCH OR AN OBR        */ 00873000
*/*                                                          @Z427VLS*/ 00874000
*CUAMOD:  PROC;                                            /*@Z427VLS*/ 00875000
CUAMOD   STM   @14,@12,12(@13)                                     0461 00876000
*SWITCH1 = OFF;                         /* CLEAR SWITCH(DON'T EDIT)  */ 00877000
         NI    SWITCH1,B'01111111'                                 0462 00878000
*  IF (LRTKEY1 & 'F0'X) = '90'X         /*IS THIS A MCH RECORD       */ 00879000
*   THEN                                /*YES IT IS          @Z427VLS*/ 00880000
         MVC   @TS00001(1),LRTKEY1(R7)                             0463 00881000
         NI    @TS00001,X'F0'                                      0463 00882000
         CLI   @TS00001,X'90'                                      0463 00883000
         BNE   @RF00463                                            0463 00884000
*    TPRCUA =( TPRCUA & '0FFF'X);       /*DROP EXTRA BITS FROM CUA   */ 00885000
         NC    TPRCUA(2,R7),@CB01289                               0464 00886000
*   ELSE                                                           0465 00887000
*    DO;                               /*NOT MCH TRY OBR     @Z427VLS*/ 00888000
         B     @RC00463                                            0465 00889000
@RF00463 DS    0H                                                  0466 00890000
*     IF (OBRKEY1 & 'F0'X) = '30'X THEN /*IS RECORD AN OBR   @Z427VLS*/ 00891000
         MVC   @TS00001(1),OBRKEY1(R7)                             0466 00892000
         NI    @TS00001,X'F0'                                      0466 00893000
         CLI   @TS00001,X'30'                                      0466 00894000
         BNE   @RF00466                                            0466 00895000
*      DO;                                                 /*@Z427VLS*/ 00896000
*       IF SHORTSW = ON   THEN          /*IS IT A SHORT OBR  @Z427VLS*/ 00897000
         TM    SHORTSW(R7),B'00100000'                             0468 00898000
         BNO   @RF00468                                            0468 00899000
*        DO;                                               /*@Z427VLS*/ 00900000
*         OBRSCUA = (OBRSCUA & '000FFF'X);/*MOD THE CUA      @Z427VLS*/ 00901000
         NC    OBRSCUA(3,R7),@CB01291                              0470 00902000
*         IF SHORTOBR = OFF             /*DO WE PROCESS SHORT OBR'S  */ 00903000
*          THEN                                                    0471 00904000
         TM    SHORTOBR(R2),B'00100000'                            0471 00905000
         BNZ   @RF00471                                            0471 00906000
*           SWITCH1 = ON;               /*SET DON'T EDIT SWITCH      */ 00907000
         OI    SWITCH1,B'10000000'                                 0472 00908000
*        END;                                              /*@Z427VLS*/ 00909000
*       ELSE                                                       0474 00910000
*       OBRSECUA = (OBRSECUA & '000FFF'X);/*MODIFY THE CUA   @Z427VLS*/ 00911000
         B     @RC00468                                            0474 00912000
@RF00468 NC    OBRSECUA(3,R7),@CB01291                             0474 00913000
*      END;                                                /*@Z427VLS*/ 00914000
@RC00468 DS    0H                                                  0476 00915000
*    END;                                                  /*@Z427VLS*/ 00916000
@RF00466 DS    0H                                                  0477 00917000
*CUAMODCT = CUAMODCT + NUMBER1;         /*COUNT NUMBER OF TIMES IN   */ 00918000
@RC00463 LA    @06,1                                               0477 00919000
         AL    @06,CUAMODCT                                        0477 00920000
         ST    @06,CUAMODCT                                        0477 00921000
*END;                                                      /*@Z427VLS*/ 00922000
@EL00008 DS    0H                                                  0478 00923000
@EF00008 DS    0H                                                  0478 00924000
@ER00008 LM    @14,@12,12(@13)                                     0478 00925000
         BR    @14                                                 0478 00926000
*/********************************************************************/ 00927000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 00928000
*/*   THIS PROC WILL PROCESS ANY MACHINE CHECK RECORD IT WILL        */ 00929000
*/*   BUILD THE EDIT TABLE NAME + THE SUMMARY TABLE NAME     @Z427VLS*/ 00930000
*RECISMCH: PROC;                                           /*@Z427VLS*/ 00931000
RECISMCH STM   @14,@12,@SA00009                                    0479 00932000
*MCHCOUNT = MCHCOUNT + NUMBER1;         /*KEEP TRACK OF NUMBER TIMES */ 00933000
         LA    @06,1                                               0480 00934000
         AL    @06,MCHCOUNT                                        0480 00935000
         ST    @06,MCHCOUNT                                        0480 00936000
*                                       /*THE PROC IS CALLED @Z427VLS*/ 00937000
*R4 = CURTABPT;                                            /*@Z427VLS*/ 00938000
         L     R4,CURTABPT                                         0481 00939000
*NUMBER = TWO;                          /*SET UP TO CONVERT 2 CHARS  */ 00940000
         MVC   NUMBER(4),@CF00098                                  0482 00941000
*NEXTBY = ADDR(ENTRYA);                 /*SET ADDRESS OF # TO CONVERT*/ 00942000
         LA    @06,ENTRYA(,R4)                                     0483 00943000
         ST    @06,NEXTBY                                          0483 00944000
*ADDNXT = ADDR(NAME);                   /*WHERE TO PUT THE DATA      */ 00945000
         LA    @06,NAME                                            0484 00946000
         ST    @06,ADDNXT                                          0484 00947000
*CALL CONVERT;                          /*GO CONVERT THE DATA        */ 00948000
         BAL   @14,CONVERT                                         0485 00949000
*END;                                                      /*@Z427VLS*/ 00950000
@EL00009 DS    0H                                                  0486 00951000
@EF00009 DS    0H                                                  0486 00952000
@ER00009 LM    @14,@12,@SA00009                                    0486 00953000
         BR    @14                                                 0486 00954000
*/********************************************************************/ 00955000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 00956000
*/*   THIS PROC WILL PROCESS ANY CHANNEL CHECK RECORD, IT WILL BUILT */ 00957000
*/*   BOTH THE EDIT AND SUMMARY  TABLES                      @Z427VLS*/ 00958000
*/*                                                          @Z427VLS*/ 00959000
*RECISCCH:   PROC;                                         /*@Z427VLS*/ 00960000
RECISCCH STM   @14,@12,@SA00010                                    0487 00961000
*R4 = CURTABPT;                                            /*@Z427VLS*/ 00962000
         L     R4,CURTABPT                                         0488 00963000
*CCHCOUNT = CCHCOUNT + NUMBER1;         /*KEEP TRACK OF TIMES CALLED */ 00964000
         LA    @06,1                                               0489 00965000
         AL    @06,CCHCOUNT                                        0489 00966000
         ST    @06,CCHCOUNT                                        0489 00967000
*NAME = UKNOCCH;                        /*SET TO UKNOWN TYPE CCH REC */ 00968000
         MVC   NAME(4),UKNOCCH                                     0490 00969000
*IF ENTRYA > '0114'X &            /* IS IT WITHIN THE RANGE  @G51DGVS*/ 00970000
*   ENTRYA < '0159'X  THEN              /*IS IT A VALID MODEL FROM   */ 00971000
         CLC   ENTRYA(2,R4),@CB01301                               0491 00972000
         BNH   @RF00491                                            0491 00973000
         CLC   ENTRYA(2,R4),@CB01302                               0491 00974000
         BNL   @RF00491                                            0491 00975000
* DO;                                                      /*@Z427VLS*/ 00976000
* NUMBER = TWO;                         /*CONVERT 2 BYTES    @Z427VLS*/ 00977000
         MVC   NUMBER(4),@CF00098                                  0493 00978000
* NEXTBY   = ADDR(ENTRYA);              /*SET UP ADDRESS OF DATA     */ 00979000
         LA    @06,ENTRYA(,R4)                                     0494 00980000
         ST    @06,NEXTBY                                          0494 00981000
*   ADDNXT = ADDR(NAME);                /*SET UP ADDRESS TO PUT DATA */ 00982000
         LA    @06,NAME                                            0495 00983000
         ST    @06,ADDNXT                                          0495 00984000
* CALL CONVERT;                         /*CONVERT TO PRINT   @Z427VLS*/ 00985000
         BAL   @14,CONVERT                                         0496 00986000
* GEN(MVI  NAME,X'C9');                 /*MAKE THE FIRST LETTER A I  */ 00987000
         MVI  NAME,X'C9'                                                00988000
* END;                                                     /*@Z427VLS*/ 00989000
* ELSE                                                             0499 00990000
*  DO;                                                     /*@Z427VLS*/ 00991000
         B     @RC00491                                            0499 00992000
@RF00491 DS    0H                                                  0500 00993000
*   IF CCHID = '05'X                                               0500 00994000
*     THEN                                                         0500 00995000
         CLI   CCHID(R7),X'05'                                     0500 00996000
         BNE   @RF00500                                            0500 00997000
*       NAME = C2860 ;                  /*THEN SET THE CHANNEL NAME  */ 00998000
         MVC   NAME(4),C2860                                       0501 00999000
*   ELSE                                                           0502 01000000
*   IF CCHID = '06'X                    /*IS CHANNEL A 2870  @Z427VLS*/ 01001000
*     THEN                                                         0502 01002000
         B     @RC00500                                            0502 01003000
@RF00500 CLI   CCHID(R7),X'06'                                     0502 01004000
         BNE   @RF00502                                            0502 01005000
*       NAME = C2870;                   /*SET CHANNEL NAME TO 2870   */ 01006000
         MVC   NAME(4),C2870                                       0503 01007000
*   ELSE                                                           0504 01008000
*   IF CCHID = '07'X | CCHID = '08'X    /*IS CHANNEL A 2870  @Z427VLS*/ 01009000
*     THEN                                                         0504 01010000
         B     @RC00502                                            0504 01011000
@RF00502 CLI   CCHID(R7),X'07'                                     0504 01012000
         BE    @RT00504                                            0504 01013000
         CLI   CCHID(R7),X'08'                                     0504 01014000
         BNE   @RF00504                                            0504 01015000
@RT00504 DS    0H                                                  0505 01016000
*       NAME = C2880;                                      /*@Z427VLS*/ 01017000
         MVC   NAME(4),C2880                                       0505 01018000
*  END;                                                    /*@Z427VLS*/ 01019000
@RF00504 DS    0H                                                  0506 01020000
@RC00502 DS    0H                                                  0506 01021000
@RC00500 DS    0H                                                  0507 01022000
* IF NAME = UKNOCCH                     /*KEEP TRACK OF UNKNOWN TYPE*/  01023000
*   THEN                                                           0507 01024000
@RC00491 CLC   NAME(4),UKNOCCH                                     0507 01025000
         BNE   @RF00507                                            0507 01026000
*     UKCCOUNT = UKCCOUNT + NUMBER1;    /*INCREMENT THE COUNT BY 1   */ 01027000
         LA    @06,1                                               0508 01028000
         AL    @06,UKCCOUNT                                        0508 01029000
         ST    @06,UKCCOUNT                                        0508 01030000
*END;                                                      /*@Z427VLS*/ 01031000
@EL00010 DS    0H                                                  0509 01032000
@EF00010 DS    0H                                                  0509 01033000
@ER00010 LM    @14,@12,@SA00010                                    0509 01034000
         BR    @14                                                 0509 01035000
*/********************************************************************/ 01036000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01037000
*/*    THIS PROC WILL PROCESS ALL OBR TYPE RECORDS AND WILL BUILD    */ 01038000
*/*    EDIT AND SUMMARY TABLE NAME FOR DIFFERENT PROC TO LOAD        */ 01039000
*/*                                                          @Z427VLS*/ 01040000
*RESPECIFY (R8) RESTRICTED;                                /*@Z427VLS*/ 01041000
*RECISOBR:   PROC;                                         /*@Z427VLS*/ 01042000
RECISOBR STM   @14,@12,@SA00011                                    0511 01043000
*OBRCOUNT = OBRCOUNT + NUMBER1;         /*ADD ONE TO THE OBR COUNT   */ 01044000
         LA    @09,1                                               0512 01045000
         L     @06,OBRCOUNT                                        0512 01046000
         ALR   @06,@09                                             0512 01047000
         ST    @06,OBRCOUNT                                        0512 01048000
*NAME = UKNOO;                          /*SET NAME TO UKNOWN FIRST   */ 01049000
         MVC   NAME(4),UKNOO                                       0513 01050000
*OBRCDE2 = OBRDEV;                                         /*@Z427VLS*/ 01051000
         MVC   OBRCDE2(2),OBRDEV(R7)                               0514 01052000
*IF  SHORTSW = ON                       /*IS IT A SHORT OBR  @Z427VLS*/ 01053000
* THEN                                                             0515 01054000
         TM    SHORTSW(R7),B'00100000'                             0515 01055000
         BNO   @RF00515                                            0515 01056000
*  DO;                                                     /*@Z427VLS*/ 01057000
*  OBRCDE2 = OBRSDEV2;                  /*CHANGE TO SHORT FORMAT     */ 01058000
         MVC   OBRCDE2(2),OBRSDEV2(R7)                             0517 01059000
*  OBRSHORT = OBRSHORT + ONE;                              /*@Z427VLS*/ 01060000
         AL    @09,OBRSHORT                                        0518 01061000
         ST    @09,OBRSHORT                                        0518 01062000
*  END;                                                    /*@Z427VLS*/ 01063000
*IF OBRKEY1 = '36'X                     /*TEST FOR VTAM RECORD       */ 01064000
* THEN                                                             0520 01065000
@RF00515 CLI   OBRKEY1(R7),X'36'                                   0520 01066000
         BNE   @RF00520                                            0520 01067000
*  DO;                                                     /*@Z427VLS*/ 01068000
*  NAME = CAXXX;                        /*SET NAME FOR VTAM  @Z427VLS*/ 01069000
         MVC   NAME(4),CAXXX                                       0522 01070000
*  END;                                                    /*@Z427VLS*/ 01071000
* ELSE                                                             0524 01072000
*   DO;                                                    /*@Z427VLS*/ 01073000
         B     @RC00520                                            0524 01074000
@RF00520 DS    0H                                                  0525 01075000
*    IF OBRKEY1 = '34'X                 /*TEST FOR TCRM RECORD       */ 01076000
*     THEN                                                         0525 01077000
         CLI   OBRKEY1(R7),X'34'                                   0525 01078000
         BNE   @RF00525                                            0525 01079000
*      DO;                                                 /*@Z427VLS*/ 01080000
*      NAME = CXXXX;                    /*SET NAME FOR TCRM RECORD   */ 01081000
         MVC   NAME(4),CXXXX                                       0527 01082000
*      END;                                                /*@Z427VLS*/ 01083000
*     ELSE                                                         0529 01084000
*     DO;                                                  /*@Z427VLS*/ 01085000
         B     @RC00525                                            0529 01086000
@RF00525 DS    0H                                                  0530 01087000
*     IF OBRKEY1 = '32'X &                                         0530 01088000
*        (OBRTCAM & '0F'X) = '0F'X THEN                            0530 01089000
         CLI   OBRKEY1(R7),X'32'                                   0530 01090000
         BNE   @RF00530                                            0530 01091000
         MVC   @TS00001(1),OBRTCAM(R7)                             0530 01092000
         NI    @TS00001,X'0F'                                      0530 01093000
         CLI   @TS00001,X'0F'                                      0530 01094000
         BNE   @RF00530                                            0530 01095000
*      NAME = CXXXX;                                       /*@Z427VLS*/ 01096000
         MVC   NAME(4),CXXXX                                       0531 01097000
*     ELSE                                                         0532 01098000
*      DO;                                                 /*@Z427VLS*/ 01099000
         B     @RC00530                                            0532 01100000
@RF00530 DS    0H                                                  0533 01101000
*       IF OBRCLSS = '40'X & OBRCDE2 ^= '40F1'X THEN               0533 01102000
         CLI   OBRCLSS,X'40'                                       0533 01103000
         BNE   @RF00533                                            0533 01104000
         CLC   OBRCDE2(2),@CB01314                                 0533 01105000
         BE    @RF00533                                            0533 01106000
*         OBRTTYP = (OBRTTYP & '07'X);                     /*@Z427VLS*/ 01107000
         NI    OBRTTYP,X'07'                                       0534 01108000
*       NUMBER = 2;                     /*SET FOR TWO BYTES IN       */ 01109000
@RF00533 MVC   NUMBER(4),@CF00098                                  0535 01110000
*       NEXTBY = ADDR(OBRCDE2);         /*WHERE THE BYTES ARE        */ 01111000
         LA    @09,OBRCDE2                                         0536 01112000
         ST    @09,NEXTBY                                          0536 01113000
*       ADDNXT = ADDR(NAME);            /*WHERE THE CONVERTED DEVICE */ 01114000
         LA    @09,NAME                                            0537 01115000
         ST    @09,ADDNXT                                          0537 01116000
*       CALL CONVERT;                   /*IS TO BE PLACED    @Z427VLS*/ 01117000
         BAL   @14,CONVERT                                         0538 01118000
*       END;                                               /*@Z427VLS*/ 01119000
*   IF NAME = UKNOO                     /*OBR TYPE UKNOWN    @Z427VLS*/ 01120000
*    THEN                                                          0540 01121000
@RC00530 CLC   NAME(4),UKNOO                                       0540 01122000
         BNE   @RF00540                                            0540 01123000
*     STRANGOB = STRANGOB + NUMBER1;    /*KEEP A COUNT OF NUMBER     */ 01124000
         LA    @09,1                                               0541 01125000
         AL    @09,STRANGOB                                        0541 01126000
         ST    @09,STRANGOB                                        0541 01127000
*  END;                                                    /*@Z427VLS*/ 01128000
* END;                                                     /*@Z427VLS*/ 01129000
*END;                                                      /*@Z427VLS*/ 01130000
@EL00011 DS    0H                                                  0544 01131000
@EF00011 DS    0H                                                  0544 01132000
@ER00011 LM    @14,@12,@SA00011                                    0544 01133000
         BR    @14                                                 0544 01134000
*RESPECIFY (R8) UNRESTRICTED;                              /*@Z427VLS*/ 01135000
*/********************************************************************/ 01136000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01137000
*/*    THIS PROC WILL BUILD THE NAME FOR SOFTWARE TYPE RECORDS       */ 01138000
*/*                                                          @Z427VLS*/ 01139000
*RECISSFT: PROC;                                           /*@Z427VLS*/ 01140000
RECISSFT STM   @14,@12,12(@13)                                     0546 01141000
*NAME = SOFT(1:4);                                         /*@Z427VLS*/ 01142000
         MVC   NAME(4),SOFT                                        0547 01143000
*SFTCOUNT = SFTCOUNT + NUMBER1;                            /*@Z427VLS*/ 01144000
         LA    @06,1                                               0548 01145000
         AL    @06,SFTCOUNT                                        0548 01146000
         ST    @06,SFTCOUNT                                        0548 01147000
*END;                                                      /*@Z427VLS*/ 01148000
@EL00012 DS    0H                                                  0549 01149000
@EF00012 DS    0H                                                  0549 01150000
@ER00012 LM    @14,@12,12(@13)                                     0549 01151000
         BR    @14                                                 0549 01152000
*/********************************************************************/ 01153000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01154000
*/*    THIS PROC WILL BUILD THE NAME FOR IPL TYPE RECORDS    @Z427VLS*/ 01155000
*/*                                                          @Z427VLS*/ 01156000
*RECISIPL: PROC;                                           /*@Z427VLS*/ 01157000
RECISIPL STM   @14,@12,12(@13)                                     0550 01158000
*NAME = IPL;                                               /*@Z427VLS*/ 01159000
         MVC   NAME(4),IPL                                         0551 01160000
*IPLCOUNT = IPLCOUNT + NUMBER1;                            /*@Z427VLS*/ 01161000
         LA    @06,1                                               0552 01162000
         AL    @06,IPLCOUNT                                        0552 01163000
         ST    @06,IPLCOUNT                                        0552 01164000
*END;                                                      /*@Z427VLS*/ 01165000
@EL00013 DS    0H                                                  0553 01166000
@EF00013 DS    0H                                                  0553 01167000
@ER00013 LM    @14,@12,12(@13)                                     0553 01168000
         BR    @14                                                 0553 01169000
*/********************************************************************/ 01170000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01171000
*/*    THIS PROC WILL BUILD THE NAME FOR DDR TYPE RECORDS    @Z427VLS*/ 01172000
*/*                                                          @Z427VLS*/ 01173000
*RECISDDR: PROC;                                           /*@Z427VLS*/ 01174000
RECISDDR STM   @14,@12,12(@13)                                     0554 01175000
*NAME = DDR;                                               /*@Z427VLS*/ 01176000
         MVC   NAME(4),DDR                                         0555 01177000
*DDRCOUNT = DDRCOUNT + NUMBER1;                            /*@Z427VLS*/ 01178000
         LA    @06,1                                               0556 01179000
         AL    @06,DDRCOUNT                                        0556 01180000
         ST    @06,DDRCOUNT                                        0556 01181000
*END;                                                      /*@Z427VLS*/ 01182000
@EL00014 DS    0H                                                  0557 01183000
@EF00014 DS    0H                                                  0557 01184000
@ER00014 LM    @14,@12,12(@13)                                     0557 01185000
         BR    @14                                                 0557 01186000
*/********************************************************************/ 01187000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01188000
*/*    THIS PROC WILL BUILD THE NAME FOR MIH TYPE RECORDS    @Z427VLS*/ 01189000
*/*                                                          @Z427VLS*/ 01190000
*RECISMIH: PROC;                                           /*@Z427VLS*/ 01191000
RECISMIH STM   @14,@12,12(@13)                                     0558 01192000
*NAME = MIH;                                               /*@Z427VLS*/ 01193000
         MVC   NAME(4),MIH                                         0559 01194000
*MIHCOUNT = MIHCOUNT + NUMBER1;                            /*@Z427VLS*/ 01195000
         LA    @06,1                                               0560 01196000
         AL    @06,MIHCOUNT                                        0560 01197000
         ST    @06,MIHCOUNT                                        0560 01198000
*END;                                                      /*@Z427VLS*/ 01199000
@EL00015 DS    0H                                                  0561 01200000
@EF00015 DS    0H                                                  0561 01201000
@ER00015 LM    @14,@12,12(@13)                                     0561 01202000
         BR    @14                                                 0561 01203000
*/********************************************************************/ 01204000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01205000
*/*    THIS PROC WILL BUILD THE NAME FOR EOD TYPE RECORDS    @Z427VLS*/ 01206000
*/*                                                          @Z427VLS*/ 01207000
*RECISEOD: PROC;                                           /*@Z427VLS*/ 01208000
RECISEOD STM   @14,@12,12(@13)                                     0562 01209000
*NAME = EOD;                                               /*@Z427VLS*/ 01210000
         MVC   NAME(4),EOD                                         0563 01211000
*EODCOUNT = EODCOUNT + NUMBER1;                            /*@Z427VLS*/ 01212000
         LA    @06,1                                               0564 01213000
         AL    @06,EODCOUNT                                        0564 01214000
         ST    @06,EODCOUNT                                        0564 01215000
*END;                                                      /*@Z427VLS*/ 01216000
@EL00016 DS    0H                                                  0565 01217000
@EF00016 DS    0H                                                  0565 01218000
@ER00016 LM    @14,@12,12(@13)                                     0565 01219000
         BR    @14                                                 0565 01220000
*/********************************************************************/ 01221000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01222000
*/*    THIS PROC WILL BUILD THE NAME FOR MDR TYPE RECORDS    @Z427VLS*/ 01223000
*/*                                                          @Z427VLS*/ 01224000
*RESPECIFY  (R8) RESTRICTED;                               /*@Z427VLS*/ 01225000
*RECISMDR: PROC;                                           /*@Z427VLS*/ 01226000
RECISMDR STM   @14,@12,@SA00017                                    0567 01227000
*MDRCOUNT = MDRCOUNT + NUMBER1;                            /*@Z427VLS*/ 01228000
         LA    @09,1                                               0568 01229000
         AL    @09,MDRCOUNT                                        0568 01230000
         ST    @09,MDRCOUNT                                        0568 01231000
*R8 = TPRDEV;                    /*SET RECORD DEVICE IN      @Z427VLS*/ 01232000
         SLR   R8,R8                                               0569 01233000
         IC    R8,TPRDEV(,R7)                                      0569 01234000
*R5 = ADDR(LOADED);              /*ESTABLISH ADDRESSABILITY  @Z427VLS*/ 01235000
         LA    R5,LOADED                                           0570 01236000
*GENERATE;                                                 /*@Z427VLS*/ 01237000
*                                                                  0571 01238000
        MVI    5(R5),X'F0'      /*SET IN LEADING ZERO'S      @Z427VLS*/ 01239000
        SRDL   R8,4             /*SAVE THE LOWER 4 BITS IN R7       */  01240000
        LA     R8,CHARS(R8)      /*INDEX INTO CHARACTER STRING       */ 01241000
        MVC    6(1,R5),0(R8)  /*MOVE THE INDEXED CHAR INTO NAME   */    01242000
        SR     R8,R8             /*CLEAR THE WORK REGISTER   @Z427VLS*/ 01243000
        SLDL   R8,4             /*MOVE BACK THE LOW 4 BITS   @Z427VLS*/ 01244000
        LA     R8,CHARS(R8)      /*INDEX INTO THE CHARACTER STRING   */ 01245000
        MVC    7(1,R5),0(R8)  /* MOVE INDEXED CHAR TO NAME   @Z427VLS*/ 01246000
        MVI    4(R5),X'E3'      /*MOVE IN THE IDENTIFIEER(T) @Z427VLS*/ 01247000
*END;                                                      /*@Z427VLS*/ 01248000
@EL00017 DS    0H                                                  0572 01249000
@EF00017 DS    0H                                                  0572 01250000
@ER00017 LM    @14,@12,@SA00017                                    0572 01251000
         BR    @14                                                 0572 01252000
*RESPECIFY (R8) UNRESTRICTED;                              /*@Z427VLS*/ 01253000
*/********************************************************************/ 01254000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01255000
*/*    THIS PROC WILL CLEAR ANY NAMES THAT IFCEDIT LOADED DURING EXC */ 01256000
*/*    ALSO IT HAS TO DELETE ANY PROGRAM NAMES THAT ARE IN THE TABLE */ 01257000
*/*                                                          @Z427VLS*/ 01258000
*STORAGE: PROC;                                            /*@Z427VLS*/ 01259000
STORAGE  STM   @14,@12,@SA00018                                    0574 01260000
*IF DEBUG10 = ON THEN                                              0575 01261000
         TM    DEBUG10(R2),B'00100000'                             0575 01262000
         BNO   @RF00575                                            0575 01263000
* DO;                                                      /*@G51DGVS*/ 01264000
*  PRTLINE = BUG10;                                        /*@G51DGVS*/ 01265000
         MVI   PRTLINE+28,C' '                                     0577 01266000
         MVC   PRTLINE+29(103),PRTLINE+28                          0577 01267000
         MVC   PRTLINE(28),BUG10                                   0577 01268000
*  CALL PRINTIT;                                           /*@G51DGVS*/ 01269000
         BAL   @14,PRINTIT                                         0578 01270000
* END;                                                     /*@G51DGVS*/ 01271000
* GEN(DELETE  EPLOC=LOADED);        /*DROP THE LOADED EDIT TABLE     */ 01272000
@RF00575 DS    0H                                                  0580 01273000
         DELETE  EPLOC=LOADED                                           01274000
*IF EDITNUM ^= ZERO THEN                                           0581 01275000
         L     @06,ADEDITB(,R2)                                    0581 01276000
         LH    @06,EDITNUM(,@06)                                   0581 01277000
         LTR   @06,@06                                             0581 01278000
         BZ    @RF00581                                            0581 01279000
* DO J = 1 BY  1 TO EDITNUM;        /*DELETE THE MODULES EDIT LOADED */ 01280000
         LA    @06,1                                               0582 01281000
         ST    @06,J                                               0582 01282000
         B     @DE00582                                            0582 01283000
@DL00582 DS    0H                                                  0583 01284000
*    LOADEDED= LOADNAME(J);         /*INSERT THE MODULE NAMES        */ 01285000
         LR    @03,@06                                             0583 01286000
         MH    @03,@CH00032                                        0583 01287000
         L     @15,ADEDITB(,R2)                                    0583 01288000
         ST    @03,@TF00001                                        0583 01289000
         ALR   @03,@15                                             0583 01290000
         AL    @03,@CF01400                                        0583 01291000
         MVC   LOADEDED(8),LOADNAME-4(@03)                         0583 01292000
*    IF DEBUG10 = ON THEN           /*DO THEY WANT A DUMP OF PROG NME*/ 01293000
         TM    DEBUG10(R2),B'00100000'                             0584 01294000
         BNO   @RF00584                                            0584 01295000
*      PRGNAME(J+1) = LOADNAME(J);  /*MOVE THE NAME TO PRINT BUFFER  */ 01296000
         MH    @06,@CH00108                                        0585 01297000
         LA    @03,PRGNAME(@06)                                    0585 01298000
         AL    @15,@TF00001                                        0585 01299000
         AL    @15,@CF01400                                        0585 01300000
         MVC   0(8,@03),LOADNAME-4(@15)                            0585 01301000
*    GEN(DELETE  EPLOC=LOADEDED);                          /*@Z427VLS*/ 01302000
@RF00584 DS    0H                                                  0586 01303000
         DELETE  EPLOC=LOADEDED                                         01304000
* END;                                                     /*@XA21472*/ 01305000
         LA    @06,1                                               0587 01306000
         AL    @06,J                                               0587 01307000
         ST    @06,J                                               0587 01308000
@DE00582 L     @03,ADEDITB(,R2)                                    0587 01309000
         CH    @06,EDITNUM(,@03)                                   0587 01310000
         BNH   @DL00582                                            0587 01311000
*  EDITLOAD = EDITLOAD && EDITLOAD;  /*CLEAR THE TABLE       @XA21472*/ 01312000
@RF00581 L     @06,ADEDITB(,R2)                                    0588 01313000
         XC    EDITLOAD(148,@06),EDITLOAD(@06)                     0588 01314000
*  IF DEBUG10 = ON THEN             /*NOW PRINT THE EDIT NAMES USED  */ 01315000
         TM    DEBUG10(R2),B'00100000'                             0589 01316000
         BNO   @RF00589                                            0589 01317000
*   DO;                                                    /*@Z427VLS*/ 01318000
*     PRGNAME(ONE) = LOADED;        /*MOVE PRIME EDIT NAME IN        */ 01319000
         MVC   PRGNAME(8),LOADED                                   0591 01320000
*     CALL PRINTIT;                 /*GO PRINT THE NAMES OF EDIT MODU*/ 01321000
         BAL   @14,PRINTIT                                         0592 01322000
*   END;                                                   /*@Z427VLS*/ 01323000
*STORECT = STORECT + NUMBER1;       /*INCREMENT THE # OF TIMES CALLED*/ 01324000
@RF00589 LA    @06,1                                               0594 01325000
         AL    @06,STORECT                                         0594 01326000
         ST    @06,STORECT                                         0594 01327000
*END;                                                      /*@Z427VLS*/ 01328000
@EL00018 DS    0H                                                  0595 01329000
@EF00018 DS    0H                                                  0595 01330000
@ER00018 LM    @14,@12,@SA00018                                    0595 01331000
         BR    @14                                                 0595 01332000
*/********************************************************************/ 01333000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01334000
*/*    THIS PROC WILL CONVERT HEX DATA INTO PRINTABLE FORMAT @Z427VLS*/ 01335000
*/*    INTO ITEM NAME WHERE THE NEW MODULE NAME IS BEING BUILT       */ 01336000
*/*            ITEM NUMBER = # BYTES TO CONVERT              @Z427VLS*/ 01337000
*/*            ITEM NEXTBY = ADDRESS OF DATA TO CONVERT      @Z427VLS*/ 01338000
*/*            ITEM ADDNXT = ADDRESS OF WHERE TO PUT CONVERTED DATA  */ 01339000
*/*                                                          @Z427VLS*/ 01340000
*RESPECIFY (R8,R9) RESTRICTED;                             /*@Z427VLS*/ 01341000
*CONVERT: PROC;                                            /*@Z427VLS*/ 01342000
CONVERT  STM   @14,@12,12(@13)                                     0597 01343000
* DO Z = NUMBER BY -1 TO 1;       /*NUMBER = NUMBER TO CONVERT      */  01344000
         L     @06,NUMBER                                          0598 01345000
         ST    @06,Z                                               0598 01346000
         B     @DE00598                                            0598 01347000
@DL00598 DS    0H                                                  0599 01348000
*  R8 = NEXTBYTE(Z);              /*PICK UP NEXT BYTE TO CONVERT    */  01349000
         L     @03,NEXTBY                                          0599 01350000
         BCTR  @03,0                                               0599 01351000
         SLR   R8,R8                                               0599 01352000
         IC    R8,NEXTBYTE(@06,@03)                                0599 01353000
*  X = 2 * Z;                     /*OUTPUT INDEX MUST BE TWICE INPUT*/  01354000
         LR    @03,@06                                             0600 01355000
         ALR   @03,@03                                             0600 01356000
         ST    @03,X                                               0600 01357000
*  SRDL (R8,4);                                            /*@Z427VLS*/ 01358000
         SRDL  R8,4                                                0601 01359000
*  SRL  (R9,28);                                           /*@Z427VLS*/ 01360000
         SRL   R9,28                                               0602 01361000
*  R9 = R9 + NUMBER1;             /*DO NOT INDEX BY 0        @Z427VLS*/ 01362000
         LA    @15,1                                               0603 01363000
         ALR   R9,@15                                              0603 01364000
*  R8 = R8 + NUMBER1;             /*MAKE SURE DON'T INDEX BY 0       */ 01365000
         ALR   R8,@15                                              0604 01366000
*  ADDNUM(X - 1) = CHARS(R8);                              /*@Z427VLS*/ 01367000
         L     @15,ADDNXT                                          0605 01368000
         ALR   @03,@15                                             0605 01369000
         BCTR  @03,0                                               0605 01370000
         BCTR  @03,0                                               0605 01371000
         LA    @01,CHARS-1(R8)                                     0605 01372000
         MVC   ADDNUM(1,@03),0(@01)                                0605 01373000
*  ADDNUM(X) = CHARS(R9);                                  /*@Z427VLS*/ 01374000
         L     @03,X                                               0606 01375000
         ALR   @15,@03                                             0606 01376000
         BCTR  @15,0                                               0606 01377000
         LA    @03,CHARS-1(R9)                                     0606 01378000
         MVC   ADDNUM(1,@15),0(@03)                                0606 01379000
* END;                                                     /*@Z427VLS*/ 01380000
         BCTR  @06,0                                               0607 01381000
         ST    @06,Z                                               0607 01382000
@DE00598 LTR   @06,@06                                             0607 01383000
         BP    @DL00598                                            0607 01384000
*END;                                                      /*@Z427VLS*/ 01385000
@EL00019 DS    0H                                                  0608 01386000
@EF00019 DS    0H                                                  0608 01387000
@ER00019 LM    @14,@12,12(@13)                                     0608 01388000
         BR    @14                                                 0608 01389000
*RESPECIFY (R8) UNRESTRICTED;                              /*@Z427VLS*/ 01390000
*/********************************************************************/ 01391000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01392000
*/*    THIS PROC WILL LINK TO THE MAIN  EDIT MODULE TO PRINT THE     */ 01393000
*/*    SUMMARY COUNTERS                                      @Z427VLS*/ 01394000
*/*                                                          @Z427VLS*/ 01395000
*PRINTSUM: PROC;                                           /*@Z427VLS*/ 01396000
PRINTSUM STM   @14,@12,@SA00020                                    0610 01397000
*  IF DEBUG14 = ON THEN      /*REQUEST FOR HEXDUMP OF SUM COUNTERS*/    01398000
         TM    DEBUG14(R2),B'00000010'                             0611 01399000
         BNO   @RF00611                                            0611 01400000
*   CALL BUGS14;             /*GO HEXDUMP THE COUNTER(S)     @0001VLS*/ 01401000
         BAL   @14,BUGS14                                          0612 01402000
*  R7 = SUMPRT;                  /*SET POINTER TO THE SUM COUNTERS   */ 01403000
@RF00611 L     R7,SUMPRT                                           0613 01404000
*  R9 = LOADBASS;                /*LOAD THE ADDRESS OF THE SUM MODULE*/ 01405000
         L     R9,LOADBASS                                         0614 01406000
*  GEN(L   R9,L4(R9));           /*LOAD SECOND INSTRUCTION IN SUM    */ 01407000
         L   R9,L4(R9)                                                  01408000
*  CALL IFCEEDIT;                /*CALL EDIT MODULE LINKED WITH US   */ 01409000
         L     @15,@CV01353                                        0616 01410000
         BALR  @14,@15                                             0616 01411000
*  SUMPRT = ZERO;                /*SET POINTER ADDRESS BACK TO 0     */ 01412000
         SLR   @08,@08                                             0617 01413000
         ST    @08,SUMPRT                                          0617 01414000
*  NUMBPRT = NUMBPRT + NUMBER1;  /*INCREMENT THE # OF TIMES PROC CALL*/ 01415000
         LA    @08,1                                               0618 01416000
         AL    @08,NUMBPRT                                         0618 01417000
         ST    @08,NUMBPRT                                         0618 01418000
*END;                                                      /*@Z427VLS*/ 01419000
@EL00020 DS    0H                                                  0619 01420000
@EF00020 DS    0H                                                  0619 01421000
@ER00020 LM    @14,@12,@SA00020                                    0619 01422000
         BR    @14                                                 0619 01423000
*BUGS14: PROC;  /*THIS PROC WILL HEXDUMP THE SUMMRY COUNTERS @0001VLS*/ 01424000
BUGS14   STM   @14,@12,@SA00021                                    0620 01425000
*  IF DEBUG14 = ON &                                               0621 01426000
*     DUMPNUM ^= ONE  THEN                                         0621 01427000
         TM    DEBUG14(R2),B'00000010'                             0621 01428000
         BNO   @RF00621                                            0621 01429000
         CLC   DUMPNUM(2,R2),@CH00081                              0621 01430000
         BE    @RF00621                                            0621 01431000
*   DO;                                                    /*@Z427VLS*/ 01432000
*   PRTLINE = BUG14;                                       /*@Z427VLS*/ 01433000
         MVI   PRTLINE+38,C' '                                     0623 01434000
         MVC   PRTLINE+39(93),PRTLINE+38                           0623 01435000
         MVC   PRTLINE(38),BUG14                                   0623 01436000
*   CALL PRINTIT;                                          /*@Z427VLS*/ 01437000
         BAL   @14,PRINTIT                                         0624 01438000
*   DO T = 1 BY 1 TO DUMPNUM - 1;                          /*@Z427VLS*/ 01439000
         LA    @08,1                                               0625 01440000
         ST    @08,T                                               0625 01441000
         B     @DE00625                                            0625 01442000
@DL00625 DS    0H                                                  0626 01443000
*    TEMPSAVE = DUMPSIZE(T)      ;                         /*@Z427VLS*/ 01444000
         SLA   @08,3                                               0626 01445000
         L     @06,DUMPSIZE-8(@08,R2)                              0626 01446000
         ST    @06,TEMPSAVE                                        0626 01447000
*    NUMBER = 66                 ;                         /*@Z427VLS*/ 01448000
         LA    @06,66                                              0627 01449000
         ST    @06,NUMBER                                          0627 01450000
*    ADDNXT = ADDR(PRTLINE)     ;                          /*@Z427VLS*/ 01451000
         LA    @03,PRTLINE                                         0628 01452000
         ST    @03,ADDNXT                                          0628 01453000
*    NEXTBY = DUMPADR(T)         ;                         /*@Z427VLS*/ 01454000
         L     @08,DUMPADR-8(@08,R2)                               0629 01455000
         ST    @08,NEXTBY                                          0629 01456000
*    DO A = 66 BY 66 TO TEMPSAVE ;                         /*@Z427VLS*/ 01457000
         ST    @06,A                                               0630 01458000
         B     @DE00630                                            0630 01459000
@DL00630 DS    0H                                                  0631 01460000
*     CALL CONVERT               ;                         /*@Z427VLS*/ 01461000
         BAL   @14,CONVERT                                         0631 01462000
*     NEXTBY = NEXTBY + 66       ;                         /*@Z427VLS*/ 01463000
         LA    @08,66                                              0632 01464000
         AL    @08,NEXTBY                                          0632 01465000
         ST    @08,NEXTBY                                          0632 01466000
*     CALL PRINTIT               ;                         /*@Z427VLS*/ 01467000
         BAL   @14,PRINTIT                                         0633 01468000
*    END                         ;                         /*@Z427VLS*/ 01469000
         LA    @06,66                                              0634 01470000
         AL    @06,A                                               0634 01471000
         ST    @06,A                                               0634 01472000
@DE00630 C     @06,TEMPSAVE                                        0634 01473000
         BNH   @DL00630                                            0634 01474000
*    NUMBER = TEMPSAVE - (A - 66);                         /*@Z427VLS*/ 01475000
         LA    @08,66                                              0635 01476000
         SL    @08,A                                               0635 01477000
         AL    @08,TEMPSAVE                                        0635 01478000
         ST    @08,NUMBER                                          0635 01479000
*    IF NUMBER > ZERO                                              0636 01480000
*     THEN                                                         0636 01481000
         LTR   @08,@08                                             0636 01482000
         BNP   @RF00636                                            0636 01483000
*       CALL PRINTIT  ;                                    /*@Z427VLS*/ 01484000
         BAL   @14,PRINTIT                                         0637 01485000
*    END              ;                                    /*@Z427VLS*/ 01486000
@RF00636 LA    @08,1                                               0638 01487000
         AL    @08,T                                               0638 01488000
         ST    @08,T                                               0638 01489000
@DE00625 LH    @06,DUMPNUM(,R2)                                    0638 01490000
         BCTR  @06,0                                               0638 01491000
         CR    @08,@06                                             0638 01492000
         BNH   @DL00625                                            0638 01493000
*  END;                                                    /*@0001VLS*/ 01494000
*DUMPTABL = DUMPTABL && DUMPTABL;                          /*@Z427VLS*/ 01495000
@RF00621 XC    DUMPTABL(100,R2),DUMPTABL(R2)                       0640 01496000
*DUMPNUM = ONE;                                            /*@Z427VLS*/ 01497000
         MVC   DUMPNUM(2,R2),@CH00081                              0641 01498000
*END;                                                      /*@Z427VLS*/ 01499000
@EL00021 DS    0H                                                  0642 01500000
@EF00021 DS    0H                                                  0642 01501000
@ER00021 LM    @14,@12,@SA00021                                    0642 01502000
         BR    @14                                                 0642 01503000
*SUMRECRD: PROC; /*THIS PROC WILL TURN CONTROL OVER TO IFCESUMS TO*/    01504000
SUMRECRD STM   @14,@12,@SA00022                                    0643 01505000
*                /*BUILD THE SUMMRY COUNTERS FOR IFCEEDIT TO PRINT*/    01506000
* RESPECIFY (R5) RESTRICTED;                               /*@0001VLS*/ 01507000
*R5 = SUMPRT;                                              /*@Z427VLS*/ 01508000
         L     R5,SUMPRT                                           0645 01509000
*R9 = LOADBASS;                         /*SET TO ADDRESS OF SUMMARY  */ 01510000
         L     R9,LOADBASS                                         0646 01511000
*CALL IFCESUMS;                         /*GO SUM THE RECORD  @Z427VLS*/ 01512000
         L     @15,@CV01362                                        0647 01513000
         BALR  @14,@15                                             0647 01514000
*IF R15 ^= ZERO THEN                                               0648 01515000
         LTR   R15,R15                                             0648 01516000
         BZ    @RF00648                                            0648 01517000
*   DO;                                                    /*@Z427VLS*/ 01518000
*    RELOOP = RELOOP + NUMBER1;                            /*@Z427VLS*/ 01519000
         LA    @08,1                                               0650 01520000
         AL    @08,RELOOP                                          0650 01521000
         ST    @08,RELOOP                                          0650 01522000
*    CALL PRINTSUM;                                        /*@Z427VLS*/ 01523000
         BAL   @14,PRINTSUM                                        0651 01524000
*    R9 = LOADBASS;                     /*ADDRESS OF SUMMARY TABLE   */ 01525000
         L     R9,LOADBASS                                         0652 01526000
*    CALL IFCESUMS;                     /*GO SUM FAILED RECORD       */ 01527000
         L     @15,@CV01362                                        0653 01528000
         BALR  @14,@15                                             0653 01529000
*   END;                                                   /*@Z427VLS*/ 01530000
*SUMPRT = R5;                           /*SAVE THE ADDRESS OF COUNTER*/ 01531000
@RF00648 ST    R5,SUMPRT                                           0655 01532000
*SUMED = SUMED + NUMBER1;                                  /*@Z427VLS*/ 01533000
         LA    @08,1                                               0656 01534000
         AL    @08,SUMED                                           0656 01535000
         ST    @08,SUMED                                           0656 01536000
*END;                                                      /*@Z427VLS*/ 01537000
@EL00022 DS    0H                                                  0657 01538000
@EF00022 DS    0H                                                  0657 01539000
@ER00022 LM    @14,@12,@SA00022                                    0657 01540000
         BR    @14                                                 0657 01541000
*RESPECIFY (R5) UNRESTRICTED;                              /*@Z427VLS*/ 01542000
*/********************************************************************/ 01543000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01544000
*/*    THIS PROC WILL BALR TO THE PRIME EDIT ROUTINE TO EDIT THIS    */ 01545000
*/*    THE CURRENT RECORD                                    @Z427VLS*/ 01546000
*/*                                                          @Z427VLS*/ 01547000
*EDITREC: PROC;                                            /*@Z427VLS*/ 01548000
EDITREC  STM   @14,@12,@SA00023                                    0659 01549000
* R9 = LOADBASE;                                           /*@Z427VLS*/ 01550000
         L     R9,LOADBASE                                         0660 01551000
* CALL IFCEEDIT;                   /*CALL EDIT PROGRAM(OLD 008)      */ 01552000
         L     @15,@CV01353                                        0661 01553000
         BALR  @14,@15                                             0661 01554000
* EDRECCT  = EDRECCT + NUMBER1;                            /*@Z427VLS*/ 01555000
         LA    @08,1                                               0662 01556000
         AL    @08,EDRECCT                                         0662 01557000
         ST    @08,EDRECCT                                         0662 01558000
*END;                                                      /*@Z427VLS*/ 01559000
@EL00023 DS    0H                                                  0663 01560000
@EF00023 DS    0H                                                  0663 01561000
@ER00023 LM    @14,@12,@SA00023                                    0663 01562000
         BR    @14                                                 0663 01563000
*/********************************************************************/ 01564000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01565000
*/*    THIS PROC WILL BE CALLED AT A BREAK IN THE DATA THAT MEANS ALL*/ 01566000
*/*    RECORDS SUMMED MUST BE PRINTED, THE OLD EDIT AND SUM MODULE   */ 01567000
*/*    MUST BE DELETED THEN NEW NAMES BUILT AND THE NEW MODULES      */ 01568000
*/*    LOADED DEBUG COUNTS WILL KEEP TRACK OF THE NUMBER OF TIME     */ 01569000
*/*    EACH PROC IS CALLED                                   @Z427VLS*/ 01570000
*/*                                                          @Z427VLS*/ 01571000
*NEWTYPE: PROC;                                            /*@Z427VLS*/ 01572000
NEWTYPE  STM   @14,@12,@SA00024                                    0664 01573000
*      IF FRAMEIN = YES THEN          /*FRAME WAS FOUND & CORE ALSO*/   01574000
         TM    FRAMEIN,B'00100000'                                 0665 01575000
         BNO   @RF00665                                            0665 01576000
*       DO;                                                /*@G51DGVS*/ 01577000
*       GEN(DELETE EPLOC=FRMNAME);  /*REMOVE IFCFRAME FROM CORE*/  0667 01578000
         DELETE EPLOC=FRMNAME                                           01579000
*       GEN(FREEMAIN R,SP=20);      /*DELETE THE CORE FOR THE RECORD*/  01580000
         FREEMAIN R,SP=20                                               01581000
*       FOUND = NO;                 /*DO NOT RETURN HERE     @G51DGVS*/ 01582000
*       CORE = NO;                  /*SET TO OBTAIN CORE NEXT TIME*/    01583000
         NI    FOUND,B'10110111'                                   0670 01584000
*       END;                                               /*@G51DGVS*/ 01585000
*IF NEWTYPNM ^= ZERO  THEN              /*KEEP OUT FIRST TIME THROUGH*/ 01586000
@RF00665 L     @08,NEWTYPNM                                        0672 01587000
         LTR   @08,@08                                             0672 01588000
         BZ    @RF00672                                            0672 01589000
* DO;                                                      /*@Z427VLS*/ 01590000
* IF PEDIT = ON                         /*WAS EDIT REQUESTED @Z427VLS*/ 01591000
*  THEN                                                            0674 01592000
         TM    PEDIT(R2),B'00010000'                               0674 01593000
         BNO   @RF00674                                            0674 01594000
*   CALL STORAGE;                       /*THIS IS TO DELETE ANY ITEMS*/ 01595000
         BAL   @14,STORAGE                                         0675 01596000
*                                       /*EDITS LOADED DURING LAST   */ 01597000
*                                       /*TYPE OF RECORDS    @Z427VLS*/ 01598000
*  IF PSUM = ON THEN                    /*WAS SUMMARY REQUESTED      */ 01599000
@RF00674 TM    PSUM(R2),B'00001000'                                0676 01600000
         BNO   @RF00676                                            0676 01601000
*   DO;                                                    /*@Z427VLS*/ 01602000
*    CALL PRINTSUM;                     /*PRINT SUMMARY COUNTERS     */ 01603000
         BAL   @14,PRINTSUM                                        0678 01604000
*    GEN(DELETE EPLOC=LOADSUM);         /*DROP THE SUMMARY MODULE    */ 01605000
         DELETE EPLOC=LOADSUM                                           01606000
*   END;                                                   /*@Z427VLS*/ 01607000
* END;                                                     /*@Z427VLS*/ 01608000
@RF00676 DS    0H                                                  0682 01609000
*CALL NAMEBLD;                          /*CALL PROC TO BUILD PROGRAM */ 01610000
@RF00672 BAL   @14,NAMEBLD                                         0682 01611000
*                                        /* NAME FOR EDIT AND/OR SUM */ 01612000
*SUMVAR = EDVAR;                                           /*@Z427VLS*/ 01613000
         MVC   SUMVAR(4),EDVAR                                     0683 01614000
*BLDNAME1 = LOADED;                     /*SET UP EDIT NAME   @Z427VLS*/ 01615000
         MVC   BLDNAME1(8),LOADED                                  0684 01616000
*BLDNAME2 = LOADSUM;                    /*SET UP SUMMARY NAME        */ 01617000
         MVC   BLDNAME2(8),LOADSUM                                 0685 01618000
*R4 = CURTABPT;                                            /*@Z427VLS*/ 01619000
         L     R4,CURTABPT                                         0686 01620000
*CPOLDTYP = TABLETYP;                  /*SET UP NEW BREAK POINT     */  01621000
         MVC   CPOLDTYP(5),TABLETYP(R4)                            0687 01622000
*IF PSUM = ON THEN                      /*WAS SUMMARY ASKED FOR      */ 01623000
         TM    PSUM(R2),B'00001000'                                0688 01624000
         BNO   @RF00688                                            0688 01625000
* DO;                                                      /*@Z427VLS*/ 01626000
*  GEN(BLDL 0,BLDLST2);                 /*IS THIS PROGRAM ON  SYSTEM */ 01627000
         BLDL 0,BLDLST2                                                 01628000
*  RESPECIFY (R0,R15) RESTRICTED;                          /*@G51DGVS*/ 01629000
*  IF R15 ^= ZERO                                                  0692 01630000
*   THEN                                                           0692 01631000
         LTR   R15,R15                                             0692 01632000
         BZ    @RF00692                                            0692 01633000
*    DO;                                                   /*@Z427VLS*/ 01634000
*   IF SNUMFAIL < TWELVE THEN           /*IF ROOM ADD NAME OF MODULE */ 01635000
         LH    @14,SNUMFAIL                                        0694 01636000
         C     @14,@CF00032                                        0694 01637000
         BNL   @RF00694                                            0694 01638000
*    DO;                                                   /*@Z427VLS*/ 01639000
*     SNUMFAIL = SNUMFAIL + NUMBER1;    /*COUNT # ITEMS IN THE TABLE */ 01640000
         AL    @14,@CF00081                                        0696 01641000
         STH   @14,SNUMFAIL                                        0696 01642000
*     IDXSUM(SNUMFAIL) = NAME;          /*MOVE THE FAILING NAME IN   */ 01643000
         SLA   @14,2                                               0697 01644000
         LA    @08,IDXSUM-4(@14)                                   0697 01645000
         MVC   0(4,@08),NAME                                       0697 01646000
*    END;                                                  /*@Z427VLS*/ 01647000
*    SUMVAR = UKNO;                     /*SETUP UKNOWN MODULE NAME   */ 01648000
@RF00694 MVC   SUMVAR(4),UKNO                                      0699 01649000
*    NOSUMMRY = NOSUMMRY +NUMBER1;      /*COUNT # OF SUMMARY MODULES */ 01650000
         LA    @14,1                                               0700 01651000
         AL    @14,NOSUMMRY                                        0700 01652000
         ST    @14,NOSUMMRY                                        0700 01653000
*                                       /*ASKED FOR & NOT ON THE SYS */ 01654000
*    R0 = RECTYP;                       /*LOAD THE RECORD TYPE       */ 01655000
         L     R0,RECTYP                                           0701 01656000
*    SRL (R0,FOUR);                     /*SET UP FOR INDEXING        */ 01657000
         SRL   R0,4                                                0702 01658000
*    IF R0 ^= 0  | R0 ^> NINE THEN      /*MAKE SURE VALID RECORD     */ 01659000
         LTR   R0,R0                                               0703 01660000
         BNZ   @RT00703                                            0703 01661000
         C     R0,@CF00108                                         0703 01662000
         BH    @RF00703                                            0703 01663000
@RT00703 DS    0H                                                  0704 01664000
*     SUMFAIL(R0) =  SUMFAIL(R0)+ NUMBER1;                 /*@Z427VLS*/ 01665000
         LR    @14,R0                                              0704 01666000
         SLA   @14,2                                               0704 01667000
         LA    @08,1                                               0704 01668000
         AL    @08,SUMFAIL-4(@14)                                  0704 01669000
         ST    @08,SUMFAIL-4(@14)                                  0704 01670000
*    END;                                                  /*@Z427VLS*/ 01671000
@RF00703 DS    0H                                                  0706 01672000
*/* NOTE IF UKNOWN MODULE NOT ON SYSTEM WE ARE GOING TO DIE QUICK    */ 01673000
*/* THE FIRST TIME AN UKNOWN COMES ALONG (806 I THINK)       @Z427VLS*/ 01674000
*  GEN(LOADEREP EPLOC=LOADSUM);        /* LOAD THE SUMMARY TABLE     */ 01675000
@RF00692 DS    0H                                                  0706 01676000
         LOADEREP EPLOC=LOADSUM                                         01677000
*  LOADBASS  =  R0;                     /*SAVE POINT WHERE IT IS     */ 01678000
         ST    R0,LOADBASS                                         0707 01679000
* END;                                                     /*@Z427VLS*/ 01680000
*IF PEDIT = ON THEN                     /*DID THE USER  ASK FOR EDIT */ 01681000
@RF00688 TM    PEDIT(R2),B'00010000'                               0709 01682000
         BNO   @RF00709                                            0709 01683000
* DO;                                                      /*@Z427VLS*/ 01684000
*  GEN(BLDL 0,BLDLST1);                 /*IS THIS EDIT MODULE ON SYS */ 01685000
         BLDL 0,BLDLST1                                                 01686000
*  IF R15 ^= ZERO                       /*DID IT FIND PROGRAM        */ 01687000
*   THEN                                                           0712 01688000
         LTR   R15,R15                                             0712 01689000
         BZ    @RF00712                                            0712 01690000
*    DO;                                                   /*@Z427VLS*/ 01691000
*     IF ENUMFAIL < TWELVE THEN         /*IF ROOM IN TABLE ADD NAME  */ 01692000
         LH    @14,ENUMFAIL                                        0714 01693000
         C     @14,@CF00032                                        0714 01694000
         BNL   @RF00714                                            0714 01695000
*     DO;                                                  /*@Z427VLS*/ 01696000
*      ENUMFAIL = ENUMFAIL + NUMBER1;   /*ADD ONE TO COUNT   @Z427VLS*/ 01697000
         AL    @14,@CF00081                                        0716 01698000
         STH   @14,ENUMFAIL                                        0716 01699000
*      IDXEDIT(ENUMFAIL) = NAME;        /*MOVE IN THE NAME   @Z427VLS*/ 01700000
         SLA   @14,2                                               0717 01701000
         LA    @08,IDXEDIT-4(@14)                                  0717 01702000
         MVC   0(4,@08),NAME                                       0717 01703000
*     END;                                                 /*@Z427VLS*/ 01704000
*    EDVAR = UKNO;                      /*SET NAME TO UKNOWN @Z427VLS*/ 01705000
@RF00714 MVC   EDVAR(4),UKNO                                       0719 01706000
*    NOEDIT = NOEDIT + NUMBER1;                            /*@Z427VLS*/ 01707000
         LA    @14,1                                               0720 01708000
         AL    @14,NOEDIT                                          0720 01709000
         ST    @14,NOEDIT                                          0720 01710000
*    R0 = RECTYP;                       /*LOAD THE RECORD TYPE       */ 01711000
         L     R0,RECTYP                                           0721 01712000
*    SRL (R0,FOUR);                     /*SET UP THE INDEX VALUE     */ 01713000
         SRL   R0,4                                                0722 01714000
*    IF R0 ^= ZERO | R0 ^> NINE THEN    /*IF VALID THE DO    @Z427VLS*/ 01715000
         LTR   R0,R0                                               0723 01716000
         BNZ   @RT00723                                            0723 01717000
         C     R0,@CF00108                                         0723 01718000
         BH    @RF00723                                            0723 01719000
@RT00723 DS    0H                                                  0724 01720000
*    EDITFAIL(R0) = EDITFAIL(R0)+ NUMBER1;                 /*@Z427VLS*/ 01721000
         LR    @14,R0                                              0724 01722000
         SLA   @14,2                                               0724 01723000
         LA    @08,1                                               0724 01724000
         AL    @08,EDITFAIL-4(@14)                                 0724 01725000
         ST    @08,EDITFAIL-4(@14)                                 0724 01726000
*    END;                                                  /*@Z427VLS*/ 01727000
@RF00723 DS    0H                                                  0726 01728000
*  GEN(LOADEREP EPLOC=LOADED);         /* LOAD THE EDIT TABLE        */ 01729000
@RF00712 DS    0H                                                  0726 01730000
         LOADEREP EPLOC=LOADED                                          01731000
*  LOADBASE = R0;                       /*SAVE THE LOAD POINT        */ 01732000
         ST    R0,LOADBASE                                         0727 01733000
* END;                                                     /*@Z427VLS*/ 01734000
*NEWTYPNM = NEWTYPNM + NUMBER1;         /*COUNT NUMBER OF TIMES CALLE*/ 01735000
@RF00709 LA    @14,1                                               0729 01736000
         AL    @14,NEWTYPNM                                        0729 01737000
         ST    @14,NEWTYPNM                                        0729 01738000
*END;                                                      /*@Z427VLS*/ 01739000
@EL00024 DS    0H                                                  0730 01740000
@EF00024 DS    0H                                                  0730 01741000
@ER00024 LM    @14,@12,@SA00024                                    0730 01742000
         BR    @14                                                 0730 01743000
*/********************************************************************/ 01744000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01745000
*/*    THIS PROC WILL DETERMINE THE THE RECORD TYPE AND CALL IN THE **/ 01746000
*/*    PROC TO BUILD THE EDIT AND SUMMARY TABLE NAMES FOR A LATTER   */ 01747000
*/*    PROC TO LOAD AND EXEC A DEBUG COUNT OF ANY UKNOWN TYPES WILL  */ 01748000
*/*    BE KEPT THE FILTER ROUTINE WILL SET ANY UNKNOWN TYPE TO 'FF'X */ 01749000
*/*    AND RETAIN THEM FOR FUTHER PROCESSING ERMINE 1/2 BYTE OF TYPE */ 01750000
*/*                                                          @Z427VLS*/ 01751000
*NAMEBLD: PROC;                                            /*@Z427VLS*/ 01752000
NAMEBLD  STM   @14,@12,@SA00025                                    0731 01753000
*TIMEUSED = TIMEUSED + NUMBER1;         /*KEEP TRACK OF TIMES CALLED */ 01754000
         LA    @14,1                                               0732 01755000
         AL    @14,TIMEUSED                                        0732 01756000
         ST    @14,TIMEUSED                                        0732 01757000
*NAME = UKNO;                           /*SET UP DEFAULT NAME        */ 01758000
         MVC   NAME(4),UKNO                                        0733 01759000
*RECTYP = (LRTKEY1 & 'F0'X);            /*DETERMINE 1/2 BYTE OF TYPE */ 01760000
         LA    @14,240                                             0734 01761000
         SLR   @08,@08                                             0734 01762000
         IC    @08,LRTKEY1(,R7)                                    0734 01763000
         NR    @14,@08                                             0734 01764000
         ST    @14,RECTYP                                          0734 01765000
*IF LRTRUNC ^=ON THEN                   /*IF TRUNCTATED BIT ON STOP  */ 01766000
         TM    LRTRUNC(R7),B'00100000'                             0735 01767000
         BO    @RF00735                                            0735 01768000
* DO;                                   /*AS INPUT BUFF IS NOT CLEAR */ 01769000
*                                       /*MAY PICK JUNL FROM LAST REC*/ 01770000
*IF RECTYP = '10'X THEN                 /*IS THIS A MCH TYPE RECORD  */ 01771000
         C     @14,@CF01375                                        0737 01772000
         BNE   @RF00737                                            0737 01773000
* CALL RECISMCH;                        /*PROCESS MCH TYPE RECORD    */ 01774000
         BAL   @14,RECISMCH                                        0738 01775000
*  ELSE                                                            0739 01776000
*  DO;                                                     /*@Z427VLS*/ 01777000
         B     @RC00737                                            0739 01778000
@RF00737 DS    0H                                                  0740 01779000
*   IF RECTYP = '20'X THEN              /*IS THIS REC A CCH TYPE     */ 01780000
         CLC   RECTYP(4),@CF01376                                  0740 01781000
         BNE   @RF00740                                            0740 01782000
*    CALL RECISCCH;                     /*CALL PROC TO PROCESS CCH   */ 01783000
         BAL   @14,RECISCCH                                        0741 01784000
*    ELSE                                                          0742 01785000
*     DO;                                                  /*@Z427VLS*/ 01786000
         B     @RC00740                                            0742 01787000
@RF00740 DS    0H                                                  0743 01788000
*      IF RECTYP = '30'X THEN           /*IS THIS A MCH TYPE RECORD  */ 01789000
         CLC   RECTYP(4),@CF01290                                  0743 01790000
         BNE   @RF00743                                            0743 01791000
*       CALL RECISOBR ;                 /*CALL PROC TO PROCESS OBR'S */ 01792000
         BAL   @14,RECISOBR                                        0744 01793000
*       ELSE                                                       0745 01794000
*        DO;                                               /*@Z427VLS*/ 01795000
         B     @RC00743                                            0745 01796000
@RF00743 DS    0H                                                  0746 01797000
*         IF RECTYP = '40'X THEN        /*IS THIS AN SFT TYPE RECORD */ 01798000
         CLC   RECTYP(4),@CF01273                                  0746 01799000
         BNE   @RF00746                                            0746 01800000
*          CALL RECISSFT;               /*CALL PROC TO PROCESS SOFT  */ 01801000
         BAL   @14,RECISSFT                                        0747 01802000
*           ELSE                                                   0748 01803000
*            DO;                                           /*@Z427VLS*/ 01804000
         B     @RC00746                                            0748 01805000
@RF00746 DS    0H                                                  0749 01806000
*             IF RECTYP = '50'X THEN    /*IS RECORD TYPE A IPL       */ 01807000
         CLC   RECTYP(4),@CF01377                                  0749 01808000
         BNE   @RF00749                                            0749 01809000
*              CALL RECISIPL;           /*CALL PROC TO PROCESS IPL   */ 01810000
         BAL   @14,RECISIPL                                        0750 01811000
*              ELSE                                                0751 01812000
*               DO;                                        /*@Z427VLS*/ 01813000
         B     @RC00749                                            0751 01814000
@RF00749 DS    0H                                                  0752 01815000
*                IF RECTYP = '60'X THEN /*IS RECORD TYPE A DDR       */ 01816000
         CLC   RECTYP(4),@CF01378                                  0752 01817000
         BNE   @RF00752                                            0752 01818000
*                 CALL RECISDDR;        /*CALL PROC TO PROCESS DDR   */ 01819000
         BAL   @14,RECISDDR                                        0753 01820000
*                 ELSE                                             0754 01821000
*                  DO;                                     /*@Z427VLS*/ 01822000
         B     @RC00752                                            0754 01823000
@RF00752 DS    0H                                                  0755 01824000
*                   IF RECTYP = '70'X   /*IS RECORD TYPE AN MIH      */ 01825000
*                    THEN                                          0755 01826000
         CLC   RECTYP(4),@CF01379                                  0755 01827000
         BNE   @RF00755                                            0755 01828000
*                     CALL RECISMIH;    /*CALL PROC TO PROCESS MIH'S */ 01829000
         BAL   @14,RECISMIH                                        0756 01830000
*                    ELSE                                          0757 01831000
*                     DO;                                  /*@Z427VLS*/ 01832000
         B     @RC00755                                            0757 01833000
@RF00755 DS    0H                                                  0758 01834000
*                      IF RECTYP = '80'X/*IS RECORD TYPE AN EOD      */ 01835000
*                       THEN                                       0758 01836000
         CLC   RECTYP(4),@CF01380                                  0758 01837000
         BNE   @RF00758                                            0758 01838000
*                        CALL RECISEOD; /*PROCESS EOD RECORD @Z427VLS*/ 01839000
         BAL   @14,RECISEOD                                        0759 01840000
*                       ELSE                                       0760 01841000
*                       DO;                                /*@Z427VLS*/ 01842000
         B     @RC00758                                            0760 01843000
@RF00758 DS    0H                                                  0761 01844000
*                        IF RECTYP = '90'X/*IS RECORD AN MDR @Z427VLS*/ 01845000
*                         THEN                                     0761 01846000
         CLC   RECTYP(4),@CF01288                                  0761 01847000
         BNE   @RF00761                                            0761 01848000
*                          CALL RECISMDR;/*CALL PROC TO PROCESS MDR'S*/ 01849000
         BAL   @14,RECISMDR                                        0762 01850000
*                       END;                               /*@Z427VLS*/ 01851000
*                     END;                                 /*@Z427VLS*/ 01852000
*                  END;                                    /*@Z427VLS*/ 01853000
*               END;                                       /*@Z427VLS*/ 01854000
*            END;                                          /*@Z427VLS*/ 01855000
*        END;                                              /*@Z427VLS*/ 01856000
*    END;                                                  /*@Z427VLS*/ 01857000
*   END;                                                   /*@Z427VLS*/ 01858000
* END;                                                     /*@Z427VLS*/ 01859000
* ELSE                                                             0772 01860000
*  TRUNKCT = TRUNKCT + ONE;                                /*@Z427VLS*/ 01861000
         B     @RC00735                                            0772 01862000
@RF00735 LA    @14,1                                               0772 01863000
         AL    @14,TRUNKCT                                         0772 01864000
         ST    @14,TRUNKCT                                         0772 01865000
*IF DEBUG2 = ON  THEN                   /*USER WOULD LIKE TO SEE WHAT*/ 01866000
@RC00735 TM    DEBUG2(R2),B'00100000'                              0773 01867000
         BNO   @RF00773                                            0773 01868000
*                                       /*PROG THIS SORT ENTRY GENED */ 01869000
* DO;                                                      /*@Z427VLS*/ 01870000
*   THISNAME = LOADED;                  /*MOVE PROG NAME TO PRINT LNE*/ 01871000
         MVC   THISNAME(8),LOADED                                  0775 01872000
*   IF PEDIT = OFF                                                 0776 01873000
*     THEN                                                         0776 01874000
         TM    PEDIT(R2),B'00010000'                               0776 01875000
         BNZ   @RF00776                                            0776 01876000
*       GEN(MVI  PRTLINE+3,X'E2');      /*MAKE IT A SUMMRY MODULE    */ 01877000
         MVI  PRTLINE+3,X'E2'                                           01878000
*   NUMBER = FIVE;                      /*SET UP SORT ENTRY PRINT    */ 01879000
@RF00776 MVC   NUMBER(4),@CF00047                                  0778 01880000
*   NEXTBY = CURTABPT;                  /*WILL NOW HAVE THE ADDRESS  */ 01881000
         L     @14,CURTABPT                                        0779 01882000
         ST    @14,NEXTBY                                          0779 01883000
*   ADDNXT = ADDR(SORTENTR);            /*WHERE TO PUT THE DATA      */ 01884000
         LA    @14,SORTENTR                                        0780 01885000
         ST    @14,ADDNXT                                          0780 01886000
*   CALL CONVERT;                       /*CHANGE TO PRINTABLE        */ 01887000
         BAL   @14,CONVERT                                         0781 01888000
*   BINWORD = SUMSAMPL;                 /*NUMBER OF ENTRIES IN LAST  */ 01889000
         L     @14,SUMSAMPL                                        0782 01890000
         ST    @14,BINWORD                                         0782 01891000
*   BNDECNUM = FOUR;                /*ONLY FOUR PRINTABLE POSITIONS  */ 01892000
         MVC   BNDECNUM(4),@CF00089                                0783 01893000
*   DECADDR  = ADDR(SORTENTR) + 7  ;   /*WHERE TO PUT THE CONVERTED  */ 01894000
         LA    @14,SORTENTR                                        0784 01895000
         AL    @14,@CF00105                                        0784 01896000
         ST    @14,DECADDR                                         0784 01897000
*   CALL CONVBIN;                      /*GO CONVERT TO PRINTABLE     */ 01898000
         BAL   @14,CONVBIN                                         0785 01899000
*   SUMSAMPL = ZERO;                                       /*@Z427VLS*/ 01900000
         SLR   @14,@14                                             0786 01901000
         ST    @14,SUMSAMPL                                        0786 01902000
*   IF RECLNGTH > 55 THEN               /*MAX LINE WILL HANDLE       */ 01903000
         LA    @14,55                                              0787 01904000
         CH    @14,RECLNGTH(,R2)                                   0787 01905000
         BNL   @RF00787                                            0787 01906000
*     NUMBER = 55;                  /*IN SOME CASES WILL ^ TELL ALL  */ 01907000
         ST    @14,NUMBER                                          0788 01908000
*    ELSE                                                          0789 01909000
*     NUMBER = RECLNGTH;                                   /*@Z427VLS*/ 01910000
         B     @RC00787                                            0789 01911000
@RF00787 LH    @14,RECLNGTH(,R2)                                   0789 01912000
         ST    @14,NUMBER                                          0789 01913000
*   NEXTBY = R7;                                           /*@Z427VLS*/ 01914000
@RC00787 ST    R7,NEXTBY                                           0790 01915000
*   ADDNXT = ADDR(PRTLINE) + 21;        /*PRINT PART OF RECORD       */ 01916000
         LA    @14,PRTLINE                                         0791 01917000
         AL    @14,@CF00712                                        0791 01918000
         ST    @14,ADDNXT                                          0791 01919000
*   CALL CONVERT ;                      /*CONVERT THE RECORD TO PRINT*/ 01920000
         BAL   @14,CONVERT                                         0792 01921000
*   CALL PRINTIT;                                          /*@Z427VLS*/ 01922000
         BAL   @14,PRINTIT                                         0793 01923000
* END;                                                     /*@Z427VLS*/ 01924000
*IF NAME = UKNO                         /*IS NAME STILL UKNOWN       */ 01925000
* THEN                                                             0795 01926000
@RF00773 CLC   NAME(4),UKNO                                        0795 01927000
         BNE   @RF00795                                            0795 01928000
*  UKNOCT = UKNOCT + NUMBER1;           /*ADD 1 TO THE COUNT @Z427VLS*/ 01929000
         LA    @14,1                                               0796 01930000
         AL    @14,UKNOCT                                          0796 01931000
         ST    @14,UKNOCT                                          0796 01932000
*IF DEBUG9 = ON THEN                   /*HEXDUMP RECORD      @Z427VLS*/ 01933000
@RF00795 TM    DEBUG9(R2),B'01000000'                              0797 01934000
         BNO   @RF00797                                            0797 01935000
* CALL HEXDUMP;                                            /*@Z427VLS*/ 01936000
         BAL   @14,HEXDUMP                                         0798 01937000
*END;                                                      /*@Z427VLS*/ 01938000
@EL00025 DS    0H                                                  0799 01939000
@EF00025 DS    0H                                                  0799 01940000
@ER00025 LM    @14,@12,@SA00025                                    0799 01941000
         BR    @14                                                 0799 01942000
*HEXDUMP: PROC;                                            /*@Z427VLS*/ 01943000
HEXDUMP  STM   @14,@12,@SA00026                                    0800 01944000
*  NUMBER = 66;                    /*# BYTES/LINE            @Z427VLS*/ 01945000
         LA    @14,66                                              0801 01946000
         ST    @14,NUMBER                                          0801 01947000
*  ADDNXT = ADDR(PRTLINE);         /*ADDRESS OF WHERE TO PUT CONVERTD*/ 01948000
         LA    @08,PRTLINE                                         0802 01949000
         ST    @08,ADDNXT                                          0802 01950000
*  NEXTBY = R7;                    /*DATA- PICK UP ADDRESS OF RECORD */ 01951000
         ST    R7,NEXTBY                                           0803 01952000
*  DO T = 66 BY 66 TO RECLNGTH;    /*PRINT THE ENTIRE DATA SET       */ 01953000
         ST    @14,T                                               0804 01954000
         B     @DE00804                                            0804 01955000
@DL00804 DS    0H                                                  0805 01956000
*   CALL CONVERT;                         /*GO CONVERT TO PRINTABLE  */ 01957000
         BAL   @14,CONVERT                                         0805 01958000
*   NEXTBY = NEXTBY + 66;                /*MOVE POINTER TO NEXT BLOCK*/ 01959000
         LA    @14,66                                              0806 01960000
         AL    @14,NEXTBY                                          0806 01961000
         ST    @14,NEXTBY                                          0806 01962000
*   CALL PRINTIT;                        /*GO PRINT THE DATA @Z427VLS*/ 01963000
         BAL   @14,PRINTIT                                         0807 01964000
*  END;                                                    /*@Z427VLS*/ 01965000
         LA    @14,66                                              0808 01966000
         AL    @14,T                                               0808 01967000
         ST    @14,T                                               0808 01968000
@DE00804 CH    @14,RECLNGTH(,R2)                                   0808 01969000
         BNH   @DL00804                                            0808 01970000
* NUMBER = RECLNGTH - (T-66);            /*SEE IF ANY OF RECORD IS   */ 01971000
         L     @14,T                                               0809 01972000
         SL    @14,@CF01357                                        0809 01973000
         LCR   @14,@14                                             0809 01974000
         AH    @14,RECLNGTH(,R2)                                   0809 01975000
         ST    @14,NUMBER                                          0809 01976000
* IF NUMBER > ZERO THEN                  /*LEFT              @Z427VLS*/ 01977000
         LTR   @14,@14                                             0810 01978000
         BNP   @RF00810                                            0810 01979000
*  DO;                                                     /*@Z427VLS*/ 01980000
*    CALL CONVERT;                                         /*@Z427VLS*/ 01981000
         BAL   @14,CONVERT                                         0812 01982000
*    CALL PRINTIT;                                         /*@Z427VLS*/ 01983000
         BAL   @14,PRINTIT                                         0813 01984000
*   END;                                                   /*@Z427VLS*/ 01985000
*END;                                                      /*@Z427VLS*/ 01986000
@EL00026 DS    0H                                                  0815 01987000
@EF00026 DS    0H                                                  0815 01988000
@ER00026 LM    @14,@12,@SA00026                                    0815 01989000
         BR    @14                                                 0815 01990000
@PB00026 DS    0H                                                  0816 01991000
*/********************************************************************/ 01992000
*/********************************************************************/ 01993000
*/********************************************************************/ 01994000
*/*****START OF PROGRAM IFCEEDIT IS AT THIS POINT    *****************/ 01995000
*/*****THIS AREA WILL CALL ALL MAJOR PROCEDURES AND CONTROL FLOW     */ 01996000
*/********************************************************************/ 01997000
*/********************************************************************/ 01998000
*/********************************************************************/ 01999000
*/*                                                          @Z427VLS*/ 02000000
*IF DEBUG4 = ON  THEN                                              0816 02001000
         TM    DEBUG4(R2),B'00001000'                              0816 02002000
         BNO   @RF00816                                            0816 02003000
* DO;                                                      /*@Z427VLS*/ 02004000
*  R4 = R12 - 27;  /*SET ADDRESSABILITY FOR COMPILE DATE     @G51DGVS*/ 02005000
         LR    R4,R12                                              0818 02006000
         SL    R4,@CF01385                                         0818 02007000
*  GEN(MVC  PRTLINE(16),0(R4));                            /*@Z427VLS*/ 02008000
         MVC  PRTLINE(16),0(R4)                                         02009000
*  R4 = ADDR(IFCEEDIT);                                    /*@Z427VLS*/ 02010000
         L     R4,@CV01353                                         0820 02011000
*  GEN(MVC  PRTLINE+20(16),5(R4));                         /*@Z427VLS*/ 02012000
         MVC  PRTLINE+20(16),5(R4)                                      02013000
*  R4 = ADDR(IFCESUMS);                                    /*@Z427VLS*/ 02014000
         L     R4,@CV01362                                         0822 02015000
*  IF PSUM = YES THEN                                              0823 02016000
         TM    PSUM(R2),B'00001000'                                0823 02017000
         BNO   @RF00823                                            0823 02018000
*  GEN(MVC  PRTLINE+40(16),5(R4));                         /*@Z427VLS*/ 02019000
         MVC  PRTLINE+40(16),5(R4)                                      02020000
*  CALL PRINTIT;                                           /*@Z427VLS*/ 02021000
@RF00823 BAL   @14,PRINTIT                                         0825 02022000
* END;                                                     /*@Z427VLS*/ 02023000
*R4 = SORTADR;                          /*SET BASE REG AT START OF   */ 02024000
@RF00816 L     R4,SORTADR(,R2)                                     0827 02025000
*                                       /*SORT TABLE SET BY FILTER   */ 02026000
*CURTABPT = R4;                         /*SET POINTER TO THE CURRENT */ 02027000
         ST    R4,CURTABPT                                         0828 02028000
*                                       /*RECORD BEING PROCESSED     */ 02029000
*DO I =  1 BY 1 TO SORTNUM WHILE(ERROR = ZERO);            /*@G51DGVS*/ 02030000
         LA    @14,1                                               0829 02031000
         ST    @14,I                                               0829 02032000
         B     @DE00829                                            0829 02033000
@DL00829 LH    @14,ERROR                                           0829 02034000
         LTR   @14,@14                                             0829 02035000
         BNZ   @DC00829                                            0829 02036000
*  R4 = CURTABPT;                       /*UPDATE BASE POINTER TO     */ 02037000
         L     R4,CURTABPT                                         0830 02038000
*                                       /*          THE NEW VALUE    */ 02039000
*  RECCCHHR = TABLECHH;                 /*SET UP TO READ THE RECORD  */ 02040000
         MVC   RECCCHHR(5,R2),TABLECHH(R4)                         0831 02041000
*  CALL IOHND(READIRCT);                /*DO NORMAL READ     @Z427VLS*/ 02042000
         L     @15,ADIOHND(,R2)                                    0832 02043000
         LA    @01,@AL00832                                        0832 02044000
         BALR  @14,@15                                             0832 02045000
* IF R15 = ZERO THEN                    /*IF ANY ERROR DON'T PROCESS */ 02046000
         SLR   @14,@14                                             0833 02047000
         CR    R15,@14                                             0833 02048000
         BNE   @RF00833                                            0833 02049000
*  DO;                                                     /*@Z427VLS*/ 02050000
*  IF TIMEUSED ^= ZERO THEN             /*DON'T DO FIRST TIME THROUGH*/ 02051000
         C     @14,TIMEUSED                                        0835 02052000
         BE    @RF00835                                            0835 02053000
*   SUMSAMPL = SUMSAMPL + ONE;         /*WILL HAVE A COUNT OF RECORDS*/ 02054000
         LA    @14,1                                               0836 02055000
         AL    @14,SUMSAMPL                                        0836 02056000
         ST    @14,SUMSAMPL                                        0836 02057000
*  RESPECIFY (R5) RESTRICTED;                              /*@G51DGVS*/ 02058000
@RF00835 DS    0H                                                  0838 02059000
*                                      /*IN EACH SORT SECTION        */ 02060000
*  R5 = LRTKEY1;                       /*PICK UP THE RECORD TYPE     */ 02061000
         SLR   R5,R5                                               0838 02062000
         IC    R5,LRTKEY1(,R7)                                     0838 02063000
*  SRL(R5,FOUR);                       /*DROP THE JUNK BITS  @Z427VLS*/ 02064000
         SRL   R5,4                                                0839 02065000
*  IF R5 < ONE | R5 > NINE | LRTRUNC = ON THEN  /* BYPASS UNKNOWN RDS*/ 02066000
         LTR   R5,R5                                               0840 02067000
         BNP   @RT00840                                            0840 02068000
         C     R5,@CF00108                                         0840 02069000
         BH    @RT00840                                            0840 02070000
         TM    LRTRUNC(R7),B'00100000'                             0840 02071000
         BNO   @RF00840                                            0840 02072000
@RT00840 DS    0H                                                  0841 02073000
*   RTYPCT(10) = RTYPCT(10) +  ONE;    /*INDEX 10 IS UKNOWN BUCKET   */ 02074000
         LA    @14,1                                               0841 02075000
         AL    @14,RTYPCT+36                                       0841 02076000
         ST    @14,RTYPCT+36                                       0841 02077000
*  ELSE                                                            0842 02078000
*   RTYPCT(R5) = RTYPCT(R5) + ONE;     /*ADD 1 TO RECORD TYPE COUNTER*/ 02079000
         B     @RC00840                                            0842 02080000
@RF00840 LR    @14,R5                                              0842 02081000
         SLA   @14,2                                               0842 02082000
         LA    @08,1                                               0842 02083000
         AL    @08,RTYPCT-4(@14)                                   0842 02084000
         ST    @08,RTYPCT-4(@14)                                   0842 02085000
*  IF DEBUG17 = ON THEN                 /*CALL FOR HEXDUMP OF THE REC*/ 02086000
@RC00840 TM    DEBUG17(R2),B'01000000'                             0843 02087000
         BNO   @RF00843                                            0843 02088000
*  DO;                                                     /*@Z427VLS*/ 02089000
*   CALL HEXDUMP;                       /*GO HEX DUMP THE RECORD     */ 02090000
         BAL   @14,HEXDUMP                                         0845 02091000
*  GEN(MVI PRTLINE,X'5C');                                 /*@Z427VLS*/ 02092000
         MVI PRTLINE,X'5C'                                              02093000
*  GEN(MVC PRTLINE+1(130),PRTLINE);                        /*@Z427VLS*/ 02094000
         MVC PRTLINE+1(130),PRTLINE                                     02095000
*  END;                                                    /*@Z427VLS*/ 02096000
*   IF(MERDTYP = '1F'X |          /*MERDIAN MCH TYPE RECORD  @G51DGVS*/ 02097000
*      MERDTYP = '2F'X)THEN                                        0849 02098000
@RF00843 CLI   MERDTYP(R4),X'1F'                                   0849 02099000
         BE    @RT00849                                            0849 02100000
         CLI   MERDTYP(R4),X'2F'                                   0849 02101000
         BNE   @RF00849                                            0849 02102000
@RT00849 DS    0H                                                  0850 02103000
*       DO;                                                /*@G51DGVS*/ 02104000
*       IF PEDIT = ON THEN                                         0851 02105000
         TM    PEDIT(R2),B'00010000'                               0851 02106000
         BNO   @RF00851                                            0851 02107000
*        CALL MERDIAN;                                     /*@G51DGVS*/ 02108000
         BAL   @14,MERDIAN                                         0852 02109000
*       ELSE                                                       0853 02110000
*        MCHCCHDR(R5) = MCHCCHDR(R5) + 1;                  /*@G51DGVS*/ 02111000
         B     @RC00851                                            0853 02112000
@RF00851 LR    @14,R5                                              0853 02113000
         SLA   @14,2                                               0853 02114000
         LA    @08,1                                               0853 02115000
         AL    @08,MCHCCHDR-4(@14)                                 0853 02116000
         ST    @08,MCHCCHDR-4(@14)                                 0853 02117000
*       END;                                               /*@G51DGVS*/ 02118000
*    ELSE                                                          0855 02119000
*     DO;                                                  /*@G51DGVS*/ 02120000
         B     @RC00849                                            0855 02121000
@RF00849 DS    0H                                                  0856 02122000
*  IF TABLETYP ^= CPOLDTYP              /*SAME TYPE OF RECORD ALL    */ 02123000
*    | DEBUG19 = ON                     /*FIVE BYTES OF THE ENTRY    */ 02124000
*                                       /*(FIRST 5) ARE COMPARED     */ 02125000
*   THEN                                /*YES A NEW MODULE(S) NEEDED */ 02126000
         CLC   TABLETYP(5,R4),CPOLDTYP                             0856 02127000
         BNE   @RT00856                                            0856 02128000
         TM    DEBUG19(R2),B'00010000'                             0856 02129000
         BNO   @RF00856                                            0856 02130000
@RT00856 DS    0H                                                  0857 02131000
*    CALL NEWTYPE;                      /*CALL PROC TO BUILD NEW     */ 02132000
         BAL   @14,NEWTYPE                                         0857 02133000
*                                       /*EDIT AND SUMMARY MODULE    */ 02134000
*                                       /*NAMES TO LOAD IN LATER     */ 02135000
*   CALL CUAMOD;                        /*THIS PROC WILL MODIFY THE  */ 02136000
@RF00856 BAL   @14,CUAMOD                                          0858 02137000
*                                       /*CUA IN THE RECORD IF IT IS */ 02138000
*                                       /*A MCH OR OBR AND IF SHORT  */ 02139000
*                                       /*OBR WILL SET DON'T EDIT IF */ 02140000
*                                       /*DON'T PROCESS SHORT OBR SET*/ 02141000
* IF PEDIT = ON & SWITCH1 = OFF         /*DO WE EDIT RECORDS @Z427VLS*/ 02142000
*  THEN                                 /*SWITCH1 ON = SHORT REC & NO*/ 02143000
         TM    PEDIT(R2),B'00010000'                               0859 02144000
         BNO   @RF00859                                            0859 02145000
         TM    SWITCH1,B'10000000'                                 0859 02146000
         BNZ   @RF00859                                            0859 02147000
*   CALL EDITREC;                       /*PROC WILL LOAD EDIT TABLE  */ 02148000
         BAL   @14,EDITREC                                         0860 02149000
*                                       /*PROCESS RECORD ETC @Z427VLS*/ 02150000
* IF PSUM = ON                          /*DO WE SUM THE RECORD       */ 02151000
*  THEN                                 /*YES SUM            @Z427VLS*/ 02152000
@RF00859 TM    PSUM(R2),B'00001000'                                0861 02153000
         BNO   @RF00861                                            0861 02154000
*   CALL SUMRECRD;                      /*PROC WILL LOAD SUMMARY MOD */ 02155000
         BAL   @14,SUMRECRD                                        0862 02156000
*                                       /*LINK AND PROCESS THE RECORD*/ 02157000
*  END;                                                    /*@G51DGVS*/ 02158000
*END;                                                      /*@Z427VLS*/ 02159000
*ELSE                                                              0865 02160000
* BADRECRD = BADRECRD + ONE;           /*COUNT THE NUMBER OF RECORDS*/  02161000
         B     @RC00833                                            0865 02162000
@RF00833 LA    @14,1                                               0865 02163000
         AL    @14,BADRECRD                                        0865 02164000
         ST    @14,BADRECRD                                        0865 02165000
*                                      /*FAILED READDIRECT   @Z427VLS*/ 02166000
*CURTABPT = CURTABPT + NUMBER10;       /*ADD 10 TO POINT TO THE     */  02167000
@RC00833 LA    @14,10                                              0866 02168000
         AL    @14,CURTABPT                                        0866 02169000
         ST    @14,CURTABPT                                        0866 02170000
*                                       /*NEXT RECORD IN THE TABLE   */ 02171000
*END;                                   /*END FOR OVER ALL DO LOOP   */ 02172000
         LA    @14,1                                               0867 02173000
         AL    @14,I                                               0867 02174000
         ST    @14,I                                               0867 02175000
@DE00829 C     @14,SORTNUM(,R2)                                    0867 02176000
         BNH   @DL00829                                            0867 02177000
@DC00829 DS    0H                                                  0868 02178000
*IF PSUM = ON & NEWTYPNM > ZERO         /*SUMMARY ASKED FOR  @Z427VLS*/ 02179000
* THEN                                  /*YES CLEAN UP ANY REMAINS   */ 02180000
         TM    PSUM(R2),B'00001000'                                0868 02181000
         BNO   @RF00868                                            0868 02182000
         L     @14,NEWTYPNM                                        0868 02183000
         LTR   @14,@14                                             0868 02184000
         BNP   @RF00868                                            0868 02185000
*  CALL PRINTSUM;                       /*PROC WILL PRINT OUT FINAL  */ 02186000
         BAL   @14,PRINTSUM                                        0869 02187000
*                                       /*SUMMARY TABLES     @Z427VLS*/ 02188000
*PPRINTDD = '1';                        /*CHANGE TO THE TOURIST DD   */ 02189000
@RF00868 MVI   PPRINTDD,C'1'                                       0870 02190000
*CALL PRINTTUR;                         /*PRINT MISC JUNK MESSAGES   */ 02191000
         BAL   @14,PRINTTUR                                        0871 02192000
*IF DEBUG0 = ON                         /*PRINT DEBUG INFORMATIONS   */ 02193000
* THEN                                  /*YES PRINT ALL U KNOW       */ 02194000
         TM    DEBUG0(R2),B'10000000'                              0872 02195000
         BNO   @RF00872                                            0872 02196000
*   CALL PRTDEBUG;                      /*GO PRINT ALL DEBUG DATA    */ 02197000
         BAL   @14,PRTDEBUG                                        0873 02198000
*IF ZEROALL = ON                        /*DO WE NEED ALL CORE        */ 02199000
* THEN                                                             0874 02200000
@RF00872 TM    ZEROALL(R2),B'01000000'                             0874 02201000
         BNO   @RF00874                                            0874 02202000
*  DO;                                                     /*@Z427VLS*/ 02203000
*  IF PEDIT = ON  THEN    /*DO WE EDIT RECORDS               @XA21472*/ 02204000
         TM    PEDIT(R2),B'00010000'                               0876 02205000
         BNO   @RF00876                                            0876 02206000
*   CALL STORAGE;         /*YES-CLEAR NAMES LOADED           @XA21472*/ 02207000
         BAL   @14,STORAGE                                         0877 02208000
*   IF PSUM = ON                                                   0878 02209000
*     THEN                                                         0878 02210000
@RF00876 TM    PSUM(R2),B'00001000'                                0878 02211000
         BNO   @RF00878                                            0878 02212000
*      GEN(DELETE  EPLOC=CPSUM);                           /*@Z427VLS*/ 02213000
         DELETE  EPLOC=CPSUM                                            02214000
*      IF FRAMENUM ^= ZERO THEN     /*ANY FRAME TABLES HANGING AROUND*/ 02215000
@RF00878 L     @01,FRAMEPTR(,R2)                                   0880 02216000
         L     @14,FRAMENUM(,@01)                                  0880 02217000
         LTR   @14,@14                                             0880 02218000
         BZ    @RF00880                                            0880 02219000
*       GEN(FREEMAIN  R,SP=21);                            /*@G51DGVS*/ 02220000
         FREEMAIN  R,SP=21                                              02221000
*      IF FRAMEIN = YES THEN          /*FRAME WAS FOUND & CORE ALSO*/   02222000
@RF00880 TM    FRAMEIN,B'00100000'                                 0882 02223000
         BNO   @RF00882                                            0882 02224000
*       GEN(DELETE EPLOC=FRMNAME);  /*REMOVE IFCFRAME FROM CORE*/  0883 02225000
         DELETE EPLOC=FRMNAME                                           02226000
*       IF CORE = YES THEN                                         0884 02227000
@RF00882 TM    CORE,B'01000000'                                    0884 02228000
         BNO   @RF00884                                            0884 02229000
*       GEN(FREEMAIN R,SP=20);      /*DELETE THE CORE FOR THE RECORD*/  02230000
         FREEMAIN R,SP=20                                               02231000
*  END;                                                    /*@Z427VLS*/ 02232000
@RF00884 DS    0H                                                  0887 02233000
*IF DEBUG12 = ON THEN           /*USER REQUESTED ABEND       @Z427VLS*/ 02234000
@RF00874 TM    DEBUG12(R2),B'00001000'                             0887 02235000
         BNO   @RF00887                                            0887 02236000
*    GEN(ABEND  140,DUMP);      /*THIS IS ALL ABEND          @Z427VLS*/ 02237000
         ABEND  140,DUMP                                                02238000
*RETURN;                                                   /*@Z427VLS*/ 02239000
@EL00001 L     @13,4(,@13)                                         0889 02240000
@EF00001 DS    0H                                                  0889 02241000
@ER00001 L     @14,12(,@13)                                        0889 02242000
         LM    @00,@12,20(@13)                                     0889 02243000
         BR    @14                                                 0889 02244000
*END                                                       /*@Z427VLS*/ 02245000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 02246000
*/*%INCLUDE SYSLIB  (COMTABLE)                                        * 02247000
*;                                                                 0890 02248000
         B     @EL00001                                            0890 02249000
@DATA    DS    0H                                                       02250000
@CH00045 DC    H'3'                                                     02251000
@CH00043 DC    H'24'                                                    02252000
@CH00925 DC    H'29'                                                    02253000
@CH01253 DC    H'384'                                                   02254000
         DS    0F                                                       02255000
@AL00213 DC    A(@CF01012)             LIST WITH   2 ARGUMENT(S)        02256000
         DC    A(@AFTEMPS)                                              02257000
@AL00269 EQU   *                       LIST WITH   1 ARGUMENT(S)        02258000
@AL00832 DC    A(@CF00103+2)           LIST WITH   1 ARGUMENT(S)        02259000
@AL00417 DC    A(@CF00098+2)           LIST WITH   1 ARGUMENT(S)        02260000
@AL00428 DC    A(@CF00535)             LIST WITH   2 ARGUMENT(S)        02261000
         DC    A(@AFTEMPS+4)                                            02262000
@AL00442 DC    A(@CF00695)             LIST WITH   2 ARGUMENT(S)        02263000
         DC    A(@AFTEMPS+4)                                            02264000
@AL00452 DC    A(@CF01283)             LIST WITH   2 ARGUMENT(S)        02265000
         DC    A(@AFTEMPS+4)                                            02266000
         DS    0F                                                       02267000
@SA00001 DS    18F                                                      02268000
@SA00002 DS    15F                                                      02269000
@SA00006 DS    15F                                                      02270000
@SA00026 DS    15F                                                      02271000
@SA00003 DS    15F                                                      02272000
@SA00004 DS    15F                                                      02273000
@SA00005 DS    15F                                                      02274000
@SA00007 DS    15F                                                      02275000
@SA00009 DS    15F                                                      02276000
@SA00010 DS    15F                                                      02277000
@SA00011 DS    15F                                                      02278000
@SA00017 DS    15F                                                      02279000
@SA00018 DS    15F                                                      02280000
@SA00020 DS    15F                                                      02281000
@SA00021 DS    15F                                                      02282000
@SA00022 DS    15F                                                      02283000
@SA00024 DS    15F                                                      02284000
@SA00025 DS    15F                                                      02285000
@SA00023 DS    0F                                                       02286000
         DS    15F                                                      02287000
@TF00001 DS    F                                                        02288000
@AFTEMPS DS    2F                                                       02289000
         DS    0F                                                       02290000
@CF00081 DC    F'1'                                                     02291000
@CH00081 EQU   @CF00081+2                                               02292000
@CF00098 DC    F'2'                                                     02293000
@CH00098 EQU   @CF00098+2                                               02294000
@CF00089 DC    F'4'                                                     02295000
@CF00047 DC    F'5'                                                     02296000
@CH00047 EQU   @CF00047+2                                               02297000
@CF00103 DC    F'6'                                                     02298000
@CH00103 EQU   @CF00103+2                                               02299000
@CF00105 DC    F'7'                                                     02300000
@CF00108 DC    F'9'                                                     02301000
@CH00108 EQU   @CF00108+2                                               02302000
@CF00034 DC    F'10'                                                    02303000
@CF00032 DC    F'12'                                                    02304000
@CH00032 EQU   @CF00032+2                                               02305000
@CF00924 DC    F'20'                                                    02306000
@CF00712 DC    F'21'                                                    02307000
@CF01385 DC    F'27'                                                    02308000
@CF00042 DC    F'31'                                                    02309000
@CF01012 DC    F'40'                                                    02310000
@CF00695 DC    F'52'                                                    02311000
@CF01357 DC    F'66'                                                    02312000
@CF00535 DC    F'81'                                                    02313000
@CF01283 DC    F'82'                                                    02314000
@CF01392 DC    F'-20'                                                   02315000
@CF01395 DC    F'-17'                                                   02316000
@CF01400 DC    F'-8'                                                    02317000
@CF01393 DC    F'-7'                                                    02318000
@CF01396 DC    F'-4'                                                    02319000
@CF01399 DC    XL4'0000FFFF'                                            02320000
@CF01273 DC    XL4'40'                                                  02321000
@CF01288 DC    XL4'90'                                                  02322000
@CF01290 DC    XL4'30'                                                  02323000
@CF01375 DC    XL4'10'                                                  02324000
@CF01376 DC    XL4'20'                                                  02325000
@CF01377 DC    XL4'50'                                                  02326000
@CF01378 DC    XL4'60'                                                  02327000
@CF01379 DC    XL4'70'                                                  02328000
@CF01380 DC    XL4'80'                                                  02329000
@CF00082 DC    BL4'1'                                                   02330000
@CV01353 DC    V(IFCEEDIT)                                              02331000
@CV01362 DC    V(IFCESUMS)                                              02332000
         DS    0D                                                       02333000
I        DC    F'0'                                                     02334000
T        DC    F'0'                                                     02335000
X        DC    F'0'                                                     02336000
Z        DC    F'0'                                                     02337000
SUMPRT   DC    F'0'                                                     02338000
LOADBASE DS    F                                                        02339000
LOADBASS DS    F                                                        02340000
SUMSAMPL DC    F'0'                                                     02341000
DECADDR  DC    F'0'                                                     02342000
BNDECNUM DC    F'0'                                                     02343000
BINWORD  DC    F'0'                                                     02344000
NEXTBY   DC    F'0'                                                     02345000
ADDNXT   DC    F'0'                                                     02346000
NUMBER   DC    F'0'                                                     02347000
TRUNKCT  DC    F'0'                                                     02348000
NOSUMMRY DC    F'0'                                                     02349000
NOEDIT   DC    F'0'                                                     02350000
CURTABPT DC    F'0'                                                     02351000
RECTYP   DC    F'0'                                                     02352000
J        DC    F'0'                                                     02353000
A        DC    F'0'                                                     02354000
K        DC    F'0'                                                     02355000
TEMPSAVE DC    F'0'                                                     02356000
SAVE7    DC    F'0'                                                     02357000
SAVERLN  DC    F'0'                                                     02358000
LISTPTR  DC    F'0'                                                     02359000
NEWREC   DC    F'0'                                                     02360000
FRAMEADD DC    F'0'                                                     02361000
INDEX1   DC    F'0'                                                     02362000
ERROR    DC    H'0'                                                     02363000
@TS00001 DS    CL1                                                      02364000
@CB01291 DC    X'000FFF'                                                02365000
@CB01289 DC    X'0FFF'                                                  02366000
@CB01301 DC    X'0114'                                                  02367000
@CB01302 DC    X'0159'                                                  02368000
@CB01314 DC    X'40F1'                                                  02369000
UKNO     DC    CL4'UKNO'                                                02370000
UKNOO    DC    CL4'UOBR'                                                02371000
UKNOCCH  DC    CL4'UCCH'                                                02372000
C2860    DC    CL4'2860'                                                02373000
C2870    DC    CL4'2870'                                                02374000
C2880    DC    CL4'2880'                                                02375000
CXXXX    DC    CL4'XXXX'                                                02376000
CAXXX    DC    CL4'AXXX'                                                02377000
IPL      DC    CL4'IPL '                                                02378000
EOD      DC    CL4'EOD '                                                02379000
SOFT     DC    CL9'SOFTWARE'                                            02380000
DDR      DC    CL4'DDR0'                                                02381000
MIH      DC    CL4'MIH0'                                                02382000
LOADEDED DC    CL8'        '                                            02383000
PTDEBUG1 DC    CL36' '                                                  02384000
         ORG   PTDEBUG1                                                 02385000
PLINE    DS    CL28                                                     02386000
         ORG   PLINE                                                    02387000
@NM00084 DS    CL2                                                      02388000
CTDATA   DS    CL5                                                      02389000
         ORG   PTDEBUG1+36                                              02390000
DBUG01   DS    CL53                                                     02391000
         ORG   DBUG01                                                   02392000
@NM00087 DC    CL10'NUMBER OF '                                         02393000
RTYP     DC    CL3'   '                                                 02394000
@NM00088 DC    CL35'  RECORDS READ AT BREAK POINT WAS  '                02395000
RNUMBER  DC    CL5'00000'                                               02396000
         ORG   DBUG01+53                                                02397000
PRTLINE1 DS    CL134                                                    02398000
         ORG   PRTLINE1                                                 02399000
PPRINTDD DC    CL1'1'                                                   02400000
PRINTCHR DC    CL1' '                                                   02401000
PRTLINE  DC    CL132' '                                                 02402000
         ORG   PRTLINE1+134                                             02403000
SINGLE   DC    CL1' '                                                   02404000
DOUBLE   DC    CL1'1'                                                   02405000
TRIPLE   DC    CL1'0'                                                   02406000
MISJUNK  DC    CL40'DEBUG0 - MISCELLANEOUS DEBUG INFORMATION'           02407000
BUG14    DC    CL38'DEBUG14 - HEXDUMP OF SUMMRY COUTNER(S)'             02408000
BUG10    DC    CL28'DEBUG10 - EDIT TABLE NAME(S)'                       02409000
BUG17    DC    CL34' '                                                  02410000
         ORG   BUG17                                                    02411000
@NM00092 DC    CL28'DEBUG17 - HEXDUMP OF RECORD '                       02412000
RCT      DS    CL6                                                      02413000
         ORG   BUG17+34                                                 02414000
BDRECORD DS    CL36                                                     02415000
         ORG   BDRECORD                                                 02416000
@NM00093 DC    CL8'        '                                            02417000
NUMFAIL  DC    CL6'XXXXXX'                                              02418000
@NM00094 DC    CL2'  '                                                  02419000
@NM00095 DC    CL20'DIRECT READ FAILURES'                               02420000
         ORG   BDRECORD+36                                              02421000
@NM00096 DS    CL17                                                     02422000
         ORG   @NM00096                                                 02423000
CHARFILL DC    CL1'Z'                                                   02424000
CHARS    DC    CL16'0123456789ABCDEF'                                   02425000
         ORG   @NM00096+17                                              02426000
BLDFAIL  DS    CL53                                                     02427000
         ORG   BLDFAIL                                                  02428000
@NM00097 DC    CL2'  '                                                  02429000
COUNT1   DC    CL5'     '                                               02430000
@NM00098 DC    CL1' '                                                   02431000
TYPE1    DC    CL7'EDIT   '                                             02432000
         ORG   TYPE1                                                    02433000
TYPE11   DS    CL3                                                      02434000
@NM00099 DS    CL4                                                      02435000
         ORG   BLDFAIL+15                                               02436000
@NM00100 DC    CL4'    '                                                02437000
@NM00101 DC    CL34'PROGRAM(S) REQUESTED NOT ON SYSTEM'                 02438000
         ORG   BLDFAIL+53                                               02439000
TYPE2    DC    CL7'SUMMARY'                                             02440000
BLANK    DC    CL7'       '                                             02441000
EXPL1    DS    CL42                                                     02442000
         ORG   EXPL1                                                    02443000
@NM00102 DC    CL9'NAMES OF '                                           02444000
TYPE3    DC    CL7'EDIT   '                                             02445000
@NM00103 DC    CL26'  MODULES THAT FAILED BLDL'                         02446000
         ORG   EXPL1+42                                                 02447000
         DS    CL1                                                      02448000
EDITNMS  DS    CL50                                                     02449000
         ORG   EDITNMS                                                  02450000
ENUMFAIL DC    H'0'                                                     02451000
ENMEFAIL DC    CL48' '                                                  02452000
         ORG   EDITNMS+50                                               02453000
SUMNMS   DS    CL50                                                     02454000
         ORG   SUMNMS                                                   02455000
SNUMFAIL DC    H'0'                                                     02456000
SNMEFAIL DC    CL48' '                                                  02457000
         ORG   SUMNMS+50                                                02458000
WORK     DS    CL8                                                      02459000
COUNTTB1 DS    CL36                                                     02460000
         ORG   COUNTTB1                                                 02461000
MCHCOUNT DC    F'0'                                                     02462000
CCHCOUNT DC    F'0'                                                     02463000
OBRCOUNT DC    F'0'                                                     02464000
SFTCOUNT DC    F'0'                                                     02465000
IPLCOUNT DC    F'0'                                                     02466000
DDRCOUNT DC    F'0'                                                     02467000
MIHCOUNT DC    F'0'                                                     02468000
EODCOUNT DC    F'0'                                                     02469000
MDRCOUNT DC    F'0'                                                     02470000
         ORG   COUNTTB1+36                                              02471000
BITS     DC    X'80000000'                                              02472000
         ORG   BITS                                                     02473000
SWITCH1  DS    BL1                                                      02474000
CORE     EQU   BITS+0                                                   02475000
FRAMEIN  EQU   BITS+0                                                   02476000
FIRSTHEX EQU   BITS+0                                                   02477000
FOUND    EQU   BITS+0                                                   02478000
         ORG   BITS+4                                                   02479000
@NM00104 DS    CL80                                                     02480000
         ORG   @NM00104                                                 02481000
CUAMODCT DC    F'0'                                                     02482000
EDRECCT  DC    F'0'                                                     02483000
NUMBPRT  DC    F'0'                                                     02484000
SUMED    DC    F'0'                                                     02485000
NEWTYPNM DC    F'0'                                                     02486000
RELOOP   DC    F'0'                                                     02487000
UKNOCT   DC    F'0'                                                     02488000
STORECT  DC    F'0'                                                     02489000
STRANGOB DC    F'0'                                                     02490000
UKCCOUNT DC    F'0'                                                     02491000
BADRECRD DC    F'0'                                                     02492000
TIMEUSED DC    F'0'                                                     02493000
OBRSHORT DC    F'0'                                                     02494000
MCHFRAME DC    F'0'                                                     02495000
CCHFRAME DC    F'0'                                                     02496000
RECMOVE  DC    F'0'                                                     02497000
MCHDROP  DC    F'0'                                                     02498000
CCHDROP  DC    F'0'                                                     02499000
BADFRAME DC    F'0'                                                     02500000
SPECILCT DC    F'0'                                                     02501000
         ORG   @NM00104+80                                              02502000
CPSUM    DC    CL8'IFCESUMS'                                            02503000
CPOLDTYP DC    X'0000000000'                                            02504000
LOADSUM  DS    CL8                                                      02505000
         ORG   LOADSUM                                                  02506000
@NM00105 DC    CL4'IFCS'                                                02507000
SUMVAR   DC    CL4'    '                                                02508000
         ORG   LOADSUM+8                                                02509000
LOADED   DS    CL8                                                      02510000
         ORG   LOADED                                                   02511000
@NM00106 DC    CL4'IFCE'                                                02512000
EDVAR    DC    CL4'    '                                                02513000
         ORG   LOADED+8                                                 02514000
OBRCDE2  DS    CL2                                                      02515000
         ORG   OBRCDE2                                                  02516000
OBRCLSS  DS    CL1                                                      02517000
OBRTTYP  DS    CL1                                                      02518000
         ORG   OBRCDE2+2                                                02519000
COMPDATE DS    CL32                                                     02520000
         ORG   COMPDATE                                                 02521000
@NM00107 DC    CL15'COMPILE DATE OF'                                    02522000
COMPILE  DS    CL17                                                     02523000
         ORG   COMPDATE+32                                              02524000
         DS    CL1                                                      02525000
BLDLST1  DS    CL18                                                     02526000
         ORG   BLDLST1                                                  02527000
@NM00108 DC    H'1'                                                     02528000
@NM00109 DC    H'14'                                                    02529000
BLDNAME1 DC    CL8' '                                                   02530000
SPLAT1   DC    6X'00'                                                   02531000
         ORG   BLDLST1+18                                               02532000
BLDLST2  DS    CL18                                                     02533000
         ORG   BLDLST2                                                  02534000
@NM00110 DC    H'1'                                                     02535000
@NM00111 DC    H'14'                                                    02536000
BLDNAME2 DC    CL8' '                                                   02537000
SPLAT2   DC    6X'00'                                                   02538000
         ORG   BLDLST2+18                                               02539000
ADAPTER  DS    CL16                                                     02540000
         ORG   ADAPTER                                                  02541000
C2702    DC    AL4(2702)                                                02542000
C2701    DC    AL4(2701)                                                02543000
C2703    DC    AL4(2703)                                                02544000
C2955    DC    AL4(2955)                                                02545000
         ORG   ADAPTER+16                                               02546000
BUG48    DC    CL26'DEBUG48 - FRAMEPTR HEXDUMP'                         02547000
FRMNAME  DC    CL8'IFCFRAME'                                            02548000
         DS    CL2                                                      02549000
DBLWORK  DS    CL16                                                     02550000
SUPERZAP DC    3CL10'SUPERZAP'                                          02551000
PTDEBUG  DC    CL29'RECORDS WITH THE CUA MODIFIED'                      02552000
         DC    CL29'CALLS TO PRINT EDIT TABLE    '                      02553000
         DC    CL29'CALLS TO PRINT SUMMARY TABLES'                      02554000
         DC    CL29'CALLS TO SUM THIS RECORD     '                      02555000
         DC    CL29'COUNT OF SORT TABLE BREAK PTS'                      02556000
         DC    CL29'GETMAIN FAILURES(IFCESUMS)   '                      02557000
         DC    CL29'UNKNOWN RECORD TYPES         '                      02558000
         DC    CL29'CALL TO THE STORAGE MANAGER  '                      02559000
         DC    CL29'UKNOWN OBR TYPE RECORDS      '                      02560000
         DC    CL29'UKNOWN CCH TYPE RECORDS      '                      02561000
         DC    CL29'NUMBER OF BAD READ DIRECTS   '                      02562000
         DC    CL29'CALLS FOR NEW MODULE NAMES   '                      02563000
         DC    CL29'NUMBER OF SHORT OBR RECORDS  '                      02564000
         DC    CL29'NUMBER OF MCH FRAMES READ    '                      02565000
         DC    CL29'NUMBER OF CCH FRAMES READ    '                      02566000
         DC    CL29'NUMBER OF DATA RECORDS MOVED '                      02567000
         DC    CL29'NUMBER OF MCH NOT SUMMED     '                      02568000
         DC    CL29'NUMBER OF CCH NOT SUMMED     '                      02569000
         DC    CL29'NUMBER OF FRAME READ ERRORS  '                      02570000
         DC    CL29'NUMBER OF MODELS WITHOUT FRMS'                      02571000
         DS    CL2                                                      02572000
RTYPCT   DC    10F'0'                                                   02573000
SUMFAIL  DC    9F'0'                                                    02574000
EDITFAIL DC    9F'0'                                                    02575000
RECNAMES DC    CL3'MCH'                                                 02576000
         DC    CL3'CCH'                                                 02577000
         DC    CL3'OBR'                                                 02578000
         DC    CL3'SFT'                                                 02579000
         DC    CL3'IPL'                                                 02580000
         DC    CL3'DDR'                                                 02581000
         DC    CL3'MIH'                                                 02582000
         DC    CL3'EOD'                                                 02583000
         DC    CL3'MDR'                                                 02584000
         DC    CL3'UKN'                                                 02585000
         DS    CL2                                                      02586000
PATCH    DC    40F'0'                                                   02587000
IFCEDSUM CSECT                                                          02588000
         DC    S(SUPERZAP)                                              02589000
IFCEDSUM CSECT                                                          02590000
L4      EQU       4                                                     02591000
IFCEDSUM CSECT                                                          02592000
      DC    S(PATCH)       SET THE ADDRESSABILITY FOR THE PATCH AREA    02593000
IFCEDSUM CSECT                                                          02594000
IFCEEDIT DC  V(IFCEEDIT)                                                02595000
IFCESUMS DC  V(IFCESUMS)                                                02596000
IFCEDSUM CSECT                                                          02597000
MVCINS   MVC  R0(R0,R6),0(R8)                                           02598000
IFCEDSUM CSECT                                                          02599000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02600000
@01      EQU   01                                                       02601000
@02      EQU   02                                                       02602000
@03      EQU   03                                                       02603000
@04      EQU   04                                                       02604000
@05      EQU   05                                                       02605000
@06      EQU   06                                                       02606000
@07      EQU   07                                                       02607000
@08      EQU   08                                                       02608000
@09      EQU   09                                                       02609000
@10      EQU   10                                                       02610000
@11      EQU   11                                                       02611000
@12      EQU   12                                                       02612000
@13      EQU   13                                                       02613000
@14      EQU   14                                                       02614000
@15      EQU   15                                                       02615000
R0       EQU   @00                                                      02616000
R1       EQU   @01                                                      02617000
R2       EQU   @02                                                      02618000
R4       EQU   @04                                                      02619000
R5       EQU   @05                                                      02620000
R6       EQU   @06                                                      02621000
R7       EQU   @07                                                      02622000
R8       EQU   @08                                                      02623000
R9       EQU   @09                                                      02624000
R12      EQU   @12                                                      02625000
R15      EQU   @15                                                      02626000
R10      EQU   @10                                                      02627000
R11      EQU   @11                                                      02628000
R13      EQU   @13                                                      02629000
R14      EQU   @14                                                      02630000
R3       EQU   @03                                                      02631000
IOHND    EQU   0                                                        02632000
IFCMSG   EQU   0                                                        02633000
PARM     EQU   0                                                        02634000
RECTYPE  EQU   PARM                                                     02635000
SWITCHES EQU   PARM+2                                                   02636000
SHORTOBR EQU   SWITCHES                                                 02637000
ZEROALL  EQU   SWITCHES+1                                               02638000
DEBUG    EQU   PARM+4                                                   02639000
DEBUG0   EQU   DEBUG                                                    02640000
DEBUG2   EQU   DEBUG                                                    02641000
DEBUG4   EQU   DEBUG                                                    02642000
DEBUG9   EQU   DEBUG+1                                                  02643000
DEBUG10  EQU   DEBUG+1                                                  02644000
DEBUG12  EQU   DEBUG+1                                                  02645000
DEBUG14  EQU   DEBUG+1                                                  02646000
DEBUG17  EQU   DEBUG+2                                                  02647000
DEBUG19  EQU   DEBUG+2                                                  02648000
DEBUGA   EQU   PARM+8                                                   02649000
DEBUG48  EQU   DEBUGA+2                                                 02650000
MISC     EQU   PARM+12                                                  02651000
PRINTES  EQU   MISC                                                     02652000
PEDIT    EQU   PRINTES                                                  02653000
PSUM     EQU   PRINTES                                                  02654000
OPENCLSE EQU   PARM+13                                                  02655000
OPENIO   EQU   OPENCLSE                                                 02656000
CLOSEIO  EQU   OPENCLSE+2                                               02657000
DATENOW  EQU   PARM+17                                                  02658000
STDT     EQU   PARM+23                                                  02659000
STDATE   EQU   STDT                                                     02660000
PSTD     EQU   STDATE+1                                                 02661000
ENDDT    EQU   PARM+31                                                  02662000
ENDDATE  EQU   ENDDT                                                    02663000
PEND     EQU   ENDDATE+1                                                02664000
STTIME1  EQU   PARM+39                                                  02665000
ENDTIME1 EQU   PARM+43                                                  02666000
STTIME2  EQU   PARM+47                                                  02667000
ENDTIME2 EQU   PARM+51                                                  02668000
STRTDATE EQU   PARM+55                                                  02669000
@NM00007 EQU   PARM+75                                                  02670000
SORTNUM  EQU   PARM+84                                                  02671000
ERRID    EQU   PARM+92                                                  02672000
IDTIMEA  EQU   ERRID+6                                                  02673000
IDTIME   EQU   IDTIMEA                                                  02674000
CCHHRLNG EQU   PARM+112                                                 02675000
RECCCHHR EQU   CCHHRLNG                                                 02676000
RECLNGTH EQU   CCHHRLNG+6                                               02677000
ADIOHND  EQU   PARM+124                                                 02678000
ADIFCMSG EQU   PARM+128                                                 02679000
ADEDITB  EQU   PARM+132                                                 02680000
EVPTR    EQU   PARM+136                                                 02681000
SORTADR  EQU   PARM+140                                                 02682000
PRINTADR EQU   PARM+148                                                 02683000
CUAPTR   EQU   PARM+152                                                 02684000
DEVPTR   EQU   PARM+156                                                 02685000
MODPTR   EQU   PARM+160                                                 02686000
SERPTR   EQU   PARM+164                                                 02687000
VOLPTR   EQU   PARM+168                                                 02688000
CPUPTR   EQU   PARM+172                                                 02689000
CPCUAPTR EQU   PARM+176                                                 02690000
LIBADPTR EQU   PARM+180                                                 02691000
SYMCDPTR EQU   PARM+184                                                 02692000
SYSUMPTR EQU   PARM+188                                                 02693000
TRENPTR  EQU   PARM+192                                                 02694000
SHAREPTR EQU   PARM+196                                                 02695000
FRAMEPTR EQU   PARM+200                                                 02696000
RECLNGT1 EQU   PARM+204                                                 02697000
MERDCPTR EQU   PARM+208                                                 02698000
DUMPTABL EQU   PARM+228                                                 02699000
DUMPNUM  EQU   DUMPTABL                                                 02700000
DUMPINFO EQU   DUMPTABL+4                                               02701000
DUMPADR  EQU   DUMPINFO                                                 02702000
DUMPSIZE EQU   DUMPINFO+4                                               02703000
TRENDONE EQU   0                                                        02704000
TREGEN   EQU   TRENDONE+8                                               02705000
TRECCH0  EQU   TREGEN+8                                                 02706000
TREND2   EQU   0                                                        02707000
TRENDKEY EQU   TREND2                                                   02708000
TRENDRT  EQU   TRENDKEY+1                                               02709000
TRENCPUS EQU   TRENDKEY+3                                               02710000
TRENDITM EQU   TRENDKEY+4                                               02711000
EVTABLE  EQU   0                                                        02712000
EVSTOP   EQU   EVTABLE                                                  02713000
EVKEY    EQU   EVTABLE+6                                                02714000
SORTABLE EQU   0                                                        02715000
SORTKEY  EQU   SORTABLE                                                 02716000
SORTCCHR EQU   SORTABLE+5                                               02717000
SYSUMONE EQU   0                                                        02718000
SYSUM2   EQU   0                                                        02719000
SYSUMKEY EQU   SYSUM2                                                   02720000
SYSRT    EQU   SYSUMKEY+1                                               02721000
SYSCPUS  EQU   SYSUMKEY+3                                               02722000
SYSITEM  EQU   SYSUMKEY+4                                               02723000
SHARE    EQU   0                                                        02724000
SHAREIO  EQU   SHARE+2                                                  02725000
SHRCUCPU EQU   SHAREIO                                                  02726000
SHARECUA EQU   SHRCUCPU                                                 02727000
EDITLOAD EQU   0                                                        02728000
EDITNUM  EQU   EDITLOAD                                                 02729000
EDITABLE EQU   EDITLOAD+4                                               02730000
LOADNAME EQU   EDITABLE                                                 02731000
CUA      EQU   0                                                        02732000
CUAVAL   EQU   CUA+2                                                    02733000
DEVICE   EQU   0                                                        02734000
MODELS   EQU   0                                                        02735000
DEVSERAL EQU   0                                                        02736000
VOLUME   EQU   0                                                        02737000
CPUS     EQU   0                                                        02738000
CPUCUAS  EQU   0                                                        02739000
CPUCUAV  EQU   CPUCUAS+2                                                02740000
LIBADR   EQU   0                                                        02741000
SYMCODE  EQU   0                                                        02742000
SYMVAL   EQU   SYMCODE+2                                                02743000
MERIDIAN EQU   0                                                        02744000
LRTREC   EQU   0                                                        02745000
LRTKEY   EQU   LRTREC                                                   02746000
LRTKEY1  EQU   LRTKEY                                                   02747000
LRTSMS   EQU   LRTREC+2                                                 02748000
LRTNLAST EQU   LRTSMS                                                   02749000
LRTRUNC  EQU   LRTSMS                                                   02750000
LRTERRID EQU   LRTREC+3                                                 02751000
@NM00016 EQU   LRTREC+4                                                 02752000
LRTDT    EQU   LRTREC+8                                                 02753000
LRTDATE  EQU   LRTDT                                                    02754000
LRTYRDAY EQU   LRTDATE+1                                                02755000
LRTTIME  EQU   LRTDT+4                                                  02756000
LRTCPU   EQU   LRTREC+16                                                02757000
LRTCPMOD EQU   LRTCPU+1                                                 02758000
LRTMODEL EQU   LRTCPMOD+3                                               02759000
MCHREC   EQU   0                                                        02760000
MCHHEAD  EQU   MCHREC                                                   02761000
MCHKEY   EQU   MCHHEAD                                                  02762000
MCHSMS   EQU   MCHHEAD+2                                                02763000
MCHCPUID EQU   MCHHEAD+16                                               02764000
CCHREC   EQU   0                                                        02765000
CCHHEAD  EQU   CCHREC                                                   02766000
CCHKEY   EQU   CCHHEAD                                                  02767000
CCHSMS   EQU   CCHHEAD+2                                                02768000
CCHCPUID EQU   CCHHEAD+16                                               02769000
CCHCODE  EQU   CCHREC+68                                                02770000
CCHCODE2 EQU   CCHCODE+2                                                02771000
CCHID    EQU   CCHREC+72                                                02772000
OBRREC   EQU   0                                                        02773000
OBRHEAD  EQU   OBRREC                                                   02774000
OBRKEY   EQU   OBRHEAD                                                  02775000
OBRKEY1  EQU   OBRKEY                                                   02776000
OBRSMS   EQU   OBRHEAD+2                                                02777000
MISCSW   EQU   OBRSMS                                                   02778000
OBRSUBTP EQU   OBRSMS+1                                                 02779000
SHORTSW  EQU   OBRSUBTP                                                 02780000
OBRCPUID EQU   OBRHEAD+16                                               02781000
OBRJOBID EQU   OBRREC+24                                                02782000
OBRSDEV2 EQU   OBRJOBID+2                                               02783000
OBRSCUA  EQU   OBRJOBID+5                                               02784000
OBRFCCW  EQU   OBRREC+32                                                02785000
OBRSRDS  EQU   OBRFCCW                                                  02786000
OBRCSW   EQU   OBRREC+40                                                02787000
OBRSECUA EQU   OBRREC+49                                                02788000
OBRCODE  EQU   OBRREC+52                                                02789000
OBRDEV   EQU   OBRCODE+2                                                02790000
OBRSEEK  EQU   OBRREC+70                                                02791000
OBRTCAM  EQU   OBRSEEK                                                  02792000
OBRTERMN EQU   OBRSEEK+2                                                02793000
SFTREC   EQU   0                                                        02794000
SFTHEAD  EQU   SFTREC                                                   02795000
SFTKEY   EQU   SFTHEAD                                                  02796000
SFTCPUID EQU   SFTHEAD+16                                               02797000
SFTSDWA  EQU   SFTREC+32                                                02798000
SFTAEC1  EQU   SFTSDWA+96                                               02799000
SFTFLGS  EQU   SFTSDWA+232                                              02800000
SFTRECP  EQU   SFTSDWA+292                                              02801000
IPLREC   EQU   0                                                        02802000
IPLHEAD  EQU   IPLREC                                                   02803000
IPLKEY   EQU   IPLHEAD                                                  02804000
IPLCPUID EQU   IPLHEAD+16                                               02805000
IPLSTIME EQU   IPLREC+52                                                02806000
DDRREC   EQU   0                                                        02807000
DDRHEAD  EQU   DDRREC                                                   02808000
DDRKEY   EQU   DDRHEAD                                                  02809000
DDRSMS   EQU   DDRHEAD+2                                                02810000
DDRCPUID EQU   DDRHEAD+16                                               02811000
@NM00051 EQU   DDRREC+24                                                02812000
DDRFDEV  EQU   DDRREC+48                                                02813000
DDRCODE2 EQU   DDRFDEV+2                                                02814000
DDRTODEV EQU   DDRREC+56                                                02815000
MIHREC   EQU   0                                                        02816000
MIHHEAD  EQU   MIHREC                                                   02817000
MIHKEY   EQU   MIHHEAD                                                  02818000
MIHCPUID EQU   MIHHEAD+16                                               02819000
@NM00057 EQU   MIHREC+24                                                02820000
MIHDEV   EQU   MIHREC+44                                                02821000
MIHCODE2 EQU   MIHDEV+2                                                 02822000
EODREC   EQU   0                                                        02823000
EODHEAD  EQU   EODREC                                                   02824000
EODKEY   EQU   EODHEAD                                                  02825000
EODCPUID EQU   EODHEAD+16                                               02826000
TPRREC   EQU   0                                                        02827000
TPRHEAD  EQU   TPRREC                                                   02828000
TPRKEY   EQU   TPRHEAD                                                  02829000
TPRDEV   EQU   TPRHEAD+4                                                02830000
TPRBUFC  EQU   TPRHEAD+5                                                02831000
TPRCPUID EQU   TPRHEAD+16                                               02832000
TPRCUA   EQU   TPRREC+24                                                02833000
@NM00065 EQU   TPRREC+26                                                02834000
MCFREC   EQU   0                                                        02835000
MCFHEAD  EQU   MCFREC                                                   02836000
MCFKEY   EQU   MCFHEAD                                                  02837000
MCFSMS   EQU   MCFHEAD+2                                                02838000
@NM00073 EQU   MCFHEAD+16                                               02839000
MCFSMO   EQU   MCFHEAD+17                                               02840000
CCFREC   EQU   0                                                        02841000
CCFHEAD  EQU   CCFREC                                                   02842000
CCFKEY   EQU   CCFHEAD                                                  02843000
CCFSMS   EQU   CCFHEAD+2                                                02844000
@NM00081 EQU   CCFHEAD+16                                               02845000
CCFSMO   EQU   CCFHEAD+17                                               02846000
TABLE    EQU   0                                                        02847000
TABLETYP EQU   TABLE                                                    02848000
TABLECHH EQU   TABLE+5                                                  02849000
NEXTBYTE EQU   0                                                        02850000
ADDNUM   EQU   0                                                        02851000
TBLEN    EQU   0                                                        02852000
MERDTYP  EQU   TBLEN                                                    02853000
ENTRYA   EQU   TBLEN+3                                                  02854000
FRAMETAB EQU   0                                                        02855000
FRAMENUM EQU   FRAMETAB                                                 02856000
FRAMEDTA EQU   FRAMETAB+4                                               02857000
FRAMEKEY EQU   FRAMEDTA                                                 02858000
FRAMECPU EQU   FRAMEKEY                                                 02859000
FRAMEMOD EQU   FRAMECPU+3                                               02860000
FRAMEDT  EQU   FRAMEKEY+5                                               02861000
FRAMETYP EQU   FRAMEKEY+13                                              02862000
FRAMLOCM EQU   FRAMEDTA+16                                              02863000
FRAMLOCC EQU   FRAMEDTA+20                                              02864000
LISTLOC  EQU   0                                                        02865000
LISTNUM  EQU   LISTLOC                                                  02866000
LISTCCHR EQU   LISTLOC+4                                                02867000
RECUKNO  EQU   PLINE                                                    02868000
DBUG02   EQU   PRTLINE+7                                                02869000
RTYPS    EQU   DBUG02+11                                                02870000
UNUMBER  EQU   DBUG02+38                                                02871000
PROGNAME EQU   PRTLINE                                                  02872000
PRGNAME  EQU   PROGNAME                                                 02873000
PRTL1    EQU   PRTLINE                                                  02874000
PRTL2    EQU   PRTLINE                                                  02875000
MISINFO  EQU   PRTLINE                                                  02876000
MISCOUNT EQU   CUAMODCT                                                 02877000
SPACING  EQU   PRINTCHR                                                 02878000
MISINFO1 EQU   PRTLINE                                                  02879000
MISSNAME EQU   PRTLINE+8                                                02880000
IDXEDIT  EQU   ENMEFAIL                                                 02881000
IDXSUM   EQU   SNMEFAIL                                                 02882000
WORKOVER EQU   WORK                                                     02883000
COUNTTBL EQU   MCHCOUNT                                                 02884000
MCHCCHDR EQU   MCHDROP                                                  02885000
THISNAME EQU   PRTLINE                                                  02886000
SORTENTR EQU   PRTLINE+9                                                02887000
NAME     EQU   EDVAR                                                    02888000
BADCOUNT EQU   PRTLINE                                                  02889000
CHARS1   EQU   CHARFILL                                                 02890000
PRTL3    EQU   PRTLINE                                                  02891000
RTYP1    EQU   EXPL1+13                                                 02892000
TRECCH   EQU   TRECCH0                                                  02893000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02894000
@NM00091 EQU   PROGNAME+8                                               02895000
@NM00090 EQU   DBUG02+14                                                02896000
@NM00089 EQU   DBUG02                                                   02897000
UKCOUNT  EQU   RECUKNO+20                                               02898000
@NM00086 EQU   RECUKNO+10                                               02899000
NME      EQU   RECUKNO+7                                                02900000
@NM00085 EQU   RECUKNO                                                  02901000
FRAMETIM EQU   FRAMEDT+4                                                02902000
FRAMEDAT EQU   FRAMEDT                                                  02903000
FRAMESER EQU   FRAMECPU                                                 02904000
@NM00112 EQU   TBLEN+1                                                  02905000
CCFFRAME EQU   CCFREC+24                                                02906000
@NM00083 EQU   CCFHEAD+22                                               02907000
CCFMOD   EQU   CCFSMO+3                                                 02908000
CCFSER   EQU   CCFSMO                                                   02909000
CCFVER   EQU   @NM00081                                                 02910000
@NM00082 EQU   @NM00081                                                 02911000
CCFTIMD  EQU   CCFHEAD+12                                               02912000
CCFDAT   EQU   CCFHEAD+8                                                02913000
@NM00080 EQU   CCFHEAD+7                                                02914000
CCFCNT   EQU   CCFHEAD+6                                                02915000
@NM00079 EQU   CCFHEAD+4                                                02916000
@NM00078 EQU   CCFSMS+1                                                 02917000
CCFCPU   EQU   CCFSMS+1                                                 02918000
CCFMP    EQU   CCFSMS+1                                                 02919000
@NM00077 EQU   CCFSMS                                                   02920000
CCFTIM   EQU   CCFSMS                                                   02921000
@NM00076 EQU   CCFSMS                                                   02922000
CCFTRU   EQU   CCFSMS                                                   02923000
CCFTOD   EQU   CCFSMS                                                   02924000
CCFLST   EQU   CCFSMS                                                   02925000
CCFKEY2  EQU   CCFKEY+1                                                 02926000
CCFKEY1  EQU   CCFKEY                                                   02927000
MCFFRAME EQU   MCFREC+24                                                02928000
@NM00075 EQU   MCFHEAD+22                                               02929000
MCFMOD   EQU   MCFSMO+3                                                 02930000
MCFSER   EQU   MCFSMO                                                   02931000
MCFVER   EQU   @NM00073                                                 02932000
@NM00074 EQU   @NM00073                                                 02933000
MCFTIMD  EQU   MCFHEAD+12                                               02934000
MCFDAT   EQU   MCFHEAD+8                                                02935000
@NM00072 EQU   MCFHEAD+7                                                02936000
MCFCNT   EQU   MCFHEAD+6                                                02937000
@NM00071 EQU   MCFHEAD+4                                                02938000
@NM00070 EQU   MCFSMS+1                                                 02939000
MCFCPU   EQU   MCFSMS+1                                                 02940000
MCFMP    EQU   MCFSMS+1                                                 02941000
@NM00069 EQU   MCFSMS                                                   02942000
MCFTIM   EQU   MCFSMS                                                   02943000
@NM00068 EQU   MCFSMS                                                   02944000
MCFTRU   EQU   MCFSMS                                                   02945000
MCFTOD   EQU   MCFSMS                                                   02946000
MCFLST   EQU   MCFSMS                                                   02947000
MCFKEY2  EQU   MCFKEY+1                                                 02948000
MCFKEY1  EQU   MCFKEY                                                   02949000
DVBSDRE  EQU   TPRREC+56                                                02950000
@NM00067 EQU   TPRREC+39                                                02951000
TPRMODE  EQU   TPRREC+38                                                02952000
TPRLINAD EQU   TPRREC+36                                                02953000
@NM00066 EQU   TPRREC+34                                                02954000
TPRVOL   EQU   @NM00065                                                 02955000
TPRCEL   EQU   TPRCPUID+6                                               02956000
TPRMODEL EQU   TPRCPUID+4                                               02957000
TPRSER   EQU   TPRCPUID+1                                               02958000
@NM00064 EQU   TPRCPUID                                                 02959000
TPRTIME  EQU   TPRHEAD+12                                               02960000
TPRDATE  EQU   TPRHEAD+8                                                02961000
@NM00063 EQU   TPRHEAD+6                                                02962000
TPRLENGT EQU   TPRBUFC                                                  02963000
@NM00062 EQU   TPRBUFC                                                  02964000
TPRSMS   EQU   TPRHEAD+2                                                02965000
TPRKEY2  EQU   TPRKEY+1                                                 02966000
TPRKEY1  EQU   TPRKEY                                                   02967000
EODCEL   EQU   EODCPUID+6                                               02968000
EODMODEL EQU   EODCPUID+4                                               02969000
EODSER   EQU   EODCPUID+1                                               02970000
@NM00061 EQU   EODCPUID                                                 02971000
EODTIME  EQU   EODHEAD+12                                               02972000
EODDATE  EQU   EODHEAD+8                                                02973000
@NM00060 EQU   EODHEAD+5                                                02974000
EODDEV   EQU   EODHEAD+4                                                02975000
EODSMS   EQU   EODHEAD+2                                                02976000
EODKEY2  EQU   EODKEY+1                                                 02977000
EODKEY1  EQU   EODKEY                                                   02978000
MIHTYPE  EQU   MIHCODE2+1                                               02979000
MIHCLASS EQU   MIHCODE2                                                 02980000
@NM00059 EQU   MIHDEV                                                   02981000
MIHVOL   EQU   MIHREC+38                                                02982000
MIHCUA   EQU   MIHREC+35                                                02983000
@NM00058 EQU   @NM00057+8                                               02984000
MIHJOBID EQU   @NM00057                                                 02985000
MIHCEL   EQU   MIHCPUID+6                                               02986000
MIHMOD   EQU   MIHCPUID+4                                               02987000
MIHSER   EQU   MIHCPUID+1                                               02988000
@NM00056 EQU   MIHCPUID                                                 02989000
MIHTIME  EQU   MIHHEAD+12                                               02990000
MIHDATE  EQU   MIHHEAD+8                                                02991000
@NM00055 EQU   MIHHEAD+6                                                02992000
@NM00054 EQU   MIHHEAD+5                                                02993000
MIHDEBIT EQU   MIHHEAD+5                                                02994000
MIHCEBIT EQU   MIHHEAD+5                                                02995000
@NM00053 EQU   MIHHEAD+4                                                02996000
MIHSMS   EQU   MIHHEAD+2                                                02997000
MIHKEY2  EQU   MIHKEY+1                                                 02998000
MIHKEY1  EQU   MIHKEY                                                   02999000
DDRDEV2  EQU   DDRTODEV+2                                               03000000
DDRDEV1  EQU   DDRTODEV                                                 03001000
DDRTOCUA EQU   DDRREC+53                                                03002000
@NM00052 EQU   DDRREC+52                                                03003000
DDRTYPE  EQU   DDRCODE2+1                                               03004000
DDRCLASS EQU   DDRCODE2                                                 03005000
DDRCODE1 EQU   DDRFDEV                                                  03006000
DDRFCUA  EQU   DDRREC+45                                                03007000
DDRPHD   EQU   @NM00051+20                                              03008000
DDRVOL2  EQU   @NM00051+14                                              03009000
DDRVOL1  EQU   @NM00051+8                                               03010000
DDRJOBID EQU   @NM00051                                                 03011000
DDRCEL   EQU   DDRCPUID+6                                               03012000
DDRMOD   EQU   DDRCPUID+4                                               03013000
DDRSER   EQU   DDRCPUID+1                                               03014000
@NM00050 EQU   DDRCPUID                                                 03015000
DDRTIME  EQU   DDRHEAD+12                                               03016000
DDRDATE  EQU   DDRHEAD+8                                                03017000
@NM00049 EQU   DDRHEAD+4                                                03018000
DDRDEPSW EQU   DDRSMS+1                                                 03019000
@NM00048 EQU   DDRSMS                                                   03020000
DDRKEY2  EQU   DDRKEY+1                                                 03021000
DDRKEY1  EQU   DDRKEY                                                   03022000
IPLSHSEC EQU   IPLSTIME+3                                               03023000
IPLSSEC  EQU   IPLSTIME+2                                               03024000
IPLSMIN  EQU   IPLSTIME+1                                               03025000
IPLSHOUR EQU   IPLSTIME                                                 03026000
IPLSDATE EQU   IPLREC+48                                                03027000
IPLTEMP  EQU   IPLREC+46                                                03028000
IPLHIGH  EQU   IPLREC+42                                                03029000
IPLCHAN  EQU   IPLREC+32                                                03030000
@NM00047 EQU   IPLREC+30                                                03031000
IPLREAS  EQU   IPLREC+28                                                03032000
@NM00046 EQU   IPLREC+25                                                03033000
IPLSYSID EQU   IPLREC+24                                                03034000
IPLCEL   EQU   IPLCPUID+6                                               03035000
IPLMOD   EQU   IPLCPUID+4                                               03036000
IPLSER   EQU   IPLCPUID+1                                               03037000
@NM00045 EQU   IPLCPUID                                                 03038000
IPLTIME  EQU   IPLHEAD+12                                               03039000
IPLDATE  EQU   IPLHEAD+8                                                03040000
@NM00044 EQU   IPLHEAD+4                                                03041000
IPLSMS   EQU   IPLHEAD+2                                                03042000
IPLKEY2  EQU   IPLKEY+1                                                 03043000
IPLKEY1  EQU   IPLKEY                                                   03044000
SFTXDATA EQU   SFTREC+434                                               03045000
SFTLVARA EQU   SFTREC+432                                               03046000
SFTREXN  EQU   SFTRECP+16                                               03047000
SFTCSECT EQU   SFTRECP+8                                                03048000
SFTMODN  EQU   SFTRECP                                                  03049000
@NM00043 EQU   SFTSDWA+238                                              03050000
SFTLCPUA EQU   SFTSDWA+236                                              03051000
SFTERRD  EQU   SFTFLGS+3                                                03052000
SFTERRC  EQU   SFTFLGS+2                                                03053000
SFTERRB  EQU   SFTFLGS+1                                                03054000
SFTERRA  EQU   SFTFLGS                                                  03055000
@NM00042 EQU   SFTSDWA+136                                              03056000
SFTAAEC1 EQU   SFTSDWA+120                                              03057000
@NM00041 EQU   SFTSDWA+112                                              03058000
SFTPROGC EQU   SFTAEC1+8                                                03059000
@NM00040 EQU   SFTAEC1                                                  03060000
@NM00039 EQU   SFTSDWA+88                                               03061000
SFTGRSV  EQU   SFTSDWA+24                                               03062000
SFTABNDC EQU   SFTSDWA                                                  03063000
SFTJOBID EQU   SFTREC+24                                                03064000
SFTCEL   EQU   SFTCPUID+6                                               03065000
SFTMOD   EQU   SFTCPUID+4                                               03066000
SFTSER   EQU   SFTCPUID+1                                               03067000
@NM00038 EQU   SFTCPUID                                                 03068000
SFTTIME  EQU   SFTHEAD+12                                               03069000
SFTDATE  EQU   SFTHEAD+8                                                03070000
@NM00037 EQU   SFTHEAD+4                                                03071000
SFTSMS   EQU   SFTHEAD+2                                                03072000
SFTKEY2  EQU   SFTKEY+1                                                 03073000
SFTKEY1  EQU   SFTKEY                                                   03074000
OBR34CT2 EQU   OBRTERMN+5                                               03075000
OBR34CT1 EQU   OBRTERMN+4                                               03076000
@NM00036 EQU   OBRTERMN                                                 03077000
@NM00035 EQU   OBRSEEK+1                                                03078000
OBRVOL   EQU   OBRREC+64                                                03079000
OBRSBCNT EQU   OBRREC+62                                                03080000
OBRRETRY EQU   OBRREC+60                                                03081000
OBRPCUA  EQU   OBRREC+57                                                03082000
OBRLSDRC EQU   OBRREC+56                                                03083000
OBRTYPE  EQU   OBRDEV+1                                                 03084000
OBRCLASS EQU   OBRDEV                                                   03085000
OBRCODE1 EQU   OBRCODE                                                  03086000
OBRDEVDC EQU   OBRREC+48                                                03087000
OBRSTAT  EQU   OBRCSW+4                                                 03088000
@NM00034 EQU   OBRCSW                                                   03089000
OBRSDRS2 EQU   OBRSRDS                                                  03090000
OBRSDRS1 EQU   OBRSRDS                                                  03091000
OBRSSDRC EQU   OBRJOBID+4                                               03092000
OBRSDEV1 EQU   OBRJOBID                                                 03093000
OBRCEL   EQU   OBRCPUID+6                                               03094000
OBRMOD   EQU   OBRCPUID+4                                               03095000
OBRSER   EQU   OBRCPUID+1                                               03096000
@NM00033 EQU   OBRCPUID                                                 03097000
OBRTIME  EQU   OBRHEAD+12                                               03098000
OBRDATE  EQU   OBRHEAD+8                                                03099000
@NM00032 EQU   OBRHEAD+4                                                03100000
@NM00031 EQU   OBRSUBTP                                                 03101000
DISMOUNT EQU   OBRSUBTP                                                 03102000
@NM00030 EQU   OBRSUBTP                                                 03103000
OBRTEMP  EQU   OBRSUBTP                                                 03104000
SDRCOUNT EQU   OBRSUBTP                                                 03105000
@NM00029 EQU   MISCSW                                                   03106000
TRUNC    EQU   MISCSW                                                   03107000
@NM00028 EQU   MISCSW                                                   03108000
OBRKEY2  EQU   OBRKEY+1                                                 03109000
CCHLOG   EQU   CCHREC+80                                                03110000
CCHMP    EQU   CCHREC+76                                                03111000
CCHCUA   EQU   CCHREC+74                                                03112000
@NM00027 EQU   CCHREC+73                                                03113000
CCHTYPE  EQU   CCHCODE2+1                                               03114000
CCHCLASS EQU   CCHCODE2                                                 03115000
CCHCODE1 EQU   CCHCODE                                                  03116000
CCHECSW  EQU   CCHREC+64                                                03117000
CCHCSW   EQU   CCHREC+56                                                03118000
CCHFCCW  EQU   CCHREC+48                                                03119000
CCHATIO  EQU   CCHREC+32                                                03120000
CCHJOBID EQU   CCHREC+24                                                03121000
CCHCEL   EQU   CCHCPUID+6                                               03122000
CCHMOD   EQU   CCHCPUID+4                                               03123000
CCHSER   EQU   CCHCPUID+1                                               03124000
@NM00026 EQU   CCHCPUID                                                 03125000
CCHTIME  EQU   CCHHEAD+12                                               03126000
CCHDATE  EQU   CCHHEAD+8                                                03127000
@NM00025 EQU   CCHHEAD+4                                                03128000
CCHRINC  EQU   CCHSMS+1                                                 03129000
@NM00024 EQU   CCHSMS                                                   03130000
CCHRCRH  EQU   CCHSMS                                                   03131000
@NM00023 EQU   CCHSMS                                                   03132000
CCHKEY2  EQU   CCHKEY+1                                                 03133000
CCHKEY1  EQU   CCHKEY                                                   03134000
MCHLOG   EQU   MCHREC+48                                                03135000
MCHOPSW  EQU   MCHREC+40                                                03136000
MCHJOBID EQU   MCHREC+32                                                03137000
MCHPGMID EQU   MCHREC+24                                                03138000
MCHCEL   EQU   MCHCPUID+6                                               03139000
MCHMOD   EQU   MCHCPUID+4                                               03140000
MCHSER   EQU   MCHCPUID+1                                               03141000
@NM00022 EQU   MCHCPUID                                                 03142000
MCHTIME  EQU   MCHHEAD+12                                               03143000
MCHDATE  EQU   MCHHEAD+8                                                03144000
@NM00021 EQU   MCHHEAD+4                                                03145000
MCHSYSTR EQU   MCHSMS+1                                                 03146000
@NM00020 EQU   MCHSMS                                                   03147000
MCHKEY2  EQU   MCHKEY+1                                                 03148000
MCHKEY1  EQU   MCHKEY                                                   03149000
LRTMCEL  EQU   LRTCPU+6                                                 03150000
LRTCPUS  EQU   LRTCPMOD                                                 03151000
@NM00019 EQU   LRTCPU                                                   03152000
LRTHSECS EQU   LRTTIME+3                                                03153000
LRTSEC   EQU   LRTTIME+2                                                03154000
LRTMIN   EQU   LRTTIME+1                                                03155000
LRTHOUR  EQU   LRTTIME                                                  03156000
LRTDAY   EQU   LRTYRDAY+1                                               03157000
LRTYEAR  EQU   LRTYRDAY                                                 03158000
LRTDATE0 EQU   LRTDATE                                                  03159000
@NM00018 EQU   @NM00016+3                                               03160000
LRTCNT   EQU   @NM00016+2                                               03161000
@NM00017 EQU   @NM00016                                                 03162000
LRTDSMNT EQU   LRTERRID                                                 03163000
@NM00015 EQU   LRTERRID                                                 03164000
LRTSHRT  EQU   LRTERRID                                                 03165000
@NM00014 EQU   LRTERRID                                                 03166000
@NM00013 EQU   LRTSMS                                                   03167000
LRTIMCNV EQU   LRTSMS                                                   03168000
@NM00012 EQU   LRTSMS                                                   03169000
LRNS     EQU   LRTSMS                                                   03170000
LRTKEY2  EQU   LRTKEY+1                                                 03171000
MODEL    EQU   MERIDIAN+2                                               03172000
MRDNUMBR EQU   MERIDIAN                                                 03173000
SYMVAL2  EQU   SYMVAL+2                                                 03174000
SYMVAL1  EQU   SYMVAL                                                   03175000
SYMCDNUM EQU   SYMCODE                                                  03176000
LIBVAL   EQU   LIBADR+2                                                 03177000
LIBADNUM EQU   LIBADR                                                   03178000
CPUCUX3  EQU   CPUCUAV+5                                                03179000
CPUCUX2  EQU   CPUCUAV+3                                                03180000
CPUCUX1  EQU   CPUCUAV                                                  03181000
CPCUANUM EQU   CPUCUAS                                                  03182000
CPUVAL   EQU   CPUS+2                                                   03183000
CPUNUM   EQU   CPUS                                                     03184000
VOLVAL   EQU   VOLUME+2                                                 03185000
VOLNUM   EQU   VOLUME                                                   03186000
SERVAL   EQU   DEVSERAL+2                                               03187000
SERNUM   EQU   DEVSERAL                                                 03188000
MODVAL   EQU   MODELS+2                                                 03189000
MODNUM   EQU   MODELS                                                   03190000
MDRVAL   EQU   DEVICE+204                                               03191000
MDRNUM   EQU   DEVICE+202                                               03192000
DEVVAL   EQU   DEVICE+2                                                 03193000
DEVNUM   EQU   DEVICE                                                   03194000
CUA2     EQU   CUAVAL+2                                                 03195000
CUA1     EQU   CUAVAL                                                   03196000
CUANUM   EQU   CUA                                                      03197000
LOADPTR  EQU   EDITABLE+8                                               03198000
SHARLET  EQU   SHAREIO+10                                               03199000
SHARSERB EQU   SHAREIO+7                                                03200000
SHARECUB EQU   SHAREIO+5                                                03201000
SHARSERA EQU   SHRCUCPU+2                                               03202000
SHAREDX  EQU   SHARECUA                                                 03203000
SHARENUM EQU   SHARE                                                    03204000
SYSTEMP  EQU   SYSUM2+9                                                 03205000
SYSPERM  EQU   SYSUM2+7                                                 03206000
SYSDEV   EQU   SYSUM2+5                                                 03207000
SYSOLDA  EQU   SYSITEM                                                  03208000
SYS3705  EQU   SYSITEM                                                  03209000
SYSOLD   EQU   SYSCPUS                                                  03210000
SYSCPU   EQU   SYSCPUS                                                  03211000
SYSCUA   EQU   SYSRT                                                    03212000
SYSGROUP EQU   SYSUMKEY                                                 03213000
SYSUMEOD EQU   SYSUMONE+96                                              03214000
SYSUMPER EQU   SYSUMONE+92                                              03215000
SYSUMPEA EQU   SYSUMONE+88                                              03216000
SYSUMPEI EQU   SYSUMONE+84                                              03217000
SYSUMCH  EQU   SYSUMONE+20                                              03218000
SYSUMMCN EQU   SYSUMONE+16                                              03219000
SYSUMMCR EQU   SYSUMONE+12                                              03220000
SYSUMNXT EQU   SYSUMONE+8                                               03221000
SYSUMIPL EQU   SYSUMONE+4                                               03222000
SYSUMNUM EQU   SYSUMONE                                                 03223000
SORTCORE EQU   SORTCCHR                                                 03224000
SORTTIME EQU   SORTKEY+1                                                03225000
SORTYEAR EQU   SORTKEY                                                  03226000
EVLETTER EQU   EVKEY+5                                                  03227000
EVSERIAL EQU   EVKEY+2                                                  03228000
EVMODEL  EQU   EVKEY                                                    03229000
EVNUM    EQU   EVTABLE+4                                                03230000
EVDAY    EQU   EVSTOP+1                                                 03231000
EVYEAR   EQU   EVSTOP                                                   03232000
TRETMP   EQU   TREND2+10                                                03233000
TREPRM   EQU   TREND2+8                                                 03234000
TRENDDEV EQU   TREND2+6                                                 03235000
TRENDDAT EQU   TRENDKEY+5                                               03236000
TRENDOD  EQU   TRENDITM                                                 03237000
TREND037 EQU   TRENDITM                                                 03238000
TRENDOLD EQU   TRENCPUS                                                 03239000
TRENDCPU EQU   TRENCPUS                                                 03240000
@NM00011 EQU   TRENDRT+1                                                03241000
TRENDCUA EQU   TRENDRT                                                  03242000
TRENDGRP EQU   TRENDKEY                                                 03243000
TREPRE   EQU   TREGEN+72                                                03244000
TRECCHF  EQU   TREGEN+68                                                03245000
TRECCHE  EQU   TREGEN+64                                                03246000
TRECCHD  EQU   TREGEN+60                                                03247000
TRECCHC  EQU   TREGEN+56                                                03248000
TRECCHB  EQU   TREGEN+52                                                03249000
TRECCHA  EQU   TREGEN+48                                                03250000
TRECCH9  EQU   TREGEN+44                                                03251000
TRECCH8  EQU   TREGEN+40                                                03252000
TRECCH7  EQU   TREGEN+36                                                03253000
TRECCH6  EQU   TREGEN+32                                                03254000
TRECCH5  EQU   TREGEN+28                                                03255000
TRECCH4  EQU   TREGEN+24                                                03256000
TRECCH3  EQU   TREGEN+20                                                03257000
TRECCH2  EQU   TREGEN+16                                                03258000
TRECCH1  EQU   TREGEN+12                                                03259000
TREMCH   EQU   TREGEN+4                                                 03260000
TREIPL   EQU   TREGEN                                                   03261000
TRENUM   EQU   TRENDONE+4                                               03262000
TRENEXT  EQU   TRENDONE                                                 03263000
@NM00010 EQU   PARM+212                                                 03264000
ADCPUT   EQU   PARM+144                                                 03265000
LINECT   EQU   PARM+120                                                 03266000
@NM00009 EQU   CCHHRLNG+5                                               03267000
USERPGM  EQU   PARM+102                                                 03268000
IDTSEC   EQU   IDTIME+3                                                 03269000
IDSEC    EQU   IDTIME+2                                                 03270000
IDMIN    EQU   IDTIME+1                                                 03271000
IDHOUR   EQU   IDTIME                                                   03272000
IDASID   EQU   ERRID+4                                                  03273000
IDCPU    EQU   ERRID+3                                                  03274000
@NM00008 EQU   ERRID+2                                                  03275000
IDVALUE  EQU   ERRID                                                    03276000
NUMDAYS  EQU   PARM+88                                                  03277000
TABSIZE  EQU   PARM+80                                                  03278000
SYSRETRN EQU   @NM00007                                                 03279000
@NM00006 EQU   PARM+72                                                  03280000
WRTHRSH  EQU   PARM+69                                                  03281000
RDTHRSH  EQU   PARM+66                                                  03282000
TERM     EQU   PARM+58                                                  03283000
EVSDAY   EQU   STRTDATE+1                                               03284000
EVSYEAR  EQU   STRTDATE                                                 03285000
PENSEC2  EQU   ENDTIME2+2                                               03286000
PENMIN2  EQU   ENDTIME2+1                                               03287000
PENHOUR2 EQU   ENDTIME2                                                 03288000
PSTSEC2  EQU   STTIME2+2                                                03289000
PSTMIN2  EQU   STTIME2+1                                                03290000
PSTHOUR2 EQU   STTIME2                                                  03291000
PENSEC1  EQU   ENDTIME1+2                                               03292000
PENMIN1  EQU   ENDTIME1+1                                               03293000
PENHOUR1 EQU   ENDTIME1                                                 03294000
PSTSEC1  EQU   STTIME1+2                                                03295000
PSTMIN1  EQU   STTIME1+1                                                03296000
PSTHOUR1 EQU   STTIME1                                                  03297000
@NM00005 EQU   ENDDT+4                                                  03298000
PENDY    EQU   PEND+1                                                   03299000
PENYR    EQU   PEND                                                     03300000
@NM00004 EQU   ENDDATE                                                  03301000
@NM00003 EQU   STDT+4                                                   03302000
PSTDY    EQU   PSTD+1                                                   03303000
PSTYR    EQU   PSTD                                                     03304000
@NM00002 EQU   STDATE                                                   03305000
YEARNOW  EQU   DATENOW+4                                                03306000
@NM00001 EQU   DATENOW+3                                                03307000
DAYNOW   EQU   DATENOW                                                  03308000
CSNAP    EQU   CLOSEIO                                                  03309000
CDRCTWRK EQU   CLOSEIO                                                  03310000
CSYSIN   EQU   CLOSEIO                                                  03311000
CACCDEV  EQU   CLOSEIO                                                  03312000
CACCIN   EQU   CLOSEIO                                                  03313000
CSERLOG  EQU   CLOSEIO                                                  03314000
CEREPPT  EQU   CLOSEIO                                                  03315000
CTOURIST EQU   CLOSEIO                                                  03316000
OSNAP    EQU   OPENIO                                                   03317000
ODRCTWRK EQU   OPENIO                                                   03318000
OSYSIN   EQU   OPENIO                                                   03319000
OACCDEV  EQU   OPENIO                                                   03320000
OACCIN   EQU   OPENIO                                                   03321000
OSERLOG  EQU   OPENIO                                                   03322000
OEREPPT  EQU   OPENIO                                                   03323000
OTOURIST EQU   OPENIO                                                   03324000
PASSFLAG EQU   MISC                                                     03325000
PLOGREC  EQU   MISC                                                     03326000
ERRORID  EQU   MISC                                                     03327000
PHIST    EQU   MISC                                                     03328000
PACC     EQU   MISC                                                     03329000
PZERO    EQU   MISC                                                     03330000
DEBUG63  EQU   DEBUGA+3                                                 03331000
DEBUG62  EQU   DEBUGA+3                                                 03332000
DEBUG61  EQU   DEBUGA+3                                                 03333000
DEBUG60  EQU   DEBUGA+3                                                 03334000
DEBUG59  EQU   DEBUGA+3                                                 03335000
DEBUG58  EQU   DEBUGA+3                                                 03336000
DEBUG57  EQU   DEBUGA+3                                                 03337000
DEBUG56  EQU   DEBUGA+3                                                 03338000
DEBUG55  EQU   DEBUGA+2                                                 03339000
DEBUG54  EQU   DEBUGA+2                                                 03340000
DEBUG53  EQU   DEBUGA+2                                                 03341000
DEBUG52  EQU   DEBUGA+2                                                 03342000
DEBUG51  EQU   DEBUGA+2                                                 03343000
DEBUG50  EQU   DEBUGA+2                                                 03344000
DEBUG49  EQU   DEBUGA+2                                                 03345000
DEBUG47  EQU   DEBUGA+1                                                 03346000
DEBUG46  EQU   DEBUGA+1                                                 03347000
DEBUG45  EQU   DEBUGA+1                                                 03348000
DEBUG44  EQU   DEBUGA+1                                                 03349000
DEBUG43  EQU   DEBUGA+1                                                 03350000
DEBUG42  EQU   DEBUGA+1                                                 03351000
DEBUG41  EQU   DEBUGA+1                                                 03352000
DEBUG40  EQU   DEBUGA+1                                                 03353000
DEBUG39  EQU   DEBUGA                                                   03354000
DEBUG38  EQU   DEBUGA                                                   03355000
DEBUG37  EQU   DEBUGA                                                   03356000
DEBUG36  EQU   DEBUGA                                                   03357000
DEBUG35  EQU   DEBUGA                                                   03358000
DEBUG34  EQU   DEBUGA                                                   03359000
DEBUG33  EQU   DEBUGA                                                   03360000
DEBUG32  EQU   DEBUGA                                                   03361000
DEBUG31  EQU   DEBUG+3                                                  03362000
DEBUG30  EQU   DEBUG+3                                                  03363000
DEBUG29  EQU   DEBUG+3                                                  03364000
DEBUG28  EQU   DEBUG+3                                                  03365000
DEBUG27  EQU   DEBUG+3                                                  03366000
DEBUG26  EQU   DEBUG+3                                                  03367000
DEBUG25  EQU   DEBUG+3                                                  03368000
DEBUG24  EQU   DEBUG+3                                                  03369000
DEBUG23  EQU   DEBUG+2                                                  03370000
DEBUG22  EQU   DEBUG+2                                                  03371000
DEBUG21  EQU   DEBUG+2                                                  03372000
DEBUG20  EQU   DEBUG+2                                                  03373000
DEBUG18  EQU   DEBUG+2                                                  03374000
DEBUG16  EQU   DEBUG+2                                                  03375000
DEBUG15  EQU   DEBUG+1                                                  03376000
DEBUG13  EQU   DEBUG+1                                                  03377000
DEBUG11  EQU   DEBUG+1                                                  03378000
DEBUG8   EQU   DEBUG+1                                                  03379000
DEBUG7   EQU   DEBUG                                                    03380000
DEBUG6   EQU   DEBUG                                                    03381000
DEBUG5   EQU   DEBUG                                                    03382000
DEBUG3   EQU   DEBUG                                                    03383000
DEBUG1   EQU   DEBUG                                                    03384000
SORTBRK  EQU   SWITCHES+1                                               03385000
COREFAIL EQU   SWITCHES+1                                               03386000
ANALYSIS EQU   SWITCHES+1                                               03387000
SHIFT3RD EQU   SWITCHES+1                                               03388000
DEVEXCL  EQU   SWITCHES+1                                               03389000
NOTALL   EQU   SWITCHES+1                                               03390000
NOSDR    EQU   SWITCHES                                                 03391000
TIMESEQ  EQU   SWITCHES                                                 03392000
SYSUM    EQU   SWITCHES                                                 03393000
PARMTHR  EQU   SWITCHES                                                 03394000
TREND    EQU   SWITCHES                                                 03395000
PARMMES  EQU   SWITCHES                                                 03396000
RDESUM   EQU   SWITCHES                                                 03397000
PCCHFRAM EQU   RECTYPE+1                                                03398000
PMCHFRAM EQU   RECTYPE+1                                                03399000
PTTYP    EQU   RECTYPE+1                                                03400000
PEOD     EQU   RECTYPE                                                  03401000
PMIH     EQU   RECTYPE                                                  03402000
PDDR     EQU   RECTYPE                                                  03403000
PIPL     EQU   RECTYPE                                                  03404000
PSOFT    EQU   RECTYPE                                                  03405000
POBR     EQU   RECTYPE                                                  03406000
PCHAN    EQU   RECTYPE                                                  03407000
PMCH     EQU   RECTYPE                                                  03408000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03409000
@RF00218 EQU   @EL00002                                                 03410000
@RC00266 EQU   @EL00003                                                 03411000
@RF00450 EQU   @EL00007                                                 03412000
@RF00471 EQU   @RC00468                                                 03413000
@RF00507 EQU   @EL00010                                                 03414000
@RC00520 EQU   @EL00011                                                 03415000
@RC00525 EQU   @EL00011                                                 03416000
@RF00540 EQU   @EL00011                                                 03417000
@RC00737 EQU   @RC00735                                                 03418000
@RC00740 EQU   @RC00735                                                 03419000
@RC00743 EQU   @RC00735                                                 03420000
@RC00746 EQU   @RC00735                                                 03421000
@RC00749 EQU   @RC00735                                                 03422000
@RC00752 EQU   @RC00735                                                 03423000
@RC00755 EQU   @RC00735                                                 03424000
@RC00758 EQU   @RC00735                                                 03425000
@RF00761 EQU   @RC00735                                                 03426000
@RF00797 EQU   @EL00025                                                 03427000
@PB00025 EQU   @PB00026                                                 03428000
@RF00810 EQU   @EL00026                                                 03429000
@RC00849 EQU   @RC00833                                                 03430000
@RF00861 EQU   @RC00833                                                 03431000
@RF00887 EQU   @EL00001                                                 03432000
@PB00024 EQU   @PB00025                                                 03433000
@RC00851 EQU   @RC00849                                                 03434000
@PB00023 EQU   @PB00024                                                 03435000
@PB00022 EQU   @PB00023                                                 03436000
@PB00021 EQU   @PB00022                                                 03437000
@PB00020 EQU   @PB00021                                                 03438000
@PB00019 EQU   @PB00020                                                 03439000
@PB00018 EQU   @PB00019                                                 03440000
@PB00017 EQU   @PB00018                                                 03441000
@PB00016 EQU   @PB00017                                                 03442000
@PB00015 EQU   @PB00016                                                 03443000
@PB00014 EQU   @PB00015                                                 03444000
@PB00013 EQU   @PB00014                                                 03445000
@PB00012 EQU   @PB00013                                                 03446000
@PB00011 EQU   @PB00012                                                 03447000
@PB00010 EQU   @PB00011                                                 03448000
@PB00009 EQU   @PB00010                                                 03449000
@PB00008 EQU   @PB00009                                                 03450000
@PB00007 EQU   @PB00008                                                 03451000
@PB00006 EQU   @PB00007                                                 03452000
@PB00005 EQU   @PB00006                                                 03453000
@PB00004 EQU   @PB00005                                                 03454000
@PB00003 EQU   @PB00004                                                 03455000
@PB00002 EQU   @PB00003                                                 03456000
@ENDDATA EQU   *                                                        03457000
         END   IFCEDSUM                                                 03458000
