         TITLE 'IFCEXXX9 - EDIT TABLE - LINKNAME=IFCE2250, ALIASES=IFCEC00070002
               2260,IFCE2280,IFCE2282,IFCE3505,IFCE3525'                00140002
         SPACE 2                                                        00210002
*  LINE MACRO     LINE MACRO     LINE MACRO     LINE MACRO            * 00280002
         MACRO                                                          00350002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      00420002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     00490002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    00560002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 00630002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    00700002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    00770002
.*                                 THE PREVIOUS LINE AND STORES THAT #  00840002
.*                                 INTO THE APPROPRIATE BYTE.           00910002
.*                                 &DATA(1) - CHARACTER POSITION TO     00980002
.*                                 BEGIN DATA.                          01050002
.*                                                                      01120002
.*                                 &DATA(2) - # OF SPACES BETWEEN       01190002
.*                                 SUCCESSIVE DATA COLUMN STARTING      01260002
.*                                 CHARACTERS.                          01330002
.*                                                                      01400002
.*                                 &LABEL(1) - CHARACTER POSITION       01470002
.*                                 TO BEGIN LABELS.                     01540002
.*                                                                      01610002
.*                                 &LABEL(2) - # OF SPACES BETWEEN      01680002
.*                                 LINE'S LABEL STARTING CHARACTERS.    01750002
.*                                                                      01820002
.*                                 &SKIP= - # OF LINES TO ADVANCE       01890002
.*                                 CARRIAGE TO BEGIN NEXT PRINTED LINE. 01960002
.*                                                                      02030002
.*                                 NEW ENTRIES ARE GENERATED ONLY WHEN  02100002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   02170002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 02240002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   02310002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 02380002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    02450002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   02520002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   02590002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   02660002
.*                                 THE SUBJECT LINE.                    02730002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  02800002
         GBLA  &LASTCC,&INITIAL                                         02870002
         GBLC  &NRENTSX                                                 02940002
         GBLC  &CARRCON                                                 03010002
         GBLB  &TEST                                                    03080002
         LCLA  &S                                                       03150002
&NAME    DS    0C                                                       03220002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  03290002
         LINEND                                                         03360002
         AGO   .NTFIRST                                                 03430002
.FIRSTLN ANOP                                                           03500002
&NRENTSX SETC  'N&SYSNDX'                                               03570002
&INITIAL SETA  1                                                        03640002
&LASTCC  SETA  1                                                        03710002
N&SYSNDX EQU   *                                                        03780002
.NTFIRST ANOP                                                           03850002
         DC    AL1(0)                                                   03920002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               03990002
         AIF   ('&DATA'(1,1) NE '(').SLABEL                             04060002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                04130002
&DB      SETA  &DATA(1)                                                 04200002
         AGO   .AA                                                      04270002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                04340002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 04410002
         AGO   .CC                                                      04480002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    04550002
         AIF   (&DATA(2) EQ &DT).BB                                     04620002
.CC      ANOP                                                           04690002
&DT      SETA  &DATA(2)                                                 04760002
.BB      DC    XL2'FFFE'                                                04830002
         DC    FL1'&DB'                                                 04900002
         DC    FL1'&DT'                                                 04970002
&NRENTS  SETA  &NRENTS+1                                                05040002
.NCDATA  ANOP                                                           05110002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              05180002
         AIF   ('&LABEL'(1,1) NE '(').SLABEL                            05250002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               05320002
&LB      SETA  &LABEL(1)                                                05390002
         AGO   .AAA                                                     05460002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              05530002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               05600002
         AGO   .CCC                                                     05670002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  05740002
         AIF   (&LABEL(2) EQ &LT).BBB                                   05810002
.CCC     ANOP                                                           05880002
&LT      SETA  &LABEL(2)                                                05950002
.BBB     DC    XL2'FFFF'                                                06020002
         DC    FL1'&LB'                                                 06090002
         DC    FL1'&LT'                                                 06160002
&NRENTS  SETA  &NRENTS+1                                                06230002
.NCLABEL ANOP                                                           06300002
         AIF   ('&SKIP' EQ 'E').EJECT                                   06370002
         AIF   ('&SKIP' EQ '').TESTOFF                                  06440002
.CONT    ANOP                                                           06510002
         AIF   (&TEST EQ 0).AB                                          06580002
         AIF   (&SKIP EQ &LASTCC).TESTOFF                               06650002
&S       SETA  &SKIP                                                    06720002
         ORG   &CARRCON+3                                               06790002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 06860002
         ORG                                                            06930002
&LASTCC  SETA  &S                                                       07000002
.SLABEL  ANOP                                                           07070002
.TESTOFF ANOP                                                           07140002
&TEST    SETB  0                                                        07210002
         AGO   .DD                                                      07280002
.EJECT   DC    XL2'FFFB'                                                07350002
&NRENTS  SETA  &NRENTS+1                                                07420002
         DC    X'8B'              SKIP TO CHANNEL 1                     07490002
         DC    AL.3(0),AL.2(&LASTCC),AL.3(1)                            07560002
&TEST    SETB  1                                                        07630002
         AGO   .DD                                                      07700002
.AB      AIF   (&SKIP EQ &LASTCC).NOCHANG                               07770002
A&SYSNDX DC    XL2'FFFB'                                                07840002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              07910002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              07980002
&LASTCC  SETA  &SKIP                                                    08050002
&TEST    SETB  1                                                        08120002
&CARRCON SETC  'A&SYSNDX'                                               08190002
&NRENTS  SETA  &NRENTS+1                                                08260002
.DD      ANOP                                                           08330002
.NOCHANG ANOP                                                           08400002
         MEND                                                           08470002
         EJECT                                                          08540002
         SPACE 2                                                        08610002
*  ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO* 08680002
         MACRO                                                          08750002
&NAME    ROUTINE &LOGITEM,&RNAME                                        08820002
         GBLC  &DSECT,&CSECT                                            08890002
         GBLC  &ITEM(1000)                                              08960002
         GBLA  &SHIFT(1000),&ITEMNBR                                    09030002
         GBLA  &NRENTS                                                  09100002
         LCLA  &ISHIFT,&NDX                                             09170002
.LOOP    ANOP                                                           09240002
&NDX     SETA  &NDX+1                                                   09310002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      09380002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  09450002
         MNOTE *,'LOG ITEM NOT DEFINED'                                 09520002
         MEXIT                                                          09590002
.FOUND   ANOP                                                           09660002
&ISHIFT  SETA  &SHIFT(&NDX)                                             09730002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           09800002
         DC    AL.4(&ISHIFT),AL.12(&RNAME-&CSECT)                       09870002
&NRENTS  SETA  &NRENTS+1                                                09940002
         MEND                                                           10010002
*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 10080002
         SPACE 2                                                        10150002
         MACRO                                                          10220002
&NAME    DSGEN &X1,&X2,&X3,&X4,&X5,&X6,&X7,&X8,&X9,&X10,&X11,&X12,&X13,X10290002
               &X14,&X15,&X16,&X17,&X18,&X19,&X20,&X21,&X22,&X23,&X24, X10360002
               &X25,&X26,&X27,&X28,&X29,&X30,&X31,&X32                  10430002
.*                            THIS MACRO GENERATES ONE DSECT WORD       10500002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 10570002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  10640002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    10710002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 10780002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   10850002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 10920002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      10990002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  11060002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    11130002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   11200002
         GBLC &ITEM(1000)                                               11270002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000)                         11340002
         LCLC  &SYMBOL                                                  11410002
         LCLA  &OP,&COUNT,&BYTE                                         11480002
.LOOP    ANOP                                                           11550002
&OP      SETA  &OP+1                                                    11620002
&ITEMNBR SETA  &ITEMNBR+1                                               11690002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        11760002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            11830002
         MNOTE *,'NULL BIT COUNT FIELD'                                 11900002
         MEXIT                                                          11970002
.OK1     ANOP                                                           12040002
         AIF   ('&SYMBOL' NE '').OK                                     12110002
         MNOTE 'LOG ITEM SYMBOL NOT PROVIDED'                           12180002
         AGO   .CNT                                                     12250002
.OK      ANOP                                                           12320002
         AIF   ('&SYMBOL'(1,1) EQ '''').CNT                *TEMP*       12390002
&SYMBOL  EQU   *+&BYTE                                                  12460002
&ITEM(&ITEMNBR)  SETC '&SYSLIST(&OP,1)'                                 12530002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    12600002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    12670002
.CNT     ANOP                                                           12740002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   12810002
&BYTE    SETA  &COUNT/8                                                 12880002
         AIF (&OP LT N'&SYSLIST).LOOP                                   12950002
         AIF   (&COUNT NE 32).NOT32                                     13020002
&NAME    DS    4C                                                       13090002
         MEXIT                                                          13160002
.NOT32   AIF   (&COUNT NE 64).ERR                                       13230002
&NAME    DS    8C                                                       13300002
         MEXIT                                                          13370002
.ERR     MNOTE '**BIT COUNT FIELDS DO NOT TOTAL 32 OR 64**'             13440002
         MEND                                                           13510002
         MACRO                                                          13580002
         LINEND                                                         13650002
.*                            THIS MACRO IS USED ONLY BY THE LINE       13720002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   13790002
.*                                 ASSOCIATED WITH EACH LINE.           13860002
         GBLA  &NRENTS                                                  13930002
         GBLC &NRENTSX                                                  14000002
         ORG   &NRENTSX                                                 14070002
         DC    FL1'&NRENTS'                                             14140002
         ORG                                                            14210002
&NRENTS  SETA  0                                                        14280002
B&SYSNDX EQU   *                                                        14350002
&NRENTSX SETC  'B&SYSNDX'                                               14420002
         MEND                                                           14490002
         SPACE 2                                                        14560002
         EJECT                                                          14630002
*  LABEL MACRO     LABEL MACRO     LABEL MACRO     LABEL MACRO        * 14700002
         SPACE 2                                                        14770002
         MACRO                                                          14840002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C14910002
               &LABEL7,&LABEL8                                          14980002
.*                            THIS MACRO ALLOWS UP TO ACHT LABELS TO    15050002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   15120002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  15190002
.*                                 TION MARKS. THE COLUMN AND LINE END  15260002
.*                                 CONTROLS WILL BE INSERTED BY THE     15330002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      15400002
.*                                 LABEL REQUIRED FOR RESPECTIVE        15470002
.*                                 COLUMN. THIS MACRO WILL ALSO ALERT   15540002
.*                                 THE PROGRAMMER TO EXACTLY WHERE THE  15610002
.*                                 TABLE MUST BE BROKEN IF NECESSARY    15680002
.*                                 TO AVOID EXCEEDING THE MAXIMUM LIMIT 15750002
         GBLC &LABELS(2000)                                             15820002
         GBLC  &LBL(100)                                                15890002
         GBLA  &LBLCTR(100)                                             15960002
         GBLA  &LABELNR                                                 16030002
         GBLA  &NRENTS,&LPTR                                            16100002
         LCLC  &MARGIN,&TACK                                            16170002
         LCLC  &TEXT                                                    16240002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            16310002
&MARGIN  SETC  '*'                                                      16380002
         AIF   ('&NAME' EQ '').LOOPOUT                                  16450002
&LPTR    SETA  &LPTR+1                                                  16520002
&LBL(&LPTR) SETC '&NAME'                                                16590002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          16660002
.LOOPOUT ANOP                                                           16730002
&OP      SETA  &OP+1                                                    16800002
&K       SETA  K'&SYSLIST(&OP)                                          16870002
         AIF (&K GE 2).NORM                                             16940002
&K       SETA  2                                                        17010002
.NORM    ANOP                                                           17080002
&START   SETA  2                                                        17150002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                17220002
&MARGIN  SETC  '$'                                                      17290002
.NOTLAST ANOP                                                           17360002
&NRCHAR  SETA  8                                                        17430002
&TACK    SETC  ''                                                       17500002
.LOOPIN  ANOP                                                           17570002
&REMAIN  SETA  &K-&START                                                17640002
         AIF (&REMAIN GE 8).MORE                                        17710002
&TACK    SETC  '&MARGIN'                                                17780002
&NRCHAR  SETA  &REMAIN                                                  17850002
.MORE    ANOP                                                           17920002
&TEXT    SETC  ''                                                       17990002
         AIF (&REMAIN EQ 0).ENDTEXT                                     18060002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          18130002
.ENDTEXT ANOP                                                           18200002
&LABELNR SETA  &LABELNR+1                                               18270002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  18340002
&START   SETA  &START+8                                                 18410002
         AIF ('&TACK' EQ '').LOOPIN                                     18480002
         AIF ('&TACK' EQ '*').LOOPOUT                                   18550002
         MEND                                                           18620002
         SPACE 2                                                        18690002
         MACRO                                                          18760002
         LSTART                                                         18830002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  18900002
.*                                 OF THE TABLE IS TO BEGIN.            18970002
         GBLC &LABELS(2000)                                             19040002
         GBLA  &LABELNR                                                 19110002
         GBLC  &LBL(100)                                                19180002
         GBLA  &LBLCTR(100)                                             19250002
         LCLA  &NDX,&CTR                                                19320002
         LINEND                                                         19390002
&CTR     SETA  1                                                        19460002
.LOOP    ANOP                                                           19530002
&NDX     SETA  &NDX+1                                                   19600002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            19670002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         19740002
&CTR     SETA  &CTR+1                                                   19810002
         AGO   .LOOPCTL                                                 19880002
.NOLBL   ANOP                                                           19950002
         DC    C'&LABELS(&NDX)'                                         20020002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  20090002
         MEND                                                           20160002
         SPACE 2                                                        20230002
*  BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO  * 20300002
         SPACE 2                                                        20370002
         MACRO                                                          20440002
         BIN   &LOGITEM,&SKIP$OR                                        20510002
.*                                 &LOGITEM - NAME OF ITEM IN LOG       20580002
.*                                      RECORD DSECT                    20650002
.*                                 &SKIP$OR - NBR OF SPACES TO SKIP ON  20720002
.*                                 MULTIPLE PRINT OR NBR OF SPACES      20790002
.*                                      TO BACK UP FROM COLUMN FOR      20860002
.*                                      START OF PRINTING. THE LETTER   20930002
.*                                      B PRECEEDS THE NUMBER (B5) IF   21000002
.*                                      THE LATTER IS DESIRED. OMISSION 21070002
.*                                      OF THIS OPERAND FORCES OPTION 2 21140002
.*                                      WITH BACKUP SPACING EQUAL TO    21210002
.*                                 THE NUMBER OF BITS IN THE ITEM       21280002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      21350002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     21420002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       21490002
         GBLC &ITEM(1000)                                               21560002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 21630002
         GBLC  &DSECT                                                   21700002
         LCLB  &B                                                       21770002
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   21840002
         LCLA  &TEMP,&T                                                 21910002
         LCLC  &S                                                       21980002
.LOOP    ANOP                                                           22050002
&NDX     SETA  &NDX+1                                                   22120002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      22190002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  22260002
         MNOTE *,'YOU BLEW IT'                                          22330002
         ROUTINE DUM,SKIPPER                                            22400002
         MEXIT                                                          22470002
.FOUND   ANOP                                                           22540002
&ISHIFT  SETA  &SHIFT(&NDX)                                             22610002
&IBITS   SETA  &BITS(&NDX)                                              22680002
&T       SETA  &IBITS-1                                                 22750002
&B       SETB  0                                                        22820002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                22890002
&K       SETA  K'&SKIP$OR                                               22960002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 23030002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   23100002
&T       SETA  &S                                                       23170002
.BACKUP  ANOP                                                           23240002
&NRENTS  SETA  &NRENTS+1                                                23310002
&TEMP    SETA  &ISHIFT                                                  23380002
A&SYSNDX DC    AL.12(&LOGITEM-&DSECT),XL.4'&TEMP'                       23450002
         AIF (&IBITS EQ 1 AND &B EQ 0).OUT                              23520002
         ORG   A&SYSNDX                                                 23590002
&B       SETB  1                                                        23660002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'C'                           23730002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             23800002
.OUT     ANOP                                                           23870002
         MEND                                                           23940002
         EJECT                                                          24010002
*  HEX MACRO     HEX MACRO     HEX MACRO    HEXN MACRO     HEX MACRO  * 24080002
         SPACE 2                                                        24150002
         MACRO                                                          24220002
         HEX   &LOGITEM,&SKIP$OR,&BYTES                                 24290002
.*                            THIS MACRO FACILITATES GENERATION OF THE  24360002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    24430002
.*                                 CONVERSIONS.                         24500002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE        24570002
.*                                 CONVERTED                            24640002
.*                            &SKIP$OR - NUMBER OF SPACES TO SKIP ON    24710002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   24780002
.*                                 BACK UP FROM COLUMN FOR START OF     24850002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  24920002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  24990002
.*                                 DESIRED. OMISSION OF THIS OPERAND    25060002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  25130002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  25200002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 25270002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    25340002
.*                                 IMPLICITLY B).                       25410002
.*                            &BYTES - NUMBER OF TOTAL INPUT BYTES TO   25480002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     25550002
.*                                 WITH AN L,R, OR B TO STIPULATE       25620002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     25690002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     25760002
.*                                 RESPECTIVELY. OMISSION OF THIS       25830002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  25900002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 25970002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 26040002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   26110002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     26180002
.*                                 SUBJECT LINE(S).                     26250002
         GBLC &ITEM(1000),&DSECT                                        26320002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 26390002
         LCLB  &B                                                       26460002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP                  26530002
         LCLC  &S,&LETTER                                               26600002
.LOOP    ANOP                                                           26670002
&NDX     SETA  &NDX+1                                                   26740002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      26810002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  26880002
         MNOTE *,'LOG ITEM NOT DEFINED'                                 26950002
         MEXIT                                                          27020002
.FOUND   ANOP                                                           27090002
&ISHIFT  SETA  &SHIFT(&NDX)                                             27160002
&IBITS   SETA  &BITS(&NDX)                                              27230002
&CODE    SETA  1                                                        27300002
&K       SETA  K'&BYTES                                                 27370002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            27440002
         MNOTE *,'BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL'   27510002
         MEXIT                                                          27580002
.OK      AIF   ('&BYTES' EQ '').USEDEFN                                 27650002
&LETTER  SETC  '&BYTES'(&K,1)                                           27720002
&S       SETC  '&BYTES'(1,&K-1)                                         27790002
&BYTESP  SETA  &S                                                       27860002
         AIF   ('&LETTER' EQ 'B').BOTH                                  27930002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).OK2                       28000002
.ERR     MNOTE *,'DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY'            28070002
         MEXIT                                                          28140002
.USEDEFN ANOP                                                           28210002
&BYTESP  SETA  &IBITS/8                                                 28280002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       28350002
&CODE    SETA  3                                                        28420002
&T       SETA  &BYTESP*2-1                                              28490002
&S       SETC  '&T'                                                     28560002
.OK2     AIF   (&ISHIFT EQ 0).L                                         28630002
&CODE    SETA  2                                                        28700002
.L       ANOP                                                           28770002
&B       SETB  1                                                        28840002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                28910002
&K       SETA  K'&SKIP$OR                                               28980002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 29050002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   29120002
.BACKUP  ANOP                                                           29190002
&NRENTS  SETA  &NRENTS+1                                                29260002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'A'                           29330002
         DC    BL.1'&B',FL.7'&S',FL.4'&BYTESP',FL.4'&CODE'              29400002
.OUT     ANOP                                                           29470002
         MEND                                                           29540002
         MACRO                                                          29610002
         SPECIAL  &ROUTINE,&PARAM,&SPACE=                               29680002
.*                            THIS MACRO GENERATES A SPECIAL ROUTINE    29750002
.*                                 ENTRY TO BE PROCESSED BY THE SUM. M. 29820002
.*                            &ROUTINE - SYMBOL ON SPECIAL ROUTINE EWT. 29890002
.*                            &PARAM - AN 8 BIT BINARY REPRESENTATION   29960002
.*                                 TO OCCUPY THE 'MASK' FIELD BUT TO BE 30030002
.*                                 INTERPRETED AS AN ARGUMENT OF THE    30100002
.*                                 SPECIAL ROUTINE.                     30170002
.*                            &SPACE - THE NUMBER OF 2BYTE COUNTERS TO  30240002
.*                                 ALLOCATE FOR REQUIRED PROCESSING.    30310002
         GBLC  &CSECT                                                   30380002
         GBLA  &COUNTR                                                  30450002
         LCLA  &ADD                                                     30520002
         DC    AL1(128)                                                 30590002
         DC    BL.8'&PARAM'                                             30660002
         DC    AL2(&ROUTINE-&CSECT)                                     30730002
         DC    AL2(&COUNTR)                                             30800002
&ADD     SETA  1                                                        30870002
         AIF   ('&SPACE' EQ '').NORM                                    30940002
&ADD     SETA  &SPACE                                                   31010002
.NORM    ANOP                                                           31080002
&COUNTR  SETA  &COUNTR+&ADD                                             31150002
         MEND                                                           31220002
         MACRO                                                          31290002
         SUM   &LOGITEM,&MASK                                           31360002
.*                            THIS MACRO GENERATES A NORMAL EDIT ENTRY  31430002
.*                                 FOR PROCESSING BY THE SUMMARY MODULE 31500002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE SUMMED 31570002
.*                            &MASK - BYTE MASK FOR BITS TO BE TESTED.  31640002
.*                                 THIS OPERAND SHOULD BE OMITTED FOR   31710002
.*                                 SINGLE BIT ITEMS IN WHICH CASE THE   31780002
.*                                 MASK WILL BE SET ACCORDING TO THE    31850002
.*                                 OFF BYTE BIT DISPLACEMENT OF THE     31920002
.*                                ITEM AS DEFINED BY THE MACRO 'DSGEN'  31990002
         GBLA  &COUNTR,&ITEMNBR,&BITS(1000),&SHIFT(1000)                32060002
         GBLC  &ITEM(1000),&DSECT                                       32130002
         LCLA  &IBITS,&NDX,&ISHIFT,&M,&BITNBR                           32200002
.LOOP    ANOP                                                           32270002
&NDX     SETA  &NDX+1                                                   32340002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      32410002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  32480002
         MNOTE *,'LOGITEM NOT FOUND'                                    32550002
         MEXIT                                                          32620002
.FOUND   ANOP                                                           32690002
         DC    AL1(0)                                                   32760002
&ISHIFT  SETA  &SHIFT(&NDX)                                             32830002
&IBITS   SETA  &BITS(&NDX)                                              32900002
         AIF   ('&MASK' EQ '').FORM                                     32970002
         DC    B'&MASK'                                                 33040002
         AGO   .ITEM                                                    33110002
.FORM    ANOP                                                           33180002
&BITNBR  SETA  &ISHIFT-7                                                33250002
&BITNBR  SETA  0-&BITNBR                                                33320002
&M       SETA  1                                                        33390002
.LOOP2   ANOP                                                           33460002
         AIF   (&BITNBR EQ 0).GOTIT                                     33530002
&M       SETA  &M*2                                                     33600002
&BITNBR  SETA  &BITNBR-1                                                33670002
         AGO   .LOOP2                                                   33740002
.GOTIT   ANOP                                                           33810002
         DC    AL1(&M)                                                  33880002
.ITEM    DC    AL2(&LOGITEM-&DSECT)                                     33950002
         DC    AL2(&COUNTR)                                             34020002
&COUNTR  SETA  &COUNTR+1                                                34090002
         MEND                                                           34160002
         GBLC  &DSECT,&CSECT                                            34230002
IFCEXXX9 CSECT                                                          34300002
&DSECT   SETC  'XXX9'                                                   34370002
&CSECT   SETC  'IFCEXXX9'                                               34440002
*                                                                       34510002
*              EDIT TABLE FOR OBR REC                                   34580002
*                                                                       34650002
*              DEVICE CODE=1002   DEV TYPE=2250   ALIAS=IFCE2250        34720002
*                          1003            2260         IFCE2260        34790002
*                          1005            2280         IFCE2280        34860002
*                          1006            2282         IFCE2282        34930002
*                          0806            3505         IFCE3505 S21021 35000002
*                          080C            3525         IFCE3525 S21021 35070002
*                                                                       35140002
*                                                                       35210002
XXX9     DSECT                                                          35280002
         DSGEN (XDUM1,8),(XRELN,8),(XDUM2,8),                    S21021X35350002
               (SW2B0,1),(SW2B1,1),(SW2B2,1),(SW2B3,1),          S21021X35420002
               (SW2B4,1),(SW2B5,1),(SW2B6,1),(SW2B7,1)           S21021 35490002
         DSGEN (XDUM3,32)                         SPARES                35560002
         DSGEN (XDATE,32)                         DATE                  35630002
         DSGEN (XTIME,32)                         TIME                  35700002
         DSGEN (XDUM4,8),(XSER,24)           SERIAL NO                  35770002
         DSGEN (XMODEL,16),(XDUM5,16)        MODEL NUMBER & MCLEN       35840002
         DSGEN (XPGN1,32)                    PROGRAM                    35910002
         DSGEN (XPGN2,32)                            NAME               35980002
         DSGEN (XFCCWCC,8),(XFCCWDA,24)  FAILING CCW                    36050002
         DSGEN (XFCCWFL,8),(XZERO,8),(XFCCWCT,16)    CCW                36120002
         DSGEN (XCSWK,8),(XCSWCA,24)         CHAN  STATUS               36190002
         DSGEN (XCSWATTN,1),(XCSWSM,1),(XCSWCUE,1),      WORD  CSW     C36260002
               (XCSWBSY,1),(XCSWCE,1),(XCSWDE,1),(XCSWUC,1),(XCSWUE,1),C36330002
               (XCSWPCI,1),(XCSWSILI,1),(XCSWPC,1),(XCSWPCHK,1),       C36400002
               (XCSWCDC,1),(XCSWCCC,1),(XCSWICC,1),(XCSWCH,1),         C36470002
               (XCSWCT,16)                                              36540002
         DSGEN (XDUMA,8),(XCUA2,24)                              S21021 36610002
         DSGEN (XDEVT1,16),(XDEVT2,16)       DEVICE TYPE                36680002
         DSGEN (XDUM6,8),(XCUA,24)           DUMMY AND CUA              36750002
         DSGEN (XDUM7,16),(XDUM8,16)         RTRY AND SPARE             36820002
         DSGEN (XDUM9,32)                    VOLUME                     36890002
         DSGEN (XDUM10,16),(XTCAM,8),(XDUM10A,8)                        36960002
         DSGEN (XDUM11,32)                   LAST                       37030002
         DSGEN (XDUM12,32)                        SEEK                  37100002
         DSGEN (XDUM13,32)                   HOME                       37170002
         DSGEN (XDUM14,32)                        ADDRESS               37240002
         DSGEN (SDR1,8),(SDR2,8),(SDR3,8),(SDR4,8),(SDR5,8),     S21021X37310002
               (SDR6,8),(SDR7,8),(SDR8,8)                        S21021 37380002
         DSGEN (SDR9,8),(SDRA,8),                                S21021X37450002
               (XB0CMDR,1),(XB0BIT1,1),(XB0BUSC,1),              S21021C37520002
               (XB0BIT3,1),(XB0DCHK,1),(XB0BIT5,1),(XB0BRUN,1),        C37590002
               (XB0BIT7,1),                                            C37660002
               (XB1LPD,1),(XB1EOS,1),(XB1CMODE,1),(XB1BIT3,1),         C37730002
               (XB1BIT4,1),(XB1BIT5,1),(XB1BIT6,1),(XB1BIT7,1)          37800002
         DSGEN (XB2BIT0,1),(XB2BAR15,1),(XB2BAR14,1),(XB2BAR13,1),     C37870002
               (XB2BAR12,1),(XB2BAR11,1),(XB2BAR10,1),(XB2BAR9,1),     C37940002
               (XB3BAR8,1),(XB3BAR7,1),(XB3BAR6,1),(XB3BAR5,1),        C38010002
               (XB3BAR4,1),(XB3BAR3,1),(XB3BAR2,1),(XB3BAR1,1),      - C38080002
               (XBDUM18,16)                                             38150002
EXPNOBR  DSECT                                                   S21021 38220002
EXPNHDRA DS CL52                                                 S21021 38290002
EXPNDEVA DS CL36                                                 S21021 38360002
EXPNSDRA DS CL10                                                 S21021 38430002
EXPNSNSA DS CL6                                                  S21021 38500002
*                                                                S21021 38570002
NORMOBR DSECT                                                    S21021 38640002
NORMHDRA DS CL64                                                 S21021 38710002
NORMSDRA DS CL10                                                 S21021 38780002
NORMSNSA DS CL6                                                  S21021 38850002
*                                                                S21021 38920002
SHRTOBR DSECT                                                    S21021 38990002
SHRTHDRA DS CL24                                                 S21021 39060002
SHRTDEVA DS CL8                                                  S21021 39130002
SHRTSDRA DS CL10                                                 S21021 39200002
*                                                                S21021 39270002
REDPIOBR DSECT                                                   S21088 39340002
REDPIHDR DS    CL64                                              S21088 39410002
REDPISNS DS    CL6                                               S21088 39480002
*                                                                       39550002
*        END OF DSECT    104 BYTES TOTAL                                39620002
*                                                                       39690002
IFCEXXX9 CSECT                                                          39760002
         USING *,R9                                                     39830002
R0       EQU   0                                                        39900002
R1       EQU   1                                                        39970002
R2       EQU   2                                                        40040002
R3       EQU   3                                                        40110002
R4       EQU   4                                                        40180002
R5       EQU   5                                                        40250002
R6       EQU   6                                                        40320002
R7       EQU   7                                                        40390002
R8       EQU   8                                                        40460002
R9       EQU   9                                                        40530002
R10      EQU   10                                                       40600002
R11      EQU   11                                                       40670002
R12      EQU   12                                                       40740002
R13      EQU   13                                                       40810002
R14      EQU   14                                                       40880002
R15      EQU   15                                                       40950002
L0       EQU   0                                                        41020002
L1       EQU   1                                                        41090002
L2       EQU   2                                                        41160002
L3       EQU   3                                                        41230002
L4       EQU   4                                                        41300002
L5       EQU   5                                                        41370002
L6       EQU   6                                                        41440002
L7       EQU   7                                                        41510002
L8       EQU   8                                                        41580002
L9       EQU   9                                                        41650002
L10      EQU   10                                                       41720002
L11      EQU   11                                                       41790002
L12      EQU   12                                                       41860002
L13      EQU   13                                                       41930002
L14      EQU   14                                                       42000002
L15      EQU   15                                                       42070002
L16      EQU   16                                                       42140002
L17      EQU   17                                                       42210002
L18      EQU   18                                                       42280002
L19      EQU   19                                                       42350002
L20      EQU   20                                                       42420002
L21      EQU   21                                                S21021 42490002
L24      EQU   24                                                       42560002
L28      EQU   28                                                       42630002
L29      EQU   29                                                S21021 42700002
L31      EQU   31                                                S21021 42770002
L34      EQU   34                                                S21021 42840002
L36      EQU   36                                                S21021 42910002
L40      EQU   40                                                S21021 42980002
L44      EQU   44                                                S21021 43050002
L46      EQU   46                                                S21021 43120002
L64      EQU   64                                                S21021 43190002
L104     EQU   104                                               S21021 43260002
L120     EQU   120                                               S21021 43330002
HEX08    EQU   X'08'                                             S21021 43400002
HEX10    EQU   X'10'                                             S21021 43470002
HEX20    EQU   X'20'                                             S21021 43540002
HEX44    EQU   X'44'                                             S21021 43610002
HEX46    EQU   X'46'                                             S21021 43680002
HEX50    EQU   X'50'                                             S21021 43750002
XFF      EQU   X'FF'                                             S21021 43820002
A        EQU   C'A'                                              S21021 43890002
B        EQU   C'B'                                              S21021 43960002
         USING XXX9,R2                                           S21021 44030002
*                                                                       44100002
HEX05    EQU   X'05'                                                    44170002
         DC    A(ENTRIES)               PTR TO EDIT ENTRIES             44240002
         DC    CL8'IFCE2260'                                            44310002
XR9PTR   DC    F'0'                     PTR TO NXT EDIT-4        S21021 44380002
XLABELP  DC    F'0'                                                     44450002
*        SPECIAL ROUTINE SECTION                                        44520002
*                                                                       44590002
SKIPPER  BR    R14                      NOOP RTRN                       44660002
*                                                                       44730002
*                                                                       44800002
SPACER1  LA    R3,L1(R3)                SPACE ONE BLANK          S21021 44870002
         BR    R14                      RETURN                          44940002
*                                                                       45010002
*                                                                       45080002
*        SET BINARY                                                     45150002
*              R4 HAS PTR TO CHAR                                       45220002
*                                                                       45290002
SETBIN   STM   R5,R8,XSAVE              SAVE REGS                       45360002
         IC    R7,L0(R4)                PICK UP CHAR TO PRINT           45430002
         SLL   R7,L24                   MOVE IT TO HI OF R7             45500002
         LR    R8,R3                    PRINT POS POINTER               45570002
         LA    R5,L8                    LOOP COUNT                      45640002
SETBINA  SR    R6,R6                    CLEAR REG 6                     45710002
         SLDL  R6,L1                    MOVE BIT TO R6                  45780002
         STC   R6,L0(R8)                PUT IT INTO PTINT LINE          45850002
         MVZ   L0(L1,R8),CHAR0          MOVE ON PRORPER ZONE            45920002
         LA    R8,L1(R8)                BUMP POINTER TO NEXT POS        45990002
         BCT   R5,SETBINA               LOOP TILL 8 PRINTED             46060002
         B     RETURN                   RETURN                          46130002
*                                                                       46200002
*                                                                       46270002
*        SET PROGRAM NAME  R4 POINTS TO NAME FIELD                      46340002
*                                                                       46410002
SETPGMN  DS    0H                                                S21021 46480002
         TM    SW2B0,HEX20              SHORT RECORD             S21021 46550002
         BCR   1,R14                    YES, NO JOB ID           S21021 46620002
         MVC   0(L12,R3),JOBID          MOVE IN LABEL            S21021 46690002
         MVC   L13(L8,R3),XPGN1         MOVE IN NAME             S21021 46760002
         BR    R14                                               S21021 46830002
NONAME   TM    L0(R4),HEX20             SHORT RECORD?            S21021 46900002
         BCR   14,R14                   NO, LET HEX JOBNAME PRNT S21021 46970002
         ST    R5,XSAVE                 SAVE REG                 S21021 47040002
         LA    R5,L44                   BACK UP BUFFER PNTR      S21021 47110002
         SR    R3,R5                                             S21021 47180002
         MVC   0(L17,R3),BLANKS         CLEAR OUT HEX JOBNAME    S21021 47250002
         L     R5,XSAVE                 RESTORE REG              S21021 47320002
         BR    R14                                               S21021 47390002
*                                                                       47460002
*                                                                       47530002
*        SET HEX  SAME AS BIN EXCPT PRINTS 1 CHAR HEX                   47600002
*                                                                       47670002
SETHEX   STM   R5,R8,XSAVE              SAVE REGS                       47740002
         LA    R8,CHARS                 CHAR TABLE POINTER              47810002
         IC    R7,L0(R4)                PICK UP CHAR                    47880002
         SLL   R7,L24                   MOVE IT TO HI OF R7             47950002
         SR    R6,R6                    CLEAR REGS                      48020002
         SLDL  R6,L4                    MOVE FOUR BITS                  48090002
         AR    R6,R8                    ADD OFFSET & PTR                48160002
         MVC   L0(L1,R3),L0(R6)         MOVE CHAR TO LINE               48230002
         SR    R6,R6                    CLEAR AGAIN                     48300002
         SLDL  R6,L4                    MOVE LAST 4 BOTS                48370002
         AR    R6,R8                    COMPUTE OFFSET                  48440002
         MVC   L1(L1,R3),L0(R6)         MOVE LAST CHAR                  48510002
         B     RETURN                                                   48580002
*                                                                       48650002
*                                                                       48720002
*                                                                       48790002
SETCONV  TM    L0(R4),HEX02             HAS RECORD BEEN CONVERTED KEY32 48860002
         BCR   ON,R14                   YES RETURN                      48930002
         SR    R15,R15                  NO CLEAR R15 FOR NO PRINT OF    49000002
         BR    R14                      LINE BR-14                      49070002
ON       EQU   1                                                        49140002
HEX02    EQU   X'02'                                                    49210002
*                                       SET DEVICE TYPE FIELD           49280002
*                                                                       49350002
SETDEVTY STM   R5,R8,XSAVE              SAVE REGS    R3 PTS TO BUFF POS 49420002
         LA    R5,L6                    NO OF DEVICES            S21021 49490002
         LA    R6,DEVTABLE                                              49560002
SETDEVLP CLC   L0(L2,L4),L0(R6)         COMPARE TYPES                   49630002
         BE    SDEVFND                  BR-EQUAL                        49700002
         LA    R6,L6(R6)                UP TO NXT DEV TYPE              49770002
         BCT   R5,SETDEVLP              LOOP                            49840002
         MVC   L0(L4,R3),NONE           NONE FOUND USE NONE             49910002
         B     RETURN                                                   49980002
SDEVFND  MVC   L0(L4,R3),L2(R6)         MOVE DEV NAME TO LINE           50050002
         B     RETURN                                                   50120002
*                                                                       50190002
*                                                                       50260002
*                             CHECK ON CPU AND SERIAL NO                50330002
SETCPUNO STM   R5,R8,XSAVE                                              50400002
         SR    R5,R5               CLEAR R5                             50470002
         IC    R5,L0(R4)           PICK UP MODEL NO                     50540002
         SLL   R5,L8               IN TO                                50610002
         IC    R5,L1(R4)           R5                                   50680002
         LTR   R5,R5                    TEST FOR ZERO MODEL      S21021 50750002
         LR    R5,R3                    POINT TO DATA FIELD      S21021 50820002
         BNZ   SETSER                   BRANCH IF MODEL NOT 0    S21021 50890002
         LA    R6,L46                   BACK UP TO SAY 'NONE'    S21021 50960002
         SR    R5,R6                    BACKUP BUFFER            S21021 51030002
         MVC   L0(L29,R5),UNIVERS       SAY NONE, MODEL UNIVERSALS21021 51100002
         B     RETURN                   RETURN  CONTROL                 51170002
SETSER   LA    R6,L36                   SET UP TO ADD 'SERIAL NO.S21021 51240002
         SR    R5,R6                                             S21021 51310002
         MVC   0(L10,R5),SERNO                                   S21021 51380002
         B     RETURN                                            S21021 51450002
*                                                                       51520002
*        SET DATE                                                       51590002
*                                                                       51660002
SETDATE  CLC   L1(L3,R4),ZERO           IS DATE ZERO                    51730002
         BE    SETDTE                   BR-YES                          51800002
         UNPK  XSAVE(L8),L1(L3,R4)      UNPACK DATE                     51870002
         MVC  L5(L2,R3),XSAVE+L3  MOVE YEAR                             51940002
         MVC   L0(L3,R3),XSAVE+L5       MOVE DAY                        52010002
         BR    R14                      RETURN                          52080002
SETDTE   MVC   L0(L4,R3),NONE           SET DATE TO NONE                52150002
         BR    R14                                                      52220002
ZERO     DC    XL4'00'                                                  52290002
*                                                                       52360002
*                                                                       52430002
SETLABEL STM   R5,R8,XSAVE              SAVE REGS                       52500002
         CLC   L0(L2,R4),REDLDEV        IS IT REDLAKE            S21088 52570002
         BE    REDPIRT                  YES - BRANCH             S21088 52640002
         CLC   L0(L2,R4),PIKLDEV        IS IT PIKELAKE           S21088 52710002
         BE    REDPIRT                  YES - BRANCH             S21088 52780002
         MVI   RECSIZE+L1,HEX50                                  S21088 52850002
         L     R5,XLABELP               PICK UP LABEL PTR               52920002
         CLI   L1(R4),HEX03             TEST TOR 2250                   52990002
         BL    RETURN                   BR-YES                          53060002
         BE    SET2260                  EQUAL IS 2260                   53130002
         CLI   L1(R4),HEX05             TEST FOR 2282                   53200002
         BL    SET2280                  LOEW IS 2282                    53270002
SET2282  LA    R6,CLABEL1               POINT TO 2282 LABELS            53340002
         LA    R7,L8        LOAD COUNT INTO REG SEVEN                   53410002
         B     SETLBLMV                 MOVE LABELS                     53480002
SET2280  MVC   CLABEL1A(L10),CLABEL2    SET 2280 LABEL                  53550002
         B     SET2282                  LOOP                            53620002
SET2260  LA    R6,CLABEL3               SET POINTER TO 2260             53690002
         LA    R7,L8    LOAD COUNT INTO REG SEVEN...                    53760002
SETLBLMV MVC   L0(L20,R5),L0(R6)        MOVE TWO LABELS                 53830002
         LA    R5,L40(R5)               UP POINTER                      53900002
         LA    R6,L20(R6)               UP LABEL POINTER                53970002
         BCT   R7,SETLBLMV              LOOP                            54040002
         B     RETURN                                                   54110002
REDPIRT  LA    R5,REDPIKLB              GET RED/PIK PTR.         S21088 54180002
         ST    R5,XLABELP               AND PUT IN               S21088 54250002
         MVI   RECSIZE+L1,HEX46                                  S21088 54320002
         B     RETURN                                            S21088 54390002
*                                                                       54460002
RETURN   LM    R5,R8,XSAVE              RESTORE REG                     54530002
         BR    R14                      RETURN                          54600002
HEX03    EQU   X'03'                                                    54670002
HEX18    EQU   X'18'                                                    54740002
*                                                                       54810002
SPACER16 LA    R3,L16(R3)                                        S21021 54880002
         BR    R14                                               S21021 54950002
SDRCONVL STM   R5,R8,XSAVE              SAVE REGS                S21021 55020002
         SR    R6,R6                    CLEAR REG                S21021 55090002
         IC    R6,L0(R4)                PICK UP COUNTER IN QUEST S21021 55160002
         SRL   R6,L4                    DROP OFF 4 LOW BITS      S21021 55230002
         B     SDRCONVT                                          S21021 55300002
SDRCONVR STM   R5,R8,XSAVE              SAVE REGS                S21021 55370002
         IC    R6,L0(R4)                PICK UP CHAR             S21021 55440002
         SLL   R6,L28                                            S21021 55510002
         SRL   R6,L28                   DROP OFF HI ORDER BITS   S21021 55580002
SDRCONVT CVD   R6,WORK                  CONVERT IT               S21021 55650002
         UNPK  L0(L3,R3),WORK+L5(L3)    TO DECIMAL               S21021 55720002
         MVZ   L2(L1,R3),L0(R3)         PUT ON ZONE              S21021 55790002
         B     RETURN                                            S21021 55860002
*                                                                S21021 55930002
RESETR2  L     R2,SAVE2                 PICK UP SAVED REC POINTERS21021 56000002
         BR    R14                                               S21021 56070002
*                                                                S21021 56140002
TESTMP   TM    L0(R4),HEX10             IS IT A MP RECODR        S21021 56210002
         BZ    NOMP                                              S21021 56280002
         MVC   0(L20,R3),MPCPU          SHOW MULTIPROC           S21021 56350002
         TM    L0(R4),HEX08             IS IT CPUA / CPUB        S21021 56420002
         BO    MPB                      BR IT IS B               S21021 56490002
         MVI   L21(R3),A                MOVE 'A' TO PRINT LINE   S21021 56560002
NOMP     BR    R14                                               S21021 56630002
MPB      MVI   L21(R3),B                MOVE 'B' TO PRINT LINE   S21021 56700002
         BR    R14                                               S21021 56770002
NOPRT    SR    R15,R15                  STOP PRINTING            S21021 56840002
         BR    R14                                               S21021 56910002
*                                                                S21021 56980002
CONVREL  STM   R5,R8,XSAVE              SAVE WORK REGS                  57050002
         SR    R6,R6                    CLEAR R6                        57120002
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        57190002
         SRDL  R6,L5                    SAVE REL NO IN R7               57260002
        SLL   R6,L2                    MULTIPLY SYS VALUE BY 4          57330002
         L     R8,XLABELP               PICK UP LABEL POINTER           57400002
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     57470002
         MVC   L0(L4,R8),L0(R6)         MOVE SYSTEM NAME INTO LABEL     57540002
         SR    R6,R6                    CLEAR R6                        57610002
         SLDL  R6,L5                    RETREIVE REL NO.                57680002
         LTR   R6,R6                    IS IT ZERO                      57750002
         BZ    NOREL                    BR-YES                          57820002
         CVD   R6,WORK                  CONVERT IT                      57890002
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFF       57960002
         MVZ   L1(L1,R3),L0(R3)         MOVE ON PROPER ZONE             58030002
         B     RETURN                   EXIT                            58100002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL            58170002
         B     RETURN                                                   58240002
*                                                                S21021 58310002
TESTSHRT TM    SW2B0,HEX20              IS IT A SHORT REC        S21021 58380002
         BZ    SKIPPER                  BR-NO                    S21021 58450002
         BCTR  R3,R0                    BACKUP ONE DATA SPACE    S21021 58520002
         MVC   0(L6,R3),BLANKS          CLEAR OUT HEX 2NDARY CUA S21021 58590002
         MVC   XR9PTR(L8),SHRTADCN      POINT TO STAT EDIT SECT  S21021 58660002
         BR    R14                                               S21021 58730002
*                                                                S21021 58800002
EXPNDRTN STM   R5,R8,XSAVE                                       S21021 58870002
         ST    R2,SAVE2                 SAVE R2 FOR LATER        S21021 58940002
         LA    R5,OBRAREA               PICK UP EXPANDED AREA    S21021 59010002
         USING EXPNOBR,R5                                        S21021 59080002
         USING NORMOBR,R4                                        S21021 59150002
         XC    EXPNOBR(L104),EXPNOBR    CLEAR AREA               S21021 59220002
         CLC   XDEVT2(L2),REDLDEV       IS IT 3505?              S21088 59290002
         BE    REDPIK                   YES - BRANCH             S21088 59360002
         CLC   XDEVT2(L2),PIKLDEV       IS IT 3525?              S21088 59430002
         BE    REDPIK                   YES - BRANCH             S21088 59500002
         TM    SW2B0,HEX20              IS IT A SHORT REC        S21021 59570002
         BO    MOVESHRT                 BR-YES                   S21021 59640002
         TM    XDUM1,HEX02              IS IT A CONVERTED REC    S21021 59710002
         BO    MOVEALL                                           S21021 59780002
         MVC   EXPNHDRA(L64),NORMHDRA   EXPAND RECORD TO CONVERTES21021 59850002
         MVC   EXPNSDRA(L10),NORMSDRA                            S21021 59920002
         MVC   EXPNSNSA(L6),NORMSNSA                             S21021 59990002
EXPNDRET LR    R2,R5                    SWAP POINTERS            S21021 60060002
         B     RETURN                                            S21021 60130002
MOVEALL  MVC   EXPNOBR(L104),NORMOBR    MOVE ENTIRE RECORD       S21021 60200002
         B     EXPNDRET                                          S21021 60270002
         USING SHRTOBR,R4                                        S21021 60340002
MOVESHRT MVC   EXPNHDRA(L24),SHRTHDRA   MOVE HEADER              S21021 60410002
         MVC   EXPNDEVA(L8),SHRTDEVA                             S21021 60480002
         MVC   EXPNSDRA(L10),SHRTSDRA                            S21021 60550002
         B     EXPNDRET                                          S21021 60620002
         USING REDPIOBR,R4                                       S21088 60690002
REDPIK   MVC   EXPNHDRA(L64),REDPIHDR   MOVE HEADER              S21088 60760002
         MVC   EXPNSNSA(L6),REDPISNS    MOVE SENSE               S21088 60830002
         B     EXPNDRET                 RETURN                   S21088 60900002
         DROP  R4,R5                                             S21021 60970002
*                                                                S21021 61040002
RECTYPE  STM   R5,R8,XSAVE                                       S21021 61110002
         LR    R5,R3                    SET UP DATA SLOT FOR TYPES21021 61180002
         LA    R6,L31                                            S21021 61250002
         SR     R5,R6                                            S21021 61320002
         TM    0(R4),HEX20              SHORT RECORD?            S21021 61390002
         BO    RECSHORT                                          S21021 61460002
         MVC   0(L10,R5),UNITCK         INSERT DATA 'UNIT CHECK' S21021 61530002
         B     RETURN                                            S21021 61600002
RECSHORT MVC   0(L10,R5),OVFL           DATA = 'OVERFLOW'        S21021 61670002
         B     RETURN                                            S21021 61740002
SETSTLBL DS    0H                       SET LABELS FOR STAT COUNTS21088 61810002
         STM   R5,R8,XSAVE              SAVE REGS                S21088 61880002
         LA    R6,L2                    SET BCT COUNT            S21088 61950002
         L     R5,XLABELP               GET CURRENT LABEL PNTR   S21088 62020002
         LA    R7,L6                    NUMBER OF LABEL LISTS    S21088 62090002
         LA    R8,STLBLIST              POINT TO FIRST LABEL ENTRS21088 62160002
STLBCOMP CLC   XDEVT2(L2),0(R8)         IS THIS THE DEVICE TYPE? S21088 62230002
         BE    STLBLTFD                 YES, GO MOVE LABELS      S21088 62300002
         LA    R8,L18(R8)          NO, BUMP POINTER              S21088 62370002
         BCT   R7,STLBCOMP              REPEAT NUMBER OF LISTS   S21088 62440002
         LA    R8,STLBDFLT              NOT FOUND, USE DEFAULT   S21088 62510002
STLBLTFD DS    0H                  LABELS FOUND                  S21088 62580002
         LA    R8,L2(R8)                USE LABELS               S21088 62650002
         LA    R7,L16(R8)               DETERMINE END POINT      S21088 62720002
         ST    R7,STLBLEND              SAVE FOR COMPARE         S21088 62790002
STLABLP  DS    0H                                                S21088 62860002
         LA    R6,L2                    RESET BCT                S21088 62930002
         TM    SW2B0,HEX20              IS THIS A SHORT RECORD   S21088 63000002
         BO    STLBSHRT                 YES, NO UNIT STATUS      S21088 63070002
         LA    R5,L34(R5)               SKIP UNIT STATUS LABELS  S21088 63140002
STLBSHRT DS    0H                                                S21088 63210002
         CLI   0(R8),XFF                IS THIS 'NOT USED'       S21088 63280002
         BE    STLBLNUS                 YES, LABEL = 'NOT USED'  S21088 63350002
         SR    R7,R7                    CLEAR R7                 S21088 63420002
         IC    R7,0(R8)                 GET INDEX TO LABEL       S21088 63490002
         MH    R7,HW13                  MULTIPLY TO GET LABEL    S21088 63560002
         A     R7,SLTABAD               PT TO LABEL IN TABLE     S21088 63630002
         MVC   L0(L13,R5),L0(R7)        MOVE IN LABEL            S21088 63700002
         B     STLBL001                                          S21088 63770002
STLBLNUS DS    0H                                                S21088 63840002
         MVC   L0(L13,R5),STLBNTUS      'NOT USED' LABEL         S21088 63910002
STLBL001 DS    0H                                                S21088 63980002
         LA    R5,L14(R5)               BUMP R5                  S21088 64050002
         LA    R8,L1(R8)                POINT TO NEXT INDEX      S21088 64120002
         BCT   R6,STLBSHRT              DO AGAIN                 S21088 64190002
         C     R8,STLBLEND              AT END OF LIST?          S21088 64260002
         BNE   STLABLP                  NO, CONTINUE             S21088 64330002
         B     RETURN                                            S21088 64400002
SLTABAD  DC    A(SLTABL)                                         S21088 64470002
SLTABL   DS    0C                                                S21088 64540002
         DC    C'TEMPY READS  '         00                       S21088 64610002
         DC    C'TEMPY WRITES '         01                       S21088 64680002
         DC    C'INTRVN REQD  '         02                       S21088 64750002
         DC    C'BUS OUT CHK  '         03                       S21088 64820002
         DC    C'EQUIP CHK    '         04                       S21088 64890002
         DC    C'CHAN DATA CHK'         07                       S21088 64960002
STLBNTUS DC    C'NOT USED     '                                  S21088 65030002
STLBLIST DS    0C                                                S21088 65100002
         DC    X'1005'                  2280                     S21088 65170002
         DC    X'0001020304FFFFFFFFFFFFFFFFFFFF05'               S21088 65240002
         DC    X'1006'                  2282                     S21088 65310002
         DC    X'0001020304FFFFFFFFFFFFFFFFFFFF05'               S21088 65380002
         DC    X'1002'                  2250                     S21088 65450002
         DC    X'0001020304FFFFFFFFFFFFFFFFFFFF05'               S21088 65520002
         DC    X'1003'                  2260                     S21088 65590002
         DC    X'0001020304FFFFFFFFFFFFFFFFFFFF05'               S21088 65660002
         DC    X'0806'                  3505                     S21088 65730002
         DC    X'FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF'               S21088 65800002
STLBDFLT DS    0C                                                S21088 65870002
         DC    X'080C'                  3525                     S21088 65940002
         DC    X'FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF'               S21088 66010002
STLBLEND DC    F'0'                                              S21088 66080002
WORK     DS    D                                                 S21021 66150002
SAVE2    DS    F                                                 S21021 66220002
SHRTADCN DC    A(SHRTOBRS-L4)                                    S21021 66290002
         DC    A(SHRTOBRL)                                       S21021 66360002
OBRAREA  DS    CL104                                             S21021 66430002
BLANKS   DC    CL25' '                                           S21021 66500002
HW21     DC    H'21'                                             S21021 66570002
HW13     DC    H'13'                                             S21021 66640002
UNITCK   DC    C'UNIT CHECK'                                     S21021 66710002
OVFL     DC    C'OVERFLOW  '                                     S21021 66780002
SERNO    DC    C'SERIAL NO.'                                     S21021 66850002
MPCPU    DC    C'MULTIPROCESSOR - CPU'                           S21021 66920002
UNIVERS  DC    C'UNIVERSAL   SERIAL NO. NONE  '                  S21021 66990002
JOBID    DC    C'JOB IDENTITY'                                   S21021 67060002
         DS    0F                                                       67130002
XSAVE    DC    5F'0'                                                    67200002
NONE     DC    CL6'NONE  '                                              67270002
CHARS    DC    C'0123456789ABCDEF'                                      67340002
CHAR0    DC    C'0'                                                     67410002
DEVTABLE DC    X'1002'                                                  67480002
         DC              C'2250'                                        67550002
         DC    X'1003'                                                  67620002
         DC              C'2260'                                        67690002
         DC    X'1005'                                                  67760002
         DC              C'2280'                                        67830002
         DC    X'1006'                                                  67900002
         DC              C'2282'                                        67970002
REDLDEV  DC    X'0806'                                           S21088 68040002
         DC              C'3505'                                 S21088 68110002
PIKLDEV  DC    X'080C'                                           S21088 68180002
         DC              C'3525'                                 S21088 68250002
CLABEL1  DC    CL10'CMND REJ *'                                         68320002
         DC    CL10'RD CT CHK*'                                         68390002
         DC    CL10'INTV REQD*'                                         68460002
         DC    CL10'FILM  LOW*'                                         68530002
         DC    CL10'BUS O CHK*'                                         68600002
         DC    CL10'FORCD R G*'                                         68670002
         DC    CL10'EQUIP CHK*'                                         68740002
CLABEL1A DC    CL10'FILM MOT *'                                         68810002
         DC    CL10'DATA CHK *'                                         68880002
         DC    CL10'BIT  4   *'                                         68950002
         DC    CL10'BIT  5   *'                                         69020002
         DC    CL10'O/P CHECK*'                                         69090002
         DC    CL10'BIT  6   *'                                         69160002
         DC    CL10'I/P CHECK*'                                         69230002
         DC    CL10'ILLEG SEQ*'                                         69300002
         DC    CL10'GRAPH CHK*'                                         69370002
CLABEL2  DC    CL10'BIT  3   *'                                         69440002
CLABEL3  DC    CL10'CMND REJ *'                                         69510002
         DC    CL10'BIT  0   *'                                         69580002
         DC    CL10'INTV REQD*'                                         69650002
         DC    CL10'BIT  1   *'                                         69720002
         DC    CL10'BUS O CHK*'                                         69790002
         DC    CL10'BIT  2   *'                                         69860002
         DC    CL10'EQUIP CHK*'                                         69930002
         DC    CL10'BIT  3   *'                                         70000002
         DC    CL10'BIT  4   *'                                         70070002
         DC    CL10'BIT  4   *'                                         70140002
         DC    CL10'BIT  5   *'                                         70210002
         DC    CL10'BIT  5   *'                                         70280002
         DC    CL10'BIT  6   *'                                         70350002
         DC    CL10'BIT  6   *'                                         70420002
         DC    CL10'BIT  7   *'                                         70490002
         DC    CL10'BIT  7   *'                                         70560002
TCAMEND  DC    X'FE'                    NEXT TABLE END INDICATOR        70630002
         DC    CL8'IFCEXXXX'            TCAM TABLE NAME                 70700002
RELTAB   DS    0C                                              @L03976  70770002
         DC    C'OS  '                                         @L03976  70810002
         DC    C'DOS '                                         @L03976  70850002
         DC    C'VS 1'                                         @L03976  70890002
         DC    C'V370'                                         @L03976  70930002
         DC    C'VS 2'                                         @L03976  70970002
         DC    C'    '                                         @L03976  71010002
         DC    C'    '                                         @L03976  71050002
         DC    C'    '                                         @L03976  71090002
*                                                                       71190002
HEX0F    EQU   X'0F'                                                    71260002
*                       TABLE CONSTANTS                                 71330002
ENTRIES  DS    0F                                                       71400002
         DC    XL4'00010001'            FORMAT1                         71470002
         DC    XL4'00010001'            FORMAT2                         71540002
         DC    A(LABELS)                LABEL PTR                       71610002
         DC    H'0'                     DISP                            71680002
         DC    X'02'                                             S21021 71750002
         DC    X'000B8B00'                                              71820002
         DC    AL.12(XDUM1-XXX9),XL.4'D'  = ROUTINE XDUM1,       S21021 71890002
         DC    AL.4(0),AL.12(EXPNDRTN-IFCEXXX9)   EXPNDRTN       S21021 71960002
         LINE                                                           72030002
         LABEL      ' '                                                 72100002
*                                                                       72170002
         LINE  (55,23),(1,35),SKIP=1                             S21021 72240002
         ROUTINE  SW2B0,RECTYPE                                  S21021 72310002
         HEX   XMODEL,0,2B                                       S21021 72380002
         HEX   XSER,0,3B                                         S21021 72450002
         ROUTINE XMODEL,SETCPUNO                                 S21021 72520002
         LABEL '---RECORD ENTRY TYPE -','   SOURCE - OUTBOARD',  S21021X72590002
               'MODEL-'                                          S21021 72660002
         LINE  (16,1),(4,1)                                      S21021 72730002
         ROUTINE    XRELN,CONVREL                                       72800002
         LABEL      'XXXX REL.'                                         72870002
         LINE  (69,1),(31,19)                                    S21021 72940002
         ROUTINE XPGN1,SETPGMN                                   S21021 73010002
         LABEL 'DAY YEAR','HH MM SS.TH'                          S21021 73080002
         LINE  (31,19),(25,19)                                   S21021 73150002
         ROUTINE XDATE,SETDATE                                   S21021 73220002
         HEX   XTIME,1,4B                                        S21021 73290002
         ROUTINE  XDUM1,SKIPPER                                  S21021 73360002
         HEX   XPGN1,B6,4B                                       S21021 73430002
         HEX   XPGN2,B16,4B                                      S21021 73500002
         ROUTINE  SW2B0,NONAME                                   S21021 73570002
         LABEL 'DATE-','TIME-'                                   S21021 73640002
         LINE  (1,1),(1,1)                                       S21021 73710002
         ROUTINE SW2B0,TESTMP                                    S21021 73780002
         LABEL ''                                                S21021 73850002
         LINE  ,(1,1),SKIP=2                                     S21021 73920002
         ROUTINE XDUM1,SETCONV                                   S21021 73990002
         LABEL 'OBR RECORD CONVERTED TO THE STANDARD FORMAT'     S21021 74060002
         LINE  (34,1),(2,1),SKIP=1                               S21021 74130002
         ROUTINE XDEVT2,SETDEVTY                                 S21088 74200002
         LABEL 'DEVICE TYPE'                                     S21021 74270002
         LINE                                                    S21021 74340002
         HEX   XCUA,B0,3B                                        S21021 74410002
         LABEL 'PRIMARY   CHANNEL UNIT ADDRESS  '                S21021 74480002
         LINE                                                    S21021 74550002
         HEX   XCUA2,B0,3B                                       S21021 74620002
         ROUTINE  XDUM1,TESTSHRT                                 S21021 74690002
         LABEL 'ALTERNATE CHANNEL UNIT ADDRESS  '                S21021 74760002
         LINE                                                    S21021 74830002
         LABEL ' '                                               S21021 74900002
         LINE  (1,1),(23,38)                                     S21021 74970002
         LABEL 'CC   CA   FL     CT','K    CA   US CS  CT'       S21021 75040002
         LINE  (23,3),(5,51),SKIP=2                              S21021 75110002
         HEX   XFCCWCC,0,1B                                      S21021 75180002
         HEX   XFCCWDA,0,3B                                      S21021 75250002
         ROUTINE  XDUM1,SPACER1                                  S21021 75320002
         HEX   XFCCWFL,0,1B                                      S21021 75390002
         HEX   XZERO,0,1B                                        S21021 75460002
         HEX   XFCCWCT,0,2B                                      S21021 75530002
         ROUTINE  XDUM1,SPACER16                                 S21021 75600002
         HEX   XCSWK,0,1B                                        S21021 75670002
         HEX   XCSWCA,0,3B                                       S21021 75740002
         ROUTINE  XDUM1,SPACER1                                  S21021 75810002
         ROUTINE XCSWATTN,SETHEX                                 S21021 75880002
         ROUTINE XCSWPCI,SETHEX                                  S21021 75950002
         HEX   XCSWCT,0,2B                                       S21021 76020002
         LABEL 'FAILING CCW','CSW'                               S21021 76090002
         LINE  ,(5,28)                                           S21021 76160002
         ROUTINE    XDUM1,SKIPPER                                       76230002
         LABEL 'UNIT STATUS','CHANNEL STATUS',                   S21021X76300002
               'STATISTICAL DATA','STATISTICAL DATA'             S21021 76370002
*                                                                       76440002
*                     CSW DETAIL  OF US & CS FIELDS                     76510002
*                                                                       76580002
         LINE  (20,28),(3,28),SKIP=1                             S21021 76650002
         BIN        XCSWATTN                                            76720002
         BIN        XCSWPCI                                             76790002
         ROUTINE    SDR1,SDRCONVL                                S21021 76860002
         ROUTINE    SDR1,SDRCONVR                                S21021 76930002
         ROUTINE  XDUM1,SETSTLBL                                 S21088 77000002
         LABEL 'ATTENTION       ','PRGM-CTLD TRPT  ',            S21021X77070002
               '             ','             '                   S21021 77140002
         LINE                                                           77210002
         BIN        XCSWSM                                              77280002
         BIN        XCSWSILI                                            77350002
         ROUTINE    SDR2,SDRCONVL                                S21021 77420002
         ROUTINE    SDR2,SDRCONVR                                S21021 77490002
         LABEL 'STATUS MODIFIER ','INCORRECT LENGTH',            S21021X77560002
               '             ','             '                   S21021 77630002
         LINE                                                           77700002
         BIN        XCSWCUE                                             77770002
         BIN        XCSWPC                                              77840002
         ROUTINE    SDR3,SDRCONVL                                S21021 77910002
         ROUTINE SDR3,SDRCONVR                                   S21021 77980002
         LABEL 'CONTROL UNIT END','PROGRAM CHECK   ',            S21021X78050002
               '             ','             '                   S21021 78120002
         LINE                                                           78190002
         BIN        XCSWBSY                                             78260002
         BIN        XCSWPCHK                                            78330002
         ROUTINE SDR4,SDRCONVL                                   S21021 78400002
         ROUTINE SDR4,SDRCONVR                                   S21021 78470002
         LABEL 'BUSY            ','PROTECTION CHECK',            S21021X78540002
               '             ','             '                   S21021 78610002
         LINE                                                           78680002
         BIN        XCSWCE                                              78750002
         BIN        XCSWCDC                                             78820002
         ROUTINE SDR5,SDRCONVL                                   S21021 78890002
         ROUTINE SDR5,SDRCONVR                                   S21021 78960002
         LABEL 'CHANNEL END     ','CHAN DATA CHECK ',            S21021X79030002
               '             ','             '                   S21021 79100002
         LINE                                                           79170002
         BIN        XCSWDE                                              79240002
         BIN        XCSWCCC                                             79310002
         ROUTINE SDR6,SDRCONVL                                   S21021 79380002
         ROUTINE SDR6,SDRCONVR                                   S21021 79450002
         LABEL 'DEVICE END      ','CHAN CTL CHECK  ',            S21021X79520002
               '             ','             '                   S21021 79590002
         LINE                                                           79660002
         BIN        XCSWUC                                              79730002
         BIN        XCSWICC                                             79800002
         ROUTINE SDR7,SDRCONVL                                   S21021 79870002
         ROUTINE SDR7,SDRCONVR                                   S21021 79940002
         LABEL 'UNIT CHECK      ','I/F CTL CHECK   ',            S21021X80010002
               '             ','             '                   S21021 80080002
         LINE       ,,SKIP=2                                            80150002
         BIN        XCSWUE                                              80220002
         BIN        XCSWCH                                              80290002
         ROUTINE SDR8,SDRCONVL                                   S21021 80360002
         ROUTINE SDR8,SDRCONVR                                   S21021 80430002
         LABEL 'UNIT EXCEPTION  ','CHAINING CHECK  ',            S21021X80500002
               '             ','             '                   S21021 80570002
*                                                                       80640002
         LINE                                                    S21021 80710002
         ROUTINE    XDUM1,SKIPPER                                       80780002
         LABEL      'SENSE BYTE DATA'                                   80850002
*                                                                       80920002
         LINE  (15,20),(1,20),SKIP=2                             S21021 80990002
         ROUTINE  XB0CMDR,SETHEX                                 S21021 81060002
         ROUTINE  XB1LPD,SETHEX                                  S21021 81130002
         ROUTINE  XB2BIT0,SETHEX                                 S21021 81200002
         ROUTINE  XB3BAR8,SETHEX                                 S21021 81270002
         LABEL      'BYTE 0','BYTE 1','BYTE 2','BYTE 3'                 81340002
*                                       STATUS BYTE                     81410002
         LINE  (15,20),(1,20),SKIP=1                             S21021 81480002
         BIN        XB0CMDR                                             81550002
         BIN        XB1LPD                                              81620002
         BIN        XB2BIT0                                             81690002
         BIN        XB3BAR8                                             81760002
         ROUTINE    XDEVT2,SETLABEL          SET LABELS FOR DIFF DEV    81830002
         LABEL      'CMND REJ ','LP DETECT','BIT  0   ','BAR  8   '     81900002
         LINE                                                           81970002
         BIN        XB0BIT1                                             82040002
         BIN        XB1EOS                                              82110002
         BIN        XB2BAR15                                            82180002
         BIN        XB3BAR7                                             82250002
         LABEL      'BIT  1   ','END O SEQ','BAR 15   ','BAR  7   '     82320002
         LINE                                                           82390002
         BIN        XB0BUSC                                             82460002
         BIN        XB1CMODE                                            82530002
         BIN        XB2BAR14                                            82600002
         BIN        XB3BAR6                                             82670002
         LABEL      'BUS O CHK','CHAR MODE','BAR 14   ','BAR  6   '     82740002
         LINE                                                           82810002
         BIN        XB0BIT3                                             82880002
         BIN        XB1BIT3                                             82950002
         BIN        XB2BAR13                                            83020002
         BIN        XB3BAR5                                             83090002
         LABEL      'BIT  3   ','BIT  3   ','BAR 13   ','BAR  5   '     83160002
         LINE                                                           83230002
         BIN        XB0DCHK                                             83300002
         BIN        XB1BIT4                                             83370002
         BIN        XB2BAR12                                            83440002
         BIN        XB3BAR4                                             83510002
         LABEL      'DATA CHK ','BIT  4   ','BAR 12   ','BAR  4   '     83580002
         LINE                                                           83650002
         BIN        XB0BIT5                                             83720002
         BIN        XB1BIT5                                             83790002
         BIN        XB2BAR11                                            83860002
         BIN        XB3BAR3                                             83930002
         LABEL      'BIT  5   ','BIT  5   ','BAR 11   ','BAR  3   '     84000002
         LINE                                                           84070002
         BIN        XB0BRUN                                             84140002
         BIN        XB1BIT6                                             84210002
         BIN        XB2BAR10                                            84280002
         BIN        XB3BAR2                                             84350002
         LABEL      'BUFF RUNN','BIT  6   ','BAR 10   ','BAR  2   '     84420002
         LINE  ,,SKIP=2                                          S21021 84490002
         BIN        XB0BIT7                                             84560002
         BIN        XB1BIT7                                             84630002
         BIN        XB2BAR9                                             84700002
         BIN        XB3BAR1                                             84770002
         ROUTINE    XDUM1,RESETR2                                S21021 84840002
         LABEL      'BIT  7   ','BIT  7   ','BAR  9   ','BAR  1   '     84910002
         LINE  ,,SKIP=1                                          S21021 84980002
         LABEL ''                                                S21021 85050002
         DC    X'FF'                    END OF TABLE                    85120002
RECSIZE  DC    X'0000'                  SIZE OF REC- VARIES      S21021 85190002
         DC    XL2'0018'                                                85260002
         DC    XL2'0018'                                         S21021 85330002
*                                                                S21021 85400002
*                                       LABELS FOR 3505,3525     S21021 85470002
*                                                                S21021 85540002
REDPIKLB LABEL 'CMND REJ','PERM ERROR','BIT 0','BIT 0'           S21021 85610002
         LABEL 'INTV REQD','AUTO RETRY','BIT 1','BIT 1'          S21021 85680002
         LABEL 'BUS O CHK','MOTION MALF','BIT 2','BIT 2'         S21021 85750002
         LABEL 'EQUIP CHK','RAIC','BIT 3','BIT 3'                S21021 85820002
         LABEL 'DATA CHK','BIT 4','BIT 4','BIT 4'                S21021 85890002
         LABEL 'BIT 5','BIT 5','BIT 5','BIT 5'                   S21021 85960002
         LABEL 'AB FORM RST','BIT 6','BIT 6','BIT 6'             S21021 86030002
         LABEL 'PERM ERR-PEK','BIT 7','BIT 7','BIT 7'            S21021 86100002
SHRTOBRL LABEL      ''                                           S21021 86170002
SHRTOBRS LINE  ,(1,1),SKIP=2                                     S21021 86240002
         ROUTINE    XDUM1,SKIPPER                                S21021 86310002
         LABEL      'STATISTICAL DATA'                           S21021 86380002
*                                                                S21021 86450002
         LINE       (21,30),(1,30),SKIP=1                        S21021 86520002
         ROUTINE    SDR1,SDRCONVL                                S21021 86590002
         ROUTINE    SDR1,SDRCONVR                                S21021 86660002
         ROUTINE  XDUM1,SETSTLBL                                 S21088 86730002
         LABEL '             ','             '                   S21021 86800002
*                                                                S21021 86870002
         LINE                                                    S21021 86940002
         ROUTINE    SDR2,SDRCONVL                                S21021 87010002
         ROUTINE    SDR2,SDRCONVR                                S21021 87080002
         LABEL '             ','             '                   S21021 87150002
         LINE                                                    S21021 87220002
         ROUTINE    SDR3,SDRCONVL                                S21021 87290002
         ROUTINE SDR3,SDRCONVR                                   S21021 87360002
         LABEL '             ','             '                   S21021 87430002
         LINE                                                    S21021 87500002
*                                                                S21021 87570002
         ROUTINE SDR4,SDRCONVL                                   S21021 87640002
         ROUTINE SDR4,SDRCONVR                                   S21021 87710002
         LABEL '             ','             '                   S21021 87780002
         LINE                                                    S21021 87850002
         ROUTINE SDR5,SDRCONVL                                   S21021 87920002
         ROUTINE SDR5,SDRCONVR                                   S21021 87990002
         LABEL '             ','             '                   S21021 88060002
         LINE                                                    S21021 88130002
         ROUTINE SDR6,SDRCONVL                                   S21021 88200002
         ROUTINE SDR6,SDRCONVR                                   S21021 88270002
         LABEL '             ','             '                   S21021 88340002
         LINE                                                    S21021 88410002
         ROUTINE SDR7,SDRCONVL                                   S21021 88480002
         ROUTINE SDR7,SDRCONVR                                   S21021 88550002
         LABEL '             ','             '                   S21021 88620002
         LINE                                                    S21021 88690002
         ROUTINE SDR8,SDRCONVL                                   S21021 88760002
         ROUTINE SDR8,SDRCONVR                                   S21021 88830002
         LABEL '             ','             '                   S21021 88900002
         LINE                                                    S21021 88970002
         ROUTINE    XDUM1,RESETR2                                S21021 89040002
         LABEL      ''                                           S21021 89110002
*                                                                S21021 89180002
         DC         X'FF'                                        S21021 89250002
         DC         X'0028'                                      S21021 89320002
         DC         X'0018'                                      S21021 89390002
         DC    XL2'0018'                                         S21021 89460002
LABELS   DS    0F                                                       89530002
         DC    C'$'                                                     89600002
         LSTART                                                         89670002
         END                                                            89740002
