 TITLE 'IFCE0155 MODEL 155 EDIT TABLE 1'                                00060002
         MACRO                                                          00120002
         BIN                                                            00180002
.*                                 &SYSLIST(&OP,1) - NAME OF LOG ITEM   00240002
.*                                      RECORD DSECT                    00300002
.*                                 $SYSLIST(&OP,2) - NBR OF SPACES      00360002
.*                                      TO SKIP ON MULTIPLE             00420002
.*                                      PRINT OR NBR OF SPACES          00480002
.*                                      TO BACK UP FROM COLUMN FOR      00540002
.*                                      START OF PRINTING. THE LETTER   00600002
.*                                      B PRECEEDS THE NUMBER (B5) IF   00660002
.*                                      THE LATTER IS DESIRED. OMISSION 00720002
.*                                      OF THIS OPERAND FORCES OPTION 2 00780002
.*                                      WITH BACKUP SPACING EQUAL TO    00840002
.*                                 THE NUMBER OF BITS IN THE ITEM       00900002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      00960002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     01020002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       01080002
         GBLA  &INITIAL                                                 01140002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               01200002
         GBLC &ITEM(3000)                                               01260002
         GBLA &ITEMNBR,&BITS(3000),&SHIFT(3000),&NRENTS                 01320002
         GBLC  &DSECT                                                   01380002
         LCLB  &B,&SUB                                                  01440002
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   01500002
         LCLA  &TEMP,&T,&OP                                             01560002
         LCLC  &S                                                       01620002
         AIF   (&DIAGTST EQ 0).NOMSG                                    01680002
         AIF   (&INITIAL EQ 0).NOMSG                                    01740002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    01800002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  01860002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     01920002
*        LINE                                                           01980002
         LINE                                                           02040002
.NOMSG   ANOP                                                           02100002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  02160002
&SUB     SETB  1                                                        02220002
.LOOP    ANOP                                                           02280002
&OP      SETA  &OP+1                                                    02340002
.LOOP1   ANOP                                                           02400002
&NDX     SETA  &NDX+1                                                   02460002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND               02520002
         AIF   (&NDX LT &ITEMNBR).LOOP1                                 02580002
         MNOTE '**LOG ITEM NOT DEFINED**'                               02640002
         MEXIT                                                          02700002
.FOUND   ANOP                                                           02760002
&ISHIFT  SETA  &SHIFT(&NDX)                                             02820002
&IBITS   SETA  &BITS(&NDX)                                              02880002
&T       SETA  &IBITS-1                                                 02940002
&B       SETB  0                                                        03000002
         AIF   (&IBITS GT 0 AND &IBITS LT 16).SUB0                      03060002
         MNOTE '**NO. OF BITS OUTSIDE RANGE OF 1-15**'                  03120002
         MEXIT                                                          03180002
.SUB0    AIF   (&SUB EQ 1).SUBA                                         03240002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             03300002
&K       SETA  K'&SYSLIST(2)                                            03360002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              03420002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                03480002
         AGO   .SUBB                                                    03540002
.SUBA    ANOP                                                           03600002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         03660002
&K       SETA  K'&SYSLIST(&OP,2)                                        03720002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          03780002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            03840002
.SUBB    ANOP                                                           03900002
&T       SETA  &S                                                       03960002
.BACKUP  ANOP                                                           04020002
&NRENTS  SETA  &NRENTS+1                                                04080002
&TEMP    SETA  &ISHIFT                                                  04140002
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                            04200002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'                04260002
         AGO   .OUT                                                     04320002
.BIN2    AIF   ('&SYSLIST(&OP,2)' NE '').BIN3                           04380002
&B       SETB  1                                                        04440002
.BIN3    ANOP                                                           04500002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'                    04560002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             04620002
.OUT     ANOP                                                           04680002
&NDX     SETA  0                                                        04740002
         AIF   (&SUB EQ 0).OUTA                                         04800002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 04860002
.OUTA    ANOP                                                           04920002
         MEND                                                           04980002
         MACRO                                                          05040002
         HEX                                                            05100002
.*                            THIS MACRO FACILITATES GENERATION OF THE  05160002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    05220002
.*                                 CONVERSIONS.                         05280002
.*                            &SYSLIST(&OP,1) - NAME OF DATA ITEM TO BE 05340002
.*                                 CONVERTED                            05400002
.*                            &SYSLIST(&OP,2) - # OF SPACES TO SKIP ON  05460002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   05520002
.*                                 BACK UP FROM COLUMN FOR START OF     05580002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  05640002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  05700002
.*                                 DESIRED. OMISSION OF THIS OPERAND    05760002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  05820002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  05880002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 05940002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    06000002
.*                                 IMPLICITLY B).                       06060002
.*                            &SYSLIST(&OP,3) - NUMBER OF BYTES TO      06120002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     06180002
.*                                 WITH AN L,R, OR B TO STIPULATE       06240002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     06300002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     06360002
.*                                 RESPECTIVELY. OMISSION OF THIS       06420002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  06480002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 06540002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 06600002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   06660002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     06720002
.*                                 SUBJECT LINE(S).                     06780002
         GBLC &ITEM(3000),&DSECT                                        06840002
         GBLA &ITEMNBR,&BITS(3000),&SHIFT(3000),&NRENTS                 06900002
         GBLA  &INITIAL                                                 06960002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               07020002
         LCLB  &B,&SUB                                                  07080002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP,&OP              07140002
         LCLC  &S,&LETTER                                               07200002
         AIF   (&DIAGTST EQ 0).NOMSG                                    07260002
         AIF   (&INITIAL EQ 0).NOMSG                                    07320002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    07380002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  07440002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     07500002
*        LINE                                                           07560002
         LINE                                                           07620002
.NOMSG   ANOP                                                           07680002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  07740002
&SUB     SETB  1                                                        07800002
.LOOP    ANOP                                                           07860002
&OP      SETA  &OP+1                                                    07920002
.LOOP1   ANOP                                                           07980002
&NDX     SETA  &NDX+1                                                   08040002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND               08100002
         AIF   (&NDX LT &ITEMNBR).LOOP1                                 08160002
         MNOTE '**LOG ITEM NOT DEFINED**'                               08220002
         MEXIT                                                          08280002
.FOUND   ANOP                                                           08340002
&ISHIFT  SETA  &SHIFT(&NDX)                                             08400002
&IBITS   SETA  &BITS(&NDX)                                              08460002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).ALIGN                     08520002
.ERR     MNOTE '**DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY**'          08580002
         MEXIT                                                          08640002
.ALIGN   ANOP                                                           08700002
&CODE    SETA  1                                                        08760002
         AIF   (&SUB EQ 1).SUBA                                         08820002
&K       SETA  K'&SYSLIST(3)                                            08880002
         AGO   .SUBB                                                    08940002
.SUBA    ANOP                                                           09000002
&K       SETA  K'&SYSLIST(&OP,3)                                        09060002
.SUBB    ANOP                                                           09120002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            09180002
         MNOTE '**BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL**' 09240002
         MEXIT                                                          09300002
.OK      AIF   (&SUB EQ 1).SUBC                                         09360002
         AIF   ('&SYSLIST(3)' EQ '').USEDEFN                            09420002
&LETTER  SETC  '&SYSLIST(3)'(&K,1)                                      09480002
&S       SETC  '&SYSLIST(3)'(1,&K-1)                                    09540002
         AGO   .SUBD                                                    09600002
.SUBC    ANOP                                                           09660002
         AIF   ('&SYSLIST(&OP,3)' EQ '').USEDEFN                        09720002
&LETTER  SETC  '&SYSLIST(&OP,3)'(&K,1)                                  09780002
&S       SETC  '&SYSLIST(&OP,3)'(1,&K-1)                                09840002
.SUBD    ANOP                                                           09900002
&BYTESP  SETA  &S                                                       09960002
         AIF   ('&LETTER' EQ 'B').BOTH                                  10020002
         AIF   ('&LETTER' EQ 'L').LEFT                                  10080002
&CODE    SETA  2                                                        10140002
         AGO   .L                                                       10200002
.LEFT    ANOP                                                           10260002
&CODE    SETA  1                                                        10320002
         AGO   .L                                                       10380002
.USEDEFN ANOP                                                           10440002
&BYTESP  SETA  &IBITS/8                                                 10500002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       10560002
&CODE    SETA  3                                                        10620002
&T       SETA  &BYTESP*2-1                                              10680002
&S       SETC  '&T'                                                     10740002
.OK2     AIF   (&ISHIFT EQ 0).L                                         10800002
&CODE    SETA  2                                                        10860002
.L       ANOP                                                           10920002
&B       SETB  1                                                        10980002
         AIF   (&SUB EQ 1).SUBE                                         11040002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             11100002
&K       SETA  K'&SYSLIST(2)                                            11160002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              11220002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                11280002
         AGO   .SUBF                                                    11340002
.SUBE    ANOP                                                           11400002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         11460002
&K       SETA  K'&SYSLIST(&OP,2)                                        11520002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          11580002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            11640002
.SUBF    ANOP                                                           11700002
.BACKUP  ANOP                                                           11760002
&NRENTS  SETA  &NRENTS+1                                                11820002
         AIF   (&BYTESP GT 0 AND &BYTESP LT 16).SUB0                    11880002
         MNOTE '**NO. OF BYTES OUTSIDE RANGE OF 1-15**'                 11940002
         MEXIT                                                          12000002
.SUB0    AIF   (&SUB EQ 1).SUBG                                         12060002
         DC    AL.12(&SYSLIST(1)-&DSECT),XL.4'A'                        12120002
         AGO   .SUBH                                                    12180002
.SUBG    ANOP                                                           12240002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'A'                    12300002
.SUBH    ANOP                                                           12360002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'              12420002
.OUT     ANOP                                                           12480002
&NDX     SETA  0                                                        12540002
         AIF   (&SUB EQ 0).OUTA                                         12600002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 12660002
.OUTA    ANOP                                                           12720002
         MEND                                                           12780002
         MACRO                                                          12840002
         LSTART                                                         12900002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  12960002
.*                                 OF THE TABLE IS TO BEGIN.            13020002
         GBLA  &LABELNR                                                 13080002
         GBLC  &LBL(100)                                                13140002
         GBLC &LABELS(2000)                                             13200002
         GBLA  &LBLCTR(100)                                             13260002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               13320002
         LCLA  &NDX,&CTR                                                13380002
         AIF   (&DIAGTST EQ 0).NODIAG                                   13440002
         AIF   (&DIAGSET EQ 0).NODIAG                                   13500002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  13560002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   13620002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       13680002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 13740002
.NODIAG  ANOP                                                           13800002
         LINEND                                                         13860002
&CTR     SETA  1                                                        13920002
.LOOP    ANOP                                                           13980002
&NDX     SETA  &NDX+1                                                   14040002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            14100002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         14160002
&CTR     SETA  &CTR+1                                                   14220002
         AGO   .LOOPCTL                                                 14280002
.NOLBL   ANOP                                                           14340002
         DC    C'&LABELS(&NDX)'                                         14400002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  14460002
         MEND                                                           14520002
         MACRO                                                          14580002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C14640002
               &LABEL7,&LABEL8                                          14700002
.*                                 THIS MACRO ALLOWS LABELS TO          14760002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   14820002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  14880002
.*                                 TION MARKS. THE COLUMN AND LINE END  14940002
.*                                 CONTROLS WILL BE INSERTED BY THE     15000002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      15060002
.*                                 LABEL REQUIRED FOR RESPECTIVE        15120002
.*                                 COLUMN.                              15180002
         GBLC &LABELS(2000)                                             15240002
         GBLC  &LBL(100)                                                15300002
         GBLA  &LBLCTR(100)                                             15360002
         GBLA  &LABELNR                                                 15420002
         GBLA  &NRENTS,&LPTR,&INITIAL                                   15480002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               15540002
         LCLC  &MARGIN,&TACK                                            15600002
         LCLC  &TEXT                                                    15660002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            15720002
         AIF   (&INITIAL EQ 0).DIAGCLR                                  15780002
         AIF   (&DIAGTST EQ 0).DIAGCLR                                  15840002
         AIF   (&DIAGLIN EQ 1).DIAGCLR                                  15900002
         MNOTE '**NO LINE ASSOCIATED WITH PREVIOUS LABEL**'             15960002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   16020002
*        LINE                                                           16080002
         LINE                                                           16140002
.DIAGCLR ANOP                                                           16200002
&DIAGSET SETB  0                                                        16260002
&DIAGLIN SETB  0                                                        16320002
&MARGIN  SETC  '*'                                                      16380002
         AIF   ('&NAME' EQ '').LOOPOUT                                  16440002
&LPTR    SETA  &LPTR+1                                                  16500002
&LBL(&LPTR) SETC '&NAME'                                                16560002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          16620002
.LOOPOUT ANOP                                                           16680002
&OP      SETA  &OP+1                                                    16740002
&K       SETA  K'&SYSLIST(&OP)                                          16800002
         AIF (&K GE 2).NORM                                             16860002
&K       SETA  2                                                        16920002
.NORM    ANOP                                                           16980002
&START   SETA  2                                                        17040002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                17100002
&MARGIN  SETC  '$'                                                      17160002
.NOTLAST ANOP                                                           17220002
&NRCHAR  SETA  8                                                        17280002
&TACK    SETC  ''                                                       17340002
.LOOPIN  ANOP                                                           17400002
&REMAIN  SETA  &K-&START                                                17460002
         AIF (&REMAIN GE 8).MORE                                        17520002
&TACK    SETC  '&MARGIN'                                                17580002
&NRCHAR  SETA  &REMAIN                                                  17640002
.MORE    ANOP                                                           17700002
&TEXT    SETC  ''                                                       17760002
         AIF (&REMAIN EQ 0).ENDTEXT                                     17820002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          17880002
.ENDTEXT ANOP                                                           17940002
&LABELNR SETA  &LABELNR+1                                               18000002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  18060002
&START   SETA  &START+8                                                 18120002
         AIF ('&TACK' EQ '').LOOPIN                                     18180002
         AIF ('&TACK' EQ '*').LOOPOUT                                   18240002
         MEND                                                           18300002
         MACRO                                                          18360002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      18420002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     18480002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    18540002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 18600002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    18660002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    18720002
.*                                 THE PREVIOUS LINE AND STORES THAT #  18780002
.*                                 INTO THE APPROPRIATE BYTE.           18840002
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    18900002
.*                                 DATA.                                18960002
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 19020002
.*                                 DATA COLUMN STARTING CHARACTERS.     19080002
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   19140002
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 19200002
.*                                 STARTING CHARACTERS.                 19260002
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   19320002
.*                                 TO BEGIN NEXT PRINTED LINE.          19380002
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       19440002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   19500002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 19560002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   19620002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 19680002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    19740002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   19800002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   19860002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  19920002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   19980002
.*                                 THE SUBJECT LINE                     20040002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  20100002
         GBLA  &LASTCC,&INITIAL                                         20160002
         GBLC  &NRENTSX                                                 20220002
         GBLC  &CARRCON                                                 20280002
         GBLB  &TEST                                                    20340002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               20400002
         LCLA  &S                                                       20460002
         AIF   (&INITIAL EQ 0 OR &DIAGTST EQ 0).DIAGSET                 20520002
         AIF   (&DIAGSET EQ 0).DIAGSET                                  20580002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  20640002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   20700002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       20760002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 20820002
.DIAGSET ANOP                                                           20880002
&DIAGSET SETB  1                                                        20940002
&DIAGLIN SETB  1                                                        21000002
&NAME    DS    0C                                                       21060002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  21120002
         LINEND                                                         21180002
         AGO   .NTFIRST                                                 21240002
.FIRSTLN ANOP                                                           21300002
&NRENTSX SETC  'N&SYSNDX'                                               21360002
&INITIAL SETA  1                                                        21420002
N&SYSNDX EQU   *                                                        21480002
.NTFIRST ANOP                                                           21540002
         DC    AL1(0)                                                   21600002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               21660002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                21720002
&DB      SETA  &DATA(1)                                                 21780002
         AGO   .AA                                                      21840002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                21900002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 21960002
         AGO   .CC                                                      22020002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    22080002
         AIF   (&DATA(2) EQ &DT).BB                                     22140002
.CC      ANOP                                                           22200002
&DT      SETA  &DATA(2)                                                 22260002
.BB      DC    XL2'FFFE'                                                22320002
         DC    FL1'&DB'                                                 22380002
         DC    FL1'&DT'                                                 22440002
&NRENTS  SETA  &NRENTS+1                                                22500002
.NCDATA  ANOP                                                           22560002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              22620002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               22680002
&LB      SETA  &LABEL(1)                                                22740002
         AGO   .AAA                                                     22800002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              22860002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               22920002
         AGO   .CCC                                                     22980002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  23040002
         AIF   (&LABEL(2) EQ &LT).BBB                                   23100002
.CCC     ANOP                                                           23160002
&LT      SETA  &LABEL(2)                                                23220002
.BBB     DC    XL2'FFFF'                                                23280002
         DC    FL1'&LB'                                                 23340002
         DC    FL1'&LT'                                                 23400002
&NRENTS  SETA  &NRENTS+1                                                23460002
.NCLABEL ANOP                                                           23520002
         AIF   ('&SKIP' NE '').CONT                                     23580002
         AIF   (&TEST EQ 0).NOCHANG                                     23640002
         AGO   .DEFALTA                                                 23700002
.CONT    ANOP                                                           23760002
         AIF   (&TEST EQ 0).AB                                          23820002
         AIF   ('&SKIP' EQ 'E').AB                                      23880002
&S       SETA  &SKIP                                                    23940002
.DEFAULT ANOP                                                           24000002
         AIF   (&SKIP EQ &LASTCC).DEFALTA                               24060002
         ORG   &CARRCON+3                                               24120002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 24180002
         ORG                                                            24240002
&LASTCC  SETA  &S                                                       24300002
.DEFALTA ANOP                                                           24360002
&TEST    SETB  0                                                        24420002
         AGO   .DD                                                      24480002
.AB      AIF   ('&SKIP' NE 'E').ABB                                     24540002
A&SYSNDX DC    X'FFFB8B00'              EJECT                           24600002
         AGO   .ABC                                                     24660002
.ABB     AIF   (&SKIP EQ &LASTCC).NOCHANG                               24720002
A&SYSNDX DC    XL2'FFFB'                                                24780002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              24840002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              24900002
&LASTCC  SETA  &SKIP                                                    24960002
&TEST    SETB  1                                                        25020002
.ABC     ANOP                                                           25080002
&CARRCON SETC  'A&SYSNDX'                                               25140002
&NRENTS  SETA  &NRENTS+1                                                25200002
.DD      ANOP                                                           25260002
.NOCHANG ANOP                                                           25320002
         MEND                                                           25380002
         MACRO                                                          25440002
&NAME    DSGEN                                                          25500002
.*                            THIS MACRO GENERATES ONE DSECT WORD       25560002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 25620002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  25680002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    25740002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 25800002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   25860002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 25920002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      25980002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  26040002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    26100002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   26160002
         GBLC &ITEM(3000)                                               26220002
         GBLA &ITEMNBR,&BITS(3000),&SHIFT(3000)                         26280002
         LCLB  &ONLY1,&CTIND                                            26340002
         LCLA  &START1,&START2,&END1,&END2                              26400002
         LCLC  &SYMBOL,&EQUSYM                                          26460002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 26520002
         ACTR  100000                                                   26580002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            26640002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     26700002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   26760002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        26820002
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1            26880002
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT             26940002
         AGO   .SET2A                   BRANCH AROUND                   27000002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              27060002
         MEXIT                                                          27120002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X27180002
               ).SET2                   TEST FOR NO SECOND              27240002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   27300002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        27360002
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2            27420002
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2              27480002
         AGO   .LOOP                                                    27540002
.SET2    ANOP                                                           27600002
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 27660002
         AGO   .LOOP                                                    27720002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             27780002
         MEXIT                                                          27840002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               27900002
         MEXIT                                                          27960002
.LOOP    ANOP                                                           28020002
&OP      SETA  &OP+1                                                    28080002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           28140002
&ITEMNBR SETA  &ITEMNBR+1                                               28200002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            28260002
         MNOTE '**NULL BIT COUNT FIELD**'                               28320002
         MEXIT                                                          28380002
.OK1     ANOP                                                           28440002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        28500002
         AIF   ('&SYMBOL' NE '').OK                                     28560002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         28620002
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                         28680002
         AGO   .START                   GET NEXT                        28740002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        28800002
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU          28860002
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        28920002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         28980002
         AGO   .NO3                     BRANCH AROUND                   29040002
.OK2     ANOP                                                           29100002
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED              29160002
.NO3     ANOP                                                           29220002
&SYMBOL  EQU   *+&BYTE                                                  29280002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL             29340002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    29400002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    29460002
.CNT     ANOP                                                           29520002
&CTIND   SETB  1                        SET COUNT INDICATOR             29580002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   29640002
&BYTE    SETA  &COUNT/8                                                 29700002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        29760002
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        29820002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             29880002
&END1    SETA  &END1+1                  INCREMENT COUNT                 29940002
&OP      SETA  &OP-1                    DECREMENT INCREMENT             30000002
         AGO   .LOOP                    GENERATE NEXT                   30060002
.TSTST   ANOP                                                           30120002
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END               30180002
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        30240002
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      30300002
.NSET1   ANOP                                                           30360002
&OP      SETA  &OP-1                    DECREMENT INDEX                 30420002
&START1  SETA  &START1+1                INCREMENT FIRST COUNT           30480002
         AGO   .LOOP                    GO DO NEXT                      30540002
.LPDONE  ANOP                                                           30600002
&ONLY1   SETB  0                        CLEAR INDICATOR                 30660002
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      30720002
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 30780002
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT               30840002
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES             30900002
&NAME    DS    &COUNT.C                                                 30960002
.END     MEXIT                                                          31020002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          31080002
         MEXIT                                                          31140002
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   31200002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   31260002
         MEXIT                                                          31320002
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         31380002
*****               THE FOLLOWING STATEMENT                *****        31440002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        31500002
.EQU2    ANOP                                                           31560002
&EQUCNT  SETA  0                        CLEAR COUNTER                   31620002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND                 31680002
.EQULOP  ANOP                                                           31740002
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX                 31800002
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     31860002
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?                31920002
         AGO   .EQULOP                  NO-GET NEXT                     31980002
.EQUOUT  ANOP                                                           32040002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME                  32100002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS              32160002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT                 32220002
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED             32280002
         AGO   .START                   RETURN FOR NEXT                 32340002
         MEND                                                           32400002
         MACRO                                                          32460002
&NAME    BIND  &Z1,&Z2,&Z3,&Z4                                          32520002
.*                                 THIS MACRO HELPS COLLOCATE BITS IN   32580002
.*                                 DIFFERENT AREAS OF THE LOG TO MAKE   32640002
.*                                 THEM ACCESSIBLE TO THE 'HEX' MACRO.  32700002
.*                                 EACH OPERAND HAS 3 SUBFIELDS:1 SPE-  32760002
.*                                 CIFIES BY LOGITEM NAME THE BYTE TO   32820002
.*                                 BE REFERENCED,2 GIVES THE NUMBER OF  32880002
.*                                 UNDESIRED BITS TO THE LEFT OF THE    32940002
.*                                 LOG ITEM'S FIRST BIT,3 GIVES THE LOG 33000002
.*                                ITEM'S LENGTH IN BITS. THE MACRO      33060002
.*                                CAUSES THE INFORMATION TO BE STORED & 33120002
.*                                CONTROL IS GIVEN TO THE 'BINDER' ROU- 33180002
.*                                TINE,WHICH STORES THE COLLOCATED      33240002
.*                                BITS RIGHT-JUSTIFIED IN THE FOUR-     33300002
.*                                BYTE WORK AREA INSERTED IN THE LOG,   33360002
.*                                BEGINNING AT 'LOGWORK1'               33420002
         GBLC      &DSECT                                               33480002
         LCLA  &OP                                                      33540002
&NAME    BC    15,BINDER                                                33600002
.LOOP    ANOP                                                           33660002
&OP      SETA  &OP+1                                                    33720002
         DC    AL.16(&SYSLIST(&OP,1)-&DSECT)                            33780002
         DC    FL1'&SYSLIST(&OP,2)'                                     33840002
         DC    FL1'&SYSLIST(&OP,3)'                                     33900002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 33960002
         ORG   &NAME+4                                                  34020002
         DC    AL.4(&OP),AL.12(&SYSLIST(1,1)-&DSECT)                    34080002
         ORG                                                            34140002
         MEND                                                           34200002
         MACRO                                                          34260002
&NAME    CKPARITY  &PAR1,&PAR2,&PAR3,&PAR4,&PAR5,&PAR6                  34320002
.*                                THIS MACRO HELPS SET THE LOCATION     34380002
.*                                CONTROLS FOR A SPECIAL ROUTINE TO     34440002
.*                                CHECK PARITY ON ITEMS FROM THE LOG    34500002
.*                                ALREADY ASSEMBLED FOR PRINTING IN THE 34560002
.*                                PRINT BUFFER THAT HAS BEEN SET UP.    34620002
.*                                EACH OPERAND (UP TO SIX) HAS THREE    34680002
.*                                SUBFIELDS:1 GIVES THE DISPLACEMENT    34740002
.*                                FROM PRINT POSITION ZERO TO BEGIN     34800002
.*                                THE PARITY CHECK(I.E.,LOC. OF PARITY  34860002
.*                                BIT IN BUFFER);2 GIVES THE NUMBER OF  34920002
.*                                POSITIONS TO CHECK AGAINST THE PARITY 34980002
.*                                BIT (ASSUMING 1 SPACE BETWEEN PAR BIT 35040002
.*                                AND THE FIRST POSITION TO BE CHECKED) 35100002
.*                                3 GIVES THE NUMBER OF SEQUENTIAL PAR. 35160002
.*                                CHECKS OF THIS SORT TO MAKE,ASSUMING  35220002
.*                                TWO SPACES BETWEEN THE LAST POSITION  35280002
.*                                CHECKED AND NEXT PAR. BIT POSITION    35340002
         LCLA  &OP                                                      35400002
&NAME    BC    15,PARPUT                                                35460002
         DC    X'0'                                                     35520002
.LOOP    ANOP                                                           35580002
&OP      SETA  &OP+1                                                    35640002
         DC    FL1'&SYSLIST(&OP,1)'                                     35700002
         DC    FL1'&SYSLIST(&OP,2)'                                     35760002
         DC    FL1'&SYSLIST(&OP,3)'                                     35820002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 35880002
         ORG   &NAME+4                                                  35940002
         DC    FL1'&OP'                                                 36000002
         ORG                                                            36060002
         MEND                                                           36120002
         MACRO                                                          36180002
         LINEND                                                         36240002
.*                                 THIS MACRO IS USED ONLY BY THE LINE  36300002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   36360002
.*                                 ASSOCIATED WITH EACH LINE.           36420002
         GBLA  &NRENTS                                                  36480002
         GBLC  &NRENTSX                                                 36540002
         ORG   &NRENTSX                                                 36600002
         DC    FL1'&NRENTS'                                             36660002
         ORG                                                            36720002
&NRENTS  SETA  0                                                        36780002
B&SYSNDX EQU   *                                                        36840002
&NRENTSX SETC  'B&SYSNDX'                                               36900002
         MEND                                                           36960002
         MACRO                                                          37020002
&NAME    ROUTINE &LOGITEM,&RNAME                                        37080002
         GBLA  &NRENTS                                                  37140002
         GBLC  &DSECT,&CSECT                                            37200002
         GBLA  &INITIAL                                                 37260002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               37320002
         AIF   (&DIAGTST EQ 0).NOMSG                                    37380002
         AIF   (&INITIAL EQ 0).NOMSG                                    37440002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    37500002
         MNOTE '**NO LINE ASSOCIATED WITH THIS ROUTINE**'               37560002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     37620002
*        LINE                                                           37680002
         LINE                                                           37740002
.NOMSG   ANOP                                                           37800002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           37860002
         DC    AL2(&RNAME-&CSECT)                                       37920002
&NRENTS  SETA  &NRENTS+1                                                37980002
         MEND                                                           38040002
         GBLC  &DSECT,&CSECT                                            38100002
IFCE0155 CSECT                                                          38160002
&CSECT   SETC  'IFCE0155'                                               38220002
&DSECT   SETC  'DSECT155'                                               38280002
DSECT155 DSECT                                                          38340002
         DS    0F                                                       38400002
         DSGEN (XKEY,8),(XRELN,8),(XSWS0,8),(XSWS8,1),(XSWS9,1),       C38460002
               (XSWS10,1),(ERRORID,1),                                 X38520002
               (XSWS12,1),(XSWS13,1),(XSWS14,1),(XSWS15,1)              38580002
         DSGEN (,8),(LOGWORK2,6),(LOGWORK3,2),(LOGWRK3A,4),            X38640002
               (LOGWRK3B,3),(LOGWRK3C,1),(LOGWORK4,8)                   38700002
         DSGEN (XDATE,32)                                               38760002
         DSGEN (XTIME,32)                                               38820002
         DSGEN (XDUM2,8),(XSER,24)                                      38880002
         DSGEN (XCPUMOD,16),(XDUM3,16)                                  38940002
         DSGEN (XPGMID,64)                                              39000002
         ORG   XPGMID                                          @YL02021 39020002
         DSGEN (RECLNT,32),(WAITST,32)                         @YL02021 39040002
         DSGEN (XJOBID,64)                                              39060002
         DSGEN (XMCKPSW,64)                                             39120002
         DSGEN (SYSDAM,1),(PROCD,1),(SYSREC,1),(TIMDAM,1),(CLOCKD,1),  X39180002
               (EXTDAM,1),(MDUM0,1),(AUTOCON,1),(WARNG,1),             X39240002
               (DUM,5),(BACKUP1,1),(DELAY,1),(UNSTOR,1),               *39300002
               (CORRST,1),(KEYERR,1),(DUMMY001,1),(EMWP,1),            *39360002
               (SYSMSK,1),(PGMSK,1),(IAVLD,1),(FASTVLD,1),             X39420002
               (RCVLD,1),(MDUM3,1),(FLPVLD,1),(GPRVLD,1),              X39480002
               (CTLVLD,1),(LOGVLD,1),(STVLD,1)                          39540002
         DSGEN (LRBNVLD,1),(RESERVDA,15),(EXTDLOG,16)          @ZA24225 39600062
         DSGEN (RESRVDB,64)                                             39660002
         DSGEN (MDUM4,8),(FAILSTA,24)                                   39720002
         DSGEN (RGNCODE,32)                                             39780002
         DSGEN (DUMMY1,32)                                              39840002
         DSGEN (MCAR,32)                                                39900002
         DSGEN (MCDR1,32)                                               39960002
         DSGEN (MCDR2,32)                                               40020002
         DSGEN (MANTLTH1,32)                                            40080002
         DSGEN (MANTLTH2,32)                                            40140002
         DSGEN (MCRR1,32)                                               40200002
         DSGEN (MCRR2,32)                                               40260002
         DSGEN (ICM90,32)                                               40320002
         DSGEN (STATUS,32)                                              40380002
         DSGEN (FDUM1,32)                                               40440002
         DSGEN (FDUM2,32)                                               40500002
         DSGEN (FDUM3,32)                                               40560002
         DSGEN (FDUM4,32)                                               40620002
         DSGEN (FDUM5,32)                                               40680002
         DSGEN (FDUM6,32)                                               40740002
         DSGEN (FDUM7,32)                                               40800002
         DSGEN (FDUM8,32)                                               40860002
         DSGEN (FDUM9,32)                                               40920002
         DSGEN (FDUM10,32)                                              40980002
         DSGEN (FDUM11,32)                                              41040002
         DSGEN (FDUM12,32)                                              41100002
         DSGEN (FDUM13,32)                                              41160002
         DSGEN (FDUM14,32)                                              41220002
FLOATPTS DSGEN (FP0,32)                                                 41280002
         DSGEN (FP1,32)                                                 41340002
         DSGEN (FP2,32)                                                 41400002
         DSGEN (FP3,32)                                                 41460002
         DSGEN (FP4,32)                                                 41520002
         DSGEN (FP5,32)                                                 41580002
         DSGEN (FP6,32)                                                 41640002
         DSGEN (FP7,32)                                                 41700002
GENPURPR DSGEN (GPR0,32)                                                41760002
         DSGEN (GPR1,32)                                                41820002
         DSGEN (GPR2,32)                                                41880002
         DSGEN (GPR3,32)                                                41940002
         DSGEN (GPR4,32)                                                42000002
         DSGEN (GPR5,32)                                                42060002
         DSGEN (GPR6,32)                                                42120002
         DSGEN (GPR7,32)                                                42180002
         DSGEN (GPR8,32)                                                42240002
         DSGEN (GPR9,32)                                                42300002
         DSGEN (GP10,32)                                                42360002
         DSGEN (GP11,32)                                                42420002
         DSGEN (GP12,32)                                                42480002
         DSGEN (GP13,32)                                                42540002
         DSGEN (GP14,32)                                                42600002
         DSGEN (GP15,32)                                                42660002
         DSGEN (CTR0,32)                                                42720002
         DSGEN (CTR1,32)                                                42780002
         DSGEN (CTR2,32)                                                42840002
         DSGEN (CTR3,32)                                                42900002
         DSGEN (CTR4,32)                                                42960002
         DSGEN (CTR5,32)                                                43020002
         DSGEN (CTR6,32)                                                43080002
         DSGEN (CTR7,32)                                                43140002
         DSGEN (CTR8,32)                                                43200002
         DSGEN (CTR9,32)                                                43260002
         DSGEN (CR10,32)                                                43320002
         DSGEN (CR11,32)                                                43380002
         DSGEN (CR12,32)                                                43440002
         DSGEN (CR13,32)                                                43500002
         DSGEN (CR14,32)                                                43560002
         DSGEN (CR15,32)                                                43620002
         DSGEN (XBUS0,8),(XBUS1,8),(XBUS2,8),(XBUS3,8)                  43680002
         DSGEN (YBUS0,8),(YBUS1,8),(YBUS2,8),(YBUS3,8)                  43740002
         DSGEN (ZBUS0,8),(ZBUS1,8),(ZBUS2,8),(ZBUS3,8)                  43800002
         DSGEN (UBUS,8),(VBUS,8),(WBUS,8),(FILREG,8)                    43860002
         DSGEN (STLNK,1),(RABUSRP,1),(RABUSBI,1),(RABUS1P,1),          *43920002
               (RABUS1,4),(RABUS3,8),(BFRBUSY,1),(RBAR1RP,1),          *43980002
               (RBAR1BI,1),(RBAR11P,1),(RBAR11,4),(RBAR13,8)            44040002
         DSGEN (LSSSTS,2),(CPURLAR,6),(WRCPULS,1),(DUMMY000,1),        *44100002
               (CPUWLAR,6),(DUMMY002,1),(DUMMY003,1),(IORLAR,6),       *44160002
               (WRIOLS,1),(DUMMY004,1),(IOWLAR,6)                       44220002
         DSGEN (EXTSW0,8),(EXTSW1,8),(EXTSW2,8),(EXTSW3,8)              44280002
         DSGEN (SPARE030,8),(SPARE031,8),(SPARE032,8),(SPARE033,8)      44340002
         DSGEN (AREG0,8),(AREG1,8),(AREG2,8),(AREG3,8)                  44400002
         DSGEN (BREG0,8),(BREG1,8),(BREG2,8),(BREG3,8)                  44460002
         DSGEN (CREG0,8),(CREG1,8),(CREG2,8),(CREG3,8)                  44520002
         DSGEN (DREG0,8),(DREG1,8),(DREG2,8),(DREG3,8)                  44580002
         DSGEN (IOLSD0,8),(IOLSD1,8),(IOLSD2,8),(IOLSD3,8)              44640002
         DSGEN (CPULS0,8),(CPULS1,8),(CPULS2,8),(CPULS3,8)              44700002
         DSGEN (IOSAR0,8),(IOSAR1,8),(IOSAR2,8),(IOSAR3,8)              44760002
         DSGEN (CPUSR0,8),(CPUSR1,8),(CPUSR2,8),(CPUSR3,8)              44820002
         DSGEN (SPARE034,8),(IAR1,8),(IAR2,8),(IAR3,8)                  44880002
         DSGEN (PSWSM,8),(PSWKEY,8),(PSWESM,8),(SPARE035,8)             44940002
         DSGEN (RBAR2IO,1),(RBAR2RP,1),(RBAR2BI,1),(RBAR21P,1),        *45000002
               (RBAR21,4),(RBAR23,8),(RBAR3IO,1),(RBAR3RP,1),          *45060002
               (RBAR3BI,1),(RBAR31P,1),(RBAR31,4),(RBAR33,8)            45120002
         DSGEN (BS0,4),(BS4P,1),(BS4,3),(ABCTRP,1),                    *45180002
               (ABCTR,3),(CBCTRP,1),(CBCTR,3),(IFTHRS,1),              *45240002
               (IFRES,1),(IFINV,1),(IFPRTC,1),(IFIC,1),                *45300002
               (IFEXS,1),(IFILC,2),(ALUFNR,4),                         *45360002
               (QBIT,1),(CCST,1),(CSA,1),(CSB,1)                        45420002
         DSGEN (L12CTR,8),(L2SS,1),(CC,2),                             *45480002
               (FNBR,2),(ALWTRP,1),(DUMMY006,1),(NSSMD,1),             *45540002
               (R12CTR,8),(INABRR,3),(INBBRR,4),(HYRST,1)               45600002
         DSGEN (SRADAD1,7),(HRDCHK,1),(SERADM,1),(INTDL,1),            *45660002
               (WAITFR,1),(ENGHEAD,1),(INPERR,1),(CLKERR,1),           *45720002
               (ABCOMPS,1),(LOGCMPS,1),(DIAGCTR,8),(SPRWL036,7),       X45780002
               (R5136,1)                                                45840002
         DSGEN (DUMMY007,1),(DUMMY008,1),(INDDISP,1),(CPURA1P,1),      *45900002
               (CPURA1,4),(CPURA3,8),(GPSTL1,4),(GPSTL2P,1),           *45960002
               (GPSTL2,3),(S19,1),(EXTST,1),(ANYEXC,1),                *46020002
               (ICPLUS4,1),(IC1B29,1),(IB0FULL,3)                       46080002
         DSGEN (SPARE037,8),(SPARE038,8),(SPARE039,8),(SPARE040,8)      46140002
         DSGEN (XBUSE,4),(YBUSE,4),(CARRYE,8),(HSUME,4),(ZBUSE,4),     *46200002
               (LSREGE,4),(CISARE,4)                                    46260002
         DSGEN (GPSTE,2),(LCTRE,1),(RCTRE,1),                          *46320002
               (DUMMY009,1),(DUMMY010,1),(ABE,1),(CBE,1),              *46380002
               (PSW0E,1),(PSW1E,1),(PSW2E,1),(PSW3E,1),                *46440002
               (WBUSE,1),(ABCTRE,1),(CBCTRE,1),(MEME,1),               *46500002
               (EXTSWE,4),(EESW0E,1),(HOFFE,1),(ABDLYE,1),(EESW3E,1),  *46560002
               (CLSARE,1),(CH02E,1),(CH35E,1),(MVRHSE,1),              *46620002
               (DUMMY013,1),(MVRFNE,1),(ICE,2)                          46680002
         DSGEN (ERLYRE,3),(RSYNCE,1),                                  *46740002
               (LATER0E,1),(LATER1E,1),(LATER2E,1),(LATER3E,1),        *46800002
               (MISDECE,1),(SSDECE,1),(CNTDECE,1),(BBRE,1),            *46860002
               (RADRE,1),(ZDECE,1),(CRUCWLS,1),(TMKE,1),               *46920002
               (SPARE041,8),(SPARE042,8)                                46980002
         DSGEN (CP1R0,4),(CP1R1P,1),(CP1R1,3),(CP2R0P,1),              *47040002
               (CP2NC,1),(CP2SE,1),(CP2DE,1),(CP2IE,1),                *47100002
               (CP2R1P,1),(CP2HC,1),(CP2AC,1),(CP2R3,1),               *47160002
               (ERRCTR,4),(IGNORE1,1),(SERDIS,1),(ENDATA,1),           *47220002
               (SDC,1),(DUMMY015,1),(HARDST,1),(ADRCPST,1),            *47280002
               (DUMMY016,1),(DUMMY017,1),(DUMMY018,1),(DUMMY019,1)      47340002
         DSGEN (ABI1,1),(NXA1,3),(NXB1,4),(BRC11,1),                   *47400002
               (ABR1,5),(BBR01,2),(BBR21,2),(IOPR,2),                  *47460002
               (IOSSB,3),(XYALU01,1),(XYALU21,2),(UX1,3),              *47520002
               (VY1,3)                                                  47580002
         DSGEN (LRSP,1),(LSWR,4),(LSRD,3),(MISC21,2),                  *47640002
               (CNT1,4),(Z01,2),(Z21,1),(ZW1,4),                       *47700002
               (XYSH1,3),(EMIT1,5),(EMIT2,3)                            47760002
         DSGEN (SPARE043,8),(SPARE044,8),(SPARE045,8),(SPARE046,8)      47820002
         DSGEN (SPARE047,8),(SPARE048,8),(SPARE049,8),(SPARE050,8)      47880002
         DSGEN (C0IOSF,2),(C0SVCO,1),(C0ADRO,1),                       *47940002
               (C0HLDO,1),(DUMMY020,1),(C0CMDO,1),(C0SUPO,1),          *48000002
               (C0IOSC,4),(C0IOSD,4),(C0IOSA,4),(C0IOSB,4),            *48060002
               (C0IOSE,2),(C0OPLO,1),(DUMMY021,1),                     *48120002
               (C0DATAO,1),(DUMMY022,1),(DUMMY023,1),(DUMMY024,1)       48180002
         DSGEN (DUMMY025,1),(DUMMY026,1),(C0RAR2,1),(C0RAR0P,1),       *48240002
               (C0RAR1,4),(C0RAR3,8),(DUMMY027,1),(DUMMY028,1),        *48300002
               (DUMMY029,1),(DUMMY030,1),(C0SRVI,1),(C0ADRI,1),        *48360002
               (C0SELI,1),(DUMMY031,1),(C0STAI,1),(C0REQI,1),          *48420002
               (C0OPLI,1),(DUMMY032,1),(C0DISCI,1),(DUMMY033,1),       *48480002
               (DUMMY034,1),(C0MRKI,1)                                  48540002
         DSGEN (C0DABP,1),(C0DAB,4),(C0RP,1),(C0IOI,1),                *48600002
               (C0IFCK,1),(DUMMY035,1),(C0CV,1),(DUMMY036,1),          *48660002
               (C0CB5,1),(C0CB6,1),(C0CB7,1),(C0REQIT,1),              *48720002
               (C0ERRIT,1),(DUMMY037,1),(C0INT,1),(C0ONSYS,1),         *48780002
               (DUMMY038,1),(C0LWLUP,1),(C0LWLBU,1),(DUMMY039,1),      *48840002
               (DUMMY040,1),(SPARE051,8)                                48900002
         DSGEN (SPARE052,8),(SPARE053,8),(SPARE054,8),(SPARE055,8)      48960002
         DSGEN (C1IOSF,2),(C1SVCO,1),(C1ADRO,1),                       *49020002
               (C1HLDO,1),(DUMMY041,1),(C1CMDO,1),(C1SUPO,1),          *49080002
               (C1IOSC,4),(C1IOSD,4),(C1IOSA,4),(C1IOSB,4),            *49140002
               (C1IOSE,2),(C1OPLO,1),(DUMMY042,1),                     *49200002
               (C1DATAO,1),(DUMMY043,1),(DUMMY044,1),(DUMMY045,1)       49260002
         DSGEN (DUMMY046,1),(DUMMY047,1),(C1RAR2,1),(C1RAR0P,1),       *49320002
               (C1RAR1,4),(C1RAR3,8),(DUMMY048,1),(DUMMY049,1),        *49380002
               (DUMMY050,1),(DUMMY051,1),(C1SRVI,1),(C1ADRI,1),        *49440002
               (C1SELI,1),(DUMMY052,1),(C1STAI,1),(C1REQI,1),          *49500002
               (C1OPLI,1),(DUMMY053,1),(C1DISCI,1),(DUMMY054,1),       *49560002
               (DUMMY055,1),(C1MRKI,1)                                  49620002
         DSGEN (C1DABP,1),(C1DAB,4),(C1RP,1),(C1IOI,1),                *49680002
               (C1IFCK,1),(DUMMY056,1),(C1CV,1),(DUMMY057,1),          *49740002
               (C1CB5,1),(C1CB6,1),(C1CB7,1),(C1REQIT,1),              *49800002
               (C1ERRIT,1),(DUMMY058,1),(C1INT,1),(C1ONSYS,1),         *49860002
               (DUMMY059,1),(C1LWLUP,1),(C1LWLBU,1),(DUMMY060,1),      *49920002
               (DUMMY061,1),(SPARE056,8)                                49980002
         DSGEN (C1SCTR,4),(C1HCTR0,5),(C1SUPC,3),(C1LWC0,5),           *50040002
               (C1ERB,5),(DUMMY062,1),(DUMMY063,1),(SPARE057,8)         50100002
         DSGEN (C2IOSF,2),(C2SVCO,1),(C2ADRO,1),                       *50160002
               (C2HLDO,1),(DUMMY064,1),(C2CMDO,1),(C2SUPO,1),          *50220002
               (C2IOSC,4),(C2IOSD,4),(C2IOSA,4),(C2IOSB,4),            *50280002
               (C2IOSE,2),(C2OPLO,1),(DUMMY065,1),                     *50340002
               (C2DATAO,1),(DUMMY066,1),(DUMMY067,1),(DUMMY068,1)       50400002
         DSGEN (DUMMY069,1),(DUMMY070,1),(C2RAR2,1),(C2RAR0P,1),       *50460002
               (C2RAR1,4),(C2RAR3,8),(DUMMY071,1),(DUMMY072,1),        *50520002
               (DUMMY073,1),(DUMMY074,1),(C2SRVI,1),(C2ADRI,1),        *50580002
               (C2SELI,1),(DUMMY075,1),(C2STAI,1),(C2REQI,1),          *50640002
               (C2OPLI,1),(DUMMY076,1),(C2DISCI,1),(DUMMY077,1),       *50700002
               (DUMMY078,1),(C2MRKI,1)                                  50760002
         DSGEN (C2DABP,1),(C2DAB,4),(C2RP,1),(C2IOI,1),                *50820002
               (C2IFCK,1),(DUMMY079,1),(C2CV,1),(DUMMY080,1),          *50880002
               (C2CB5,1),(C2CB6,1),(C2CB7,1),(C2REQIT,1),              *50940002
               (C2ERRIT,1),(DUMMY081,1),(C2INT,1),(C2ONSYS,1),         *51000002
               (DUMMY082,1),(C2LWLUP,1),(C2LWLBU,1),(DUMMY083,1),      *51060002
               (DUMMY084,1),(SPARE058,8)                                51120002
         DSGEN (C2SCTR,4),(C2HCTR0,5),(C2SUPC,3),(C2LWC0,5),           *51180002
               (C2ERB,5),(DUMMY085,1),(DUMMY086,1),(SPARE059,8)         51240002
         DSGEN (C3IOSF,2),(C3SVCO,1),(C3ADRO,1),                       *51300002
               (C3HLDO,1),(DUMMY087,1),(C3CMDO,1),(C3SUPO,1),          *51360002
               (C3IOSC,4),(C3IOSD,4),(C3IOSA,4),(C3IOSB,4),            *51420002
               (C3IOSE,2),(C3OPLO,1),(DUMMY088,1),                     *51480002
               (C3DATAO,1),(DUMMY089,1),(DUMMY090,1),(DUMMY091,1)       51540002
         DSGEN (DUMMY092,1),(DUMMY093,1),(C3RAR2,1),(C3RAR0P,1),       *51600002
               (C3RAR1,4),(C3RAR3,8),(DUMMY094,1),(DUMMY095,1),        *51660002
               (DUMMY096,1),(DUMMY097,1),(C3SRVI,1),(C3ADRI,1),        *51720002
               (C3SELI,1),(DUMMY098,1),(C3STAI,1),(C3REQI,1),          *51780002
               (C3OPLI,1),(DUMMY099,1),(C3DISCI,1),(DUMMY100,1),       *51840002
               (DUMMY101,1),(C3MRKI,1)                                  51900002
         DSGEN (C3DABP,1),(C3DAB,4),(C3RP,1),(C3IOI,1),                *51960002
               (C3IFCK,1),(DUMMY102,1),(C3CV,1),(DUMMY103,1),          *52020002
               (C3CB5,1),(C3CB6,1),(C3CB7,1),(C3REQIT,1),              *52080002
               (C3ERRIT,1),(DUMMY104,1),(C3INT,1),(C3ONSYS,1),         *52140002
               (DUMMY105,1),(C3LWLUP,1),(C3LWLBU,1),(DUMMY106,1),      *52200002
               (DUMMY107,1),(SPARE060,8)                                52260002
         DSGEN (C3SCTR,4),(C3HCTR0,5),(C3SUPC,3),(C3LWC0,5),           *52320002
               (C3ERB,5),(DUMMY108,1),(DUMMY109,1),(SPARE061,8)         52380002
         DSGEN (C4IOSF,2),(C4SVCO,1),(C4ADRO,1),                       *52440002
               (C4HLDO,1),(DUMMY110,1),(C4CMDO,1),(C4SUPO,1),          *52500002
               (C4IOSC,4),(C4IOSD,4),(C4IOSA,4),(C4IOSB,4),            *52560002
               (C4IOSE,2),(C4OPLO,1),(DUMMY111,1),                     *52620002
               (C4DATAO,1),(DUMMY112,1),(DUMMY113,1),(DUMMY114,1)       52680002
         DSGEN (DUMMY115,1),(DUMMY116,1),(C4RAR2,1),(C4RAR0P,1),       *52740002
               (C4RAR1,4),(C4RAR3,8),(DUMMY117,1),(DUMMY118,1),        *52800002
               (DUMMY119,1),(DUMMY120,1),(C4SRVI,1),(C4ADRI,1),        *52860002
               (C4SELI,1),(DUMMY121,1),(C4STAI,1),(C4REQI,1),          *52920002
               (C4OPLI,1),(DUMMY122,1),(C4DISCI,1),(DUMMY123,1),       *52980002
               (DUMMY124,1),(C4MRKI,1)                                  53040002
         DSGEN (C4DABP,1),(C4DAB,4),(C4RP,1),(C4IOI,1),                *53100002
               (C4IFCK,1),(DUMMY125,1),(C4CV,1),(DUMMY126,1),          *53160002
               (C4CB5,1),(C4CB6,1),(C4CB7,1),(C4REQIT,1),              *53220002
               (C4ERRIT,1),(DUMMY127,1),(C4INT,1),(C4ONSYS,1),         *53280002
               (DUMMY128,1),(C4LWLUP,1),(C4LWLBU,1),(DUMMY129,1),      *53340002
               (DUMMY130,1),(SPARE062,8)                                53400002
         DSGEN (C4SCTR,4),(C4HCTR0,5),(C4SUPC,3),(C4LWC0,5),           *53460002
               (C4ERB,5),(DUMMY131,1),(DUMMY132,1),(SPARE063,8)         53520002
         DSGEN (C5IOSF,2),(C5SVCO,1),(C5ADRO,1),                       *53580002
               (C5HLDO,1),(DUMMY133,1),(C5CMDO,1),(C5SUPO,1),          *53640002
               (C5IOSC,4),(C5IOSD,4),(C5IOSA,4),(C5IOSB,4),            *53700002
               (C5IOSE,2),(C5OPLO,1),(DUMMY134,1),                     *53760002
               (C5DATAO,1),(DUMMY135,1),(DUMMY136,1),(DUMMY137,1)       53820002
         DSGEN (DUMMY138,1),(DUMMY139,1),(C5RAR2,1),(C5RAR0P,1),       *53880002
               (C5RAR1,4),(C5RAR3,8),(DUMMY140,1),(DUMMY141,1),        *53940002
               (DUMMY142,1),(DUMMY143,1),(C5SRVI,1),(C5ADRI,1),        *54000002
               (C5SELI,1),(DUMMY144,1),(C5STAI,1),(C5REQI,1),          *54060002
               (C5OPLI,1),(DUMMY145,1),(C5DISCI,1),(DUMMY146,1),       *54120002
               (DUMMY147,1),(C5MRKI,1)                                  54180002
         DSGEN (C5DABP,1),(C5DAB,4),(C5RP,1),(C5IOI,1),                *54240002
               (C5IFCK,1),(DUMMY148,1),(C5CV,1),(DUMMY149,1),          *54300002
               (C5CB5,1),(C5CB6,1),(C5CB7,1),(C5REQIT,1),              *54360002
               (C5ERRIT,1),(DUMMY150,1),(C5INT,1),(C5ONSYS,1),         *54420002
               (DUMMY151,1),(C5LWLUP,1),(C5LWLBU,1),(DUMMY152,1),      *54480002
               (DUMMY153,1),(SPARE064,8)                                54540002
         DSGEN (C5SCTR,4),(C5HCTR0,5),(C5SUPC,3),(C5LWC0,5),           *54600002
               (C5ERB,5),(DUMMY154,1),(DUMMY155,1),(SPARE065,8)         54660002
         DSGEN (C0RCV,1),(DUMMY156,1),(DUMMY157,1),(DUMMY158,1),       *54720002
               (DUMMY159,1),(DUMMY160,1),(DUMMY161,1),(DUMMY162,1),    *54780002
               (DUMMY163,1),(DUMMY164,1),(DUMMY165,1),(DUMMY166,1),    *54840002
               (DUMMY167,1),(DUMMY168,1),(C0ARMRR,1),(C0HSUPO,1),      *54900002
               (C0BIREG,4),(C0BIREQ,1),(C0IDLE,1),(C0SELU,1),          *54960002
               (C0IFRR,1),(C0PR3C0,1),(C0IOS0C,1),(C0IOS4C,1),         *55020002
               (C0HLDOC,1),(C0HADRO,1),(C0HCMDO,1),(C0HHLDO,1),        *55080002
               (C0HSELO,1)                                              55140002
         DSGEN (C1CC,1),(C1SLI,1),(C1UAR,1),(C1AO,1),                  *55200002
               (C1SO,1),(C1CCSO,1),(C1HSUPO,1),(C1BP3RQ,1),            *55260002
               (C1P1REQ,1),(C1HRI0,1),(C1HRI4,1),(C1HRSO,1),           *55320002
               (C1HRCO,1),(DUMMY169,1),(C1DABTD,1),(C1DAB1D,1),        *55380002
               (C1SIFRW,1),(C11RDCD,1),(C1LIOLS,1),(C1LBIB,1),         *55440002
               (C1ERDLD,1),(C1ERBU,1),(C1MSELU,1),(C1BLSR,1),          *55500002
               (C1LSPMD,1),(C1LSR2,1),(C1LSR4,1),(C1IFR2,1),           *55560002
               (C1IFR4,1),(C1MHCO,1),(C1HCC,1),(C1RCV,1)                55620002
         DSGEN (C2CC,1),(C2SLI,1),(C2UAR,1),(C2AO,1),                  *55680002
               (C2SO,1),(C2CCSO,1),(C2HSUPO,1),(C2BP3RQ,1),            *55740002
               (C2P1REQ,1),(C2HRI0,1),(C2HRI4,1),(C2HRSO,1),           *55800002
               (C2HRCO,1),(DUMMY170,1),(C2DABTD,1),(C2DAB1D,1),        *55860002
               (C2SIFRW,1),(C21RDCD,1),(C2LIOLS,1),(C2LBIB,1),         *55920002
               (C2ERDLD,1),(C2ERBU,1),(C2MSELU,1),(C2BLSR,1),          *55980002
               (C2LSPMD,1),(C2LSR2,1),(C2LSR4,1),(C2IFR2,1),           *56040002
               (C2IFR4,1),(C2MHCO,1),(C2HCC,1),(C2RCV,1)                56100002
         DSGEN (C3CC,1),(C3SLI,1),(C3UAR,1),(C3AO,1),                  *56160002
               (C3SO,1),(C3CCSO,1),(C3HSUPO,1),(C3BP3RQ,1),            *56220002
               (C3P1REQ,1),(C3HRI0,1),(C3HRI4,1),(C3HRSO,1),           *56280002
               (C3HRCO,1),(DUMMY171,1),(C3DABTD,1),(C3DAB1D,1),        *56340002
               (C3SIFRW,1),(C31RDCD,1),(C3LIOLS,1),(C3LBIB,1),         *56400002
               (C3ERDLD,1),(C3ERBU,1),(C3MSELU,1),(C3BLSR,1),          *56460002
               (C3LSPMD,1),(C3LSR2,1),(C3LSR4,1),(C3IFR2,1),           *56520002
               (C3IFR4,1),(C3MHCO,1),(C3HCC,1),(C3RCV,1)                56580002
         DSGEN (C4CC,1),(C4SLI,1),(C4UAR,1),(C4AO,1),                  *56640002
               (C4SO,1),(C4CCSO,1),(C4HSUPO,1),(C4BP3RQ,1),            *56700002
               (C4P1REQ,1),(C4HRI0,1),(C4HRI4,1),(C4HRSO,1),           *56760002
               (C4HRCO,1),(DUMMY172,1),(C4DABTD,1),(C4DAB1D,1),        *56820002
               (C4SIFRW,1),(C41RDCD,1),(C4LIOLS,1),(C4LBIB,1),         *56880002
               (C4ERDLD,1),(C4ERBU,1),(C4MSELU,1),(C4BLSR,1),          *56940002
               (C4LSPMD,1),(C4LSR2,1),(C4LSR4,1),(C4IFR2,1),           *57000002
               (C4IFR4,1),(C4MHCO,1),(C4HCC,1),(C4RCV,1)                57060002
         DSGEN (C5CC,1),(C5SLI,1),(C5UAR,1),(C5AO,1),                  *57120002
               (C5SO,1),(C5CCSO,1),(C5HSUPO,1),(C5BP3RQ,1),            *57180002
               (C5P1REQ,1),(C5HRI0,1),(C5HRI4,1),(C5HRSO,1),           *57240002
               (C5HRCO,1),(DUMMY173,1),(C5DABTD,1),(C5DAB1D,1),        *57300002
               (C5SIFRW,1),(C51RDCD,1),(C5LIOLS,1),(C5LBIB,1),         *57360002
               (C5ERDLD,1),(C5ERBU,1),(C5MSELU,1),(C5BLSR,1),          *57420002
               (C5LSPMD,1),(C5LSR2,1),(C5LSR4,1),(C5IFR2,1),           *57480002
               (C5IFR4,1),(C5MHCO,1),(C5HCC,1),(C5RCV,1)                57540002
         DSGEN (CCLAR0P,1),(CCLAR0,3),(CCLAR1P,1),(CCLAR1,3),          *57600002
               (CCWRLAR,1),(CCWR,1),(CCWRP,1),(CCWR1XX,1),             *57660002
               (CCWRX1X,1),(CCWRXX1,1),(DUMMY174,1),(DUMMY175,1),      *57720002
               (CCRCK1,1),(CCRCK2,1),(CCRTOBR,1),(CCRWDA,1),           *57780002
               (CCRWDB,1),(CCRWDC,1),(CCRWDD,1),(CCRWDI,1),            *57840002
               (CCTHLD0,1),(CCTHLD1,1),(CCTHLD2,1),(CCTHLD3,1),        *57900002
               (CCBRSTA,1),(CCBRSTB,1),(CCUAPC,1),(CCUAC1,1)            57960002
         DSGEN (CCLWCT,1),(CCDABB2,1),(CCDABB4,1),(CCENDR,1),          *58020002
               (CCDIFC,1),(CCHDWC2,1),(CCHDWC5,1),(CCMVPC,1),          *58080002
               (CCIOBSP,1),(CCIOBS0,4),(CCIOBSF,1),(CCIOBSL,1),        *58140002
               (CCMVPCL,1),(CC4WDX,1),(CCUCWS,1),(CCLWIND,1),          *58200002
               (DUMMY176,1),(DUMMY177,1),(DUMMY178,1),(DUMMY179,1),    *58260002
               (DUMMY180,1),(DUMMY181,1),(DUMMY182,1),(DUMMY183,1),    *58320002
               (DUMMY184,1),(CCBFRLS,1),(CCBFRB,1),(CCRDLS,1),         *58380002
               (CCIBFIB,1)                                              58440002
         DSGEN (CHSELA0,1),(CHSELA1,1),(CHSELA2,1),(CHIOM,1),          *58500002
               (CHROAR,1),(CHNUM0,1),(CHNUM1,1),(CHNUM2,1),            *58560002
               (CHREQC1,1),(CHREQCB,1),(CIOMLTH,1),(IOMB,1),           *58620002
               (C1PR2,1),(C1PR3,1),(C2PR2,1),(C2PR3,1),                *58680002
               (C3PR2,1),(C3PR3,1),(C4PR2,1),(C4PR3,1),                *58740002
               (C5PR2,1),(C5PR3,1),(MPXOS2,1),(DUMMY185,1),            *58800002
               (DUMMY186,1),(DUMMY187,1),(DUMMY188,1),(DUMMY189,1),    *58860002
               (DUMMY190,1),(ANYIR,1),(CHDIAGM,1),(CHFC,1)              58920002
         DSGEN (SNSBYTX,8),(RDYX,1),(SELPGX,1),(XSDSEL,1),(SEQ1X,1),   *58980002
               (SEQ2X,1),(SEQ3X,1),(SEQ4X,1),(SEQ5X,1),(DISCX,1),      *59040002
               (STAPTYX,1),(ATTX,1),(BUSYX,1),(CHENDX,1),(DVENDX,1),   *59100002
               (UNCKX,1),(UNEXCPX,1),(STACKX,1),(WRITX,1),(XREAD,1),   *59160002
               (CTRLX,1),(SCBYX,1),(EOFX,1),(XSPARE,1),(ENCMPX,1)       59220002
         DSGEN (C1HCE,1),(C1BCIE,1),(C1BME,1),(C1IRE,1),               *59280002
               (C1LRE,1),(C1SBE,1),(C1SBOE,1),(C1ISE,1),               *59340002
               (C1SPE,1),(C1SWE,1),(C2HCE,1),(C2BCIE,1),               *59400002
               (C2BME,1),(C2IRE,1),(C2LRE,1),(C2SBE,1),                *59460002
               (C2SBOE,1),(C2ISE,1),(C2SPE,1),(C2SWE,1),               *59520002
               (C3HCE,1),(C3BCIE,1),(C3BME,1),(C3IRE,1),               *59580002
               (C3LRE,1),(C3SBE,1),(C3SBOE,1),(C3ISE,1),               *59640002
               (C3SPE,1),(C3SWE,1),(CCCH1E,1),(CCCH2E,1)                59700002
         DSGEN (C4HCE,1),(C4BCIE,1),(C4BME,1),(C4IRE,1),               *59760002
               (C4LRE,1),(C4SBE,1),(C4SBOE,1),(C4ISE,1),               *59820002
               (C4SPE,1),(C4SWE,1),(C5HCE,1),(C5BCIE,1),               *59880002
               (C5BME,1),(C5IRE,1),(C5LRE,1),(C5SBE,1),                *59940002
               (C5SBOE,1),(C5ISE,1),(C5SPE,1),(C5SWE,1),               *60000002
               (CCCH3E,1),(CCCH4E,1),(CCCH5E,1),(C3CLE,1),             *60060002
               (C3ITE,1),(C4CLE,1),(C4ITE,1),(C5CLE,1),                *60120002
               (C5ITE,1),(C35SCE,1),(C35ITAE,1),(C35ITBE,1)             60180002
         DSGEN (BIRPE,1),(BIRE,1),(C0BCE,1),(C0BOCE,1),                *60240002
               (C0S07E,1),(C0RE,1),(C0UCE,1),(C0CCE,1),                *60300002
               (C0RCE,1),(C0ITE,1),(C0CLE,1),(C1ITE,1),                *60360002
               (C1CLE,1),(C2ITE,1),(C2CLE,1),(UPDE,1),                 *60420002
               (EMITFLE,1),(EMITINE,1),(PSWCKE,1),(L2CNTRE,1),         *60480002
               (CSELCPE,1),(DUMMY191,1),(DUMMY192,1),(DUMMY193,1),     *60540002
               (DUMMY194,1),(DUMMY195,1),(C02ITAE,1),(C02ITBE,1),      *60600002
               (C02STCE,1),(SBPE,1),(OUTTAGE,1),(GRPSELE,1)             60660002
         DSGEN (DUMMY196,1),(DUMMY197,1),(ROSINTE,1),(ROSINPE,1),      *60720002
               (LSTOCHE,1),(HDWCHE,1),(HCIE,1),(HRRE,1),               *60780002
               (HLCE,1),(UPLSARE,1),(WRLSUPE,1),(IN1SELE,1),           *60840002
               (IN2ROSE,1),(IN3SELE,1),(LS01INE,1),(LS23INE,1),        *60900002
               (INTCRDE,1),(LOGYINE,1),(LOGRDRE,1),(DUMMY198,1),       *60960002
               (STBBE,1),(STDCDE,1),(YICDCDE,1),(BUSPTYE,1),           *61020002
               (RLCTRE,1),(DUMMY199,1),(DUMMY200,1),(DUMMY201,1),      *61080002
               (LSUCWAE,1),(BIRESPE,1),(SELCNE,1),(MURE,1)              61140002
         DSGEN (HCIDE,1),(UPCIDE,1),(C0BOPE,1),(C0BIE,1),              *61200002
               (C1BOPE,1),(C1BIE,1),(C2BOPE,1),(C2BIE,1),              *61260002
               (C3BOPE,1),(C3BIE,1),(C4BOPE,1),(C4BIE,1),              *61320002
               (C5BOPE,1),(C5BIE,1),(HCLE,1),(LSRLOGE,1),              *61380002
               (C0WRLSE,1),(C1WRLSE,1),(C2WRLSE,1),(C3WRLSE,1),        *61440002
               (C4WRLSE,1),(C5WRLSE,1),(C01CXE,1),(C23CXE,1),          *61500002
               (C45CXE,1),(MPCIDE,1),(DUMMY202,1),(DUMMY203,1),        *61560002
               (DUMMY204,1),(DUMMY205,1),(DUMMY206,1),(DUMMY207,1)      61620002
         DSGEN (SNSBYTY,8),(RDYY,1),(SELPGY,1),(YSDSEL,1),(SEQ1Y,1),   *61680002
               (SEQ2Y,1),(SEQ3Y,1),(SEQ4Y,1),(SEQ5Y,1),(DISCY,1),      *61740002
               (STAPTYY,1),(ATTY,1),(BUSYY,1),(CHENDY,1),(DVENDY,1),   *61800002
               (UNCKY,1),(UNEXCPY,1),(STACKY,1),(WRITY,1),(YREAD,1),   *61860002
               (CTRLY,1),(SCBYY,1),(EOFY,1),(YSPARE,1),(ENCMPY,1)       61920002
         DSGEN (AIRINE1,4),(AIROE0,4),(ADOE,4),(BSMB1E,2),             X61980002
               (ECCLOE,1),(ECCHIE,1),(SASTORE,1),(SATS,1),             X62040002
               (ECCRD,1),(UCWSEL,1),(IOMODE,1),(DUMMY208,1),           X62100002
               (UCORIO,1),(UCORCPU,1),(ECCBB,8)                         62160002
         DSGEN (CONSDR,8),(CONSECE,1),(CONSTOE,1),(CONSR0E,1),         *62220002
               (CONSR3E,1),(CONSCRL,1),(CONSWR,1),(DUMMY209,1),        *62280002
               (CONSEXC,1),(SPARE074,8),(SPARE075,8)                    62340002
         DSGEN (SPARE076,8),(SPARE077,8),(SPARE078,8),(SPARE079,8)      62400002
         DSGEN (SPARE080,8),(SPARE081,8),(SPARE082,8),(SPARE083,8)      62460002
         DSGEN (FALE0,8),(FALE1,8),(FALE2,8),(FALE3,8)                  62520002
         DSGEN (FALO0,8),(FALO1,8),(FALO2,8),(FALO3,8)                  62580002
         DSGEN (FAHE0,8),(FAHE1,8),(FAHE2,8),(FAHE3,8)                  62640002
         DSGEN (FAHO0,8),(FAHO1,8),(FAHO2,8),(FAHO3,8)                  62700002
         DSGEN (SPARE084,8),(BCUS1,8),(BCUS2,8),(BCUS3,8)               62760002
         DSGEN (SPARE085,8),(ASARB1,8),(ASARB2,8),(ASARB3,8)            62820002
         DSGEN (R540,1,2,9),(R54,1,11,18),(R54,1,20,27),(R54,1,29,36)   62880002
BASIC    DSGEN (EMITE,1,EQU,R5402),(TIMEOE,1,EQU,R5403),               X62940002
               (SPKEYOE,1,EQU,R5404),(KEYBUSE,1,EQU,R5405),            X63000002
               (SAR1E,3,EQU,R5406),(C40B0E,1,EQU,R5409),               X63060002
               (C40B2E,6,EQU,R5411),(IDXLE,1,EQU,R5417),               X63120002
               (IDXUE,1,EQU,R5418),(RDCOMPE,1,EQU,R5420),              X63180002
               (BYTEMKE,1,EQU,R5421),(SDR08E,1,EQU,R5422),             X63240002
               (SDR19E,1,EQU,R5423),(SDR210E,1,EQU,R5424),             X63300002
               (SDR311E,1,EQU,R5425),(SDR412E,1,EQU,R5426),            X63360002
               (SDR513E,1,EQU,R5427),(SDR715E,1,EQU,R5429)              63420002
M9       DSGEN (ER5405,3,EQU,R5405),(ER5411,5,EQU,R5411),              X63480002
               (ER5408,2,EQU,R5408),(R542627,2,EQU,R5426),             X63540002
               (R540507,3,EQU,R5405)                                    63600002
         DSGEN (LINDXA,5),(LINDXB,3),(LINDXV1,1),(LINDXV2,1),          *63660002
               (LINDXOK,1),(LOWERBC,1),(LOWERVC,1),(LOWOKO,1),         *63720002
               (LOWERA,1),(MSSELBR,1),(UINDXA,5),(UINDXB,3),           *63780002
               (UINDXV1,1),(UINDXV2,1),(UINDXOK,1),(UPPERBC,1),        *63840002
               (UPPERVC,1),(UPROKO,1),(UPPERA,1),(BACKSBY,1)            63900002
         DSGEN (BCUB0,4),(BCUB4P,1),(BCUB4,3),(BCUB8P,1),              *63960002
               (BCUB8,4),(BCUB12P,1),(BCUB12,2),(BCUB15,1),            *64020002
               (ADP2SEL,1),(ADP2ECC,1),(ADP2MCK,1),(DUMMY217,1),       *64080002
               (DUMMY218,1),(DUMMY219,1),(IVA,1),(R2529,5),            *64140002
               (R2534,1),(R2535,2)                                      64200002
         DSGEN (BCURD,1),(BCUWR,1),(BCUFIB,1),(BCUSPMS,1),             *64260002
               (BCUIECC,1),(BCUDC40,1),(BCUIOMD,1),(ECCMD1,1),         *64320002
               (EDRDECC,1),(DUMMY220,1),(EDTS,1),(R1514,1),            *64380002
               (R1515,1),(R1516,1),(EDWSPK,1),(R1518,1),               *64440002
               (EDVALA,1),(IBRFCH,1),(DUMMY224,1),(DUMMY225,1),        *64500002
               (EDRSPK,1),(EDDEGA,1),(HISTAT,1),(ODDSTAT,1),           *64560002
               (MSIREAD,1),(MSIWR,1),(DUMMY226,1),(MSITS,1),           *64620002
               (DUMMY227,1),(MSIIOOP,1),(MSIRECC,1),(MSIUCWS,1)         64680002
         DSGEN (AIROFET,1),(AIROSTO,1),(AIROHRT,1),(AIROTS,1),         *64740002
               (DUMMY228,1),(AIROVRD,1),(AIROECD,1),(AIROBS,1),        *64800002
               (SPARE086,8),(MSCAIDL,1),(DUMMY229,1),(DUMMY230,1),     *64860002
               (MSCCIP,1),(MSCWC,1),(MSCDR2C,1),(MSCAD25,1),           *64920002
               (MSCBD25,1),(SPARE087,8)                                 64980002
         DSGEN (CONSR0,8),(CONSR1,8),(CONSR2,8),(CONSR3,8)              65040002
         DSGEN (R1802,1),(R1803,1),(R1804,1),(R1805,1),(R1806,1),      X65100002
               (R1807,1),(R1808,2),(R1811,6),(R1817,2),(R1820,1),      X65160002
               (R1821,1),(R1822,1),(R1823,1),(R1824,1),(R1825,1),      X65220002
               (R1826,10)                                               65280002
         DSGEN (R2802,1),(R2803,1),(R2804,1),(R2805,1),(R2806,1),      X65340002
               (R2807,1),(R2808,1),(R2809,1),(R281A,1),                X65400002
               (R2812,1),(R2813,1),(R2814,1),(R2815,1),(R2816,1),      X65460002
               (R2817,1),(R2818,1),(R2820,1),(R2821,1),(R2822,1),      X65520002
               (R2823,1),(R2824,1),                                    X65580002
               (R2825,3),                                              X65640002
               (R2829,5),(R2834,2),(R2836,1)                            65700002
XQX      DSGEN                       (R2811,13,EQU,R281A),             X65760002
               (R2811R,8,EQU,R281A),(R2820R,8,EQU,R2820),              X65820002
               (R2829R,8,EQU,R2829)                                     65880002
         DSGEN (R3802,1),(R3803,1),(R3804,1),(R3805,1),(R3806,1),      X65940002
               (R3807,1),(R3808,1),(R3809,1),(R3811,1),(R3812,1),      X66000002
               (R3813,1),(R3814,1),(R3815,1),(R3816,1),(R3817,1),      X66060002
               (R3818,1),(R3820,1),(R3821,1),(R3822,1),                X66120002
               (R3823,1),(R3824,1),(R3825,1),(R3826,1),(R3827,1),      X66180002
               (R3829,1),(R3830,1),(R3831,1),(R3832,1),(R3833,1),      X66240002
               (R3834,1),(R3835,1),(R3836,1)                            66300002
         DSGEN (R1702,1),(R1703,1),(R1704,1),(R1705,1),(R1706,1),      X66360002
               (R1707,1),(R1708,1),(R1709,1),(R1711,1),(R1712,1),      X66420002
               (R1713,1),(R1714,1),(R1715,1),(R1716,1),(R1717,1),      X66480002
               (R1718,1),(R1720,1),(R1721,1),(R1722,1),                X66540002
               (R1723,1),(R1724,1),(R1725,1),(R1726,1),(R1727,1),      X66600002
               (R1729,1),(R1730,1),(R1731,1),(R1732,1),(R1733,1),      X66660002
               (R1734,1),(R1735,1),(R1736,1)                            66720002
         DSGEN (R2702,1),(R2703,1),(R2704,1),(R2705,1),(R2706,1),      X66780002
               (R2707,1),(R2708,1),(R2709,1),(R2711,1),(R2712,1),      X66840002
               (R2713,1),(R2714,1),(R2715,1),(R2716,1),(R2717,1),      X66900002
               (R2718,1),(R2720,1),(R2721,1),(R2722,1),                X66960002
               (R2723,1),(R2724,1),(R2725,1),(R2726,1),(R2727,1),      X67020002
               (R2729,1),(R2730,1),(R2731,1),(R2732,1),(R2733,1),      X67080002
               (R2734,1),(R2735,1),(R2736,1)                            67140002
         DSGEN (R1602,1),(R1603,1),(R1604,1),(R1605,1),(R1606,1),      X67200002
               (R1607,1),(R1608,1),(R1609,1),(R1611,1),(R1612,1),      X67260002
               (R1613,1),(R1614,1),(R1615,1),(R1616,1),(R1617,1),      X67320002
               (R1618,1),(R1620,1),(R1621,1),(R1622,1),                X67380002
               (R1623,1),(R1624,1),(R1625,1),(R1626,1),(R1627,1),      X67440002
               (R1629,1),(R1630,1),(R1631,1),(R1632,1),(R1633,1),      X67500002
               (R1634,1),(R1635,1),(R1636,1)                            67560002
         DSGEN (SPARE127,64)                                            67620002
         DSGEN (SPARE128,64)                                            67680002
         DSGEN (SPARE129,64)                                            67740002
         DSGEN (SPARE130,64)                                            67800002
         DSGEN (SPARE131,64)                                            67860002
         DSGEN (SPARE132,64)                                            67920002
         DSGEN (SPARE133,64)                                            67980002
         DSGEN (SPARE134,64)                                            68040002
         DSGEN (SPARE135,64)                                            68100002
         DSGEN (SPARE136,64)                                            68160002
         DSGEN (SPARE137,64)                                            68220002
         DSGEN (SPARE138,64)                                            68280002
         DSGEN (SPARE139,64)                                            68340002
         DSGEN (SPARE140,64)                                            68400002
         DSGEN (SPARE141,64)                                            68460002
         DSGEN (SPARE142,64)                                            68520002
         DSGEN (SPARE143,64)                                            68580002
         DSGEN (XBUS0P,1),(DUMMY231,1),(XBUS1P,1),(DUMMY232,1),        *68640002
               (XBUS2P,1),(DUMMY233,1),(XBUS3P,1),(DUMMY234,1),        *68700002
               (YBUS0P,1),(DUMMY235,1),(YBUS1P,1),(DUMMY236,1),        *68760002
               (YBUS2P,1),(DUMMY237,1),(YBUS3P,1),(DUMMY238,1),        *68820002
               (ZBUS0P,1),(DUMMY239,1),(ZBUS1P,1),(DUMMY240,1),        *68880002
               (ZBUS2P,1),(DUMMY241,1),(ZBUS3P,1),(DUMMY242,1),        *68940002
               (UBUSP,1),(DUMMY243,1),(VBUSP,1),(DUMMY244,1),          *69000002
               (WBUSP,1),(DUMMY245,1),(FILREGP,1),(DUMMY246,1)          69060002
         DSGEN (DUMMY247,1),(DUMMY248,1),(RABUS2,1),(DUMMY249,1),      *69120002
               (HOLDOFF,1),(DUMMY250,1),(RBAR12,1),(DUMMY251,1),       *69180002
               (SPARE088,8),(EXTSW0P,1),(DUMMY252,1),(EXTSW1P,1),      *69240002
               (DUMMY253,1),(EXTSW2P,1),(DUMMY254,1),(EXTSW3P,1),      *69300002
               (DUMMY255,1),(SPARE089,8)                                69360002
         DSGEN (AREG0P,1),(DUMMY256,1),(AREG1P,1),(DUMMY257,1),        *69420002
               (AREG2P,1),(DUMMY258,1),(AREG3P,1),(DUMMY259,1),        *69480002
               (BREG0P,1),(DUMMY260,1),(BREG1P,1),(DUMMY261,1),        *69540002
               (BREG2P,1),(DUMMY262,1),(BREG3P,1),(DUMMY263,1),        *69600002
               (CREG0P,1),(DUMMY264,1),(CREG1P,1),(DUMMY265,1),        *69660002
               (CREG2P,1),(DUMMY266,1),(CREG3P,1),(DUMMY267,1),        *69720002
               (DREG0P,1),(DUMMY268,1),(DREG1P,1),(DUMMY269,1),        *69780002
               (DREG2P,1),(DUMMY270,1),(DREG3P,1),(DUMMY271,1)          69840002
         DSGEN (IOLSD0P,1),(DUMMY272,1),(IOLSD1P,1),(DUMMY273,1),      *69900002
               (IOLSD2P,1),(DUMMY274,1),(IOLSD3P,1),(DUMMY275,1),      *69960002
               (CPULS0P,1),(DUMMY276,1),(CPULS1P,1),(DUMMY277,1),      *70020002
               (CPULS2P,1),(DUMMY278,1),(CPULS3P,1),(DUMMY279,1),      *70080002
               (IOSAR0P,1),(DUMMY280,1),(IOSAR1P,1),(DUMMY281,1),      *70140002
               (IOSAR2P,1),(DUMMY282,1),(IOSAR3P,1),(DUMMY283,1),      *70200002
               (CPUSR0P,1),(DUMMY284,1),(CPUSR1P,1),(DUMMY285,1),      *70260002
               (CPUSR2P,1),(DUMMY286,1),(CPUSR3P,1),(DUMMY287,1)        70320002
         DSGEN (DUMMY288,1),(DUMMY289,1),(IAR1P,1),(DUMMY290,1),       *70380002
               (IAR2P,1),(DUMMY291,1),(IAR3P,1),(DUMMY292,1),          *70440002
               (PSWSMP,1),(DUMMY293,1),(PSWKEYP,1),(DUMMY294,1),       *70500002
               (PSWESMP,1),(DUMMY295,1),(DUMMY296,1),(DUMMY297,1),     *70560002
               (DUMMY298,1),(DUMMY299,1),(RBAR22,1),(DUMMY300,1),      *70620002
               (DUMMY301,1),(DUMMY302,1),(RBAR32,1),(DUMMY303,1),      *70680002
               (BS0P,1),(DUMMY304,1),(BS7,1),(DUMMY305,1),             *70740002
               (IFTCHSP,1),(DUMMY306,1),(ALUFNRP,1),(DUMMY307,1)        70800002
         DSGEN (L12CTRP,1),(DUMMY308,1),(L1SS,1),(DUMMY309,1),         *70860002
               (R12CTRP,1),(DUMMY310,1),(INABRR0,1),(DUMMY311,1),      *70920002
               (SRADAD0,1),(DUMMY312,1),(BLKCONS,1),(DUMMY313,1),      *70980002
               (CTRERR,1),(DUMMY314,1),(DUMMY315,1),(DUMMY316,1),      *71040002
               (DUMMY317,1),(DUMMY318,1),(CPURA2,1),(DUMMY319,1),      *71100002
               (GPSTL1P,1),(DUMMY320,1),(GPSTL3,1),(DUMMY321,1),       *71160002
               (SPARE090,8)                                             71220002
         DSGEN (SPARE091,8),(SPARE092,8),(SPARE093,8),(CP1R0P,1),      *71280002
               (DUMMY322,1),(CP1R2,1),(DUMMY323,1),(CP2R2,1),          *71340002
               (DUMMY324,1),(DUMMY325,1),(DUMMY326,1)                   71400002
         DSGEN (R0P1,1),(DUMMY327,1),(BRC01,1),(DUMMY328,1),           *71460002
               (BBR11,1),(DUMMY329,1),(XYALU11,1),(DUMMY330,1),        *71520002
               (R1P1,1),(DUMMY331,1),(MISC11,1),(DUMMY332,1),          *71580002
               (Z11,1),(DUMMY333,1),(R2P1,1),(DUMMY334,1),             *71640002
               (SPARE094,8),(SPARE095,8)                                71700002
         DSGEN (SPARE096,64)                                            71760002
         DSGEN (SPARE097,64)                                            71820002
         DSGEN (SPARE098,64)                                            71880002
         DSGEN (SPARE099,64)                                            71940002
         DSGEN (SPARE100,64)                                            72000002
         DSGEN (AIRIN1E,1),(DUMMY335,1),(AIRO5E,1),(DUMMY336,1),       *72060002
               (SAFETCH,1),(DUMMY338,1),(BUMPBIT,1),(DUMMY339,1),      X72120002
               (CONSEOB,1),(DUMMY340,1),(CONSL2,1),(DUMMY341,1),       *72180002
               (DUMMY342,1),(DUMMY343,1),(DUMMY344,1),(DUMMY345,1),    *72240002
               (SPARE101,16)                                            72300002
         DSGEN (FALE0P,1),(DUMMY346,1),(FALE1P,1),(DUMMY347,1),        *72360002
               (FALE2P,1),(DUMMY348,1),(FALE3P,1),(DUMMY349,1),        *72420002
               (FALO0P,1),(DUMMY350,1),(FALO1P,1),(DUMMY351,1),        *72480002
               (FALO2P,1),(DUMMY352,1),(FALO3P,1),(DUMMY353,1),        *72540002
               (FAHE0P,1),(DUMMY354,1),(FAHE1P,1),(DUMMY355,1),        *72600002
               (FAHE2P,1),(DUMMY356,1),(FAHE3P,1),(DUMMY357,1),        *72660002
               (FAHO0P,1),(DUMMY358,1),(FAHO1P,1),(DUMMY359,1),        *72720002
               (FAHO2P,1),(DUMMY360,1),(FAHO3P,1),(DUMMY361,1)          72780002
         DSGEN (DUMMY362,1),(DUMMY363,1),(BCUS1P,1),(DUMMY364,1),      *72840002
               (BCUS2P,1),(DUMMY365,1),(BCUS3P,1),(DUMMY366,1),        *72900002
               (DUMMY367,1),(DUMMY368,1),(ASARB1P,1),(DUMMY369,1),     *72960002
               (ASARB2P,1),(DUMMY370,1),(ASARB3P,1),(DUMMY371,1),      *73020002
               (INSNE,1),(DUMMY372,1),(C40B1E,1),(DUMMY373,1),         *73080002
               (INDXCE,1),(DUMMY374,1),(SDR614E,1),(DUMMY375,1),       *73140002
               (LINDXP,1),(DUMMY376,1),(LINDX19,1),(DUMMY377,1),       *73200002
               (UINDXP,1),(DUMMY378,1),(UINDX19,1),(DUMMY379,1)         73260002
         DSGEN (BCUB0P,1),(SPRWL102,1),(BCUB7,1),(SPRWL103,1),         *73320002
               (BCUB14,1),(SPRWL104,1),(SPDATAP,1),(SPRWL105,1),       *73380002
               (BCUM9BY,1),(SPRWL106,1),(EDRECC,1),(SPRWL107,1),       *73440002
               (EDRDC40,1),(SPRWL108,1),(MSIP,1),(SPRWL109,1),         *73500002
               (AIROP,1),(SPRWL110,3),(MSC1024,1),(SPRWL111,1),        *73560002
               (R5528,1),(,1),                                         *73620002
               (CONSR0P,1),(SPRWL112,1),(CONSR1P,1),(SPRWL113,1),      *73680002
               (CONSR2P,1),(SPRWL114,1),(CONSR3P,1),(SPRWL115,1)        73740002
         DSGEN (R1801,1),(,2),(R1810,1),(,1),(R1819,1),(,1),(R1828,1), X73800002
               (R2801,1),(,1),(R2810,1),(,1),(R2819,1),(,1),(R2828,1), X73860002
               (,1),(R3801,1),(,1),(R3810,1),(,1),(R3819,1),(,1),      X73920002
               (R3828,1),(,1),(R1701,1),(,1),(R1710,1),(,1),(R1719,1), X73980002
               (,1),(R1728,1),(,1),(R2701,1),(,1),(R2710,1),(,1),      X74040002
               (R2719,1),(,1),(R2728,1),(,1),(R1601,1),(,1),(R1610,1), X74100002
               (,1),(R1619,1),(,1),(R1628,1),(,1)                       74160002
         DSGEN (SPARE116,16)                                            74220002
         DSGEN (SPARE117,64)                                            74280002
         DSGEN (SPARE118,64)                                            74340002
         DSGEN (SPARE119,64)                                            74400002
         DSGEN (SPARE120,64)                                            74460002
         DSGEN (SPARE121,8),(CPUSER,24)                                 74520002
         DSGEN (DCTRL,1),(SPRWL122,1),(DOSEM,1),(SPRWL123,5),          *74580002
               (UCWCNT,8),(FEATURES,16)                                 74640002
         DSGEN (CUADR1,64)                                              74700002
         DSGEN (CUADR2,64)                                              74760002
         DSGEN (UNPLUG,64)                                              74820002
         DSGEN (DARLNGTH,16),(,48)                                      74880002
         DSGEN (SYSSTAT,1,0,7)                                          74940002
         DSGEN (AREADT,1,0,15)                                          75000002
         DSGEN (ERRTYPE,1,0,7)                                          75060002
         DSGEN (RMSACTN,1,0,7)                                          75120002
         DSGEN (RMSINFO,1,0,7)                                          75180002
         DSGEN (WAITSUFF,8),(,8),(LOSTSUM,48),(,16)                     75240002
         DSGEN (TRNSMOD,32,0,7)                                         75300002
         DSGEN (MCHPDR,1,0,7,0,7)                                       75360002
         DSGEN (FSRADDR,32),(BFSVADDR,32),(EFSVADDR,32),               C75420002
               (INSTADDR,32)                                            75480002
IFCE0155 CSECT                                                          75540002
         USING     *,9                                                  75600002
ENTRYPTR DC    A(STARTER)                                               75660002
TABLNAME DC    CL8'IFCE0155'                                            75720002
REG9     DC    F'0'                                                     75780002
LP       DC    F'0'                                                     75840002
SKIPPER  BR        14                                                   75900002
R0       EQU   0                                                        75960002
R1       EQU   1                                                        76020002
R2       EQU   2                                                        76080002
R3       EQU   3                                                        76140002
R4       EQU   4                                                        76200002
R5       EQU   5                                                        76260002
R6       EQU   6                                                        76320002
R7       EQU   7                                                        76380002
R8       EQU   8                                                        76440002
R9       EQU   9                                                        76500002
R10      EQU   10                                                       76560002
R11      EQU   11                                                       76620002
R12      EQU   12                                                       76680002
         USING DSECT155,R2                                     @YL02021 76740002
R13      EQU   13                                                       76800002
R14      EQU   14                                                       76860002
R15      EQU   15                                                       76920002
HEX00    EQU   X'00'                                                    76980002
HEX08    EQU   X'08'                                                    77040002
HEX40    EQU   X'40'                                                    77100002
HEX80    EQU   X'80'                                                    77160002
HEX48    EQU   X'48'                                                    77220002
HEXBF    EQU   X'BF'                                                    77280002
H13      EQU   X'13'                                           @YL02021 77290002
H01      EQU   X'01'                                           @YL02021 77300002
H20      EQU   X'20'                                           @YL02021 77310002
L0       EQU   0                                                        77340002
L1       EQU   1                                                        77400002
L2       EQU   2                                                        77460002
L3       EQU   3                                                        77520002
L4       EQU   4                                                        77580002
L5       EQU   5                                                        77640002
L6       EQU   6                                                        77700002
L7       EQU   7                                                        77760002
L8       EQU   8                                                        77820002
L12      EQU   12                                                       77880002
L19      EQU   19                                                       77940002
L60      EQU   60                                                       78000002
*                                                                       78060002
ISITVS2  STM   R5,R8,XSAVE             SAVE REGS               @YL02021 78062002
         CLI   XKEY,H13                IS IT VS2               @YL02021 78064002
         BE    SYSTERM                 YES,BRANCH              @YL02021 78066002
         LA    R5,LINE1-4              LINE ADDR. IN 5         @YL02021 78068002
         LA    R6,LAB1-1               LAB ADDR. IN 6          @YL02021 78070002
         ST    R5,REG9                 STORE ADDR.             @YL02021 78072002
         ST    R6,XLABELP              STORE ADDR.             @YL02021 78074002
NOPRINT  SR    R15,R15             ELIM LABEL                  @G17EFFR 78076002
         B     RETURN                                          @YL02021 78078002
SYSTERM  TM    XSWS10,H20              TEST SWITCH             @YL02021 78080002
         BO    RETURN                                          @YL02021 78082002
         SR    R15,R15                 ELIM LABEL              @YL02021 78084002
         B     RETURN                                          @YL02021 78086002
*        ELIMINATE LINE IF NOT MVS                             @ZA24225 78086362
ISITMVS  CLI   XKEY,H13                IS IT MVS               @ZA24225 78086662
         BE    RETURNA                 YES MVS                 @ZA24225 78086962
         SR    R15,R15                 ELIM. LINE              @ZA24225 78087262
RETURNA  BR    R14                                             @ZA24225 78087562
ISVS2    STM   R5,R8,XSAVE             SAVE REGS               @YL02021 78088002
         LA    R5,LINE2-4              LINE IN 5               @YL02021 78090002
         LA    R6,LAB2-1               LABEL IN 6              @YL02021 78092002
         ST    R5,REG9                 STORE REG.              @YL02021 78094002
         ST    R6,XLABELP              STORE REG.              @YL02021 78096002
         SR    R15,R15                 ELIM. LABEL             @YL02021 78098002
         B     RETURN                                          @YL02021 78100002
SETJOBN  MVC   L0(L8,R3),L0(R4)         MOVE JOB NAME                   78120002
         BR    R14                      RETURN                          78180002
*                                                                       78240002
CONVREL  STM   R5,R8,XSAVE              SAVE WORK REGS                  78243002
         SR    R6,R6                    CLEAR R6                        78246002
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        78249002
         SRDL  R6,L5                    SAVE REL NO IN R7               78252002
        SLL   R6,L2                    MULTIPLY SYS VALUE BY 4          78255002
         L     R8,XLABELP               PICK UP LABEL POINTER           78258002
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     78261002
         MVC   L0(L4,R8),L0(R6)         MOVE SYSTEM NAME INTO LABEL     78264002
         SR    R6,R6                    CLEAR R6                        78267002
         SLDL  R6,L5                    RETREIVE REL NO.                78270002
         LTR   R6,R6                    IS IT ZERO                      78273002
         BZ    NOREL                    BR-YES                          78276002
         CVD   R6,WORK                  CONVERT IT                      78279002
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFF       78282002
         MVZ   L1(L1,R3),L0(R3)         MOVE ON PROPER ZONE             78285002
         B     RETURN                   EXIT                            78288002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL            78291002
         B     RETURN                                                   78294002
*                                                                       78297002
SETDATE  UNPK  XWORK(L8),L0(L4,R4)      UNPACK DATE                     78300002
         MVZ   XWORK+L7(L1),XWORK       SET ZONE                        78360002
         MVC   L0(L3,R3),XWORK+L5       MOVE DAY                        78420002
         MVC   L6(L2,R3),XWORK+L3 MOVE YEAR                             78480002
         BR    R14                      RETURN                          78540002
*                                                                       78600002
TSTREC   ST    R5,XSAVE           SAVE REG                              82320002
         TM    0(R4),HEX80              SHORT RECORD           @YA02788 82320702
         BO    NEXTEST                  YES GO TO END IT       @YA02788 82321402
         CLI   21(R2),X'58'             158 ?                   SA64316 82322102
         BNE   NEXTEST                  NO                      SA64316 82322802
         TM    16(R2),X'01'             MODEL II                SA64316 82323502
         BO    NEXTEST                  YES                     SA64316 82324202
         SH    R2,TWO                   BACKSPACE PTR TO RECORD LENGTH  82325062
         CLC   0(L2,R2),HEX3C8          Q/ IS RCD SHORTER THAN X'3C8'   82326062
         BL    FIXR2                    YES                             82327062
         AH    R2,TWO                   RESET PTR                       82328062
         TM    X'3C8'(R2),X'40'         Q/ IS SSR BIT 0 ON              82329062
         BZ    NEXTEST                  NO GO ON               @L03163  82330002
         SH    R2,TWO                   BACK UP 2              @L03163  82335002
         MVC   DUMPCODE+L1(2),0(R2)     MOVE IN LEN TO DUMP    @L03163  82340002
         AH    R2,TWO                   ADD THE TWO BACK       @L03163  82345002
         LA    R5,DUMPCODE-L4           SET PTR TO DUMP        @L03163  82350002
         ST    R5,REG9                  STORE PTR              @L03163  82355002
         B     TSTRECN                  GO ON                  @L03163  82360002
TWO      DC    H'2'                                            @L03163  82365002
HEX3C8   DC    X'03C8'                                                  82366062
FIXR2    AH    R2,TWO                   RESET PTR                       82367062
         B     NEXTEST                                                  82368062
NEXTEST  EQU   *                                               @L03163  82370002
         TM    0(R4),HEX80        TEST SHORT FORM RECORD SWITCH         82380002
         BZ    TSTRECN            BRANCH IF LONG FORM                   82440002
         LA    R5,(DUMPCODE-L4)   ADDRESS OF EDIT/PRINT END             82500002
         ST    R5,REG9            INTO ENTRY POINTER                    82560002
TSTRECN  L     R5,XSAVE           RESTORE REG                           82620002
         SR    R15,R15            DON'T PRINT LAST LINE                 82680002
         BR    R14                RETURN                                82740002
ROUT3    ST    R3,XSAVE           SAVE REG 3                            82800002
         TM    0(R4),HEX80        TEST SHORT FORM RECORD SWITCH         82860002
         BO    ROUT3A             BRANCH IF SHORT FORM                  82920002
         SR    R15,R15            DON'T PRINT LAST LINE                 82980002
ROUT3A   L     R3,XSAVE           RESTORE REG 3                         83040002
         BR    R14                RETURN                                83100002
RETURN   LM    R5,R8,XSAVE         RESTORE WORK REGISTERS               83120002
         BR    R14                 RETURN                               83140002
WHERETO  ST    R5,XSAVE           SAVE REGISTER                         83160002
         CLC   L0(L2,R4),ZERO     IS EXTENDED LOG LENGTH ZERO           83220002
         BNE   CKFET              NO-NOW DETERMINE IF IT IS FET         83280002
         LA    R5,MIDREC-4        SET ADDRESS TO LOAD NEW MODULE        83340002
         ST    R5,REG9                                                  83400002
         B     TSTRECN                                                  83460002
CKFET    CLI   21(R2),X'58'             SEE IF IT IS A FET MEMORY       83520002
         BNE   TSTRECN                  BR NO TO DO REG PROCESSING      83550002
         TM    16(R2),X'03'             M158-3?                @Z02774  83560002
         BO    TSTLD                                           @Z02774  83570002
         TM    16(R2),X'01'             BUT IS IT A PEN MACH            83580002
         BO    TSTRECN                  YES                             83610002
TSTLD    LA    R5,FETLOAD-4             SET POINTER FOR FET LOAD        83640002
         ST    R5,REG9            STORE IN CURRENT LINE PTR             83700002
         B     TSTRECN            GO CLEAN UP                           83760002
HEXCNV   DS    0H                  HEX CONVERSION ROUTINE      @G17EFFR 83763002
         SRDL  R6,12               SHIFT OFF ALL BUT 1ST 4 BITS@G17EFFR 83766002
         LA    R8,3                LOOP CONTROL                @G17EFFR 83769002
SHIFT    SLL   R6,4                SPACE OVER 4 BITS           @G17EFFR 83772002
         SLDL  R6,4                GET NEXT 4 BITS             @G17EFFR 83775002
         BCT   R8,SHIFT            LOOP BACK FOR NEXT          @G17EFFR 83778002
         ST    R6,XWORK            STORE RESULT IN WORK AREA   @G17EFFR 83781002
         NI    XWORK,X'0F'         CLEAR SIGN BITS             @G17EFFR 83784002
         TR    XWORK(4),XLATE      TRANSLATE TO EBCDIC         @G17EFFR 83787002
         BR    R5                  RETURN TO CALLER            @G17EFFR 83790002
XLATE    DC    C'0123456789ABCDEF'                             @G17EFFR 83793002
NOID     TM    0(R4),X'10'         ERRORID PRESENT?            @G17EFFR 83796002
         BNOR  R14                 NO,PRINT MSG                @G17EFFR 83799002
NOPRT    SR    15,15               SKIP MSG                    @G17EFFR 83802002
         BR    R14                 RETURN                      @G17EFFR 83805002
ZERO     DC    XL2'0000'                                                83820002
MILLION  DC    F'1000000'                                               83880002
SIXTY    DC    F'60'                                                    83940002
T24      DC    F'24'                                                    84000002
LPYEAR   DC    F'366'                                                   84060002
RGYEAR   DC    F'365'                                                   84120002
XWORK    DS    D                                                        84180002
XSAVE    DS    5F                                              @G17EFFR 84240002
NONE     DC    CL4'NONE'                                                84244002
RELTAB   DS    0C                                              @L03163  84248002
         DC    C'OS  '                                         @L03163  84252002
         DC    C'DOS '                                         @L03163  84256002
         DC    C'VS 1'                                         @L03163  84260002
         DC    C'V370'                                         @L03163  84264002
         DC    C'VS 2'                                         @L03163  84268002
         DC    C'    '                                         @G17EFFR 84272002
         DC    C'    '                                         @G17EFFR 84272102
         DC    C'    '                                         @G17EFFR 84272202
CHKID    TM    0(R4),X'10'         ERRORID PRESENT?            @G17EFFR 84272302
         BNO   NOPRT               NO,SKIP THIS LINE           @G17EFFR 84272402
         STM   R4,R8,XSAVE         SAVE REGS                   @G17EFFR 84272502
         LR    R5,R2               PTR TO RECORD               @G17EFFR 84272602
         SH    R5,TWO              BACKUP TO RECORD COUNT      @G17EFFR 84272702
         MVC   WRKID(2),0(R5)      RECORD COUNT TO WRKIDAREA   @G17EFFR 84272802
         AH    R5,WRKID            ADD COUNT TO REC PTR        @G17EFFR 84272902
         SH    R5,EIGHT            PT TO ERRORID               @G17EFFR 84273002
         MVC   WRKID+2(10),0(R5)   MOVE ERRORID TO WRKIDAREA   @G17EFFR 84273102
         LA    R5,WRKID+2          PT TO WRKIDAREA             @G17EFFR 84273202
         LA    R4,ERRID            PT TO OUTPUT LABEL          @G17EFFR 84273302
         BAL   R7,CONVERT          CONVERT SEQUENCE NO.        @G17EFFR 84273402
         MVC   SEQOUT(5,R4),XWORK  MOVE TO LABEL               @G17EFFR 84273502
         LH    R6,WRKID+4          GET HEX CPUID               @G17EFFR 84273602
         BAL   R5,HEXCNV           CONVERT HEX TO EBCDIC       @G17EFFR 84273702
         MVC   CPUOUT(4,R4),XWORK  MOVE EBCDIC TO MSG          @G17EFFR 84273802
         LH    R6,WRKID+6          GET HEX ASID                @G17EFFR 84273902
         BAL   R5,HEXCNV           CONVERT HEX TO EBCDIC       @G17EFFR 84274002
         MVC   ASIDOUT(4,R4),XWORK MOVE EBCDIC TO MSG          @G17EFFR 84274102
         L     R6,WRKID+8          PICKUP TENTHS OF SECS       @G17EFFR 84274202
         C     R6,TEN              LESS THAN 10/10             @G17EFFR 84274302
         BL    TENTHS              YES                         @G17EFFR 84274402
         SRDA  R6,32(0)            SHIFT TENTHS TO R7          @G17EFFR 84274502
         D     R6,TEN              DIVIDE TO GET SECS          @G17EFFR 84274602
TENTHS   STC   R6,TSECOUT(R4)      REMAINDER IS TENTHS         @G17EFFR 84274702
         OI    TSECOUT(R4),X'F0'   MAKE IT EBCDIC              @G17EFFR 84274802
         LA    R5,WRKID            PT TO WRKIDAREA             @G17EFFR 84274902
         XC    0(6,R5),0(R5)       CLEAR WRKIDAREA             @G17EFFR 84275002
         LA    R8,2                                            @G17EFFR 84275102
COMP     C     R7,SIXTY            LESS THAN SIXTY             @G17EFFR 84275202
         BL    DONE                YES,WE ARE DONE             @G17EFFR 84275302
         SR    R6,R6               CLEAR REG 6 FOR DIVIDE      @G17EFFR 84275402
         D     R6,SIXTY            DIVIDE FOR SEC,MIN OR HRS   @G17EFFR 84275502
         STH   R6,0(R5)            STORE REMAINDER IN WRKIDAREA@G17EFFR 84275602
         LA    R5,2(R5)            NEXT HALF WORD OF WRKID     @G17EFFR 84275702
         BCT   R8,COMP             PROCESS NEXT TIME INCR      @G17EFFR 84275802
DONE     STH   R7,0(R5)            LAST INCR INTO WRKID        @G17EFFR 84275902
         LA    R5,WRKID            PT TO BEGIN OF WRKID        @G17EFFR 84276002
         LA    R4,SECOUT(R4)       PT TO SECONDS IN LABEL      @G17EFFR 84276102
         LA    R8,3                LOOP COUNT                  @G17EFFR 84276202
HHMMSS   BAL   R7,CONVERT          CONVERT TO XWORK            @G17EFFR 84276302
         MVC   0(2,R4),XWORK+3     MOVE TO LABEL               @G17EFFR 84276402
         SH    R4,THREE            DECREMENT LABEL PTR         @G17EFFR 84276502
         LA    R5,2(R5)                                        Z12033FR 84276602
         BCT   R8,HHMMSS           LOOP BACK FOR NEXT          Z12033FR 84276702
         LM    R4,R8,XSAVE         RESTORE REGS                @G17EFFR 84276802
         BR    R14                 GO PRINT ERRORID            @G17EFFR 84276902
*                                  ERRORID CONVERT ROUTINE     @G17EFFR 84277002
CONVERT  DS    0H                                              @G17EFFR 84277102
         LH    R6,0(R5)            GET HALF WORD TO BE CONVERTED        84277202
         CVD   R6,XWORK            CONVERT TO DECIMAL          @G17EFFR 84277302
         UNPK  XWORK(5),XWORK+5(3) 5 DIGITS MAX                @G17EFFR 84277402
         OI    XWORK+4,X'F0'       LAST CHAR TO XWORK          @G17EFFR 84277502
         BR    R7                  RETURN TO CALLER            @G17EFFR 84277702
ERRIDOUT EQU   0                                               @G17EFFR 84277802
SEQOUT   EQU   ERRIDOUT+11                                     @G17EFFR 84277902
CPUOUT   EQU   ERRIDOUT+20                                     @G17EFFR 84278002
ASIDOUT  EQU   ERRIDOUT+29                                     @G17EFFR 84278102
HRSOUT   EQU   ERRIDOUT+38                                     @G17EFFR 84278202
MINOUT   EQU   ERRIDOUT+41                                     @G17EFFR 84278302
SECOUT   EQU   ERRIDOUT+44                                     @G17EFFR 84278402
TSECOUT  EQU   ERRIDOUT+47                                     @G17EFFR 84278502
TEN      DC    F'10'                                           @G17EFFR 84278602
EIGHT    DC    H'8'                                            @G17EFFR 84278702
THREE    DC    H'3'                                            @G17EFFR 84278802
WRKID    DS    3F                                              @G17EFFR 84278902
WORK     EQU   XWORK                                                    84284002
XLABELP  EQU   LP                                                       84288002
         LTORG                                                          84300002
STARTER  DS    0F                                                       84360002
         DC    XL4'00010001'                                            84420002
         DC    XL4'00010001'                                            84480002
         DC    A(LABAREA)                                               84540002
         DC    H'0'                                                     84600002
         DC    X'01'                                                    84660002
         DC    X'000B8B00'                                              84720002
         LABEL     ''                                                   84780002
         LINE      ,,SKIP=2                                             84840002
         LABEL     ''                                                   84900002
         LINE  (7,42),(1,35),SKIP=2                                     84960002
         HEX   XCPUMOD,0,2B                                             85000002
         HEX   XSER,0,3B                                                85040002
         LABEL 'MODEL  ','SERIAL NO.'                                   85080002
*                                                                       85140002
         LINE  (10,)                                                    85200002
         ROUTINE    XRELN,CONVREL                                       85210002
         LABEL      'XXXX REL.'                                         85220002
         LINE  (48,1)                                                   85230002
         LABEL '--- RECORD SOURCE - MCH ---','TYPE - CPU'               85260002
*                                                                       85320002
         LINE  (1,1),(16,1),SKIP=2                                      85330002
         ROUTINE ERRORID,CHKID                                          85340002
ERRID    LABEL 'ERRORID=SEQXXXXX CPUXXXX ASIDXXXX TIMEXX.XX.XX.X'       85350002
         LINE                                                           85357002
         ROUTINE ERRORID,NOID                                           85364002
         LABEL 'NO ERRORID ASSOCIATED WITH THIS RECORD'                 85371002
         LINE  (15,1),(1,1)                                             85380002
         HEX   XMCKPSW,1,8B                                             85440002
         LABEL 'MCK OLD PSW'                                            85500002
         LINE  (21,1),(1,1),SKIP=2                             @YL02021 85504002
         ROUTINE   XKEY,ISITVS2                                @YL02021 85508002
         LABEL 'XXXXX  SYSTEM TERMINATED  XXXXX'               @YL02021 85512002
         LINE  (41,1),(1,1),SKIP=2                             @YL02021 85516002
         HEX   RECLNT                                          @YL02021 85520002
         LABEL 'RECORD LENGTH'                                 @YL02021 85524002
         LINE  ,                                               @YL02021 85528002
         HEX   WAITST                                          @YL02021 85532002
         LABEL 'WAIT STATE'                                    @YL02021 85536002
         LINE  ,                                               @YL02021 85540002
         ROUTINE   XKEY,ISVS2                                  @YL02021 85544002
         LABEL ''                                              @YL02021 85548002
LINE1    LINE  (21,1),(1,1),SKIP=2                             @YL02021 85560002
         ROUTINE    XJOBID,SETJOBN                                      85620002
LAB1     LABEL 'JOB NAME'                                      @YL02021 85680002
         LINE                                                           85800002
         ROUTINE    XPGMID,SETJOBN                                      85860002
         LABEL 'PROGRAM NAME'                                           85920002
*                                                                       85980002
LINE2    LINE  ,(8,40),SKIP=1                                  @YL02021 86040002
LAB2     LABEL 'DAY  YEAR','HH MM SS.TH'                       @YL02021 86160002
         LINE       (8,40),(1,40),SKIP=2                                86220002
         ROUTINE    XDATE,SETDATE                                       86280002
         HEX        XTIME,1,4B                                          86340002
         LABEL      'DATE _','TIME _'                                   86400002
*********************************************************************** 86460002
START    DS    0C                                                       86520002
         LINE  (1,1),(5,1),SKIP=1                                       86580002
         LABEL '--- MACHINE CHECK INTERRUPT CODE ---'                   86640002
         LINE                                                           86700002
         LABEL 'SUB CLASS'                                              86760002
         LINE  (23,50),(1,41)                                  @YL02021 86820002
         BIN   SYSDAM                                                   86880002
         BIN   CLOCKD                                                   86940002
         LABEL 'SYSTEM DAMAGE (SD)','TIMING FACILITIES DAMAGE (CD)'     87000002
         LINE                                                           87060002
         BIN   PROCD                                                    87120002
         BIN   EXTDAM                                                   87180002
         LABEL 'PROC DAMAGE (PD)','EXTERNAL DAMAGE (CD)'                87240002
         LINE                                                           87300002
         BIN   SYSREC                                                   87360002
         BIN   AUTOCON                                                  87420002
         LABEL 'SYSTEM RECOVERY (SR)','DEGRADATION (DG)'       @YL02021 87480002
         LINE                                                           87540002
         BIN   TIMDAM                                                   87600002
         BIN   WARNG                                                    87660002
         LABEL 'TIMER DAMAGE','WARNING (W)'                             87720002
         LINE                                                           87780002
         LABEL     ''                                                   87840002
         LINE  (23,41),(1,1),SKIP=1                            @YL02021 87900002
         LABEL '--- INTERRUPT TENSE CODES ---'                          87960002
         LINE  (23,41),(1,41),SKIP=1                                    88020002
         BIN   BACKUP1                                                  88080002
         BIN   DELAY                                                    88140002
         LABEL 'BACK-UP (B)','DELAYED (D)'                              88200002
         LINE                                                           88260002
         LABEL     ''                                                   88320002
         LINE  ,(1,1),SKIP=1                                            88380002
         LABEL '--- STORAGE AND PROTECTION ERROR CODES ---'             88440002
         LINE  (41,50),(1,50)                                           88500002
         BIN   UNSTOR                                                   88560002
         BIN   KEYERR                                                   88620002
         LABEL 'UNCORRECTED STORAGE ERRORS (SE)','UNCORRECTED PROTECTIOX88680002
               N ERROR (PE)'                                            88740002
         LINE                                                           88800002
         BIN   CORRST                                                   88860002
         LABEL 'CORRECTED STORAGE ERRORS (SC)'                          88920002
         LINE                                                           88980002
         LABEL     ''                                                   89040002
         LINE  ,(1,1),SKIP=1                                            89100002
         LABEL '--- PSW VALIDITY CODES'                                 89160002
         LINE  (41,50),(1,50)                                           89220002
         BIN   EMWP                                                     89280002
         BIN   SYSMSK                                                   89340002
         LABEL 'EMWP BITS OF M.C. OLD ARE VALID (WP)','SYSTEM MASK OF MX89400002
               .C. OLD IS VALID (MS)'                                   89460002
         LINE                                                           89520002
         BIN   PGMSK                                                    89580002
         BIN   IAVLD                                                    89640002
         LABEL 'PROGRAM MASK OF M.C. OLD IS VALID (PM)','INSTR ADDR OF X89700002
               M.C. OLD IS VALID (IA)'                                  89760002
         LINE                                                           89820002
         LABEL     ''                                                   89880002
         LINE  ,(1,1),SKIP=1                                            89940002
         LABEL '--- MISC VALIDITY CODES ---'                            90000002
         LINE  (41,50),(1,50)                                           90060002
         BIN   FASTVLD                                                  90120002
         BIN   RCVLD                                                    90180002
         LABEL 'FAILING STORAGE ADDR IS VALID (FA)','REGION CODE VALID X90240002
                (RC)'                                                   90300002
         LINE                                                           90360002
         BIN   FLPVLD                                                   90420002
         BIN   GPRVLD                                                   90480002
         LABEL 'FP REGS STORED ARE VALID (FP)','GP REGS STORED ARE VALIX90540002
               D (GP)'                                                  90600002
         LINE                                                           90660002
         BIN   CTLVLD                                                   90720002
         BIN   LOGVLD                                                   90780002
         LABEL 'CONTROL REGS STORED ARE VALID (CR)','EXTENDED LOGOUT ARX90840002
               EA VALID (LG)'                                           90900002
         LINE                                                           90960002
         BIN   STVLD                                                    91020002
         LABEL 'INSTR MODIFIED STORAGE VALID (ST)'                      91080002
         LINE  (41,50),(1,50)                                  @ZA24225 91087062
         ROUTINE XKEY,ISITMVS                                  @ZA24225 91094062
         LABEL ''                                              @ZA24225 91101062
         LINE  (58,1),(30,30),SKIP=2                           @ZA24225 91108062
         BIN   LRBNVLD                                         @ZA24225 91115062
         ROUTINE XKEY,ISITMVS                                  @ZA24225 91122062
         LABEL '--- LRB MAY NOT BE VALID','---'                @ZA24225 91129062
         LINE (37,1),(1,1),SKIP=1                              @ZA24225 91140062
         HEX   EXTDLOG,1,2B                                             91200002
         LABEL 'EXTENDED LOGOUT LENGTH'                                 91260002
         LINE      (37,1),(1,1)                                         91320002
         HEX       RESRVDB,1,14B                                        91440002
         LABEL     'MC STATUS FIELD'                                    91560002
         LINE  (34,1),(1,1)                                             91980002
         HEX   FAILSTA,1,3B                                             92040002
         LABEL 'FAILING STORAGE ADDRESS'                                92100002
         LINE  (31,1),(1,1)                                             92160002
         HEX   RGNCODE,1,4B                                             92220002
         LABEL 'REGION CODE'                                            92280002
         LINE  ,                                               @YA02788 92290002
         ROUTINE  XSWS8,TSTREC                                 @YA02788 92300002
         LABEL  ''                                             @YA02788 92310002
         LINE                                                           92340002
         LABEL     ''                                                   92400002
         LINE  ,(5,1)                                                   92460002
         LABEL '--- FLOATING POINT REGISTERS ---'                       92520002
         LINE  (16,15),(1,1)                                            92580002
         HEX   FP0,1,4B                                                 92640002
         HEX   FP1,1,4B                                                 92700002
         HEX   FP2,1,4B                                                 92760002
         HEX   FP3,1,4B                                                 92820002
         LABEL 'FP REGS 0,2'                                            92880002
         LINE  (16,15),(1,1)                                            92940002
         HEX   FP4,1,4B                                                 93000002
         HEX   FP5,1,4B                                                 93060002
         HEX   FP6,1,4B                                                 93120002
         HEX   FP7,1,4B                                                 93180002
         LABEL 'FP REGS 4,6'                                            93240002
         LINE                                                           93300002
         LABEL     ''                                                   93360002
         LINE  ,(5,1)                                                   93420002
         LABEL '--- GENERAL PURPOSE REGISTERS ---'                      93480002
         LINE  (16,15),(1,1)                                            93540002
         HEX   GPR0,1,4B                                                93600002
         HEX   GPR1,1,4B                                                93660002
         HEX   GPR2,1,4B                                                93720002
         HEX   GPR3,1,4B                                                93780002
         LABEL 'GP REGS 0-3'                                            93840002
         LINE  (16,15),(1,1)                                            93900002
         HEX   GPR4,1,4B                                                93960002
         HEX   GPR5,1,4B                                                94020002
         HEX   GPR6,1,4B                                                94080002
         HEX   GPR7,1,4B                                                94140002
         LABEL 'GP REGS 4-7'                                            94200002
         LINE  (16,15),(1,1)                                            94260002
         HEX   GPR8,1,4B                                                94320002
         HEX   GPR9,1,4B                                                94380002
         HEX   GP10,1,4B                                                94440002
         HEX   GP11,1,4B                                                94500002
         LABEL 'GP REGS 8-B'                                            94560002
         LINE  (16,15),(1,1)                                            94620002
         HEX   GP12,1,4B                                                94680002
         HEX   GP13,1,4B                                                94740002
         HEX   GP14,1,4B                                                94800002
         HEX   GP15,1,4B                                                94860002
         LABEL 'GP REGS C-F'                                            94920002
         LINE                                                           94980002
         LABEL     ''                                                   95040002
         LINE  ,(5,1)                                                   95100002
         LABEL '--- CONTROL REGISTERS ---'                              95160002
         LINE  (16,15),(1,1)                                            95220002
         HEX   CTR0,1,4B                                                95280002
         HEX   CTR1,1,4B                                                95340002
         HEX   CTR2,1,4B                                                95400002
         HEX   CTR3,1,4B                                                95460002
         LABEL 'CR REGS 0-3'                                            95520002
         LINE  (16,15),(1,1)                                            95580002
         HEX   CTR4,1,4B                                                95640002
         HEX   CTR5,1,4B                                                95700002
         HEX   CTR6,1,4B                                                95760002
         HEX   CTR7,1,4B                                                95820002
         LABEL 'CR REGS 4-7'                                            95880002
         LINE  (16,15),(1,1)                                            95940002
         HEX   CTR8,1,4B                                                96000002
         HEX   CTR9,1,4B                                                96060002
         HEX   CR10,1,4B                                                96120002
         HEX   CR11,1,4B                                                96180002
         LABEL 'CR REGS 8-B'                                            96240002
         LINE  (16,15),(1,1)                                            96300002
         HEX   CR12,1,4B                                                96360002
         HEX   CR13,1,4B                                                96420002
         HEX   CR14,1,4B                                                96480002
         HEX   CR15,1,4B                                                96540002
         LABEL 'CR REGS C-F'                                            96600002
         LINE                                                           96660002
         ROUTINE EXTDLOG,WHERETO                                        96720002
         LABEL ''                                                       96780002
         DC    X'01'                                                    96840002
         DC    X'000B8B00'                                              96900002
         LABEL     ''                                                   96960002
         DC    X'FE'                                                    97020002
         DC    CL8'IFCEA155'                                            97080002
FETLOAD  DC    X'FE'                                                    97140002
         DC    CL8'IFCEL155'                                            97200002
DUMPCODE DC    X'FF'                                                    97260002
         DC    AL2(70)                                                  97320002
         DC    AL2(48)                                                  97380002
         DC    AL2(232)                                                 97440002
MIDREC   DC    X'FE'                                                    97500002
         DC    CL8'IFCEG155'                                            97560002
LABAREA  EQU   *                                                        97620002
         LSTART                                                         97680002
         END                                                            97740002
