         TITLE 'IFCEXXX3 - EDIT TABLE - LINKNAME=IFCE1443, ALIASES=IFCEC00075002
               1419,IFCE1275,IFCE1285,IFCE2671'                         00150002
         SPACE 2                                                        00225002
*  LINE MACRO     LINE MACRO     LINE MACRO     LINE MACRO            * 00300002
         MACRO                                                          00375002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      00450002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     00525002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    00600002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 00675002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    00750002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    00825002
.*                                 THE PREVIOUS LINE AND STORES THAT #  00900002
.*                                 INTO THE APPROPRIATE BYTE.           00975002
.*                                 &DATA(1) - CHARACTER POSITION TO     01050002
.*                                 BEGIN DATA.                          01125002
.*                                                                      01200002
.*                                 &DATA(2) - # OF SPACES BETWEEN       01275002
.*                                 SUCCESSIVE DATA COLUMN STARTING      01350002
.*                                 CHARACTERS.                          01425002
.*                                                                      01500002
.*                                 &LABEL(1) - CHARACTER POSITION       01575002
.*                                 TO BEGIN LABELS.                     01650002
.*                                                                      01725002
.*                                 &LABEL(2) - # OF SPACES BETWEEN      01800002
.*                                 LINE'S LABEL STARTING CHARACTERS.    01875002
.*                                                                      01950002
.*                                 &SKIP= - # OF LINES TO ADVANCE       02025002
.*                                 CARRIAGE TO BEGIN NEXT PRINTED LINE. 02100002
.*                                                                      02175002
.*                                 NEW ENTRIES ARE GENERATED ONLY WHEN  02250002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   02325002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 02400002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   02475002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 02550002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    02625002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   02700002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   02775002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   02850002
.*                                 THE SUBJECT LINE.                    02925002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  03000002
         GBLA  &LASTCC,&INITIAL                                         03075002
         GBLC  &NRENTSX                                                 03150002
         GBLC  &CARRCON                                                 03225002
         GBLB  &TEST                                                    03300002
         LCLA  &S                                                       03375002
&NAME    DS    0C                                                       03450002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  03525002
         LINEND                                                         03600002
         AGO   .NTFIRST                                                 03675002
.FIRSTLN ANOP                                                           03750002
&NRENTSX SETC  'N&SYSNDX'                                               03825002
&INITIAL SETA  1                                                        03900002
&LASTCC  SETA  1                                                        03975002
N&SYSNDX EQU   *                                                        04050002
.NTFIRST ANOP                                                           04125002
         DC    AL1(0)                                                   04200002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               04275002
         AIF   ('&DATA'(1,1) NE '(').SLABEL                             04350002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                04425002
&DB      SETA  &DATA(1)                                                 04500002
         AGO   .AA                                                      04575002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                04650002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 04725002
         AGO   .CC                                                      04800002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    04875002
         AIF   (&DATA(2) EQ &DT).BB                                     04950002
.CC      ANOP                                                           05025002
&DT      SETA  &DATA(2)                                                 05100002
.BB      DC    XL2'FFFE'                                                05175002
         DC    FL1'&DB'                                                 05250002
         DC    FL1'&DT'                                                 05325002
&NRENTS  SETA  &NRENTS+1                                                05400002
.NCDATA  ANOP                                                           05475002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              05550002
         AIF   ('&LABEL'(1,1) NE '(').SLABEL                            05625002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               05700002
&LB      SETA  &LABEL(1)                                                05775002
         AGO   .AAA                                                     05850002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              05925002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               06000002
         AGO   .CCC                                                     06075002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  06150002
         AIF   (&LABEL(2) EQ &LT).BBB                                   06225002
.CCC     ANOP                                                           06300002
&LT      SETA  &LABEL(2)                                                06375002
.BBB     DC    XL2'FFFF'                                                06450002
         DC    FL1'&LB'                                                 06525002
         DC    FL1'&LT'                                                 06600002
&NRENTS  SETA  &NRENTS+1                                                06675002
.NCLABEL ANOP                                                           06750002
         AIF   ('&SKIP' EQ 'E').EJECT                                   06825002
         AIF   ('&SKIP' EQ '').TESTOFF                                  06900002
.CONT    ANOP                                                           06975002
         AIF   (&TEST EQ 0).AB                                          07050002
         AIF   (&SKIP EQ &LASTCC).TESTOFF                               07125002
&S       SETA  &SKIP                                                    07200002
         ORG   &CARRCON+3                                               07275002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 07350002
         ORG                                                            07425002
&LASTCC  SETA  &S                                                       07500002
.SLABEL  ANOP                                                           07575002
.TESTOFF ANOP                                                           07650002
&TEST    SETB  0                                                        07725002
         AGO   .DD                                                      07800002
.EJECT   DC    XL2'FFFB'                                                07875002
&NRENTS  SETA  &NRENTS+1                                                07950002
         DC    X'8B'              SKIP TO CHANNEL 1                     08025002
         DC    AL.3(0),AL.2(&LASTCC),AL.3(1)                            08100002
&TEST    SETB  1                                                        08175002
         AGO   .DD                                                      08250002
.AB      AIF   (&SKIP EQ &LASTCC).NOCHANG                               08325002
A&SYSNDX DC    XL2'FFFB'                                                08400002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              08475002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              08550002
&LASTCC  SETA  &SKIP                                                    08625002
&TEST    SETB  1                                                        08700002
&CARRCON SETC  'A&SYSNDX'                                               08775002
&NRENTS  SETA  &NRENTS+1                                                08850002
.DD      ANOP                                                           08925002
.NOCHANG ANOP                                                           09000002
         MEND                                                           09075002
         EJECT                                                          09150002
         SPACE 2                                                        09225002
*  ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO* 09300002
         MACRO                                                          09375002
&NAME    ROUTINE &LOGITEM,&RNAME                                        09450002
         GBLC  &DSECT,&CSECT                                            09525002
         GBLC  &ITEM(1000)                                              09600002
         GBLA  &SHIFT(1000),&ITEMNBR                                    09675002
         GBLA  &NRENTS                                                  09750002
         LCLA  &ISHIFT,&NDX                                             09825002
.LOOP    ANOP                                                           09900002
&NDX     SETA  &NDX+1                                                   09975002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      10050002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  10125002
         MNOTE *,'LOG ITEM NOT DEFINED'                                 10200002
         MEXIT                                                          10275002
.FOUND   ANOP                                                           10350002
&ISHIFT  SETA  &SHIFT(&NDX)                                             10425002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           10500002
         DC    AL.4(&ISHIFT),AL.12(&RNAME-&CSECT)                       10575002
&NRENTS  SETA  &NRENTS+1                                                10650002
         MEND                                                           10725002
*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 10800002
         SPACE 2                                                        10875002
         MACRO                                                          10950002
&NAME    DSGEN &X1,&X2,&X3,&X4,&X5,&X6,&X7,&X8,&X9,&X10,&X11,&X12,&X13,X11025002
               &X14,&X15,&X16,&X17,&X18,&X19,&X20,&X21,&X22,&X23,&X24, X11100002
               &X25,&X26,&X27,&X28,&X29,&X30,&X31,&X32                  11175002
.*                            THIS MACRO GENERATES ONE DSECT WORD       11250002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 11325002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  11400002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    11475002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 11550002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   11625002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 11700002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      11775002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  11850002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    11925002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   12000002
         GBLC &ITEM(1000)                                               12075002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000)                         12150002
         LCLC  &SYMBOL                                                  12225002
         LCLA  &OP,&COUNT,&BYTE                                         12300002
.LOOP    ANOP                                                           12375002
&OP      SETA  &OP+1                                                    12450002
&ITEMNBR SETA  &ITEMNBR+1                                               12525002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        12600002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            12675002
         MNOTE *,'NULL BIT COUNT FIELD'                                 12750002
         MEXIT                                                          12825002
.OK1     ANOP                                                           12900002
         AIF   ('&SYMBOL' NE '').OK                                     12975002
         MNOTE 'LOG ITEM SYMBOL NOT PROVIDED'                           13050002
         AGO   .CNT                                                     13125002
.OK      ANOP                                                           13200002
         AIF   ('&SYMBOL'(1,1) EQ '''').CNT                *TEMP*       13275002
&SYMBOL  EQU   *+&BYTE                                                  13350002
&ITEM(&ITEMNBR)  SETC '&SYSLIST(&OP,1)'                                 13425002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    13500002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    13575002
.CNT     ANOP                                                           13650002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   13725002
&BYTE    SETA  &COUNT/8                                                 13800002
         AIF (&OP LT N'&SYSLIST).LOOP                                   13875002
         AIF   (&COUNT NE 32).NOT32                                     13950002
&NAME    DS    4C                                                       14025002
         MEXIT                                                          14100002
.NOT32   AIF   (&COUNT NE 64).ERR                                       14175002
&NAME    DS    8C                                                       14250002
         MEXIT                                                          14325002
.ERR     MNOTE '**BIT COUNT FIELDS DO NOT TOTAL 32 OR 64**'             14400002
         MEND                                                           14475002
         MACRO                                                          14550002
         LINEND                                                         14625002
.*                            THIS MACRO IS USED ONLY BY THE LINE       14700002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   14775002
.*                                 ASSOCIATED WITH EACH LINE.           14850002
         GBLA  &NRENTS                                                  14925002
         GBLC &NRENTSX                                                  15000002
         ORG   &NRENTSX                                                 15075002
         DC    FL1'&NRENTS'                                             15150002
         ORG                                                            15225002
&NRENTS  SETA  0                                                        15300002
B&SYSNDX EQU   *                                                        15375002
&NRENTSX SETC  'B&SYSNDX'                                               15450002
         MEND                                                           15525002
         SPACE 2                                                        15600002
         EJECT                                                          15675002
*  LABEL MACRO     LABEL MACRO     LABEL MACRO     LABEL MACRO        * 15750002
         SPACE 2                                                        15825002
         MACRO                                                          15900002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C15975002
               &LABEL7,&LABEL8                                          16050002
.*                            THIS MACRO ALLOWS UP TO ACHT LABELS TO    16125002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   16200002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  16275002
.*                                 TION MARKS. THE COLUMN AND LINE END  16350002
.*                                 CONTROLS WILL BE INSERTED BY THE     16425002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      16500002
.*                                 LABEL REQUIRED FOR RESPECTIVE        16575002
.*                                 COLUMN. THIS MACRO WILL ALSO ALERT   16650002
.*                                 THE PROGRAMMER TO EXACTLY WHERE THE  16725002
.*                                 TABLE MUST BE BROKEN IF NECESSARY    16800002
.*                                 TO AVOID EXCEEDING THE MAXIMUM LIMIT 16875002
         GBLC &LABELS(2000)                                             16950002
         GBLC  &LBL(100)                                                17025002
         GBLA  &LBLCTR(100)                                             17100002
         GBLA  &LABELNR                                                 17175002
         GBLA  &NRENTS,&LPTR                                            17250002
         LCLC  &MARGIN,&TACK                                            17325002
         LCLC  &TEXT                                                    17400002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            17475002
&MARGIN  SETC  '*'                                                      17550002
         AIF   ('&NAME' EQ '').LOOPOUT                                  17625002
&LPTR    SETA  &LPTR+1                                                  17700002
&LBL(&LPTR) SETC '&NAME'                                                17775002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          17850002
.LOOPOUT ANOP                                                           17925002
&OP      SETA  &OP+1                                                    18000002
&K       SETA  K'&SYSLIST(&OP)                                          18075002
         AIF (&K GE 2).NORM                                             18150002
&K       SETA  2                                                        18225002
.NORM    ANOP                                                           18300002
&START   SETA  2                                                        18375002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                18450002
&MARGIN  SETC  '$'                                                      18525002
.NOTLAST ANOP                                                           18600002
&NRCHAR  SETA  8                                                        18675002
&TACK    SETC  ''                                                       18750002
.LOOPIN  ANOP                                                           18825002
&REMAIN  SETA  &K-&START                                                18900002
         AIF (&REMAIN GE 8).MORE                                        18975002
&TACK    SETC  '&MARGIN'                                                19050002
&NRCHAR  SETA  &REMAIN                                                  19125002
.MORE    ANOP                                                           19200002
&TEXT    SETC  ''                                                       19275002
         AIF (&REMAIN EQ 0).ENDTEXT                                     19350002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          19425002
.ENDTEXT ANOP                                                           19500002
&LABELNR SETA  &LABELNR+1                                               19575002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  19650002
&START   SETA  &START+8                                                 19725002
         AIF ('&TACK' EQ '').LOOPIN                                     19800002
         AIF ('&TACK' EQ '*').LOOPOUT                                   19875002
         MEND                                                           19950002
         SPACE 2                                                        20025002
         MACRO                                                          20100002
         LSTART                                                         20175002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  20250002
.*                                 OF THE TABLE IS TO BEGIN.            20325002
         GBLC &LABELS(2000)                                             20400002
         GBLA  &LABELNR                                                 20475002
         GBLC  &LBL(100)                                                20550002
         GBLA  &LBLCTR(100)                                             20625002
         LCLA  &NDX,&CTR                                                20700002
         LINEND                                                         20775002
&CTR     SETA  1                                                        20850002
.LOOP    ANOP                                                           20925002
&NDX     SETA  &NDX+1                                                   21000002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            21075002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         21150002
&CTR     SETA  &CTR+1                                                   21225002
         AGO   .LOOPCTL                                                 21300002
.NOLBL   ANOP                                                           21375002
         DC    C'&LABELS(&NDX)'                                         21450002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  21525002
         MEND                                                           21600002
         SPACE 2                                                        21675002
*  BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO  * 21750002
         SPACE 2                                                        21825002
         MACRO                                                          21900002
         BIN   &LOGITEM,&SKIP$OR                                        21975002
.*                                 &LOGITEM - NAME OF ITEM IN LOG       22050002
.*                                      RECORD DSECT                    22125002
.*                                 &SKIP$OR - NBR OF SPACES TO SKIP ON  22200002
.*                                 MULTIPLE PRINT OR NBR OF SPACES      22275002
.*                                      TO BACK UP FROM COLUMN FOR      22350002
.*                                      START OF PRINTING. THE LETTER   22425002
.*                                      B PRECEEDS THE NUMBER (B5) IF   22500002
.*                                      THE LATTER IS DESIRED. OMISSION 22575002
.*                                      OF THIS OPERAND FORCES OPTION 2 22650002
.*                                      WITH BACKUP SPACING EQUAL TO    22725002
.*                                 THE NUMBER OF BITS IN THE ITEM       22800002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      22875002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     22950002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       23025002
         GBLC &ITEM(1000)                                               23100002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 23175002
         GBLC  &DSECT                                                   23250002
         LCLB  &B                                                       23325002
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   23400002
         LCLA  &TEMP,&T                                                 23475002
         LCLC  &S                                                       23550002
.LOOP    ANOP                                                           23625002
&NDX     SETA  &NDX+1                                                   23700002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      23775002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  23850002
         MNOTE *,'YOU BLEW IT'                                          23925002
         ROUTINE DUM,SKIPPER                                            24000002
         MEXIT                                                          24075002
.FOUND   ANOP                                                           24150002
&ISHIFT  SETA  &SHIFT(&NDX)                                             24225002
&IBITS   SETA  &BITS(&NDX)                                              24300002
&T       SETA  &IBITS-1                                                 24375002
&B       SETB  0                                                        24450002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                24525002
&K       SETA  K'&SKIP$OR                                               24600002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 24675002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   24750002
&T       SETA  &S                                                       24825002
.BACKUP  ANOP                                                           24900002
&NRENTS  SETA  &NRENTS+1                                                24975002
&TEMP    SETA  &ISHIFT                                                  25050002
A&SYSNDX DC    AL.12(&LOGITEM-&DSECT),XL.4'&TEMP'                       25125002
         AIF (&IBITS EQ 1 AND &B EQ 0).OUT                              25200002
         ORG   A&SYSNDX                                                 25275002
&B       SETB  1                                                        25350002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'C'                           25425002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             25500002
.OUT     ANOP                                                           25575002
         MEND                                                           25650002
         EJECT                                                          25725002
*  HEX MACRO     HEX MACRO     HEX MACRO    HEXN MACRO     HEX MACRO  * 25800002
         SPACE 2                                                        25875002
         MACRO                                                          25950002
         HEX   &LOGITEM,&SKIP$OR,&BYTES                                 26025002
.*                                 CONVERSIONS.                         26100002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE        26175002
.*                                 CONVERTED                            26250002
.*                            &SKIP$OR - NUMBER OF SPACES TO SKIP ON    26325002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   26400002
.*                                 BACK UP FROM COLUMN FOR START OF     26475002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  26550002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  26625002
.*                                 DESIRED. OMISSION OF THIS OPERAND    26700002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  26775002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  26850002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 26925002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    27000002
.*                                 IMPLICITLY B).                       27075002
.*                            &BYTES - NUMBER OF TOTAL INPUT BYTES TO   27150002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     27225002
.*                                 WITH AN L,R, OR B TO STIPULATE       27300002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     27375002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     27450002
.*                                 RESPECTIVELY. OMISSION OF THIS       27525002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  27600002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 27675002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 27750002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   27825002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     27900002
.*                                 SUBJECT LINE(S).                     27975002
         GBLC &ITEM(1000),&DSECT                                        28050002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 28125002
         LCLB  &B                                                       28200002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP                  28275002
         LCLC  &S,&LETTER                                               28350002
.LOOP    ANOP                                                           28425002
&NDX     SETA  &NDX+1                                                   28500002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      28575002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  28650002
         MNOTE *,'LOG ITEM NOT DEFINED'                                 28725002
         MEXIT                                                          28800002
.FOUND   ANOP                                                           28875002
&ISHIFT  SETA  &SHIFT(&NDX)                                             28950002
&IBITS   SETA  &BITS(&NDX)                                              29025002
&CODE    SETA  1                                                        29100002
&K       SETA  K'&BYTES                                                 29175002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            29250002
         MNOTE *,'BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL'   29325002
         MEXIT                                                          29400002
.OK      AIF   ('&BYTES' EQ '').USEDEFN                                 29475002
&LETTER  SETC  '&BYTES'(&K,1)                                           29550002
&S       SETC  '&BYTES'(1,&K-1)                                         29625002
&BYTESP  SETA  &S                                                       29700002
         AIF   ('&LETTER' EQ 'B').BOTH                                  29775002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).OK2                       29850002
.ERR     MNOTE *,'DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY'            29925002
         MEXIT                                                          30000002
.USEDEFN ANOP                                                           30075002
&BYTESP  SETA  &IBITS/8                                                 30150002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       30225002
&CODE    SETA  3                                                        30300002
&T       SETA  &BYTESP*2-1                                              30375002
.OK2     AIF   (&ISHIFT EQ 0).L                                         30450002
&CODE    SETA  2                                                        30525002
.L       ANOP                                                           30600002
&S       SETC  '&T'                                                     30675002
&B       SETB  1                                                        30750002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                30825002
&K       SETA  K'&SKIP$OR                                               30900002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 30975002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   31050002
.BACKUP  ANOP                                                           31125002
&NRENTS  SETA  &NRENTS+1                                                31200002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'A'                           31275002
         DC    BL.1'&B',FL.7'&S',FL.4'&BYTESP',FL.4'&CODE'              31350002
.OUT     ANOP                                                           31425002
         MEND                                                           31500002
         MACRO                                                          31575002
         SPECIAL  &ROUTINE,&PARAM,&SPACE=                               31650002
.*                            THIS MACRO GENERATES A SPECIAL ROUTINE    31725002
.*                                 ENTRY TO BE PROCESSED BY THE SUM. M. 31800002
.*                            &ROUTINE - SYMBOL ON SPECIAL ROUTINE EWT. 31875002
.*                            &PARAM - AN 8 BIT BINARY REPRESENTATION   31950002
.*                                 TO OCCUPY THE 'MASK' FIELD BUT TO BE 32025002
.*                                 INTERPRETED AS AN ARGUMENT OF THE    32100002
.*                                 SPECIAL ROUTINE.                     32175002
.*                            &SPACE - THE NUMBER OF 2BYTE COUNTERS TO  32250002
.*                                 ALLOCATE FOR REQUIRED PROCESSING.    32325002
         GBLC  &CSECT                                                   32400002
         GBLA  &COUNTR                                                  32475002
         LCLA  &ADD                                                     32550002
         DC    AL1(128)                                                 32625002
         DC    BL.8'&PARAM'                                             32700002
         DC    AL2(&ROUTINE-&CSECT)                                     32775002
         DC    AL2(&COUNTR)                                             32850002
&ADD     SETA  1                                                        32925002
         AIF   ('&SPACE' EQ '').NORM                                    33000002
&ADD     SETA  &SPACE                                                   33075002
.NORM    ANOP                                                           33150002
&COUNTR  SETA  &COUNTR+&ADD                                             33225002
         MEND                                                           33300002
         MACRO                                                          33375002
         SUM   &LOGITEM,&MASK                                           33450002
.*                            THIS MACRO GENERATES A NORMAL EDIT ENTRY  33525002
.*                                 FOR PROCESSING BY THE SUMMARY MODULE 33600002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE SUMMED 33675002
.*                            &MASK - BYTE MASK FOR BITS TO BE TESTED.  33750002
.*                                 THIS OPERAND SHOULD BE OMITTED FOR   33825002
.*                                 SINGLE BIT ITEMS IN WHICH CASE THE   33900002
.*                                 MASK WILL BE SET ACCORDING TO THE    33975002
.*                                 OFF BYTE BIT DISPLACEMENT OF THE     34050002
.*                                ITEM AS DEFINED BY THE MACRO 'DSGEN'  34125002
         GBLA  &COUNTR,&ITEMNBR,&BITS(1000),&SHIFT(1000)                34200002
         GBLC  &ITEM(1000),&DSECT                                       34275002
         LCLA  &IBITS,&NDX,&ISHIFT,&M,&BITNBR                           34350002
.LOOP    ANOP                                                           34425002
&NDX     SETA  &NDX+1                                                   34500002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      34575002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  34650002
         MNOTE *,'LOGITEM NOT FOUND'                                    34725002
         MEXIT                                                          34800002
.FOUND   ANOP                                                           34875002
         DC    AL1(0)                                                   34950002
&ISHIFT  SETA  &SHIFT(&NDX)                                             35025002
&IBITS   SETA  &BITS(&NDX)                                              35100002
         AIF   ('&MASK' EQ '').FORM                                     35175002
         DC    B'&MASK'                                                 35250002
         AGO   .ITEM                                                    35325002
.FORM    ANOP                                                           35400002
&BITNBR  SETA  &ISHIFT-7                                                35475002
&BITNBR  SETA  0-&BITNBR                                                35550002
&M       SETA  1                                                        35625002
.LOOP2   ANOP                                                           35700002
         AIF   (&BITNBR EQ 0).GOTIT                                     35775002
&M       SETA  &M*2                                                     35850002
&BITNBR  SETA  &BITNBR-1                                                35925002
         AGO   .LOOP2                                                   36000002
.GOTIT   ANOP                                                           36075002
         DC    AL1(&M)                                                  36150002
.ITEM    DC    AL2(&LOGITEM-&DSECT)                                     36225002
         DC    AL2(&COUNTR)                                             36300002
&COUNTR  SETA  &COUNTR+1                                                36375002
         MEND                                                           36450002
         GBLC  &DSECT,&CSECT                                            36525002
IFCEXXX3 CSECT                                                          36600002
&CSECT   SETC  'IFCEXXX3'                                               36675002
&DSECT   SETC  'XXX3'                                                   36750002
*                                                                       36825002
*              EDIT TABLE FOR OBR REC                                   36900002
*                                                                       36975002
*        DEVICE CODE=080A  DEV TYPE= 1443    ALIAS= IFCE1443            37050002
*                    081D            1419          IFCE1419             37125002
*                    081E            1419           IFCE1419            37200002
*                    081F            1275          IFCE1275             37275002
*                    081A            1285           IFCE1285            37350002
*                    0810            2671           IFCE2671            37425002
*                                                                       37500002
XXX3     DSECT                                                          37575002
         DSGEN (XDUM1,8),(XRELN,8),(XDUM2,8),                    S21021X37650002
               (SW2B0,1),(SW2B1,1),(SW2B2,1),(SW2B3,1),          S21021X37725002
               (SW2B4,1),(SW2B5,1),(SW2B6,1),(SW2B7,1)           S21021 37800002
         DSGEN (XDUM3,32)                         SPARES                37875002
         DSGEN (XDATE,32)                         DATE                  37950002
         DSGEN (XTIME,32)                         TIME                  38025002
         DSGEN (XDUM4,8),(XSER,24)           SERIAL NO                  38100002
         DSGEN (XMODEL,16),(XDUM5,16)        MODEL NUMBER & MCLEN       38175002
         DSGEN (XPGN1,32)                    PROGRAM                    38250002
         DSGEN (XPGN2,32)                            NAME               38325002
         DSGEN (XFCCWCC,8),(XFCCWDA,24)  FAILING CCW                    38400002
         DSGEN (XFCCWFL,8),(XZERO,8),(XFCCWCT,16)    CCW                38475002
         DSGEN (XCSWK,8),(XCSWCA,24)         CHAN  STATUS               38550002
         DSGEN (XCSWATTN,1),(XCSWSM,1),(XCSWCUE,1),      WORD  CSW     C38625002
               (XCSWBSY,1),(XCSWCE,1),(XCSWDE,1),(XCSWUC,1),(XCSWUE,1),C38700002
               (XCSWPCI,1),(XCSWSILI,1),(XCSWPC,1),(XCSWPCHK,1),       C38775002
               (XCSWCDC,1),(XCSWCCC,1),(XCSWICC,1),(XCSWCH,1),         C38850002
               (XCSWCT,16)                                              38925002
         DSGEN (XDUMA,8),(XCUA2,24)                              S21021 39000002
         DSGEN (XDEVT1,16),(XDEVT2,16)       DEVICE TYPE                39075002
         DSGEN (XDUM6,8),(XCUA,24)           DUMMY AND CUA              39150002
         DSGEN (XDUM7,16),(XDUM8,16)         RTRY AND SPARE             39225002
         DSGEN (XDUM9,32)                    VOLUME                     39300002
         DSGEN (XDUM10,32)                          SER                 39375002
         DSGEN (XDUM11,32)                   LAST                       39450002
         DSGEN (XDUM12,32)                        SEEK                  39525002
         DSGEN (XDUM13,32)                   HOME                       39600002
         DSGEN (XDUM14,32)                        ADDRESS               39675002
         DSGEN (SDR1,8),(SDR2,8),(SDR3,8),(SDR4,8),(SDR5,8),     S21021X39750002
               (SDR6,8),(SDR7,8),(SDR8,8)                        S21021 39825002
         DSGEN (SDR9,8),(SDRA,8),(XB0CMDR,1),(XB0INTRQ,1),       S21021X39900002
               (XB0BUSC,1),(XB0ECHK,1),(XB0DCHK,1),                    C39975002
               (XB0BIT5,1),(XB0BIT6,1),(XB0BIT7,1),                    C40050002
               (XB1FLD6,1),(XB1FLD7,1),(XB1DOCUN,1),(XB1AFVAL,1),      C40125002
               (XB1PCF,1),(XB1ACCVL,1),(XB1TFVAL,1),(XB1SERV,1)         40200002
*                                                                       40275002
*                   1419 CODE 081E HAS TE SENSE BYTES                   40350002
*                                                                       40425002
         DSGEN (XDUM19,32)                                              40500002
EXPNOBR  DSECT                                                   S21021 40575002
EXPNHDRA DS CL52                                                 S21021 40650002
EXPNDEVA DS CL36                                                 S21021 40725002
EXPNSDRA DS CL10                                                 S21021 40800002
EXPNSNSA DS CL6                                                  S21021 40875002
*                                                                S21021 40950002
NORMOBR DSECT                                                    S21021 41025002
NORMHDRA DS CL64                                                 S21021 41100002
NORMSDRA DS CL10                                                 S21021 41175002
NORMSNSA DS CL6                                                  S21021 41250002
*                                                                S21021 41325002
SHRTOBR DSECT                                                    S21021 41400002
SHRTHDRA DS CL24                                                 S21021 41475002
SHRTDEVA DS CL8                                                  S21021 41550002
SHRTSDRA DS CL10                                                 S21021 41625002
*                                                                S21021 41700002
*                                                                       41775002
*        END OF DSECT    104 BYTES TOTAL                                41850002
*                                                                       41925002
IFCEXXX3 CSECT                                                          42000002
         USING *,R9                                                     42075002
R0       EQU   0                                                        42150002
R1       EQU   1                                                        42225002
R2       EQU   2                                                        42300002
R3       EQU   3                                                        42375002
R4       EQU   4                                                        42450002
R5       EQU   5                                                        42525002
R6       EQU   6                                                        42600002
R7       EQU   7                                                        42675002
R8       EQU   8                                                        42750002
R9       EQU   9                                                        42825002
R10      EQU   10                                                       42900002
R11      EQU   11                                                       42975002
R12      EQU   12                                                       43050002
R13      EQU   13                                                       43125002
R14      EQU   14                                                       43200002
R15      EQU   15                                                       43275002
L0       EQU   0                                                        43350002
L1       EQU   1                                                        43425002
L2       EQU   2                                                        43500002
L3       EQU   3                                                        43575002
L4       EQU   4                                                        43650002
L5       EQU   5                                                        43725002
L6       EQU   6                                                        43800002
L7       EQU   7                                                        43875002
L8       EQU   8                                                        43950002
L9       EQU   9                                                        44025002
L10      EQU   10                                                       44100002
L11      EQU   11                                                       44175002
L12      EQU   12                                                       44250002
L13      EQU   13                                                       44325002
L14      EQU   14                                                       44400002
L15      EQU   15                                                       44475002
L16      EQU   16                                                       44550002
L17      EQU   17                                                       44625002
L18      EQU   18                                                       44700002
L19      EQU   19                                                       44775002
L20      EQU   20                                                       44850002
L21      EQU   21                                                S21021 44925002
L24      EQU   24                                                       45000002
L26      EQU   26                                                       45075002
L28      EQU   28                                                       45150002
L29      EQU   29                                                S21021 45225002
L31      EQU   31                                                S21021 45300002
L34      EQU   34                                                S21021 45375002
L36      EQU   36                                                S21021 45450002
L44      EQU   44                                                S21021 45525002
L46      EQU   46                                                S21021 45600002
L50      EQU   50                                                       45675002
L52      EQU   52                                                       45750002
L54      EQU   54                                                S21021 45825002
L64      EQU   64                                                S21021 45900002
L104     EQU   104                                               S21021 45975002
DMP80    EQU   80                       NORMAL DUMP LENGTH              46050002
DMP104   EQU   104                      DUMP LENGTH CONVERTED           46125002
HEX08    EQU   X'08'                                             S21021 46200002
HEX20    EQU   X'20'                                             S21021 46275002
XFF      EQU   X'FF'                                             S21021 46350002
A        EQU   C'A'                                              S21021 46425002
B        EQU   C'B'                                              S21021 46500002
         USING XXX3,R2                                           S21021 46575002
*                                                                       46650002
         DC    A(ENTRIES)               PTR TO EDIT ENTRIES             46725002
         DC  CL8'IFCEXXX3'                                              46800002
XR9PTR   DS    F'0'                                                     46875002
XLABELP  DC    F'0'                                                     46950002
*        SPECIAL ROUTINE SECTION                                        47025002
*                                                                       47100002
SKIPPER  BR    R14                      NOOP RTRN                       47175002
*                                                                       47250002
*                                                                       47325002
SPACER1  LA    R3,L1(R3)                SPACE ONE BLANK          S21021 47400002
         BR    R14                      RETURN                          47475002
*                                                                       47550002
*                                                                       47625002
*        SET BINARY                                                     47700002
*              R4 HAS PTR TO CHAR                                       47775002
*                                                                       47850002
SETBIN   STM   R5,R8,XSAVE              SAVE REGS                       47925002
         IC    R7,L0(R4)                PICK UP CHAR TO PRINT           48000002
         SLL   R7,L24                   MOVE IT TO HI OF R7             48075002
         LR    R8,R3                    PRINT POS POINTER               48150002
         LA    R5,L8                    LOOP COUNT                      48225002
SETBINA  SR    R6,R6                    CLEAR REG 6                     48300002
         SLDL  R6,L1                    MOVE BIT TO R6                  48375002
         STC   R6,L0(R8)                PUT IT INTO PTINT LINE          48450002
         MVZ   L0(L1,R8),CHAR0                                          48525002
         LA    R8,L1(R8)                BUMP POINTER TO NEXT POS        48600002
         BCT   R5,SETBINA               LOOP TILL 8 PRINTED             48675002
         B     RETURN                   RETURN                          48750002
*                                                                       48825002
*        SET PROGRAM NAME  R4 POINTS TO NAME FIELD                      48900002
*                                                                       48975002
SETPGMN  DS    0H                                                S21021 49050002
         TM    SW2B0,HEX20              SHORT RECORD             S21021 49125002
         BCR   1,R14                    YES, NO JOB ID           S21021 49200002
         MVC   0(L12,R3),JOBID          MOVE IN LABEL            S21021 49275002
         MVC   L13(L8,R3),XPGN1         MOVE IN NAME             S21021 49350002
         BR    R14                                               S21021 49425002
NONAME   TM    L0(R4),HEX20             SHORT RECORD?            S21021 49500002
         BCR   14,R14                   NO, LET HEX JOBNAME PRNT S21021 49575002
         ST    R5,XSAVE                 SAVE REG                 S21021 49650002
         LA    R5,L44                   BACK UP BUFFER PNTR      S21021 49725002
         SR    R3,R5                                             S21021 49800002
         MVC   0(L17,R3),BLANKS         CLEAR OUT HEX JOBNAME    S21021 49875002
         L     R5,XSAVE                 RESTORE REG              S21021 49950002
         BR    R14                                               S21021 50025002
*                                                                       50100002
*                                                                       50175002
*                                                                       50250002
*        SET HEX  SAME AS BIN EXCPT PRINTS 1 CHAR HEX                   50325002
*                                                                       50400002
SETHEX   STM   R5,R8,XSAVE              SAVE REGS                       50475002
         LA    R8,CHARS                 CHAR TABLE POINTER              50550002
         IC    R7,L0(R4)                PICK UP CHAR                    50625002
         SLL   R7,L24                   MOVE IT TO HI OF R7             50700002
         SR    R6,R6                    CLEAR REGS                      50775002
         SLDL  R6,L4                    MOVE FOUR BITS                  50850002
         AR    R6,R8                    ADD OFFSET & PTR                50925002
         MVC   L0(L1,R3),L0(R6)         MOVE CHAR TO LINE               51000002
         SR    R6,R6                    CLEAR AGAIN                     51075002
         SLDL  R6,L4                    MOVE LAST 4 BOTS                51150002
         AR    R6,R8                    COMPUTE OFFSET                  51225002
         MVC   L1(L1,R3),L0(R6)         MOVE LAST CHAR                  51300002
         B     RETURN                                                   51375002
*                                                                       51450002
*                                                                       51525002
*                                                                       51600002
SETCONV  TM    L0(R4),HEX02             HAS RECORD BEEN CONVERTED KEY32 51675002
         BCR   ON,R14                   YES RETURN                      51750002
         SR    R15,R15                  NO CLEAR R15 FOR NO PRINT OF    51825002
         BR    R14                      LINE BR-14                      51900002
ON       EQU   1                                                        51975002
HEX02    EQU   X'02'                                                    52050002
*                                       SET DEVICE TYPE FIELD           52125002
*                                                                       52200002
SETDEVTY STM   R5,R8,XSAVE              SAVE REGS    R3 PTS TO BUFF POS 52275002
         LA    R5,L6                    NO OF DEVS   R4 PTS TO DEV TYP  52350002
         LA    R6,DEVTABLE                                              52425002
SETDEVLP CLC   L0(L2,L4),L0(R6)         COMPARE TYPES                   52500002
         BE    SDEVFND                  BR-EQUAL                        52575002
         LA    R6,L6(R6)                UP TO NXT DEV TYPE              52650002
         BCT   R5,SETDEVLP              LOOP                            52725002
         MVC   L0(L4,R3),NONE           NONE FOUND USE NONE             52800002
         B     RETURN                                                   52875002
SDEVFND  MVC   L0(L4,R3),L2(R6)         MOVE DEV NAME TO LINE           52950002
         B     RETURN                                                   53025002
*                                                                       53100002
*                                                                       53175002
*                             CHECK ON CPU AND SERIAL NO                53250002
SETCPUNO STM   R5,R8,XSAVE                                              53325002
         SR    R5,R5               CLEAR R5                             53400002
         IC    R5,L0(R4)           PICK UP MODEL NO                     53475002
         SLL   R5,L8               IN TO                                53550002
         IC    R5,L1(R4)           R5                                   53625002
         LTR   R5,R5                    TEST FOR ZERO MODEL      S21021 53700002
         LR    R5,R3                                             S21021 53775002
         BNZ   SETSER                                            S21021 53850002
         LA    R6,L46                   BACK UP TO SAY 'NONE'    S21021 53925002
         SR    R5,R6                    BACKUP BUFFER            S21021 54000002
         MVC   L0(L29,R5),UNIVERS       SAY NONE                 S21021 54075002
         B     RETURN                   RETURN  CONTROL                 54150002
SETSER   LA    R6,L36                   ADD LABEL 'SERIAL NO.'   S21021 54225002
         SR    R5,R6                                             S21021 54300002
         MVC   0(L10,R5),SERNO                                   S21021 54375002
         B     RETURN                                            S21021 54450002
*                                                                       54525002
*        SET DATE                                                       54600002
*                                                                       54675002
SETDATE  CLC   L1(L3,R4),ZERO           IS DATE ZERO                    54750002
         BE    SETDTE                   BR-YES                          54825002
         UNPK  XSAVE(L8),L1(L3,R4)      UNPACK DATE                     54900002
         MVC  L5(L2,R3),XSAVE+L3   MOVE YEAR                            54975002
         MVC   L0(L3,R3),XSAVE+L5       MOVE DAY                        55050002
         BR    R14                      RETURN                          55125002
SETDTE   MVC   L0(L4,R3),NONE           SET DATE TO NONE                55200002
         BR    R14                                                      55275002
ZERO     DC    XL4'00'                                                  55350002
*                                                                       55425002
*                                                                       55500002
SETLABEL STM   R5,R8,XSAVE              SAVE REGS                       55575002
         L     R5,XLABELP               PICK UP LABEL PTR               55650002
         CLI   L1(R4),HEX10             TEST FOR 2671                   55725002
         BE    RETURN                   BR-YES                          55800002
         CLI   L1(R4),HEX0A             TEST FOR 1443                   55875002
         BE    SET1443                  BR-YES                          55950002
         CLI   L1(R4),HEX1A             TEST FOR 1285                   56025002
         BE    SET1285                  BR-YES                          56100002
SET1419F MVC   L0(L50,R5),CLABEL1       SET LABELS                      56175002
         B     RETURN                                                   56250002
SET1443  MVC   L0(L50,R5),CLABEL3       SET LABELS                      56325002
         B     RETURN                                                   56400002
SET1285  MVC   L0(L50,R5),CLABEL4       SET LABELS                      56475002
*                                                                       56550002
RETURN   LM    R5,R8,XSAVE              RESTORE REG                     56625002
         BR    R14                      RETURN                          56700002
HEX0A    EQU   X'0A'                                                    56775002
HEX10    EQU   X'10'                                                    56850002
HEX1A    EQU   X'1A'                                                    56925002
HEX1D    EQU   X'1D'                                                    57000002
HEX1F    EQU   X'1F'                                                    57075002
*                                                                       57150002
*                   1419 HAS TWO SENSE BYTES  MOVE R9 TO NEW SECTION    57225002
*                                                                       57300002
SETR9    STM   R5,R8,XSAVE             SAVE REGS                        57375002
         CLI   L1(R4),HEX1F             IS IT A 1275                    57450002
         BE    SETR9A                         OR                        57525002
         CLI   L1(R4),HEX1D             IS IT  1419-2                   57600002
         BNE   RETURN                   NO RETURN                       57675002
SETR9A   EQU   *                                                        57750002
         LA     R5,M14192+L1   SET PTR TO 2 BYTE SECTION                57825002
         ST    R5,XR9PTR                                                57900002
         LA    R5,TWOSENSE              POINT TO TWO SENSE LABELSS21021 57975002
         ST    R5,XLABELP               ONE SENSE LABELS                58050002
SPACER16 LA    R3,L16(R3)                                        S21021 58125002
         BR    R14                                               S21021 58200002
SDRCONVL STM   R5,R8,XSAVE              SAVE REGS                S21021 58275002
         SR    R6,R6                    CLEAR REG                S21021 58350002
         IC    R6,L0(R4)                PICK UP COUNTER IN QUEST S21021 58425002
         SRL   R6,L4                    DROP OFF 4 LOW BITS      S21021 58500002
         B     SDRCONVT                                          S21021 58575002
SDRCONVR STM   R5,R8,XSAVE              SAVE REGS                S21021 58650002
         IC    R6,L0(R4)                PICK UP CHAR             S21021 58725002
         SLL   R6,L28                                            S21021 58800002
         SRL   R6,L28                   GET HALF BYTE                   58875002
SDRCONVT CVD   R6,WORK                  CONVERT IT               S21021 58950002
         UNPK  L0(L3,R3),WORK+L5(L3)    TO DECIMAL               S21021 59025002
         MVZ   L2(L1,R3),L0(R3)         PUT ON ZONE              S21021 59100002
         B     RETURN                                            S21021 59175002
*                                                                S21021 59250002
RESETR2  L     R2,SAVE2                 PICK UP SAVED REC POINTERS21021 59325002
         BR    R14                                               S21021 59400002
*                                                                S21021 59475002
TESTMP   TM    L0(R4),HEX10             IS IT A MP RECODR        S21021 59550002
         BZ    NOMP                                              S21021 59625002
         MVC   0(L20,R3),MPCPU          MOVE IN MP LABEL         S21021 59700002
         TM    L0(R4),HEX08             IS IT CPUA / CPUB        S21021 59775002
         BO    MPB                      BR IT IS B               S21021 59850002
         MVI   L21(R3),A                MOVE 'A' TO PRINT LINE   S21021 59925002
NOMP     BR    R14                                               S21021 60000002
MPB      MVI   L21(R3),B                MOVE 'B' TO PRINT LINE   S21021 60075002
         BR    R14                                               S21021 60150002
NOPRT    SR    R15,R15                  STOP PRINTING            S21021 60225002
         BR    R14                                               S21021 60300002
*                                                                S21021 60375002
CONVREL  STM   R5,R8,XSAVE              SAVE WORK REGS                  60450002
         SR    R6,R6                    CLEAR R6                        60525002
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        60600002
         SRDL  R6,L5                    SAVE REL NO IN R7               60675002
        SLL   R6,L2                    MULTIPLY SYS VALUE BY 4          60750002
         L     R8,XLABELP               PICK UP LABEL POINTER           60825002
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     60900002
         MVC   L0(L4,R8),L0(R6)         MOVE SYSTEM NAME INTO LABEL     60975002
         SR    R6,R6                    CLEAR R6                        61050002
         SLDL  R6,L5                    RETREIVE REL NO.                61125002
         LTR   R6,R6                    IS IT ZERO                      61200002
         BZ    NOREL                    BR-YES                          61275002
         CVD   R6,WORK                  CONVERT IT                      61350002
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFF       61425002
         MVZ   L1(L1,R3),L0(R3)         MOVE ON PROPER ZONE             61500002
         B     RETURN                   EXIT                            61575002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL            61650002
         B     RETURN                                                   61725002
*                                                                S21021 61800002
TESTSHRT TM    SW2B0,HEX20              IS IT A SHORT REC        S21021 61875002
         BZ    SKIPPER                  BR-NO                    S21021 61950002
         BCTR  R3,R0                    BACKUP ONE DATA SPACE    S21021 62025002
         MVC   0(L6,R3),BLANKS          CLEAR OUT HEX 2NDARY CUA S21021 62100002
         MVC   XR9PTR(L8),SHRTADCN      MOVE IN NEW A POINTERS   S21021 62175002
         BR    R14                                               S21021 62250002
*                                                                S21021 62325002
EXPNDRTN STM   R5,R8,XSAVE                                       S21021 62400002
         ST    R2,SAVE2                 SAVE R2 FOR LATER        S21021 62475002
         LA    R5,OBRAREA               PICK UP EXPANDED AREA    S21021 62550002
         USING EXPNOBR,R5                                        S21021 62625002
         USING NORMOBR,R4                                        S21021 62700002
         XC    EXPNOBR(L104),EXPNOBR    CLEAR AREA               S21021 62775002
         TM    SW2B0,HEX20              IS IT A SHORT REC        S21021 62850002
         BO    MOVESHRT                 BR-YES                   S21021 62925002
         TM    XDUM1,HEX02              IS IT A CONVERTED REC    S21021 63000002
         BO    MOVEALL                                           S21021 63075002
         MVC   EXPNHDRA(L64),NORMHDRA   EXPAND RECORD TO CONVERTES21021 63150002
         MVC   EXPNSDRA(L10),NORMSDRA                            S21021 63225002
         MVC   EXPNSNSA(L6),NORMSNSA                             S21021 63300002
         MVI   DMPSIZE+L1,DMP80         DUMP 80 BYTES                   63375002
         MVI   DMPSIZE1+L1,DMP80                                        63450002
EXPNDRET LR    R2,R5                    SWAP POINTERS            S21021 63525002
         B     RETURN                                            S21021 63600002
MOVEALL  MVC   EXPNOBR(L104),NORMOBR    MOVE ENTIRE RECORD       S21021 63675002
         MVI   DMPSIZE+L1,DMP104        DUMP 104 BYTES                  63750002
         MVI   DMPSIZE1+L1,DMP104                                       63825002
         B     EXPNDRET                                          S21021 63900002
         USING SHRTOBR,R4                                        S21021 63975002
MOVESHRT MVC   EXPNHDRA(L24),SHRTHDRA   MOVE HEADER              S21021 64050002
         MVC   EXPNDEVA(L8),SHRTDEVA                             S21021 64125002
         MVC   EXPNSDRA(L10),SHRTSDRA                            S21021 64200002
         B     EXPNDRET                                          S21021 64275002
*                                                                S21021 64350002
*                                                                S21021 64425002
RECTYPE  STM   R5,R8,XSAVE                                       S21021 64500002
         LR    R5,R3                    SET UP DATA SLOT FOR TYPES21021 64575002
         LA    R6,L31                                            S21021 64650002
         SR     R5,R6                                            S21021 64725002
         TM    0(R4),HEX20              SHORT RECORD?            S21021 64800002
         BO    RECSHORT                                          S21021 64875002
         MVC   0(L10,R5),UNITCK         INSERT DATA 'UNIT CHECK' S21021 64950002
         B     RETURN                                            S21021 65025002
RECSHORT MVC   0(L10,R5),OVFL           DATA = 'OVERFLOW'        S21021 65100002
         B     RETURN                                            S21021 65175002
SETSTLBL DS    0H                       SET LABELS FOR STAT COUNTS21021 65250002
         STM   R5,R8,XSAVE              SAVE REGS                S21021 65325002
         LA    R6,L2                    SET BCT COUNT            S21021 65400002
         L     R5,XLABELP               GET CURRENT LABEL PNTR   S21021 65475002
         LA    R7,L6                    NUMBER OF LISTS                 65550002
         LA    R8,STLBLIST              POINT TO FIRST LABEL ENTRS21021 65625002
STLBCOMP CLC   XDEVT2(L2),0(R8)         IS THIS THE DEVICE TYPE? S21021 65700002
         BE    STLBLTFD                 YES, GO MOVE LABELS      S21021 65775002
         LA    R8,L18(R8)          NO, BUMP POINTER              S21021 65850002
         BCT   R7,STLBCOMP              REPEAT NUMBER OF LISTS   S21021 65925002
         LA    R8,STLBDFLT              NOT FOUND, USE DEFAULT   S21021 66000002
STLBLTFD DS    0H                  LABELS FOUND                  S21021 66075002
         LA    R8,L2(R8)                USE LABELS               S21021 66150002
         LA    R7,L16(R8)               DETERMINE END POINT      S21021 66225002
         ST    R7,STLBLEND              SAVE FOR COMPARE         S21021 66300002
STLABLP  DS    0H                                                S21021 66375002
         LA    R6,L2                    RESET BCT                S21021 66450002
         TM    SW2B0,HEX20              IS THIS A SHORT RECORD   S21021 66525002
         BO    STLBSHRT                 YES, NO UNIT STATUS      S21021 66600002
         LA    R5,L34(R5)               BUMP PAST UNIT STATUS    S21021 66675002
STLBSHRT DS    0H                                                S21021 66750002
         CLI   0(R8),XFF                IS THIS 'NOT USED'       S21021 66825002
         BE    STLBLNUS                 YES, LABEL = 'NOT USED'  S21021 66900002
         SR    R7,R7                    CLEAR R7                 S21021 66975002
         IC    R7,0(R8)                 GET INDEX TO LABEL       S21021 67050002
         MH    R7,HW13                  MULTIPLY TO GET LABEL    S21021 67125002
         A     R7,SLTABAD               PT TO LABEL IN TABLE     S21021 67200002
         MVC   L0(L13,R5),L0(R7)        MOVE IN LABEL            S21021 67275002
         B     STLBL001                                          S21021 67350002
STLBLNUS DS    0H                                                S21021 67425002
         MVC   L0(L13,R5),STLBNTUS      'NOT USED' LABEL         S21021 67500002
STLBL001 DS    0H                                                S21021 67575002
         LA    R5,L14(R5)               BUMP R5                  S21021 67650002
         LA    R8,L1(R8)                POINT TO NEXT INDEX      S21021 67725002
         BCT   R6,STLBSHRT              DO AGAIN                 S21021 67800002
         C     R8,STLBLEND              AT END OF LIST?          S21021 67875002
         BNE   STLABLP                  NO, CONTINUE             S21021 67950002
         B     RETURN                                            S21021 68025002
         DROP  R4,R5                                             S21021 68100002
*                                                                S21021 68175002
WORK     DS    D                                                 S21021 68250002
SAVE2    DS    F                                                 S21021 68325002
SHRTADCN DC    A(SHRTOBRS-L4)                                    S21021 68400002
         DC    A(SHRTOBRL)                                       S21021 68475002
OBRAREA  DS    CL104                                             S21021 68550002
SLTABAD  DC    A(SLTABL)                                         S21021 68625002
SLTABL   DS    0C                                                S21021 68700002
         DC    C'TEMPY READS  '         00                       S21021 68775002
         DC    C'TEMPY WRITES '         01                       S21021 68850002
         DC    C'INTRVN REQD  '         02                       S21021 68925002
         DC    C'BUS OUT CHK  '         03                       S21021 69000002
         DC    C'EQUIP CHK    '         04                       S21021 69075002
         DC    C'OVERRUN      '         05                       S21021 69150002
         DC    C'UNUSL CMD SEQ'         06                       S21021 69225002
         DC    C'CHAN DATA CHK'         07                       S21021 69300002
         DC    C'AUTO-SELECT  '         08                       S21021 69375002
         DC    C'CRT PROTECT  '         09                       S21021 69450002
         DC    C'NON RECVY    '                                         69451002
         DC    C'LATE STKR SEL'                                         69452002
BLANKS   DC    CL25' '                                           S21021 69525002
UNITCK   DC    C'UNIT CHECK'                                     S21021 69600002
OVFL     DC    C'OVERFLOW  '                                     S21021 69675002
MPCPU    DC    C'MULTIPROCESSOR - CPU'                           S21021 69750002
JOBID    DC    C'JOB IDENTITY'                                   S21021 69825002
HW21     DC    H'21'                                             S21021 69900002
STLBNTUS DC    C'NOT USED     '                                  S21021 69975002
STLBLIST DS    0C                                                S21021 70050002
         DC    X'080A'                                           S21021 70125002
         DC    X'000102030406FFFFFFFFFFFFFFFFFF07' 1443 STAT LABES21021 70200002
         DC    X'0810'                                           S21021 70275002
         DC    X'0001020304FFFFFFFFFFFFFFFFFFFF07' 2671          S21021 70350002
         DC    X'081A'                                           S21021 70425002
         DC    X'0001020304050AFFFFFFFFFFFFFFFF07'     1285             70500002
         DC    X'081D'                                           S21021 70575002
         DC    X'00010203040508FFFFFFFFFFFFFFFF07'     1419 2 BYTE      70650002
STLBDFLT DS    0C                                                S21021 70725002
         DC    X'081E'                                           S21021 70800002
         DC    X'00010203040B08FFFFFFFFFFFFFFFF07'     1419 1 BYTE      70875002
         DC    X'081F'                                                  70895002
         DC    X'00010203040508FFFFFFFFFFFFFFFF07'     1275 2 BYTE      70915002
HW13     DC    H'13'                                             S21021 70950002
STLBLEND DC    F'0'                                              S21021 71025002
*                                                                       71100002
         DS    0F                                                       71175002
XSAVE    DC    5F'0'                                                    71250002
NONE     DC    CL6'NONE  '                                              71325002
CHARS    DC    C'0123456789ABCDEF'                                      71400002
CHAR0    DC    C'0'                                                     71475002
UNIVERS  DC    C'UNIVERSAL   SERIAL NO. NONE  '                  S21021 71550002
SERNO    DC    C'SERIAL NO.'                                     S21021 71625002
CLABEL1  EQU   *                                                        71700002
         DC    CL10'BIT  3   $'                                         71775002
         DC    CL10'BIT  4   $'                                         71850002
         DC    CL10'LATE STK $'                                         71925002
         DC    CL10'AUTO SEL $'                                         72000002
         DC    CL10'OPER ATTN$'                                         72075002
CLABEL3  EQU   *                                                        72150002
         DC    CL10'EQUIP CHK$'                                         72225002
         DC    CL10'TBAR SEL $'                                         72300002
         DC    CL10'TBAR SEL $'                                         72375002
         DC    CL10'CHAN 9   $'                                         72450002
         DC    CL10'CHAN 12  $'                                         72525002
CLABEL4  EQU   *                                                        72600002
         DC    CL10'EQUIP CHK$'                                         72675002
         DC    CL10'DATA CHK $'                                         72750002
         DC    CL10'OVERRUN  $'                                         72825002
         DC    CL10'NON RECVY$'                                         72900002
         DC    CL10'KB CORRTN$'                                         72975002
         DS    0F                                                       73050002
DEVTABLE DC    X'0810'                                                  73125002
         DC              C'2671'                                        73200002
         DC    X'080A'                                                  73275002
         DC              C'1443'                                        73350002
         DC    X'081A'                                                  73425002
         DC              C'1285'                                        73500002
         DC    X'081D'                                                  73575002
         DC         C'1419'                                             73650002
         DC    X'081E'                                                  73725002
         DC              C'1419'                                        73800002
         DC    X'081F'                                                  73875002
         DC         C'1275'                                             73950002
*                                                                       74025002
RELTAB   DS    0C                                              @L03976  74100002
         DC    C'OS  '                                         @L03976  74150002
         DC    C'DOS '                                         @L03976  74200002
         DC    C'VS 1'                                         @L03976  74250002
         DC    C'V370'                                         @L03976  74300002
         DC    C'VS 2'                                         @L03976  74350002
         DC    C'    '                                         @L03976  74400002
         DC    C'    '                                         @L03976  74450002
         DC    C'    '                                         @L03976  74500002
*                       TABLE CONSTANTS                                 74550002
ENTRIES  DS    0F                                                       74625002
         DC    XL4'00010001'            FORMAT1                         74700002
         DC    XL4'00010001'            FORMAT2                         74775002
         DC    A(LABELS)                LABEL PTR                       74850002
         DC    H'0'                     DISP                            74925002
*                                                                       75000002
*        SKIP TO CHANNEL 1                                              75075002
*                                                                       75150002
         DC    X'02'                                             S21021 75225002
         DC         X'000B8B00'    SKIP TO CHANNEL 1                    75300002
         DC    AL.12(XDUM1-XXX3),XL.4'D'  = ROUTINE XDUM1,EXPNDRTS21021 75375002
         DC    AL.4(0),AL.12(EXPNDRTN-IFCEXXX3)                  S21021 75450002
*                                                                       75525002
*                                                                       75600002
         LINE  (55,23),(1,35),SKIP=1                             S21021 75675002
         ROUTINE  SW2B0,RECTYPE                                  S21021 75750002
         HEX   XMODEL,0,2B                                       S21021 75825002
         HEX   XSER,0,3B                                         S21021 75900002
         ROUTINE XMODEL,SETCPUNO                                 S21021 75975002
         LABEL '---RECORD ENTRY TYPE -','   SOURCE - OUTBOARD',  S21021X76050002
               'MODEL-'                                          S21021 76125002
         LINE  (16,1),(4,1)                                      S21021 76200002
         ROUTINE    XRELN,CONVREL                                       76275002
         LABEL      'XXXX REL.'                                         76350002
         LINE  (69,1),(31,19)                                    S21021 76425002
         ROUTINE XPGN1,SETPGMN                                   S21021 76500002
         LABEL 'DAY YEAR','HH MM SS.TH'                          S21021 76575002
         LINE  (31,19),(25,19)                                   S21021 76650002
         ROUTINE XDATE,SETDATE                                   S21021 76725002
         HEX   XTIME,1,4B                                        S21021 76800002
         ROUTINE  XDUM1,SKIPPER                                  S21021 76875002
         HEX   XPGN1,B6,4B                                       S21021 76950002
         HEX   XPGN2,B16,4B                                      S21021 77025002
         ROUTINE  SW2B0,NONAME                                   S21021 77100002
         LABEL 'DATE-','TIME-'                                   S21021 77175002
         LINE  (1,1),(1,1)                                       S21021 77250002
         ROUTINE SW2B0,TESTMP                                    S21021 77325002
         LABEL ''                                                S21021 77400002
         LINE  ,(1,1),SKIP=2                                     S21021 77475002
         ROUTINE XDUM1,SETCONV                                   S21021 77550002
         LABEL 'OBR RECORD CONVERTED TO THE STANDARD FORMAT'     S21021 77625002
         LINE  (34,1),(2,1),SKIP=1                               S21021 77700002
         ROUTINE XDEVT2,SETDEVTY                                 S21021 77775002
         LABEL 'DEVICE TYPE'                                     S21021 77850002
         LINE                                                    S21021 77925002
         HEX   XCUA,B0,3B                                        S21021 78000002
         LABEL 'PRIMARY   CHANNEL UNIT ADDRESS'                  S21021 78075002
         LINE                                                    S21021 78150002
         HEX   XCUA2,B0,3B                                       S21021 78225002
         ROUTINE  XDUM1,TESTSHRT        IF SHORT REC, GO TO STATSS21021 78300002
         LABEL 'ALTERNATE CHANNEL UNIT ADDRESS  '                S21021 78375002
         LINE                                                    S21021 78450002
         LABEL ' '                                               S21021 78525002
         LINE  (1,1),(23,38)                                     S21021 78600002
         LABEL 'CC   CA   FL     CT','K    CA   US CS  CT'       S21021 78675002
         LINE  (23,3),(5,51),SKIP=2                              S21021 78750002
         HEX   XFCCWCC,0,1B                                      S21021 78825002
         HEX   XFCCWDA,0,3B                                      S21021 78900002
         ROUTINE  XDUM1,SPACER1                                  S21021 78975002
         HEX   XFCCWFL,0,1B                                      S21021 79050002
         HEX   XZERO,0,1B                                        S21021 79125002
         HEX   XFCCWCT,0,2B                                      S21021 79200002
         ROUTINE  XDUM1,SPACER16                                 S21021 79275002
         HEX   XCSWK,0,1B                                        S21021 79350002
         HEX   XCSWCA,0,3B                                       S21021 79425002
         ROUTINE  XDUM1,SPACER1                                  S21021 79500002
         ROUTINE XCSWATTN,SETHEX                                 S21021 79575002
         ROUTINE XCSWPCI,SETHEX                                  S21021 79650002
         HEX   XCSWCT,0,2B                                       S21021 79725002
         LABEL 'FAILING CCW','CSW'                               S21021 79800002
*                                                                       79875002
         LINE  ,(5,28)                                           S21021 79950002
         LABEL 'UNIT STATUS','CHANNEL STATUS',                   S21021X80025002
               'STATISTICAL DATA','STATISTICAL DATA'             S21021 80100002
*                                                                       80175002
*                     CSW DETAIL  OF US & CS FIELDS                     80250002
*                                                                       80325002
         LINE  (20,28),(3,28),SKIP=1                             S21021 80400002
         BIN        XCSWATTN                                            80475002
         BIN        XCSWPCI                                             80550002
         ROUTINE    SDR1,SDRCONVL                                S21021 80625002
         ROUTINE    SDR1,SDRCONVR                                S21021 80700002
         ROUTINE XDUM1,SETSTLBL         SET STATISTICS LABELS    S21021 80775002
         LABEL 'ATTENTION       ','PRGM-CTLD TRPT  ',            S21021X80850002
               '             ','             '                   S21021 80925002
         LINE                                                           81000002
         BIN        XCSWSM                                              81075002
         BIN        XCSWSILI                                            81150002
         ROUTINE    SDR2,SDRCONVL                                S21021 81225002
         ROUTINE    SDR2,SDRCONVR                                S21021 81300002
         LABEL 'STATUS MODIFIER ','INCORRECT LENGTH',            S21021X81375002
               '             ','             '                   S21021 81450002
         LINE                                                           81525002
         BIN        XCSWCUE                                             81600002
         BIN        XCSWPC                                              81675002
         ROUTINE    SDR3,SDRCONVL                                S21021 81750002
         ROUTINE SDR3,SDRCONVR                                   S21021 81825002
         LABEL 'CONTROL UNIT END','PROGRAM CHECK   ',            S21021X81900002
               '             ','             '                   S21021 81975002
         LINE                                                           82050002
         BIN        XCSWBSY                                             82125002
         BIN        XCSWPCHK                                            82200002
         ROUTINE SDR4,SDRCONVL                                   S21021 82275002
         ROUTINE SDR4,SDRCONVR                                   S21021 82350002
         LABEL 'BUSY            ','PROTECTION CHECK',            S21021X82425002
               '             ','             '                   S21021 82500002
         LINE                                                           82575002
         BIN        XCSWCE                                              82650002
         BIN        XCSWCDC                                             82725002
         ROUTINE SDR5,SDRCONVL                                   S21021 82800002
         ROUTINE SDR5,SDRCONVR                                   S21021 82875002
         LABEL 'CHANNEL END     ','CHAN DATA CHECK ',            S21021X82950002
               '             ','             '                   S21021 83025002
         LINE                                                           83100002
         BIN        XCSWDE                                              83175002
         BIN        XCSWCCC                                             83250002
         ROUTINE SDR6,SDRCONVL                                   S21021 83325002
         ROUTINE SDR6,SDRCONVR                                   S21021 83400002
         LABEL 'DEVICE END      ','CHAN CTL CHECK  ',            S21021X83475002
               '             ','             '                   S21021 83550002
         LINE                                                           83625002
         BIN        XCSWUC                                              83700002
         BIN        XCSWICC                                             83775002
         ROUTINE SDR7,SDRCONVL                                   S21021 83850002
         ROUTINE SDR7,SDRCONVR                                   S21021 83925002
         LABEL 'UNIT CHECK      ','I/F CTL CHECK   ',            S21021X84000002
               '             ','             '                   S21021 84075002
         LINE                                                           84150002
         BIN        XCSWUE                                              84225002
         BIN        XCSWCH                                              84300002
         ROUTINE SDR8,SDRCONVL                                   S21021 84375002
         ROUTINE SDR8,SDRCONVR                                   S21021 84450002
         LABEL 'UNIT EXCEPTION  ','CHAINING CHECK  ',            S21021X84525002
               '             ','             '                   S21021 84600002
*                                                                       84675002
*                   CHECK FOR DEV TYPE 081E                             84750002
*                   RETURN THIS SECT IF NOT                             84825002
*                   GOTO M14192 SECT IF IT IS                           84900002
*                                                                       84975002
         LINE       (1,1),(1,1),SKIP=2                                  85050002
         ROUTINE    XDEVT2,SETR9                                        85125002
         LABEL      ' '                                                 85200002
         LINE  ,,SKIP=2                                          S21021 85275002
         ROUTINE    XDUM1,SKIPPER                                       85350002
         LABEL      'SENSE BYTE DATA'                                   85425002
*                                                                       85500002
*                                                                       85575002
         LINE  (11,1),(1,1),SKIP=2                               S21021 85650002
         ROUTINE  XB0CMDR,SETHEX                                 S21021 85725002
         LABEL      'BYTE 0'                                            85800002
*                                       STATUS BYTE                     85875002
         LINE       (11,1),(1,10),SKIP=1                                85950002
         BIN        XB0CMDR                                             86025002
         LABEL      'CMND REJ'                                          86100002
         LINE                                                           86175002
         BIN        XB0INTRQ                                            86250002
         LABEL      'INTV REQD'                                         86325002
         LINE                                                           86400002
         BIN        XB0BUSC                                             86475002
         LABEL      'BUS O CHK'                                         86550002
         LINE                                                           86625002
         BIN        XB0ECHK                                             86700002
         ROUTINE    XDEVT2,SETLABEL          SET LABELS FOR DIFF DEV    86775002
         LABEL      'EQUIP CHK'                                         86850002
         LINE                                                           86925002
         BIN        XB0DCHK                                             87000002
         LABEL      'DATA CHK '                                         87075002
         LINE                                                           87150002
         BIN        XB0BIT5                                             87225002
         LABEL      'BIT  5   '                                         87300002
         LINE                                                           87375002
         BIN        XB0BIT6                                             87450002
         LABEL      'BIT  6   '                                         87525002
         LINE                                                           87600002
         BIN        XB0BIT7                                             87675002
         LABEL  'BIT  7   '                                             87750002
         LINE                                                           87825002
         LABEL      ' '                                                 87900002
         LINE                                                           87975002
         ROUTINE    XDUM1,RESETR2                                       88050002
         LABEL      ' '                                                 88125002
         DC    X'FF'                    END OF TABLE                    88200002
DMPSIZE1 DC    XL2'0000'                                                88275002
         DC    XL2'0018'                                                88350002
         DC    XL2'0000'                                                88425002
         LINE       ,,SKIP=2                                            88500002
M14192   LINE                                                           88575002
         ROUTINE    XDUM1,SKIPPER                                       88650002
TWOSENSE LABEL ''                                                S21021 88725002
*                                                                       88800002
         LINE  ,,SKIP=2                                          S21021 88875002
         ROUTINE    XDUM1,SKIPPER                                       88950002
         LABEL      'SENSE BYTE DATA'                                   89025002
         LINE  (11,18),(1,18),SKIP=2                             S21021 89100002
         ROUTINE  XB0CMDR,SETHEX                                 S21021 89175002
         ROUTINE  XB1FLD6,SETHEX                                 S21021 89250002
         LABEL      'BYTE 0','BYTE 1'                                   89325002
*                                                                       89400002
*                   DETAILED PRINT OF SENSE                             89475002
*                                                                       89550002
         LINE  ,,SKIP=1                                          S21021 89625002
         BIN        XB0CMDR                                             89700002
         BIN        XB1FLD6                                             89775002
         LABEL      'CMND REJ','FLD 6 VAL'                              89850002
         LINE                                                           89925002
         BIN        XB0INTRQ                                            90000002
         BIN        XB1FLD7                                             90075002
         LABEL      'INTV REQD','FLD 7 VAL'                             90150002
         LINE                                                           90225002
         BIN        XB0BUSC                                             90300002
         BIN        XB1DOCUN                                            90375002
         LABEL      'BUS O CHK','DOC UN HD'                             90450002
         LINE                                                           90525002
         BIN        XB0ECHK                                             90600002
         BIN        XB1AFVAL                                            90675002
         LABEL      'BIT 3','AF VALID'                                  90750002
         LINE                                                           90825002
         BIN        XB0DCHK                                             90900002
         BIN        XB1PCF                                              90975002
         LABEL      'DATA CHK','PCF VALID'                              91050002
         LINE                                                           91125002
         BIN        XB0BIT5                                             91200002
         BIN        XB1ACCVL                                            91275002
         LABEL      'OVERRUN','ACC VALID'                               91350002
         LINE                                                           91425002
         BIN        XB0BIT6                                             91500002
         BIN        XB1TFVAL                                            91575002
         LABEL      'AUTO SEL','TF VALID'                               91650002
         LINE                                                    S21021 91725002
         BIN        XB0BIT7                                             91800002
         BIN        XB1SERV                                             91875002
         ROUTINE    XDUM1,RESETR2                                S21021 91950002
         LABEL      'BIT  7','SER VALID'                                92025002
         LINE  ,,SKIP=2                                          S21021 92100002
         LABEL ''                                                S21021 92175002
         LINE  ,,SKIP=1                                          S21021 92250002
         LABEL ''                                                S21021 92325002
         DC         X'FF'               END OF  TWO BYTE SECT           92400002
DMPSIZE  DC    XL2'0000'                SIZE TO DUMP, VARIES            92475002
         DC    XL2'0018'                                                92550002
         DC    X'0018'                                           S21021 92625002
SHRTOBRL LABEL      ''                                           S21021 92700002
SHRTOBRS LINE  ,(1,1),SKIP=2                                     S21021 92775002
         ROUTINE    XDUM1,SKIPPER                                S21021 92850002
         LABEL      'STATISTICAL DATA'                           S21021 92925002
*                                                                S21021 93000002
         LINE       (21,30),(1,30),SKIP=1                        S21021 93075002
         ROUTINE    SDR1,SDRCONVL                                S21021 93150002
         ROUTINE    SDR1,SDRCONVR                                S21021 93225002
         ROUTINE XDUM1,SETSTLBL         SET STATISTICS LABELS    S21021 93300002
         LABEL '             ','             '                   S21021 93375002
*                                                                S21021 93450002
         LINE                                                    S21021 93525002
         ROUTINE    SDR2,SDRCONVL                                S21021 93600002
         ROUTINE    SDR2,SDRCONVR                                S21021 93675002
         LABEL '             ','             '                   S21021 93750002
         LINE                                                    S21021 93825002
         ROUTINE    SDR3,SDRCONVL                                S21021 93900002
         ROUTINE SDR3,SDRCONVR                                   S21021 93975002
         LABEL '             ','             '                   S21021 94050002
         LINE                                                    S21021 94125002
*                                                                S21021 94200002
         ROUTINE SDR4,SDRCONVL                                   S21021 94275002
         ROUTINE SDR4,SDRCONVR                                   S21021 94350002
         LABEL '             ','             '                   S21021 94425002
         LINE                                                    S21021 94500002
         ROUTINE SDR5,SDRCONVL                                   S21021 94575002
         ROUTINE SDR5,SDRCONVR                                   S21021 94650002
         LABEL '             ','             '                   S21021 94725002
         LINE                                                    S21021 94800002
         ROUTINE SDR6,SDRCONVL                                   S21021 94875002
         ROUTINE SDR6,SDRCONVR                                   S21021 94950002
         LABEL '             ','             '                   S21021 95025002
         LINE                                                    S21021 95100002
         ROUTINE SDR7,SDRCONVL                                   S21021 95175002
         ROUTINE SDR7,SDRCONVR                                   S21021 95250002
         LABEL '             ','             '                   S21021 95325002
         LINE                                                    S21021 95400002
         ROUTINE SDR8,SDRCONVL                                   S21021 95475002
         ROUTINE SDR8,SDRCONVR                                   S21021 95550002
         LABEL '             ','             '                   S21021 95625002
         LINE                                                    S21021 95700002
         ROUTINE    XDUM1,RESETR2                                S21021 95775002
         LABEL      ''                                           S21021 95850002
*                                                                S21021 95925002
         DC         X'FF'                                        S21021 96000002
         DC         X'0028'                                      S21021 96075002
         DC         X'0018'                                      S21021 96150002
         DC    X'0018'                                           S21021 96225002
*                                                                S21021 96300002
*                                                                       96375002
LABELS   DS    0F                                                       96450002
         DC    C'$'                                                     96525002
         LSTART                                                         96600002
         END                                                            96675002
