         TITLE 'IFCEGUS1 - EDIT TABLE - LINKNAME=IFCEGUS1'              00050042
*                                                                       00100042
*********************************************************************** 00150042
*  DSGEN MACRO DSGEN MACRO DSGEN MACRO DSGEN MACRO DSGEN MACRO          00200042
         MACRO                                                          00250042
&NAME    DSGEN ,                                                        00300042
.*                            THIS MACRO GENERATES ONE DSECT WORD       00350042
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 00400042
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  00450042
.*                                 FIRST IS THE NAME OF THE LOG ITEM    00500042
.*                                 WHILE THE SECOND IS THE # OF BITS TO 00550042
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   00600042
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 00650042
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      00700042
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  00750042
.*                                 THE LOG ITEMS MAY THEN BE USED IN    00800042
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   00850042
         GBLA  &BITS(2600),&DB,&DT,&INITIAL                             00900042
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  00950042
         GBLA  &ITEMNDX(2600),&ITEMXPT                                  01000042
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              01050042
         GBLA  &NRENTS,&SHIFT(2600)                                     01100042
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           01150042
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(2600)                       01200042
         GBLC  &LABELS(2600),&LBL(100),&NRENTSX                         01250042
         LCLB  &ONLY1,&CTIND                                            01300042
         LCLA  &START1,&START2,&END1,&END2                              01350042
         LCLC  &SYMBOL,&EQUSYM                                          01400042
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 01450042
         ACTR  500000                                                   01500042
         AIF   (&ITEMITR EQ 0).START                                    01550042
 MNOTE   20,'DSGEN MACRO OCCURRS AFTER ITEMSORT MACRO HAS BEEN ISSUED.' 01600042
         MEXIT                                                          01650042
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            01700042
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     01750042
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   01800042
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        01850042
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1            01900042
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT             01950042
         AGO   .SET2A                   BRANCH AROUND                   02000042
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        02050042
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              02100042
         MEXIT                                                          02150042
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X02200042
               ).SET2                   TEST FOR NO SECOND              02250042
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   02300042
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2            02350042
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2              02400042
         AGO   .LOOP                                                    02450042
.SET2    ANOP                                                           02500042
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 02550042
         AGO   .LOOP                                                    02600042
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             02650042
         MEXIT                                                          02700042
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               02750042
         MEXIT                                                          02800042
.LOOP    ANOP                                                           02850042
&OP      SETA  &OP+1                                                    02900042
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           02950042
&ITEMNBR SETA  &ITEMNBR+1                                               03000042
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            03050042
         MNOTE '**NULL BIT COUNT FIELD**'                               03100042
         MEXIT                                                          03150042
.OK1     ANOP                                                           03200042
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        03250042
         AIF   ('&SYMBOL' NE '').OK                                     03300042
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         03350042
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                         03400042
         AGO   .START                   GET NEXT                        03450042
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        03500042
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU          03550042
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        03600042
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         03650042
         AGO   .NO3                     BRANCH AROUND                   03700042
.OK2     ANOP                                                           03750042
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED              03800042
.NO3     ANOP                                                           03850042
&SYMBOL  EQU   *+&BYTE                                                  03900042
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL             03950042
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    04000042
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    04050042
.CNT     ANOP                                                           04100042
&CTIND   SETB  1                        SET COUNT INDICATOR             04150042
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   04200042
&BYTE    SETA  &COUNT/8                                                 04250042
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        04300042
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        04350042
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             04400042
&END1    SETA  &END1+1                  INCREMENT COUNT                 04450042
&OP      SETA  &OP-1                    DECREMENT INCREMENT             04500042
         AGO   .LOOP                    GENERATE NEXT                   04550042
.TSTST   ANOP                                                           04600042
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END               04650042
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        04700042
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      04750042
.NSET1   ANOP                                                           04800042
&OP      SETA  &OP-1                    DECREMENT INDEX                 04850042
&START1  SETA  &START1+1                INCREMENT FIRST COUNT           04900042
         AGO   .LOOP                    GO DO NEXT                      04950042
.LPDONE  ANOP                                                           05000042
&ONLY1   SETB  0                        CLEAR INDICATOR                 05050042
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      05100042
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 05150042
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT               05200042
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES             05250042
&NAME    DS    &COUNT.C                                                 05300042
.END     MEXIT                                                          05350042
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          05400042
         MEXIT                                                          05450042
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   05500042
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   05550042
         MEXIT                                                          05600042
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         05650042
*****               THE FOLLOWING STATEMENT                *****        05700042
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        05750042
.EQU2    ANOP                                                           05800042
&EQUCNT  SETA  0                        CLEAR COUNTER                   05850042
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND                 05900042
.EQULOP  ANOP                                                           05950042
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX                 06000042
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     06050042
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?                06100042
         AGO   .EQULOP                  NO-GET NEXT                     06150042
.EQUOUT  ANOP                                                           06200042
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME                  06250042
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS              06300042
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT                 06350042
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED             06400042
         AGO   .START                   RETURN FOR NEXT                 06450042
         MEND                                                           06500042
*                                                                       06550042
*********************************************************************** 06600042
* HEX MACRO  HEX MACRO  HEX MACRO  HEX MACRO  HEX MACRO  HEX MACRO      06650042
         MACRO                                                          06700042
         HEX   ,                                                        06750042
.*                            THIS MACRO FACILITATES GENERATION OF THE  06800042
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    06850042
.*                                 CONVERSIONS.                         06900042
.*                            &SYSLIST(&OP,1) - NAME OF DATA ITEM TO BE 06950042
.*                                 CONVERTED                            07000042
.*                            &SYSLIST(&OP,2) - # OF SPACES TO SKIP ON  07050042
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   07100042
.*                                 BACK UP FROM COLUMN FOR START OF     07150042
.*                                 PRINTING. THE LETTER B PRECEEDS THE  07200042
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  07250042
.*                                 DESIRED. OMISSION OF THIS OPERAND    07300042
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  07350042
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  07400042
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 07450042
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    07500042
.*                                 IMPLICITLY B).                       07550042
.*                            &SYSLIST(&OP,3) - NUMBER OF BYTES TO      07600042
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     07650042
.*                                 WITH AN L,R, OR B TO STIPULATE       07700042
.*                                 PRINTING OF THE LEFT HALF, RIGHT     07750042
.*                                 HALF, OR BOTH HALVES OF THE BYTE     07800042
.*                                 RESPECTIVELY. OMISSION OF THIS       07850042
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  07900042
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 07950042
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 08000042
.*                                 SARY. THIS MACRO MUST BE THE FIRST   08050042
.*                                 MACRO INSTRUCTION ISSUED FOR THE     08100042
.*                                 SUBJECT LINE(S).                     08150042
         GBLA  &BITS(2600),&DB,&DT,&INITIAL                             08200042
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  08250042
         GBLA  &ITEMNDX(2600),&ITEMXPT                                  08300042
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              08350042
         GBLA  &NRENTS,&SHIFT(2600)                                     08400042
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           08450042
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(2600)                       08500042
         GBLC  &LABELS(2600),&LBL(100),&NRENTSX                         08550042
         LCLB  &B,&SUB                                                  08600042
         LCLA  &IBITS,&ISHIFT,&K,&T,&CODE,&BYTESP,&OP                   08650042
         LCLC  &S,&LETTER,&ARG                                          08700042
       ACTR  500000                                                     08750042
         AIF   (&DIAGTST EQ 0).NOMSG                                    08800042
         AIF   (&INITIAL EQ 0).NOMSG                                    08850042
         AIF   (&DIAGLIN EQ 1).NOMSG                                    08900042
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  08950042
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     09000042
*        LINE                                                           09050042
         LINE                                                           09100042
.NOMSG   ANOP                                                           09150042
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  09200042
&SUB     SETB  1                                                        09250042
.LOOP    ANOP                                                           09300042
&OP      SETA  &OP+1                                                    09350042
&ARG     SETC  '&SYSLIST(&OP,1)'                                        09400042
         ITEMFIND  &ARG                                                 09450042
         AIF   (&ITEMXPT EQ 0).MEXIT                                    09500042
.FOUND   ANOP                                                           09550042
&ISHIFT  SETA  &SHIFT(&ITEMXPT)                                         09600042
&IBITS   SETA  &BITS(&ITEMXPT)                                          09650042
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).ALIGN                     09700042
.ERR     MNOTE '**DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY**'          09750042
.MEXIT   MEXIT                                                          09800042
.ALIGN   ANOP                                                           09850042
&CODE    SETA  1                                                        09900042
         AIF   (&SUB EQ 1).SUBA                                         09950042
&K       SETA  K'&SYSLIST(3)                                            10000042
         AGO   .SUBB                                                    10050042
.SUBA    ANOP                                                           10100042
&K       SETA  K'&SYSLIST(&OP,3)                                        10150042
.SUBB    ANOP                                                           10200042
         AIF   (&K EQ 1).ERR3                                           10250042
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            10300042
         MNOTE '**BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL**' 10350042
         MEXIT                                                          10400042
.OK      AIF   (&SUB EQ 1).SUBC                                         10450042
         AIF   ('&SYSLIST(3)' EQ '').USEDEFN                            10500042
&LETTER  SETC  '&SYSLIST(3)'(&K,1)                                      10550042
&S       SETC  '&SYSLIST(3)'(1,&K-1)                                    10600042
         AGO   .SUBD                                                    10650042
.SUBC    ANOP                                                           10700042
         AIF   ('&SYSLIST(&OP,3)' EQ '').USEDEFN                        10750042
&LETTER  SETC  '&SYSLIST(&OP,3)'(&K,1)                                  10800042
&S       SETC  '&SYSLIST(&OP,3)'(1,&K-1)                                10850042
.SUBD    ANOP                                                           10900042
&BYTESP  SETA  &S                                                       10950042
         AIF   ('&LETTER' EQ 'B').BOTH                                  11000042
         AIF   ('&LETTER' EQ 'L').LEFT                                  11050042
         AIF   ('&LETTER' EQ 'R').RIGHT                                 11100042
.ERR3    MNOTE '**PARAMETER 3 INCOMPLETE-DSGEN DEFINITION USED**'       11150042
         AGO   .USEDEFN                                                 11200042
.RIGHT   ANOP                                                           11250042
&CODE    SETA  2                                                        11300042
         AGO   .L                                                       11350042
.LEFT    ANOP                                                           11400042
&CODE    SETA  1                                                        11450042
         AGO   .L                                                       11500042
.USEDEFN ANOP                                                           11550042
&BYTESP  SETA  &IBITS/8                                                 11600042
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       11650042
&CODE    SETA  3                                                        11700042
&T       SETA  &BYTESP*2-1                                              11750042
&S       SETC  '&T'                                                     11800042
.OK2     AIF   (&ISHIFT EQ 0).L                                         11850042
&CODE    SETA  2                                                        11900042
.L       ANOP                                                           11950042
&B       SETB  1                                                        12000042
         AIF   (&SUB EQ 1).SUBE                                         12050042
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             12100042
&K       SETA  K'&SYSLIST(2)                                            12150042
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              12200042
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                12250042
         AGO   .SUBF                                                    12300042
.SUBE    ANOP                                                           12350042
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         12400042
&K       SETA  K'&SYSLIST(&OP,2)                                        12450042
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          12500042
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            12550042
.SUBF    ANOP                                                           12600042
.BACKUP  ANOP                                                           12650042
&NRENTS  SETA  &NRENTS+1                                                12700042
         AIF   (&BYTESP GT 0 AND &BYTESP LT 16).SUB0                    12750042
         MNOTE '**NO. OF BYTES OUTSIDE RANGE OF 1-15**'                 12800042
         MEXIT                                                          12850042
.SUB0    AIF   (&SUB EQ 1).SUBG                                         12900042
         DC    AL.12(&SYSLIST(1)-&DSECT),XL.4'A'                        12950042
         AGO   .SUBH                                                    13000042
.SUBG    ANOP                                                           13050042
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'A'                    13100042
.SUBH    ANOP                                                           13150042
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'              13200042
.OUT     ANOP                                                           13250042
&ITEMXPT     SETA  0                                                    13300042
         AIF   (&SUB EQ 0).OUTA                                         13350042
         AIF   (&OP LT N'&SYSLIST).LOOP                                 13400042
.OUTA    ANOP                                                           13450042
         MEND                                                           13500042
*                                                                       13550042
*********************************************************************** 13600042
* BIN MACRO  BIN MACRO  BIN MACRO  BIN MACRO  BIN MACRO  BIN MACRO      13650042
         MACRO                                                          13700042
         BIN   ,                                                        13750042
.*                                 &SYSLIST(&OP,1) - NAME OF LOG ITEM   13800042
.*                                      RECORD DSECT                    13850042
.*                                 $SYSLIST(&OP,2) - NBR OF SPACES      13900042
.*                                      TO SKIP ON MULTIPLE             13950042
.*                                      PRINT OR NBR OF SPACES          14000042
.*                                      TO BACK UP FROM COLUMN FOR      14050042
.*                                      START OF PRINTING. THE LETTER   14100042
.*                                      B PRECEEDS THE NUMBER (B5) IF   14150042
.*                                      THE LATTER IS DESIRED. OMISSION 14200042
.*                                      OF THIS OPERAND FORCES OPTION 2 14250042
.*                                      WITH BACKUP SPACING EQUAL TO    14300042
.*                                 THE NUMBER OF BITS IN THE ITEM       14350042
.*                                 DEFINITION (VIA MACRO 'DSGEN').      14400042
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     14450042
.*                                 TOTAL NUMBER OF BITS TO PRINT.       14500042
         GBLA  &BITS(2600),&DB,&DT,&INITIAL                             14550042
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  14600042
         GBLA  &ITEMNDX(2600),&ITEMXPT                                  14650042
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              14700042
         GBLA  &NRENTS,&SHIFT(2600)                                     14750042
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           14800042
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(2600)                       14850042
         GBLC  &LABELS(2600),&LBL(100),&NRENTSX                         14900042
         LCLB  &B,&SUB                                                  14950042
         LCLA  &IBITS,&ISHIFT,&K                                        15000042
         LCLA  &TEMP,&T,&OP                                             15050042
         LCLC  &S,&ARG                                                  15100042
          ACTR  500000                                                  15150042
         AIF   (&DIAGTST EQ 0).NOMSG                                    15200042
         AIF   (&INITIAL EQ 0).NOMSG                                    15250042
         AIF   (&DIAGLIN EQ 1).NOMSG                                    15300042
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  15350042
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     15400042
*        LINE                                                           15450042
         LINE                                                           15500042
.NOMSG   ANOP                                                           15550042
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  15600042
&SUB     SETB  1                                                        15650042
.LOOP    ANOP                                                           15700042
&OP      SETA  &OP+1                                                    15750042
&ARG     SETC  '&SYSLIST(&OP,1)'                                        15800042
         ITEMFIND &ARG                                                  15850042
         AIF   (&ITEMXPT EQ 0).MEXIT                                    15900042
&ISHIFT  SETA  &SHIFT(&ITEMXPT)                                         15950042
&IBITS   SETA  &BITS(&ITEMXPT)                                          16000042
         AIF   (&SUB EQ 1).SUB00                                        16050042
         AIF   ('&SYSLIST(3)' EQ '').SETT                               16100042
&IBITS   SETA  &SYSLIST(3)                                              16150042
         AGO   .SETT                                                    16200042
.SUB00   AIF   ('&SYSLIST(&OP,3)' EQ '').SETT                           16250042
&IBITS   SETA  &SYSLIST(&OP,3)                                          16300042
.SETT    ANOP                                                           16350042
&T       SETA  &IBITS-1                                                 16400042
&B       SETB  0                                                        16450042
         AIF   (&IBITS GT 0 AND &IBITS LT 16).SUB0                      16500042
         MNOTE '**NO. OF BITS OUTSIDE RANGE OF 1-15**'                  16550042
.MEXIT   MEXIT                                                          16600042
.SUB0    AIF   (&SUB EQ 1).SUBA                                         16650042
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             16700042
&K       SETA  K'&SYSLIST(2)                                            16750042
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              16800042
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                16850042
         AGO   .SUBB                                                    16900042
.SUBA    ANOP                                                           16950042
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         17000042
&K       SETA  K'&SYSLIST(&OP,2)                                        17050042
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          17100042
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            17150042
.SUBB    ANOP                                                           17200042
&T       SETA  &S                                                       17250042
.BACKUP  ANOP                                                           17300042
&NRENTS  SETA  &NRENTS+1                                                17350042
&TEMP    SETA  &ISHIFT                                                  17400042
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                            17450042
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'                17500042
         AGO   .OUT                                                     17550042
         AIF   (&SUB EQ 1).BIN2                                         17600042
         AIF   ('&SYSLIST(2)' NE '').BIN3                               17650042
         AGO   .BIN2A                                                   17700042
.BIN2    AIF   ('&SYSLIST(&OP,2)' NE '').BIN3                           17750042
.BIN2A   ANOP                                                           17800042
&B       SETB  1                                                        17850042
.BIN3    ANOP                                                           17900042
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'                    17950042
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             18000042
.OUT     ANOP                                                           18050042
&ITEMXPT     SETA  0                                                    18100042
         AIF   (&SUB EQ 0).OUTA                                         18150042
         AIF   (&OP LT N'&SYSLIST).LOOP                                 18200042
.OUTA    ANOP                                                           18250042
         MEND                                                           18300042
*                                                                       18350042
*********************************************************************** 18400042
* LINE MACRO  LINE MACRO  LINE MACRO  LINE MACRO  LINE MACRO LINE MACRO 18450042
         MACRO                                                          18500042
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      18550042
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     18600042
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    18650042
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 18700042
.*                                 ENTRIES. LASTLY IT DETERMINES THE    18750042
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    18800042
.*                                 THE PREVIOUS LINE AND STORES THAT #  18850042
.*                                 INTO THE APPROPRIATE BYTE.           18900042
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    18950042
.*                                 DATA.                                19000042
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 19050042
.*                                 DATA COLUMN STARTING CHARACTERS.     19100042
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   19150042
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 19200042
.*                                 STARTING CHARACTERS.                 19250042
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   19300042
.*                                 TO BEGIN NEXT PRINTED LINE.          19350042
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       19400042
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   19450042
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 19500042
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   19550042
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 19600042
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    19650042
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   19700042
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   19750042
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  19800042
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   19850042
.*                                 THE SUBJECT LINE                     19900042
         GBLA  &BITS(2600),&DB,&DT,&INITIAL                             19950042
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  20000042
         GBLA  &ITEMNDX(2600),&ITEMXPT                                  20050042
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              20100042
         GBLA  &NRENTS,&SHIFT(2600)                                     20150042
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           20200042
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(2600)                       20250042
         GBLC  &LABELS(2600),&LBL(100),&NRENTSX                         20300042
         LCLA  &S                                                       20350042
         AIF   (&INITIAL EQ 0 OR &DIAGTST EQ 0).DIAGSET                 20400042
         AIF   (&DIAGSET EQ 0).DIAGSET                                  20450042
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  20500042
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   20550042
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       20600042
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 20650042
.DIAGSET ANOP                                                           20700042
&DIAGSET SETB  1                                                        20750042
&DIAGLIN SETB  1                                                        20800042
&NAME    DS    0C                                                       20850042
         AIF   (&INITIAL EQ 0).FIRSTLN                                  20900042
         LINEND                                                         20950042
         AGO   .NTFIRST                                                 21000042
.FIRSTLN ANOP                                                           21050042
&NRENTSX SETC  'N&SYSNDX'                                               21100042
&INITIAL SETA  1                                                        21150042
N&SYSNDX EQU   *                                                        21200042
.NTFIRST ANOP                                                           21250042
         DC    AL1(0)                                                   21300042
         AIF   ('&DATA(1)' EQ '').CKDTABS                               21350042
         AIF   (&DATA(1) EQ &DB).CKDTABS                                21400042
&DB      SETA  &DATA(1)                                                 21450042
         AGO   .AA                                                      21500042
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                21550042
         AIF   (&DATA(2) EQ &DT).NCDATA                                 21600042
         AGO   .CC                                                      21650042
.AA      AIF   ('&DATA(2)' EQ '').BB                                    21700042
         AIF   (&DATA(2) EQ &DT).BB                                     21750042
.CC      ANOP                                                           21800042
&DT      SETA  &DATA(2)                                                 21850042
.BB      DC    XL2'FFFE'                                                21900042
         DC    FL1'&DB'                                                 21950042
         DC    FL1'&DT'                                                 22000042
&NRENTS  SETA  &NRENTS+1                                                22050042
.NCDATA  ANOP                                                           22100042
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              22150042
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               22200042
&LB      SETA  &LABEL(1)                                                22250042
         AGO   .AAA                                                     22300042
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              22350042
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               22400042
         AGO   .CCC                                                     22450042
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  22500042
         AIF   (&LABEL(2) EQ &LT).BBB                                   22550042
.CCC     ANOP                                                           22600042
&LT      SETA  &LABEL(2)                                                22650042
.BBB     DC    XL2'FFFF'                                                22700042
         DC    FL1'&LB'                                                 22750042
         DC    FL1'&LT'                                                 22800042
&NRENTS  SETA  &NRENTS+1                                                22850042
.NCLABEL ANOP                                                           22900042
         AIF   ('&SKIP' NE '').CONT                                     22950042
         AIF   (&TEST EQ 0).NOCHANG                                     23000042
         AGO   .DEFALTA                                                 23050042
.CONT    ANOP                                                           23100042
         AIF   (&TEST EQ 0).AB                                          23150042
         AIF   ('&SKIP' EQ 'E').AB                                      23200042
&S       SETA  &SKIP                                                    23250042
.DEFAULT ANOP                                                           23300042
         AIF   (&SKIP EQ &LASTCC).DEFALTA                               23350042
         ORG   &CARRCON+3                                               23400042
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 23450042
         ORG                                                            23500042
&LASTCC  SETA  &S                                                       23550042
.DEFALTA ANOP                                                           23600042
&TEST    SETB  0                                                        23650042
         AGO   .DD                                                      23700042
.AB      AIF   ('&SKIP' NE 'E').ABB                                     23750042
A&SYSNDX DC    X'FFFB8B00'              EJECT                           23800042
         AGO   .ABC                                                     23850042
.ABB     AIF   (&SKIP EQ &LASTCC).NOCHANG                               23900042
A&SYSNDX DC    XL2'FFFB'                                                23950042
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              24000042
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              24050042
&LASTCC  SETA  &SKIP                                                    24100042
&TEST    SETB  1                                                        24150042
.ABC     ANOP                                                           24200042
&CARRCON SETC  'A&SYSNDX'                                               24250042
&NRENTS  SETA  &NRENTS+1                                                24300042
.DD      ANOP                                                           24350042
.NOCHANG ANOP                                                           24400042
         MEND                                                           24450042
*                                                                       24500042
*********************************************************************** 24550042
* LINEND MACRO  LINEND MACRO  LINEND MACRO  LINEND MACRO  LINEND MACRO  24600042
         MACRO                                                          24650042
         LINEND ,                                                       24700042
.*                                 THIS MACRO IS USED ONLY BY THE LINE  24750042
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   24800042
.*                                 ASSOCIATED WITH EACH LINE.           24850042
         GBLA  &BITS(2600),&DB,&DT,&INITIAL                             24900042
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  24950042
         GBLA  &ITEMNDX(2600),&ITEMXPT                                  25000042
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              25050042
         GBLA  &NRENTS,&SHIFT(2600)                                     25100042
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           25150042
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(2600)                       25200042
         GBLC  &LABELS(2600),&LBL(100),&NRENTSX                         25250042
         ORG   &NRENTSX                                                 25300042
         DC    FL1'&NRENTS'                                             25350042
         ORG                                                            25400042
&NRENTS  SETA  0                                                        25450042
B&SYSNDX EQU   *                                                        25500042
&NRENTSX SETC  'B&SYSNDX'                                               25550042
         MEND                                                           25600042
*                                                                       25650042
*********************************************************************** 25700042
* LABEL MACRO   LABEL MACRO  LABEL MACRO  LABEL MACRO  LABEL MACRO      25750042
         MACRO                                                          25800042
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C25850042
               &LABEL7,&LABEL8                                          25900042
.*                                 THIS MACRO ALLOWS LABELS TO          25950042
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   26000042
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  26050042
.*                                 TION MARKS. THE COLUMN AND LINE END  26100042
.*                                 CONTROLS WILL BE INSERTED BY THE     26150042
.*                                 MACRO. OMITTED OPERANDS MEAN NO      26200042
.*                                 LABEL REQUIRED FOR RESPECTIVE        26250042
.*                                 COLUMN.                              26300042
         GBLA  &BITS(2600),&DB,&DT,&INITIAL                             26350042
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  26400042
         GBLA  &ITEMNDX(2600),&ITEMXPT                                  26450042
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              26500042
         GBLA  &NRENTS,&SHIFT(2600)                                     26550042
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           26600042
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(2600)                       26650042
         GBLC  &LABELS(2600),&LBL(100),&NRENTSX                         26700042
         LCLC  &MARGIN,&TACK                                            26750042
         LCLC  &TEXT                                                    26800042
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            26850042
         AIF   (&INITIAL EQ 0).DIAGCLR                                  26900042
         AIF   (&DIAGTST EQ 0).DIAGCLR                                  26950042
         AIF   (&DIAGLIN EQ 1).DIAGCLR                                  27000042
         MNOTE '**NO LINE ASSOCIATED WITH PREVIOUS LABEL**'             27050042
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   27100042
*        LINE                                                           27150042
         LINE                                                           27200042
.DIAGCLR ANOP                                                           27250042
&DIAGSET SETB  0                                                        27300042
&DIAGLIN SETB  0                                                        27350042
&MARGIN  SETC  '*'                                                      27400042
         AIF   ('&NAME' EQ '').LOOPOUT                                  27450042
&LPTR    SETA  &LPTR+1                                                  27500042
&LBL(&LPTR) SETC '&NAME'                                                27550042
&LBLCTR(&LPTR) SETA &LABELNR+1                                          27600042
.LOOPOUT ANOP                                                           27650042
&OP      SETA  &OP+1                                                    27700042
&K       SETA  K'&SYSLIST(&OP)                                          27750042
         AIF (&K GE 2).NORM                                             27800042
&K       SETA  2                                                        27850042
.NORM    ANOP                                                           27900042
&START   SETA  2                                                        27950042
         AIF (&OP LT N'&SYSLIST).NOTLAST                                28000042
&MARGIN  SETC  '$'                                                      28050042
.NOTLAST ANOP                                                           28100042
&NRCHAR  SETA  8                                                        28150042
&TACK    SETC  ''                                                       28200042
.LOOPIN  ANOP                                                           28250042
&REMAIN  SETA  &K-&START                                                28300042
         AIF (&REMAIN GE 8).MORE                                        28350042
&TACK    SETC  '&MARGIN'                                                28400042
&NRCHAR  SETA  &REMAIN                                                  28450042
.MORE    ANOP                                                           28500042
&TEXT    SETC  ''                                                       28550042
         AIF (&REMAIN EQ 0).ENDTEXT                                     28600042
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          28650042
.ENDTEXT ANOP                                                           28700042
&LABELNR SETA  &LABELNR+1                                               28750042
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  28800042
&START   SETA  &START+8                                                 28850042
         AIF ('&TACK' EQ '').LOOPIN                                     28900042
         AIF ('&TACK' EQ '*').LOOPOUT                                   28950042
         MEND                                                           29000042
*                                                                       29050042
*********************************************************************** 29100042
* ROUTINE MACRO  ROUTINE MACRO  ROUTINE MACRO  ROUTINE MACRO            29150042
         MACRO                                                          29200042
&NAME    ROUTINE &LOGITEM,&RNAME                                        29250042
         GBLA  &BITS(2600),&DB,&DT,&INITIAL                             29300042
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  29350042
         GBLA  &ITEMNDX(2600),&ITEMXPT                                  29400042
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              29450042
         GBLA  &NRENTS,&SHIFT(2600)                                     29500042
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           29550042
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(2600)                       29600042
         GBLC  &LABELS(2600),&LBL(100),&NRENTSX                         29650042
         AIF   (&DIAGTST EQ 0).NOMSG                                    29700042
         AIF   (&INITIAL EQ 0).NOMSG                                    29750042
         AIF   (&DIAGLIN EQ 1).NOMSG                                    29800042
         MNOTE '**NO LINE ASSOCIATED WITH THIS ROUTINE**'               29850042
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     29900042
*        LINE                                                           29950042
         LINE                                                           30000042
.NOMSG   ANOP                                                           30050042
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           30100042
         DC    AL2(&RNAME-&CSECT)                                       30150042
&NRENTS  SETA  &NRENTS+1                                                30200042
         MEND                                                           30250042
*                                                                       30300042
*********************************************************************** 30350042
* ITEMFIND MACRO  ITEMFIND MACRO  ITEMFIND MACRO  ITEMFIND MACRO        30400042
         MACRO                                                          30450042
         ITEMFIND &ARG,&ITFDIAG=                                        30500042
         GBLA  &BITS(2600),&DB,&DT,&INITIAL                             30550042
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  30600042
         GBLA  &ITEMNDX(2600),&ITEMXPT                                  30650042
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              30700042
         GBLA  &NRENTS,&SHIFT(2600)                                     30750042
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           30800042
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(2600)                       30850042
         GBLC  &LABELS(2600),&LBL(100),&NRENTSX                         30900042
         LCLA  &A,&B,&X,&I                                              30950042
         LCLC  &C1,&C2,&S                                               31000042
         ACTR  500000                                                   31050042
&ITEMXPT SETA  0                  INDICATE ITEM NOT FOUND.              31100042
         AIF   ('&ARG' NE '').NORM                                      31150042
         AIF   ('&ITFDIAG' EQ 'OFF'  OR  '&ITFDIAG' EQ 'ON').DIAGSET    31200042
  MNOTE 0,'ITEMFIND - OPERAND (&ITFDIAG) INVALID FOR ITFDIAG KEYWORD.'  31250042
         MEXIT                                                          31300042
.DIAGSET ANOP                                                           31350042
&DIAGITF SETB  ('&ITFDIAG' EQ 'ON')                                     31400042
         MEXIT                                                          31450042
.NORM    AIF   (&ITEMITR GT 0).SORTED                                   31500042
         ITEMSORT                                                       31550042
.SORTED  ANOP                                                           31600042
&I       SETA  &ITEMITR           COMPUTED ITTERATION COUNT.            31650042
&X       SETA  &ITEMMDX           COMPUTED MAXIMUM INDEX.               31700042
&C1      SETC  '&ARG'             ISOLATE SEARCH ARGUMENT.              31750042
&C1      SETC  '&C1'.'       '(1,8-K'&C1) PAD TO FULL 8 CHARACTERS.     31800042
.SRCHUP  ANOP                                                           31850042
&A       SETA  &A+&X              CURRENT TABLE SUBSCRIPT + INDEX.      31900042
&S       SETC  '+'                                                      31950042
         AIF   (&A  GT &ITEMNBR  AND  NOT &DIAGITF).SRCHDN1             32000042
         AIF   (&A  LE &ITEMNBR).SRCH00                                 32050042
&C2      SETC  '*-OVER-*'                                               32100042
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         32150042
&X       SETA  &X/2               HALVE INDEX VALUE.                    32200042
 MNOTE *,'&ARG - &C2   ITRCTR = &I   PTR = &A&S &X'                     32250042
         AIF   (&I GE 0).SRCHDWN  IF ITTERATION COUNT NOT EXPIRED.      32300042
.NOFIND  MNOTE  20,' ITEMFIND FAILED FOR NAME  &C1  '                   32350042
         MEXIT                                                          32400042
.SRCH00  ANOP                                                           32450042
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         32500042
         AIF   (&I LT 0).NOFIND   IF COUNT HAS GONE TO ZERO.            32550042
&X       SETA  &X/2               HALVE INDEX VALUE.                    32600042
&B       SETA  &ITEMNDX(&A)       GET SUBSCRIPT FROM INDEX TABLE.       32650042
&C2      SETC  '&ITEM(&B)'.'       '(1,8-K'&ITEM(&B))  PAD COMPARAND.   32700042
         AIF   (NOT &DIAGITF).COMPARE                                   32750042
 MNOTE *,'&ARG - &C2   ITRCTR = &I   PTR = &A&S &X   POS = &B'          32800042
.COMPARE AIF   ('&C1' LT '&C2').SRCHDWN   ARGUMENT LOWER, MOVE DOWN.    32850042
         AIF   ('&C1' GT '&C2').SRCHUP    ARGUMENT HIGHER, MOVE UP.     32900042
&ITEMXPT SETA  &B                 FOUND. SET INDEX POINTER FOR RETURN.  32950042
&ITEMFST(&I+1)  SETA  &ITEMFST(&I+1)+1                                  33000042
         MEXIT                                                          33050042
.SRCHDWN ANOP                                                           33100042
&A       SETA  &A-&X              CURRENT POINTER MINUS INDEX VALUE.    33150042
&S       SETC  '-'                                                      33200042
         AIF   (&A LE &ITEMNBR).SRCH00    IF WITHIN BOUNDS OF TABLE.    33250042
.SRCHDN1 ANOP                                                           33300042
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         33350042
&X       SETA  &X/2               HALVE INDEX VALUE.                    33400042
         AIF   (&I GE 0).SRCHDWN  IF ITTERATION COUNT NOT EXPIRED.      33450042
         MNOTE  20,' ITEMFIND FAILED FOR NAME  &C1  '                   33500042
         MEND                                                           33550042
*                                                                       33600042
*********************************************************************** 33650042
* ITEMSORT MACRO  ITEMSORT MACRO  ITEMSORT MACRO  ITEMSORT MACRO        33700042
         MACRO                                                          33750042
         ITEMSORT  &DUMMY                                               33800042
         GBLA  &BITS(2600),&DB,&DT,&INITIAL                             33850042
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  33900042
         GBLA  &ITEMNDX(2600),&ITEMXPT                                  33950042
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              34000042
         GBLA  &NRENTS,&SHIFT(2600)                                     34050042
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           34100042
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(2600)                       34150042
         GBLC  &LABELS(2600),&LBL(100),&NRENTSX                         34200042
         LCLA  &R,&ZI,&I,&A1,&A2,&TEMP                                  34250042
         LCLB  &SR,&GOTO,&TB                                            34300042
         LCLB  &SW(3000)                                                34350042
         LCLC  &C1,&C2                                                  34400042
         ACTR  500000                                                   34450042
&A1      SETA  0                                                        34500042
         AIF   (&ITEMITR EQ 0).LOOP0   TEST FOR RE-ENTRY.               34550042
 MNOTE   0,'ITEMSORT MACRO OCCURRS MORE THAN ONCE. TABLE NOT RESORTED.' 34600042
         MEXIT                                                          34650042
.LOOP0   ANOP                                                           34700042
&A1      SETA  &A1+1                                                    34750042
&ITEMNDX(&A1) SETA &A1                                                  34800042
         AIF   (&A1 LT &ITEMNBR).LOOP0                                  34850042
         AIF   (&ITEMNBR LT 2).MEXIT                                    34900042
&A1      SETA  &ITEMNBR/2         HALF OF TOTAL ENTRIES.                34950042
&A2      SETA  0                                                        35000042
.LOOP1   ANOP                                                           35050042
&A2      SETA  &A2+1                                                    35100042
&SW(&A2) SETB  1                  SET FIRST HALF OF SWITCHES TO 1.      35150042
         AIF   (&A2 LT &A1).LOOP1                                       35200042
.LOOP2   ANOP                                                           35250042
&A2      SETA  &A2+1                                                    35300042
&SW(&A2) SETB  0                  SET SECOND HALF TO ZERO.              35350042
         AIF   (&A2 LT &ITEMNBR).LOOP2                                  35400042
&R       SETA  0                  SET R TO FIRST TRIAL ITEM.            35450042
&ZI      SETA  &ITEMNBR-1         SET ZI TO LAST ITEM.                  35500042
&I       SETA  &ZI-1                                                    35550042
.T3      ANOP                                                           35600042
&SR      SETB  (&SW(&R+1))        GET FLAG, WHICH WAY TO GO?            35650042
&R       SETA  (&R*2)+1+&SR       R=2R+(1 OR 2)                         35700042
         AIF   (&R LE &I).T3                                            35750042
.T4      ANOP                                                           35800042
&R       SETA  (&R-1)/2           R=(R-1)/2                             35850042
&SR      SETB  (&SW(&R+1))        GET SUBTREE SELECT FLAG.              35900042
         AIF   (&SR EQ 0).T7                                            35950042
         AIF   (&GOTO EQ 0).T5                                          36000042
.T7      ANOP                                                           36050042
&A1      SETA  &ITEMNDX(&R+1)                                           36100042
&A2      SETA  &ITEMNDX(&ZI+1)                                          36150042
&C1      SETC  '&ITEM(&A1)'.'       '(1,8-K'&ITEM(&A1))                 36200042
&C2      SETC  '&ITEM(&A2)'.'       '(1,8-K'&ITEM(&A2))                 36250042
         AIF   ('&C1' LT '&C2').T8                                      36300042
.T9      ANOP                                                           36350042
&TEMP    SETA  &ITEMNDX(&R+1)     Z(R) TO TEMP.                         36400042
&TB      SETB  (&SW(&R+1))                                              36450042
&ITEMNDX(&R+1) SETA &ITEMNDX(&ZI+1)    Z(I) TO Z(R)                     36500042
&SW(&R+1) SETB (&SW(&ZI+1))                                             36550042
&ITEMNDX(&ZI+1) SETA &TEMP        TEMP TO Z(I)                          36600042
&SW(&ZI+1) SETB (&TB)                                                   36650042
&SR      SETB  (&SR EQ 0)                                               36700042
&SW(&R+1) SETB (&SR)                                                    36750042
.T8      AIF   (&R GT 0).T4                                             36800042
&GOTO    SETB  1                  SET 'GO TO' T7                        36850042
&ZI      SETA  &ZI-1                                                    36900042
&I       SETA  &I-1                                                     36950042
         AIF   (&I GE 0).T3                                             37000042
.MEXIT   ANOP                                                           37050042
&ITEMITR SETA 1                                                         37100042
&ITEMMDX SETA 1                                                         37150042
.ITRLOOP ANOP                                                           37200042
&ITEMITR SETA &ITEMITR+1                                                37250042
&ITEMMDX SETA &ITEMMDX+&ITEMMDX                                         37300042
         AIF  (&ITEMMDX LT &ITEMNBR).ITRLOOP                            37350042
&ITEMITR SETA &ITEMITR-1                                                37400042
&ITEMMDX SETA &ITEMMDX/2                                                37450042
&A1      SETA &ITEMNBR                                                  37500042
&A2      SETA &ITEMMDX                                                  37550042
&TEMP    SETA &ITEMITR                                                  37600042
 MNOTE *,' ITEMS = &A1, MAX INDEX = &A2, ITTERATION COUNT = &TEMP'      37650042
         MEXIT                                                          37700042
.T5      ANOP                                                           37750042
&TEMP    SETA  &ITEMNDX(&R+1)     Z(R) TO TEMP.                         37800042
&TB      SETB  (&SW(&R+1))                                              37850042
&ITEMNDX(&R+1) SETA &ITEMNDX(&ZI+1)    Z(I) TO Z(R)                     37900042
&SW(&R+1) SETB (&SW(&ZI+1))                                             37950042
&ITEMNDX(&ZI+1) SETA &TEMP        TEMP TO Z(I)                          38000042
&SW(&ZI+1) SETB (&TB)                                                   38050042
&SR      SETB  (&SR EQ 0)                                               38100042
&SW(&R+1) SETB (&SR)                                                    38150042
         AGO   .T3                                                      38200042
         MEND                                                           38250042
*                                                                       38300042
*********************************************************************** 38350042
* LSTART MACRO  LSTART MACRO  LSTART MACRO  LSTART MACRO  LSTART MACRO  38400042
         MACRO                                                          38450042
         LSTART ,                                                       38500042
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  38550042
.*                                 OF THE TABLE IS TO BEGIN.            38600042
         GBLA  &BITS(2600),&DB,&DT,&INITIAL                             38650042
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  38700042
         GBLA  &ITEMNDX(2600),&ITEMXPT                                  38750042
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              38800042
         GBLA  &NRENTS,&SHIFT(2600)                                     38850042
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           38900042
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(2600)                       38950042
         GBLC  &LABELS(2600),&LBL(100),&NRENTSX                         39000042
         LCLA  &NDX,&CTR                                                39050042
         ACTR  500000                                                   39100042
         AIF   (&DIAGTST EQ 0).NODIAG                                   39150042
         AIF   (&DIAGSET EQ 0).NODIAG                                   39200042
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  39250042
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   39300042
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       39350042
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 39400042
.NODIAG  ANOP                                                           39450042
         LINEND                                                         39500042
&CTR     SETA  1                                                        39550042
.LOOP    ANOP                                                           39600042
&NDX     SETA  &NDX+1                                                   39650042
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            39700042
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         39750042
&CTR     SETA  &CTR+1                                                   39800042
         AGO   .LOOPCTL                                                 39850042
.NOLBL   ANOP                                                           39900042
         DC    C'&LABELS(&NDX)'                                         39950042
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  40000042
         MEND                                                           40050042
         SPACE 2                                                        40100042
         GBLC  &DSECT,&CSECT                                            40150042
IFCEGUS1 CSECT                                                          40200042
*                                                                       40250042
&CSECT   SETC  'IFCEGUS1'                                               40300042
&DSECT   SETC  'GUS1'                                                   40350042
*                                                                       40400042
*                OBR EDIT TABLE 3838                                    40450042
*                                                                       40500042
GUS1     DSECT                                                          40550042
*                                                                       40600042
         DSGEN (XDUM1,8),(XRELN,8),(XDUM2,8),                          X40650042
               (SW2B0,1),(SW2B1,1),(SW2B2,1),(SW2B3,1),                X40700042
               (SW2B4,1),(SW2B5,1),(SW2B6,1),(SW2B7,1)                  40750042
         DSGEN (XDUM2A,32)                   SPARES                     40800042
         DSGEN (XDATE,32)                    DATE                       40850042
         DSGEN (XTIME,32)                    TIME                       40900042
         DSGEN (XDUM3,8),(XSER,24)           SPARE AND SERIAL NO        40950042
         DSGEN (XMODEL,16),(XMCEL,16)        MODEL #  AND MCEL          41000042
         DSGEN (XPGN1,32)                    PROGRAM                    41050042
         DSGEN (XPGN2,32)                           NAME                41100042
         DSGEN (XFCCWCC,8),(XFCCWDA,24)      FAILING COMM & ADDR        41150042
         DSGEN (XFCCWFL,8),(XZERO,8),(XFCCWCT,16)  CCW CHAIN & COUNT    41200042
         DSGEN (XCSWK,8),(XCSWCA,24)         CSW COMM & ADDR            41250042
         DSGEN (XCSWATTN,1),(XCSWSM,1),(XCSWCUE,1),(XCSWBSY,1),        X41300042
               (XCSWCE,1),(XCSWDE,1),(XCSWUC,1),(XCSWUE,1),            X41350042
               (XCSWPCI,1),(XCSWSILI,1),(XCSWPC,1),(XCSWPCHK,1),       X41400042
               (XCSWCDC,1),(XCSWCCC,1),(XCSWICC,1),(XCSWCH,1),         X41450042
               (XCSWCT,16)                                              41500042
         DSGEN (XDUMA,8),(XCUA2,24)          SPARE AND SECONDARY CUA    41550042
         DSGEN (XDEVT1,16),(XDEVT2,16)       DEVICE TYPE                41600042
         DSGEN (XDUM4,8),(XCUA,24)           SPARE & CUA                41650042
         DSGEN (XDUM5,32)                    SPARES                     41700042
         DSGEN (SDR1,8),(SDR2,8),(SDR3,8),(SDR4,8),                    X42050042
               (SDR5,8),(SDR6,8),(SDR7,8),(SDR8,8)                      42100042
         DSGEN (SDR9,8),(SDR10,8),                                     X42150042
               (XB0CMDR,1),(XB0INTRQ,1),(XB0BUSC,1),(XB0ECHK,1),       X42200042
               (XB0DCHK,1),(XB0NOTIN,1),(XB0NU2,1),(XB0NU3,1),         X42250042
               (XB1RST,1),(XB1URERR,1),(XB1DDEP,1),(XB1INVP,1),        X42300042
               (XB1NU1,1),(XB1NU2,1),(XB1NU3,1),(XB1NU4,1)              42350042
         DSGEN (XB2CPMC,1),(XB2IO,1),(XB2ARELM,1),(XB2DTC,1),          X42400042
               (XB2CPEXC,1),(XB2PERM,1),(XB2NU1,1),(XB2NU2,1),         X42450042
               (XB3SNSTY,8),(XB4B5,16)                                  42500042
         DSGEN (XB6B7,16),                                             X42550042
               (XB8BIT0,1),(XB8BIT1,1),(XB8BIT2,1),(XB8BIT3,1),        X42600042
               (XB8BIT4,1),(XB8BIT5,1),(XB8BIT6,1),(XB8BIT7,1),        X42650042
               (XB9BIT0,1),(XB9BIT1,1),(XB9BIT2,1),(XB9BIT3,1),        X42700042
               (XB9BIT4,1),(XB9BIT5,1),(XB9BIT6,1),(XB9BIT7,1)          42750042
         DSGEN (XB10BIT0,1),(XB10BIT1,1),(XB10BIT2,1),(XB10BIT3,1),    X42800042
               (XB10BIT4,1),(XB10BIT5,1),(XB10BIT6,1),(XB10BIT7,1),    X42850042
               (XB11BIT0,1),(XB11BIT1,1),(XB11BIT2,1),(XB11BIT3,1),    X42900042
               (XB11BIT4,1),(XB11BIT5,1),(XB11BIT6,1),(XB11BIT7,1),    X42950042
               (XB12BIT0,1),(XB12BIT1,1),(XB12BIT2,1),(XB12BIT3,1),    X43000042
               (XB12BIT4,1),(XB12BIT5,1),(XB12BIT6,1),(XB12BIT7,1),    X43050042
               (XB13BIT0,1),(XB13BIT1,1),(XB13BIT2,1),(XB13BIT3,1),    X43100042
               (XB13BIT4,1),(XB13BIT5,1),(XB13BIT6,1),(XB13BIT7,1)      43150042
         DSGEN (XB14BIT0,1),(XB14BIT1,1),(XB14BIT2,1),(XB14BIT3,1),    X43200042
               (XB14BIT4,1),(XB14BIT5,1),(XB14BIT6,1),(XB14BIT7,1),    X43250042
               (XB15BIT0,1),(XB15BIT1,1),(XB15BIT2,1),(XB15BIT3,1),    X43300042
               (XB15BIT4,1),(XB15BIT5,1),(XB15BIT6,1),(XB15BIT7,1),    X43350042
               (XB16BIT0,1),(XB16BIT1,1),(XB16BIT2,1),(XB16BIT3,1),    X43400042
               (XB16BIT4,1),(XB16BIT5,1),(XB16BIT6,1),(XB16BIT7,1),    X43450042
               (XB17BIT0,1),(XB17BIT1,1),(XB17BIT2,1),(XB17BIT3,1),    X43500042
               (XB17BIT4,1),(XB17BIT5,1),(XB17BIT6,1),(XB17BIT7,1)      43550042
         DSGEN (XB18BIT0,1),(XB18BIT1,1),(XB18BIT2,1),(XB18BIT3,1),    X43600042
               (XB18BIT4,1),(XB18BIT5,1),(XB18BIT6,1),(XB18BIT7,1),    X43650042
               (XB19BIT0,1),(XB19BIT1,1),(XB19BIT2,1),(XB19BIT3,1),    X43700042
               (XB19BIT4,1),(XB19BIT5,1),(XB19BIT6,1),(XB19BIT7,1),    X43750042
               (XB20,8),(XB21,8)                                        43800042
         DSGEN (XB22,8),(XB23,8),(XB24,8),(XB25,8)                      43850042
         DSGEN (XB26XB27,16),(XB28XB29,16)                              43900042
         DSGEN (XB30XB31,16)                                            43950042
*********************************************************************** 44000042
EXPNOBR  DSECT                                                          44050042
EXPNHDRA DS    CL64                                                     44100042
EXPNSDRA DS    CL10                                                     44200042
EXPNSNSA DS    CL32                                                     44250042
*********************************************************************** 44300042
NORMOBR  DSECT                                                          44350042
NORMHDRA DS    CL64                                                     44400042
NORMSDRA DS    CL10                                                     44500042
NORMSNSA DS    CL32                                                     44550042
*********************************************************************** 44600042
SHRTOBR  DSECT                                                          44650042
SHRTHDRA DS    CL24                                                     44700042
SHRTSDRA DS    CL10                                                     44800042
*********************************************************************** 44850042
IFCEGUS1 CSECT                                                          44900042
         USING *,R9                                                     44950042
         USING GUS1,R2                                                  45000042
R0       EQU   0                                                        45050042
R1       EQU   1                                                        45100042
R2       EQU   2                                                        45150042
R3       EQU   3                                                        45200042
R4       EQU   4                                                        45250042
R5       EQU   5                                                        45300042
R6       EQU   6                                                        45350042
R7       EQU   7                                                        45400042
R8       EQU   8                                                        45450042
R9       EQU   9                                                        45500042
R10      EQU   10                                                       45550042
R11      EQU   11                                                       45600042
R12      EQU   12                                                       45650042
R13      EQU   13                                                       45700042
R14      EQU   14                                                       45750042
R15      EQU   15                                                       45800042
L0       EQU   0                                                        45850042
L1       EQU   1                                                        45900042
L2       EQU   2                                                        45950042
L3       EQU   3                                                        46000042
L4       EQU   4                                                        46050042
L5       EQU   5                                                        46100042
L6       EQU   6                                                        46150042
L7       EQU   7                                                        46200042
L8       EQU   8                                                        46250042
L10      EQU   10                                                       46300042
L12      EQU   12                                                       46350042
L13      EQU   13                                                       46400042
L16      EQU   16                                                       46450042
L17      EQU   17                                                       46500042
L20      EQU   20                                                       46550042
L21      EQU   21                                                       46600042
L24      EQU   24                                                       46650042
L27      EQU   27                                                       46700042
L29      EQU   29                                                       46750042
L30      EQU   30                                                       46800042
L31      EQU   31                                                       46850042
L32      EQU   32                                                       46900042
L36      EQU   36                                                       46950042
L44      EQU   44                                                       47000042
L46      EQU   46                                                       47050042
L64      EQU   64                                                       47100042
L96      EQU   96                                                       47150042
L106     EQU   106                                                      47200042
HEX01    EQU   X'01'                                                    47250042
HEX02    EQU   X'02'                                                    47300042
HEX08    EQU   X'08'                                                    47350042
HEX10    EQU   X'10'                                                    47400042
HEX20    EQU   X'20'                                                    47450042
HEX30    EQU   X'30'                                                    47500042
HEXFF    EQU   X'FF'                                                    47550042
A        EQU   C'A'                                                     47600042
B        EQU   C'B'                                                     47650042
*********************************************************************** 47700042
*              DECLARES                                                 47750042
*********************************************************************** 47800042
         DC    A(ENTRIES)          PTR TO EDIT ENTRIES                  47850042
         DC    CL8'IFCEGUS1'                                            47900042
XR9PTR   DC    F'0'                PTR TO NEXT EDIT-4                   47950042
XLABELP  DC    F'0'                LABEL PTR SAVE                       48000042
SHRTADCN DC    A(SHRTOBRS-4)                                            48050042
         DC    A(SHRTOBRL)                                              48100042
HWLABAD  DC    A(HWLABEL)                                               48150042
DATLABAD DC    A(DATLABEL)                                              48200042
OBRAREA  DS    CL106                                                    48250042
SAVE2    DS    F                                                        48300042
XSAVE    DS    4F                                                       48350042
UNITCK   DC    C'UNIT CHECK'                                            48400042
OVFL     DC    C'OVERFLOW'                                              48450042
UNIVERS  DC    C'UNIVERSAL   SERIAL NO. NONE  '                         48500042
OVRLAYS  DC    C' X  X XX  XXXX   X X X   XXXXX'                        48550042
MPCPU    DC    C'MULTIPROCESSOR - CPU'                                  48600042
JOBID    DC    C'JOB IDENTITY'                                          48650042
SERNO    DC    C'SERIAL NO.'                                            48700042
TFLG     DC    X'00'                                                    48750042
WORK     DS    D                                                        48800042
RELTAB   DS    0C                                                       48850042
         DC    C'OS  '                                                  48900042
         DC    C'DOS '                                                  48950042
         DC    C'VS 1'                                                  49000042
         DC    C'V370'                                                  49050042
         DC    C'VS 2'                                                  49100042
         DC    C'    '                                                  49150042
         DC    C'    '                                                  49200042
         DC    C'    '                                                  49250042
NONE     DC    C'NONE'                                                  49300042
BLANKS   DC    CL36' '                                                  49350042
ZERO     DC    XL4'00'                                                  49400042
CHARS    DC    C'0123456789ABCDEF'                                      49450042
XXXX     DC    C'XXXX'                                                  49500042
*********************************************************************** 49550042
*              SPECIAL ROUTINE SECTION                                  49600042
*********************************************************************** 49650042
*                                                                       49700042
*********************************************************************** 49750042
*              CONVERT 4 BYTES TO EBCDIC                                49800042
*********************************************************************** 49850042
BRCNT    STM   R5,R8,XSAVE                                              49900042
         IC    R7,L0(R4)                GET 1ST BYTE                    49950042
         SLL   R7,L8                    MAKE ROOM                       50000042
         IC    R7,L1(R4)                GET 2ND BYTE                    50050042
         SLL   R7,L8                    MAKE ROOM                       50100042
         IC    R7,L2(R4)                GET 3RD BYTE                    50150042
         SLL   R7,L8                    MAKE ROOM                       50200042
         IC    R7,L3(R4)                GET 4TH BYTE                    50250042
         LA    R8,CHARS                 GET ADDR. OF CHAR. TABLE        50300042
         SR    R6,R6                    CLEAR REG                       50350042
         SLDL  R6,L4                    GET 4 BITS                      50400042
         AR    R6,R8                    COMPUTE OFFSET INTO CHAR. TABLE 50450042
         MVC   L0(L1,R3),L0(R6)         MOVE CHAR INTO LINE             50500042
         SR    R6,R6                    CLEAR REG                       50550042
         SLDL  R6,L4                    GET 4 BITS                      50600042
         AR    R6,R8                    COMPUTE OFFSET INTO CHAR. TABLE 50650042
         MVC   L1(L1,R3),L0(R6)         MOVE CHAR INTO LINE             50700042
         SR    R6,R6                    CLEAR REG                       50750042
         SLDL  R6,L4                    GET 4 BITS                      50800042
         AR    R6,R8                    COMPUTE OFFSET INTO CHAR. TABLE 50850042
         MVC   L2(L1,R3),L0(R6)         MOVE CHAR INTO LINE             50900042
         SR    R6,R6                    CLEAR REG                       50950042
         SLDL  R6,L4                    GET 4 BITS                      51000042
         AR    R6,R8                    COMPUTE OFFSET INTO CHAR. TABLE 51050042
         MVC   L3(L1,R3),L0(R6)         MOVE CHAR INTO LINE             51100042
         SR    R6,R6                    CLEAR REG                       51150042
         SLDL  R6,L4                    GET 4 BITS                      51200042
         AR    R6,R8                    COMPUTE OFFSET INTO CHAR. TABLE 51250042
         MVC   L4(L1,R3),L0(R6)         MOVE CHAR INTO LINE             51300042
         SR    R6,R6                    CLEAR REG                       51350042
         SLDL  R6,L4                    GET 4 BITS                      51400042
         AR    R6,R8                    COMPUTE OFFSET INTO CHAR. TABLE 51450042
         MVC   L5(L1,R3),L0(R6)         MOVE CHAR INTO LINE             51500042
         SR    R6,R6                    CLEAR REG                       51550042
         SLDL  R6,L4                    GET 4 BITS                      51600042
         AR    R6,R8                    COMPUTE OFFSET INTO CHAR. TABLE 51650042
         MVC   L6(L1,R3),L0(R6)         MOVE CHAR INTO LINE             51700042
         SR    R6,R6                    CLEAR REG                       51750042
         SLDL  R6,L4                    GET 4 BITS                      51800042
         AR    R6,R8                    COMPUTE OFFSET INTO CHAR. TABLE 51850042
         MVC   L7(L1,R3),L0(R6)         MOVE CHAR INTO LINE             51900042
         B     RETURN                                                   51950042
*********************************************************************** 52000042
*              CHECK IF BYTES 14-19 SHOULD BE PRINTED                   52050042
*********************************************************************** 52100042
CONDSNS  STM   R5,R8,XSAVE                                              52150042
         TM    L0(R4),HEXFF             Q/ ANY BITS ON IN BYTE 8        52200042
         BNZ   NXTEST                   YES, SKIP OVERLAY               52250042
         LR    R5,R3                    GET PTR TO LINE POS.            52300042
         LA    R6,L96                   AMOUNT TO BACKSPACE             52350042
         SR    R5,R6                    BACKSPACE                       52400042
         MVC   L0(L4,R5),XXXX           MOVE IN 'XXXX'                  52450042
NXTEST   TM    XB12BIT0,HEXFF           Q/ ANY BITS ON IN BYTE 12       52500042
         BNZ   NXTEST1                  YES, SKIP OVERLAY               52550042
         TM    XB13BIT0,HEXFF           Q/ ANY BITS ON IN BYTE 13       52600042
         BNZ   NXTEST1                  YES, SKIP OVERLAY               52650042
         LR    R5,R3                    GET PTR TO PRINT POS.           52700042
         LA    R6,L64                   AMOUNT TO BACKSPACE PTR         52750042
         SR    R5,R6                    BACKSPACE                       52800042
         MVC   L0(L4,R5),XXXX           MOVE IN 'XXXX'                  52850042
NXTEST1  TM    XB10BIT0,HEXFF           Q/ ANY BITS ON IN BYTE 10       52900042
         BNZ   RETURN                   YES, SKIP OVERLAY               52950042
         LR    R5,R3                    GET PTR TO PRINT POS.           53000042
         LA    R6,L32                   AMOUNT TO BACKSPACE PTR         53050042
         SR    R5,R6                    BACKSPACE                       53100042
         MVC   L0(L4,R5),XXXX           MOVE IN 'XXXX'                  53150042
         B     RETURN                                                   53200042
*********************************************************************** 53250042
*              CHECK IF BYTES 20-27 SHOULD BE PRINTED                   53300042
*********************************************************************** 53350042
CONDSNS1 STM   R5,R8,XSAVE              SAVE REGS                       53400042
         TM    L0(R4),HEX30             Q/ IS BIT 2 OR 3 ON IN BYTE 12  53450042
         BC    5,RETURN                 YES, 1 OR BOTH IS ON            53500042
         LR    R5,R3                    GET PTR TO PRINT POS.           53550042
         LA    R6,L31                   AMOUNT TO BACKSPACE PTR         53600042
         SR    R5,R6                    BACKSPACE PTR                   53650042
         MVC   L0(L30,R5),OVRLAYS       MOVE IN OVERLAY                 53700042
         B     RETURN                                                   53750042
*********************************************************************** 53800042
*              CONVERT RELEASE                                          53850042
*********************************************************************** 53900042
CONVREL  STM   R5,R8,XSAVE                                              53950042
         SR    R6,R6                    CLEAR REG                       54000042
         IC    R6,L0(R4)                GET SYSTEM AND RELEASE VALUES   54050042
         SRDL  R6,L5                    SAVE REL. NO. IN REG 7          54100042
         SLL   R6,L2                    MULT. SYSTEM VALUE BY 4         54150042
         L     R8,XLABELP               GET LABEL PTR                   54200042
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     54250042
         MVC   L0(L4,R8),L0(R6)         MOVE SYSTEM NAME INTO LABEL     54300042
         SR    R6,R6                    CLEAR REG                       54350042
         SLDL  R6,L5                    RETRIEVE RELEASE NO.            54400042
         LTR   R6,R6                    Q/ IS REL. NO. ZERO             54450042
         BZ    NOREL                    YES                             54500042
         CVD   R6,WORK                  CONVERT REL. NO. TO DECIMAL     54550042
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFFER     54600042
         MVZ   L1(L1,R3),L0(R3)         MOVE IN PROPER ZONE             54650042
         B     RETURN                                                   54700042
NOREL    MVC   L0(L4,R3),NONE           MOVE IN 'NONE' FOR RELEASE      54750042
         B     RETURN                                                   54800042
*********************************************************************** 54850042
*              EXPAND RECORD                                            54900042
*********************************************************************** 54950042
EXPNDRTN STM   R5,R8,XSAVE                                              55000042
         ST    R2,SAVE2                 SAVE R2 FOR LATER               55050042
         LA    R5,OBRAREA               PICK UP ADDR OF EXPANDED AREA   55100042
         USING EXPNOBR,R5                                               55150042
         USING NORMOBR,R4                                               55200042
         XC    EXPNOBR(L106),EXPNOBR    CLEAR AREA                      55250042
         TM    SW2B0,HEX20              Q/ IS THIS A SHORT OBR RECORD   55300042
         BO    MOVESHRT                 YES                             55350042
MOVEALL  MVC   EXPNOBR(L106),NORMOBR    MOVE ENTIRE RECORD              55400042
EXPNDRET LR    R2,R5                    SWAP PTRS                       55450042
         B     RETURN                                                   55500042
         USING SHRTOBR,R4                                               55550042
MOVESHRT MVC   EXPNHDRA(L24),SHRTHDRA   MOVE HEADER                     55600042
         MVC   EXPNSDRA(L10),SHRTSDRA   MOVE STATISTICAL AREA           55700042
         B     EXPNDRET                                                 55750042
         DROP  R4,R5                                                    55800042
*********************************************************************** 55850042
*              CLEAR HEX JOBNAME IF SHORT OBR RECORD                    55900042
*********************************************************************** 55950042
NONAME   TM    L0(R4),HEX20             Q/ IS THIS A SHORT OBR RECORD   56000042
         BCR   14,R14                   NO, SO LET HEX JOB NAME PRINT   56050042
         ST    R5,XSAVE                 SAVE WORK REG                   56100042
         LA    R5,L44                   AMOUNT TO BACKSPACE PTR         56150042
         SR    R3,R5                    BACKUP PTR                      56200042
         MVC   L0(L17,R3),BLANKS        CLEAR OUT HEX JOBNAME           56250042
         AR    R3,R5                    RESTORE PTR                     56300042
         L     R5,XSAVE                 RESTORE REG                     56350042
         BR    R14                                                      56400042
*********************************************************************** 56450042
*              DETERMINE IF LONG OR SHORT OBR RECORD                    56500042
*********************************************************************** 56550042
RECTYPE  STM   R5,R8,XSAVE                                              56600042
         LR    R5,R3                    GET PTR TO CUR. DATA PRINT POS. 56650042
         LA    R6,L31                   AMOUNT TO BACKSPACE PTR         56700042
         SR    R5,R6                    BACKSPACE PTR                   56750042
         TM    L0(R4),HEX20             Q/ IS THIS A SHORT OBR RECORD   56800042
         BO    RECSHORT                 YES                             56850042
         MVC   L0(L10,R5),UNITCK        NO, INSERT 'UNIT CHECK' LABEL   56900042
         B     RETURN                                                   56950042
RECSHORT MVC   L0(L10,R5),OVFL          INSERT 'OVERFLOW'               57000042
         B     RETURN                                                   57050042
*********************************************************************** 57100042
*              RESET REG. 2 TO START OF INPUT RECORD                    57150042
*********************************************************************** 57200042
RESETR2  L     R2,SAVE2                 RESTORE REG                     57250042
         BR    R14                                                      57300042
*********************************************************************** 57350042
*              COMMON REGISTER RESTORE AND RETURN                       57400042
*********************************************************************** 57450042
RETURN   LM    R5,R8,XSAVE                                              57500042
         BR    R14                                                      57550042
*********************************************************************** 57600042
*              TEST FOR CONVERTED RECORD - KEY 32                       57650042
*********************************************************************** 57700042
SETCONV  TM    L0(R4),HEX02             Q/ IS CONVERT SWITCH ON         57750042
         BCR   1,R14                    YES                             57800042
         SR    R15,R15                  ZERO IS TO STOP PRINT           57850042
         BR    R14                                                      57900042
*********************************************************************** 57950042
*              SETCPU NO. AND SERIAL NO.                                58000042
*********************************************************************** 58050042
SETCPUNO STM   R5,R8,XSAVE              SAVE REGS                       58100042
         SR    R5,R5                    CLEAR REG                       58150042
         IC    R5,L0(R4)                GET 1ST BYTE OF CPU MODEL NO.   58200042
         SLL   R5,L4                    MAKE ROOM FOR SECOND BYTE       58250042
         IC    R5,L1(R4)                GET 2ND BYTE                    58300042
         LTR   R5,R5                    Q/ IS MODEL NO. ZERO            58350042
         LR    R5,R3                    GET PTR TO CURRENT PRNT POS.    58400042
         BNZ   SETSER                   MODEL NO. IS NOT ZERO           58450042
         LA    R6,L46                   AMOUNT TO BACKSPACE PTR         58500042
         SR    R5,R6                    BACKSPACE PTR                   58550042
         MVC   L0(L29,R5),UNIVERS       INSERT LABEL FOR NONE           58600042
         B     RETURN                                                   58650042
SETSER   LA    R6,L36                   AMOUNT TO BACKSPACE             58700042
         SR    R5,R6                    BACKSPACE PTR                   58750042
         MVC   L0(L10,R5),SERNO         INSERT 'SERIAL NO.'             58800042
         B     RETURN                                                   58850042
*********************************************************************** 58900042
*              SET DATE                                                 58950042
*********************************************************************** 59000042
SETDATE  CLC   L1(L3,R4),ZERO           Q/ IS DATE ZERO                 59050042
         BE    SETDTE                   YES                             59100042
         UNPK  XSAVE(L8),L1(L3,R4)      UNPACK DATE                     59150042
         MVC   L5(L2,R3),XSAVE+L3       MOVE YEAR                       59200042
         MVC   L0(L3,R3),XSAVE+L5       MOVE JULIAN DAY                 59250042
         BR    R14                                                      59300042
SETDTE   MVC   L0(L4,R3),NONE           SET DATE TO NONE                59350042
         BR    R14                                                      59400042
*********************************************************************** 59450042
*              HEX (CONVERT 1 HEX BYTE TO 2 EBCDIC CHARACTER)           59500042
*********************************************************************** 59550042
SETHEX1  MVI   TFLG,X'01'               INDICATE BACKSPACE REQUIRED     59600042
SETHEX   STM   R5,R8,XSAVE              SAVE REGS                       59650042
         LA    R8,CHARS                 GET ADDR OF EBCDIC CHAR. TABLE  59700042
         IC    R7,L0(R4)                PICK UP BYTE TO CONVERT         59750042
         SLL   R7,L24                   MOVE IT TO HI PART OF R7        59800042
         SR    R6,R6                    CLEAR REG                       59850042
         SLDL  R6,L4                    MOVE 4 BITS TO R6               59900042
         AR    R6,R8                    COMPUTE OFFSET INTO CHAR. TABLE 59950042
         TM    TFLG,X'01'               Q/ BACKSPACE REQUIRED           60000042
         BO    PERFCNT                  YES                             60050042
         MVC   L0(L1,R3),L0(R6)         MOVE CHAR TO LINE               60100042
SETHEXX  SR    R6,R6                    CLEAR REG                       60150042
         SLDL  R6,L4                    MOVE LAST 4 BITS TO R6          60200042
         AR    R6,R8                    COMPUTE OFFSET                  60250042
         TM    TFLG,X'01'               Q/ BACKSPACE REQUIRED           60300042
         BO    PERFCNT1                 YES                             60350042
         MVC   L1(L1,R3),L0(R6)         MOVE CHAR TO LINE + 1           60400042
         B     RETURN                                                   60450042
PERFCNT  LR    R5,R3                    GET PTR TO PRINT POS.           60500042
         LA    R8,L29                   SET UP FOR BACKSPACE            60550042
         SR    R5,R8                    BACKSPACE                       60600042
         MVC   L0(L1,R5),L0(R6)         MOVE CHAR INTO LINE             60650042
         LA    R8,CHARS                 RESTORE REG 8                   60700042
         B     SETHEXX                  RETURN TO MAINLINE              60750042
PERFCNT1 MVC   L1(L1,R5),L0(R6)         MOVE CHAR INTO LINE             60800042
         MVI   TFLG,X'00'               CLEAR FLAG                      60850042
         B     RETURN                                                   60900042
*********************************************************************** 60950042
*              HEX (CONVERT 2 HEX BYTES TO 4 EBCDIC CHARACTERS)         61000042
*********************************************************************** 61050042
SETHEX2  STM   R5,R8,XSAVE              SAVE REGS                       61100042
         LA    R8,CHARS                 GET ADDR OF EBCDIC CHAR. TABLE  61150042
         IC    R7,L0(R4)                PICK UP BYTE TO CONVERT         61200042
         SLL   R7,L24                   MOVE IT TO HI PART OF R7        61250042
         SR    R6,R6                    CLEAR REG                       61300042
         SLDL  R6,L4                    MOVE 4 BITS TO R6               61350042
         AR    R6,R8                    COMPUTE OFFSET INTO CHAR. TABLE 61400042
         MVC   L0(L1,R3),L0(R6)         MOVE CHAR TO LINE               61450042
         SR    R6,R6                    CLEAR                           61500042
         SLDL  R6,L4                    MOVE LAST 4 BITS TO R6          61550042
         AR    R6,R8                    COMPUTE OFFSET                  61600042
         MVC   L1(L1,R3),L0(R6)         MOVE CHAR TO LINE + 1           61650042
         IC    R7,L1(R4)                PICK UP 2ND INPUT BYTE          61700042
         SLL   R7,L24                   MOVE IT TO HI PART OF R7        61750042
         SR    R6,R6                    CLEAR REG                       61800042
         SLDL  R6,L4                    MOVE 4 BITS TO R6               61850042
         AR    R6,R8                    COMPUTE OFFSET INTO CHAR. TABLE 61900042
         MVC   L2(L1,R3),L0(R6)         MOVE CHAR TO LINE + 2           61950042
         SR    R6,R6                    CLEAR                           62000042
         SLDL  R6,L4                    MOVE LAST 4 BITS TO R6          62050042
         AR    R6,R8                    COMPUTE OFFSET                  62100042
         MVC   L3(L1,R3),L0(R6)         MOVE CHAR TO LINE + 3           62150042
         B     RETURN                                                   62200042
*********************************************************************** 62250042
*              SET PROGRAM NAME                                         62300042
*********************************************************************** 62350042
SETPGMN  DS    0H                                                       62400042
         TM    SW2B0,HEX20              Q/ IS THIS A SHORT OBR RECORD   62450042
         BCR   1,R14                    YES, THUS NO JOB ID             62500042
         MVC   L0(L12,R3),JOBID         MOVE IN 'JOB IDENTITY'          62550042
         MVC   L13(L8,R3),XPGN1         MOVE IN JOB NAME                62600042
         BR    R14                                                      62650042
*********************************************************************** 62700042
*              ADVANCE DATA PTR TO NEXT POSITION                        62750042
*********************************************************************** 62800042
SKIPPER  BR    R14                      RETURN                          62850042
*********************************************************************** 62900042
*              DETERMINE SENSE DATA TYPE                                62950042
*********************************************************************** 63000042
SNSTYPE  TM    XB3SNSTY,HEX01           Q/ IS THIS HARDWARE VERIF. SNS  63050042
         BO    HARDWARE                 YES                             63100042
         TM    XB3SNSTY,HEX02           Q/ IS THIS DATA-RELATED SENSE   63150042
         BO    DATAREL                  YES                             63200042
SNSRET   BR    R14                      MUST BE EQUIPMENT-RELATED SNS   63250042
HARDWARE STM   R5,R8,XSAVE                                              63300042
         LA    R5,HWSENSE-4             GET ADR OF 1ST HW LINE          63350042
         ST    R5,XR9PTR                SAVE PTR                        63400042
         L     R5,HWLABAD               GET ADR OF 1ST HW LABELS        63450042
         ST    R5,XLABELP               SAVE PTR                        63500042
         SR    R15,R15                  DONT PRINT THIS LINE            63550042
         B     RETURN                                                   63600042
DATAREL  STM   R5,R8,XSAVE                                              63650042
         LA    R5,DATSENSE-4            GET ADR OF 1ST DAT-REL LINE     63700042
         ST    R5,XR9PTR                SAVE PTR                        63750042
         L     R5,DATLABAD              GET ADR OF 1ST DAT-REL LABEL    63800042
         ST    R5,XLABELP               SAVE PTR                        63850042
         SR    R15,R15                  DONT PRINT THIS LINE            63900042
         B     RETURN                                                   63950042
*********************************************************************** 64000042
*              ADVANCE PRINT POSITION PTR 1 SPACES                      64050042
*********************************************************************** 64100042
SPACER1  LA    R3,L1(R3)                ADVANCE PRINT POS. PTR 1 SPACE  64150042
         BR    R14                                                      64200042
*********************************************************************** 64250042
*              ADVANCE PRINT POSITION PTR 16 SPACES                     64300042
*********************************************************************** 64350042
SPACER16 LA    R3,L16(R3)               UP PTR BY 16                    64400042
         BR    R14                                                      64450042
*********************************************************************** 64500042
*              MP TEST                                                  64550042
*********************************************************************** 64600042
TESTMP   TM    L0(R4),HEX10             Q/ IS THIS A MP RECORD          64650042
         BZ    NOMP                     NO                              64700042
         MVC   L0(L20,R3),MPCPU         MOVE IN MP LABEL                64750042
         TM    L0(R4),HEX08             Q/ IS IT CPUA OR CPUB           64800042
         BO    MPB                      IT IS CPUB                      64850042
         MVI   L21(R3),A                MOVE 'A' IN PRINT LINE          64900042
NOMP     BR    R14                                                      64950042
MPB      MVI   L21(R3),B                MOVE 'B' IN PRINT LINE          65000042
         BR    R14                                                      65050042
*********************************************************************** 65100042
*              IF SHORT RECORD THEN SKIP TO STAT. EDIT SETS             65150042
*********************************************************************** 65200042
TESTSHRT TM    SW2B0,HEX20              Q/ IS THIS A SHORT OBR RECORD   65250042
         BZ    SKIPPER                  NO                              65300042
         BCTR  R3,R0                    BACK UP POS. PTR 1 SPACE        65350042
         MVC   L0(L6,R3),BLANKS         CLEAR HEX SECONDARY CUA         65400042
         MVC   XR9PTR(L8),SHRTADCN      POINT TO STAT. EDIT SETS        65450042
         BR    R14                                                      65500042
*********************************************************************** 65550042
*              LINE/LABEL SETS                                          65600042
*********************************************************************** 65650042
ENTRIES  DS    0F                                                       65700042
         DC    XL4'00'             FORMAT 1                             65750042
         DC    XL4'00'             FORMAT 2                             65800042
         DC    A(LABELS)           LABEL PTR                            65850042
         DC    H'0'                DISP                                 65900042
*********************************************************************** 65950042
*        SKIP TO CHANNEL 1                                              66000042
*********************************************************************** 66050042
         DC    X'02'                                                    66100042
         DC    X'000B8B00'                                              66150042
         DC    AL.12(XDUM1-GUS1),XL.4'D'   = ROUTINE XDUM1,EXPNDRTN     66200042
         DC    AL.4(0),AL.12(EXPNDRTN-IFCEGUS1)                         66250042
*********************************************************************** 66300042
         LINE  (55,23),(1,35),SKIP=1                                    66350042
         ROUTINE SW2B0,RECTYPE                                          66400042
         HEX   XMODEL,0,2B                                              66450042
         HEX   XSER,0,3B                                                66500042
         ROUTINE XMODEL,SETCPUNO                                        66550042
         LABEL '---RECORD ENTRY TYPE -','   SOURCE - OUTBOARD',        X66600042
               'MODEL-'                                                 66650042
*********************************************************************** 66700042
         LINE  (16,1),(4,1)                                             66750042
         ROUTINE XRELN,CONVREL                                          66800042
         LABEL 'XXXX REL.'                                              66850042
*********************************************************************** 66900042
         LINE  (69,1),(31,19)                                           66950042
         ROUTINE XPGN1,SETPGMN                                          67000042
         LABEL 'DAY YEAR','HH MM SS.TH'                                 67050042
*********************************************************************** 67100042
         LINE  (31,19),(25,19)                                          67150042
         ROUTINE XDATE,SETDATE                                          67200042
         HEX   XTIME,1,4B                                               67250042
         ROUTINE XDUM1,SKIPPER                                          67300042
         HEX   XPGN1,B6,4B                                              67350042
         HEX   XPGN2,B16,4B                                             67400042
         ROUTINE SW2B0,NONAME                                           67450042
         LABEL 'DATE-','TIME-'                                          67500042
*********************************************************************** 67550042
         LINE  (1,1),(1,1)                                              67600042
         ROUTINE SW2B0,TESTMP                                           67650042
         LABEL ''                                                       67700042
*********************************************************************** 67750042
         LINE  ,(1,1),SKIP=2                                            67800042
         ROUTINE XDUM1,SETCONV                                          67850042
         LABEL   'OBR RECORD CONVERTED TO THE STANDARD FORMAT'          67900042
*********************************************************************** 67950042
         LINE  ,(2,32),SKIP=1                                           68000042
         LABEL 'DEVICE TYPE','3838'                                     68050042
*********************************************************************** 68100042
         LINE  (34,1),(2,1)                                             68150042
         HEX   XCUA,B0,3B                                               68200042
         LABEL 'PRIMARY   CHANNEL UNIT ADDRESS'                         68250042
*********************************************************************** 68300042
         LINE  ,,SKIP=2                                                 68350042
         HEX   XCUA2,B0,3B                                              68400042
         ROUTINE XDUM1,TESTSHRT                                         68450042
         LABEL 'ALTERNATE CHANNEL UNIT ADDRESS'                         68500042
*********************************************************************** 68550042
         LINE  ,(23,38),SKIP=1                                          68600042
         LABEL 'CC   CA   FL     CT','K    CA   US CS  CT'              68650042
*********************************************************************** 68700042
         LINE  (23,3),(5,51),SKIP=2                                     68750042
         HEX   XFCCWCC,0,1B                                             68800042
         HEX   XFCCWDA,0,3B                                             68850042
         ROUTINE XDUM1,SPACER1                                          68900042
         HEX   XFCCWFL,0,1B                                             68950042
         HEX   XZERO,0,1B                                               69000042
         HEX   XFCCWCT,0,2B                                             69050042
         ROUTINE XDUM1,SPACER16                                         69100042
         HEX   XCSWK,0,1B                                               69150042
         HEX   XCSWCA,0,3B                                              69200042
         ROUTINE XDUM1,SPACER1                                          69250042
         ROUTINE XCSWATTN,SETHEX                                        69300042
         ROUTINE XCSWPCI,SETHEX                                         69350042
         HEX   XCSWCT,0,2B                                              69400042
         LABEL 'FAILING CCW','CSW'                                      69450042
*********************************************************************** 69500042
         LINE  ,(5,28)                                                  69550042
         ROUTINE XDUM1,SKIPPER                                          69600042
         LABEL 'UNIT STATUS','CHANNEL STATUS','STATISTICAL DATA',      X69650042
               'STATISTICAL DATA'                                       69700042
*********************************************************************** 69750042
         LINE  (20,28),(3,26),SKIP=1                                    69800042
         BIN   XCSWATTN                                                 69850042
         BIN   XCSWPCI                                                  69900042
         HEX   SDR1,0,1L                                                69950042
         HEX   SDR1,0,1R                                                70000042
         LABEL 'ATTENTION','PRGM-CTLD INTRPT','DATA CHECK (READ)',     X70050042
               '    NOT USED'                                           70100042
*********************************************************************** 70150042
         LINE                                                           70200042
         BIN   XCSWSM                                                   70250042
         BIN   XCSWSILI                                                 70300042
         HEX   SDR2,0,1L                                                70350042
         HEX   SDR2,0,1R                                                70400042
         LABEL 'STATUS MODIFIER','INCORRECT LENGTH',                   X70450042
               'DATA CHECK (WRITE)','    NOT USED'                      70500042
*********************************************************************** 70550042
         LINE                                                           70600042
         BIN   XCSWCUE                                                  70650042
         BIN   XCSWPC                                                   70700042
         HEX   SDR3,0,1L                                                70750042
         HEX   SDR3,0,1R                                                70800042
         LABEL 'CONTROL UNIT END','PROGRAM CHECK',                     X70850042
               'INTERVENTION REQD','    NOT USED'                       70900042
*********************************************************************** 70950042
         LINE                                                           71000042
         BIN   XCSWBSY                                                  71050042
         BIN   XCSWPCHK                                                 71100042
         HEX   SDR4,0,1L                                                71150042
         HEX   SDR4,0,1R                                                71200042
         LABEL 'BUSY','PROTECTION CHECK','BUS OUT PARITY',             X71250042
               '    NOT USED'                                           71300042
*********************************************************************** 71350042
         LINE                                                           71400042
         BIN   XCSWCE                                                   71450042
         BIN   XCSWCDC                                                  71500042
         HEX   SDR5,0,1L                                                71550042
         HEX   SDR5,0,1R                                                71600042
         LABEL 'CHANNEL END','CHAN DATA CHECK','EQUIPMENT CHECK',      X71650042
               '    NOT USED'                                           71700042
*********************************************************************** 71750042
         LINE                                                           71800042
         BIN   XCSWDE                                                   71850042
         BIN   XCSWCCC                                                  71900042
         HEX   SDR6,0,1L                                                71950042
         HEX   SDR6,0,1R                                                72000042
         LABEL 'DEVICE END','CHAN CTL CHECK','NOT USED','    NOT USED'  72050042
*********************************************************************** 72100042
         LINE                                                           72150042
         BIN   XCSWUC                                                   72200042
         BIN   XCSWICC                                                  72250042
         HEX   SDR7,0,1L                                                72300042
         HEX   SDR7,0,1R                                                72350042
         LABEL 'UNIT CHECK','I/F CTL CHECK','NOT USED','    NOT USED'   72400042
*********************************************************************** 72450042
         LINE  ,,SKIP=3                                                 72500042
         BIN   XCSWUE                                                   72550042
         BIN   XCSWCH                                                   72600042
         HEX   SDR8,0,1L                                                72650042
         HEX   SDR8,0,1R                                                72700042
         LABEL 'UNIT EXCEPTION','CHAINING CHECK','NOT USED',           X72750042
               '    CHAN DATA CHK'                                      72800042
*********************************************************************** 72850042
         LINE  ,(1,43)                                                  72900042
         LABEL 'SENSE BYTE DATA - FIXED FORMAT - (BYTES 0-7)'           72950042
*********************************************************************** 73000042
         LINE  ,(5,24),SKIP=2                                           73050042
         LABEL 'STANDARD STATUS (+0)','REQUEST STATUS (+1)',           X73100042
               'DETECTING COMP (+2)','CIT OPERATION CODE (+4,+5)'       73150042
*********************************************************************** 73200042
         LINE  (23,23),(3,24),SKIP=1                                    73250042
         BIN   XB0CMDR                                                  73300042
         BIN   XB1RST                                                   73350042
         BIN   XB2CPMC                                                  73400042
         HEX   XB4B5,B6,2B                                              73450042
         LABEL 'COMMAND REJECT','RESTARTABLE','CP MACHINE CHK'          73500042
*********************************************************************** 73550042
         LINE                                                           73600042
         BIN   XB0INTRQ                                                 73650042
         BIN   XB1URERR                                                 73700042
         BIN   XB2IO                                                    73750042
         LABEL 'INTERVENTION REQD','UNRELATED ERROR','I/O'              73800042
*********************************************************************** 73850042
         LINE                                                           73900042
         BIN   XB0BUSC                                                  73950042
         BIN   XB1DDEP                                                  74000042
         BIN   XB2ARELM                                                 74050042
         LABEL 'BUS OUT PARITY','DATA-DEPENDENT','ARITH ELEMENT'        74100042
*********************************************************************** 74150042
         LINE                                                           74200042
         BIN   XB0ECHK                                                  74250042
         BIN   XB1INVP                                                  74300042
         BIN   XB2DTC                                                   74350042
         LABEL 'EQUIPMENT CHECK','INVALID PASSWORD','DATA TRANS CTLR'   74400042
*********************************************************************** 74450042
         LINE                                                           74500042
         BIN   XB0DCHK                                                  74550042
         BIN   XB1NU1                                                   74600042
         BIN   XB2CPEXC                                                 74650042
         LABEL 'DATA CHECK','NOT USED','CP EXECUTIVE',                 X74700042
               '  CIT OPERATION OFFSET (+6,+7)'                         74750042
*********************************************************************** 74800042
         LINE                                                           74850042
         BIN   XB0NOTIN                                                 74900042
         BIN   XB1NU2                                                   74950042
         BIN   XB2PERM                                                  75000042
         LABEL 'NOT USED','NOT USED','PERF MONITOR'                     75050042
*********************************************************************** 75100042
         LINE                                                           75150042
         BIN   XB0NU2                                                   75200042
         BIN   XB1NU3                                                   75250042
         BIN   XB2NU1                                                   75300042
         HEX   XB6B7,B6,2B                                              75350042
         LABEL 'NOT USED','NOT USED','NOT USED'                         75400042
*********************************************************************** 75450042
         LINE  ,,SKIP=3                                                 75500042
         BIN   XB0NU3                                                   75550042
         BIN   XB1NU4                                                   75600042
         BIN   XB2NU2                                                   75650042
         LABEL 'NOT USED','NOT USED','NOT USED'                         75700042
*********************************************************************** 75750042
         LINE  ,(1,36),SKIP=2                                           75800042
         ROUTINE XB3SNSTY,SNSTYPE                                       75850042
         LABEL 'SENSE BYTE DATA - EXTENDED FORMAT 0 ',                 X75900042
               '- EQUIPMENT-RELATED (BYTES 8-31)'                       75950042
*********************************************************************** 76000042
         LINE  ,(3,18)                                                  76050042
         LABEL 'STOR PAR (+8)','ADDR CHK (+9)','CP STAT (+10)',        X76100042
               'AE STAT (+11)','CP EXEC (+12)','CP EXEC (+13)'          76150042
*********************************************************************** 76200042
         LINE  (14,18),(3,18),SKIP=1                                    76250042
         BIN   XB8BIT0                                                  76300042
         BIN   XB9BIT0                                                  76350042
         BIN   XB10BIT0                                                 76400042
         BIN   XB11BIT0                                                 76450042
         BIN   XB12BIT0                                                 76500042
         BIN   XB13BIT0                                                 76550042
         LABEL 'BULK STOR','BULK STOR','ILL MICRO','MACH CHK',         X76600042
               'INV INSTR','INV AD REF'                                 76650042
*********************************************************************** 76700042
         LINE                                                           76750042
         BIN   XB8BIT1                                                  76800042
         BIN   XB9BIT1                                                  76850042
         BIN   XB10BIT1                                                 76900042
         BIN   XB11BIT1                                                 76950042
         BIN   XB12BIT1                                                 77000042
         BIN   XB13BIT1                                                 77050042
         LABEL 'CP PGM ST','CP PGM ST','EDB T/O','WS CONFLCT',         X77100042
               'DIV ZERO','INIT ERR'                                    77150042
*********************************************************************** 77200042
         LINE                                                           77250042
         BIN   XB8BIT2                                                  77300042
         BIN   XB9BIT2                                                  77350042
         BIN   XB10BIT2                                                 77400042
         BIN   XB11BIT2                                                 77450042
         BIN   XB12BIT2                                                 77500042
         BIN   XB13BIT2                                                 77550042
         LABEL 'CP CTL ST','NOT USED','EDB PAR R','NOT USED',          X77600042
               'I/O INIT','BUF SPACE'                                   77650042
*********************************************************************** 77700042
         LINE                                                           77750042
         BIN   XB8BIT3                                                  77800042
         BIN   XB9BIT3                                                  77850042
         BIN   XB10BIT3                                                 77900042
         BIN   XB11BIT3                                                 77950042
         BIN   XB12BIT3                                                 78000042
         BIN   XB13BIT3                                                 78050042
         LABEL 'AE WRK ST','NOT USED','EDB PAR O','NOT USED',          X78100042
               'INV IOCW','NOT USED'                                    78150042
*********************************************************************** 78200042
         LINE                                                           78250042
         BIN   XB8BIT4                                                  78300042
         BIN   XB9BIT4                                                  78350042
         BIN   XB10BIT4                                                 78400042
         BIN   XB11BIT4                                                 78450042
         BIN   XB12BIT4                                                 78500042
         BIN   XB13BIT4                                                 78550042
         LABEL 'AE CTL ST','NOT USED','NOT USED','NOT USED',           X78600042
               'DTC INIT','NOT USED'                                    78650042
*********************************************************************** 78700042
         LINE                                                           78750042
         BIN   XB8BIT5                                                  78800042
         BIN   XB9BIT5                                                  78850042
         BIN   XB10BIT5                                                 78900042
         BIN   XB11BIT5                                                 78950042
         BIN   XB12BIT5                                                 79000042
         BIN   XB13BIT5                                                 79050042
         LABEL 'NOT USED','NOT USED','NOT USED','NOT USED',            X79100042
               'INV TCB','NOT USED'                                     79150042
*********************************************************************** 79200042
         LINE                                                           79250042
         BIN   XB8BIT6                                                  79300042
         BIN   XB9BIT6                                                  79350042
         BIN   XB10BIT6                                                 79400042
         BIN   XB11BIT6                                                 79450042
         BIN   XB12BIT6                                                 79500042
         BIN   XB13BIT6                                                 79550042
         LABEL 'NOT USED','NOT USED','NOT USED','NOT USED',            X79600042
               'AE INIT','NOT USED'                                     79650042
*********************************************************************** 79700042
         LINE  ,,SKIP=3                                                 79750042
         BIN   XB8BIT7                                                  79800042
         BIN   XB9BIT7                                                  79850042
         BIN   XB10BIT7                                                 79900042
         BIN   XB11BIT7                                                 79950042
         BIN   XB12BIT7                                                 80000042
         BIN   XB13BIT7                                                 80050042
         LABEL 'NOT USED','NOT USED','NOT USED','NOT USED',            X80100042
               'INV AFCW','NOT USED'                                    80150042
*********************************************************************** 80200042
         LINE  ,(21,28),SKIP=2                                          80250042
         LABEL 'STORAGE CARD (+14,+15)','CP PGM STOR ADDR (+16,+17)',  X80300042
               '             CP CSAR (+18,+1','9)'                      80350042
*********************************************************************** 80400042
         LINE  (36,32)                                                  80450042
         ROUTINE XB14BIT0,SETHEX2                                       80500042
         ROUTINE XB16BIT0,SETHEX2                                       80550042
         ROUTINE XB18BIT0,SETHEX2                                       80600042
         ROUTINE XB8BIT0,CONDSNS                                        80650042
         LABEL ''                                                       80700042
*********************************************************************** 80750042
         LINE  ,(63,36),SKIP=1                                          80800042
         LABEL 'CC FL ST   CNT    SS      ADDR'                         80850042
*********************************************************************** 80900042
         LINE  (64,3),(32,72)                                           80950042
         HEX   XB20,0,1L                                                81000042
         HEX   XB20,B1,1R                                               81050042
         HEX   XB21,B1,1B                                               81100042
         HEX   XB22,0,1B                                                81150042
         HEX   XB23,B1,1B                                               81200042
         HEX   XB24,0,1L                                                81250042
         HEX   XB24,B1,1R                                               81300042
         HEX   XB25,0,1L                                                81350042
         HEX   XB25,B1,1R                                               81400042
         HEX   XB26XB27,B2,2B                                           81450042
         ROUTINE XB12BIT0,CONDSNS1                                      81500042
         LABEL 'FAILING IOCW (+20-+27)'                                 81550042
*********************************************************************** 81600042
DUMPCODE LINE  ,,SKIP=1                                                 81650042
         ROUTINE XDUM1,RESETR2                                          81700042
         LABEL ''                                                       81750042
*********************************************************************** 81800042
         DC    X'FF'                                                    81850042
         DC    XL2'006A'         RECORD LENGTH                          81900042
         DC    XL2'0020'         LENGTH OF HDR                          81950042
         DC    XL2'0020'         DISP. FOR START OF DATA                82000042
SHRTOBRL LABEL ''                                                       82050042
*********************************************************************** 82100042
SHRTOBRS LINE  ,(1,1),SKIP=2                                            82150042
         LABEL 'STATISTICAL DATA'                                       82200042
*********************************************************************** 82250042
         LINE  (21,30),(1,30),SKIP=1                                    82300042
         HEX   SDR1,0,1L                                                82350042
         HEX   SDR1,0,1R                                                82400042
         LABEL 'DATA CHECK (READ)','NOT USED'                           82450042
*********************************************************************** 82500042
         LINE                                                           82550042
         HEX   SDR2,0,1L                                                82600042
         HEX   SDR2,0,1R                                                82650042
         LABEL 'DATA CHECK (WRITE)','NOT USED'                          82700042
*********************************************************************** 82750042
         LINE                                                           82800042
         HEX   SDR3,0,1L                                                82850042
         HEX   SDR3,0,1R                                                82900042
         LABEL 'INTERVENTION REQD','NOT USED'                           82950042
*********************************************************************** 83000042
         LINE                                                           83050042
         HEX   SDR4,0,1L                                                83100042
         HEX   SDR4,0,1R                                                83150042
         LABEL 'BUS CUT PARITY','NOT USED'                              83200042
*********************************************************************** 83250042
         LINE                                                           83300042
         HEX   SDR5,0,1L                                                83350042
         HEX   SDR5,0,1R                                                83400042
         LABEL 'EQUIPMENT CHECK','NOT USED'                             83450042
*********************************************************************** 83500042
         LINE                                                           83550042
         HEX   SDR6,0,1L                                                83600042
         HEX   SDR6,0,1R                                                83650042
         LABEL 'NOT USED','NOT USED'                                    83700042
*********************************************************************** 83750042
         LINE                                                           83800042
         HEX   SDR7,0,1L                                                83850042
         HEX   SDR7,0,1R                                                83900042
         LABEL 'NOT USED','NOT USED'                                    83950042
*********************************************************************** 84000042
         LINE                                                           84050042
         HEX   SDR8,0,1L                                                84100042
         HEX   SDR8,0,1R                                                84150042
         LABEL 'NOT USED','CHAN DATA CHECK'                             84200042
*********************************************************************** 84250042
         LINE  ,,SKIP=2                                                 84300042
         ROUTINE XDUM1,RESETR2                                          84350042
         LABEL ''                                                       84400042
*********************************************************************** 84450042
         DC    X'FF'                                                    84500042
         DC    XL2'0022'         RECORD LENGTH                          84550042
         DC    XL2'0010'         LENGTH OF HDR                          84600042
         DC    XL2'0010'         DISP. FOR START OF DATA                84650042
HWLABEL  LABEL ''                                                       84700042
*********************************************************************** 84750042
HWSENSE  LINE  ,(1,38),SKIP=2                                           84800042
         LABEL 'SENSE BYTE DATA - EXTENDED FORMAT 1 - ',               X84850042
               'HARDWARE VERIFICATION (BYTES 8-19)'                     84900042
*********************************************************************** 84950042
         LINE  ,(3,42)                                                  85000042
         LABEL 'PERF MON EXEC CNT (+8)      PM ERR STAT    ',          X85050042
               '(+10)  (+11)  (+12)  (+13)  (+14)  (+15)  ',           X85100042
               '(+16)  (+17)  (+18)  (+19)'                             85150042
*********************************************************************** 85200042
         LINE  (41,7),(31,1),SKIP=1                                     85250042
         ROUTINE XB8BIT0,SETHEX1                                        85300042
         BIN   XB10BIT0                                                 85350042
         BIN   XB11BIT0                                                 85400042
         BIN   XB12BIT0                                                 85450042
         BIN   XB13BIT0                                                 85500042
         BIN   XB14BIT0                                                 85550042
         BIN   XB15BIT0                                                 85600042
         BIN   XB16BIT0                                                 85650042
         BIN   XB17BIT0                                                 85700042
         BIN   XB18BIT0                                                 85750042
         BIN   XB19BIT0                                                 85800042
         LABEL 'CP FAILURE'                                             85850042
*********************************************************************** 85900042
         LINE  (48,7),(31,1)                                            85950042
         BIN   XB10BIT1                                                 86000042
         BIN   XB11BIT1                                                 86050042
         BIN   XB12BIT1                                                 86100042
         BIN   XB13BIT1                                                 86150042
         BIN   XB14BIT1                                                 86200042
         BIN   XB15BIT1                                                 86250042
         BIN   XB16BIT1                                                 86300042
         BIN   XB17BIT1                                                 86350042
         BIN   XB18BIT1                                                 86400042
         BIN   XB19BIT1                                                 86450042
         LABEL 'AE FAILURE'                                             86500042
*********************************************************************** 86550042
         LINE                                                           86600042
         BIN   XB10BIT2                                                 86650042
         BIN   XB11BIT2                                                 86700042
         BIN   XB12BIT2                                                 86750042
         BIN   XB13BIT2                                                 86800042
         BIN   XB14BIT2                                                 86850042
         BIN   XB15BIT2                                                 86900042
         BIN   XB16BIT2                                                 86950042
         BIN   XB17BIT2                                                 87000042
         BIN   XB18BIT2                                                 87050042
         BIN   XB19BIT2                                                 87100042
         LABEL 'BULK STOR'                                              87150042
*********************************************************************** 87200042
         LINE  (48,7),(3,28)                                            87250042
         BIN   XB10BIT3                                                 87300042
         BIN   XB11BIT3                                                 87350042
         BIN   XB12BIT3                                                 87400042
         BIN   XB13BIT3                                                 87450042
         BIN   XB14BIT3                                                 87500042
         BIN   XB15BIT3                                                 87550042
         BIN   XB16BIT3                                                 87600042
         BIN   XB17BIT3                                                 87650042
         BIN   XB18BIT3                                                 87700042
         BIN   XB19BIT3                                                 87750042
         LABEL 'PERF MON ERR CNT (+9)','DTC FAILURE'                    87800042
*********************************************************************** 87850042
         LINE  (48,7),(31,1)                                            87900042
         BIN   XB10BIT4                                                 87950042
         BIN   XB11BIT4                                                 88000042
         BIN   XB12BIT4                                                 88050042
         BIN   XB13BIT4                                                 88100042
         BIN   XB14BIT4                                                 88150042
         BIN   XB15BIT4                                                 88200042
         BIN   XB16BIT4                                                 88250042
         BIN   XB17BIT4                                                 88300042
         BIN   XB18BIT4                                                 88350042
         BIN   XB19BIT4                                                 88400042
         LABEL 'NOT USED'                                               88450042
*********************************************************************** 88500042
         LINE  (41,7),(31,1)                                            88550042
         ROUTINE XB9BIT0,SETHEX1                                        88600042
         BIN   XB10BIT5                                                 88650042
         BIN   XB11BIT5                                                 88700042
         BIN   XB12BIT5                                                 88750042
         BIN   XB13BIT5                                                 88800042
         BIN   XB14BIT5                                                 88850042
         BIN   XB15BIT5                                                 88900042
         BIN   XB16BIT5                                                 88950042
         BIN   XB17BIT5                                                 89000042
         BIN   XB18BIT5                                                 89050042
         BIN   XB19BIT5                                                 89100042
         LABEL 'NOT USED'                                               89150042
*********************************************************************** 89200042
         LINE  (48,7),(31,1)                                            89250042
         BIN   XB10BIT6                                                 89300042
         BIN   XB11BIT6                                                 89350042
         BIN   XB12BIT6                                                 89400042
         BIN   XB13BIT6                                                 89450042
         BIN   XB14BIT6                                                 89500042
         BIN   XB15BIT6                                                 89550042
         BIN   XB16BIT6                                                 89600042
         BIN   XB17BIT6                                                 89650042
         BIN   XB18BIT6                                                 89700042
         BIN   XB19BIT6                                                 89750042
         LABEL 'NOT USED'                                               89800042
*********************************************************************** 89850042
         LINE                                                           89900042
         BIN   XB10BIT7                                                 89950042
         BIN   XB11BIT7                                                 90000042
         BIN   XB12BIT7                                                 90050042
         BIN   XB13BIT7                                                 90100042
         BIN   XB14BIT7                                                 90150042
         BIN   XB15BIT7                                                 90200042
         BIN   XB16BIT7                                                 90250042
         BIN   XB17BIT7                                                 90300042
         BIN   XB18BIT7                                                 90350042
         BIN   XB19BIT7                                                 90400042
         LABEL 'NOT USED'                                               90450042
*********************************************************************** 90500042
         LINE  ,,SKIP=2                                                 90550042
         ROUTINE XDUM1,RESETR2                                          90600042
         LABEL ''                                                       90650042
*********************************************************************** 90700042
         DC    X'FF'                                                    90750042
         DC    XL2'006A'         RECORD LENGTH                          90800042
         DC    XL2'0020'         LENGTH OF HDR                          90850042
         DC    XL2'0020'         DISP. FOR START OF DATA                90900042
DATLABEL LABEL ''                                                       90950042
*********************************************************************** 91000042
DATSENSE LINE  ,(1,38),SKIP=2                                           91050042
         LABEL 'SENSE BYTE DATA - EXTENDED FORMAT 2 - ',               X91100042
               'DATA-RELATED (BYTES 8-15)'                              91150042
*********************************************************************** 91200042
         LINE  ,(3,27)                                                  91250042
         LABEL ' DATA-DEP STAT (+8)','  DATA-DEP STAT (+9)',           X91300042
               'AE DATA CHK STAT (+10)','AE DATA CHK STAT (+11)'        91350042
*********************************************************************** 91400042
         LINE  (20,28),(3,28),SKIP=1                                    91450042
         BIN   XB8BIT0                                                  91500042
         BIN   XB9BIT0                                                  91550042
         BIN   XB10BIT0                                                 91600042
         BIN   XB11BIT0                                                 91650042
         LABEL 'I/O LIMIT CHECK','CIT INDEX OVFL','NOT USED',          X91700042
               'ADDER A EXP OVFL'                                       91750042
*********************************************************************** 91800042
         LINE                                                           91850042
         BIN   XB8BIT1                                                  91900042
         BIN   XB9BIT1                                                  91950042
         BIN   XB10BIT1                                                 92000042
         BIN   XB11BIT1                                                 92050042
         LABEL 'I/O LENGTH ERR','CIT INDX DIV CHK','NOT USED',         X92100042
               'ADDER A EXP UNFL'                                       92150042
*********************************************************************** 92200042
         LINE                                                           92250042
         BIN   XB8BIT2                                                  92300042
         BIN   XB9BIT2                                                  92350042
         BIN   XB10BIT2                                                 92400042
         BIN   XB11BIT2                                                 92450042
         LABEL 'CHAN PGM CORRES','BULK ST LIM CHK','NOT USED',         X92500042
               'ADDER A INT OVFL'                                       92550042
*********************************************************************** 92600042
         LINE                                                           92650042
         BIN   XB8BIT3                                                  92700042
         BIN   XB9BIT3                                                  92750042
         BIN   XB10BIT3                                                 92800042
         BIN   XB11BIT3                                                 92850042
         LABEL 'CIT LIMIT CHECK','DTC CONVERT','RECP EST EXP OVF',     X92900042
               'ADD A RT EXP LRG'                                       92950042
*********************************************************************** 93000042
         LINE                                                           93050042
         BIN   XB8BIT4                                                  93100042
         BIN   XB9BIT4                                                  93150042
         BIN   XB10BIT4                                                 93200042
         BIN   XB11BIT4                                                 93250042
         LABEL 'INV CIT OPER','SELEC ERROR STOP','MULT EXP OVFL',      X93300042
               'ADDER B EXP OVFL'                                       93350042
*********************************************************************** 93400042
         LINE                                                           93450042
         BIN   XB8BIT5                                                  93500042
         BIN   XB9BIT5                                                  93550042
         BIN   XB10BIT5                                                 93600042
         BIN   XB11BIT5                                                 93650042
         LABEL 'INV CIT PARAM','NOT USED','MULT EXP UNFL',             X93700042
               'ADDER B EXP UNFL'                                       93750042
*********************************************************************** 93800042
         LINE                                                           93850042
         BIN   XB8BIT6                                                  93900042
         BIN   XB9BIT6                                                  93950042
         BIN   XB10BIT6                                                 94000042
         BIN   XB11BIT6                                                 94050042
         LABEL 'INV CIT BRANCH','NOT USED','INT MULT OVFL',            X94100042
               'ADDER B INT OVFL'                                       94150042
*********************************************************************** 94200042
         LINE  ,,SKIP=3                                                 94250042
         BIN   XB8BIT7                                                  94300042
         BIN   XB9BIT7                                                  94350042
         BIN   XB10BIT7                                                 94400042
         BIN   XB11BIT7                                                 94450042
         LABEL 'CIT BR CNT EXCD','NOT USED','UNNORM RECP EST',         X94500042
               'ADD B RT EXP LRG'                                       94550042
*********************************************************************** 94600042
         LINE  (76,2),(31,1)                                            94650042
         ROUTINE XB12BIT0,BRCNT                                         94700042
         LABEL 'CIT SUCCESSFUL BRANCH COUNT (+12-+15)'                  94750042
*********************************************************************** 94800042
         LINE  ,,SKIP=2                                                 94850042
         ROUTINE XDUM1,RESETR2                                          94900042
         LABEL ''                                                       94950042
*********************************************************************** 95000042
         DC    X'FF'                                                    95050042
         DC    XL2'006A'         RECORD LENGTH                          95100042
         DC    XL2'0020'         LENGTH OF HDR                          95150042
         DC    XL2'0020'         DISP. FOR START OF DATA                95200042
*********************************************************************** 95250042
LABELS   DS    0F                                                       95300042
         DC    C'$'                                                     95350042
         LSTART                                                         95400042
         END                                                            95450042
