         TITLE 'IFCEXXXE- EDIT TABLE- LINKNAME-IFCEXXXE'                00080002
         MACRO                                                          00160002
         CONVT                                                          00240002
         GBLC  &ITEM(1000),&DSECT                                       00320002
         GBLA  &INITIAL                                                 00400002
         GBLA  &BITS(1000),&ITEMNBR,&SHIFT(1000)                        00480002
         GBLA  &NRENTS                                                  00560002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               00640002
         LCLB  &SUB                                                     00720002
         LCLA  &OP                                                      00800002
         LCLA  &OFFSET,&OUT,&IN,&IND,&IBITS,&ISHIFT                     00880002
.*                                                                      00960002
.*       CONVERT BINARY TO DECIMAL                                      01040002
.*             &NAME IS THE REFERENCE INTO THE DSECT RECORD             01120002
.*             &OUT    IS THE NUMBER OF CHARS TO BE PUT ONTO PRINT LINE 01200002
.*                                      DEFAULT IS FOUR MAXIMUM IS 8    01280002
.*             &IN       IS THE NUMBER OF BYTES AS INPUT                01360002
.*                                      ERROR DEFAULT IS 2 MAXIMUM IS 4 01440002
.*                                                                      01520002
         AIF   (&DIAGTST EQ 0).NOMSG                                    01600002
         AIF   (&INITIAL EQ 0).NOMSG                                    01680002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    01760002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  01840002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     01920002
*        LINE                                                           02000002
         LINE                                                           02080002
.NOMSG   ANOP                                                           02160002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LLOP                  02240002
&SUB     SETB  1                                                        02320002
.LLOP    ANOP                                                           02400002
&OP      SETA  &OP+1                                                    02480002
&OUT     SETA  4                        .BR NOT NULL ELSE SET TO 4      02560002
         AIF   (&SUB EQ 1).SUBA                                         02640002
         AIF   ('&SYSLIST(3)' EQ '').B  TEST FOR NULL INPUT             02720002
&OUT     SETA  &SYSLIST(3)             SET &OUT FROM INPUT              02800002
         AGO   .A                                                       02880002
.SUBA    AIF   ('&SYSLIST(&OP,3)' EQ '').B                              02960002
&OUT     SETA  &SYSLIST(&OP,3)          SET &OUT FROM INPUT             03040002
.A       AIF   (&OUT GT 0 AND &OUT LT 9).B   TEST RANGE                 03120002
.AERR    MNOTE '*** BYTES OUT INCORRECTLY SPECIFIED DEFAULT USED ***'   03200002
&OUT     SETA  4                                                        03280002
.B       AIF   (&SUB EQ 1).SUBB                                         03360002
         AIF   ('&SYSLIST(2)' EQ '').LOOP    BRANCH IF NULL             03440002
&IN      SETA  &SYSLIST(2)              .SET &IN FROM INPUT             03520002
         AGO   .BB                                                      03600002
.SUBB    AIF   ('&SYSLIST(&OP,2)' EQ '').LOOP                           03680002
&IN      SETA  &SYSLIST(&OP,2)          .SET &IN FROM INPUT             03760002
.BB      AIF   (&IN GT 0 AND &IN LT 5).D     TEST RANGE                 03840002
.BERR    MNOTE '*** BYTES IN INCORRECTLY SPECIFIED DEFAULT USED ***'    03920002
&IN      SETA  2                                                        04000002
         AGO   .D                                                       04080002
.LOOP    ANOP                           .LOOP TO FIND &NAME IN DSECT    04160002
&IND     SETA  &IND+1                   .SET UP LOOP COUNTER            04240002
         AIF   ('&ITEM(&IND)' EQ '&SYSLIST(&OP,1)').FOUND               04320002
         AIF   (&IND LT &ITEMNBR).LOOP  .TEST FOR END OF DSECT          04400002
         MNOTE '*** LOG ITEM NOT DEFINED ***'                           04480002
         MEXIT                                                          04560002
.FOUND   ANOP                                                           04640002
&IBITS   SETA  &BITS(&IND)              .SET UP NUMBER OF BITS SPEC     04720002
         AIF   (&IBITS-((&IBITS/8)*8) EQ 0).C  .TEST FOR MULTIPLE OF 8  04800002
         MNOTE '*** DATA NOT DEFINED A MULTIPLE OF 8 BITS ***'          04880002
         MEXIT                                                          04960002
.C       ANOP                                                           05040002
&IN      SETA  &IBITS/8                 .COMPUTE NUMBER OF BYTES        05120002
         AIF   (&IN LT 1 OR &IN GT 4).BERR  .TEST RANGE B IF IN ERROR   05200002
&ISHIFT  SETA  &SHIFT(&IND)             .SET UP FOR TEST OF BYTE BNDR   05280002
         AIF   (&ISHIFT EQ 0).D         .TEST FOR BYTE BNDRY  !R IF YES 05360002
         MNOTE '*** DATA NOT ALIGNED ON A BYTE BOUNDARY ***'            05440002
         MEXIT                                                          05520002
.*                                                                      05600002
.D       ANOP                                                           05680002
&NRENTS  SETA  &NRENTS+1                                                05760002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),AL.4(9)                    05840002
         DC    X'&IN',X'&OUT'                                           05920002
&IND     SETA  0                                                        06000002
         AIF   (&SUB EQ 0).OUTA                                         06080002
         AIF   (&OP LT N'&SYSLIST).LLOP                                 06160002
.OUTA    ANOP                                                           06240002
         MEND                                                           06320002
*                                                                       06400002
         MACRO                                                          06480002
         LINEND                                                         06560002
.*                            THIS MACRO IS USED ONLY BY THE LINE       06640002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   06720002
.*                                 ASSOCIATED WITH EACH LINE.           06800002
         GBLA  &NRENTS                                                  06880002
         GBLC &NRENTSX                                                  06960002
         AIF   (&NRENTS EQ 0).NORENTS   TEST FOR NO COUNT               07040002
         ORG   &NRENTSX                                                 07120002
         DC    FL1'&NRENTS'                                             07200002
         ORG                                                            07280002
&NRENTS  SETA  0                                                        07360002
.NORENTS ANOP                                                           07440002
B&SYSNDX EQU   *                                                        07520002
&NRENTSX SETC  'B&SYSNDX'                                               07600002
         MEND                                                           07680002
*                                                                       07760002
         MACRO                                                          07840002
         BIN                                                            07920002
.*                                 &SYSLIST(&OP,1) - NAME OF LOG ITEM   08000002
.*                                      RECORD DSECT                    08080002
.*                                 $SYSLIST(&OP,2) - NBR OF SPACES      08160002
.*                                      TO SKIP ON MULTIPLE             08240002
.*                                      PRINT OR NBR OF SPACES          08320002
.*                                      TO BACK UP FROM COLUMN FOR      08400002
.*                                      START OF PRINTING. THE LETTER   08480002
.*                                      B PRECEEDS THE NUMBER (B5) IF   08560002
.*                                      THE LATTER IS DESIRED. OMISSION 08640002
.*                                      OF THIS OPERAND FORCES OPTION 2 08720002
.*                                      WITH BACKUP SPACING EQUAL TO    08800002
.*                                 THE NUMBER OF BITS IN THE ITEM       08880002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      08960002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     09040002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       09120002
         GBLA  &INITIAL                                                 09200002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               09280002
         GBLC &ITEM(1000)                                               09360002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 09440002
         GBLC  &DSECT                                                   09520002
         LCLB  &B,&SUB                                                  09600002
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   09680002
         LCLA  &TEMP,&T,&OP                                             09760002
         LCLC  &S                                                       09840002
         AIF   (&DIAGTST EQ 0).NOMSG                                    09920002
         AIF   (&INITIAL EQ 0).NOMSG                                    10000002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    10080002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  10160002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     10240002
*        LINE                                                           10320002
         LINE                                                           10400002
.NOMSG   ANOP                                                           10480002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  10560002
&SUB     SETB  1                                                        10640002
.LOOP    ANOP                                                           10720002
&OP      SETA  &OP+1                                                    10800002
.LOOP1   ANOP                                                           10880002
&NDX     SETA  &NDX+1                                                   10960002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND               11040002
         AIF   (&NDX LT &ITEMNBR).LOOP1                                 11120002
         MNOTE '**LOG ITEM NOT DEFINED**'                               11200002
         MEXIT                                                          11280002
.FOUND   ANOP                                                           11360002
&ISHIFT  SETA  &SHIFT(&NDX)                                             11440002
&IBITS   SETA  &BITS(&NDX)                                              11520002
         AIF   (&SUB EQ 1).SUB00                                        11600002
         AIF   ('&SYSLIST(3)' EQ '').SETT                               11680002
&IBITS   SETA  &SYSLIST(3)                                              11760002
         AGO   .SETT                                                    11840002
.SUB00   AIF   ('&SYSLIST(&OP,3)' EQ '').SETT                           11920002
&IBITS   SETA  &SYSLIST(&OP,3)                                          12000002
.SETT    ANOP                                                           12080002
&T       SETA  &IBITS-1                                                 12160002
&B       SETB  0                                                        12240002
         AIF   (&IBITS GT 0 AND &IBITS LT 16).SUB0                      12320002
         MNOTE '**NO. OF BITS OUTSIDE RANGE OF 1-15**'                  12400002
         MEXIT                                                          12480002
.SUB0    AIF   (&SUB EQ 1).SUBA                                         12560002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             12640002
&K       SETA  K'&SYSLIST(2)                                            12720002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              12800002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                12880002
         AGO   .SUBB                                                    12960002
.SUBA    ANOP                                                           13040002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         13120002
&K       SETA  K'&SYSLIST(&OP,2)                                        13200002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          13280002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            13360002
.SUBB    ANOP                                                           13440002
&T       SETA  &S                                                       13520002
.BACKUP  ANOP                                                           13600002
&NRENTS  SETA  &NRENTS+1                                                13680002
&TEMP    SETA  &ISHIFT                                                  13760002
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                            13840002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'                13920002
         AGO   .OUT                                                     14000002
.BIN2    AIF   ('&SYSLIST(&OP,2)' NE '').BIN3                           14080002
&B       SETB  1                                                        14160002
.BIN3    ANOP                                                           14240002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'                    14320002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             14400002
.OUT     ANOP                                                           14480002
&NDX     SETA  0                                                        14560002
         AIF   (&SUB EQ 0).OUTA                                         14640002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 14720002
.OUTA    ANOP                                                           14800002
         MEND                                                           14880002
         MACRO                                                          14960002
         HEX                                                            15040002
.*                            THIS MACRO FACILITATES GENERATION OF THE  15120002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    15200002
.*                                 CONVERSIONS.                         15280002
.*                            &SYSLIST(&OP,1) - NAME OF DATA ITEM TO BE 15360002
.*                                 CONVERTED                            15440002
.*                            &SYSLIST(&OP,2) - # OF SPACES TO SKIP ON  15520002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   15600002
.*                                 BACK UP FROM COLUMN FOR START OF     15680002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  15760002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  15840002
.*                                 DESIRED. OMISSION OF THIS OPERAND    15920002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  16000002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  16080002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 16160002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    16240002
.*                                 IMPLICITLY B).                       16320002
.*                            &SYSLIST(&OP,3) - NUMBER OF BYTES TO      16400002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     16480002
.*                                 WITH AN L,R, OR B TO STIPULATE       16560002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     16640002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     16720002
.*                                 RESPECTIVELY. OMISSION OF THIS       16800002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  16880002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 16960002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 17040002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   17120002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     17200002
.*                                 SUBJECT LINE(S).                     17280002
         GBLC &ITEM(1000),&DSECT                                        17360002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 17440002
         GBLA  &INITIAL                                                 17520002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               17600002
         LCLB  &B,&SUB                                                  17680002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP,&OP              17760002
         LCLC  &S,&LETTER                                               17840002
         AIF   (&DIAGTST EQ 0).NOMSG                                    17920002
         AIF   (&INITIAL EQ 0).NOMSG                                    18000002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    18080002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  18160002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     18240002
*        LINE                                                           18320002
         LINE                                                           18400002
.NOMSG   ANOP                                                           18480002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  18560002
&SUB     SETB  1                                                        18640002
.LOOP    ANOP                                                           18720002
&OP      SETA  &OP+1                                                    18800002
.LOOP1   ANOP                                                           18880002
&NDX     SETA  &NDX+1                                                   18960002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND               19040002
         AIF   (&NDX LT &ITEMNBR).LOOP1                                 19120002
         MNOTE '**LOG ITEM NOT DEFINED**'                               19200002
         MEXIT                                                          19280002
.FOUND   ANOP                                                           19360002
&ISHIFT  SETA  &SHIFT(&NDX)                                             19440002
&IBITS   SETA  &BITS(&NDX)                                              19520002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).ALIGN                     19600002
.ERR     MNOTE '**DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY**'          19680002
         MEXIT                                                          19760002
.ALIGN   ANOP                                                           19840002
&CODE    SETA  1                                                        19920002
         AIF   (&SUB EQ 1).SUBA                                         20000002
&K       SETA  K'&SYSLIST(3)                                            20080002
         AGO   .SUBB                                                    20160002
.SUBA    ANOP                                                           20240002
&K       SETA  K'&SYSLIST(&OP,3)                                        20320002
.SUBB    ANOP                                                           20400002
         AIF   (&K EQ 1).ERR3                                           20480002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            20560002
         MNOTE '**BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL**' 20640002
         MEXIT                                                          20720002
.OK      AIF   (&SUB EQ 1).SUBC                                         20800002
         AIF   ('&SYSLIST(3)' EQ '').USEDEFN                            20880002
&LETTER  SETC  '&SYSLIST(3)'(&K,1)                                      20960002
&S       SETC  '&SYSLIST(3)'(1,&K-1)                                    21040002
         AGO   .SUBD                                                    21120002
.SUBC    ANOP                                                           21200002
         AIF   ('&SYSLIST(&OP,3)' EQ '').USEDEFN                        21280002
&LETTER  SETC  '&SYSLIST(&OP,3)'(&K,1)                                  21360002
&S       SETC  '&SYSLIST(&OP,3)'(1,&K-1)                                21440002
.SUBD    ANOP                                                           21520002
&BYTESP  SETA  &S                                                       21600002
         AIF   ('&LETTER' EQ 'B').BOTH                                  21680002
         AIF   ('&LETTER' EQ 'L').LEFT                                  21760002
         AIF   ('&LETTER' EQ 'R').RIGHT                                 21840002
.ERR3    MNOTE '**PARAMETER 3 INCOMPLETE-DSGEN DEFINITION USED**'       21920002
         AGO   .USEDEFN                                                 22000002
.RIGHT   ANOP                                                           22080002
&CODE    SETA  2                                                        22160002
         AGO   .L                                                       22240002
.LEFT    ANOP                                                           22320002
&CODE    SETA  1                                                        22400002
         AGO   .L                                                       22480002
.USEDEFN ANOP                                                           22560002
&BYTESP  SETA  &IBITS/8                                                 22640002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       22720002
&CODE    SETA  3                                                        22800002
&T       SETA  &BYTESP*2-1                                              22880002
&S       SETC  '&T'                                                     22960002
.OK2     AIF   (&ISHIFT EQ 0).L                                         23040002
&CODE    SETA  2                                                        23120002
.L       ANOP                                                           23200002
&B       SETB  1                                                        23280002
         AIF   (&SUB EQ 1).SUBE                                         23360002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             23440002
&K       SETA  K'&SYSLIST(2)                                            23520002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              23600002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                23680002
         AGO   .SUBF                                                    23760002
.SUBE    ANOP                                                           23840002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         23920002
&K       SETA  K'&SYSLIST(&OP,2)                                        24000002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          24080002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            24160002
.SUBF    ANOP                                                           24240002
.BACKUP  ANOP                                                           24320002
&NRENTS  SETA  &NRENTS+1                                                24400002
         AIF   (&BYTESP GT 0 AND &BYTESP LT 16).SUB0                    24480002
         MNOTE '**NO. OF BYTES OUTSIDE RANGE OF 1-15**'                 24560002
         MEXIT                                                          24640002
.SUB0    AIF   (&SUB EQ 1).SUBG                                         24720002
         DC    AL.12(&SYSLIST(1)-&DSECT),XL.4'A'                        24800002
         AGO   .SUBH                                                    24880002
.SUBG    ANOP                                                           24960002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'A'                    25040002
.SUBH    ANOP                                                           25120002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'              25200002
.OUT     ANOP                                                           25280002
&NDX     SETA  0                                                        25360002
         AIF   (&SUB EQ 0).OUTA                                         25440002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 25520002
.OUTA    ANOP                                                           25600002
         MEND                                                           25680002
         MACRO                                                          25760002
         LSTART                                                         25840002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  25920002
.*                                 OF THE TABLE IS TO BEGIN.            26000002
         GBLA  &LABELNR                                                 26080002
         GBLC  &LBL(100)                                                26160002
         GBLC &LABELS(2000)                                             26240002
         GBLA  &LBLCTR(100)                                             26320002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               26400002
         LCLA  &NDX,&CTR                                                26480002
         AIF   (&DIAGTST EQ 0).NODIAG                                   26560002
         AIF   (&DIAGSET EQ 0).NODIAG                                   26640002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  26720002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   26800002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       26880002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 26960002
.NODIAG  ANOP                                                           27040002
         LINEND                                                         27120002
&CTR     SETA  1                                                        27200002
.LOOP    ANOP                                                           27280002
&NDX     SETA  &NDX+1                                                   27360002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            27440002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         27520002
&CTR     SETA  &CTR+1                                                   27600002
         AGO   .LOOPCTL                                                 27680002
.NOLBL   ANOP                                                           27760002
         DC    C'&LABELS(&NDX)'                                         27840002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  27920002
         MEND                                                           28000002
         MACRO                                                          28080002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C28160002
               &LABEL7,&LABEL8                                          28240002
.*                                 THIS MACRO ALLOWS LABELS TO          28320002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   28400002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  28480002
.*                                 TION MARKS. THE COLUMN AND LINE END  28560002
.*                                 CONTROLS WILL BE INSERTED BY THE     28640002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      28720002
.*                                 LABEL REQUIRED FOR RESPECTIVE        28800002
.*                                 COLUMN.                              28880002
         GBLC &LABELS(2000)                                             28960002
         GBLC  &LBL(100)                                                29040002
         GBLA  &LBLCTR(100)                                             29120002
         GBLA  &LABELNR                                                 29200002
         GBLA  &NRENTS,&LPTR,&INITIAL                                   29280002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               29360002
         LCLC  &MARGIN,&TACK                                            29440002
         LCLC  &TEXT                                                    29520002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            29600002
         AIF   (&INITIAL EQ 0).DIAGCLR                                  29680002
         AIF   (&DIAGTST EQ 0).DIAGCLR                                  29760002
         AIF   (&DIAGLIN EQ 1).DIAGCLR                                  29840002
         MNOTE '**NO LINE ASSOCIATED WITH PREVIOUS LABEL**'             29920002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   30000002
*        LINE                                                           30080002
         LINE                                                           30160002
.DIAGCLR ANOP                                                           30240002
&DIAGSET SETB  0                                                        30320002
&DIAGLIN SETB  0                                                        30400002
&MARGIN  SETC  '*'                                                      30480002
         AIF   ('&NAME' EQ '').LOOPOUT                                  30560002
&LPTR    SETA  &LPTR+1                                                  30640002
&LBL(&LPTR) SETC '&NAME'                                                30720002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          30800002
.LOOPOUT ANOP                                                           30880002
&OP      SETA  &OP+1                                                    30960002
&K       SETA  K'&SYSLIST(&OP)                                          31040002
         AIF (&K GE 2).NORM                                             31120002
&K       SETA  2                                                        31200002
.NORM    ANOP                                                           31280002
&START   SETA  2                                                        31360002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                31440002
&MARGIN  SETC  '$'                                                      31520002
.NOTLAST ANOP                                                           31600002
&NRCHAR  SETA  8                                                        31680002
&TACK    SETC  ''                                                       31760002
.LOOPIN  ANOP                                                           31840002
&REMAIN  SETA  &K-&START                                                31920002
         AIF (&REMAIN GE 8).MORE                                        32000002
&TACK    SETC  '&MARGIN'                                                32080002
&NRCHAR  SETA  &REMAIN                                                  32160002
.MORE    ANOP                                                           32240002
&TEXT    SETC  ''                                                       32320002
         AIF (&REMAIN EQ 0).ENDTEXT                                     32400002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          32480002
.ENDTEXT ANOP                                                           32560002
&LABELNR SETA  &LABELNR+1                                               32640002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  32720002
&START   SETA  &START+8                                                 32800002
         AIF ('&TACK' EQ '').LOOPIN                                     32880002
         AIF ('&TACK' EQ '*').LOOPOUT                                   32960002
         MEND                                                           33040002
         MACRO                                                          33120002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      33200002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     33280002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    33360002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 33440002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    33520002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    33600002
.*                                 THE PREVIOUS LINE AND STORES THAT #  33680002
.*                                 INTO THE APPROPRIATE BYTE.           33760002
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    33840002
.*                                 DATA.                                33920002
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 34000002
.*                                 DATA COLUMN STARTING CHARACTERS.     34080002
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   34160002
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 34240002
.*                                 STARTING CHARACTERS.                 34320002
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   34400002
.*                                 TO BEGIN NEXT PRINTED LINE.          34480002
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       34560002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   34640002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 34720002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   34800002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 34880002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    34960002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   35040002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   35120002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  35200002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   35280002
.*                                 THE SUBJECT LINE                     35360002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  35440002
         GBLA  &LASTCC,&INITIAL                                         35520002
         GBLC  &NRENTSX                                                 35600002
         GBLC  &CARRCON                                                 35680002
         GBLB  &TEST                                                    35760002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               35840002
         LCLA  &S                                                       35920002
         AIF   (&INITIAL EQ 0 OR &DIAGTST EQ 0).DIAGSET                 36000002
         AIF   (&DIAGSET EQ 0).DIAGSET                                  36080002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  36160002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   36240002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       36320002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 36400002
.DIAGSET ANOP                                                           36480002
&DIAGSET SETB  1                                                        36560002
&DIAGLIN SETB  1                                                        36640002
&NAME    DS    0C                                                       36720002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  36800002
         LINEND                                                         36880002
         AGO   .NTFIRST                                                 36960002
.FIRSTLN ANOP                                                           37040002
&NRENTSX SETC  'N&SYSNDX'                                               37120002
&INITIAL SETA  1                                                        37200002
N&SYSNDX EQU   *                                                        37280002
.NTFIRST ANOP                                                           37360002
         DC    AL1(0)                                                   37440002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               37520002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                37600002
&DB      SETA  &DATA(1)                                                 37680002
         AGO   .AA                                                      37760002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                37840002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 37920002
         AGO   .CC                                                      38000002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    38080002
         AIF   (&DATA(2) EQ &DT).BB                                     38160002
.CC      ANOP                                                           38240002
&DT      SETA  &DATA(2)                                                 38320002
.BB      DC    XL2'FFFE'                                                38400002
         DC    FL1'&DB'                                                 38480002
         DC    FL1'&DT'                                                 38560002
&NRENTS  SETA  &NRENTS+1                                                38640002
.NCDATA  ANOP                                                           38720002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              38800002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               38880002
&LB      SETA  &LABEL(1)                                                38960002
         AGO   .AAA                                                     39040002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              39120002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               39200002
         AGO   .CCC                                                     39280002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  39360002
         AIF   (&LABEL(2) EQ &LT).BBB                                   39440002
.CCC     ANOP                                                           39520002
&LT      SETA  &LABEL(2)                                                39600002
.BBB     DC    XL2'FFFF'                                                39680002
         DC    FL1'&LB'                                                 39760002
         DC    FL1'&LT'                                                 39840002
&NRENTS  SETA  &NRENTS+1                                                39920002
.NCLABEL ANOP                                                           40000002
         AIF   ('&SKIP' NE '').CONT                                     40080002
         AIF   (&TEST EQ 0).NOCHANG                                     40160002
         AGO   .DEFALTA                                                 40240002
.CONT    ANOP                                                           40320002
         AIF   (&TEST EQ 0).AB                                          40400002
         AIF   ('&SKIP' EQ 'E').AB                                      40480002
&S       SETA  &SKIP                                                    40560002
.DEFAULT ANOP                                                           40640002
         AIF   (&SKIP EQ &LASTCC).DEFALTA                               40720002
         ORG   &CARRCON+3                                               40800002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 40880002
         ORG                                                            40960002
&LASTCC  SETA  &S                                                       41040002
.DEFALTA ANOP                                                           41120002
&TEST    SETB  0                                                        41200002
         AGO   .DD                                                      41280002
.AB      AIF   ('&SKIP' NE 'E').ABB                                     41360002
A&SYSNDX DC    X'FFFB8B00'              EJECT                           41440002
         AGO   .ABC                                                     41520002
.ABB     AIF   (&SKIP EQ &LASTCC).NOCHANG                               41600002
A&SYSNDX DC    XL2'FFFB'                                                41680002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              41760002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              41840002
&LASTCC  SETA  &SKIP                                                    41920002
&TEST    SETB  1                                                        42000002
.ABC     ANOP                                                           42080002
&CARRCON SETC  'A&SYSNDX'                                               42160002
&NRENTS  SETA  &NRENTS+1                                                42240002
.DD      ANOP                                                           42320002
.NOCHANG ANOP                                                           42400002
         MEND                                                           42480002
         MACRO                                                          42560002
&NAME    ROUTINE &LOGITEM,&RNAME                                        42640002
         GBLA  &NRENTS                                                  42720002
         GBLC  &DSECT,&CSECT                                            42800002
         GBLA  &INITIAL                                                 42880002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               42960002
         AIF   (&DIAGTST EQ 0).NOMSG                                    43040002
         AIF   (&INITIAL EQ 0).NOMSG                                    43120002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    43200002
         MNOTE '**NO LINE ASSOCIATED WITH THIS ROUTINE**'               43280002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     43360002
*        LINE                                                           43440002
         LINE                                                           43520002
.NOMSG   ANOP                                                           43600002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           43680002
         DC    AL2(&RNAME-&CSECT)                                       43760002
&NRENTS  SETA  &NRENTS+1                                                43840002
         MEND                                                           43920002
*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 44000002
         SPACE 2                                                        44080002
*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 44160002
         SPACE 2                                                        44240002
         MACRO                                                          44320002
&NAME    DSGEN                                                          44400002
.*                            THIS MACRO GENERATES ONE DSECT WORD       44480002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 44560002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  44640002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    44720002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 44800002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   44880002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 44960002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      45040002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  45120002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    45200002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   45280002
         GBLC &ITEM(1000)                                               45360002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000)                         45440002
         LCLB  &ONLY1,&CTIND                                            45520002
         LCLA  &START1,&START2,&END1,&END2                              45600002
         LCLC  &SYMBOL,&EQUSYM                                          45680002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 45760002
         ACTR  100000                                                   45840002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            45920002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     46000002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   46080002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        46160002
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1            46240002
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT             46320002
         AGO   .SET2A                   BRANCH AROUND                   46400002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              46480002
         MEXIT                                                          46560002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X46640002
               ).SET2                   TEST FOR NO SECOND              46720002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   46800002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        46880002
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2            46960002
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2              47040002
         AGO   .LOOP                                                    47120002
.SET2    ANOP                                                           47200002
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 47280002
         AGO   .LOOP                                                    47360002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             47440002
         MEXIT                                                          47520002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               47600002
         MEXIT                                                          47680002
.LOOP    ANOP                                                           47760002
&OP      SETA  &OP+1                                                    47840002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           47920002
&ITEMNBR SETA  &ITEMNBR+1                                               48000002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            48080002
         MNOTE '**NULL BIT COUNT FIELD**'                               48160002
         MEXIT                                                          48240002
.OK1     ANOP                                                           48320002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        48400002
         AIF   ('&SYMBOL' NE '').OK                                     48480002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         48560002
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                         48640002
         AGO   .START                   GET NEXT                        48720002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        48800002
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU          48880002
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        48960002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         49040002
         AGO   .NO3                     BRANCH AROUND                   49120002
.OK2     ANOP                                                           49200002
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED              49280002
.NO3     ANOP                                                           49360002
&SYMBOL  EQU   *+&BYTE                                                  49440002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL             49520002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    49600002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    49680002
.CNT     ANOP                                                           49760002
&CTIND   SETB  1                        SET COUNT INDICATOR             49840002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   49920002
&BYTE    SETA  &COUNT/8                                                 50000002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        50080002
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        50160002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             50240002
&END1    SETA  &END1+1                  INCREMENT COUNT                 50320002
&OP      SETA  &OP-1                    DECREMENT INCREMENT             50400002
         AGO   .LOOP                    GENERATE NEXT                   50480002
.TSTST   ANOP                                                           50560002
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END               50640002
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        50720002
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      50800002
.NSET1   ANOP                                                           50880002
&OP      SETA  &OP-1                    DECREMENT INDEX                 50960002
&START1  SETA  &START1+1                INCREMENT FIRST COUNT           51040002
         AGO   .LOOP                    GO DO NEXT                      51120002
.LPDONE  ANOP                                                           51200002
&ONLY1   SETB  0                        CLEAR INDICATOR                 51280002
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      51360002
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 51440002
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT               51520002
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES             51600002
&NAME    DS    &COUNT.C                                                 51680002
.END     MEXIT                                                          51760002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          51840002
         MEXIT                                                          51920002
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   52000002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   52080002
         MEXIT                                                          52160002
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         52240002
*****               THE FOLLOWING STATEMENT                *****        52320002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        52400002
.EQU2    ANOP                                                           52480002
&EQUCNT  SETA  0                        CLEAR COUNTER                   52560002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND                 52640002
.EQULOP  ANOP                                                           52720002
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX                 52800002
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     52880002
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?                52960002
         AGO   .EQULOP                  NO-GET NEXT                     53040002
.EQUOUT  ANOP                                                           53120002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME                  53200002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS              53280002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT                 53360002
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED             53440002
         AGO   .START                   RETURN FOR NEXT                 53520002
         MEND                                                           53600002
         GBLC  &DSECT,&CSECT                                            53680002
IFCEXXXE CSECT                                                          53760002
&CSECT   SETC  'IFCEXXXE'                                               53840002
&DSECT   SETC  'M3886'                                                  53920002
M3886    DSECT                                                          54000002
         DSGEN (CLASSRC,8),(SYSREL,8),(XDUM2,8),                       M54080002
               (SW2B0,1),(SW2B1,1),(SW2B2,1),(SW2B3,1),                M54160002
               (SW2B4,1),(SW2B5,1),(SW2B6,1),(SW2B7,1)                  54240002
         DSGEN (SPARES,32)                                              54320002
         DSGEN (DUM1,8),(YEAR,8),(DAY,16),(TIME,32)                     54400002
         DSGEN (SPARE1,8),(CPUSER,24),(CPUID,16),(SPARE2,16)            54480002
         DSGEN (XPGN1,32)                                               54560002
         DSGEN (XPGN2,32)                                               54640002
         DSGEN (XFCCWCC,8),(XFCCWDA,24)  FAILING CCW                    54720002
         DSGEN (XFCCWFL,8),(XZERO,8),(XFCCWCT,16)    CCW                54800002
         DSGEN (CSWKEY,8),(XCSWCA,24)                                   54880002
         DSGEN (ATTEN,1),(XCSWSM,1),(XCSWCUE,1),(XCSWBSY,1),           M54960002
               (XCSWCE,1),(XCSWDE,1),(XCSWUC,1),(XCSWUE,1),            M55040002
               (XCSWPCI,1),(XCSWSILI,1),(XCSWPC,1),(XCSWPCHK,1),       V55120002
               (XCSWCDC,1),(XCSWCCC,1),(XCSWICC,1),(XCSWCH,1),         M55200002
               (XCSWCT,16)                                              55280002
         DSGEN (DDCOUNT,8),(SECONCUA,24)                                55360002
         DSGEN (XDEVT1,16),(XDEVT2,16)       DEVICE TYPE                55440002
         DSGEN (SDRCOUNT,8),(PRIMCUA,24),(IORETRYS,16),(SNSBYTES,16)    55520002
         DSGEN (DEVDID,32)                                              55600002
         DSGEN (DEVDTA,32)                                              55680002
         DSGEN (STATFLG,8),(CEMODE,8)                                   55760002
         DSGEN (CTR,4,0,55),(SNB,1,0,5,0,7)                             55840002
         ORG   SNB00                                                    55920002
         DSGEN (SNSBYT,48)                                              56000002
*                                                                       56080002
EXPNOBR  DSECT                                                          56160002
EXPNHDRA DS    CL52                                                     56240002
EXPNDEVA DS    CL12                                                     56320002
EXPNDA   DS    CL8                                                      56400002
EXPNSDRA DS    CL30                                                     56480002
*                                                                       56560002
SHRTOBR  DSECT                                                          56640002
SHRTHDRA DS    CL24                                                     56720002
SHRTDEVA DS    CL8                                                      56800002
SHRTSDRA DS    CL30                                                     56880002
*                                                                       56960002
IFCEXXXE CSECT                                                          57040002
*                                                                     * 57120002
*                       EDIT TABLE FOR THE SHARK DEVICE                 57200002
*                                                                     * 57280002
         USING *,R9                                                     57360002
R2       EQU   2                                                        57440002
R3       EQU   3                                                        57520002
R4       EQU   4                                                        57600002
R5       EQU   5                                                        57680002
R6       EQU   6                                                        57760002
R7       EQU   7                                                        57840002
R8       EQU   8                                                        57920002
R9       EQU   9                                                        58000002
R14      EQU   14                                                       58080002
R15      EQU   15                                                       58160002
L0       EQU   0                                                        58240002
L1       EQU   1                                                        58320002
L2       EQU   2                                                        58400002
L3       EQU   3                                                        58480002
L4       EQU   4                                                        58560002
L5       EQU   5                                                        58640002
L6       EQU   6                                                        58720002
L7       EQU   7                                                        58800002
L8       EQU   8                                                        58880002
L9       EQU   9                                                        58960002
L10      EQU   10                                                       59040002
L11      EQU   11                                                       59120002
L12      EQU   12                                                       59200002
L13      EQU   13                                                       59280002
L16      EQU   16                                                       59360002
L20      EQU   20                                                       59440002
L21      EQU   21                                                       59520002
L24      EQU   24                                                       59600002
L27      EQU   27                                                       59680002
L28      EQU   28                                                       59760002
L30      EQU   30                                                       59840002
L108     EQU   108                                                      59920002
L4092    EQU   4092                                                     60000002
CHAR0    EQU   X'F0'              ZONE USED IN BIT PRINT                60080002
RELONLY  EQU   X'1F'                                                    60160002
DENS16   EQU   X'04'                                                    60240002
DENS8    EQU   X'10'                                                    60320002
DISMOUNT EQU   X'04'                                                    60400002
FE       EQU   X'FE'                                                    60480002
LONG     EQU   X'40'                                                    60560002
SHORT    EQU   X'30'                                                    60640002
SHRTRECD EQU   X'20'                                                    60720002
ZEROHI   EQU   X'3F'                                                    60800002
*                                                                       60880002
HEX20    EQU   X'20'                                                    60960002
HEX3E    EQU   X'3E'                                                    61040002
HEX6C    EQU   X'6C'                                                    61120002
ONE      EQU   1                                                        61200002
EIGHT    EQU   8                                                        61280002
*                                                                       61360002
         USING M3886,R2                                                 61440002
         DC    A(ENTRIES)                                               61520002
         DC    CL8'IFCEXXXE'                                            61600002
NINE     DC    F'0'                                                     61680002
XLABELP  DC    F'0'                                                     61760002
*                                                                     * 61840002
*                         SPECIAL ROUTINE SECTION                     * 61920002
*                                                                     * 62000002
* UPON ENTRY TO ANY SPECIAL ROUTINE REG4 POINTS TO THE FIELD IN THE   * 62080002
* LOGREC RECORD WHICH WILL BE PROCESSED. REG3 POINTS TO THE PRINT     * 62160002
* POSITION OF THE PRINT BUFFER WHERE THE DATA SHOULD BE PUT. REG9     * 62240002
* IS USED FOR ADDRESSABILITY. THEN REG15 IS ZEROED BEFORE A RETURN    * 62320002
* THE BUFFER THAT WAS JUST PROCESSED IS NOT PRINTED.                  * 62400002
*                                                                     * 62480002
*                                                                     * 62560002
* THIS ROUTINE UNPACKS THE RELEASE NUMBER AND PUTS IT AND THE         * 62640002
* CHARACTER STRING 'RELEASE' INTO THE PRINT BUFFER.                   * 62720002
*                                                                     * 62800002
RELEASE  ST    R5,STOREREG                                              62880002
         MVC   L0(L7,R3),REL      MOVE 'RELEASE' TO PRINT BUFFER        62960002
         MVC   DECBYTES(L1),L0(R4) MOVE RELEASE NBR TO LOCAL AREA       63040002
         NI   DECBYTES,RELONLY    AND OUT UNWANTED BITS                 63120002
         SR    R5,R5              CLEAR REGISTER                        63200002
         IC    R5,DECBYTES        PUT RELEASE NBR INTO REGISTER         63280002
         CVD   R5,DECBYTES        MAKE IT DECIMAL                       63360002
         UNPK  L8(L2,R3),DECBYTES+L6(2) UNPACK RELEASE NUMBER           63440002
         OI    L9(R3),CHAR0       MAKE LAST CHARACTER PRINTABLE         63520002
         L     R5,STOREREG        RELOAD REGISTER                       63600002
         BR    R14                RETURN                                63680002
REL      DC    CL7'RELEASE'                                             63760002
*                                                                       63840002
TYPETEST MVC   TYPENT+L24(L10),UNCHK    PLUG IN UNIT CHECK TYPE         63920002
         MVI   DMPSIZE+ONE,HEX6C        SET DUMP SIZE                   64000002
         TM    SW2B0,HEX20              TEST FOR SHORT RECORD           64080002
         BZ    TEST1                    LONG RE, BRANCH AROUND          64160002
         MVC   TYPENT+L24(L10),OVRFLOW  PLUG IN OVERFLOW TYPE           64240002
         MVI   DMPSIZE+ONE,HEX3E        SET DUMP SIZE FOR SHORT         64320002
TEST1    STM   R5,R6,XSAVE              SAVE WORK REGS                  64400002
         LA    R5,OBRAREA               GET EXPAND AREA ADDRESS         64480002
         LR    R6,R2                    SWAP ADDRESS OF DSECT           64560002
        USING  EXPNOBR,R5                                               64640002
        USING  SHRTOBR,R6                                               64720002
         XC    OBRAREA(L108),OBRAREA    CLEAR AREA                      64800002
         TM    SW2B0,HEX20              TEST FOR SHORT RECORD           64880002
         BO    MOVESHRT                 YES-GO MOVE SHORT RE            64960002
         MVC   EXPNOBR(L108),SHRTOBR    MOVE RE INTACT                  65040002
         B     EXPNDRET                 SET UP FOR RETURN               65120002
*                                                                       65200002
MOVESHRT MVC   EXPNHDRA(L24),SHRTHDRA   MOVE HEADER                     65280002
         MVC   EXPNDEVA(L8),SHRTDEVA    MOVE DEVTYPE AND CUA            65360002
         MVC   EXPNSDRA(L30),SHRTSDRA   MOVE SDR AREA                   65440002
EXPNDRET ST    R2,SAVE2                 SAVE DSECT POINTER              65520002
         LR    R2,R5                    POINT R2 AT OBRAREA             65600002
         LM    R5,R6,XSAVE              GET SAVED REGS                  65680002
NOPRINT  SR    R15,R15                  CLEAR REG 15                    65760002
DONOTHNG BR    R14                                                      65840002
STOREREG DC    6F'0'                                                    65920002
OBRAREA  DS    CL108                    DSECT AREA                      66000002
*                                                                     * 66080002
UNCHK    DC    C'UNIT CHECK'                                            66160002
OVRFLOW  DC    C'OVERFLOW  '                                            66240002
*                                                                       66320002
SHRTST   TM    SW2B0,HEX20              TEST FOR SHORT RECORD           66400002
         BCR   EIGHT,R14                LONG-RETURN TO PRINT            66480002
         B     NOPRINT                  DO NOT PRINT                    66560002
*                                                                       66640002
LONGTST  TM    SW2B0,HEX20              TEST FOR SHORT RECORD           66720002
         BCR   ONE,R14                  YES-RETURN TO PRINT             66800002
         B     NOPRINT                  LONG-DO NOT PRINT               66880002
*                                                                       66960002
SKIPTST1 TM    SW2B0,HEX20              TEST FOR SHORT RECORD           67040002
         BCR   EIGHT,R14                NO-RETURN                       67120002
         MVC   NINE(L8),SADCON          BUMP POINTERS                   67200002
         B     NOPRINT                  DO NOT PRINT                    67280002
*                                                                       67360002
SKIPTST2 TM    SW2B0,HEX20              TEST FOR SHORT RECORD           67440002
         BCR   EIGHT,R14                NO-RETURN                       67520002
         MVC   NINE(L8),SADCON1         BUMP POINTERS                   67600002
         B     NOPRINT                  RETURN-DO NOT PRINT             67680002
*                                                                       67760002
RESETR2  L     R2,SAVE2                 RESTORE R2 POINTER              67840002
         B     NOPRINT                  DO NOT PRINT                    67920002
*                                                                       68000002
SAVE2    DC    F'0'                                                     68080002
*                                                                       68160002
SADCON   DC    A(SHORT1-L4)                                             68240002
         DC    A(SHRTL1-L1)                                             68320002
SADCON1  DC    A(SHORT2-L4)                                             68400002
         DC    A(SHRTL2-L1)                                             68480002
*                                                                     * 68560002
* THIS CODE WILL MOVE THE JOB NAME AND VOLID FROM THE RECORD TO THE   * 68640002
* BUFFER                                                              * 68720002
*                                                                     * 68800002
JOBNAME  MVC   L0(L8,R3),L0(R4)   MOVE THE JOBID TO PRINT LINE          68880002
         BR    R14                RETURN                                68960002
VOLNAME  MVC   L0(L6,R3),L0(R4)   MOVE THE VOLID TO PRINT LINE          69040002
         BR    R14                RETURN                                69120002
FORMID   MVC   L0(L4,R3),L0(R4)         GET FORMAT ID                   69200002
         BR    R14                                                      69280002
*                                                                     * 69360002
SETHEX   STM   R5,R8,XSAVE        SAVE REGS                             69440002
         LA    R8,CHARS           PTR TO CHARS                          69520002
         IC    R7,L0(R4)          PICK CHAR                             69600002
         SLL   R7,L24             MOVE IT TO HI OF R7                   69680002
         SR    R6,R6              CLEAR REG                             69760002
         SLDL  R6,L4              MOVE 4 BITS TO R6                     69840002
         AR    R6,R8              COMPUTE OFFSET                        69920002
         MVC   L0(L1,R3),L0(R6)   MOVE CHAF TO LINE                     70000002
         SR    R6,R6              CLEAR                                 70080002
         SLDL  R6,L4              MOVE LAST 4 BITS TO R6                70160002
         AR    R6,R8              COMPUTE PFFSET                        70240002
         MVC   L1(L1,R3),L0(R6)   MOVE CHAR TO LINE + 1                 70320002
         B     RETURN          RETURN                                   70400002
SPACER16 LA    R3,L16(R3)                                               70480002
         BR    R14                                                      70560002
SPACER1  LA    R3,L1(R3)                                                70640002
         BR    R14                                                      70720002
*                                                                     * 70800002
* THIS CODE WILL TAKE THE DATE FROM THE RECORD UNPACK IT AND PUT IT   * 70880002
* IN THE PRINT BUFFER.                                                * 70960002
*                                                                     * 71040002
SETDATE  CLC   L1(L3,R4),ZERO          IS DATE ZERO                     71120002
         BE    SETDTE                  BR- YES                          71200002
         UNPK  XSAVE(L8),L1(L3,R4)     UNPACK DATE                      71280002
         MVC   L5(L2,R3),XSAVE+L3      MOVE YEAR                        71360002
         MVC   L0(L3,R3),XSAVE+L5                                       71440002
         BR    R14                                                      71520002
SETDTE   MVC   L0(L4,R3),NONE     SET DATE TO NONE                      71600002
         BR    R14                     RETURN                           71680002
SETPGMN  TM    SW2B0,HEX20              TEST FOR SHORT RECORD           71760002
         BCR   ONE,R14                  YES-NO JOB ID                   71840002
         MVC   0(L12,R3),JOBID          MOVE IN LABEL                   71920002
         MVC   L13(L8,R3),XPGN1         MOVE IN NAME                    72000002
         BR    R14                                                      72080002
SETCONV  TM    L0(R4),HEX02             HAS RECORD BEEN CONVERTED KEY32 72160002
         BCR   ON,R14                   YES RETURN                      72240002
         SR    R15,R15                  NO CLEAR R15 FOR NO PRINT OF    72320002
         BR    R14                      LINE BR-14                      72400002
ON       EQU   1                                                        72480002
HEX02    EQU   X'02'                                                    72560002
*                                       SET DEVICE TYPE FIELD           72640002
*                                                                       72720002
*                                                                       72800002
*          ROUTINE TO CONVERT 4 BIT COUNTER                             72880002
*                                                                     * 72960002
CONVLFT  STM   R5,R8,XSAVE              SAVE REGS                       73040002
         SR    R6,R6                   CLEAR REGISTERS                  73120002
         IC    R6,L0(R4)               PICK UP COUNTER IN QUEST         73200002
         SRL   R6,L4                   DROP OFF 4 LOW BITS              73280002
         B     SDRCVT                  BRANCH TO CONVERT IT             73360002
CONVRHT  STM   R5,R8,XSAVE             SAVE REGS                        73440002
         IC    R6,L0(R4)               PICK CHAR                        73520002
         SLL   R6,L28                                                   73600002
         SRL   R6,L28                  DROP OFF HI ORDER BITS           73680002
SDRCVT   CVD   R6,WORK                 CONVERT IT                       73760002
         UNPK  L0(L3,R3),WORK+L5(L3)     TO DECIMAL                     73840002
         MVZ   L2(L1,R3),L0(R3)        PUT ON ZONE                      73920002
         B     RETURN                  TERMINATE                        74000002
ZERO     DC    XL4'00'                                                  74080002
*                                                                     * 74160002
RETURN   LM    R5,R8,XSAVE              SAVE REGISTERS                  74240002
         BR    R14                                                      74320002
*                                                                     * 74400002
CONVREL  STM   R5,R8,XSAVE              SAVE WORK REGS                  74480002
         SR    R6,R6                    CLEAR R6                        74560002
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        74640002
         SRDL  R6,L5                    SAVE REL NO IN R7               74720002
         SLL   R6,L2                    MULTIPLY SYS VALUE BY 4         74800002
         L     R8,XLABELP               PICK UP LABEL POINTER           74880002
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     74960002
         MVC   L0(L4,R8),L0(R6)         MOVE SYSTEM NAME INTO LABEL     75040002
         SR    R6,R6                    CLEAR R6                        75120002
         SLDL  R6,L5                    RETREIVE REL NO.                75200002
         LTR   R6,R6                    IS IT ZERO                      75280002
         BZ    NOREL                    BR-YES                          75360002
         CVD   R6,WORK                  CONVERT IT                      75440002
         UNPK  L0(L2,R3),WORK+L6(L2)   UNPACK IT INTO PRINT BUFF        75520002
         MVZ   L1(L1,R3),L0(R3)         MOVE ON PROPER ZONE             75600002
         B     RETURN                   EXIT                            75680002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL            75760002
         B     RETURN                                                   75840002
*                                                                     * 75920002
*                                                                     * 76000002
*                                                                     * 76080002
RELTAB   DS    0C                                                       76160002
         DC    C'OS  '                                                  76210002
           DC    C'DOS '                                                76260002
         DC    C'VS 1'                                                  76310002
         DC    C'V370'                                                  76360002
         DC    C'VS 2'                                                  76410002
         DC    C'    '                                                  76460002
         DC    C'    '                                                  76510002
         DC    C'    '                                                  76560002
TWO      DC    H'2'                                                     76640002
FOUR     DC    H'4'                                                     76720002
TWELVE   DC    H'12'                                                    76800002
TWENTY   DC    H'20'                                                    76880002
DECBYTES DC    D'0'               PACKED NUMERIC AREA                   76960002
XSAVE    DC    5F'0'                                                    77040002
CHARS    DC    C'0123456789ABCDEF'                                      77120002
WORK     DS    D                                                        77200002
NONE     DC    C'NONE'                                                  77280002
JOBID    DC    C'JOB IDENTITY'                                          77360002
TWOFOUR  DC    H'24'                                                    77440002
LABELS   DC    X'00'                                                    77520002
ENTRIES  DS    0F                                                       77600002
         DC    XL4'00'            FORMAT 1                              77680002
         DC    XL4'00'            FORMAT 2                              77760002
         DC    A(LABLES)          LABEL POINTER                         77840002
         DC    H'0'               DISP                                  77920002
         LINE  ,(1,)                                                    78000002
         ROUTINE SPARES,TYPETEST                                        78080002
         LABEL ''                                                       78160002
* THIS IS THE FULL OBR PRINTOUT FOR PERMANENT ERRORS                  * 78240002
         LINE  ,,SKIP=E                                                 78320002
         LABEL ''                                                       78400002
         LINE  (67,21),(1,76),SKIP=2                                    78480002
         HEX   CPUID,0,2B                                               78560002
         HEX   CPUSER,0,3B                                              78640002
TYPENT   LABEL '--- RECORD ENTRY TYPE - UNIT CHECK    SOURCE - OUTBOARDX78720002
                   MODEL-','SERIAL NO.'                                 78800002
         LINE  (16,1),(4,1)                                      S21021 78880002
         ROUTINE    SYSREL,CONVREL                                      78960002
         LABEL      'XXXX REL.'                                         79040002
         LINE  (69,1),(31,19)                                    S21021 79120002
         ROUTINE XPGN1,SETPGMN                                   S21021 79200002
         LABEL 'DAY YEAR','HH MM SS.TH'                          S21021 79280002
         LINE  (82,8),SKIP=0                                            79360002
         HEX   (XPGN1,0),(XPGN2,0)                                      79440002
         ROUTINE SPARES,SHRTST                                          79520002
         LABEL ''                                                       79600002
         LINE  (31,19),(25,19),SKIP=2                                   79680002
         ROUTINE    DUM1,SETDATE                                        79760002
         HEX   TIME,1,4B                                                79840002
         LABEL 'DATE-','TIME-'                                   S21021 79920002
         LINE  ,(2,1),SKIP=2                                            80000002
         LABEL 'DEVICE TYPE                     3886'                   80080002
         LINE  (34,1),(2,1),SKIP=1                                      80160002
         HEX   PRIMCUA,B0,3B                                            80240002
         LABEL 'PRIMARY   CHANNEL UNIT ADDRESS'                  S21021 80320002
         LINE                                                           80400002
         HEX   SECONCUA,B0,3B                                           80480002
         ROUTINE SPARES,SKIPTST1                                        80560002
         LABEL 'ALTERNATE CHANNEL UNIT ADDRESS  '                S21021 80640002
         LINE                                                           80720002
         LABEL ' '                                               S21021 80800002
         LINE  (1,1),(23,38)                                     S21021 80880002
         LABEL 'CC   CA   FL     CT','K    CA   US CS  CT'       S21021 80960002
         LINE  (23,3),(5,51),SKIP=2                              S21021 81040002
         HEX   XFCCWCC,0,1B                                      S21021 81120002
         HEX   XFCCWDA,0,3B                                      S21021 81200002
         ROUTINE  XDUM2,SPACER1                                         81280002
         HEX   XFCCWFL,0,1B                                      S21021 81360002
         HEX   XZERO,0,1B                                        S21021 81440002
         HEX   XFCCWCT,0,2B                                      S21021 81520002
         ROUTINE  XDUM2,SPACER16                                        81600002
         HEX   CSWKEY,0,1B                                              81680002
         HEX   XCSWCA,0,3B                                       S21021 81760002
         ROUTINE  XDUM2,SPACER1                                         81840002
         ROUTINE   ATTEN,SETHEX                                         81920002
         ROUTINE XCSWPCI,SETHEX                                  S21021 82000002
         HEX   XCSWCT,0,2B                                       S21021 82080002
         LABEL 'FAILING CCW','CSW'                               S21021 82160002
         LINE  ,(21,52),SKIP=2                                          82240002
         LABEL 'UNIT STATUS','CHANNEL STATUS'                           82320002
         LINE  (20,29),(1,29),SKIP=1                                    82400002
         BIN   (ATTEN),(XCSWCE),(XCSWPCI),(XCSWCDC)                     82480002
         LABEL 'NOT USED','CHANNEL END','PRGM-CTLD TRPT',              X82560002
               'CHAN DATA CHECK'                                        82640002
         LINE                                                           82720002
         BIN   (XCSWSM),(XCSWDE),(XCSWICC),(XCSWCCC)                    82800002
         LABEL 'NOT USED','DEVICE END','INCRCT LENGTH','CHAN CTL CHECK' 82880002
         LINE                                                           82960002
         BIN   (XCSWCUE),(XCSWUC),(XCSWPC),(XCSWICC)                    83040002
         LABEL 'NOT USED','UNIT CHECK','PROGRAM CHECK','I/F CTL CHECK'  83120002
         LINE  (20,29),(1,29),SKIP=2                                    83200002
         BIN   (XCSWBSY),(XCSWUE),(XCSWPCHK),(XCSWCH)                   83280002
         LABEL 'BUSY','UNIT EXCEPTION','PROT CHECK','CHAINING CHECK'    83360002
         LINE  (30,42),(1,44)                                           83440002
         ROUTINE DEVDID,FORMID                                          83520002
         HEX   DEVDTA,0,4B                                              83600002
         LABEL 'CURRENT FORMAT RECORD ID','COMMAND DEPENDENT DATA'      83680002
SHORT1   LINE  SKIP=1                                                   83760002
SHRTL1   LABEL ''                                                       83840002
         LINE  (37,21),(3,38),SKIP=2                                    83920002
         HEX   STATFLG                                                  84000002
         HEX   CEMODE                                                   84080002
         LABEL 'STATISTICAL DATA-BYTE 0 (FLAGS)','BYTE 1 (SPARE)'       84160002
         LINE  ,(3,),SKIP=2                                             84240002
         LABEL 'STATISTICAL DATA COUNTERS 0-39'                         84320002
         LINE  (20,29),(1,29),SKIP=1                                    84400002
         ROUTINE    CTR0,CONVLFT                                        84480002
         ROUTINE    CTR10,CONVLFT                                       84560002
         ROUTINE    CTR20,CONVLFT                                       84640002
         ROUTINE    CTR30,CONVLFT                                       84720002
         LABEL 'SPRTOR JAM SW','INTM TRNS OVRRUN','LINE MK REQ ERROR','X84800002
               LINE MK PRT CHK'                                         84880002
         LINE                                                           84960002
         ROUTINE    CTR1,CONVRHT                                        85040002
         ROUTINE    CTR11,CONVRHT                                       85120002
         ROUTINE    CTR21,CONVRHT                                       85200002
         ROUTINE    CTR31,CONVRHT                                       85280002
         LABEL 'SPRTOR TIMEOUT','STEP MOT STOP ERR','TRAV LIMIT SW','LIX85360002
               NE MK DET ERR'                                           85440002
         LINE                                                           85520002
         ROUTINE    CTR2,CONVLFT                                        85600002
         ROUTINE    CTR12,CONVLFT                                       85680002
         ROUTINE    CTR22,CONVLFT                                       85760002
         ROUTINE    CTR32,CONVLFT                                       85840002
         LABEL 'TOO LONG DOC','STACK A OR B JAM','TRAV TIME OVRRUN','LIX85920002
               NE MK MISCOMP'                                           86000002
         LINE                                                           86080002
         ROUTINE    CTR3,CONVRHT                                        86160002
         ROUTINE    CTR13,CONVRHT                                       86240002
         ROUTINE    CTR23,CONVRHT                                       86320002
         ROUTINE    CTR33,CONVRHT                                       86400002
         LABEL 'ALGN SCT TIMEOUT','STEP MOT STRT ERR','TRAV EMITTER ERRX86480002
               ','CHAR OUT OF SCAN'                                     86560002
         LINE                                                           86640002
         ROUTINE    CTR4,CONVLFT                                        86720002
         ROUTINE    CTR14,CONVLFT                                       86800002
         ROUTINE    CTR24,CONVLFT                                       86880002
         ROUTINE    CTR34,CONVLFT                                       86960002
         LABEL 'INTD TRANSPORT','STEP MOT SPD ERR','TRAV SPEED ERR','FLX87040002
               D DELIM NOT FND'                                         87120002
         LINE                                                           87200002
         ROUTINE    CTR5,CONVRHT                                        87280002
         ROUTINE    CTR15,CONVRHT                                       87360002
         ROUTINE    CTR25,CONVRHT                                       87440002
         ROUTINE    CTR35,CONVRHT                                       87520002
         LABEL 'STACKER SEL ERR','INC TIMEOUT','TRAV SCAN PITCH','CHAR X87600002
               ON FLD BOUND'                                            87680002
         LINE                                                           87760002
         ROUTINE    CTR6,CONVLFT                                        87840002
         ROUTINE    CTR16,CONVLFT                                       87920002
         ROUTINE    CTR26,CONVLFT                                       88000002
         ROUTINE    CTR36,CONVLFT                                       88080002
         LABEL 'HOP NOT IN POS','STACK SEL JAM','SPARE','VIDEO OVRRUN'  88160002
         LINE                                                           88240002
         ROUTINE    CTR7,CONVRHT                                        88320002
         ROUTINE    CTR17,CONVRHT                                       88400002
         ROUTINE    CTR27,CONVRHT                                       88480002
         ROUTINE    CTR37,CONVRHT                                       88560002
         LABEL 'SER NO UPDATE CHK','CLUTCH FAIL PICK','SPARE','CHAR BUFX88640002
               F OVRFLOW'                                               88720002
         LINE                                                           88800002
         ROUTINE    CTR8,CONVLFT                                        88880002
         ROUTINE    CTR18,CONVLFT                                       88960002
         ROUTINE    CTR28,CONVLFT                                       89040002
         ROUTINE    CTR38,CONVLFT                                       89120002
         LABEL 'STACKER A JAM','SPARE','LINE MK NOT COMP','NOISE CHECK' 89200002
         LINE  (20,29),(1,29),SKIP=2                                    89280002
         ROUTINE    CTR9,CONVRHT                                        89360002
         ROUTINE    CTR19,CONVRHT                                       89440002
         ROUTINE    CTR29,CONVRHT                                       89520002
         ROUTINE    CTR39,CONVRHT                                       89600002
         LABEL 'STACKER B JAM','RD STA TIME MK CK','SER NO PRT CHK','SPX89680002
               ARE'                                                     89760002
         LINE  ,(3,),SKIP=2                                             89840002
         LABEL 'STATISTICAL DATA COUNTERS 40-55'                        89920002
         LINE  (20,29),(1,29),SKIP=1                                    90000002
         ROUTINE CTR40,CONVLFT                                          90080002
         ROUTINE CTR50,CONVLFT                                          90160002
         LABEL 'SPARE','SPARE'                                          90240002
         LINE                                                           90320002
         ROUTINE CTR41,CONVRHT                                          90400002
         ROUTINE CTR51,CONVRHT                                          90480002
         LABEL 'SPARE','SPARE'                                          90560002
         LINE                                                           90640002
         ROUTINE CTR42,CONVLFT                                          90720002
         ROUTINE CTR52,CONVLFT                                          90800002
         LABEL 'SPARE','SPARE'                                          90880002
         LINE                                                           90960002
         ROUTINE CTR43,CONVRHT                                          91040002
         ROUTINE CTR53,CONVRHT                                          91120002
         LABEL 'SPARE','SPARE'                                          91200002
         LINE                                                           91280002
         ROUTINE CTR44,CONVLFT                                          91360002
         ROUTINE CTR54,CONVLFT                                          91440002
         LABEL 'SPARE','SPARE'                                          91520002
         LINE                                                           91600002
         ROUTINE CTR45,CONVRHT                                          91680002
         ROUTINE CTR55,CONVRHT                                          91760002
         LABEL 'SPARE','SPARE'                                          91840002
         LINE                                                           91920002
         ROUTINE CTR46,CONVLFT                                          92000002
         LABEL 'SPARE'                                                  92080002
         LINE                                                           92160002
         ROUTINE CTR47,CONVRHT                                          92240002
         LABEL 'SPARE'                                                  92320002
         LINE                                                           92400002
         ROUTINE CTR48,CONVLFT                                          92480002
         LABEL 'SPARE'                                                  92560002
         LINE  SKIP=2                                                   92640002
         ROUTINE CTR49,CONVRHT                                          92720002
         LABEL 'SPARE'                                                  92800002
         LINE  (13,9),(1,19),SKIP=2                                     92880002
         HEX   SNSBYT,17,6B                                             92960002
         ROUTINE SPARES,SKIPTST2                                        93040002
         LABEL 'BYTE 0','BYTE 1','   BYTE 2','   BYTE 3','BYTE 4','BYTEH93120002
                5'                                                      93200002
         LINE  (14,19),(1,19),SKIP=0                                    93280002
         BIN   (SNB00),(SNB10)                                          93360002
         ROUTINE    SPARES,DONOTHNG                                     93440002
         ROUTINE    SPARES,DONOTHNG                                     93520002
         BIN   (SNB40),(SNB50)                                          93600002
         LABEL 'CMND REJ','NOT USED','','','ISM M SIZE','NOT USED'      93680002
         LINE  (52,19),SKIP=1                                           93760002
         BIN   (SNB20,,8),(SNB30,,8)                                    93840002
         LABEL ''                                                       93920002
         LINE  (14,),(1,19),SKIP=1                                      94000002
         BIN   (SNB01),(SNB11)                                          94080002
         ROUTINE    SPARES,DONOTHNG                                     94160002
         ROUTINE    SPARES,DONOTHNG                                     94240002
         BIN   (SNB41),(SNB51)                                          94320002
         LABEL 'INTV REQD','MARK CHECK','','','ISM M SIZE','A DATA ST'  94400002
         LINE                                                           94480002
         BIN   (SNB02),(SNB12)                                          94560002
         ROUTINE    SPARES,DONOTHNG                                     94640002
         ROUTINE    SPARES,DONOTHNG                                     94720002
         BIN   (SNB42),(SNB52)                                          94800002
         LABEL 'BUS O CHK','INV FORMAT','','','ISM M SIZE','NHP/G HARD' 94880002
         LINE                                                           94960002
         BIN   (SNB03),(SNB13)                                          95040002
         ROUTINE    SPARES,DONOTHNG                                     95120002
         ROUTINE    SPARES,DONOTHNG                                     95200002
         BIN   (SNB43),(SNB53)                                          95280002
         LABEL 'EQUIP CHK','NOT USED','','','ISM M SIZE','ANAFNT PG RT' 95360002
         LINE                                                           95440002
         BIN   (SNB04),(SNB14)                                          95520002
         ROUTINE    SPARES,DONOTHNG                                     95600002
         ROUTINE    SPARES,DONOTHNG                                     95680002
         BIN   (SNB44),(SNB54)                                          95760002
         LABEL 'NOT USED','INCP SCAN','','','NOT USED','NUM A-FONT'     95840002
         LINE                                                           95920002
         BIN   (SNB05),(SNB15)                                          96000002
         ROUTINE    SPARES,DONOTHNG                                     96080002
         ROUTINE    SPARES,DONOTHNG                                     96160002
         BIN   (SNB45),(SNB55)                                          96240002
         LABEL 'NOT USED','NOT USED','','','INC HOP-STK','AN B-FONT'    96320002
         LINE                                                           96400002
         BIN   (SNB06),(SNB16)                                          96480002
         ROUTINE    SPARES,DONOTHNG                                     96560002
         ROUTINE    SPARES,DONOTHNG                                     96640002
         BIN        (SNB46),(SNB56)                                     96720002
         LABEL 'NON INIT','NON RCVRY','','','SER NUMB','NUM B-FONT'     96800002
         LINE                                                           96880002
         BIN   (SNB07),(SNB17)                                          96960002
         ROUTINE    SPARES,DONOTHNG                                     97040002
         ROUTINE    SPARES,DONOTHNG                                     97120002
         BIN   (SNB47),(SNB57)                                          97200002
         LABEL 'N IN/RCP E','OUTB RECD','','','LINE MKNG','NHP G ISM'   97280002
         LINE  ,(1,)                                                    97360002
         ROUTINE    SPARES,DONOTHNG                                     97440002
         LABEL ''                                                       97520002
SHORT2   LINE  SKIP=2                                                   97600002
         ROUTINE SPARES,RESETR2                                         97680002
SHRTL2   LABEL ''                                                       97760002
         LINE  SKIP=1                                                   97840002
         ROUTINE SPARES,NOPRINT                                         97920002
         LABEL ''                                                       98000002
         LABEL ''                                                       98080002
         DC    X'FF'                                                    98160002
DMPSIZE  DC    X'006C'                                                  98240002
         DC    XL2'0018'                                                98320002
         DC    XL2'0000'                                                98400002
LABLES   DS    0F                                                       98480002
         LSTART                                                         98560002
         END                                                            98640002
