*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 00070002
         SPACE 2                                                        00140002
         MACRO                                                          00210002
&NAME    DSGEN &X1,&X2,&X3,&X4,&X5,&X6,&X7,&X8,&X9,&X10,&X11,&X12,&X13,X00280002
               &X14,&X15,&X16,&X17,&X18,&X19,&X20,&X21,&X22,&X23,&X24, X00350002
               &X25,&X26,&X27,&X28,&X29,&X30,&X31,&X32                  00420002
.*                            THIS MACRO GENERATES ONE DSECT WORD       00490002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 00560002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  00630002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    00700002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 00770002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   00840002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 00910002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      00980002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  01050002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    01120002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   01190002
         GBLC &ITEM(1000)                                               01260002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000)                         01330002
         LCLC  &SYMBOL                                                  01400002
         LCLA  &OP,&COUNT,&BYTE                                         01470002
.LOOP    ANOP                                                           01540002
&OP      SETA  &OP+1                                                    01610002
&ITEMNBR SETA  &ITEMNBR+1                                               01680002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        01750002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            01820002
         MNOTE *,'NULL BIT COUNT FIELD'                                 01890002
         MEXIT                                                          01960002
.OK1     ANOP                                                           02030002
         AIF   ('&SYMBOL' NE '').OK                                     02100002
         MNOTE 'LOG ITEM SYMBOL NOT PROVIDED'                           02170002
         AGO   .CNT                                                     02240002
.OK      ANOP                                                           02310002
         AIF   ('&SYMBOL'(1,1) EQ '''').CNT                *TEMP*       02380002
&SYMBOL  EQU   *+&BYTE                                                  02450002
&ITEM(&ITEMNBR)  SETC '&SYSLIST(&OP,1)'                                 02520002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    02590002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    02660002
.CNT     ANOP                                                           02730002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   02800002
&BYTE    SETA  &COUNT/8                                                 02870002
         AIF (&OP LT N'&SYSLIST).LOOP                                   02940002
         AIF   (&COUNT NE 32).NOT32                                     03010002
&NAME    DS    4C                                                       03080002
         MEXIT                                                          03150002
.NOT32   AIF   (&COUNT NE 64).ERR                                       03220002
&NAME    DS    8C                                                       03290002
         MEXIT                                                          03360002
.ERR     MNOTE '**BIT COUNT FIELDS DO NOT TOTAL 32 OR 64**'             03430002
         MEND                                                           03500002
         EJECT                                                          03570002
*  LINE MACRO     LINE MACRO     LINE MACRO     LINE MACRO            * 03640002
         SPACE 2                                                        03710002
         MACRO                                                          03780002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      03850002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     03920002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    03990002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 04060002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    04130002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    04200002
.*                                 THE PREVIOUS LINE AND STORES THAT #  04270002
.*                                 INTO THE APPROPRIATE BYTE.           04340002
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    04410002
.*                                 DATA.                                04480002
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 04550002
.*                                 DATA COLUMN STARTING CHARACTERS.     04620002
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   04690002
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 04760002
.*                                 STARTING CHARACTERS.                 04830002
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   04900002
.*                                 TO BEGIN NEXT PRINTED LINE.          04970002
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       05040002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   05110002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 05180002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   05250002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 05320002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    05390002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   05460002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   05530002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  05600002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   05670002
.*                                 THE SUBJECT LINE                     05740002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  05810002
         GBLA  &LASTCC,&INITIAL                                         05880002
         GBLC  &NRENTSX                                                 05950002
         GBLC  &CARRCON                                                 06020002
         GBLB  &TEST                                                    06090002
         LCLA  &S                                                       06160002
&NAME    DS    0C                                                       06230002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  06300002
         LINEND                                                         06370002
         AGO   .NTFIRST                                                 06440002
.FIRSTLN ANOP                                                           06510002
&NRENTSX SETC  'N&SYSNDX'                                               06580002
&INITIAL SETA  1                                                        06650002
N&SYSNDX EQU   *                                                        06720002
.NTFIRST ANOP                                                           06790002
         DC    AL1(0)                                                   06860002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               06930002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                07000002
&DB      SETA  &DATA(1)                                                 07070002
         AGO   .AA                                                      07140002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                07210002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 07280002
         AGO   .CC                                                      07350002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    07420002
         AIF   (&DATA(2) EQ &DT).BB                                     07490002
.CC      ANOP                                                           07560002
&DT      SETA  &DATA(2)                                                 07630002
.BB      DC    XL2'FFFE'                                                07700002
         DC    FL1'&DB'                                                 07770002
         DC    FL1'&DT'                                                 07840002
&NRENTS  SETA  &NRENTS+1                                                07910002
.NCDATA  ANOP                                                           07980002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              08050002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               08120002
&LB      SETA  &LABEL(1)                                                08190002
         AGO   .AAA                                                     08260002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              08330002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               08400002
         AGO   .CCC                                                     08470002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  08540002
         AIF   (&LABEL(2) EQ &LT).BBB                                   08610002
.CCC     ANOP                                                           08680002
&LT      SETA  &LABEL(2)                                                08750002
.BBB     DC    XL2'FFFF'                                                08820002
         DC    FL1'&LB'                                                 08890002
         DC    FL1'&LT'                                                 08960002
&NRENTS  SETA  &NRENTS+1                                                09030002
.NCLABEL ANOP                                                           09100002
         AIF   ('&SKIP' NE '').CONT                                     09170002
         AIF   (&TEST EQ 0).NOCHANG                                     09240002
&S       SETA  &LASTCC                                                  09310002
         AGO   .DEFAULT                                                 09380002
.CONT    ANOP                                                           09450002
         AIF   (&TEST EQ 0).AB                                          09520002
&S       SETA  &SKIP                                                    09590002
.DEFAULT ANOP                                                           09660002
         ORG   &CARRCON+3                                               09730002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 09800002
         ORG                                                            09870002
&LASTCC  SETA  &S                                                       09940002
&TEST    SETB  0                                                        10010002
         AGO   .DD                                                      10080002
.AB      AIF   (&SKIP EQ &LASTCC).NOCHANG                               10150002
A&SYSNDX DC    XL2'FFFB'                                                10220002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              10290002
         DC    FL1'9'                                                   10360002
&LASTCC  SETA  &SKIP                                                    10430002
&TEST    SETB  1                                                        10500002
&CARRCON SETC  'A&SYSNDX'                                               10570002
&NRENTS  SETA  &NRENTS+1                                                10640002
.DD      ANOP                                                           10710002
.NOCHANG ANOP                                                           10780002
         MEND                                                           10850002
         EJECT                                                          10920002
*  BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO  * 10990002
         SPACE 2                                                        11060002
         MACRO                                                          11130002
         BIN   &LOGITEM,&SKIP$OR                                        11200002
.*                                 &LOGITEM - NAME OF ITEM IN LOG       11270002
.*                                      RECORD DSECT                    11340002
.*                                 &SKIP$OR - NBR OF SPACES TO SKIP ON  11410002
.*                                 MULTIPLE PRINT OR NBR OF SPACES      11480002
.*                                      TO BACK UP FROM COLUMN FOR      11550002
.*                                      START OF PRINTING. THE LETTER   11620002
.*                                      B PRECEEDS THE NUMBER (B5) IF   11690002
.*                                      THE LATTER IS DESIRED. OMISSION 11760002
.*                                      OF THIS OPERAND FORCES OPTION 2 11830002
.*                                      WITH BACKUP SPACING EQUAL TO    11900002
.*                                 THE NUMBER OF BITS IN THE ITEM       11970002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      12040002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     12110002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       12180002
         GBLC &ITEM(1000)                                               12250002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 12320002
         GBLC  &DSECT                                                   12390002
         LCLB  &B                                                       12460002
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   12530002
         LCLA  &TEMP,&T                                                 12600002
         LCLC  &S                                                       12670002
.LOOP    ANOP                                                           12740002
&NDX     SETA  &NDX+1                                                   12810002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      12880002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  12950002
         MNOTE *,'YOU BLEW IT'                                          13020002
         ROUTINE DUM,SKIPPER                                            13090002
         MEXIT                                                          13160002
.FOUND   ANOP                                                           13230002
&ISHIFT  SETA  &SHIFT(&NDX)                                             13300002
&IBITS   SETA  &BITS(&NDX)                                              13370002
&T       SETA  &IBITS-1                                                 13440002
&B       SETB  0                                                        13510002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                13580002
&K       SETA  K'&SKIP$OR                                               13650002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 13720002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   13790002
&T       SETA  &S                                                       13860002
.BACKUP  ANOP                                                           13930002
&NRENTS  SETA  &NRENTS+1                                                14000002
&TEMP    SETA  &ISHIFT                                                  14070002
A&SYSNDX DC    AL.12(&LOGITEM-&DSECT),XL.4'&TEMP'                       14140002
         AIF (&IBITS EQ 1 AND &B EQ 0).OUT                              14210002
         ORG   A&SYSNDX                                                 14280002
&B       SETB  1                                                        14350002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'C'                           14420002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             14490002
.OUT     ANOP                                                           14560002
         MEND                                                           14630002
         EJECT                                                          14700002
*  HEX MACRO     HEX MACRO     HEX MACRO    HEXN MACRO     HEX MACRO  * 14770002
         SPACE 2                                                        14840002
         MACRO                                                          14910002
         HEX   &LOGITEM,&SKIP$OR,&BYTES                                 14980002
.*                            THIS MACRO FACILITATES GENERATION OF THE  15050002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    15120002
.*                                 CONVERSIONS.                         15190002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE        15260002
.*                                 CONVERTED                            15330002
.*                            &SKIP$OR - NUMBER OF SPACES TO SKIP ON    15400002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   15470002
.*                                 BACK UP FROM COLUMN FOR START OF     15540002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  15610002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  15680002
.*                                 DESIRED. OMISSION OF THIS OPERAND    15750002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  15820002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  15890002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 15960002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    16030002
.*                                 IMPLICITLY B).                       16100002
.*                            &BYTES - NUMBER OF TOTAL INPUT BYTES TO   16170002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     16240002
.*                                 WITH AN L,R, OR B TO STIPULATE       16310002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     16380002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     16450002
.*                                 RESPECTIVELY. OMISSION OF THIS       16520002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  16590002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 16660002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 16730002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   16800002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     16870002
.*                                 SUBJECT LINE(S).                     16940002
         GBLC &ITEM(1000),&DSECT                                        17010002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 17080002
         LCLB  &B                                                       17150002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP                  17220002
         LCLC  &S,&LETTER                                               17290002
.LOOP    ANOP                                                           17360002
&NDX     SETA  &NDX+1                                                   17430002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      17500002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  17570002
         MNOTE *,'LOG ITEM NOT DEFINED'                                 17640002
         MEXIT                                                          17710002
.FOUND   ANOP                                                           17780002
&ISHIFT  SETA  &SHIFT(&NDX)                                             17850002
&IBITS   SETA  &BITS(&NDX)                                              17920002
&CODE    SETA  1                                                        17990002
&K       SETA  K'&BYTES                                                 18060002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            18130002
         MNOTE *,'BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL'   18200002
         MEXIT                                                          18270002
.OK      AIF   ('&BYTES' EQ '').USEDEFN                                 18340002
&LETTER  SETC  '&BYTES'(&K,1)                                           18410002
&S       SETC  '&BYTES'(1,&K-1)                                         18480002
&BYTESP  SETA  &S                                                       18550002
         AIF   ('&LETTER' EQ 'B').BOTH                                  18620002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).OK2                       18690002
.ERR     MNOTE *,'DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY'            18760002
         MEXIT                                                          18830002
.USEDEFN ANOP                                                           18900002
&BYTESP  SETA  &IBITS/8                                                 18970002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       19040002
&CODE    SETA  3                                                        19110002
&T       SETA  &BYTESP*2-1                                              19180002
&S       SETC  '&T'                                                     19250002
.OK2     AIF   (&ISHIFT EQ 0).L                                         19320002
&CODE    SETA  2                                                        19390002
.L       ANOP                                                           19460002
&B       SETB  1                                                        19530002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                19600002
&K       SETA  K'&SKIP$OR                                               19670002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 19740002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   19810002
.BACKUP  ANOP                                                           19880002
&NRENTS  SETA  &NRENTS+1                                                19950002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'A'                           20020002
         DC    BL.1'&B',FL.7'&S',FL.4'&BYTESP',FL.4'&CODE'              20090002
.OUT     ANOP                                                           20160002
         MEND                                                           20230002
         SPACE 2                                                        20300002
*  ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO* 20370002
         SPACE 2                                                        20440002
         MACRO                                                          20510002
&NAME    ROUTINE &LOGITEM,&RNAME                                        20580002
         GBLC  &DSECT,&CSECT                                            20650002
         GBLC  &ITEM(1000)                                              20720002
         GBLA  &SHIFT(1000),&ITEMNBR                                    20790002
         GBLA  &NRENTS                                                  20860002
         LCLA  &ISHIFT,&NDX                                             20930002
.LOOP    ANOP                                                           21000002
&NDX     SETA  &NDX+1                                                   21070002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      21140002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  21210002
         MNOTE *,'LOG ITEM NOT DEFINED'                                 21280002
         MEXIT                                                          21350002
.FOUND   ANOP                                                           21420002
&ISHIFT  SETA  &SHIFT(&NDX)                                             21490002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           21560002
         DC    AL.4(&ISHIFT),AL.12(&RNAME-&CSECT)                       21630002
&NRENTS  SETA  &NRENTS+1                                                21700002
         MEND                                                           21770002
         EJECT                                                          21840002
*  LABEL MACRO     LABEL MACRO     LABEL MACRO     LABEL MACRO        * 21910002
         SPACE 2                                                        21980002
         MACRO                                                          22050002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C22120002
               &LABEL7,&LABEL8                                          22190002
.*                            THIS MACRO ALLOWS UP TO ACHT LABELS TO    22260002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   22330002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  22400002
.*                                 TION MARKS. THE COLUMN AND LINE END  22470002
.*                                 CONTROLS WILL BE INSERTED BY THE     22540002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      22610002
.*                                 LABEL REQUIRED FOR RESPECTIVE        22680002
.*                                 COLUMN. THIS MACRO WILL ALSO ALERT   22750002
.*                                 THE PROGRAMMER TO EXACTLY WHERE THE  22820002
.*                                 TABLE MUST BE BROKEN IF NECESSARY    22890002
.*                                 TO AVOID EXCEEDING THE MAXIMUM LIMIT 22960002
         GBLC &LABELS(2000)                                             23030002
         GBLC  &LBL(100)                                                23100002
         GBLA  &LBLCTR(100)                                             23170002
         GBLA  &LABELNR                                                 23240002
         GBLA  &NRENTS,&LPTR                                            23310002
         LCLC  &MARGIN,&TACK                                            23380002
         LCLC  &TEXT                                                    23450002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            23520002
&MARGIN  SETC  '*'                                                      23590002
         AIF   ('&NAME' EQ '').LOOPOUT                                  23660002
&LPTR    SETA  &LPTR+1                                                  23730002
&LBL(&LPTR) SETC '&NAME'                                                23800002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          23870002
.LOOPOUT ANOP                                                           23940002
&OP      SETA  &OP+1                                                    24010002
&K       SETA  K'&SYSLIST(&OP)                                          24080002
         AIF (&K GE 2).NORM                                             24150002
&K       SETA  2                                                        24220002
.NORM    ANOP                                                           24290002
&START   SETA  2                                                        24360002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                24430002
&MARGIN  SETC  '$'                                                      24500002
.NOTLAST ANOP                                                           24570002
&NRCHAR  SETA  8                                                        24640002
&TACK    SETC  ''                                                       24710002
.LOOPIN  ANOP                                                           24780002
&REMAIN  SETA  &K-&START                                                24850002
         AIF (&REMAIN GE 8).MORE                                        24920002
&TACK    SETC  '&MARGIN'                                                24990002
&NRCHAR  SETA  &REMAIN                                                  25060002
.MORE    ANOP                                                           25130002
&TEXT    SETC  ''                                                       25200002
         AIF (&REMAIN EQ 0).ENDTEXT                                     25270002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          25340002
.ENDTEXT ANOP                                                           25410002
&LABELNR SETA  &LABELNR+1                                               25480002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  25550002
&START   SETA  &START+8                                                 25620002
         AIF ('&TACK' EQ '').LOOPIN                                     25690002
         AIF ('&TACK' EQ '*').LOOPOUT                                   25760002
         MEND                                                           25830002
         SPACE 2                                                        25900002
         MACRO                                                          25970002
         LSTART                                                         26040002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  26110002
.*                                 OF THE TABLE IS TO BEGIN.            26180002
         GBLC &LABELS(2000)                                             26250002
         GBLA  &LABELNR                                                 26320002
         GBLC  &LBL(100)                                                26390002
         GBLA  &LBLCTR(100)                                             26460002
         LCLA  &NDX,&CTR                                                26530002
         LINEND                                                         26600002
&CTR     SETA  1                                                        26670002
.LOOP    ANOP                                                           26740002
&NDX     SETA  &NDX+1                                                   26810002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            26880002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         26950002
&CTR     SETA  &CTR+1                                                   27020002
         AGO   .LOOPCTL                                                 27090002
.NOLBL   ANOP                                                           27160002
         DC    C'&LABELS(&NDX)'                                         27230002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  27300002
         MEND                                                           27370002
         SPACE 2                                                        27440002
         MACRO                                                          27510002
         LINEND                                                         27580002
.*                            THIS MACRO IS USED ONLY BY THE LINE       27650002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   27720002
.*                                 ASSOCIATED WITH EACH LINE.           27790002
         GBLA  &NRENTS                                                  27860002
         GBLC &NRENTSX                                                  27930002
         ORG   &NRENTSX                                                 28000002
         DC    FL1'&NRENTS'                                             28070002
         ORG                                                            28140002
&NRENTS  SETA  0                                                        28210002
B&SYSNDX EQU   *                                                        28280002
&NRENTSX SETC  'B&SYSNDX'                                               28350002
         MEND                                                           28420002
         GBLC  &DSECT,&CSECT                                            28490002
&DSECT   SETC  'B2715'                                                  28560002
&CSECT   SETC  'IFCET008'                                               28630002
         TITLE 'IFCET008 - EDIT MODULE- LINKNAME=IFCET008'              28700002
*                                                                       28770002
IFCET008 CSECT                                                          28840002
*                                                                       28910002
*              2715  EDIT & PRINT SECTION                               28980002
*                                                                       29050002
         USING *,R9,R15                                                 29120002
*                                                                       29190002
*              DSECT FOR TABLE                                          29260002
*                                                                       29330002
B2715E   DSECT                                                          29400002
         DSGEN (BTIMES,56),                                            C29470002
               (B0BIT0,1),(B0BIT1,1),(B0BIT2,1),(B0BIT3,1),            C29540002
               (B0BIT4,1),(B0BIT5,1),(B0BIT6,1),(B0BIT7,1)              29610002
         DSGEN (B1BIT0,1),(B1BIT1,1),(B1BIT2,1),(B1BIT3,1),            C29680002
               (B1BIT4,1),(B1BIT5,1),(B1BIT6,1),(B1BIT7,1),            C29750002
               (B2BIT0,1),(B2BIT1,1),(B2BIT2,1),(B2BIT3,1),            C29820002
               (B2BIT4,1),(B2BIT5,1),(B2BIT6,1),(B2BIT7,1),            C29890002
               (B3BIT0,1),(B3BIT1,1),(B3BIT2,1),(B3BIT3,1),            C29960002
               (B3BIT4,1),(B3BIT5,1),(B3BIT6,1),(B3BIT7,1),(BDUM,8)     30030002
*                                                                       30100002
*              DSECT FOR RECORD                                         30170002
*                                                                       30240002
B2715    DSECT                                                          30310002
         DSGEN (KEY,8),(XRELN,8),(TSWS,16),(TID,8),(TDUM1,16),         C30380002
               (TCHAR,8)                                                30450002
         DSGEN (DATE,32),(TIME,32)                                      30520002
         DSGEN (TDUM2,8),(TSER,24),(TMOD,16),(TDUM3,16)                 30590002
         DSGEN (TCUA,16),(TSID,16)                                      30660002
*                                                                       30730002
*              HEADER CONSTENTS                                         30800002
*                                                                       30870002
IFCET008 CSECT                                                          30940002
         DC    A(EDIT)             PTR TO EDIT ENTRIES                  31010002
         DC    CL8'IFCET008'                                            31080002
R9PTR    DC    F'0'                CURRENT ENTRY PTR                    31150002
LABELPTR DC    F'0'                CURRENT LABEL PTR                    31220002
*                                                                       31290002
*                                                                       31360002
*                                                                       31430002
         EJECT                                                          31500002
*                                                                       31570002
*                                                                       31640002
*              SPECIAL ROUTINES                                         31710002
*                                                                       31780002
*                                                                       31850002
*                                                                       31920002
*                                                                       31990002
CONVREL  STM   R14,R12,L12(R13)         SAVE REGS                       32060002
         SR    R6,R6                    CLEAR R6                        32130002
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        32200002
         SRDL  R6,L5                    SAVE REL NO IN R7               32270002
        SLL   R6,L2                    MULTIPLY SYS VALUE BY 4          32340002
         L     R8,XLABELP               PICK UP LABEL POINTER           32410002
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     32480002
         MVC   L0(L4,R8),L0(R6)         MOVE SYSTEM NAME INTO LABEL     32550002
         SR    R6,R6                    CLEAR R6                        32620002
         SLDL  R6,L5                    RETREIVE REL NO.                32690002
         LTR   R6,R6                    IS IT ZERO                      32760002
         BZ    NOREL                    BR-YES                          32830002
         CVD   R6,WORK                  CONVERT IT                      32900002
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFF       32970002
         MVZ   L1(L1,R3),L0(R3)         MOVE ON PROPER ZONE             33040002
         B     RETURN                   EXIT                            33110002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL            33180002
         B     RETURN                                                   33250002
LOOPER   STM   R14,R12,L12(R13)        SAVE REGS                        33320002
         LA    R15,4095(R9)              SET SECOND BASE REG            33390002
         LA    R15,L1(R15)                                              33460002
         CLI   L11(R2),HEXFF       TABLE DONE                           33530002
         BE    DONE                BR-YES                               33600002
         AH    R2,H11              BUMP TO NXT SLOT                     33670002
         ST    R2,L28(R13)              STORE NEW POINTER               33740002
         CLI   L7(R2),HEX80        IS THIS AREA STATIONS                33810002
         BL    REGULAR             BR-NO                                33880002
         CLI   SWITCH,HEXFF        HAS HDR BEEN PUT OUT                 33950002
         BE    AREASTNS            YES                                  34020002
         LA    R5,AREASTHD-L4                                           34090002
         LA    R6,AREASTLB         SET PTRS TO PUT OUT HEADER           34160002
LPRTN    STM   R5,R6,R9PTR                                              34230002
         B     RETURN                                                   34300002
DONE     LA    R5,LOOPERST         SET PTRS                             34370002
         LA    R6,LOOPERL          TO END  EDIT                         34440002
         B     LPRTN                                                    34510002
AREASTNS LA    R5,AREASTA-L4                                            34580002
         LA    R6,AREASTAL                                              34650002
         B     LPRTN                                                    34720002
REGULAR  CLI   L7(R2),HEX70        TEST CODE 70                         34790002
         BL    REGULAR1            BN                                   34860002
         LA    R5,SPECERR-L4       SET PTRS                             34930002
         LA    R6,SPECERRL         TO SPECIAL                           35000002
         B     LPRTN                                                    35070002
REGULAR1 SR    R7,R7                                                    35140002
         IC    R7,L7(R2)           PICK UP CODE                         35210002
         SRL   R7,L4               DROP OFF LOW BITS                    35280002
         CH    R7,H5                                                    35350002
         BH    REG6                DETERINE                             35420002
         BE    REG5                                                     35490002
         CH    R7,H3               ENTRY                                35560002
         BH    REG4                                                     35630002
         BE    REG3                TYPE                                 35700002
         CH    R7,H1                                                    35770002
         BH    REG2                                                     35840002
         BE    REG1                                                     35910002
REG0     LA    R5,DISKADPT-L4                                           35980002
         LA    R6,DISKLB                                                36050002
         B     LPRTN                                                    36120002
REG1     LA    R5,D2790ADP-L4                                           36190002
         LA    R6,D2790L                                                36260002
         B     LPRTN                                                    36330002
REG2     LA    R5,MPXADPT-L4                                            36400002
         LA    R6,MPXADPL                                               36470002
         B     LPRTN                                                    36540002
REG3     LA    R5,ADPT2740-L4                                           36610002
         LA    R6,ADP2740L                                              36680002
         B     LPRTN                                                    36750002
REG4     LA    R5,BSCADPT-L4                                            36820002
         LA    R6,BSCADPL                                               36890002
         B     LPRTN                                                    36960002
REG5     EQU   *                                                        37030002
REG6     EQU   *                                                        37100002
         LA    R5,UKNO-4                                                37170002
         LA    R6,UKNOL                                                 37240002
         B     LPRTN                                                    37310002
         DROP  R15                                                      37380002
*                                                                       37450002
*                                                                       37520002
*                                                                       37590002
SETR2    ST    R2,SAVE2       SAVE R2                                   37660002
         LA    R2,ENTRIES-L11           LOAD TBL PTR - 1 ENTRY          37730002
         STM   R14,R12,L12(R13)                                         37800002
         L     R3,SAVE2                                                 37870002
         USING B2715,R3                                                 37940002
         IC    R7,TCUA             PICK                                 38010002
         SLL   R7,L8               UP                                   38080002
         IC    R7,TCUA+L1          CUA                                  38150002
         SLL   R7,L16                                                   38220002
         LA    R4,CUAFLD           SET PTR TO SAVE                      38290002
         BAL   R8,SETUP                                                 38360002
         IC    R7,TSID                                                  38430002
         SLL   R7,L8               PICK UP                              38500002
         IC    R7,TSID+L1          ID                                   38570002
         SLL   R7,L16                                                   38640002
         LA    R4,IDFLD                                                 38710002
         LA    R8,RETURN                                                38780002
SETUP    LA    R5,L4                                                    38850002
SETUP1   SR    R6,R6                                                    38920002
         SLDL  R6,L4                    MOVE 4 BITS                     38990002
         LA    R2,CHARS(R6)             INDEX CHAR                      39060002
         MVC   L0(L1,R4),L0(R2)         MOVE IT TO FLO                  39130002
         LA    R4,L1(R4)                BUMP PTR                        39200002
         BCT   R5,SETUP1                LOOP                            39270002
         BR    R8                                                       39340002
*                                                                       39410002
*                                                                       39480002
*                                                                       39550002
RESETR2  L     R2,SAVE2            RESET R2                             39620002
         STM   R14,R12,L12(R13)                                         39690002
         SH    R2,H2                                                    39760002
         MVC   SIZE(L2),L0(R2)     SET UP SIZE OF REC FROM REC BUFF     39830002
         XC    SWITCH(L1),SWITCH       CLEAR SWITCH                     39900002
         B     RETURN                                                   39970002
*                                                                       40040002
*                                                                       40110002
*        GATHER DATA RECORDS AND PUT INTO TABLE                         40180002
*               TABLE ENTRY  42 MAY ENTRIES                             40250002
*             ********************************************************* 40320002
*             * DAY * DAY * DAY * TME * TME * TME * TME * 4 BYTES DATA* 40390002
*             ********************************************************* 40460002
*                                                                       40530002
SETTABLE STM   R14,R12,L12(R13)         SAVE INPUT REGS                 40600002
         LR    R5,R2                    SET REC PTR TO SIZE OF INPUT    40670002
         SH    R5,H2                    BY BACKING OFF 2 BYTES          40740002
         LH    R5,L0(R5)                PICK UP RECORD SIZE             40810002
         SH    R5,H26                   DEC BY NUMBER OF HDR BYTES      40880002
         SR    R4,R4                                                    40950002
         D     R4,F35                   DIVIDE TO GET NUMBER OF 35BYTE  41020002
*                                       ENTRIES IN R5                   41090002
         LA    R4,L28(R2)               SET R4 TO ERROR ENTRIES         41160002
         LA    R6,ENTRIES               SET R6 TO TABLE                 41230002
         MVI   L0(R6),HEXFF             SET ENTRIES AREA TO FFFF        41300002
         MVC   L1(L249,R6),L0(R6)                                       41370002
         MVC   L250(L214,R6),L0(R6)                                     41440002
*                                                                       41510002
         LTR   R5,R5                    DONE                            41580002
         BZ    RETURN                   BR IF ZERO                      41650002
SETTBL01 MVC   DAYTIME(L7),L0(R4)       SET UP DAYTIME                  41720002
         LA    R4,L7(R4)                BUMP OVER DAY TIME              41790002
         LA    R8,L7                    SET ERROR COUNT                 41860002
*                                                                       41930002
*                                                                       42000002
SETTBL02 CLC   L0(L4,R4),CHARFF         IS ENTRY DUMMY                  42070002
         BE    SETTBL03                 BR-YES                          42140002
         CLC   L0(L4,R4),CHAR00         DUMMY ENTRY                     42210002
         BE    SETTBL03                 BR YES                          42280002
         MVC   L0(L7,R6),DAYTIME        SET UP ENTRY DAY-TIME           42350002
         MVC   L7(L4,R6),L0(R4)                      4 BYTE ENTRY       42420002
         LA    R6,L11(R6)               BUMP                            42490002
SETTBL03 LA    R4,L4(R4)                    PTRS                        42560002
         BCT   R8,SETTBL02              LOOP 7 TIMES                    42630002
*                                                                       42700002
*                                                                       42770002
         BCT   R5,SETTBL01              LOOP TILL ALL 42 ENTRIES DONE   42840002
*              TABLE NOW TO BE  SORTED                                  42910002
*              R6=PTR TO LAST ENTRY+11 PTRB                             42980002
         LA    R4,ENTRIES-L11           SET PTR A                       43050002
*                                                                       43120002
SORTTBL1 LA    R4,L11(R4)               UP PTRA BY 11                   43190002
         LA    R5,L11(R4)               UP PTRC TO PTR A+11             43260002
         CR    R4,R6                    IS PTRA=PTRB(R6)                43330002
         BE    RETURN                   YES SORT DONE                   43400002
SORTTBL2 CLC   L7(L1,R4),L7(R5)         COMPARE ENTRIES  *  DDDTTTTID   43470002
         BL    SORTTBL3                 NO SWAP NEEDED                  43540002
         BH    SWAP                     SWAP DATES & DATA               43610002
         CLC   L0(L7,R4),L0(R5)         TEST DATES ON EQUAL RECS        43680002
         BNH   SORTTBL3                 NO NEED TO SWAP                 43750002
SWAP     EQU   *                                                        43820002
         XC    L0(L11,R4),L0(R5)                                        43890002
         XC    L0(L11,R5),L0(R4)        SWAP ENTRIES                    43960002
         XC    L0(L11,R4),L0(R5)                                        44030002
SORTTBL3 LA    R5,L11(R5)               BUMP PTR TO NXT ENTRY           44100002
         CR    R5,R6                    THIS PASS DONE                  44170002
         BL    SORTTBL2                 BR-NO                           44240002
         B     SORTTBL1                 BR-YES                          44310002
*                                                                       44380002
*                                                                       44450002
RETURN   LM    R14,R12,L12(R13)                                         44520002
SKIPPER  BR    R14                                                      44590002
*                                                                       44660002
*                                                                       44730002
SETHEAD  STM   R14,R12,L12(R13)                                         44800002
         MVC   L30(L30,R3),HDR               MOVE PRESET HDR            44870002
         MVC   L64(L3,R3),DAY                MOVE DAY LABEL             44940002
         MVC   L79(L4,R3),TIMES                   TIME LBEL             45010002
         MVC   L70(L3,R3),L0(R4)             MOVE DAY VALUE             45080002
         MVC   L85(L2,R3),L3(R4)             MOVE HRS                   45150002
         MVI   L87(R3),DOT                   MOVE OUT                   45220002
         MVC   L88(L2,R3),L5(R4)             MOVE MIN VALUE             45290002
         B     RETURN                                                   45360002
*                                                                       45430002
SETLBLS  STM   R14,R12,L12(R13)              SAVE REGS                  45500002
         SR    R5,R5                                                    45570002
         IC    R5,L0(R4)                     PICK UP CODE               45640002
         SLL   R5,L28                        DROP OFF HI-ORDER 7        45710002
         SRL   R5,L26                        MUNT LOW ORDER BY 4        45780002
         L     R5,ADCONS(R5)                 PICK UP LABEL ADCON        45850002
         ST    R5,LABELPTR                                              45920002
         B     RETURN                                                   45990002
ADCONS   DC    A(LBL70)                                                 46060002
         DC    A(LBL71)                                                 46130002
         DC    A(LBL72)                                                 46200002
         DC    A(LBL73)                                                 46270002
         DC    A(LBL74)                                                 46340002
         DC    A(LBL75)                                                 46410002
         DC    A(LBL76)                                                 46411002
         DC    A(LBL77)                                                 46412002
         DC    A(LBL78)                                                 46413002
         DC    A(LBL79)                                                 46414002
         DC    A(LBL7A)                                                 46415002
         DC    A(LBL7B)                                                 46416002
         DC    A(LBL7C)                                                 46417002
         DC    A(LBL7D)                                                 46418002
         DC    A(LBL7E)                                                 46419002
         DC    A(LBL7F)                                                 46420002
SETHEX   STM   R14,R12,L12(R13)         SAVE REGS                       46480002
         LA    R6,L2                    NUMB OF CHAR                    46550002
SETHEX1  IC    R5,L0(R4)                PICK UP CHAR                    46620002
         SLL   R5,L24                   PUT IN HI POS OF R5             46690002
SETHEX2  SR    R4,R4                    CLEAR 4                         46760002
         SLDL  R4,L4                    SHIFT 4 BITS                    46830002
         LA    R7,CHARS(R4)             SET PTR TO CHAR REP BY 4 BITS   46900002
         MVC   L0(L1,R3),L0(R7)         MOVE CHAR TO PRINT LINE         46970002
         LA    R3,L1(R3)                BUMP PRNT PTR                   47040002
         BCT   R6,SETHEX2               LOOP                            47110002
         B     RETURN                                                   47180002
SETHEXL  STM   R14,R12,L12(R13)                                         47250002
         LA    R6,L1                    NUMB OF CHAR                    47320002
         B     SETHEX1                  BR                              47390002
SETHEXR  STM   R14,R12,L12(R13)                                         47460002
         LA    R6,L1                    NUMB OF CHAR                    47530002
         IC    R5,L0(R4)                PICK UP BYTE                    47600002
         SLL   R5,L28                   SHIFT TO LOW 4 BITS             47670002
         B     SETHEX2                                                  47740002
*                                                                       47810002
SETSW    EQU   *                                                        47880002
         MVI   SWITCH,HEXFF                                             47950002
         BR    R14                                                      48020002
*                                                                       48090002
*                                                                       48160002
SETDOT0  STM   R14,R12,L12(R13)                                         48230002
SETDOTA  LA    R4,L7(R3)                                                48300002
SETDOT1  LA    R5,L12                                                   48370002
SETDOT2  MVI   L0(R4),DOT                                               48440002
         LA    R4,L10(R4)                                               48510002
         BCT   R5,SETDOT2                                               48580002
         B     RETURN                                                   48650002
*                                                                       48720002
*                                                                       48790002
*                                                                       48860002
TESTSW   STM   R14,R12,L12(R13)                                         48930002
         CLI   L7(R4),HEXF0        IS IT SPEC AS                        49000002
         BE    TESTSW1             YES                                  49070002
         CLI   L7(R4),HEXF1        IS IT SPEC AS                        49140002
         BE    TESTSW1             YES                                  49210002
         SR    R5,R5                                                    49280002
         IC    R5,L9(R4)           PICK UP CODE                         49350002
         SRL   R5,L4               DROP OFF LOW 4 BITS                  49420002
         CH    R5,H10              GTR THAN 10                          49490002
         BNH   TESTSW2             BR-NO                                49560002
TESTSW1  LA    R5,L10              SET TO 10                            49630002
TESTSW2  MH    R5,H10              MULT BY 10 TO GIVE BUFF OFFSET       49700002
         LA    R6,L1(R3)           COL START                            49770002
         AR    R6,R5               COMPUTE ADDR                         49840002
         MVC   L0(L3,R6),L0(R4)    MOVE                                 49910002
         MVC   L4(L2,R6),L3(R4)    IN                                   49980002
         MVI   L6(R6),DOT          DAY &                                50050002
         MVC   L7(L2,R6),L5(R4)    TIME                                 50120002
         LR    R4,R3                    SET UP  FOR DOTS                50190002
         B     SETDOT1                                                  50260002
*                                                                       50330002
*                                                                       50400002
SETDOTS  STM   R14,R12,L12(R13)                                         50470002
         CLI   L0(R4),HEXF0             IS IT SPECIAL                   50540002
         BE    SETDOTSA                 YES                             50610002
         CLI   L0(R4),HEXF1        IS IT SPECIAL                        50680002
         BE    SETDOTSA                 YES                             50750002
         SR    R5,R5                    CLEAR REG                       50820002
         IC    R5,L2(R4)                PICK UP CODE                    50890002
         SRL   R5,L4                    DROP OFF LOW 4                  50960002
         CH    R5,H10                   IS IT 10                        51030002
         BNH   SETDOTSB                 BR NOT HI                       51100002
SETDOTSA LA    R5,L10                   SET TO 10                       51170002
SETDOTSB SLL   R5,L2                    MULTI X 4                       51240002
         B     TABLE(R5)                B TO TABLE                      51310002
TABLE    B     AS0                                                      51380002
         B     AS1                                                      51450002
         B     AS2                                                      51520002
         B     AS3                                                      51590002
         B     AS4                                                      51660002
         B     AS5                                                      51730002
         B     AS6                                                      51800002
         B     AS7                                                      51870002
         B     AS8                                                      51940002
         B     AS9                                                      52010002
         B     ASA                                                      52080002
AS0      EQU   *                                                        52150002
AS1      EQU   *                                                        52220002
AS8      EQU   *                                                        52290002
         LA    R8,L2          SET INDICATOR                             52360002
         B     ASALL                                                    52430002
AS2      EQU   *                                                        52500002
AS3      EQU   *                                                        52570002
AS4      EQU   *                                                        52640002
AS5      EQU   *                                                        52710002
AS9      EQU   *                                                        52780002
         LA    R8,L3               SET INO                              52850002
         B     ASALL                                                    52920002
AS6      EQU   *                                                        52990002
AS7      EQU   *                                                        53060002
         SR    R8,R8               SET IND                              53130002
         B     ASALL                                                    53200002
ASA      EQU   *                                                        53270002
         LA    R8,L4                                                    53340002
         IC    R7,L2(R4)           PICK UP NXT                          53410002
         SLL   R7,L8               SHIFT                                53480002
         IC    R7,L3(R4)           PICK UP NXT                          53550002
         SLL   R7,L16                                                   53620002
         B     ASALL1                                                   53690002
ASALL    IC    R7,L2(R4)           PICK UP CHAR                         53760002
         SLL   R7,L8               SHIFT                                53830002
         IC    R7,L3(R4)           PICK UP NXT                          53900002
         SLL   R7,L20              SHIFT TO HI                          53970002
ASALL1   SRL   R5,L2                    DIVIDE BY 4                     54040002
         MH    R5,H10              COMPUTER OFFSET                      54110002
         LA    R4,L9(R3)           COL START                            54180002
         AR    R4,R5                                                    54250002
         LTR   R8,R8               IS CODE 0                            54320002
         BZ    NOTAPP              BR-YES                               54390002
         CH    R8,H3               TEST ENTRY                           54460002
         BE    ASALL3                                                   54530002
         BH    ASALL4                                                   54600002
         LA    R4,L4(R4)           BUMP PTR                             54670002
         B     ASALL2                                                   54740002
ASALL3   SR    R6,R6                                                    54810002
         SLDL  R6,L4               BRING 4 BITS TO 6                    54880002
         LA    R2,CHARS(R6)        INDEX CHAR                           54950002
         MVC   L0(L1,R4),L0(R2)    MOVE TO LINE                         55020002
         LA    R4,L4(R4)                                                55090002
ASALL2   SR    R6,R6                                                    55160002
         SLDL  R6,L4               MOVE NXT 4 BITS                      55230002
         LA    R2,CHARS(R6)        INDEX CHAR                           55300002
         MVC   L0(L1,R4),L0(R2)                                         55370002
         SR    R6,R6                                                    55440002
         SLDL  R6,L4                                                    55510002
         LA    R2,CHARS(R6)                                             55580002
         MVC   L1(L1,R4),L0(R2)                                         55650002
         B     SETDOTA                                                  55720002
ASALL4   LA    R5,L2                    LOOP COUNTER                    55790002
ASALL4A  SR    R6,R6                                                    55860002
         SLDL  R6,L4                                                    55930002
         LA    R2,CHARS(R6)                                             56000002
         MVC   L0(L1,R4),L0(R2)                                         56070002
         SR    R6,R6                                                    56140002
         SLDL  R6,L4                                                    56210002
         LA    R2,CHARS(R6)                                             56280002
         MVC   L1(L1,R4),L0(R2)                                         56350002
         LA    R4,L3(R4)                BUMP POINTER                    56420002
         BCT   R5,ASALL4A                                               56490002
         B     SETDOTA                                                  56560002
NOTAPP   BCTR  R4,R0                                                    56630002
         MVC   L0(L9,R4),NOTAPPLY                                       56700002
         B     SETDOTA                                                  56770002
*                                                                       56840002
*                                                                       56910002
*        EQUATES                                                        56980002
*                                                                       57050002
L0       EQU   0                                                        57120002
L1       EQU   1                                                        57190002
L2       EQU   2                                                        57260002
L3       EQU   3                                                        57330002
L4       EQU   4                                                        57400002
L5       EQU   5                                                        57470002
L6       EQU   6                                                        57540002
L7       EQU   7                                                        57610002
L8       EQU   8                                                        57680002
L9       EQU   9                                                        57750002
L10      EQU   10                                                       57820002
L11      EQU   11                                                       57890002
L12      EQU   12                                                       57960002
L16      EQU   16                                                       58030002
L20      EQU   20                                                       58100002
L24      EQU   24                                                       58170002
L26      EQU   26                                                       58240002
L28      EQU   28                                                       58310002
L30      EQU   30                                                       58380002
L64      EQU   64                                                       58450002
L70      EQU   70                                                       58520002
L79      EQU   79                                                       58590002
L85      EQU   85                                                       58660002
L87      EQU   87                                                       58730002
L88      EQU   88                                                       58800002
L214     EQU   214                                                      58870002
L249     EQU   249                                                      58940002
L250     EQU   250                                                      59010002
*                                                                       59080002
DOT      EQU   C'.'                                                     59150002
HEX70    EQU   X'70'                                                    59220002
HEX80    EQU   X'80'                                                    59290002
HEXF0    EQU   X'F0'                                                    59360002
HEXF1    EQU   X'F1'                                                    59430002
HEXFF    EQU   X'FF'                                                    59500002
*                                                                       59570002
SAVE2    DS    F                                                        59640002
XSAVE    DS    2D                                                       59710002
WORK     DS    1D                                                       59780002
NONE     DC    CL4'NONE'                                                59850002
F35      DC    F'35'                                                    59920002
H1       DC    H'1'                                                     59990002
H2       DC    H'2'                                                     60060002
H3       DC    H'3'                                                     60130002
H5       DC    H'5'                                                     60200002
H10      DC    H'10'                                                    60270002
H11      DC    H'11'                                                    60340002
H26      DC    H'26'                                                    60410002
H35      DC    H'35'                                                    60480002
DAYTIME  DC    CL7' '                                                   60550002
SWITCH   DC    C' '                                                     60620002
CHARFF   DC    X'FFFFFFFFFFFF'                                          60690002
CHAR00   DC    XL4'00'                                                  60760002
DAY      DC    CL3'DAY'                                                 60830002
TIMES    DC    CL4'TIME'                                                60900002
NOTAPPLY DC    C'NOT APPLY'                                             60970002
*                                                                       61040002
RELTAB   DS    0C                                              @L03976  61110002
         DC    C'OS  '                                         @L03976  61150002
           DC    C'DOS '                                       @L03976  61190002
         DC    C'VS 1'                                         @L03976  61230002
         DC    C'V370'                                         @L03976  61270002
         DC    C'VS 2'                                         @L03976  61310002
         DC    C'    '                                         @L03976  61350002
         DC    C'    '                                         @L03976  61390002
         DC    C'    '                                         @L03976  61430002
XLABELP  EQU   LABELPTR                                                 61530002
R0       EQU   0                                                        61600002
R1       EQU   1                                                        61670002
R2       EQU   2                                                        61740002
R3       EQU   3                                                        61810002
R4       EQU   4                                                        61880002
R5       EQU   5                                                        61950002
R6       EQU   6                                                        62020002
R7       EQU   7                                                        62090002
R8       EQU   8                                                        62160002
R9       EQU   9                                                        62230002
R10      EQU   10                                                       62300002
R11      EQU   11                                                       62370002
R12      EQU   12                                                       62440002
R13      EQU   13                                                       62510002
R14      EQU   14                                                       62580002
R15      EQU   15                                                       62650002
*                                                                       62720002
LBL73    DC    C'ERROR CODE -*AREA STATION DIAGNOSTICS WERE REQUESTED$' 62790002
         DC    C'AREA STATION ADDRESS$'                                 62860002
LBL70    DC    C'ERROR CODE -*ERROR COUNTERS WERE SET TO ZERO$'         62930002
         DC    CL40' '                                                  63000002
         DC    C'$'                                                     63070002
LBL71    DC    C'ERROR CODE -*'                                         63140002
         DC    C'ERROR COUNTER THRESHOLD WAS REACHED$'                  63210002
         DC    C'AREA STATION ADDRESS$'                                 63280002
LBL72    DC    C'ERROR CODE -*'                                         63350002
         DC    C'ERROR SCAN WAS REQUESTED$'                             63420002
         DC    C'AREA STATION ADDRESS$'                                 63490002
LBL74    DC    C'ERROR CODE -*'                                         63560002
         DC    C'AREA STATION EXERCISOR WAS REQUESTED$'                 63630002
         DC    C'AREA STATION ADDRESS$'                                 63700002
LBL75    DC    C'ERROR CODE -*'                                         63770002
         DC    C'BSC ONLINE TEST WAS REQUESTED$'                        63840002
         DC    C'ROUTINE NUMBER$'                                       63910002
LBL78    DC    C'ERROR CODE -*RECORD LENGTH CHECK ERROR$'               63911002
         DC    CL40' '                                                  63912002
         DC    C'$'                                                     63913002
LBL79    DC    C'ERROR CODE -*VALID CHARACTER CHECK ERROR$'             63914002
         DC    CL40' '                                                  63915002
         DC    C'$'                                                     63916002
LBL7A    DC    C'ERROR CODE -*INVALID TRANSACTION REQUEST$'             63917002
         DC    CL40' '                                                  63918002
         DC    C'$'                                                     63919002
LBL76    EQU   *                                                        63920002
LBL77    EQU   *                                                        63921002
LBL7B    EQU   *                                                        63922002
LBL7C    EQU   *                                                        63923002
LBL7D    EQU   *                                                        63924002
LBL7E    EQU   *                                                        63925002
LBL7F    EQU   *                                                        63926002
         DC    C'ERROR CODE -*UNSUPPORTED SPECIAL ERROR CODE$'          63927002
         DC    CL40' '                                                  63928002
         DC    C'$'                                                     63929002
CHARS    DC    C'0123456789ABCDEF'                                      63980002
HDR      DS    0CL30                                                    64050002
         DC    CL5'CUA'                                                 64120002
CUAFLD   DC    CL10' '                                                  64190002
         DC    CL10'2715 ID'                                            64260002
IDFLD    DC    CL5' '                                                   64330002
ENTRIES  DS    CL464                                                    64400002
         DC    11X'FF'                                                  64470002
         EJECT                                                          64540002
*        EDIT  ENTRIES                                                  64610002
*                                                                       64680002
EDIT     DS    0F                                                       64750002
         DC    XL4'00'                                                  64820002
         DC    XL4'00'                                                  64890002
         DC    A(LABELS)                                                64960002
         DC    XL2'00'                                                  65030002
*                                                                       65100002
*                                                                       65170002
*                                                                       65240002
         DC    X'01'                                                    65310002
         DC    X'000B8B00'         SKIP TO CHANNEL 1                    65380002
         LABEL ' '                                                      65450002
*                                                                       65520002
         LINE       (1,1),(1,1),SKIP=2                                  65590002
         ROUTINE    KEY,SKIPPER                                         65660002
         LABEL      '2715 ERROR LOG DATA EDITING AND PRINTING SECTION'  65730002
         LINE                                                           65800002
         ROUTINE    KEY,SKIPPER                                         65870002
         LABEL      'MODEL-UNIVERSAL'                                   65940002
         LINE  (10,)                                                    66010002
         ROUTINE    XRELN,CONVREL                                       66080002
         LABEL      'XXXX REL.'                                         66150002
         LINE  (1,1)                                                    66220002
         ROUTINE    KEY,SKIPPER                                         66290002
*                                                                XM0793 66360002
         LABEL '---RECORD ENTRY SOURCE -MDR-           TYPE- TELEPROCESS66400002
               SING'                                             XM0793 66440002
         LINE       ,,SKIP=1                                            66500002
         ROUTINE    KEY,SKIPPER                                         66570002
         LABEL      'XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX*66640002
               XX'                                                      66710002
*                                                                       66780002
         LINE                                                           66850002
         ROUTINE    KEY,SETTABLE                                        66920002
         ROUTINE    KEY,SETR2                                           66990002
         LABEL      ' '                                                 67060002
&DSECT   SETC  'B2715E'                                                 67130002
*                                                                       67200002
         LINE                                                           67270002
LOOPERST EQU   *                                                        67340002
         ROUTINE    B0BIT0,LOOPER                                       67410002
LOOPERL  LABEL      ' '                                                 67480002
         LINE                                                           67550002
         ROUTINE    B0BIT0,RESETR2                                      67620002
         LABEL      ' '                                                 67690002
         DC    X'FF'                                                    67760002
SIZE     DC    XL2'00'                                                  67830002
         DC    XL2'0018'                                                67900002
         DC    XL2'00'                                                  67970002
*                                                                       68040002
*                                                                       68110002
         EJECT                                                          68180002
*                                                                       68250002
*                        UKNOWN CODE                                    68320002
UKNOL    LABEL ' '                                                      68390002
UKNO     EQU   *                                                        68460002
         LINE       (1,1),(1,1)                                         68530002
         ROUTINE    BTIMES,SETHEAD                                      68600002
         LABEL      'UKNOWN ERROR CODE'                                 68670002
*                                                                       68740002
         LINE                                                           68810002
         ROUTINE    BTIMES,SKIPPER                                      68880002
         LABEL      ''                                                  68950002
         LINE       (30,4),(1,1),SKIP=1                                 69020002
         ROUTINE    B0BIT0,SETHEX                                       69090002
         ROUTINE    B1BIT0,SETHEX                                       69160002
         ROUTINE    B2BIT0,SETHEX                                       69230002
         ROUTINE    B3BIT0,SETHEX                                       69300002
         LABEL      'ERROR ENTRY'                                       69370002
*                                                                       69440002
         LINE                                                           69510002
         ROUTINE    BTIMES,LOOPER                                       69580002
         LABEL      ' '                                                 69650002
         EJECT                                                          69720002
         LINE      (20,20),(20,20),SKIP=3                               69790002
*                                                                       69860002
*              BSC ADAPTER                                              69930002
BSCADPL  LABEL ' '                                                      70000002
BSCADPT  EQU   *                                                        70070002
         LINE       (1,1),(1,1),SKIP=1                                  70140002
         ROUTINE    BTIMES,SETHEAD                                      70210002
         LABEL      'BSC ADAPTER ERROR LOG'                             70280002
*                                                                       70350002
         LINE                                                           70420002
         ROUTINE    BTIMES,SKIPPER                                      70490002
         LABEL      ''                                                  70560002
         LINE       (33,35),(5,35),SKIP=1                               70630002
         ROUTINE    B0BIT0,SKIPPER                                      70700002
         LABEL      'MODE OF OPERATION','BSC STATUS','BSC ADAPTER STATU*70770002
               S'                                                       70840002
*                                                                       70910002
         LINE       ,(7,35)                                             70980002
         BIN        B0BIT5                                              71050002
         BIN        B1BIT0                                              71120002
         BIN        B3BIT0                                              71190002
         LABEL      'INITIALIZATION','LOST OPERATIONAL COND','DATA SET *71260002
               READY OFF'                                               71330002
*                                                                       71400002
         LINE                                                           71470002
         BIN        B0BIT6                                              71540002
         BIN        B1BIT3                                              71610002
         BIN        B3BIT1                                              71680002
         LABEL      'TRANSMIT TEXT','TEXT TIMEOUT','CLEAR TO SEND OFF'  71750002
*                                                                       71820002
         LINE                                                           71890002
         BIN        B0BIT7                                              71960002
         BIN        B1BIT4                                              72030002
         BIN        B3BIT2                                              72100002
         LABEL      'RECEIVE TEXT','N - RETRYS','OVERRUN'               72170002
*                                                                       72240002
         LINE                                                           72310002
         ROUTINE    B0BIT0,SKIPPER                                      72380002
         BIN        B1BIT5                                              72450002
         BIN        B3BIT3                                              72520002
         LABEL      ' ','INVALID CHARACTER','LOST BIT SERVICE'          72590002
*                                                                       72660002
         LINE       ,(5,35)                                             72730002
         ROUTINE    B0BIT0,SKIPPER                                      72800002
         BIN        B1BIT6                                              72870002
         BIN        B3BIT4                                              72940002
         LABEL      'HARDWARE ERROR','  DATA CHECK','  TRANSMIT'        73010002
*                                                                       73080002
         LINE       ,(7,35)                                             73150002
         BIN        B2BIT3                                              73220002
         BIN        B1BIT7                                              73290002
         BIN        B3BIT5                                              73360002
         LABEL      'XFER ADAPT WORD LATCH','RESPONSE TIMEOUT','DATA TE*73430002
               RMINAL READY'                                            73500002
*                                                                       73570002
         LINE       (33,70),(7,70)                                      73640002
         BIN        B2BIT4                                              73710002
         BIN        B3BIT6                                              73780002
         LABEL      'BSC CHARACTER OVERRUN','REQUEST TO SEND'           73850002
*                                                                       73920002
         LINE                                                           73990002
         BIN        B2BIT5                                              74060002
         BIN        B3BIT7                                              74130002
         LABEL      'ADAPTER IN PARITY ERROR','DATA CARRIER OFF'        74200002
*                                                                       74270002
         LINE                                                           74340002
         BIN        B2BIT6                                              74410002
         LABEL      'CSBO PARITY ERROR'                                 74480002
*                                                                       74550002
         LINE                                                           74620002
         ROUTINE    BTIMES,LOOPER                                       74690002
         LABEL      ' '                                                 74760002
         EJECT                                                          74830002
         LINE      (20,20),(20,20),SKIP=3                               74900002
*                                                                       74970002
*                                                                       75040002
*              2740 ADPTER ERROR LOG                                    75110002
ADP2740L LABEL ' '                                                      75180002
ADPT2740 EQU   *                                                        75250002
         LINE       (1,1),(1,1),SKIP=1                                  75320002
         ROUTINE    BTIMES,SETHEAD                                      75390002
         LABEL      '2740 ADAPTER ERROR LOG'                            75460002
*                                                                       75530002
         LINE                                                           75600002
         ROUTINE    BTIMES,SKIPPER                                      75670002
         LABEL      ''                                                  75740002
         LINE       (32,36),(5,35),SKIP=1                               75810002
         ROUTINE    B1BIT0,SETHEX                                       75880002
         LABEL      'ROUTINE CODE','HARDWARE ERROR'                     75950002
*                                                                       76020002
         LINE       ,(5,37)                                             76090002
         ROUTINE    B0BIT0,SKIPPER                                      76160002
         BIN        B2BIT3                                              76230002
         LABEL      ' ','KEYBOARD BIT OVERRUN'                          76300002
*                                                                       76370002
         LINE                                                           76440002
         ROUTINE    B3BIT0,SETHEX                                       76510002
         BIN        B2BIT5                                              76580002
         LABEL      'PROGRAM ERROR CODE','ADAPTER INPUT PARITY ERR'     76650002
*                                                                       76720002
         LINE                                                           76790002
         ROUTINE    B0BIT0,SKIPPER                                      76860002
         BIN        B2BIT6                                              76930002
         LABEL      ' ','CSBO PARITY ERROR'                             77000002
*                                                                       77070002
         LINE                                                           77140002
         ROUTINE    BTIMES,LOOPER                                       77210002
         LABEL      ' '                                                 77280002
*                                                                       77350002
         EJECT                                                          77420002
         LINE      (20,20),(20,20),SKIP=3                               77490002
*                                                                       77560002
*               MPX ADAPTER ERROR  LOG                                  77630002
MPXADPL  LABEL ' '                                                      77700002
MPXADPT  EQU   *                                                        77770002
         LINE       (1,1),(1,1),SKIP=1                                  77840002
         ROUTINE    BTIMES,SETHEAD                                      77910002
         LABEL      'MPX ADAPTER ERROR LOG'                             77980002
*                                                                       78050002
         LINE                                                           78120002
         ROUTINE    BTIMES,SKIPPER                                      78190002
         LABEL      ''                                                  78260002
         LINE       ,(5,36),SKIP=1                                      78330002
         ROUTINE    B3BIT0,SKIPPER                                      78400002
         LABEL      'ERROR STATUS'                                      78470002
*                                                                       78540002
         LINE       (33,1),(7,1)                                        78610002
         BIN        B3BIT0                                              78680002
         LABEL      'PROGRAM CHECK'                                     78750002
*                                                                       78820002
         LINE                                                           78890002
         BIN        B3BIT2                                              78960002
         LABEL      'I/O BUS OUT CHECK'                                 79030002
*                                                                       79100002
         LINE                                                           79170002
         BIN        B3BIT3                                              79240002
         LABEL      'EQUIPTMENT CHECK'                                  79310002
*                                                                       79380002
         LINE                                                           79450002
         BIN        B3BIT5                                              79520002
         LABEL      'XFER CHECK'                                        79590002
*                                                                       79660002
         LINE                                                           79730002
         BIN        B3BIT7                                              79800002
         LABEL      'I/O BUS IN CHECK'                                  79870002
*                                                                       79940002
         LINE                                                           80010002
         ROUTINE    BTIMES,LOOPER                                       80080002
         LABEL      ' '                                                 80150002
*                                                                       80220002
         EJECT                                                          80290002
         LINE      (20,20),(20,20),SKIP=3                               80360002
*                                                                       80430002
*              DISK ADAPTER    CODE 00                                  80500002
DISKLB   LABEL ' '                                                      80570002
DISKADPT EQU   *                                                        80640002
         LINE       (1,1),(1,1),SKIP=1                                  80710002
         ROUTINE    BTIMES,SETHEAD                                      80780002
         LABEL      'DISK ADAPTER ERROR LOG'                            80850002
*                                                                       80920002
         LINE                                                           80990002
         ROUTINE    BTIMES,SKIPPER                                      81060002
         LABEL      ''                                                  81130002
         LINE       (66,1),(5,36),SKIP=1                                81200002
         ROUTINE    B0BIT4,SETHEXR                                      81270002
         ROUTINE    B1BIT0,SETHEX                                       81340002
         LABEL      'ERROR STATUS','SECTOR ADDRESS'                     81410002
*                                                                       81480002
         LINE       (33,35),(7,1)                                       81550002
         BIN        B2BIT0                                              81620002
         LABEL      'READ CHECK'                                        81690002
*                                                                       81760002
         LINE                                                           81830002
         BIN        B2BIT1                                              81900002
         LABEL      'CSBI PTY ERROR-DATA'                               81970002
*                                                                       82040002
         LINE       ,(7,33)                                             82110002
         BIN        B2BIT2                                              82180002
         LABEL      'CSBI PTY ERROR-ADDR','READ/WRITE OP CODE STATUS'   82250002
*                                                                       82320002
         LINE       ,(7,35)                                             82390002
         BIN        B2BIT3                                              82460002
         BIN        B3BIT0                                              82530002
         LABEL      'DATA REG PARITY CK','READ LABEL'                   82600002
*                                                                       82670002
         LINE                                                           82740002
         BIN        B2BIT4                                              82810002
         BIN        B3BIT1                                              82880002
         LABEL      'ADDR REG PARITY','WRITE'                           82950002
*                                                                       83020002
         LINE                                                           83090002
         BIN        B2BIT5                                              83160002
         BIN        B3BIT2                                              83230002
         LABEL      'OVERRUN','READ CHECK'                              83300002
*                                                                       83370002
         LINE                                                           83440002
         BIN        B2BIT6                                              83510002
         BIN        B3BIT3                                              83580002
         LABEL      'WRITE SELECT CHECK','READ'                         83650002
*                                                                       83720002
         LINE                                                           83790002
         BIN        B2BIT7                                              83860002
         LABEL      'MODULO 4/LENGTH CK'                                83930002
*                                                                       84000002
*                                                                       84070002
*                                                                       84140002
         LINE                                                           84210002
         ROUTINE    BTIMES,LOOPER                                       84280002
         LABEL      ' '                                                 84350002
*                                                                       84420002
         EJECT                                                          84490002
         LINE      (20,20),(20,20),SKIP=3                               84560002
*                                                                       84630002
*                                                                       84700002
*                                                                       84770002
*              SPECIAL                                                  84840002
SPECERRL LABEL ' '                                                      84910002
SPECERR  EQU   *                                                        84980002
         LINE       (1,1),(1,1),SKIP=2                                  85050002
         ROUTINE    BTIMES,SETHEAD                                      85120002
         LABEL      'SPECIAL ERROR LOG'                                 85190002
*                                                                       85260002
         LINE       (18,13),(5,35)                                      85330002
         ROUTINE    B0BIT0,SETHEX                                       85400002
         ROUTINE    B0BIT0,SETLBLS                                      85470002
         LABEL      ' '                                                 85540002
*                                                                       85610002
         LINE                                                           85680002
         ROUTINE    B0BIT0,SKIPPER                                      85750002
         ROUTINE    B1BIT0,SETHEX                                       85820002
         LABEL      ' '                                                 85890002
*                                                                       85960002
         LINE                                                           86030002
         ROUTINE    BTIMES,LOOPER                                       86100002
         LABEL      ' '                                                 86170002
*                                                                       86240002
         EJECT                                                          86310002
         LINE      (20,20),(20,20),SKIP=3                               86380002
*                                                                       86450002
*              AREA STATION  HEADER                                     86520002
AREASTLB LABEL ' '                                                      86590002
AREASTHD EQU   *                                                        86660002
         LINE       (1,1),(1,1),SKIP=1                                  86730002
         ROUTINE    BTIMES,SETHEAD                                      86800002
         LABEL      'AREA STATION ERROR LOG'                            86870002
*                                                                       86940002
         LINE                                                           87010002
         ROUTINE    BTIMES,SKIPPER                                      87080002
         LABEL      ''                                                  87150002
         LINE       ,(4,1)                                              87220002
         ROUTINE    B0BIT0,SKIPPER                                      87290002
         LABEL      'ALL ERROR ENTRIES ARE TWO LINES. DAY AND TIME ON 1*87360002
               ST LINE AND ERROR DATA, WHERE APPLICABLE, ON 2ND LINE.'  87430002
*                                                                       87500002
         LINE       ,(1,1),SKIP=1                                       87570002
         ROUTINE    B0BIT0,SKIPPER                                      87640002
         LABEL      'ERROR TYPE-(0)-------(1)-------(2)-------(3)------*87710002
               -(4)-------(5)-------(6)-------(7)-------(8)-------(9)--*87780002
               --(SPECIAL)-'                                            87850002
*                                                                       87920002
         LINE                                                           87990002
         ROUTINE    B0BIT0,SKIPPER                                      88060002
         LABEL      'XMITD  .AREA STA.. DEVICE  . INVALID .CHANGE IN.CH*88130002
               ANGE IN.END REQST. RECEIVE .  NULL   . RECORD  .  VALID *88200002
                .REC.ADDR .'                                            88270002
*                                                                       88340002
         LINE                                                           88410002
         ROUTINE    B0BIT0,SKIPPER                                      88480002
         LABEL      'ADDR.  . ADDRESS . ADDRESS .AREA STA..DATA BYTE. S*88550002
               TATUS  . STATUS  .  DATA   .ACKNWLOG . LGTH CK .CHARACTE*88620002
               R.         .'                                            88690002
*                                                                       88760002
         LINE                                                           88830002
         ROUTINE    B0BIT0,SKIPPER                                      88900002
         LABEL      '       .  ERROR  .  ERROR  . RESPONSE.         .  *88970002
               BYTE   .  ERROR  . OVERRUN . OVERRUN .  ERROR  . CK ERRO*89040002
               R. AS DEV  .'                                            89110002
*                                                                       89180002
         LINE                                                           89250002
         ROUTINE    B0BIT0,SKIPPER                                      89320002
         LABEL      'AS DEV .  -----  .  -----  .  -----  .  -----  .  *89390002
               -----  .  -----  .  -----  .  -----  .  -----  .  ----- *89460002
                .  -----  .'                                            89530002
*                                                                       89600002
         LINE                                                           89670002
         ROUTINE    B0BIT0,SETSW                                        89740002
         LABEL      '       .         .         .         .         .  *89810002
                      .         .         .         .         .        *89880002
                .         .'                                            89950002
*                                                                       90020002
*                                                                       90090002
         EJECT                                                          90160002
*                                                                       90230002
*              AREA STATIONS                                            90300002
AREASTAL LABEL ' '                                                      90370002
AREASTA  EQU   *                                                        90440002
         LINE       (2,3),(1,1),SKIP=1                                  90510002
         ROUTINE    B0BIT0,SETHEX                                       90580002
         ROUTINE    B1BIT0,SETHEX                                       90650002
         ROUTINE    BTIMES,TESTSW                                       90720002
         LABEL      ''                                                  90790002
*                                                                       90860002
         LINE       (1,1),(1,1)                                         90930002
         ROUTINE    B0BIT0,SETDOTS                                      91000002
         LABEL      ' '                                                 91070002
*                                                                       91140002
         LINE                                                           91210002
         ROUTINE    B0BIT0,SETDOT0                                      91280002
         ROUTINE    BTIMES,LOOPER                                       91350002
         LABEL      ' '                                                 91420002
         EJECT                                                          91490002
*                                                                       91560002
         LINE      (20,20),(20,20),SKIP=3                               91630002
*              2790 ADAPTER                                             91700002
D2790L   LABEL ' '                                                      91770002
D2790ADP EQU   *                                                        91840002
         LINE       (1,1),(1,1),SKIP=1                                  91910002
         ROUTINE    BTIMES,SETHEAD                                      91980002
         LABEL      '2790 ADAPTER ERROR LOG'                            92050002
*                                                                       92120002
         LINE                                                           92190002
         ROUTINE    BTIMES,SKIPPER                                      92260002
         LABEL      ''                                                  92330002
         LINE       ,(5,1),SKIP=1                                       92400002
         ROUTINE    B1BIT0,SKIPPER                                      92470002
         LABEL      'PC ADAPTER STATUS'                                 92540002
*                                                                       92610002
         LINE       (33,35),(7,33)                                      92680002
         BIN        B1BIT0                                              92750002
         LABEL      'TRANSMIT ACTIVE FRAME','PARITY ERRORS'             92820002
*                                                                       92890002
         LINE       (33,35),(7,33)                                      92960002
         BIN        B1BIT1                                              93030002
         BIN        B2BIT0                                              93100002
         LABEL      'RECEIVE CHARACTER SYNC','  ACCUMULATOR HIGH',     X93170002
               'SERVICE REQUESTS'                                       93240002
*                                                                       93310002
         LINE       ,(7,35)                                             93380002
         BIN        B1BIT2                                              93450002
         BIN        B2BIT1                                              93520002
         BIN        B3BIT0                                              93590002
         LABEL      'LOOP ACTIVE','ACCUMULATOR LOW','RECEIVE'           93660002
*                                                                       93730002
         LINE                                                           93800002
         BIN        B1BIT3                                              93870002
         BIN        B2BIT2                                              93940002
         BIN        B3BIT1                                              94010002
         LABEL      'RECEIVE ACTIVE FRAME','TRANSMIT SHIFT REGISTER',  X94080002
               'TRANSMIT'                                               94150002
         LINE                                                           94220002
*                                                                       94290002
         ROUTINE    B0BIT0,SKIPPER                                      94360002
         BIN        B2BIT3                                              94430002
         LABEL      ' ','RECEIVE SHIFT REGISTER'                        94500002
*                                                                       94570002
         LINE       ,(5,35)                                             94640002
         ROUTINE    B0BIT0,SKIPPER                                      94710002
         BIN        B2BIT7                                              94780002
         BIN        B3BIT4                                              94850002
         LABEL      'SEGMENT STATUS','  CONTROL REGISTER 2',           X94920002
               'PC NOT RECEIVING FRAME'                                 94990002
*                                                                       95060002
         LINE                                                           95130002
         BIN        B1BIT4                                              95200002
         ROUTINE    B0BIT0,SKIPPER                                      95270002
         BIN        B2BIT4                                              95340002
         LABEL      '  SEGMENT A ACTIVE',' ','TRANSMIT FRAME OVERRUN'   95410002
*                                                                       95480002
         LINE                                                           95550002
         BIN        B1BIT5                                              95620002
         ROUTINE    B0BIT0,SKIPPER                                      95690002
         BIN        B2BIT5                                              95760002
         LABEL      '  SEGMENT B ACTIVE',' ','RECEIVE FRAME OVERRUN'    95830002
*                                                                       95900002
         LINE                                                           95970002
         BIN        B1BIT6                                              96040002
         BIN        B3BIT6                                              96110002
         BIN        B2BIT6                                              96180002
         LABEL      '  SEGMENT C ACTIVE','RECEIVE RESET ERROR',        X96250002
               'RECEIVE RE-SYNC ERROR'                                  96320002
*                                                                       96390002
         LINE                                                           96460002
         BIN        B1BIT7                                              96530002
         BIN        B3BIT7                                              96600002
         BIN        B3BIT5                                              96670002
         LABEL      '  SEGMENT D ACTIVE','TRANSMIT RESET ERROR',       X96740002
               'LOST LOOP SYNC'                                         96810002
*                                                                       96880002
*                                                                       96950002
         LINE                                                           97020002
         ROUTINE    BTIMES,LOOPER                                       97090002
         LABEL      ' '                                                 97160002
*                                                                       97230002
*                                                                       97300002
*                                                                       97370002
LABELS   EQU   *                                                        97440002
         LSTART                                                         97510002
         END                                                            97580002
