*** THIS MODULE SUPPORTS 3895 DEVICE --- SUPPORT CODE = G30HIMD ***     00050002
*** IT IS APPLICABLE FOR VS1 W/ SU01, MVS W/ SU27 AND AS SVS ICR ***    00100002
         MACRO                                                          00150002
         BIN   ,                                                        00200002
.*                                 &SYSLIST(&OP,1) - NAME OF LOG ITEM   00250002
.*                                      RECORD DSECT                    00300002
.*                                 $SYSLIST(&OP,2) - NBR OF SPACES      00350002
.*                                      TO SKIP ON MULTIPLE             00400002
.*                                      PRINT OR NBR OF SPACES          00450002
.*                                      TO BACK UP FROM COLUMN FOR      00500002
.*                                      START OF PRINTING. THE LETTER   00550002
.*                                      B PRECEEDS THE NUMBER (B5) IF   00600002
.*                                      THE LATTER IS DESIRED. OMISSION 00650002
.*                                      OF THIS OPERAND FORCES OPTION 2 00700002
.*                                      WITH BACKUP SPACING EQUAL TO    00750002
.*                                 THE NUMBER OF BITS IN THE ITEM       00800002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      00850002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     00900002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       00950002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             01000002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  01050002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  01100002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              01150002
         GBLA  &NRENTS,&SHIFT(3000)                                     01200002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           01250002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       01300002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         01350002
         LCLB  &B,&SUB                                                  01400002
         LCLA  &IBITS,&ISHIFT,&K                                        01450002
         LCLA  &TEMP,&T,&OP                                             01500002
         LCLC  &S,&ARG                                                  01550002
          ACTR  500000                                                  01600002
         AIF   (&DIAGTST EQ 0).NOMSG                                    01650002
         AIF   (&INITIAL EQ 0).NOMSG                                    01700002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    01750002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  01800002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     01850002
*        LINE                                                           01900002
         LINE                                                           01950002
.NOMSG   ANOP                                                           02000002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  02050002
&SUB     SETB  1                                                        02100002
.LOOP    ANOP                                                           02150002
&OP      SETA  &OP+1                                                    02200002
&ARG     SETC  '&SYSLIST(&OP,1)'                                        02250002
         ITEMFIND &ARG                                                  02300002
         AIF   (&ITEMXPT EQ 0).MEXIT                                    02350002
&ISHIFT  SETA  &SHIFT(&ITEMXPT)                                         02400002
&IBITS   SETA  &BITS(&ITEMXPT)                                          02450002
         AIF   (&SUB EQ 1).SUB00                                        02500002
         AIF   ('&SYSLIST(3)' EQ '').SETT                               02550002
&IBITS   SETA  &SYSLIST(3)                                              02600002
         AGO   .SETT                                                    02650002
.SUB00   AIF   ('&SYSLIST(&OP,3)' EQ '').SETT                           02700002
&IBITS   SETA  &SYSLIST(&OP,3)                                          02750002
.SETT    ANOP                                                           02800002
&T       SETA  &IBITS-1                                                 02850002
&B       SETB  0                                                        02900002
         AIF   (&IBITS GT 0 AND &IBITS LT 16).SUB0                      02950002
         MNOTE '**NO. OF BITS OUTSIDE RANGE OF 1-15**'                  03000002
.MEXIT   MEXIT                                                          03050002
.SUB0    AIF   (&SUB EQ 1).SUBA                                         03100002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             03150002
&K       SETA  K'&SYSLIST(2)                                            03200002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              03250002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                03300002
         AGO   .SUBB                                                    03350002
.SUBA    ANOP                                                           03400002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         03450002
&K       SETA  K'&SYSLIST(&OP,2)                                        03500002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          03550002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            03600002
.SUBB    ANOP                                                           03650002
&T       SETA  &S                                                       03700002
.BACKUP  ANOP                                                           03750002
&NRENTS  SETA  &NRENTS+1                                                03800002
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                            03850002
&TEMP    SETA  &ISHIFT                                                  03900002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'                03950002
         AGO   .OUT                                                     04000002
         AIF   (&SUB EQ 1).BIN2                                         04050002
         AIF   ('&SYSLIST(2)' NE '').BIN3                               04100002
         AGO   .BIN2A                                                   04150002
.BIN2    AIF   ('&SYSLIST(&OP,2)' NE '').BIN3                           04200002
.BIN2A   ANOP                                                           04250002
&B       SETB  1                                                        04300002
.BIN3    ANOP                                                           04350002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'                    04400002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             04450002
.OUT     ANOP                                                           04500002
&ITEMXPT     SETA  0                                                    04550002
         AIF   (&SUB EQ 0).OUTA                                         04600002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 04650002
.OUTA    ANOP                                                           04700002
         MEND                                                           04750002
         MACRO                                                          04800002
&NAME    DSGEN ,                                                        04850002
.*                            THIS MACRO GENERATES ONE DSECT WORD       04900002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 04950002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  05000002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    05050002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 05100002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   05150002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 05200002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      05250002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  05300002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    05350002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   05400002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             05450002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  05500002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  05550002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              05600002
         GBLA  &NRENTS,&SHIFT(3000)                                     05650002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           05700002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       05750002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         05800002
         LCLB  &ONLY1,&CTIND                                            05850002
         LCLA  &START1,&START2,&END1,&END2                              05900002
         LCLC  &SYMBOL,&EQUSYM                                          05950002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 06000002
         ACTR  100000                                                   06050002
         AIF   (&ITEMITR EQ 0).START                                    06100002
 MNOTE   20,'DSGEN MACRO OCCURRS AFTER ITEMSORT MACRO HAS BEEN ISSUED.' 06150002
         MEXIT                                                          06200002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            06250002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     06300002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   06350002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        06400002
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1            06450002
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT             06500002
         AGO   .SET2A                   BRANCH AROUND                   06550002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        06600002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              06650002
         MEXIT                                                          06700002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X06750002
               ).SET2                   TEST FOR NO SECOND              06800002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   06850002
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2            06900002
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2              06950002
         AGO   .LOOP                                                    07000002
.SET2    ANOP                                                           07050002
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 07100002
         AGO   .LOOP                                                    07150002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             07200002
         MEXIT                                                          07250002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               07300002
         MEXIT                                                          07350002
.LOOP    ANOP                                                           07400002
&OP      SETA  &OP+1                                                    07450002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           07500002
&ITEMNBR SETA  &ITEMNBR+1                                               07550002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            07600002
         MNOTE '**NULL BIT COUNT FIELD**'                               07650002
         MEXIT                                                          07700002
.OK1     ANOP                                                           07750002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        07800002
         AIF   ('&SYMBOL' NE '').OK                                     07850002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         07900002
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                         07950002
         AGO   .START                   GET NEXT                        08000002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        08050002
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU          08100002
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        08150002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         08200002
         AGO   .NO3                     BRANCH AROUND                   08250002
.OK2     ANOP                                                           08300002
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED              08350002
.NO3     ANOP                                                           08400002
&SYMBOL  EQU   *+&BYTE                                                  08450002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL             08500002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    08550002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    08600002
.CNT     ANOP                                                           08650002
&CTIND   SETB  1                        SET COUNT INDICATOR             08700002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   08750002
&BYTE    SETA  &COUNT/8                                                 08800002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        08850002
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        08900002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             08950002
&END1    SETA  &END1+1                  INCREMENT COUNT                 09000002
&OP      SETA  &OP-1                    DECREMENT INCREMENT             09050002
         AGO   .LOOP                    GENERATE NEXT                   09100002
.TSTST   ANOP                                                           09150002
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END               09200002
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        09250002
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      09300002
.NSET1   ANOP                                                           09350002
&OP      SETA  &OP-1                    DECREMENT INDEX                 09400002
&START1  SETA  &START1+1                INCREMENT FIRST COUNT           09450002
         AGO   .LOOP                    GO DO NEXT                      09500002
.LPDONE  ANOP                                                           09550002
&ONLY1   SETB  0                        CLEAR INDICATOR                 09600002
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      09650002
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 09700002
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT               09750002
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES             09800002
&NAME    DS    &COUNT.C                                                 09850002
.END     MEXIT                                                          09900002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          09950002
         MEXIT                                                          10000002
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   10050002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   10100002
         MEXIT                                                          10150002
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         10200002
*****               THE FOLLOWING STATEMENT                *****        10250002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        10300002
.EQU2    ANOP                                                           10350002
&EQUCNT  SETA  0                        CLEAR COUNTER                   10400002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND                 10450002
.EQULOP  ANOP                                                           10500002
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX                 10550002
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     10600002
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?                10650002
         AGO   .EQULOP                  NO-GET NEXT                     10700002
.EQUOUT  ANOP                                                           10750002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME                  10800002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS              10850002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT                 10900002
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED             10950002
         AGO   .START                   RETURN FOR NEXT                 11000002
         MEND                                                           11050002
         MACRO                                                          11100002
         CONVT ,                                                        11150002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             11200002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  11250002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  11300002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              11350002
         GBLA  &NRENTS,&SHIFT(3000)                                     11400002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           11450002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       11500002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         11550002
         LCLB  &SUB                                                     11600002
         LCLA  &OP                                                      11650002
         LCLA  &OFFSET,&OUT,&IN,&IND,&IBITS,&ISHIFT                     11700002
.*                                                                      11750002
.*       CONVERT BINARY TO DECIMAL                                      11800002
.*             &NAME IS THE REFERENCE INTO THE DSECT RECORD             11850002
.*             &OUT    IS THE NUMBER OF CHARS TO BE PUT ONTO PRINT LINE 11900002
.*                                      DEFAULT IS FOUR MAXIMUM IS 8    11950002
.*             &IN       IS THE NUMBER OF BYTES AS INPUT                12000002
.*                                      ERROR DEFAULT IS 2 MAXIMUM IS 4 12050002
.*                                                                      12100002
         AIF   (&DIAGTST EQ 0).NOMSG                                    12150002
         AIF   (&INITIAL EQ 0).NOMSG                                    12200002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    12250002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  12300002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     12350002
*        LINE                                                           12400002
         LINE                                                           12450002
.NOMSG   ANOP                                                           12500002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LLOP                  12550002
&SUB     SETB  1                                                        12600002
.LLOP    ANOP                                                           12650002
&OP      SETA  &OP+1                                                    12700002
&OUT     SETA  4                        .BR NOT NULL ELSE SET TO 4      12750002
         AIF   (&SUB EQ 1).SUBA                                         12800002
         AIF   ('&SYSLIST(3)' EQ '').B  TEST FOR NULL INPUT             12850002
&OUT     SETA  &SYSLIST(3)             SET &OUT FROM INPUT              12900002
         AGO   .A                                                       12950002
.SUBA    AIF   ('&SYSLIST(&OP,3)' EQ '').B                              13000002
&OUT     SETA  &SYSLIST(&OP,3)          SET &OUT FROM INPUT             13050002
.A       AIF   (&OUT GT 0 AND &OUT LT 9).B   TEST RANGE                 13100002
.AERR    MNOTE '*** BYTES OUT INCORRECTLY SPECIFIED DEFAULT USED ***'   13150002
&OUT     SETA  4                                                        13200002
.B       AIF   (&SUB EQ 1).SUBB                                         13250002
         AIF   ('&SYSLIST(2)' EQ '').LOOP    BRANCH IF NULL             13300002
&IN      SETA  &SYSLIST(2)              .SET &IN FROM INPUT             13350002
         AGO   .BB                                                      13400002
.SUBB    AIF   ('&SYSLIST(&OP,2)' EQ '').LOOP                           13450002
&IN      SETA  &SYSLIST(&OP,2)          .SET &IN FROM INPUT             13500002
.BB      AIF   (&IN GT 0 AND &IN LT 5).D     TEST RANGE                 13550002
.BERR    MNOTE '*** BYTES IN INCORRECTLY SPECIFIED DEFAULT USED ***'    13600002
&IN      SETA  2                                                        13650002
         AGO   .D                                                       13700002
.LOOP    ANOP                           .LOOP TO FIND &NAME IN DSECT    13750002
&IND     SETA  &IND+1                   .SET UP LOOP COUNTER            13800002
         AIF   ('&ITEM(&IND)' EQ '&SYSLIST(&OP,1)').FOUND               13850002
         AIF   (&IND LT &ITEMNBR).LOOP  .TEST FOR END OF DSECT          13900002
         MNOTE '*** LOG ITEM NOT DEFINED ***'                           13950002
         MEXIT                                                          14000002
.FOUND   ANOP                                                           14050002
&IBITS   SETA  &BITS(&IND)              .SET UP NUMBER OF BITS SPEC     14100002
         AIF   (&IBITS-((&IBITS/8)*8) EQ 0).C  .TEST FOR MULTIPLE OF 8  14150002
         MNOTE '*** DATA NOT DEFINED A MULTIPLE OF 8 BITS ***'          14200002
         MEXIT                                                          14250002
.C       ANOP                                                           14300002
&IN      SETA  &IBITS/8                 .COMPUTE NUMBER OF BYTES        14350002
         AIF   (&IN LT 1 OR &IN GT 4).BERR  .TEST RANGE B IF IN ERROR   14400002
&ISHIFT  SETA  &SHIFT(&IND)             .SET UP FOR TEST OF BYTE BNDR   14450002
         AIF   (&ISHIFT EQ 0).D         .TEST FOR BYTE BNDRY            14500002
         MNOTE '*** DATA NOT ALIGNED ON A BYTE BOUNDARY ***'            14550002
         MEXIT                                                          14600002
.*                                                                      14650002
.D       ANOP                                                           14700002
&NRENTS  SETA  &NRENTS+1                                                14750002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),AL.4(9)                    14800002
         DC    X'&IN',X'&OUT'                                           14850002
&IND     SETA  0                                                        14900002
         AIF   (&SUB EQ 0).OUTA                                         14950002
         AIF   (&OP LT N'&SYSLIST).LLOP                                 15000002
.OUTA    ANOP                                                           15050002
         MEND                                                           15100002
         MACRO                                                          15150002
         ITEMFIND &ARG,&ITFDIAG=                                        15200002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             15250002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  15300002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  15350002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              15400002
         GBLA  &NRENTS,&SHIFT(3000)                                     15450002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           15500002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       15550002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         15600002
         LCLA  &A,&B,&X,&I                                              15650002
         LCLC  &C1,&C2,&S                                               15700002
         ACTR  100000                                                   15750002
&ITEMXPT SETA  0                  INDICATE ITEM NOT FOUND.              15800002
         AIF   ('&ARG' NE '').NORM                                      15850002
         AIF   ('&ITFDIAG' EQ 'OFF'  OR  '&ITFDIAG' EQ 'ON').DIAGSET    15900002
  MNOTE 0,'ITEMFIND - OPERAND (&ITFDIAG) INVALID FOR ITFDIAG KEYWORD.'  15950002
         MEXIT                                                          16000002
.DIAGSET ANOP                                                           16050002
&DIAGITF SETB  ('&ITFDIAG' EQ 'ON')                                     16100002
         MEXIT                                                          16150002
.NORM    AIF   (&ITEMITR GT 0).SORTED                                   16200002
         ITEMSORT                                                       16250002
.SORTED  ANOP                                                           16300002
&I       SETA  &ITEMITR           COMPUTED ITTERATION COUNT.            16350002
&X       SETA  &ITEMMDX           COMPUTED MAXIMUM INDEX.               16400002
&C1      SETC  '&ARG'             ISOLATE SEARCH ARGUMENT.              16450002
&C1      SETC  '&C1'.'       '(1,8-K'&C1) PAD TO FULL 8 CHARACTERS.     16500002
.SRCHUP  ANOP                                                           16550002
&A       SETA  &A+&X              CURRENT TABLE SUBSCRIPT + INDEX.      16600002
&S       SETC  '+'                                                      16650002
         AIF   (&A  GT &ITEMNBR  AND  NOT &DIAGITF).SRCHDN1             16700002
         AIF   (&A  LE &ITEMNBR).SRCH00                                 16750002
&C2      SETC  '*-OVER-*'                                               16800002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         16850002
&X       SETA  &X/2               HALVE INDEX VALUE.                    16900002
 MNOTE *,'&ARG - &C2   ITRCTR = &I   PTR = &A&S &X'                     16950002
         AIF   (&I GE 0).SRCHDWN  IF ITTERATION COUNT NOT EXPIRED.      17000002
.NOFIND  MNOTE  20,' ITEMFIND FAILED FOR NAME  &C1  '                   17050002
         MEXIT                                                          17100002
.SRCH00  ANOP                                                           17150002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         17200002
         AIF   (&I LT 0).NOFIND   IF COUNT HAS GONE TO ZERO.            17250002
&X       SETA  &X/2               HALVE INDEX VALUE.                    17300002
&B       SETA  &ITEMNDX(&A)       GET SUBSCRIPT FROM INDEX TABLE.       17350002
&C2      SETC  '&ITEM(&B)'.'       '(1,8-K'&ITEM(&B))  PAD COMPARAND.   17400002
         AIF   (NOT &DIAGITF).COMPARE                                   17450002
 MNOTE *,'&ARG - &C2   ITRCTR = &I   PTR = &A&S &X   POS = &B'          17500002
.COMPARE AIF   ('&C1' LT '&C2').SRCHDWN   ARGUMENT LOWER, MOVE DOWN.    17550002
         AIF   ('&C1' GT '&C2').SRCHUP    ARGUMENT HIGHER, MOVE UP.     17600002
&ITEMXPT SETA  &B                 FOUND. SET INDEX POINTER FOR RETURN.  17650002
&ITEMFST(&I+1)  SETA  &ITEMFST(&I+1)+1                                  17700002
         MEXIT                                                          17750002
.SRCHDWN ANOP                                                           17800002
&A       SETA  &A-&X              CURRENT POINTER MINUS INDEX VALUE.    17850002
&S       SETC  '-'                                                      17900002
         AIF   (&A LE &ITEMNBR).SRCH00    IF WITHIN BOUNDS OF TABLE.    17950002
.SRCHDN1 ANOP                                                           18000002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         18050002
&X       SETA  &X/2               HALVE INDEX VALUE.                    18100002
         AIF   (&I GE 0).SRCHDWN  IF ITTERATION COUNT NOT EXPIRED.      18150002
         MNOTE  20,' ITEMFIND FAILED FOR NAME  &C1  '                   18200002
         MEND                                                           18250002
         MACRO                                                          18300002
         ITEMSORT  &DUMMY                                               18350002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             18400002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  18450002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  18500002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              18550002
         GBLA  &NRENTS,&SHIFT(3000)                                     18600002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           18650002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       18700002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         18750002
         LCLA  &R,&ZI,&I,&A1,&A2,&TEMP                                  18800002
         LCLB  &SR,&GOTO,&TB                                            18850002
         LCLB   &SW(4000)                                               18900002
         LCLC  &C1,&C2                                                  18950002
         ACTR   200000                                                  19000002
&A1      SETA  0                                                        19050002
         AIF   (&ITEMITR EQ 0).LOOP0   TEST FOR RE-ENTRY.               19100002
 MNOTE   0,'ITEMSORT MACRO OCCURRS MORE THAN ONCE. TABLE NOT RESORTED.' 19150002
         MEXIT                                                          19200002
.LOOP0   ANOP                                                           19250002
&A1      SETA  &A1+1                                                    19300002
&ITEMNDX(&A1) SETA &A1                                                  19350002
         AIF   (&A1 LT &ITEMNBR).LOOP0                                  19400002
         AIF   (&ITEMNBR LT 2).MEXIT                                    19450002
&A1      SETA  &ITEMNBR/2         HALF OF TOTAL ENTRIES.                19500002
&A2      SETA  0                                                        19550002
.LOOP1   ANOP                                                           19600002
&A2      SETA  &A2+1                                                    19650002
&SW(&A2) SETB  1                  SET FIRST HALF OF SWITCHES TO 1.      19700002
         AIF   (&A2 LT &A1).LOOP1                                       19750002
.LOOP2   ANOP                                                           19800002
&A2      SETA  &A2+1                                                    19850002
&SW(&A2) SETB  0                  SET SECOND HALF TO ZERO.              19900002
         AIF   (&A2 LT &ITEMNBR).LOOP2                                  19950002
&R       SETA  0                  SET R TO FIRST TRIAL ITEM.            20000002
&ZI      SETA  &ITEMNBR-1         SET ZI TO LAST ITEM.                  20050002
&I       SETA  &ZI-1                                                    20100002
.T3      ANOP                                                           20150002
&SR      SETB  (&SW(&R+1))        GET FLAG, WHICH WAY TO GO?            20200002
&R       SETA  (&R*2)+1+&SR       R=2R+(1 OR 2)                         20250002
         AIF   (&R LE &I).T3                                            20300002
.T4      ANOP                                                           20350002
&R       SETA  (&R-1)/2           R=(R-1)/2                             20400002
&SR      SETB  (&SW(&R+1))        GET SUBTREE SELECT FLAG.              20450002
         AIF   (&SR EQ 0).T7                                            20500002
         AIF   (&GOTO EQ 0).T5                                          20550002
.T7      ANOP                                                           20600002
&A1      SETA  &ITEMNDX(&R+1)                                           20650002
&A2      SETA  &ITEMNDX(&ZI+1)                                          20700002
&C1      SETC  '&ITEM(&A1)'.'       '(1,8-K'&ITEM(&A1))                 20750002
&C2      SETC  '&ITEM(&A2)'.'       '(1,8-K'&ITEM(&A2))                 20800002
         AIF   ('&C1' LT '&C2').T8                                      20850002
.T9      ANOP                                                           20900002
&TEMP    SETA  &ITEMNDX(&R+1)     Z(R) TO TEMP.                         20950002
&TB      SETB  (&SW(&R+1))                                              21000002
&ITEMNDX(&R+1) SETA &ITEMNDX(&ZI+1)    Z(I) TO Z(R)                     21050002
&SW(&R+1) SETB (&SW(&ZI+1))                                             21100002
&ITEMNDX(&ZI+1) SETA &TEMP        TEMP TO Z(I)                          21150002
&SW(&ZI+1) SETB (&TB)                                                   21200002
&SR      SETB  (&SR EQ 0)                                               21250002
&SW(&R+1) SETB (&SR)                                                    21300002
.T8      AIF   (&R GT 0).T4                                             21350002
&GOTO    SETB  1                  SET 'GO TO' T7                        21400002
&ZI      SETA  &ZI-1                                                    21450002
&I       SETA  &I-1                                                     21500002
         AIF   (&I GE 0).T3                                             21550002
.MEXIT   ANOP                                                           21600002
&ITEMITR SETA 1                                                         21650002
&ITEMMDX SETA 1                                                         21700002
.ITRLOOP ANOP                                                           21750002
&ITEMITR SETA &ITEMITR+1                                                21800002
&ITEMMDX SETA &ITEMMDX+&ITEMMDX                                         21850002
         AIF  (&ITEMMDX LT &ITEMNBR).ITRLOOP                            21900002
&ITEMITR SETA &ITEMITR-1                                                21950002
&ITEMMDX SETA &ITEMMDX/2                                                22000002
&A1      SETA &ITEMNBR                                                  22050002
&A2      SETA &ITEMMDX                                                  22100002
&TEMP    SETA &ITEMITR                                                  22150002
 MNOTE *,' ITEMS = &A1, MAX INDEX = &A2, ITTERATION COUNT = &TEMP'      22200002
         MEXIT                                                          22250002
.T5      ANOP                                                           22300002
&TEMP    SETA  &ITEMNDX(&R+1)     Z(R) TO TEMP.                         22350002
&TB      SETB  (&SW(&R+1))                                              22400002
&ITEMNDX(&R+1) SETA &ITEMNDX(&ZI+1)    Z(I) TO Z(R)                     22450002
&SW(&R+1) SETB (&SW(&ZI+1))                                             22500002
&ITEMNDX(&ZI+1) SETA &TEMP        TEMP TO Z(I)                          22550002
&SW(&ZI+1) SETB (&TB)                                                   22600002
&SR      SETB  (&SR EQ 0)                                               22650002
&SW(&R+1) SETB (&SR)                                                    22700002
         AGO   .T3                                                      22750002
         MEND                                                           22800002
           MACRO                                                        22850002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C22900002
               &LABEL7,&LABEL8                                          22950002
.*                                 THIS MACRO ALLOWS LABELS TO          23000002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   23050002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  23100002
.*                                 TION MARKS. THE COLUMN AND LINE END  23150002
.*                                 CONTROLS WILL BE INSERTED BY THE     23200002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      23250002
.*                                 LABEL REQUIRED FOR RESPECTIVE        23300002
.*                                 COLUMN.                              23350002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             23400002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  23450002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  23500002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              23550002
         GBLA  &NRENTS,&SHIFT(3000)                                     23600002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           23650002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       23700002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         23750002
         LCLC  &MARGIN,&TACK                                            23800002
         LCLC  &TEXT                                                    23850002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            23900002
         AIF   (&INITIAL EQ 0).DIAGCLR                                  23950002
         AIF   (&DIAGTST EQ 0).DIAGCLR                                  24000002
         AIF   (&DIAGLIN EQ 1).DIAGCLR                                  24050002
         MNOTE '**NO LINE ASSOCIATED WITH PREVIOUS LABEL**'             24100002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   24150002
*        LINE                                                           24200002
         LINE                                                           24250002
.DIAGCLR ANOP                                                           24300002
&DIAGSET SETB  0                                                        24350002
&DIAGLIN SETB  0                                                        24400002
&MARGIN  SETC  '*'                                                      24450002
         AIF   ('&NAME' EQ '').LOOPOUT                                  24500002
&LPTR    SETA  &LPTR+1                                                  24550002
&LBL(&LPTR) SETC '&NAME'                                                24600002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          24650002
.LOOPOUT ANOP                                                           24700002
&OP      SETA  &OP+1                                                    24750002
&K       SETA  K'&SYSLIST(&OP)                                          24800002
         AIF (&K GE 2).NORM                                             24850002
&K       SETA  2                                                        24900002
.NORM    ANOP                                                           24950002
&START   SETA  2                                                        25000002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                25050002
&MARGIN  SETC  '$'                                                      25100002
.NOTLAST ANOP                                                           25150002
&NRCHAR  SETA  8                                                        25200002
&TACK    SETC  ''                                                       25250002
.LOOPIN  ANOP                                                           25300002
&REMAIN  SETA  &K-&START                                                25350002
         AIF (&REMAIN GE 8).MORE                                        25400002
&TACK    SETC  '&MARGIN'                                                25450002
&NRCHAR  SETA  &REMAIN                                                  25500002
.MORE    ANOP                                                           25550002
&TEXT    SETC  ''                                                       25600002
         AIF (&REMAIN EQ 0).ENDTEXT                                     25650002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          25700002
.ENDTEXT ANOP                                                           25750002
&LABELNR SETA  &LABELNR+1                                               25800002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  25850002
&START   SETA  &START+8                                                 25900002
         AIF ('&TACK' EQ '').LOOPIN                                     25950002
         AIF ('&TACK' EQ '*').LOOPOUT                                   26000002
         MEND                                                           26050002
         MACRO                                                          26100002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      26150002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     26200002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    26250002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 26300002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    26350002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    26400002
.*                                 THE PREVIOUS LINE AND STORES THAT #  26450002
.*                                 INTO THE APPROPRIATE BYTE.           26500002
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    26550002
.*                                 DATA.                                26600002
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 26650002
.*                                 DATA COLUMN STARTING CHARACTERS.     26700002
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   26750002
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 26800002
.*                                 STARTING CHARACTERS.                 26850002
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   26900002
.*                                 TO BEGIN NEXT PRINTED LINE.          26950002
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       27000002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   27050002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 27100002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   27150002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 27200002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    27250002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   27300002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   27350002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  27400002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   27450002
.*                                 THE SUBJECT LINE                     27500002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             27550002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  27600002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  27650002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              27700002
         GBLA  &NRENTS,&SHIFT(3000)                                     27750002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           27800002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       27850002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         27900002
         LCLA  &S                                                       27950002
         AIF   (&INITIAL EQ 0 OR &DIAGTST EQ 0).DIAGSET                 28000002
         AIF   (&DIAGSET EQ 0).DIAGSET                                  28050002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  28100002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   28150002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       28200002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 28250002
.DIAGSET ANOP                                                           28300002
&DIAGSET SETB  1                                                        28350002
&DIAGLIN SETB  1                                                        28400002
&NAME    DS    0C                                                       28450002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  28500002
         LINEND                                                         28550002
         AGO   .NTFIRST                                                 28600002
.FIRSTLN ANOP                                                           28650002
&NRENTSX SETC  'N&SYSNDX'                                               28700002
&INITIAL SETA  1                                                        28750002
N&SYSNDX EQU   *                                                        28800002
.NTFIRST ANOP                                                           28850002
         DC    AL1(0)                                                   28900002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               28950002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                29000002
&DB      SETA  &DATA(1)                                                 29050002
         AGO   .AA                                                      29100002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                29150002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 29200002
         AGO   .CC                                                      29250002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    29300002
         AIF   (&DATA(2) EQ &DT).BB                                     29350002
.CC      ANOP                                                           29400002
&DT      SETA  &DATA(2)                                                 29450002
.BB      DC    XL2'FFFE'                                                29500002
         DC    FL1'&DB'                                                 29550002
         DC    FL1'&DT'                                                 29600002
&NRENTS  SETA  &NRENTS+1                                                29650002
.NCDATA  ANOP                                                           29700002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              29750002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               29800002
&LB      SETA  &LABEL(1)                                                29850002
         AGO   .AAA                                                     29900002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              29950002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               30000002
         AGO   .CCC                                                     30050002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  30100002
         AIF   (&LABEL(2) EQ &LT).BBB                                   30150002
.CCC     ANOP                                                           30200002
&LT      SETA  &LABEL(2)                                                30250002
.BBB     DC    XL2'FFFF'                                                30300002
         DC    FL1'&LB'                                                 30350002
         DC    FL1'&LT'                                                 30400002
&NRENTS  SETA  &NRENTS+1                                                30450002
.NCLABEL ANOP                                                           30500002
         AIF   ('&SKIP' NE '').CONT                                     30550002
         AIF   (&TEST EQ 0).NOCHANG                                     30600002
         AGO   .DEFALTA                                                 30650002
.CONT    ANOP                                                           30700002
         AIF   (&TEST EQ 0).AB                                          30750002
         AIF   ('&SKIP' EQ 'E').AB                                      30800002
&S       SETA  &SKIP                                                    30850002
.DEFAULT ANOP                                                           30900002
         AIF   (&SKIP EQ &LASTCC).DEFALTA                               30950002
         ORG   &CARRCON+3                                               31000002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 31050002
         ORG                                                            31100002
&LASTCC  SETA  &S                                                       31150002
.DEFALTA ANOP                                                           31200002
&TEST    SETB  0                                                        31250002
         AGO   .DD                                                      31300002
.AB      AIF   ('&SKIP' NE 'E').ABB                                     31350002
A&SYSNDX DC    X'FFFB8B00'              EJECT                           31400002
&LASTCC  SETA  184                                                      31450002
&TEST    SETB  1                                                        31500002
         AGO   .ABC                                                     31550002
.ABB     AIF   (&SKIP EQ &LASTCC).NOCHANG                               31600002
A&SYSNDX DC    XL2'FFFB'                                                31650002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              31700002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              31750002
&LASTCC  SETA  &SKIP                                                    31800002
&TEST    SETB  1                                                        31850002
.ABC     ANOP                                                           31900002
&CARRCON SETC  'A&SYSNDX'                                               31950002
&NRENTS  SETA  &NRENTS+1                                                32000002
.DD      ANOP                                                           32050002
.NOCHANG ANOP                                                           32100002
         MEND                                                           32150002
         MACRO                                                          32200002
         LINEND ,                                                       32250002
.*                                 THIS MACRO IS USED ONLY BY THE LINE  32300002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   32350002
.*                                 ASSOCIATED WITH EACH LINE.           32400002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             32450002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  32500002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  32550002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              32600002
         GBLA  &NRENTS,&SHIFT(3000)                                     32650002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           32700002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       32750002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         32800002
         ORG   &NRENTSX                                                 32850002
         DC    FL1'&NRENTS'                                             32900002
         ORG                                                            32950002
&NRENTS  SETA  0                                                        33000002
B&SYSNDX EQU   *                                                        33050002
&NRENTSX SETC  'B&SYSNDX'                                               33100002
         MEND                                                           33150002
         MACRO                                                          33200002
         LSTART ,                                                       33250002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  33300002
.*                                 OF THE TABLE IS TO BEGIN.            33350002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             33400002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  33450002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  33500002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              33550002
         GBLA  &NRENTS,&SHIFT(3000)                                     33600002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           33650002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       33700002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         33750002
         LCLA  &NDX,&CTR                                                33800002
         ACTR  500000                                                   33850002
         AIF   (&DIAGTST EQ 0).NODIAG                                   33900002
         AIF   (&DIAGSET EQ 0).NODIAG                                   33950002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  34000002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   34050002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       34100002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 34150002
.NODIAG  ANOP                                                           34200002
         LINEND                                                         34250002
&CTR     SETA  1                                                        34300002
.LOOP    ANOP                                                           34350002
&NDX     SETA  &NDX+1                                                   34400002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            34450002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         34500002
&CTR     SETA  &CTR+1                                                   34550002
         AGO   .LOOPCTL                                                 34600002
.NOLBL   ANOP                                                           34650002
         DC    C'&LABELS(&NDX)'                                         34700002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  34750002
         MEND                                                           34800002
         MACRO                                                          34850002
&NAME    ROUTINE &LOGITEM,&RNAME                                        34900002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             34950002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  35000002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  35050002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              35100002
         GBLA  &NRENTS,&SHIFT(3000)                                     35150002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           35200002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       35250002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         35300002
         AIF   (&DIAGTST EQ 0).NOMSG                                    35350002
         AIF   (&INITIAL EQ 0).NOMSG                                    35400002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    35450002
         MNOTE '**NO LINE ASSOCIATED WITH THIS ROUTINE**'               35500002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     35550002
*        LINE                                                           35600002
         LINE                                                           35650002
.NOMSG   ANOP                                                           35700002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           35750002
         DC    AL2(&RNAME-&CSECT)                                       35800002
&NRENTS  SETA  &NRENTS+1                                                35850002
         MEND                                                           35900002
         MACRO                                                          35950002
         SPECIAL &ROUTINE,&PARAM,&SPACE=                                36000002
.*                            THIS MACRO GENERATES A SPECIAL ROUTINE    36050002
.*                                 ENTRY TO BE PROCESSED BY THE SUM. M. 36100002
.*                            &ROUTINE - SYMBOL ON SPECIAL ROUTINE EWT. 36150002
.*                            &PARAM - AN 8 BIT BINARY REPRESENTATION   36200002
.*                                 TO OCCUPY THE 'MASK' FIELD BUT TO BE 36250002
.*                                 INTERPRETED AS AN ARGUMENT OF THE    36300002
.*                                 SPECIAL ROUTINE.                     36350002
.*                            &SPACE - THE NUMBER OF 2BYTE COUNTERS TO  36400002
.*                                 ALLOCATE FOR REQUIRED PROCESSING.    36450002
         GBLC  &CSECT                                                   36500002
         GBLA  &COUNTR                                                  36550002
         LCLA  &ADD                                                     36600002
         DC    AL1(128)                                                 36650002
         DC    BL.8'&PARAM'                                             36700002
         DC    AL2(&ROUTINE-&CSECT)                                     36750002
         DC    AL2(&COUNTR)                                             36800002
&ADD     SETA  1                                                        36850002
         AIF   ('&SPACE' EQ '').NORM                                    36900002
&ADD     SETA  &SPACE                                                   36950002
.NORM    ANOP                                                           37000002
&COUNTR  SETA  &COUNTR+&ADD                                             37050002
         MEND                                                           37100002
         MACRO                                                          37150002
         HEX   ,                                                        37200002
.*                            THIS MACRO FACILITATES GENERATION OF THE  37250002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    37300002
.*                                 CONVERSIONS.                         37350002
.*                            &SYSLIST(&OP,1) - NAME OF DATA ITEM TO BE 37400002
.*                                 CONVERTED                            37450002
.*                            &SYSLIST(&OP,2) - # OF SPACES TO SKIP ON  37500002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   37550002
.*                                 BACK UP FROM COLUMN FOR START OF     37600002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  37650002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  37700002
.*                                 DESIRED. OMISSION OF THIS OPERAND    37750002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  37800002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  37850002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 37900002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    37950002
.*                                 IMPLICITLY B).                       38000002
.*                            &SYSLIST(&OP,3) - NUMBER OF BYTES TO      38050002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     38100002
.*                                 WITH AN L,R, OR B TO STIPULATE       38150002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     38200002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     38250002
.*                                 RESPECTIVELY. OMISSION OF THIS       38300002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  38350002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 38400002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 38450002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   38500002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     38550002
.*                                 SUBJECT LINE(S).                     38600002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             38650002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  38700002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  38750002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              38800002
         GBLA  &NRENTS,&SHIFT(3000)                                     38850002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           38900002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       38950002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         39000002
         LCLB  &B,&SUB                                                  39050002
         LCLA  &IBITS,&ISHIFT,&K,&T,&CODE,&BYTESP,&OP                   39100002
         LCLC  &S,&LETTER,&ARG                                          39150002
       ACTR  500000                                                     39200002
         AIF   (&DIAGTST EQ 0).NOMSG                                    39250002
         AIF   (&INITIAL EQ 0).NOMSG                                    39300002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    39350002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  39400002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     39450002
*        LINE                                                           39500002
         LINE                                                           39550002
.NOMSG   ANOP                                                           39600002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  39650002
&SUB     SETB  1                                                        39700002
.LOOP    ANOP                                                           39750002
&OP      SETA  &OP+1                                                    39800002
&ARG     SETC  '&SYSLIST(&OP,1)'                                        39850002
         ITEMFIND  &ARG                                                 39900002
         AIF   (&ITEMXPT EQ 0).MEXIT                                    39950002
.FOUND   ANOP                                                           40000002
&ISHIFT  SETA  &SHIFT(&ITEMXPT)                                         40050002
&IBITS   SETA  &BITS(&ITEMXPT)                                          40100002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).ALIGN                     40150002
.ERR     MNOTE '**DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY**'          40200002
.MEXIT   MEXIT                                                          40250002
.ALIGN   ANOP                                                           40300002
&CODE    SETA  1                                                        40350002
         AIF   (&SUB EQ 1).SUBA                                         40400002
&K       SETA  K'&SYSLIST(3)                                            40450002
         AGO   .SUBB                                                    40500002
.SUBA    ANOP                                                           40550002
&K       SETA  K'&SYSLIST(&OP,3)                                        40600002
.SUBB    ANOP                                                           40650002
         AIF   (&K EQ 1).ERR3                                           40700002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            40750002
         MNOTE '**BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL**' 40800002
         MEXIT                                                          40850002
.OK      AIF   (&SUB EQ 1).SUBC                                         40900002
         AIF   ('&SYSLIST(3)' EQ '').USEDEFN                            40950002
&LETTER  SETC  '&SYSLIST(3)'(&K,1)                                      41000002
&S       SETC  '&SYSLIST(3)'(1,&K-1)                                    41050002
         AGO   .SUBD                                                    41100002
.SUBC    ANOP                                                           41150002
         AIF   ('&SYSLIST(&OP,3)' EQ '').USEDEFN                        41200002
&LETTER  SETC  '&SYSLIST(&OP,3)'(&K,1)                                  41250002
&S       SETC  '&SYSLIST(&OP,3)'(1,&K-1)                                41300002
.SUBD    ANOP                                                           41350002
&BYTESP  SETA  &S                                                       41400002
         AIF   ('&LETTER' EQ 'B').BOTH                                  41450002
         AIF   ('&LETTER' EQ 'L').LEFT                                  41500002
         AIF   ('&LETTER' EQ 'R').RIGHT                                 41550002
.ERR3    MNOTE '**PARAMETER 3 INCOMPLETE-DSGEN DEFINITION USED**'       41600002
         AGO   .USEDEFN                                                 41650002
.RIGHT   ANOP                                                           41700002
&CODE    SETA  2                                                        41750002
         AGO   .L                                                       41800002
.LEFT    ANOP                                                           41850002
&CODE    SETA  1                                                        41900002
         AGO   .L                                                       41950002
.USEDEFN ANOP                                                           42000002
&BYTESP  SETA  &IBITS/8                                                 42050002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       42100002
&CODE    SETA  3                                                        42150002
&T       SETA  &BYTESP*2-1                                              42200002
&S       SETC  '&T'                                                     42250002
.OK2     AIF   (&ISHIFT EQ 0).L                                         42300002
&CODE    SETA  2                                                        42350002
.L       ANOP                                                           42400002
&B       SETB  1                                                        42450002
         AIF   (&SUB EQ 1).SUBE                                         42500002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             42550002
&K       SETA  K'&SYSLIST(2)                                            42600002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              42650002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                42700002
         AGO   .SUBF                                                    42750002
.SUBE    ANOP                                                           42800002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         42850002
&K       SETA  K'&SYSLIST(&OP,2)                                        42900002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          42950002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            43000002
.SUBF    ANOP                                                           43050002
.BACKUP  ANOP                                                           43100002
&NRENTS  SETA  &NRENTS+1                                                43150002
         AIF   (&BYTESP GT 0 AND &BYTESP LT 16).SUB0                    43200002
         MNOTE '**NO. OF BYTES OUTSIDE RANGE OF 1-15**'                 43250002
         MEXIT                                                          43300002
.SUB0    AIF   (&SUB EQ 1).SUBG                                         43350002
         DC    AL.12(&SYSLIST(1)-&DSECT),XL.4'A'                        43400002
         AGO   .SUBH                                                    43450002
.SUBG    ANOP                                                           43500002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'A'                    43550002
.SUBH    ANOP                                                           43600002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'              43650002
.OUT     ANOP                                                           43700002
&ITEMXPT     SETA  0                                                    43750002
         AIF   (&SUB EQ 0).OUTA                                         43800002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 43850002
.OUTA    ANOP                                                           43900002
         MEND                                                           43950002
         MACRO                                                          44000002
         SUM   &LOGITEM,&MASK                                           44050002
.*                            THIS MACRO GENERATES A NORMAL EDIT ENTRY  44100002
.*                                 FOR PROCESSING BY THE SUMMARY MODULE 44150002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE SUMMED 44200002
.*                            &MASK - BYTE MASK FOR BITS TO BE TESTED.  44250002
.*                                 THIS OPERAND SHOULD BE OMITTED FOR   44300002
.*                                 SINGLE BIT ITEMS IN WHICH CASE THE   44350002
.*                                 MASK WILL BE SET ACCORDING TO THE    44400002
.*                                 OFF BYTE BIT DISPLACEMENT OF THE     44450002
.*                                 ITEM AS DEFINED BY THE MACRO 'DSGEN' 44500002
         GBLA  &COUNTR,&ITEMNBR,&BITS(3000),&SHIFT(3000)                44550002
         GBLC  &ITEM(3000),&DSECT                                       44600002
         LCLA  &IBITS,&NDX,&ISHIFT,&M,&BITNBR                           44650002
.LOOP    ANOP                                                           44700002
&NDX     SETA  &NDX+1                                                   44750002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      44800002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  44850002
         MNOTE *,'LOGITEM NOT FOUND'                                    44900002
         MEXIT                                                          44950002
.FOUND   ANOP                                                           45000002
&ISHIFT  SETA  &SHIFT(&NDX)                                             45050002
&IBITS   SETA  &BITS(&NDX)                                              45100002
         AIF   (&IBITS EQ 1).FORM1      TEST FOR OLD FORM               45150002
         AIF   ('&MASK' NE '').FORM1    TEST FOR MASK                   45200002
         AIF   (&IBITS+&ISHIFT GT 8).MSG     TEST FOR MORE THAN EIGHT   45250002
         DC    AL.1(0),AL.3(&ISHIFT),AL.4(&IBITS)                       45300002
         DC    AL1(0)                                                   45350002
         AGO   .ITEM                                                    45400002
.MSG     MNOTE '**BITS GREATER THAN 8**'                                45450002
         MEXIT                                                          45500002
.FORM1   ANOP                                                           45550002
         DC    AL1(0)                                                   45600002
         AIF   ('&MASK' EQ '').FORM                                     45650002
         DC    B'&MASK'                                                 45700002
         AGO   .ITEM                                                    45750002
.FORM    ANOP                                                           45800002
&BITNBR  SETA  &ISHIFT-7                                                45850002
&BITNBR  SETA  0-&BITNBR                                                45900002
&M       SETA  1                                                        45950002
.LOOP2   ANOP                                                           46000002
         AIF   (&BITNBR EQ 0).GOTIT                                     46050002
&M       SETA  &M*2                                                     46100002
&BITNBR  SETA  &BITNBR-1                                                46150002
         AGO   .LOOP2                                                   46200002
.GOTIT   ANOP                                                           46250002
         DC    AL1(&M)                                                  46300002
.ITEM    DC    AL2(&LOGITEM-&DSECT)                                     46350002
         DC    AL2(&COUNTR)                                             46400002
&COUNTR  SETA  &COUNTR+1                                                46450002
         MEND                                                           46500002
         TITLE 'IFCET00D -EDIT TABLE FOR 3895'                          46550002
         GBLC  &DSECT,&CSECT                                            46600002
IFCET00D CSECT                                                          46650002
&CSECT   SETC  'IFCET00D'                                               46700002
&DSECT   SETC  'T00D'                                                   46750002
T00D     DSECT                                                          46800002
         DSGEN (CLASSRC,8),(SYSREL,8),(SWITCHES,16)                     46850002
         DSGEN (RECID,8),(SPARES,24)                                    46900002
         DSGEN (DAY,32),(TIME,32)                                       46950002
         DSGEN (SPARE1,8),(CPUSER,24),(MODEL,16),(MCEL,16)              47000002
         DSGEN (XCUA,16),(RECTYP,8),(XDUMZ,8)                           47050002
         DSGEN (TWOBYT,16,0,62)                                @XA20899 47100001
         DSGEN (ONEBYT,8,0,96)                                 @XA20899 47120001
         DSGEN (O1BYT,8,97,112)                                @XA20899 47170001
         DS    4C                                                       48250002
IFCET00D CSECT                                                          48300002
         USING *,R9                                                     48350002
         USING T00D,R2                                                  48400002
R0       EQU   0                                                        48450002
R1       EQU   1                                                        48500002
R2       EQU   2                                                        48550002
R3       EQU   3                                                        48600002
R4       EQU   4                                                        48650002
R5       EQU   5                                                        48700002
R6       EQU   6                                                        48750002
R7       EQU   7                                                        48800002
R8       EQU   8                                                        48850002
R9       EQU   9                                                        48900002
R10      EQU   10                                                       48950002
R11      EQU   11                                                       49000002
R12      EQU   12                                                       49050002
R13      EQU   13                                                       49100002
R14      EQU   14                                                       49150002
R15      EQU   15                                                       49200002
L0       EQU   0                                                        49250002
L1       EQU   1                                                        49300002
L2       EQU   2                                                        49350002
L3       EQU   3                                                        49400002
L4       EQU   4                                                        49450002
L5       EQU   5                                                        49500002
L6       EQU   6                                                        49550002
L7       EQU   7                                                        49600002
L8       EQU   8                                                        49650002
L9       EQU   9                                                        49700002
L10      EQU   10                                                       49750002
L11      EQU   11                                                       49800002
L12      EQU   12                                                       49850002
L13      EQU   13                                                       49900002
L15      EQU   15                                                       49950002
L16      EQU   16                                                       50000002
L20      EQU   20                                                       50050002
L46      EQU   46                                                       50100002
L24      EQU   24                                                       50150002
L29      EQU   29                                                       50200002
L35      EQU   35                                                       50250002
L36      EQU   36                                                       50300002
L100     EQU   100                                                      50350002
F5       EQU   X'04'                                                    50400002
F4       EQU   X'08'                                                    50450002
F3       EQU   X'10'                                                    50500002
F2       EQU   X'20'                                                    50550002
F1       EQU   X'40'                                                    50600002
F0       EQU   X'80'                                                    50650002
HEX02    EQU   X'02'                                                    50700002
HEX90    EQU   X'90'                                           @M04AE95 50720002
OVFLO    EQU   X'01'                                                    50750002
L19      EQU   19                                                       50800002
FMT3     EQU   X'10'                                                    50850002
         DC    A(ENTRIES)                                               50900002
         DC    CL8'IFCET00D'                                            50950002
XR9PTR   DC    F'0'                                                     51000002
XLABELP  DC    F'0'                                                     51050002
NONE     DC    C'NONE'                                                  51100002
EXXXH    DC    X'FE'                                           @M04AE95 51110002
         DC    CL8'IFCEXXXH'                                   @M04AE95 51120001
WORK     DC    D'0'                                                     51150002
RELTAB   DS    0C                                                       51200002
         DC    C'OS  '                                                  51250002
         DC    C'DOS '                                                  51300002
         DC    C'VS1 '                                         @XA19168 51350001
         DC    C'V370'                                                  51400002
         DC    C'VS2 '                                         @XA19168 51450001
         DC    C'    '                                                  51500002
         DC    C'    '                                                  51550002
         DC    C'    '                                                  51600002
BLANKS   DC    13C' '                                          @M04AE95 51610001
ERRORMSG DC    C'/// ERROR ///'                                @M04AE95 51620001
OVERFLW  DC    C'COUNTER OVERFLOW    '                         @XA20891 51650001
OFFEOD   DC    C'OFFLINE/END-OF-DAY  '                         @XA20891 51680001
XSAVE    DC    5F'0'                                                    51750002
CHARS    DC    C'0123456789ABCDEF'                                      51800002
SPACER1  LA    R3,L1(R3)                                                51850002
         BR    R14                                                      51900002
SPACER19 LA    R3,L19(R3)                                               51950002
         BR    R14                                                      52000002
SKIPPER  BR    R14                                                      52050002
RETURN   LM    R5,R8,XSAVE         RESTORE REGS                         52100002
         BR    14                  RETURN                               52150002
BKSP1    BCTR  R3,0                                                     52200002
         BR    R14                                                      52250002
SETHEX   STM   R5,R8,XSAVE              SAVE REGS                       52300002
         LA    R8,CHARS                 CHARACTER TABLE                 52350002
         IC    R7,L0(R4)                PICK UP CHARACTER               52400002
         SLL   R7,L24                   MOVE TO HI R7                   52450002
         SR    R6,R6                    CLEAR R6                        52500002
         SLDL  R6,L4                    MOVE FOUR BITS                  52550002
         AR    R6,R8                    ADD OFFSET & PTR                52600002
         MVC   L0(L1,R3),L0(R6)         MOVE TO LINE                    52650002
         SR    R6,R6                    CLEAR R6                        52700002
         SLDL  R6,L4                    MOVE LAST 4 BITS                52750002
         AR    R6,R8                    COMPUTE OFFSET                  52800002
         MVC   L1(L1,R3),L0(R6)         MOVE LAST CHAR                  52850002
         B     RETURN                   RETURN                          52900002
***      SET DATE TO PRINT                                              52950002
*                                                                       53000002
SETDATE  UNPK  XSAVE(L8),L1(L3,R4)      UNPACK DATE                     53050002
         MVC   L0(L3,R3),XSAVE+L5       MOVE DAY                        53100002
         MVC   L4(L2,R3),XSAVE+L3       MOVE YEAR                       53150002
         BR    R14                      RETURN                          53200002
***      CONVERT RELEASE NUMBER                                         53250002
*                                                                       53300002
CONVREL  STM   R5,R8,XSAVE              SAVE REGS                       53350002
         SR    R6,R6                    CLEAR R6                        53400002
         IC    R6,L0(R4)                PICK UP RELEASE AND SYSTEM      53450002
         SRDL  R6,L5                    SAVE REL NO IN R7               53500002
         SLL   R6,L2                    MULTIPLY BY 4                   53550002
         L     R8,XLABELP               PICK UP LABEL POINTER           53600002
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     53650002
         MVC   L100(L4,R8),L0(R6)         MOVE SYS NAME INTO LABEL      53700002
         SR    R6,R6                    CLEAR R6                        53750002
         SLDL  R6,L5                    RETRIVE REL NO                  53800002
         LTR   R6,R6                    IS IT ZERO                      53850002
         BZ    NOREL                    YES-BR                          53900002
         CVD   R6,WORK                  CONVERT IT                      53950002
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFF       54000002
         MVZ   L1(L1,R3),L0(R3)         MOVE IN ZONE                    54050002
         B     RETURN                   EXIT                            54100002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE                    54150002
         B     RETURN                   EXIT                            54200002
CKTYPE   STM   R5,R8,XSAVE                                     @M04AE95 54207002
         TM    CLASSRC,HEX90            IS IT REALLY MDR       @M04AE95 54214002
         BO    RETURN                   YES,RETURN             @M04AE95 54221002
         LA    R5,EXXXH-4               SET UP TO CALL IFCEXXXH@M04AE95 54228002
         ST    R5,XR9PTR                FOR OBR PROCESSING     @M04AE95 54235002
         B     RETURN                   RETURN                 @M04AE95 54242002
CHKERROR STM   R5,R8,XSAVE                                     @M04AE95 54242801
         L     R8,XLABELP               GET ADDR OF LABEL      @M04AE95 54243601
         TM    0(R4),X'80'              WAS THERE AN ERROR     @M04AE95 54244401
         BZ    NOERROR                  NO, BRANCH             @M04AE95 54245201
         MVC   L0(L13,R8),ERRORMSG      YES,MOVE ERROR MSG     @M04AE95 54246001
         B     RETURN                                          @M04AE95 54246801
NOERROR  MVC   L0(L13,R8),BLANKS        NO ERROR, MOVE BLANKS  @M04AE95 54247601
         B     RETURN                                          @M04AE95 54248401
*                                                                       54250002
TYPREC   STM   R5,R8,XSAVE                                              54300002
         L     R8,XLABELP          GET LABEL POINTER                    54350002
TYPREC1  TM    L0(R4),F1           COUNTER OVERFLOW ?                   54400002
         BZ    TYPREC4                                                  54450002
         MVC   L35(L20,R8),OVERFLW                             @XA19168 54500001
         B     RETURN                                                   54550002
TYPREC4  MVC   L35(L20,R8),OFFEOD  ASSUME OFFLINE/EOD RECORD   @XA19168 54600001
         B     RETURN                                                   54650002
ENTRIES  DS    0F                                                       54700002
         DC    XL4'00000000'            FORMAT1                         54750002
         DC    XL4'00000000'            FORMAT2                         54800002
         DC    A(LABELS)                LABEL PTR                       54850002
         DC    H'0'                     DISP                            54900002
         LINE                                                           54910002
         ROUTINE CLASSRC,CKTYPE                                @M04AE95 54920002
         LABEL ''                                              @M04AE95 54930002
***   SKIP TO CHANNEL 1                                                 54950002
         LINE  SKIP=E                                                   55000002
         LABEL ''                                                       55050002
         LINE  (35,84),(1,76),SKIP=0                                    55100002
         ROUTINE RECTYP,TYPREC                                          55150002
         ROUTINE SYSREL,CONVREL                                         55200002
         LABEL '---RECORD TYPE - PREDICTOR SENSE -                     X55250002
                    MODEL ','SERIAL NO.                       XXXX REL' 55300001
         LINE  (67,21),(1,35),SKIP=2                           @M04AE95 55320001
         HEX   MODEL,0,2B                                               55400002
         HEX   CPUSER,0,3B                                              55450002
         LABEL ''                                                       55500002
LINE0S   LINE  (23,1),(1,30),SKIP=0                            @XA20899 55850001
         HEX   XCUA,0,2B                                                55900002
LAB0S    LABEL 'CHANNEL/UNIT ADDRESS','DEVICE TYPE  3895'      @XA19168 55950001
         LINE  (1,1),(63,23),SKIP=0                            @XA20899 55955001
         LABEL 'DAY YEAR','HH MM SS.TH'                        @XA20899 55960001
         LINE  (1,1),(100),SKIP=1                              @XA20899 55965001
         ROUTINE RECTYP,CHKERROR                               @XA20899 55970001
         LABEL '             '                                 @XA20899 55975001
         LINE  (63,23),(57,23),SKIP=2                          @XA20899 55980001
         ROUTINE DAY,SETDATE                                   @XA20899 55985001
         HEX   TIME,1,4B                                       @XA20899 55990001
         LABEL  'DATE','TIME'                                  @XA20899 55995001
         LINE  (1,1),(1,28),SKIP=1                             @M04AE95 56000002
         LABEL '--OPERATIONS-----------',                      @M04AE95*56010002
               '--MICR 1 PERFORMANCE---',                      @M04AE95*56020002
               '--MICR 2 PERFORMANCE---',                      @M04AE95*56050002
               '--FE COUNTERS----------'                       @M04AE95 56070002
         LINE  (19,28),(1,28),SKIP=1                           @XA20899 56100001
         CONVT TWOBYT0,2,5                                     @M04AE95 56110002
         CONVT TWOBYT32,2,5                                    @M04AE95 56120002
         CONVT TWOBYT40,2,5                                    @M04AE95 56150002
         CONVT TWOBYT44,2,5                                    @M04AE95 56170002
         LABEL 'TOTAL DOCS','AMT PRES, INVLD',                 @M04AE95*56200002
               'ERROR DOCS','COUNTER 1, LOC 88'                @XA20891 56210001
         LINE  (19,28),(1,28),SKIP=1                           @XA20891 56220001
         CONVT TWOBYT1,2,5                                     @M04AE95 56250002
         CONVT TWOBYT33,2,5                                    @M04AE95 56270002
         CONVT TWOBYT41,2,5                                    @M04AE95 56300002
         CONVT TWOBYT45,2,5                                    @M04AE95 56310002
         LABEL 'MERGE DOCS','TPC PRES, INVLD',                 @M04AE95*56320002
               'EARLY START','COUNTER 2, LOC 90'               @XA20891 56350001
         LINE  (19,28),(1,28),SKIP=1                           @XA20891 56360001
         CONVT TWOBYT2,2,5                                     @M04AE95 56400002
         CONVT TWOBYT34,2,5                                    @M04AE95 56410002
         CONVT TWOBYT42,2,5                                    @M04AE95 56420002
         CONVT TWOBYT46,2,5                                    @M04AE95 56450002
         LABEL 'DOCS INSCRIBED','ACT PRES, INVLD',             @M04AE95*56470002
               'SHORT TERM ERR','COUNTER 3, LOC 92'            @XA20891 56500001
         LINE  (19,28),(1,28),SKIP=1                           @XA20891 56506001
         CONVT TWOBYT3,2,5                                     @M04AE95 56520002
         CONVT TWOBYT35,2,5                                    @M04AE95 56550002
         CONVT TWOBYT43,2,5                                    @M04AE95 56570002
         CONVT TWOBYT47,2,5                                    @M04AE95 56600002
         LABEL 'SEC FLD INSCRIBES','TNF PRES, INVLD',          @M04AE95*56610002
               'LONG TERM ERR','COUNTER 4, LOC 94'             @XA20891 56620001
         LINE  (19,28),(1,28),SKIP=1                           @XA20899 56630001
         CONVT TWOBYT4,2,5                                     @M04AE95 56670002
         CONVT TWOBYT36,2,5                                    @M04AE95 56700002
         LABEL 'EXTENDED PRINTS','AUX PRES, INVLD'             @XA20890 56710001
         LINE  (19,28),(1,28),SKIP=1                           @XA20899 56720001
         CONVT TWOBYT5,2,5                                     @M04AE95 56750002
         CONVT TWOBYT37,2,5                                    @M04AE95 56770002
         LABEL 'LATE STOP','PEAK ERR','--ELECTRONIC DSF/IDENTICAL AMOUN*56800001
               T------------------'                            @XA20897 56803001
         LINE  (19,28),(1,28),SKIP=1                           @M04AE95 56810002
         CONVT TWOBYT6,2,5                                     @M04AE95 56820002
         CONVT TWOBYT38,2,5                                    @M04AE95 56850002
         CONVT TWOBYT48,2,5                                    @XA20899 56870001
         CONVT TWOBYT49,2,5                                    @XA20899 56877001
         LABEL 'INCREMENT','CONFLICT','EDSF HEADER DOCS','CHECKS/EDSF'  56884001
         LINE  (19,28),(1,28),SKIP=2                           @M04AE95 56900002
         CONVT TWOBYT7,2,5                                     @M04AE95 56910002
         CONVT TWOBYT39,2,5                                    @M04AE95 56920002
         CONVT TWOBYT50,2,5                                    @XA20899 56950001
         CONVT TWOBYT51,2,5                                    @XA20899 56954001
         LABEL 'LATE CPU RESP','RESERVED','ACPTS/EDSF',        @XA20891*56958001
               'CHECKS/IDENT AMT'                              @XA20899 56962001
         LINE  ,(1),SKIP=1                                     @M04AE95 56970002
         LABEL '--OCR PERFORMANCE--------------------------------------*57500002
               ----------------------------------------------------'    57520002
         LINE  (19,28),(1,28),SKIP=1                           @M04AE95 57550002
         CONVT TWOBYT8,2,5                                     @M04AE95 57570002
         CONVT TWOBYT9,2,5                                     @M04AE95 57600002
         CONVT TWOBYT10,2,5                                    @M04AE95 57610002
         CONVT TWOBYT11,2,5                                    @M04AE95 57620002
         LABEL 'CASH TICKET','ADD MACH TAPE',                  @M04AE95*57650002
               'FIX ENT DEP SLIP','CASH CHECK TRANS'           @M04AE95 57670002
         LINE  (19,28),(1,28),SKIP=1                           @M04AE95 57700002
         CONVT TWOBYT12,2,5                                    @M04AE95 57710002
         CONVT TWOBYT13,2,5                                    @M04AE95 57720002
         CONVT TWOBYT14,2,5                                    @M04AE95 57750002
         CONVT TWOBYT15,2,5                                    @M04AE95 57770002
         LABEL 'DIH MATCH','BAR CODES','BUSNS DEP SLIP',       @M04AE95*57800002
               'PERS DEP SLIP'                                 @M04AE95 57810002
         LINE  (19,28),(1,28),SKIP=1                           @M04AE95 57820002
         CONVT TWOBYT16,2,5                                    @M04AE95 57850002
         CONVT TWOBYT17,2,5                                    @M04AE95 57870002
         CONVT TWOBYT18,2,5                                    @M04AE95 57900002
         CONVT TWOBYT19,2,5                                    @M04AE95 57910002
         LABEL 'ACPTS/DEP SLIP','CHECKS/DEP SLIP',             @XA20891*57920001
               'CHECKS/AM TAPE','OCR1 VLD ON CHECK'            @XA20891 57930001
         LINE  (19,28),(1,28),SKIP=1                           @M04AE95 57970002
         CONVT TWOBYT20,2,5                                    @M04AE95 58000002
         CONVT TWOBYT21,2,5                                    @M04AE95 58010002
         CONVT TWOBYT22,2,5                                    @M04AE95 58020002
         CONVT TWOBYT23,2,5                                    @M04AE95 58050002
         LABEL 'OCR3 VLD ON CHECK','BUSNS CHECK',              @XA20891*58070001
               'BUSNS CHECK FTF','BUSNS CHECK FGR'             @M04AE95 58100002
         LINE  (19,28),(1,28),SKIP=1                           @M04AE95 58110002
         CONVT TWOBYT24,2,5                                    @M04AE95 58120002
         CONVT TWOBYT25,2,5                                    @M04AE95 58150002
         CONVT TWOBYT26,2,5                                    @M04AE95 58170002
         CONVT TWOBYT27,2,5                                    @M04AE95 58200002
         LABEL 'PERS CHECK','PERS CHECK FTF',                  @M04AE95*58210002
               'PERS CHECK FGR','DOC STOP RJCT'                @M04AE95 58220002
         LINE  (19,28),(1,28),SKIP=2                           @M04AE95 58250002
         CONVT TWOBYT28,2,5                                    @M04AE95 58270002
         CONVT TWOBYT29,2,5                                    @M04AE95 58300002
         CONVT TWOBYT30,2,5                                    @M04AE95 58310002
         CONVT TWOBYT31,2,5                                    @M04AE95 58320002
         LABEL 'CLIP LVL X-HIGH','CLIP LVL HIGH',              @M04AE95*58350002
               'CLIP LVL MEDIUM','CLIP LVL LOW'                @M04AE95 58370002
         LINE  (105),(1,84),SKIP=1                             @XA20899 58400001
         CONVT ONEBYT74,1,3                                    @XA20899 58450001
         LABEL '--JAMS/STOPS, DEGRADATION-------','ABORTED DOCS'        58500001
         LINE  ,(15),SKIP=1                                    @XA20899 58550001
         LABEL 'DOC LATE   DEGRADE'                            @XA20899 58600001
         LINE  (17,11),(1,37),SKIP=1                           @XA20899 58650001
         CONVT ONEBYT0,1,3                                     @XA20899 58700001
         CONVT ONEBYT14,1,3                                    @XA20899 58750001
         LABEL 'ALIGNER DS',                                   @M04AE95*59000001
               '--COMMON CHANNEL ERRORS--------------------------------*59006001
               ------------------------'                       @XA20899 59012001
         LINE  (17,11),(1,37),SKIP=1                           @XA20899 59032001
         CONVT ONEBYT1,1,3                                     @XA20899 59052001
         CONVT ONEBYT15,1,3                                    @XA20899 59072001
         LABEL 'MICR 1 DS','ERROR UNIT       CHANNEL RUN CTL  MICR     *59092001
               DIH   INS/PRT  RECO    MFILM   RSRVD'           @XA20891 59112001
         LINE  (17,11),(1,37),SKIP=0                           @XA20899 59132001
         CONVT ONEBYT2,1,3                                     @XA20899 59152001
         CONVT ONEBYT16,1,3                                    @XA20899 59172001
         LABEL 'PRESCAN DS','NON-SELECT CHK'                   @XA20899 59192001
         LINE  (57,8),,SKIP=1                                  @XA20899 59212001
         CONVT ONEBYT26,1,3                                    @XA20899 59232001
         CONVT ONEBYT27,1,3                                    @XA20899 59252001
         CONVT ONEBYT28,1,3                                    @XA20899 59272001
         CONVT ONEBYT29,1,3                                    @XA20899 59292001
         CONVT ONEBYT30,1,3                                    @XA20899 59312001
         CONVT ONEBYT31,1,3                                    @XA20899 59332001
         CONVT ONEBYT32,1,3                                    @XA20899 59352001
         CONVT ONEBYT33,1,3                                    @XA20899 59372001
         LABEL ''                                              @XA20899 59392001
         LINE  (28),(1,37),SKIP=0                              @XA20899 59412001
         CONVT ONEBYT17,1,3                                    @XA20899 59432001
         LABEL 'MERGE DS        ---','GET DATA CHK'            @XA20899 59452001
         LINE  (57,8),,SKIP=1                                  @XA20899 59472001
         CONVT ONEBYT34,1,3                                    @XA20899 59492001
         CONVT ONEBYT35,1,3                                    @XA20899 59512001
         CONVT ONEBYT36,1,3                                    @XA20899 59532001
         CONVT ONEBYT37,1,3                                    @XA20899 59552001
         CONVT ONEBYT38,1,3                                    @XA20899 59572001
         CONVT ONEBYT39,1,3                                    @XA20899 59592001
         CONVT ONEBYT40,1,3                                    @XA20899 59612001
         CONVT ONEBYT41,1,3                                    @XA20899 59632001
         LABEL ''                                              @XA20899 59652001
         LINE  (28),(1,37),SKIP=0                              @XA20899 59672001
         CONVT ONEBYT18,1,3                                    @XA20899 59692001
         LABEL 'SCAN DS         ---','PUT DATA CHK'            @XA20899 59712001
         LINE  (57,8),,SKIP=1                                  @XA20899 59732001
         CONVT ONEBYT42,1,3                                    @XA20899 59752001
         CONVT ONEBYT43,1,3                                    @XA20899 59772001
         CONVT ONEBYT44,1,3                                    @XA20899 59792001
         CONVT ONEBYT45,1,3                                    @XA20899 59812001
         CONVT ONEBYT46,1,3                                    @XA20899 59832001
         CONVT ONEBYT47,1,3                                    @XA20899 59852001
         CONVT ONEBYT48,1,3                                    @XA20899 59872001
         CONVT ONEBYT49,1,3                                    @XA20899 59892001
         LABEL ''                                              @XA20899 59912001
         LINE  (17),(1,27),SKIP=0                              @XA20899 59932001
         CONVT ONEBYT3,1,3                                     @XA20899 59952001
         LABEL 'SCAN DS, PRIM','---       TAG CHK'             @XA20891 59972001
         LINE  (57,8),,SKIP=1                                  @XA20899 59992001
         CONVT ONEBYT50,1,3                                    @XA20899 60012001
         CONVT ONEBYT51,1,3                                    @XA20899 60032001
         CONVT ONEBYT52,1,3                                    @XA20899 60052001
         CONVT ONEBYT53,1,3                                    @XA20899 60072001
         CONVT ONEBYT54,1,3                                    @XA20899 60092001
         CONVT ONEBYT55,1,3                                    @XA20899 60112001
         CONVT ONEBYT56,1,3                                    @XA20899 60132001
         CONVT ONEBYT57,1,3                                    @XA20899 60152001
         LABEL ''                                              @XA20899 60172001
         LINE  (17),(1,27),SKIP=0                              @XA20899 60192001
         CONVT ONEBYT4,1,3                                     @XA20899 60212001
         LABEL 'SCAN DS, MERGE','---       SELECT CHK'         @XA20891 60232001
         LINE  (57,8),,SKIP=1                                  @XA20899 60252001
         CONVT ONEBYT58,1,3                                    @XA20899 60272001
         CONVT ONEBYT59,1,3                                    @XA20899 60292001
         CONVT ONEBYT60,1,3                                    @XA20899 60312001
         CONVT ONEBYT61,1,3                                    @XA20899 60332001
         CONVT ONEBYT62,1,3                                    @XA20899 60352001
         CONVT ONEBYT63,1,3                                    @XA20899 60372001
         CONVT ONEBYT64,1,3                                    @XA20899 60392001
         CONVT ONEBYT65,1,3                                    @XA20899 60412001
         LABEL ''                                              @XA20899 60432001
         LINE  (17,11),(1,37),SKIP=0                           @XA20899 60452001
         CONVT ONEBYT5,1,3                                     @XA20899 60472001
         CONVT ONEBYT19,1,3                                    @XA20899 60492001
         LABEL 'PRE-INSCRIBE DS','ADDR CHK'                    @XA20899 60512001
         LINE  (57,8),,SKIP=1                                  @XA20899 60532001
         CONVT ONEBYT66,1,3                                    @XA20899 60552001
         CONVT ONEBYT67,1,3                                    @XA20899 60572001
         CONVT ONEBYT68,1,3                                    @XA20899 60592001
         CONVT ONEBYT69,1,3                                    @XA20899 60612001
         CONVT ONEBYT70,1,3                                    @XA20899 60632001
         CONVT ONEBYT71,1,3                                    @XA20899 60652001
         CONVT ONEBYT72,1,3                                    @XA20899 60672001
         CONVT ONEBYT73,1,3                                    @XA20899 60692001
         LABEL ''                                              @XA20899 60712001
         LINE  (17,11),(1),SKIP=1                              @XA20899 60732001
         CONVT ONEBYT6,1,3                                     @XA20899 60752001
         CONVT ONEBYT20,1,3                                    @XA20899 60772001
         LABEL 'INSCRIBE DS'                                   @XA20899 60792001
         LINE  (17,11),(1,37),SKIP=1                           @XA20899 60812001
         CONVT ONEBYT7,1,3                                     @XA20899 60832001
         CONVT ONEBYT21,1,3                                    @XA20899 60852001
         LABEL 'MICR 2 DS','--VIDEO ERRORS-------     --RECO ERRORS----*60872001
               ----     --DIH ERRORS---------'                 @XA20899 60892001
         LINE  (17,11),(1),SKIP=0                              @XA20899 60912001
         CONVT ONEBYT8,1,3                                     @XA20899 60932001
         CONVT ONEBYT22,1,3                                    @XA20899 60952001
         LABEL '1ST BAY DS'                                    @XA20899 60972001
         LINE  (56,26),(38,26),SKIP=1                          @XA20899 60992001
         CONVT ONEBYT75,1,3                                    @XA20899 61012001
         CONVT ONEBYT85,1,3                                    @XA20899 61032001
         CONVT ONEBYT90,1,3                                    @XA20899 61052001
         LABEL 'SCF ON DEP DOC','MCS PRTY CHK','M-BUFR PRTY CHK'        61072001
         LINE  (17,11),(1),SKIP=0                              @XA20899 61092001
         CONVT ONEBYT9,1,3                                     @XA20899 61112001
         CONVT ONEBYT23,1,3                                    @XA20899 61132001
         LABEL '2ND BAY DS'                                    @XA20899 61152001
         LINE  (56,26),(38,26),SKIP=1                          @XA20899 61172001
         CONVT ONEBYT76,1,3                                    @XA20899 61192001
         CONVT ONEBYT86,1,3                                    @XA20899 61212001
         CONVT ONEBYT91,1,3                                    @XA20899 61232001
         LABEL 'SCF ON CHECK','MCS HANG CHK','M-BUFR ADDR CHK' @XA20899 61252001
         LINE  (28),(1),SKIP=0                                 @XA20899 61272001
         CONVT ONEBYT24,1,3                                    @XA20899 61292001
         LABEL 'MFILM RESYNC DS ---'                           @XA20899 61312001
         LINE  (56,26),(38,26),SKIP=1                          @XA20899 61332001
         CONVT ONEBYT77,1,3                                    @XA20899 61352001
         CONVT ONEBYT87,1,3                                    @XA20899 61372001
         CONVT ONEBYT92,1,3                                    @XA20899 61392001
         LABEL 'ROTATION ERR','INVLD OP CODE','CMP ST PRTY CHK'         61412001
         LINE  (28),(1),SKIP=0                                 @XA20899 61432001
         CONVT ONEBYT25,1,3                                    @XA20899 61452001
         LABEL 'MFILM EXIT DS   ---'                           @XA20899 61472001
         LINE  (56,26),(38,26),SKIP=1                          @XA20899 61492001
         CONVT ONEBYT78,1,3                                    @XA20899 61512001
         CONVT ONEBYT88,1,3                                    @XA20899 61532001
         CONVT ONEBYT93,1,3                                    @XA20899 61552001
         LABEL 'WINDOW OVRSCN','VIS ADDR CHK','CMP ST ADDR CHK'         61572001
         LINE  (21),(1),SKIP=0                                 @XA20899 61592001
         CONVT ONEBYT10,1,3                                    @XA20899 61612001
         LABEL 'STCKR SWTCH JAM'                               @XA20899 61632001
         LINE  (56,26),(38,26),SKIP=1                          @XA20899 61652001
         CONVT ONEBYT79,1,3                                    @XA20899 61672001
         CONVT ONEBYT89,1,3                                    @XA20899 61692001
         CONVT ONEBYT94,1,3                                    @XA20899 61712001
         LABEL 'RTS, NO TRACE','RESERVED','PROGRAM CHK'        @XA20899 61732001
         LINE  (21),(1),SKIP=0                                 @XA20899 61752001
         CONVT ONEBYT11,1,3                                    @XA20899 61772001
         LABEL 'STUB/LNG DOC STOP'                             @XA20899 61792001
         LINE  (56,52),(38,52),SKIP=1                          @XA20899 61812001
         CONVT ONEBYT80,1,3                                    @XA20899 61832001
         CONVT ONEBYT95,1,3                                    @XA20899 61852001
         LABEL 'BEAM NOT MVNG','TIME-OUT ERR'                  @XA20899 61872001
         LINE  (21),(1),SKIP=0                                 @XA20899 61892001
         CONVT ONEBYT12,1,3                                    @XA20899 61912001
         LABEL 'MICR RIBBON STOP'                              @XA20899 61932001
         LINE  (56,52),(38,26),SKIP=1                          @XA20899 61952001
         CONVT ONEBYT81,1,3                                    @XA20899 61972001
         CONVT ONEBYT96,1,3                                    @XA20899 61992001
         LABEL 'READ DATA CHK','--MICROFILM ERRORS---','DCS SPEC ERR'   62012001
         LINE  (21),(1),SKIP=0                                 @XA20899 62032001
         CONVT ONEBYT13,1,3                                    @XA20899 62052001
         LABEL 'MFILM JAM'                                     @XA20899 62072001
         LINE  (56,26),(38,26),SKIP=1                          @XA20899 62092001
         CONVT ONEBYT82,1,3                                    @XA20899 62112001
         CONVT O1BYT103,1,3                                    @XA20899 62132001
         CONVT O1BYT97,1,3                                     @XA20899 62152001
         LABEL 'WRITE DATA CHK','FILM CHK','RESERVED'          @XA20899 62172001
         LINE  (56,26),(38,26),SKIP=1                          @XA20899 62192001
         CONVT ONEBYT83,1,3                                    @XA20899 62212001
         CONVT O1BYT104,1,3                                    @XA20899 62232001
         LABEL 'LOW DOC PMT I','CAPSTAN CHK'                   @XA20899 62252001
         LINE  (56,26),(38,26),SKIP=1                          @XA20899 62272001
         CONVT ONEBYT84,1,3                                    @XA20899 62292001
         CONVT O1BYT105,1,3                                    @XA20899 62312001
         LABEL 'LOW CRT PMT I','SHUTTER CHK','--MICR ERRORS--------'    62332001
         LINE  (108),(90),SKIP=1                               @XA20899 62352001
         CONVT O1BYT102,1,3                                    @XA20899 62372001
         LABEL 'BUFR PRTY CHK'                                 @XA20899 62392001
         LINE  ,(1,63),SKIP=1                                  @XA20899 62412001
         LABEL '---OTHER COUNTERS----------------------------------',  *62432001
               '--OTHER ERRORS-------'                         @XA20899 62452001
         LINE  (19,28),(1,28),SKIP=0                           @XA20899 62472001
         CONVT TWOBYT52,2,5                                    @XA20899 62492001
         CONVT TWOBYT53,2,5                                    @XA20899 62512001
         LABEL 'LOC 104','LOC 106'                             @XA20899 62532001
         LINE  (82,28),(64,28),SKIP=1                          @XA20899 62552001
         CONVT O1BYT106,1,3                                    @XA20899 62572001
         LABEL 'LOC 232','--INSCR/PRTR ERRORS--'               @XA20899 62592001
         LINE  (19,28),(1,28),SKIP=0                           @XA20899 62612001
         CONVT TWOBYT54,2,5                                    @XA20899 62632001
         CONVT TWOBYT55,2,5                                    @XA20899 62652001
         LABEL 'LOC 108','LOC 110'                             @XA20899 62672001
         LINE  (82,28),(64,28),SKIP=1                          @XA20899 62692001
         CONVT O1BYT107,1,3                                    @XA20899 62712001
         CONVT O1BYT98,1,3                                     @XA20899 62732001
         LABEL 'LOC 233','INVLD CHAR'                          @XA20899 62752001
         LINE  (19,28),(1,28),SKIP=0                           @XA20899 62772001
         CONVT TWOBYT56,2,5                                    @XA20899 62792001
         CONVT TWOBYT57,2,5                                    @XA20899 62812001
         LABEL 'LOC 112','LOC 114'                             @XA20899 62832001
         LINE  (82,28),(64,28),SKIP=1                          @XA20899 62852001
         CONVT O1BYT108,1,3                                    @XA20899 62872001
         CONVT O1BYT99,1,3                                     @XA20899 62892001
         LABEL 'LOC 234','CONTROL ERR'                         @XA20899 62912001
         LINE  (19,28),(1,28),SKIP=0                           @XA20899 62932001
         CONVT TWOBYT58,2,5                                    @XA20899 62952001
         CONVT TWOBYT59,2,5                                    @XA20899 62972001
         LABEL 'LOC 116','LOC 118'                             @XA20899 62992001
         LINE  (82,28),(64,28),SKIP=1                          @XA20899 63012001
         CONVT O1BYT109,1,3                                    @XA20899 63032001
         CONVT O1BYT100,1,3                                    @XA20899 63052001
         LABEL 'LOC 235','BUFR PRTY CHK'                       @XA20899 63072001
         LINE  (19,28),(1,28),SKIP=0                           @XA20899 63092001
         CONVT TWOBYT60,2,5                                    @XA20899 63112001
         CONVT TWOBYT61,2,5                                    @XA20899 63132001
         LABEL 'LOC 120','LOC 122'                             @XA20899 63152001
         LINE  (82,28),(64,28),SKIP=1                          @XA20899 63172001
         CONVT O1BYT110,1,3                                    @XA20899 63192001
         CONVT O1BYT101,1,3                                    @XA20899 63212001
         LABEL 'LOC 236','BUFR ADDR CHK'                       @XA20899 63232001
         LINE  (19,63),(1,63),SKIP=1                           @XA20899 63252001
         CONVT TWOBYT62,2,5                                    @XA20899 63272001
         CONVT O1BYT111,1,3                                    @XA20899 63292001
         LABEL 'LOC 124','LOC 237'                             @XA20899 63312001
         LINE  ,(1,1)                                                   64250002
         LABEL ' '                                                      64300002
         DC    X'FF'                                                    64350002
         DC    X'0090'                                                  64400002
         DC    X'0018'                                                  64450002
         DC    X'0000'                                                  64500002
LABELS   DS    0F                                                       64550002
         LSTART                                                         64600002
         END                                                            64650002
