         TITLE 'IFCEXXXH - 3895 EDIT TABLE - ALIAS IFCE3895'            00050002
* ** THIS MODULE IS ENTIRELY IN SUPPORT OF CODE G30HIMD  ****           00100002
**** IT IS APPLICABLE FOR VS1 W/ SU01, MVS W/ SU27 AND AS SVS ICR ****  00150002
         SPACE 2                                                        00200002
         MACRO                                                          00250002
         BIN   ,                                                        00300002
.*                                 &SYSLIST(&OP,1) - NAME OF LOG ITEM   00350002
.*                                      RECORD DSECT                    00400002
.*                                 $SYSLIST(&OP,2) - NBR OF SPACES      00450002
.*                                      TO SKIP ON MULTIPLE             00500002
.*                                      PRINT OR NBR OF SPACES          00550002
.*                                      TO BACK UP FROM COLUMN FOR      00600002
.*                                      START OF PRINTING. THE LETTER   00650002
.*                                      B PRECEEDS THE NUMBER (B5) IF   00700002
.*                                      THE LATTER IS DESIRED. OMISSION 00750002
.*                                      OF THIS OPERAND FORCES OPTION 2 00800002
.*                                      WITH BACKUP SPACING EQUAL TO    00850002
.*                                 THE NUMBER OF BITS IN THE ITEM       00900002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      00950002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     01000002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       01050002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             01100002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  01150002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  01200002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              01250002
         GBLA  &NRENTS,&SHIFT(3000)                                     01300002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           01350002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       01400002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         01450002
         LCLB  &B,&SUB                                                  01500002
         LCLA  &IBITS,&ISHIFT,&K                                        01550002
         LCLA  &TEMP,&T,&OP                                             01600002
         LCLC  &S,&ARG                                                  01650002
          ACTR  500000                                                  01700002
         AIF   (&DIAGTST EQ 0).NOMSG                                    01750002
         AIF   (&INITIAL EQ 0).NOMSG                                    01800002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    01850002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  01900002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     01950002
*        LINE                                                           02000002
         LINE                                                           02050002
.NOMSG   ANOP                                                           02100002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  02150002
&SUB     SETB  1                                                        02200002
.LOOP    ANOP                                                           02250002
&OP      SETA  &OP+1                                                    02300002
&ARG     SETC  '&SYSLIST(&OP,1)'                                        02350002
         ITEMFIND &ARG                                                  02400002
         AIF   (&ITEMXPT EQ 0).MEXIT                                    02450002
&ISHIFT  SETA  &SHIFT(&ITEMXPT)                                         02500002
&IBITS   SETA  &BITS(&ITEMXPT)                                          02550002
         AIF   (&SUB EQ 1).SUB00                                        02600002
         AIF   ('&SYSLIST(3)' EQ '').SETT                               02650002
&IBITS   SETA  &SYSLIST(3)                                              02700002
         AGO   .SETT                                                    02750002
.SUB00   AIF   ('&SYSLIST(&OP,3)' EQ '').SETT                           02800002
&IBITS   SETA  &SYSLIST(&OP,3)                                          02850002
.SETT    ANOP                                                           02900002
&T       SETA  &IBITS-1                                                 02950002
&B       SETB  0                                                        03000002
         AIF   (&IBITS GT 0 AND &IBITS LT 16).SUB0                      03050002
         MNOTE '**NO. OF BITS OUTSIDE RANGE OF 1-15**'                  03100002
.MEXIT   MEXIT                                                          03150002
.SUB0    AIF   (&SUB EQ 1).SUBA                                         03200002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             03250002
&K       SETA  K'&SYSLIST(2)                                            03300002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              03350002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                03400002
         AGO   .SUBB                                                    03450002
.SUBA    ANOP                                                           03500002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         03550002
&K       SETA  K'&SYSLIST(&OP,2)                                        03600002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          03650002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            03700002
.SUBB    ANOP                                                           03750002
&T       SETA  &S                                                       03800002
.BACKUP  ANOP                                                           03850002
&NRENTS  SETA  &NRENTS+1                                                03900002
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                            03950002
&TEMP    SETA  &ISHIFT                                                  04000002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'                04050002
         AGO   .OUT                                                     04100002
         AIF   (&SUB EQ 1).BIN2                                         04150002
         AIF   ('&SYSLIST(2)' NE '').BIN3                               04200002
         AGO   .BIN2A                                                   04250002
.BIN2    AIF   ('&SYSLIST(&OP,2)' NE '').BIN3                           04300002
.BIN2A   ANOP                                                           04350002
&B       SETB  1                                                        04400002
.BIN3    ANOP                                                           04450002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'                    04500002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             04550002
.OUT     ANOP                                                           04600002
&ITEMXPT     SETA  0                                                    04650002
         AIF   (&SUB EQ 0).OUTA                                         04700002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 04750002
.OUTA    ANOP                                                           04800002
         MEND                                                           04850002
         MACRO                                                          04900002
&NAME    DSGEN ,                                                        04950002
.*                            THIS MACRO GENERATES ONE DSECT WORD       05000002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 05050002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  05100002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    05150002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 05200002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   05250002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 05300002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      05350002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  05400002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    05450002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   05500002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             05550002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  05600002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  05650002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              05700002
         GBLA  &NRENTS,&SHIFT(3000)                                     05750002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           05800002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       05850002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         05900002
         LCLB  &ONLY1,&CTIND                                            05950002
         LCLA  &START1,&START2,&END1,&END2                              06000002
         LCLC  &SYMBOL,&EQUSYM                                          06050002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 06100002
         ACTR  100000                                                   06150002
         AIF   (&ITEMITR EQ 0).START                                    06200002
 MNOTE   20,'DSGEN MACRO OCCURRS AFTER ITEMSORT MACRO HAS BEEN ISSUED.' 06250002
         MEXIT                                                          06300002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            06350002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     06400002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   06450002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        06500002
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1            06550002
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT             06600002
         AGO   .SET2A                   BRANCH AROUND                   06650002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        06700002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              06750002
         MEXIT                                                          06800002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X06850002
               ).SET2                   TEST FOR NO SECOND              06900002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   06950002
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2            07000002
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2              07050002
         AGO   .LOOP                                                    07100002
.SET2    ANOP                                                           07150002
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 07200002
         AGO   .LOOP                                                    07250002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             07300002
         MEXIT                                                          07350002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               07400002
         MEXIT                                                          07450002
.LOOP    ANOP                                                           07500002
&OP      SETA  &OP+1                                                    07550002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           07600002
&ITEMNBR SETA  &ITEMNBR+1                                               07650002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            07700002
         MNOTE '**NULL BIT COUNT FIELD**'                               07750002
         MEXIT                                                          07800002
.OK1     ANOP                                                           07850002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        07900002
         AIF   ('&SYMBOL' NE '').OK                                     07950002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         08000002
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                         08050002
         AGO   .START                   GET NEXT                        08100002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        08150002
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU          08200002
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        08250002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         08300002
         AGO   .NO3                     BRANCH AROUND                   08350002
.OK2     ANOP                                                           08400002
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED              08450002
.NO3     ANOP                                                           08500002
&SYMBOL  EQU   *+&BYTE                                                  08550002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL             08600002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    08650002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    08700002
.CNT     ANOP                                                           08750002
&CTIND   SETB  1                        SET COUNT INDICATOR             08800002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   08850002
&BYTE    SETA  &COUNT/8                                                 08900002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        08950002
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        09000002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             09050002
&END1    SETA  &END1+1                  INCREMENT COUNT                 09100002
&OP      SETA  &OP-1                    DECREMENT INCREMENT             09150002
         AGO   .LOOP                    GENERATE NEXT                   09200002
.TSTST   ANOP                                                           09250002
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END               09300002
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        09350002
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      09400002
.NSET1   ANOP                                                           09450002
&OP      SETA  &OP-1                    DECREMENT INDEX                 09500002
&START1  SETA  &START1+1                INCREMENT FIRST COUNT           09550002
         AGO   .LOOP                    GO DO NEXT                      09600002
.LPDONE  ANOP                                                           09650002
&ONLY1   SETB  0                        CLEAR INDICATOR                 09700002
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      09750002
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 09800002
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT               09850002
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES             09900002
&NAME    DS    &COUNT.C                                                 09950002
.END     MEXIT                                                          10000002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          10050002
         MEXIT                                                          10100002
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   10150002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   10200002
         MEXIT                                                          10250002
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         10300002
*****               THE FOLLOWING STATEMENT                *****        10350002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        10400002
.EQU2    ANOP                                                           10450002
&EQUCNT  SETA  0                        CLEAR COUNTER                   10500002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND                 10550002
.EQULOP  ANOP                                                           10600002
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX                 10650002
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     10700002
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?                10750002
         AGO   .EQULOP                  NO-GET NEXT                     10800002
.EQUOUT  ANOP                                                           10850002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME                  10900002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS              10950002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT                 11000002
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED             11050002
         AGO   .START                   RETURN FOR NEXT                 11100002
         MEND                                                           11150002
         MACRO                                                          11200002
         CONVT ,                                                        11250002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             11300002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  11350002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  11400002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              11450002
         GBLA  &NRENTS,&SHIFT(3000)                                     11500002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           11550002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       11600002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         11650002
         LCLB  &SUB                                                     11700002
         LCLA  &OP                                                      11750002
         LCLA  &OFFSET,&OUT,&IN,&IND,&IBITS,&ISHIFT                     11800002
.*                                                                      11850002
.*       CONVERT BINARY TO DECIMAL                                      11900002
.*             &NAME IS THE REFERENCE INTO THE DSECT RECORD             11950002
.*             &OUT    IS THE NUMBER OF CHARS TO BE PUT ONTO PRINT LINE 12000002
.*                                      DEFAULT IS FOUR MAXIMUM IS 8    12050002
.*             &IN       IS THE NUMBER OF BYTES AS INPUT                12100002
.*                                      ERROR DEFAULT IS 2 MAXIMUM IS 4 12150002
.*                                                                      12200002
         AIF   (&DIAGTST EQ 0).NOMSG                                    12250002
         AIF   (&INITIAL EQ 0).NOMSG                                    12300002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    12350002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  12400002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     12450002
*        LINE                                                           12500002
         LINE                                                           12550002
.NOMSG   ANOP                                                           12600002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LLOP                  12650002
&SUB     SETB  1                                                        12700002
.LLOP    ANOP                                                           12750002
&OP      SETA  &OP+1                                                    12800002
&OUT     SETA  4                        .BR NOT NULL ELSE SET TO 4      12850002
         AIF   (&SUB EQ 1).SUBA                                         12900002
         AIF   ('&SYSLIST(3)' EQ '').B  TEST FOR NULL INPUT             12950002
&OUT     SETA  &SYSLIST(3)             SET &OUT FROM INPUT              13000002
         AGO   .A                                                       13050002
.SUBA    AIF   ('&SYSLIST(&OP,3)' EQ '').B                              13100002
&OUT     SETA  &SYSLIST(&OP,3)          SET &OUT FROM INPUT             13150002
.A       AIF   (&OUT GT 0 AND &OUT LT 9).B   TEST RANGE                 13200002
.AERR    MNOTE '*** BYTES OUT INCORRECTLY SPECIFIED DEFAULT USED ***'   13250002
&OUT     SETA  4                                                        13300002
.B       AIF   (&SUB EQ 1).SUBB                                         13350002
         AIF   ('&SYSLIST(2)' EQ '').LOOP    BRANCH IF NULL             13400002
&IN      SETA  &SYSLIST(2)              .SET &IN FROM INPUT             13450002
         AGO   .BB                                                      13500002
.SUBB    AIF   ('&SYSLIST(&OP,2)' EQ '').LOOP                           13550002
&IN      SETA  &SYSLIST(&OP,2)          .SET &IN FROM INPUT             13600002
.BB      AIF   (&IN GT 0 AND &IN LT 5).D     TEST RANGE                 13650002
.BERR    MNOTE '*** BYTES IN INCORRECTLY SPECIFIED DEFAULT USED ***'    13700002
&IN      SETA  2                                                        13750002
         AGO   .D                                                       13800002
.LOOP    ANOP                           .LOOP TO FIND &NAME IN DSECT    13850002
&IND     SETA  &IND+1                   .SET UP LOOP COUNTER            13900002
         AIF   ('&ITEM(&IND)' EQ '&SYSLIST(&OP,1)').FOUND               13950002
         AIF   (&IND LT &ITEMNBR).LOOP  .TEST FOR END OF DSECT          14000002
         MNOTE '*** LOG ITEM NOT DEFINED ***'                           14050002
         MEXIT                                                          14100002
.FOUND   ANOP                                                           14150002
&IBITS   SETA  &BITS(&IND)              .SET UP NUMBER OF BITS SPEC     14200002
         AIF   (&IBITS-((&IBITS/8)*8) EQ 0).C  .TEST FOR MULTIPLE OF 8  14250002
         MNOTE '*** DATA NOT DEFINED A MULTIPLE OF 8 BITS ***'          14300002
         MEXIT                                                          14350002
.C       ANOP                                                           14400002
&IN      SETA  &IBITS/8                 .COMPUTE NUMBER OF BYTES        14450002
         AIF   (&IN LT 1 OR &IN GT 4).BERR  .TEST RANGE B IF IN ERROR   14500002
&ISHIFT  SETA  &SHIFT(&IND)             .SET UP FOR TEST OF BYTE BNDR   14550002
         AIF   (&ISHIFT EQ 0).D         .TEST FOR BYTE BNDRY            14600002
         MNOTE '*** DATA NOT ALIGNED ON A BYTE BOUNDARY ***'            14650002
         MEXIT                                                          14700002
.*                                                                      14750002
.D       ANOP                                                           14800002
&NRENTS  SETA  &NRENTS+1                                                14850002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),AL.4(9)                    14900002
         DC    X'&IN',X'&OUT'                                           14950002
&IND     SETA  0                                                        15000002
         AIF   (&SUB EQ 0).OUTA                                         15050002
         AIF   (&OP LT N'&SYSLIST).LLOP                                 15100002
.OUTA    ANOP                                                           15150002
         MEND                                                           15200002
         MACRO                                                          15250002
         ITEMFIND &ARG,&ITFDIAG=                                        15300002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             15350002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  15400002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  15450002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              15500002
         GBLA  &NRENTS,&SHIFT(3000)                                     15550002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           15600002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       15650002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         15700002
         LCLA  &A,&B,&X,&I                                              15750002
         LCLC  &C1,&C2,&S                                               15800002
         ACTR  100000                                                   15850002
&ITEMXPT SETA  0                  INDICATE ITEM NOT FOUND.              15900002
         AIF   ('&ARG' NE '').NORM                                      15950002
         AIF   ('&ITFDIAG' EQ 'OFF'  OR  '&ITFDIAG' EQ 'ON').DIAGSET    16000002
  MNOTE 0,'ITEMFIND - OPERAND (&ITFDIAG) INVALID FOR ITFDIAG KEYWORD.'  16050002
         MEXIT                                                          16100002
.DIAGSET ANOP                                                           16150002
&DIAGITF SETB  ('&ITFDIAG' EQ 'ON')                                     16200002
         MEXIT                                                          16250002
.NORM    AIF   (&ITEMITR GT 0).SORTED                                   16300002
         ITEMSORT                                                       16350002
.SORTED  ANOP                                                           16400002
&I       SETA  &ITEMITR           COMPUTED ITTERATION COUNT.            16450002
&X       SETA  &ITEMMDX           COMPUTED MAXIMUM INDEX.               16500002
&C1      SETC  '&ARG'             ISOLATE SEARCH ARGUMENT.              16550002
&C1      SETC  '&C1'.'       '(1,8-K'&C1) PAD TO FULL 8 CHARACTERS.     16600002
.SRCHUP  ANOP                                                           16650002
&A       SETA  &A+&X              CURRENT TABLE SUBSCRIPT + INDEX.      16700002
&S       SETC  '+'                                                      16750002
         AIF   (&A  GT &ITEMNBR  AND  NOT &DIAGITF).SRCHDN1             16800002
         AIF   (&A  LE &ITEMNBR).SRCH00                                 16850002
&C2      SETC  '*-OVER-*'                                               16900002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         16950002
&X       SETA  &X/2               HALVE INDEX VALUE.                    17000002
 MNOTE *,'&ARG - &C2   ITRCTR = &I   PTR = &A&S &X'                     17050002
         AIF   (&I GE 0).SRCHDWN  IF ITTERATION COUNT NOT EXPIRED.      17100002
.NOFIND  MNOTE  20,' ITEMFIND FAILED FOR NAME  &C1  '                   17150002
         MEXIT                                                          17200002
.SRCH00  ANOP                                                           17250002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         17300002
         AIF   (&I LT 0).NOFIND   IF COUNT HAS GONE TO ZERO.            17350002
&X       SETA  &X/2               HALVE INDEX VALUE.                    17400002
&B       SETA  &ITEMNDX(&A)       GET SUBSCRIPT FROM INDEX TABLE.       17450002
&C2      SETC  '&ITEM(&B)'.'       '(1,8-K'&ITEM(&B))  PAD COMPARAND.   17500002
         AIF   (NOT &DIAGITF).COMPARE                                   17550002
 MNOTE *,'&ARG - &C2   ITRCTR = &I   PTR = &A&S &X   POS = &B'          17600002
.COMPARE AIF   ('&C1' LT '&C2').SRCHDWN   ARGUMENT LOWER, MOVE DOWN.    17650002
         AIF   ('&C1' GT '&C2').SRCHUP    ARGUMENT HIGHER, MOVE UP.     17700002
&ITEMXPT SETA  &B                 FOUND. SET INDEX POINTER FOR RETURN.  17750002
&ITEMFST(&I+1)  SETA  &ITEMFST(&I+1)+1                                  17800002
         MEXIT                                                          17850002
.SRCHDWN ANOP                                                           17900002
&A       SETA  &A-&X              CURRENT POINTER MINUS INDEX VALUE.    17950002
&S       SETC  '-'                                                      18000002
         AIF   (&A LE &ITEMNBR).SRCH00    IF WITHIN BOUNDS OF TABLE.    18050002
.SRCHDN1 ANOP                                                           18100002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         18150002
&X       SETA  &X/2               HALVE INDEX VALUE.                    18200002
         AIF   (&I GE 0).SRCHDWN  IF ITTERATION COUNT NOT EXPIRED.      18250002
         MNOTE  20,' ITEMFIND FAILED FOR NAME  &C1  '                   18300002
         MEND                                                           18350002
         MACRO                                                          18400002
         ITEMSORT  &DUMMY                                               18450002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             18500002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  18550002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  18600002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              18650002
         GBLA  &NRENTS,&SHIFT(3000)                                     18700002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           18750002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       18800002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         18850002
         LCLA  &R,&ZI,&I,&A1,&A2,&TEMP                                  18900002
         LCLB  &SR,&GOTO,&TB                                            18950002
         LCLB   &SW(4000)                                               19000002
         LCLC  &C1,&C2                                                  19050002
         ACTR   200000                                                  19100002
&A1      SETA  0                                                        19150002
         AIF   (&ITEMITR EQ 0).LOOP0   TEST FOR RE-ENTRY.               19200002
 MNOTE   0,'ITEMSORT MACRO OCCURRS MORE THAN ONCE. TABLE NOT RESORTED.' 19250002
         MEXIT                                                          19300002
.LOOP0   ANOP                                                           19350002
&A1      SETA  &A1+1                                                    19400002
&ITEMNDX(&A1) SETA &A1                                                  19450002
         AIF   (&A1 LT &ITEMNBR).LOOP0                                  19500002
         AIF   (&ITEMNBR LT 2).MEXIT                                    19550002
&A1      SETA  &ITEMNBR/2         HALF OF TOTAL ENTRIES.                19600002
&A2      SETA  0                                                        19650002
.LOOP1   ANOP                                                           19700002
&A2      SETA  &A2+1                                                    19750002
&SW(&A2) SETB  1                  SET FIRST HALF OF SWITCHES TO 1.      19800002
         AIF   (&A2 LT &A1).LOOP1                                       19850002
.LOOP2   ANOP                                                           19900002
&A2      SETA  &A2+1                                                    19950002
&SW(&A2) SETB  0                  SET SECOND HALF TO ZERO.              20000002
         AIF   (&A2 LT &ITEMNBR).LOOP2                                  20050002
&R       SETA  0                  SET R TO FIRST TRIAL ITEM.            20100002
&ZI      SETA  &ITEMNBR-1         SET ZI TO LAST ITEM.                  20150002
&I       SETA  &ZI-1                                                    20200002
.T3      ANOP                                                           20250002
&SR      SETB  (&SW(&R+1))        GET FLAG, WHICH WAY TO GO?            20300002
&R       SETA  (&R*2)+1+&SR       R=2R+(1 OR 2)                         20350002
         AIF   (&R LE &I).T3                                            20400002
.T4      ANOP                                                           20450002
&R       SETA  (&R-1)/2           R=(R-1)/2                             20500002
&SR      SETB  (&SW(&R+1))        GET SUBTREE SELECT FLAG.              20550002
         AIF   (&SR EQ 0).T7                                            20600002
         AIF   (&GOTO EQ 0).T5                                          20650002
.T7      ANOP                                                           20700002
&A1      SETA  &ITEMNDX(&R+1)                                           20750002
&A2      SETA  &ITEMNDX(&ZI+1)                                          20800002
&C1      SETC  '&ITEM(&A1)'.'       '(1,8-K'&ITEM(&A1))                 20850002
&C2      SETC  '&ITEM(&A2)'.'       '(1,8-K'&ITEM(&A2))                 20900002
         AIF   ('&C1' LT '&C2').T8                                      20950002
.T9      ANOP                                                           21000002
&TEMP    SETA  &ITEMNDX(&R+1)     Z(R) TO TEMP.                         21050002
&TB      SETB  (&SW(&R+1))                                              21100002
&ITEMNDX(&R+1) SETA &ITEMNDX(&ZI+1)    Z(I) TO Z(R)                     21150002
&SW(&R+1) SETB (&SW(&ZI+1))                                             21200002
&ITEMNDX(&ZI+1) SETA &TEMP        TEMP TO Z(I)                          21250002
&SW(&ZI+1) SETB (&TB)                                                   21300002
&SR      SETB  (&SR EQ 0)                                               21350002
&SW(&R+1) SETB (&SR)                                                    21400002
.T8      AIF   (&R GT 0).T4                                             21450002
&GOTO    SETB  1                  SET 'GO TO' T7                        21500002
&ZI      SETA  &ZI-1                                                    21550002
&I       SETA  &I-1                                                     21600002
         AIF   (&I GE 0).T3                                             21650002
.MEXIT   ANOP                                                           21700002
&ITEMITR SETA 1                                                         21750002
&ITEMMDX SETA 1                                                         21800002
.ITRLOOP ANOP                                                           21850002
&ITEMITR SETA &ITEMITR+1                                                21900002
&ITEMMDX SETA &ITEMMDX+&ITEMMDX                                         21950002
         AIF  (&ITEMMDX LT &ITEMNBR).ITRLOOP                            22000002
&ITEMITR SETA &ITEMITR-1                                                22050002
&ITEMMDX SETA &ITEMMDX/2                                                22100002
&A1      SETA &ITEMNBR                                                  22150002
&A2      SETA &ITEMMDX                                                  22200002
&TEMP    SETA &ITEMITR                                                  22250002
 MNOTE *,' ITEMS = &A1, MAX INDEX = &A2, ITTERATION COUNT = &TEMP'      22300002
         MEXIT                                                          22350002
.T5      ANOP                                                           22400002
&TEMP    SETA  &ITEMNDX(&R+1)     Z(R) TO TEMP.                         22450002
&TB      SETB  (&SW(&R+1))                                              22500002
&ITEMNDX(&R+1) SETA &ITEMNDX(&ZI+1)    Z(I) TO Z(R)                     22550002
&SW(&R+1) SETB (&SW(&ZI+1))                                             22600002
&ITEMNDX(&ZI+1) SETA &TEMP        TEMP TO Z(I)                          22650002
&SW(&ZI+1) SETB (&TB)                                                   22700002
&SR      SETB  (&SR EQ 0)                                               22750002
&SW(&R+1) SETB (&SR)                                                    22800002
         AGO   .T3                                                      22850002
         MEND                                                           22900002
           MACRO                                                        22950002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C23000002
               &LABEL7,&LABEL8                                          23050002
.*                                 THIS MACRO ALLOWS LABELS TO          23100002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   23150002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  23200002
.*                                 TION MARKS. THE COLUMN AND LINE END  23250002
.*                                 CONTROLS WILL BE INSERTED BY THE     23300002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      23350002
.*                                 LABEL REQUIRED FOR RESPECTIVE        23400002
.*                                 COLUMN.                              23450002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             23500002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  23550002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  23600002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              23650002
         GBLA  &NRENTS,&SHIFT(3000)                                     23700002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           23750002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       23800002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         23850002
         LCLC  &MARGIN,&TACK                                            23900002
         LCLC  &TEXT                                                    23950002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            24000002
         AIF   (&INITIAL EQ 0).DIAGCLR                                  24050002
         AIF   (&DIAGTST EQ 0).DIAGCLR                                  24100002
         AIF   (&DIAGLIN EQ 1).DIAGCLR                                  24150002
         MNOTE '**NO LINE ASSOCIATED WITH PREVIOUS LABEL**'             24200002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   24250002
*        LINE                                                           24300002
         LINE                                                           24350002
.DIAGCLR ANOP                                                           24400002
&DIAGSET SETB  0                                                        24450002
&DIAGLIN SETB  0                                                        24500002
&MARGIN  SETC  '*'                                                      24550002
         AIF   ('&NAME' EQ '').LOOPOUT                                  24600002
&LPTR    SETA  &LPTR+1                                                  24650002
&LBL(&LPTR) SETC '&NAME'                                                24700002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          24750002
.LOOPOUT ANOP                                                           24800002
&OP      SETA  &OP+1                                                    24850002
&K       SETA  K'&SYSLIST(&OP)                                          24900002
         AIF (&K GE 2).NORM                                             24950002
&K       SETA  2                                                        25000002
.NORM    ANOP                                                           25050002
&START   SETA  2                                                        25100002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                25150002
&MARGIN  SETC  '$'                                                      25200002
.NOTLAST ANOP                                                           25250002
&NRCHAR  SETA  8                                                        25300002
&TACK    SETC  ''                                                       25350002
.LOOPIN  ANOP                                                           25400002
&REMAIN  SETA  &K-&START                                                25450002
         AIF (&REMAIN GE 8).MORE                                        25500002
&TACK    SETC  '&MARGIN'                                                25550002
&NRCHAR  SETA  &REMAIN                                                  25600002
.MORE    ANOP                                                           25650002
&TEXT    SETC  ''                                                       25700002
         AIF (&REMAIN EQ 0).ENDTEXT                                     25750002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          25800002
.ENDTEXT ANOP                                                           25850002
&LABELNR SETA  &LABELNR+1                                               25900002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  25950002
&START   SETA  &START+8                                                 26000002
         AIF ('&TACK' EQ '').LOOPIN                                     26050002
         AIF ('&TACK' EQ '*').LOOPOUT                                   26100002
         MEND                                                           26150002
         MACRO                                                          26200002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      26250002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     26300002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    26350002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 26400002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    26450002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    26500002
.*                                 THE PREVIOUS LINE AND STORES THAT #  26550002
.*                                 INTO THE APPROPRIATE BYTE.           26600002
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    26650002
.*                                 DATA.                                26700002
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 26750002
.*                                 DATA COLUMN STARTING CHARACTERS.     26800002
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   26850002
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 26900002
.*                                 STARTING CHARACTERS.                 26950002
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   27000002
.*                                 TO BEGIN NEXT PRINTED LINE.          27050002
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       27100002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   27150002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 27200002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   27250002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 27300002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    27350002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   27400002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   27450002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  27500002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   27550002
.*                                 THE SUBJECT LINE                     27600002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             27650002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  27700002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  27750002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              27800002
         GBLA  &NRENTS,&SHIFT(3000)                                     27850002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           27900002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       27950002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         28000002
         LCLA  &S                                                       28050002
         AIF   (&INITIAL EQ 0 OR &DIAGTST EQ 0).DIAGSET                 28100002
         AIF   (&DIAGSET EQ 0).DIAGSET                                  28150002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  28200002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   28250002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       28300002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 28350002
.DIAGSET ANOP                                                           28400002
&DIAGSET SETB  1                                                        28450002
&DIAGLIN SETB  1                                                        28500002
&NAME    DS    0C                                                       28550002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  28600002
         LINEND                                                         28650002
         AGO   .NTFIRST                                                 28700002
.FIRSTLN ANOP                                                           28750002
&NRENTSX SETC  'N&SYSNDX'                                               28800002
&INITIAL SETA  1                                                        28850002
N&SYSNDX EQU   *                                                        28900002
.NTFIRST ANOP                                                           28950002
         DC    AL1(0)                                                   29000002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               29050002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                29100002
&DB      SETA  &DATA(1)                                                 29150002
         AGO   .AA                                                      29200002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                29250002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 29300002
         AGO   .CC                                                      29350002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    29400002
         AIF   (&DATA(2) EQ &DT).BB                                     29450002
.CC      ANOP                                                           29500002
&DT      SETA  &DATA(2)                                                 29550002
.BB      DC    XL2'FFFE'                                                29600002
         DC    FL1'&DB'                                                 29650002
         DC    FL1'&DT'                                                 29700002
&NRENTS  SETA  &NRENTS+1                                                29750002
.NCDATA  ANOP                                                           29800002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              29850002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               29900002
&LB      SETA  &LABEL(1)                                                29950002
         AGO   .AAA                                                     30000002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              30050002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               30100002
         AGO   .CCC                                                     30150002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  30200002
         AIF   (&LABEL(2) EQ &LT).BBB                                   30250002
.CCC     ANOP                                                           30300002
&LT      SETA  &LABEL(2)                                                30350002
.BBB     DC    XL2'FFFF'                                                30400002
         DC    FL1'&LB'                                                 30450002
         DC    FL1'&LT'                                                 30500002
&NRENTS  SETA  &NRENTS+1                                                30550002
.NCLABEL ANOP                                                           30600002
         AIF   ('&SKIP' NE '').CONT                                     30650002
         AIF   (&TEST EQ 0).NOCHANG                                     30700002
         AGO   .DEFALTA                                                 30750002
.CONT    ANOP                                                           30800002
         AIF   (&TEST EQ 0).AB                                          30850002
         AIF   ('&SKIP' EQ 'E').AB                                      30900002
&S       SETA  &SKIP                                                    30950002
.DEFAULT ANOP                                                           31000002
         AIF   (&SKIP EQ &LASTCC).DEFALTA                               31050002
         ORG   &CARRCON+3                                               31100002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 31150002
         ORG                                                            31200002
&LASTCC  SETA  &S                                                       31250002
.DEFALTA ANOP                                                           31300002
&TEST    SETB  0                                                        31350002
         AGO   .DD                                                      31400002
.AB      AIF   ('&SKIP' NE 'E').ABB                                     31450002
A&SYSNDX DC    X'FFFB8B00'              EJECT                           31500002
&LASTCC  SETA  184                                                      31550002
&TEST    SETB  1                                                        31600002
         AGO   .ABC                                                     31650002
.ABB     AIF   (&SKIP EQ &LASTCC).NOCHANG                               31700002
A&SYSNDX DC    XL2'FFFB'                                                31750002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              31800002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              31850002
&LASTCC  SETA  &SKIP                                                    31900002
&TEST    SETB  1                                                        31950002
.ABC     ANOP                                                           32000002
&CARRCON SETC  'A&SYSNDX'                                               32050002
&NRENTS  SETA  &NRENTS+1                                                32100002
.DD      ANOP                                                           32150002
.NOCHANG ANOP                                                           32200002
         MEND                                                           32250002
         MACRO                                                          32300002
         LINEND ,                                                       32350002
.*                                 THIS MACRO IS USED ONLY BY THE LINE  32400002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   32450002
.*                                 ASSOCIATED WITH EACH LINE.           32500002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             32550002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  32600002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  32650002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              32700002
         GBLA  &NRENTS,&SHIFT(3000)                                     32750002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           32800002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       32850002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         32900002
         ORG   &NRENTSX                                                 32950002
         DC    FL1'&NRENTS'                                             33000002
         ORG                                                            33050002
&NRENTS  SETA  0                                                        33100002
B&SYSNDX EQU   *                                                        33150002
&NRENTSX SETC  'B&SYSNDX'                                               33200002
         MEND                                                           33250002
         MACRO                                                          33300002
         LSTART ,                                                       33350002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  33400002
.*                                 OF THE TABLE IS TO BEGIN.            33450002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             33500002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  33550002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  33600002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              33650002
         GBLA  &NRENTS,&SHIFT(3000)                                     33700002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           33750002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       33800002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         33850002
         LCLA  &NDX,&CTR                                                33900002
         ACTR  500000                                                   33950002
         AIF   (&DIAGTST EQ 0).NODIAG                                   34000002
         AIF   (&DIAGSET EQ 0).NODIAG                                   34050002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  34100002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   34150002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       34200002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 34250002
.NODIAG  ANOP                                                           34300002
         LINEND                                                         34350002
&CTR     SETA  1                                                        34400002
.LOOP    ANOP                                                           34450002
&NDX     SETA  &NDX+1                                                   34500002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            34550002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         34600002
&CTR     SETA  &CTR+1                                                   34650002
         AGO   .LOOPCTL                                                 34700002
.NOLBL   ANOP                                                           34750002
         DC    C'&LABELS(&NDX)'                                         34800002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  34850002
         MEND                                                           34900002
         MACRO                                                          34950002
&NAME    ROUTINE &LOGITEM,&RNAME                                        35000002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             35050002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  35100002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  35150002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              35200002
         GBLA  &NRENTS,&SHIFT(3000)                                     35250002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           35300002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       35350002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         35400002
         AIF   (&DIAGTST EQ 0).NOMSG                                    35450002
         AIF   (&INITIAL EQ 0).NOMSG                                    35500002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    35550002
         MNOTE '**NO LINE ASSOCIATED WITH THIS ROUTINE**'               35600002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     35650002
*        LINE                                                           35700002
         LINE                                                           35750002
.NOMSG   ANOP                                                           35800002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           35850002
         DC    AL2(&RNAME-&CSECT)                                       35900002
&NRENTS  SETA  &NRENTS+1                                                35950002
         MEND                                                           36000002
         MACRO                                                          36050002
         SPECIAL &ROUTINE,&PARAM,&SPACE=                                36100002
.*                            THIS MACRO GENERATES A SPECIAL ROUTINE    36150002
.*                                 ENTRY TO BE PROCESSED BY THE SUM. M. 36200002
.*                            &ROUTINE - SYMBOL ON SPECIAL ROUTINE EWT. 36250002
.*                            &PARAM - AN 8 BIT BINARY REPRESENTATION   36300002
.*                                 TO OCCUPY THE 'MASK' FIELD BUT TO BE 36350002
.*                                 INTERPRETED AS AN ARGUMENT OF THE    36400002
.*                                 SPECIAL ROUTINE.                     36450002
.*                            &SPACE - THE NUMBER OF 2BYTE COUNTERS TO  36500002
.*                                 ALLOCATE FOR REQUIRED PROCESSING.    36550002
         GBLC  &CSECT                                                   36600002
         GBLA  &COUNTR                                                  36650002
         LCLA  &ADD                                                     36700002
         DC    AL1(128)                                                 36750002
         DC    BL.8'&PARAM'                                             36800002
         DC    AL2(&ROUTINE-&CSECT)                                     36850002
         DC    AL2(&COUNTR)                                             36900002
&ADD     SETA  1                                                        36950002
         AIF   ('&SPACE' EQ '').NORM                                    37000002
&ADD     SETA  &SPACE                                                   37050002
.NORM    ANOP                                                           37100002
&COUNTR  SETA  &COUNTR+&ADD                                             37150002
         MEND                                                           37200002
         MACRO                                                          37250002
         HEX   ,                                                        37300002
.*                            THIS MACRO FACILITATES GENERATION OF THE  37350002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    37400002
.*                                 CONVERSIONS.                         37450002
.*                            &SYSLIST(&OP,1) - NAME OF DATA ITEM TO BE 37500002
.*                                 CONVERTED                            37550002
.*                            &SYSLIST(&OP,2) - # OF SPACES TO SKIP ON  37600002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   37650002
.*                                 BACK UP FROM COLUMN FOR START OF     37700002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  37750002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  37800002
.*                                 DESIRED. OMISSION OF THIS OPERAND    37850002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  37900002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  37950002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 38000002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    38050002
.*                                 IMPLICITLY B).                       38100002
.*                            &SYSLIST(&OP,3) - NUMBER OF BYTES TO      38150002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     38200002
.*                                 WITH AN L,R, OR B TO STIPULATE       38250002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     38300002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     38350002
.*                                 RESPECTIVELY. OMISSION OF THIS       38400002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  38450002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 38500002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 38550002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   38600002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     38650002
.*                                 SUBJECT LINE(S).                     38700002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             38750002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  38800002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  38850002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              38900002
         GBLA  &NRENTS,&SHIFT(3000)                                     38950002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           39000002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       39050002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         39100002
         LCLB  &B,&SUB                                                  39150002
         LCLA  &IBITS,&ISHIFT,&K,&T,&CODE,&BYTESP,&OP                   39200002
         LCLC  &S,&LETTER,&ARG                                          39250002
       ACTR  500000                                                     39300002
         AIF   (&DIAGTST EQ 0).NOMSG                                    39350002
         AIF   (&INITIAL EQ 0).NOMSG                                    39400002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    39450002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  39500002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     39550002
*        LINE                                                           39600002
         LINE                                                           39650002
.NOMSG   ANOP                                                           39700002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  39750002
&SUB     SETB  1                                                        39800002
.LOOP    ANOP                                                           39850002
&OP      SETA  &OP+1                                                    39900002
&ARG     SETC  '&SYSLIST(&OP,1)'                                        39950002
         ITEMFIND  &ARG                                                 40000002
         AIF   (&ITEMXPT EQ 0).MEXIT                                    40050002
.FOUND   ANOP                                                           40100002
&ISHIFT  SETA  &SHIFT(&ITEMXPT)                                         40150002
&IBITS   SETA  &BITS(&ITEMXPT)                                          40200002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).ALIGN                     40250002
.ERR     MNOTE '**DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY**'          40300002
.MEXIT   MEXIT                                                          40350002
.ALIGN   ANOP                                                           40400002
&CODE    SETA  1                                                        40450002
         AIF   (&SUB EQ 1).SUBA                                         40500002
&K       SETA  K'&SYSLIST(3)                                            40550002
         AGO   .SUBB                                                    40600002
.SUBA    ANOP                                                           40650002
&K       SETA  K'&SYSLIST(&OP,3)                                        40700002
.SUBB    ANOP                                                           40750002
         AIF   (&K EQ 1).ERR3                                           40800002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            40850002
         MNOTE '**BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL**' 40900002
         MEXIT                                                          40950002
.OK      AIF   (&SUB EQ 1).SUBC                                         41000002
         AIF   ('&SYSLIST(3)' EQ '').USEDEFN                            41050002
&LETTER  SETC  '&SYSLIST(3)'(&K,1)                                      41100002
&S       SETC  '&SYSLIST(3)'(1,&K-1)                                    41150002
         AGO   .SUBD                                                    41200002
.SUBC    ANOP                                                           41250002
         AIF   ('&SYSLIST(&OP,3)' EQ '').USEDEFN                        41300002
&LETTER  SETC  '&SYSLIST(&OP,3)'(&K,1)                                  41350002
&S       SETC  '&SYSLIST(&OP,3)'(1,&K-1)                                41400002
.SUBD    ANOP                                                           41450002
&BYTESP  SETA  &S                                                       41500002
         AIF   ('&LETTER' EQ 'B').BOTH                                  41550002
         AIF   ('&LETTER' EQ 'L').LEFT                                  41600002
         AIF   ('&LETTER' EQ 'R').RIGHT                                 41650002
.ERR3    MNOTE '**PARAMETER 3 INCOMPLETE-DSGEN DEFINITION USED**'       41700002
         AGO   .USEDEFN                                                 41750002
.RIGHT   ANOP                                                           41800002
&CODE    SETA  2                                                        41850002
         AGO   .L                                                       41900002
.LEFT    ANOP                                                           41950002
&CODE    SETA  1                                                        42000002
         AGO   .L                                                       42050002
.USEDEFN ANOP                                                           42100002
&BYTESP  SETA  &IBITS/8                                                 42150002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       42200002
&CODE    SETA  3                                                        42250002
&T       SETA  &BYTESP*2-1                                              42300002
&S       SETC  '&T'                                                     42350002
.OK2     AIF   (&ISHIFT EQ 0).L                                         42400002
&CODE    SETA  2                                                        42450002
.L       ANOP                                                           42500002
&B       SETB  1                                                        42550002
         AIF   (&SUB EQ 1).SUBE                                         42600002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             42650002
&K       SETA  K'&SYSLIST(2)                                            42700002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              42750002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                42800002
         AGO   .SUBF                                                    42850002
.SUBE    ANOP                                                           42900002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         42950002
&K       SETA  K'&SYSLIST(&OP,2)                                        43000002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          43050002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            43100002
.SUBF    ANOP                                                           43150002
.BACKUP  ANOP                                                           43200002
&NRENTS  SETA  &NRENTS+1                                                43250002
         AIF   (&BYTESP GT 0 AND &BYTESP LT 16).SUB0                    43300002
         MNOTE '**NO. OF BYTES OUTSIDE RANGE OF 1-15**'                 43350002
         MEXIT                                                          43400002
.SUB0    AIF   (&SUB EQ 1).SUBG                                         43450002
         DC    AL.12(&SYSLIST(1)-&DSECT),XL.4'A'                        43500002
         AGO   .SUBH                                                    43550002
.SUBG    ANOP                                                           43600002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'A'                    43650002
.SUBH    ANOP                                                           43700002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'              43750002
.OUT     ANOP                                                           43800002
&ITEMXPT     SETA  0                                                    43850002
         AIF   (&SUB EQ 0).OUTA                                         43900002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 43950002
.OUTA    ANOP                                                           44000002
         MEND                                                           44050002
         MACRO                                                          44100002
         SUM   &LOGITEM,&MASK                                           44150002
.*                            THIS MACRO GENERATES A NORMAL EDIT ENTRY  44200002
.*                                 FOR PROCESSING BY THE SUMMARY MODULE 44250002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE SUMMED 44300002
.*                            &MASK - BYTE MASK FOR BITS TO BE TESTED.  44350002
.*                                 THIS OPERAND SHOULD BE OMITTED FOR   44400002
.*                                 SINGLE BIT ITEMS IN WHICH CASE THE   44450002
.*                                 MASK WILL BE SET ACCORDING TO THE    44500002
.*                                 OFF BYTE BIT DISPLACEMENT OF THE     44550002
.*                                 ITEM AS DEFINED BY THE MACRO 'DSGEN' 44600002
         GBLA  &COUNTR,&ITEMNBR,&BITS(3000),&SHIFT(3000)                44650002
         GBLC  &ITEM(3000),&DSECT                                       44700002
         LCLA  &IBITS,&NDX,&ISHIFT,&M,&BITNBR                           44750002
.LOOP    ANOP                                                           44800002
&NDX     SETA  &NDX+1                                                   44850002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      44900002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  44950002
         MNOTE *,'LOGITEM NOT FOUND'                                    45000002
         MEXIT                                                          45050002
.FOUND   ANOP                                                           45100002
&ISHIFT  SETA  &SHIFT(&NDX)                                             45150002
&IBITS   SETA  &BITS(&NDX)                                              45200002
         AIF   (&IBITS EQ 1).FORM1      TEST FOR OLD FORM               45250002
         AIF   ('&MASK' NE '').FORM1    TEST FOR MASK                   45300002
         AIF   (&IBITS+&ISHIFT GT 8).MSG     TEST FOR MORE THAN EIGHT   45350002
         DC    AL.1(0),AL.3(&ISHIFT),AL.4(&IBITS)                       45400002
         DC    AL1(0)                                                   45450002
         AGO   .ITEM                                                    45500002
.MSG     MNOTE '**BITS GREATER THAN 8**'                                45550002
         MEXIT                                                          45600002
.FORM1   ANOP                                                           45650002
         DC    AL1(0)                                                   45700002
         AIF   ('&MASK' EQ '').FORM                                     45750002
         DC    B'&MASK'                                                 45800002
         AGO   .ITEM                                                    45850002
.FORM    ANOP                                                           45900002
&BITNBR  SETA  &ISHIFT-7                                                45950002
&BITNBR  SETA  0-&BITNBR                                                46000002
&M       SETA  1                                                        46050002
.LOOP2   ANOP                                                           46100002
         AIF   (&BITNBR EQ 0).GOTIT                                     46150002
&M       SETA  &M*2                                                     46200002
&BITNBR  SETA  &BITNBR-1                                                46250002
         AGO   .LOOP2                                                   46300002
.GOTIT   ANOP                                                           46350002
         DC    AL1(&M)                                                  46400002
.ITEM    DC    AL2(&LOGITEM-&DSECT)                                     46450002
         DC    AL2(&COUNTR)                                             46500002
&COUNTR  SETA  &COUNTR+1                                                46550002
         MEND                                                           46600002
         GBLC  &DSECT,&CSECT                                            46650002
IFCEXXXH CSECT                                                          46700002
&DSECT   SETC  'XXXH'                                                   46750002
&CSECT   SETC  'IFCEXXXH'                                               46800002
*                                                                       46850002
*                                                                       46900002
*                                                                       46950002
XXXH     DSECT                                                          47000002
         DSGEN (CLASS,8),(XRELN,8),(XDUM1,8),                    S21021X47050002
               (SW2B0,1),(SW2B1,1),(SW2B2,1),(SW2B3,1),          S21021X47100002
               (SW2B4,1),(SW2B5,1),(SW2B6,1),(SW2B7,1)           S21021 47150002
         DSGEN (XDUM3,32)                         SPARES                47200002
         DSGEN (XDATE,32)                         DATE                  47250002
         DSGEN (XTIME,32)                         TIME                  47300002
         DSGEN (XDUM4,8),(XSER,24)           SERIAL NO                  47350002
         DSGEN (XMODEL,16),(XDUM5,16)        MODEL NUMBER & MCLEN       47400002
         DSGEN (XPGN1,32)                    PROGRAM                    47450002
         DSGEN (XPGN2,32)                            NAME               47500002
         DSGEN (XFCCWCC,8),(XFCCWDA,24)  FAILING CCW                    47550002
         DSGEN (XFCCWFL,8),(XZERO,8),(XFCCWCT,16)                       47600002
         DSGEN (XCSWK,8),(XCSWCA,24)         CHAN  STATUS               47650002
         DSGEN (XCSWATTN,1),(XCSWSM,1),(XCSWCUE,1),      WORD  CSW     C47700002
               (XCSWBSY,1),(XCSWCE,1),(XCSWDE,1),(XCSWUC,1),(XCSWUE,1),C47750002
               (XCSWPCI,1),(XCSWSILI,1),(XCSWPC,1),(XCSWPCHK,1),       C47800002
               (XCSWCDC,1),(XCSWCCC,1),(XCSWICC,1),(XCSWCH,1),         C47850002
               (XCSWCT,16)                                              47900002
         DSGEN (XDUMA,16),(XCUA2,16)                             S21021 47950001
         DSGEN (XDEVT1,16),(XDEVT2,16)       DEVICE TYPE                48000002
         DSGEN (XDUM6,8),(XCUA,24)           DUMMY AND CUA              48050002
         DSGEN (XRETRY,16),(XNUMSNS,16) RTRY AND NO.SENSE BYTES         48100002
         DSGEN (SNS00,1,0,7)       SENSE                                48150002
         DSGEN (SNS01,1,0,7)       BYTES                                48200002
         DSGEN (SNS02,1,0,7)                                            48250002
         DSGEN (SNS03,1,0,7)                                            48300002
         DSGEN (SNS04,1,0,7)                                            48350002
         DSGEN (SNS05,1,0,7)                                            48400002
         DSGEN (SNS06,1,0,7)                                            48450002
         DSGEN (SNS07,1,0,7)                                            48500002
         DSGEN (SNS08,1,0,7)                                   @M04AE95 48501002
         DSGEN (SNS09,1,0,7)                                   @M04AE95 48502002
         DSGEN (SNS10,1,0,7)                                   @M04AE95 48503002
         DSGEN (SNS11,1,0,7)                                   @M04AE95 48504002
         DSGEN (SNS12,1,0,7)                                   @M04AE95 48505002
         DSGEN (SNS13,1,0,7)                                   @M04AE95 48506002
         DSGEN (SNS14,1,0,7)                                   @M04AE95 48507002
         DSGEN (SNS15,1,0,7)                                   @M04AE95 48508002
         DSGEN (SNS16,1,0,7)                                   @M04AE95 48509002
         DSGEN (SNS17,1,0,7)                                   @M04AE95 48510002
         DSGEN (SNS18,1,0,7)                                   @M04AE95 48511002
         DSGEN (SNS19,1,0,7)                                   @M04AE95 48512002
         DSGEN (SNS20,1,0,7)                                   @M04AE95 48513002
         DSGEN (SNS21,1,0,7)                                   @M04AE95 48514002
         DSGEN (SNS22,1,0,7)                                   @M04AE95 48515002
         DSGEN (SNS23,1,0,7)                                   @M04AE95 48516002
         DSGEN (SNS24,1,0,7)                                   @M04AE95 48517002
         DSGEN (SNS25,1,0,7)                                   @M04AE95 48518002
         DSGEN (SNS26,1,0,7)                                   @M04AE95 48519002
         DSGEN (SNS27,1,0,7)                                   @M04AE95 48520002
         DSGEN (SNS28,1,0,7)                                   @M04AE95 48521002
         DSGEN (SNS29,1,0,7)                                   @M04AE95 48522002
         DSGEN (SNS30,1,0,7)                                   @M04AE95 48523002
         DSGEN (SNS31,1,0,7)                                   @M04AE95 48524002
         ORG   SNS000                                          @M04AE95 48525002
         DSGEN (SNS,16,1,8,1,2)                                @M04AE95 48526002
         ORG   SNS000                                          @XA19168 48526201
         DSGEN (SNSRSV1,72)                                    @XA19168 48526401
         DSGEN (SNSMCS,16)                                     @XA19168 48526601
         DSGEN (SNSRSV2,168)                                   @XA19168 48526801
         DSGEN (SNSRSV,56)                                     @M04AE95 48527001
         DSGEN (SNSSTAT,1,0,7)                                 @XA19168 48537001
         DSGEN (BASC1,1,0,7)                                            48550002
         DSGEN (BASC2,1,0,7)                                            48570002
         DSGEN (XDUMZ,8),(XSIOCNT,24)        START I/O COUNT            48650002
*                                                                       48700002
*        END OF DSECT                                                   48750002
*                                                                       48800002
IFCEXXXH CSECT                                                          48850002
         USING *,R9                                                     48900002
R0       EQU   0                                                        48950002
R1       EQU   1                                                        49000002
R2       EQU   2                                                        49050002
R3       EQU   3                                                        49100002
R4       EQU   4                                                        49150002
R5       EQU   5                                                        49200002
R6       EQU   6                                                        49250002
R7       EQU   7                                                        49300002
R8       EQU   8                                                        49350002
R9       EQU   9                                                        49400002
R10      EQU   10                                                       49450002
R11      EQU   11                                                       49500002
R12      EQU   12                                                       49550002
R13      EQU   13                                                       49600002
R14      EQU   14                                                       49650002
R15      EQU   15                                                       49700002
L0       EQU   0                                                        49750002
L1       EQU   1                                                        49800002
L2       EQU   2                                                        49850002
L3       EQU   3                                                        49900002
L4       EQU   4                                                        49950002
L5       EQU   5                                                        50000002
L6       EQU   6                                                        50050002
L7       EQU   7                                                        50100002
L8       EQU   8                                                        50150002
L9       EQU   9                                                        50200002
L10      EQU   10                                                       50250002
L11      EQU   11                                                       50300002
L12      EQU   12                                                       50350002
L13      EQU   13                                                       50400002
L14      EQU   14                                                       50450002
L15      EQU   15                                                       50500002
L16      EQU   16                                                       50550002
L17      EQU   17                                                       50600002
L18      EQU   18                                                       50650002
L19      EQU   19                                                       50700002
L20      EQU   20                                                       50750002
L21      EQU   21                                                S21021 50800002
L24      EQU   24                                                       50850002
L28      EQU   28                                                       50900002
L29      EQU   29                                                S21021 50950002
L31      EQU   31                                                S21021 51000002
L34      EQU   34                                                S21021 51050002
L36      EQU   36                                                S21021 51100002
L40      EQU   40                                                S21021 51150002
L44      EQU   44                                                S21021 51200002
L46      EQU   46                                                S21021 51250002
L64      EQU   64                                                S21021 51300002
L104     EQU   104                                               S21021 51350002
L120     EQU   120                                               S21021 51400002
HEX01    EQU   X'01'                                           @M04AE95 51420002
HEX04    EQU  X'04'                                            @XA20899 51430001
HEX08    EQU   X'08'                                             S21021 51450002
HEX10    EQU   X'10'                                             S21021 51500002
HEX20    EQU   X'20'                                             S21021 51550002
HEX30    EQU   X'30'                                                    51600002
HEX40    EQU   X'40'                                           @XA19168 51620001
HEX44    EQU   X'44'                                             S21021 51650002
HEX46    EQU   X'46'                                             S21021 51700002
HEX50    EQU   X'50'                                             S21021 51750002
HEX60    EQU   X'60'                                           @XA19168 51770001
HEX80    EQU   X'80'                                                    51800002
HEXA0    EQU   X'A0'                                           @XA19168 51810001
HEXC0    EQU   X'C0'                                           @XA19168 51820001
HEXE0    EQU   X'E0'                                           @XA19168 51830001
XFF      EQU   X'FF'                                             S21021 51850002
A        EQU   C'A'                                              S21021 51900002
B        EQU   C'B'                                              S21021 51950002
         USING XXXH,R2                                           S21021 52000002
*                                                                       52050002
HEX05    EQU   X'05'                                                    52100002
         DC    A(ENTRIES)               PTR TO EDIT ENTRIES             52150002
         DC    CL8'IFCEXXXH'                                   @XA19168 52200001
XR9PTR   DC    F'0'                     PTR TO NXT EDIT-4        S21021 52250002
XLABELP  DC    F'0'                                                     52300002
*        SPECIAL ROUTINE SECTION                                        52350002
*                                                                       52400002
SKIPPER  BR    R14                      NOOP RTRN                       52450002
*                                                                       52500002
*                                                                       52550002
SPACER1  LA    R3,L1(R3)                SPACE ONE BLANK          S21021 52600002
         BR    R14                      RETURN                          52650002
*                                                                       52700002
SPACER16 LA    R3,L16(R3)          SPACE 16 BLANKS                      52750002
         BR    14                  RETURN                               52800002
*                                                                       52850002
*        SET BINARY                                                     52900002
*              R4 HAS PTR TO CHAR                                       52950002
*                                                                       53000002
SETBIN   STM   R5,R8,XSAVE              SAVE REGS                       53050002
         IC    R7,L0(R4)                PICK UP CHAR TO PRINT           53100002
         SLL   R7,L24                   MOVE IT TO HI OF R7             53150002
         LR    R8,R3                    PRINT POS POINTER               53200002
         LA    R5,L8                    LOOP COUNT                      53250002
SETBINA  SR    R6,R6                    CLEAR REG 6                     53300002
         SLDL  R6,L1                    MOVE BIT TO R6                  53350002
         STC   R6,L0(R8)                PUT IT INTO PTINT LINE          53400002
         MVZ   L0(L1,R8),CHAR0          MOVE ON PRORPER ZONE            53450002
         LA    R8,L1(R8)                BUMP POINTER TO NEXT POS        53500002
         BCT   R5,SETBINA               LOOP TILL 8 PRINTED             53550002
         B     RETURN                   RETURN                          53600002
*                                                                       53650002
*                                                                       53700002
*        SET PROGRAM NAME  R4 POINTS TO NAME FIELD                      53750002
*                                                                       53800002
SETPGMN  DS    0H                                                S21021 53850002
         TM    SW2B0,HEX20              SHORT RECORD             S21021 53900002
         BCR   1,R14                    YES, NO JOB ID           S21021 53950002
         MVC   0(L12,R3),JOBID          MOVE IN LABEL            S21021 54000002
         MVC   L13(L8,R3),XPGN1         MOVE IN NAME             S21021 54050002
         BR    R14                                               S21021 54100002
NONAME   TM    L0(R4),HEX20             SHORT RECORD?            S21021 54150002
         BCR   14,R14                   NO, LET HEX JOBNAME PRNT S21021 54200002
         ST    R5,XSAVE                 SAVE REG                 S21021 54250002
         LA    R5,L44                   BACK UP BUFFER PNTR      S21021 54300002
         SR    R3,R5                                             S21021 54350002
         MVC   0(L17,R3),BLANKS         CLEAR OUT HEX JOBNAME    S21021 54400002
         L     R5,XSAVE                 RESTORE REG              S21021 54450002
         BR    R14                                               S21021 54500002
*                                                                       54550002
*                                                                       54600002
*        SET HEX  SAME AS BIN EXCPT PRINTS 1 CHAR HEX                   54650002
*                                                                       54700002
SETHEX   STM   R5,R8,XSAVE              SAVE REGS                       54750002
         LA    R8,CHARS                 CHAR TABLE POINTER              54800002
         IC    R7,L0(R4)                PICK UP CHAR                    54850002
         SLL   R7,L24                   MOVE IT TO HI OF R7             54900002
         SR    R6,R6                    CLEAR REGS                      54950002
         SLDL  R6,L4                    MOVE FOUR BITS                  55000002
         AR    R6,R8                    ADD OFFSET & PTR                55050002
         MVC   L0(L1,R3),L0(R6)         MOVE CHAR TO LINE               55100002
         SR    R6,R6                    CLEAR AGAIN                     55150002
         SLDL  R6,L4                    MOVE LAST 4 BOTS                55200002
         AR    R6,R8                    COMPUTE OFFSET                  55250002
         MVC   L1(L1,R3),L0(R6)         MOVE LAST CHAR                  55300002
         B     RETURN                                                   55350002
*                                                                       55400002
*                                                                       55450002
*                                                                       55500002
SETCONV  TM    L0(R4),HEX02             HAS RECORD BEEN CONVERTED KEY32 55550002
         BCR   ON,R14                   YES RETURN                      55600002
         SR    R15,R15                  NO CLEAR R15 FOR NO PRINT OF    55650002
         BR    R14                      LINE BR-14                      55700002
ON       EQU   1                                                        55750002
HEX02    EQU   X'02'                                                    55800002
*                                       SET DEVICE TYPE FIELD           55850002
*                                                                       55900002
*                                                                       55950002
*                                                                       56000002
*                             CHECK ON CPU AND SERIAL NO                56050002
SETCPUNO STM   R5,R8,XSAVE                                              56100002
         SR    R5,R5               CLEAR R5                             56150002
         IC    R5,L0(R4)           PICK UP MODEL NO                     56200002
         SLL   R5,L8               IN TO                                56250002
         IC    R5,L1(R4)           R5                                   56300002
         LTR   R5,R5                    TEST FOR ZERO MODEL      S21021 56350002
         LR    R5,R3                    POINT TO DATA FIELD      S21021 56400002
         BNZ   SETSER                   BRANCH IF MODEL NOT 0    S21021 56450002
         LA    R6,L46                   BACK UP TO SAY 'NONE'    S21021 56500002
         SR    R5,R6                    BACKUP BUFFER            S21021 56550002
         MVC   L0(L29,R5),UNIVERS       SAY NONE, MODEL UNIVERSALS21021 56600002
         B     RETURN                   RETURN  CONTROL                 56650002
SETSER   LA    R6,L36                   SET UP TO ADD 'SERIAL NO.S21021 56700002
         SR    R5,R6                                             S21021 56750002
         MVC   0(L10,R5),SERNO                                   S21021 56800002
         B     RETURN                                            S21021 56850002
*                                                                       56900002
*        SET DATE                                                       56950002
*                                                                       57000002
SETDATE  CLC   L1(L3,R4),ZERO           IS DATE ZERO                    57050002
         BE    SETDTE                   BR-YES                          57100002
         UNPK  XSAVE(L8),L1(L3,R4)      UNPACK DATE                     57150002
         MVC  L5(L2,R3),XSAVE+L3  MOVE YEAR                             57200002
         MVC   L0(L3,R3),XSAVE+L5       MOVE DAY                        57250002
         BR    R14                      RETURN                          57300002
SETDTE   MVC   L0(L4,R3),NONE           SET DATE TO NONE                57350002
         BR    R14                                                      57400002
ZERO     DC    XL4'00'                                                  57450002
*                                                                       57500002
*                                                                       57550002
*                                                                       57600002
RETURN   LM    R5,R8,XSAVE              RESTORE REG                     57650002
         BR    R14                      RETURN                          57700002
HEX03    EQU   X'03'                                                    57750002
HEX18    EQU   X'18'                                                    57800002
*                                                                       57850002
*                                                                S21021 57900002
CONVREL  STM   R5,R8,XSAVE              SAVE WORK REGS                  57950002
         SR    R6,R6                    CLEAR R6                        58000002
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        58050002
         SRDL  R6,L5                    SAVE REL NO IN R7               58100002
        SLL   R6,L2                    MULTIPLY SYS VALUE BY 4          58150002
         L     R8,XLABELP               PICK UP LABEL POINTER           58200002
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     58250002
         MVC   L0(L4,R8),L0(R6)         MOVE SYSTEM NAME INTO LABEL     58300002
         SR    R6,R6                    CLEAR R6                        58350002
         SLDL  R6,L5                    RETREIVE REL NO.                58400002
         LTR   R6,R6                    IS IT ZERO                      58450002
         BZ    NOREL                    BR-YES                          58500002
         CVD   R6,WORK                  CONVERT IT                      58550002
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFF       58600002
         MVZ   L1(L1,R3),L0(R3)         MOVE ON PROPER ZONE             58650002
         B     RETURN                   EXIT                            58700002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL            58750002
         B     RETURN                                                   58800002
CHKPROC  STM   R5,R8,XSAVE                                              58850002
         TM    L0(R4),HEX10        PRINT JUST SENSE DATA                58900002
         BZ    CHKPROC2            BRANCH IF YES                        58950002
         LR    R5,R4               SAVE R4                              59000002
         LA    R5,L1(R5)           GET TO BASIC SENSE BYT 2    @M04AE95 59050002
         TM    L0(R5),HEX01        PROCESSOR OR EXTENDED       @M04AE95 59070002
         BO    RETURN              BRANCH IF PROCESSOR                  59150002
         L     R5,EXTEND           RESET LABELS AND                     59200002
         ST    R5,XR9PTR           LINE POINTERS FOR                    59250002
         L     R5,EXTEND1          EXTENDED SENSE DATA                  59300002
         ST    R5,XLABELP                                               59350002
         B     RETURN                                                   59400002
CHKPROC2 L     R5,FINISH           BYPASS PROCESSOR AND                 59450002
         ST    R5,XR9PTR           EXTENDED SENSE DATA                  59500002
         L     R5,FINISH1                                               59550002
         ST    R5,XLABELP                                               59600002
         B     RETURN                                                   59650002
*                                                                       59700002
CKTYPE   STM   R5,R8,XSAVE         SAVE REGISTERS                       59750002
         TM    CLASS,HEX30         IS IT REALLY OBR?                    59800002
         BO    RETURN              RETURN IF YES                        59850002
         LA    R5,ET00D-4          SET UP TO CALL IFCET00D              59900002
         ST    R5,XR9PTR           FOR MDR PROCESSING                   59950002
         B     RETURN                                                   60000002
CCTYPE   STM   R5,R8,XSAVE       SAVE REGISTERS                @XA19168 60001001
         L     R8,XLABELP        GET ADDR OF LABEL             @XA19168 60002001
         CLI   0(R4),HEX01        IS IT GENERAL                @XA20885 60003001
         BNE   CCTYPE0            NO,CONTINUE CHECK            @XA20885 60003801
         MVC   L0(L12,R8),GEN     SET UP LABEL                 @XA20885 60004601
         B     RETURN             RETURN                       @XA20885 60005401
CCTYPE0  CLI   0(R4),HEX02        IS IT MICROFILM              @XA20885 60006201
         BNE   CCTYPE1            NO,CONTINUE CHECK            @XA20885 60007001
         MVC   L0(L12,R8),MICRFILM  SET UP LABEL               @XA20885 60007801
         B     RETURN             RETURN                       @XA20885 60008601
CCTYPE1  CLI   0(R4),HEX20        IS IT MICR                   @XA20885 60009401
         BNE   CCTYPE2            NO,CONTINUE CHECK            @XA20885 60010201
         MVC   L0(L12,R8),MICR    SET UP LABEL                 @XA20885 60011001
         B     RETURN             RETURN                       @XA20885 60011801
CCTYPE2  CLI   0(R4),HEX40        IS IT RUN CTL                @XA20885 60012601
         BNE   CCTYPE3            NO,CONTINUE CHECK            @XA20885 60013401
         MVC   L0(L12,R8),RUNCTL  SET UP LABEL                 @XA20885 60014201
         B     RETURN             RETURN                       @XA20885 60015001
CCTYPE3  CLI   0(R4),HEX08        IS IT INSCRIBER/PRINTER      @XA20885 60015801
         BNE   CCTYPE4            NO,CONTINUE CHECK            @XA20885 60016601
         MVC   L0(L12,R8),INSPRT  SET UP LABEL                 @XA20885 60017401
         B     RETURN             RETURN                       @XA20885 60018201
CCTYPE4  CLI   0(R4),HEX10        IS IT DIH                    @XA20885 60019001
         BNE   CCTYPE5            NO,CONTINUE CHECK            @XA20885 60019801
         MVC   L0(L12,R8),DIH     SET UP LABEL                 @XA20885 60020601
         B     RETURN             RETURN                       @XA20885 60021401
CCTYPE5  CLI   0(R4),HEX80        IS IT CHANNEL ADAPT          @XA20885 60022201
         BNE   CCTYPE6            NO,CONTINUE CHECK            @XA20885 60023001
         MVC   L0(L12,R8),CHANADPT  SET UP LABEL               @XA20885 60023801
         B     RETURN             RETURN                       @XA20885 60024601
CCTYPE6  CLI   0(R4),HEX04        IS IT OCR                    @XA20885 60025401
         BNE   CCTYPE7            NO,CONTINUE CHECK            @XA20885 60026201
         MVC   L0(L12,R8),OCR     SET UP LABEL                 @XA20885 60027001
         B     RETURN             RETURN                       @XA20885 60027801
CCTYPE7  MVC   L0(L12,R8),UNDEF   SET UP LABEL                 @XA20885 60028601
         B     RETURN           RETURN                                  60032001
CHKERROR STM   R5,R8,XSAVE                                     @M04AE95 60033001
         L     R8,XLABELP          GET ADDR OF LABEL           @M04AE95 60034001
         TM    0(R4),HEX80         ANY ERRORS                  @M04AE95 60035001
         BZ    NOERROR             NO,BRANCH                   @M04AE95 60036001
         MVC   L0(L13,R8),ERRORMSG YES,PUT ERROR IN LABEL      @M04AE95 60037001
         B     RETURN                                          @M04AE95 60038001
NOERROR  MVC   L0(L13,R8),BLANKS  ZERO LABEL,NO ERROR          @M04AE95 60039001
         B     RETURN                                          @M04AE95 60040001
*                                                                S21021 60050002
RECTYPE  STM   R5,R8,XSAVE                                       S21021 60100002
         LR    R5,R3                    SET UP DATA SLOT FOR TYPES21021 60150002
         LA    R6,L31                                            S21021 60200002
         SR     R5,R6                                            S21021 60250002
         TM    0(R4),HEX20              SHORT RECORD?            S21021 60300002
         BO    RECSHORT                                          S21021 60350002
         MVC   0(L10,R5),UNITCK         INSERT DATA 'UNIT CHECK' S21021 60400002
         B     RETURN                                            S21021 60450002
RECSHORT MVC   0(L10,R5),OVFL           DATA = 'OVERFLOW'        S21021 60500002
         B     RETURN                                            S21021 60550002
STLBLEND DC    F'0'                                              S21088 60600002
WORK     DS    D                                                 S21021 60650002
SAVE2    DS    F                                                 S21021 60700002
OBRAREA  DS    CL104                                             S21021 60750002
BLANKS   DC    CL25' '                                           S21021 60800002
ET00D    DC    X'FE'                                                    60850002
         DC    CL8'IFCET00D'                                            60900002
HW21     DC    H'21'                                             S21021 60950002
HW13     DC    H'13'                                             S21021 61000002
ERRORMSG DC    C'/// ERROR ///'                                @M04AE95 61020001
UNITCK   DC    C'UNIT CHECK'                                     S21021 61050002
OVFL     DC    C'OVERFLOW  '                                     S21021 61100002
SERNO    DC    C'SERIAL NO.'                                     S21021 61150002
MPCPU    DC    C'MULTIPROCESSOR - CPU'                           S21021 61200002
UNIVERS  DC    C'UNIVERSAL   SERIAL NO. NONE  '                  S21021 61250002
JOBID    DC    C'JOB IDENTITY'                                   S21021 61300002
UNDEF    DC    C'UNDEFINED   '                                 @XA20885 61305001
MICR     DC    C'MICR        '                                 @XA20885 61309001
RUNCTL   DC    C'RUN CTL     '                                 @XA20885 61313001
INSPRT   DC    C'INS/PRT     '                                 @XA20885 61317001
DIH      DC    C'DIH         '                                 @XA20885 61321001
CHANADPT DC    C'CHAN ADAPT  '                                 @XA20885 61325001
RECO     DC    C'RECO        '                                 @XA20885 61329001
MICRFILM DC    C'MICROFILM   '                                 @XA20885 61333001
GEN      DC    C'GENERAL     '                                 @XA20885 61337001
OCR      DC    C'OCR         '                                 @XA20885 61341001
         DS    0F                                                       61350002
XSAVE    DC    5F'0'                                                    61400002
NONE     DC    CL6'NONE  '                                              61450002
CHARS    DC    C'0123456789ABCDEF'                                      61500002
CHAR0    DC    C'0'                                                     61550002
RELTAB   DS    0C                                              @L03976  61600002
         DC    C'OS  '                                         @L03976  61650002
         DC    C'DOS '                                         @L03976  61700002
         DC    C'VS1 '                                         @L03976  61750001
         DC    C'V370'                                         @L03976  61800002
         DC    C'VS2 '                                         @L03976  61850001
         DC    C'    '                                         @L03976  61900002
         DC    C'    '                                         @L03976  61950002
         DC    C'    '                                         @L03976  62000002
EXTEND   DC    A(EXTSNS-4)                                              62050002
EXTEND1  DC    A(EXTSNS1-1)                                             62100002
FINISH   DC    A(FINIS-4)                                               62150002
FINISH1  DC    A(FINIS1-1)                                              62200002
*                                                                       62250002
HEX0F    EQU   X'0F'                                                    62300002
*                       TABLE CONSTANTS                                 62350002
ENTRIES  DS    0F                                                       62400002
         DC    XL4'00000000'       FORMAT1                              62450002
         DC    XL4'00000000'       FORMAT2                              62500002
         DC    A(LABELS)                LABEL PTR                       62550002
         DC    H'0'                     DISP                            62600002
         LINE                                                           62650002
         ROUTINE CLASS,CKTYPE                                           62700002
         LABEL ''                                                       62750002
         LINE  SKIP=E                                                   62800002
         LABEL ''                                                       62850002
         LINE  (55,22),(1,35),SKIP=1                             S21021 62900001
         ROUTINE  SW2B0,RECTYPE                                  S21021 62950002
         HEX   XMODEL,0,2B                                       S21021 63000002
         HEX   XSER,0,3B                                         S21021 63050002
         ROUTINE XMODEL,SETCPUNO                                 S21021 63100002
         LABEL '---RECORD ENTRY TYPE -','   SOURCE - OUTBOARD',        X63150002
               'MODEL '                                          S21021 63200001
         LINE  (13,1),(4,1)                                      S21021 63220001
         ROUTINE    XRELN,CONVREL                                       63300002
         LABEL      'XXXX REL '                                @XA19168 63350001
         LINE  (69,1),(31,19)                                    S21021 63400002
         ROUTINE XPGN1,SETPGMN                                   S21021 63450002
         LABEL 'DAY YEAR','HH MM SS.TH'                          S21021 63500002
         LINE  (31,19),(25,19),SKIP=2                                   63550002
         ROUTINE XDATE,SETDATE                                   S21021 63600002
         HEX   XTIME,1,4B                                        S21021 63650002
         ROUTINE  XDUM1,SKIPPER                                  S21021 63700002
         HEX   XPGN1,B6,4B                                       S21021 63750002
         HEX   XPGN2,B16,4B                                      S21021 63800002
         ROUTINE  SW2B0,NONAME                                   S21021 63850002
         LABEL 'DATE ','TIME '                                   S21021 63900001
         LINE  ,(1,1),SKIP=2                                     S21021 63950002
         ROUTINE XDUM1,SETCONV                                   S21021 64000002
         LABEL 'OBR RECORD CONVERTED TO THE STANDARD FORMAT'     S21021 64050002
         LINE  (32,1),(2,41),SKIP=1                            @XA20899 64250001
         HEX   XCUA2,0,2B                                        S21021 64300001
         ROUTINE XDUM1,SKIPPER                                          64350002
         LABEL 'FAILING CHANNEL/UNIT ADDRESS','DEVICE TYPE  3895'       64400001
         LINE                                                           64450002
         ROUTINE XDUM1,SKIPPER                                          64500002
         LABEL ' '                                               S21021 64550002
         LINE  (1,1),(23,38)                                     S21021 64600002
         ROUTINE XDUM1,SKIPPER                                          64650002
         LABEL 'CC   DA   FL     CT','K    CA   US CS  CT'       S21021 64700001
         LINE  (23,3),(5,46),SKIP=2                              S21021 64720001
         HEX   XFCCWCC,0,1B                                      S21021 64800002
         HEX   XFCCWDA,0,3B                                      S21021 64850002
         ROUTINE  XDUM1,SPACER1                                  S21021 64900002
         HEX   XFCCWFL,0,1B                                      S21021 64950002
         HEX   XZERO,0,1B                                        S21021 65000002
         HEX   XFCCWCT,0,2B                                      S21021 65050002
         ROUTINE  XDUM1,SPACER16                                 S21021 65100002
         HEX   XCSWK,0,1B                                        S21021 65150002
         HEX   XCSWCA,0,3B                                       S21021 65200002
         ROUTINE  XDUM1,SPACER1                                  S21021 65250002
         ROUTINE XCSWATTN,SETHEX                                        65300002
         ROUTINE XCSWPCI,SETHEX                                         65350002
         HEX   XCSWCT,0,2B                                       S21021 65400002
         LABEL 'FAILING CCW','CSW'                               S21021 65450002
         LINE  ,(16,55),SKIP=1                                 @XA20899 65500001
         ROUTINE XDUM1,SKIPPER                                          65550002
         LABEL '--- UNIT STATUS ---','--- CHANNEL STATUS ---'           65600002
         LINE  (20,28),(3,28),SKIP=1                                    65650002
         BIN   XCSWATTN                                                 65700002
         BIN   XCSWCE                                                   65750002
         BIN   XCSWPCI                                                  65800002
         BIN   XCSWCDC                                                  65850002
         LABEL 'ATTENTION','CHANNEL END','PRGM-CTLD IRPT',             *65900002
               'CHAN DATA CHECK'                                        65950002
         LINE                                                           66000002
         BIN   XCSWSM                                                   66050002
         BIN   XCSWDE                                                   66100002
         BIN   XCSWSILI                                                 66150002
         BIN   XCSWCCC                                                  66200002
         LABEL 'STATUS MODIFIER','DEVICE END','INCORRECT LENGTH',      *66250002
               'CHAN CTL CHECK'                                         66300002
         LINE                                                           66350002
         BIN   XCSWCUE                                                  66400002
         BIN   XCSWUC                                                   66450002
         BIN   XCSWPC                                                   66500002
         BIN   XCSWICC                                                  66550002
         LABEL 'CONTROL UNIT END','UNIT CHECK','PROGRAM CHECK',        *66600002
               'I/F CTL CHECK'                                          66650002
         LINE  ,,SKIP=2                                                 66700002
         BIN   XCSWBSY                                                  66750002
         BIN   XCSWUE                                                   66800002
         BIN   XCSWPCHK                                                 66850002
         BIN   XCSWCH                                                   66900002
         LABEL 'BUSY','UNIT EXCEPTION','PROTECTION CHECK',     @M04AE95*66950002
               'CHAINING CHECK'                                         67000002
*                                                                       67200002
         LINE  (24,1),(1,28),SKIP=2                                     67250002
         ROUTINE    XDUM1,SKIPPER                                       67300002
         LABEL      'SENSE BYTE DATA'                                   67350002
*                                                                       67400002
         LINE  (19,40),(4,41),SKIP=1                           @XA20899 67450001
         ROUTINE  BASC10,SETHEX                                         67500002
         ROUTINE  BASC20,SETHEX                                         67520002
         LABEL 'BYTE 0','BYTE 1'                               @XA20891 67600001
         LINE  (20,17),(5,18),SKIP=0                           @XA20899 67640001
         BIN   BASC10                                          @XA20899 67680001
         BIN   BASC14                                          @XA20899 67720001
         LABEL  'COMMAND REJ','DATA CHK'                       @XA20899 67760001
         LINE  (60,18),(46,18),SKIP=1                          @XA20899 67800001
         BIN   BASC20                                          @XA20899 67840001
         BIN   BASC24                                          @XA20899 67880001
         LABEL 'PREDICTOR REQ','INVALID CMD'                   @XA20899 67920001
         LINE  (20,17),(5,18),SKIP=0                           @XA20899 67960001
         BIN   BASC11                                          @XA20899 68000001
         BIN   BASC15                                          @XA20899 68040001
         LABEL 'INTRVN REQD','BIT 5'                           @XA20899 68080001
         LINE  (60,18),(46,18),SKIP=1                          @XA20899 68120001
         BIN   BASC21                                          @XA20899 68160001
         BIN   BASC25                                          @XA20899 68200001
         LABEL 'FEATURE CHK','INCOMP PROC'                     @XA20899 68240001
         LINE  (20,17),(5,18),SKIP=0                           @XA20899 68280001
         BIN   BASC12                                          @XA20899 68320001
         BIN   BASC16                                          @XA20899 68360001
         LABEL 'BUS OUT CHK','NOT INIT'                        @XA20899 68400001
         LINE  (60,18),(46,18),SKIP=1                          @XA20899 68440001
         BIN   BASC22                                          @XA20899 68480001
         BIN   BASC26                                          @XA20899 68520001
         LABEL 'FEED CMD REQD','MERGE FEED'                    @XA20899 68560001
         LINE  (20,17),(5,18),SKIP=0                           @XA20899 68600001
         BIN   BASC13                                          @XA20899 68640001
         BIN   BASC17                                          @XA20899 68680001
         LABEL 'EQUIP CHK','RUNNING'                           @XA20899 68720001
         LINE  (60,18),(46,18),SKIP=2                          @XA20899 68760001
         BIN   BASC23                                          @XA20899 68800001
         BIN   BASC27                                          @XA20899 68840001
         LABEL 'BIT 3','PROC NOT FUNC'                         @XA20899 68880001
         LINE                                                           69250002
         ROUTINE BASC13,CHKPROC                                @M04AE95 69300002
         LABEL ' '                                             @M04AE95 69305002
         LINE  (29,9),(1),SKIP=0                               @M04AE95 69310001
         HEX   (SNS11,0,4B)                                    @M04AE95 69315002
         HEX   (SNS21,0,4B)                                    @M04AE95 69320002
         HEX   (SNS31,0,4B)                                    @M04AE95 69325002
         HEX   (SNS41,0,4B)                                    @M04AE95 69330002
         LABEL ' '                                             @XA20899 69331001
         LINE  (66,9),(1),SKIP=0                               @XA20899 69332001
         HEX   (SNS51,0,4B)                                    @M04AE95 69335002
         HEX   (SNS61,0,4B)                                    @M04AE95 69340002
         HEX   (SNS71,0,4B)                                    @M04AE95 69345002
         HEX   (SNS81,0,4B)                                    @M04AE95 69350002
         LABEL 'PROCESSOR SENSE BYTE DATA -'                   @M04AE95 69360001
         LINE  ,(103),SKIP=2                                   @XA19168 69362001
         ROUTINE SNSSTAT0,CHKERROR                             @XA19168 69364001
         LABEL '             '                                 @XA19168 69366001
         LINE  (33),(4),SKIP=2                                 @XA20899 69370001
         HEX   (SNS11,0,3B)                                    @M04AE95 69380002
         LABEL  'CURRENT INSTRUCTION -0,1,2-'                  @XA20891 69390001
         LINE  (22,18),(4,22),SKIP=0                           @XA20891 69396001
         ROUTINE SNS040,SETHEX                                 @M04AE95 69410001
         ROUTINE SNS050,SETHEX                                 @M04AE95 69415001
         LABEL 'ERR REG -4-','ERR REG -5-'                     @XA20899 69430001
         LINE  (62,21),(44,22),SKIP=1                          @XA20899 69436001
         ROUTINE SNS060,SETHEX                                 @M04AE95 69450002
         ROUTINE SNS070,SETHEX                                 @M04AE95 69460002
         LABEL 'CTL LATCHES -6-','CTL LATCHES -7-'             @XA20891 69470001
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69480002
         BIN   SNS040                                          @M04AE95 69490002
         BIN   SNS050                                          @M04AE95 69500002
         LABEL 'PROG SET HARD ERR','A-PRTY CHK'                @M04AE95 69510002
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69520002
         BIN   SNS060                                          @M04AE95 69530002
         BIN   SNS070                                          @M04AE95 69540002
         LABEL 'WAIT STATE','DELAYED STOP'                     @M04AE95 69550002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69560002
         BIN   SNS041                                          @M04AE95 69570002
         BIN   SNS051                                          @M04AE95 69580002
         LABEL 'CS DATA CHK','B-PRTY CHK'                      @M04AE95 69590002
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69600002
         BIN   SNS061                                          @M04AE95 69610002
         BIN   SNS071                                          @M04AE95 69620002
         LABEL 'PRIORITY RUN MODE','BUSY'                      @M04AE95 69630002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69640002
         BIN   SNS042                                          @M04AE95 69650002
         BIN   SNS052                                          @M04AE95 69660002
         LABEL 'CS ADDR CHK','SCAN BUFR CHK'                   @M04AE95 69670002
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69680002
         BIN   SNS062                                          @M04AE95 69690002
         BIN   SNS072                                          @M04AE95 69700002
         LABEL 'INTRPT RUN MODE','RUN'                         @M04AE95 69710002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69720002
         BIN   SNS043                                          @M04AE95 69730002
         BIN   SNS053                                          @M04AE95 69740002
         LABEL 'CYCLE CTL CHK','CHAN TIME-OUT'                 @XA20886 69750001
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69760002
         BIN   SNS063                                          @M04AE95 69770002
         BIN   SNS073                                          @M04AE95 69780002
         LABEL 'INTRPT LATCH','BIT 3'                          @M04AE95 69790002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69800002
         BIN   SNS044                                          @M04AE95 69810002
         BIN   SNS054                                          @M04AE95 69820002
         LABEL 'BIT 4','BIT 4'                                 @M04AE95 69830001
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69840002
         BIN   SNS064                                          @M04AE95 69850002
         BIN   SNS074                                          @M04AE95 69860002
         LABEL 'BIT 4','REGS FULL'                             @M04AE95 69870002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69880002
         BIN   SNS045                                          @M04AE95 69890002
         BIN   SNS055                                          @M04AE95 69900002
         LABEL 'BIT 5','BIT 5'                                 @M04AE95 69910001
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 69920002
         BIN   SNS065                                          @M04AE95 69930002
         BIN   SNS075                                          @M04AE95 69940002
         LABEL 'BIT 5','PRE-FETCH INHBT'                       @M04AE95 69950002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 69960002
         BIN   SNS046                                          @M04AE95 69970002
         BIN   SNS056                                          @M04AE95 69980002
         LABEL 'BIT 6','BIT 6'                                 @M04AE95 69990001
         LINE  (63,21),(45,22),SKIP=1                          @M04AE95 70000002
         BIN   SNS066                                          @M04AE95 70010002
         BIN   SNS076                                          @M04AE95 70020002
         LABEL 'BIT 6','FETCH 1'                               @M04AE95 70030002
         LINE  (23,18),(5,22),SKIP=0                           @M04AE95 70040002
         BIN   SNS047                                          @M04AE95 70050002
         BIN   SNS057                                          @M04AE95 70060002
         LABEL 'BIT 7','BIT 7'                                 @M04AE95 70070001
         LINE  (63,21),(45,22),SKIP=2                          @M04AE95 70080002
         BIN   SNS067                                          @M04AE95 70090002
         BIN   SNS077                                          @M04AE95 70100002
         LABEL 'BIT 7','USE 1'                                 @M04AE95 70110002
         LINE  (31),(4),SKIP=1                                 @XA20899 70120001
         HEX   (SNS41,0,2B)                                    @M04AE95 70130002
         LABEL 'C-ADDRESS COUNTER -12,13-'                     @XA20891 70140001
         LINE  (20,29),(4,26),SKIP=1                           @XA20891 70146001
         HEX   (SNS42,0,2B)                                    @M04AE95 70160002
         HEX   (SNS51,0,2B)                                    @M04AE95 70170002
         LABEL 'CSAR 1 -14,15-','BAL REG 1 -16,17-'            @XA20891 70180001
         LINE  (20,29),(4,26),SKIP=2                           @XA20891 70186001
         HEX   (SNS52,0,2B)                                    @M04AE95 70200002
         HEX   (SNS61,0,2B)                                    @M04AE95 70210002
         LABEL 'CSAR 2 -18,19-','BAL REG 2 -20,21-'            @XA20891 70220001
         LINE  ,(4,28),SKIP=1                                  @XA20891 70240001
         LABEL 'PRIORITY -    REQ REG -8-',                    @XA20891*70260001
               'MASK REG -9-   REG 1 -10-    REG 2 -11-'       @XA20891 70280001
         LINE  (23,14),(5),SKIP=1                              @XA20891 70300001
         BIN   SNS080                                          @M04AE95 70350002
         BIN   SNS090                                          @M04AE95 70370002
         BIN   SNS100                                          @M04AE95 70400002
         BIN   SNS110                                          @M04AE95 70410002
         LABEL 'MACH CHK'                                      @M04AE95 70420002
         LINE  (23,14),(5),SKIP=1                              @XA20899 70450001
         BIN   SNS081                                          @M04AE95 70470002
         BIN   SNS091                                          @M04AE95 70500002
         BIN   SNS101                                          @M04AE95 70510002
         BIN   SNS111                                          @M04AE95 70520002
         LABEL 'TIMER'                                         @M04AE95 70550002
         LINE  (23,14),(5),SKIP=1                              @XA20899 70570001
         BIN   SNS082                                          @M04AE95 70600002
         BIN   SNS092                                          @M04AE95 70610002
         BIN   SNS102                                          @M04AE95 70620002
         BIN   SNS112                                          @M04AE95 70650002
         LABEL 'MICR'                                          @M04AE95 70670002
         LINE  (23,14),(5),SKIP=1                              @XA20899 70700001
         BIN   SNS083                                          @M04AE95 70710002
         BIN   SNS093                                          @M04AE95 70720002
         BIN   SNS103                                          @M04AE95 70750002
         BIN   SNS113                                          @M04AE95 70770002
         LABEL 'CHAN ADAPT'                                    @M04AE95 70800002
         LINE  (23,14),(5),SKIP=1                              @XA20899 70810001
         BIN   SNS084                                          @M04AE95 70820002
         BIN   SNS094                                          @M04AE95 70850002
         BIN   SNS104                                          @M04AE95 70870002
         BIN   SNS114                                          @M04AE95 70900002
         LABEL 'CE PANEL'                                      @M04AE95 70910002
         LINE  (23,14),(5),SKIP=1                              @XA20899 70920001
         BIN   SNS085                                          @M04AE95 70950002
         BIN   SNS095                                          @M04AE95 70970002
         BIN   SNS105                                          @M04AE95 71000002
         BIN   SNS115                                          @M04AE95 71010002
         LABEL 'DIH'                                           @M04AE95 71020002
         LINE  (23,14),(5),SKIP=1                              @XA20899 71050001
         BIN   SNS086                                          @M04AE95 71070002
         BIN   SNS096                                          @M04AE95 71100002
         BIN   SNS106                                          @M04AE95 71110002
         BIN   SNS116                                          @M04AE95 71120002
         LABEL 'TRANSPORT'                                     @M04AE95 71150002
         LINE  (23,14),(5),SKIP=1                              @XA20899 71170001
         BIN   SNS087                                          @M04AE95 71200002
         BIN   SNS097                                          @M04AE95 71210002
         BIN   SNS107                                          @M04AE95 71220002
         BIN   SNS117                                          @M04AE95 71250002
         LABEL 'OCR'                                           @M04AE95 71270002
FINIS    LINE  ,,SKIP=1                                                 71350002
         ROUTINE XDUM1,SKIPPER                                          71400002
FINIS1   LABEL ''                                                       71450002
         DC    X'FF'                                                    71500002
         DC    X'006E'                                         @M04AE95 71550002
         DC    X'0018'                                                  71600002
         DC    X'0000'                                                  71650002
*                                                                       71700002
EXTSNS   LINE  (28,9),(1),SKIP=0                               @M04AE95 71750001
         HEX   (SNS11,0,4B)                                    @M04AE95 71757002
         HEX   (SNS21,0,4B)                                    @M04AE95 71764002
         HEX   (SNS31,0,4B)                                    @M04AE95 71771002
         HEX   (SNS41,0,4B)                                    @M04AE95 71778002
         HEX   (SNS51,0,4B)                                    @M04AE95 71785002
         HEX   (SNS61,0,4B)                                    @M04AE95 71792002
         HEX   (SNS71,0,4B)                                    @M04AE95 71800002
         HEX   (SNS81,0,4B)                                    @M04AE95 71810002
EXTSNS1  LABEL 'EXTENDED SENSE BYTE DATA - '                   @M04AE95 71820001
         LINE  ,(103),SKIP=2                                   @XA19168 71827001
         ROUTINE SNSSTAT0,CHKERROR                             @XA19168 71834001
         LABEL '             '                                 @XA19168 71841001
         LINE  (18,20),(2,20),SKIP=1                           @XA20899 71850001
         ROUTINE   SNS000,SETHEX                                        71950002
         ROUTINE   SNS010,SETHEX                                        72000002
         ROUTINE   SNS020,SETHEX                                        72050002
         ROUTINE   SNS030,SETHEX                                        72100002
         ROUTINE   SNS040,SETHEX                                        72150002
         ROUTINE   SNS050,SETHEX                                        72200002
         LABEL 'INS/PRT -0-','MICR 1 -1-','DIH -2-',           @XA20891*72250001
               'VIDEO -3-','RUN CTL -4-','RECO -5-'            @XA20891 72260001
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 72300002
         BIN   SNS000                                                   72400002
         BIN   SNS010                                                   72450002
         BIN   SNS020                                                   72500002
         BIN   SNS030                                                   72550002
         BIN   SNS040                                                   72600002
         BIN   SNS050                                                   72650002
         LABEL 'CTL ERR','BIT 0','M-BUFR PRTY CHK',            @M04AE95*72700002
               'BEAM NOT MVNG','ENDORSER CHK','MCS PRTY CHK'   @M04AE95 72720002
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 72750002
         BIN   SNS001                                                   72850002
         BIN   SNS011                                                   72900002
         BIN   SNS021                                                   72950002
         BIN   SNS031                                                   73000002
         BIN   SNS041                                                   73050002
         BIN   SNS051                                                   73100002
         LABEL 'PRT COIL ERR','BUFR PRTY CHK',                 @M04AE95*73150002
               'CMP ST PRTY CHK','RTS, NO TRACE','BIT 1',      @M04AE95*73160001
               'MCS HANG CHK'                                  @M04AE95 73170002
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 73200002
         BIN   SNS002                                                   73300002
         BIN   SNS012                                                   73350002
         BIN   SNS022                                                   73400002
         BIN   SNS032                                                   73450002
         BIN   SNS042                                                   73500002
         BIN   SNS052                                                   73550002
         LABEL 'INS COIL ERR','BIT 2','M-BUFR ADDR CHK',       @M04AE95*73600002
               'WINDOW OVRSCN','BIT 2','INVLD OP CODE'         @M04AE95 73620002
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 73650002
         BIN   SNS003                                                   73750002
         BIN   SNS013                                                   73800002
         BIN   SNS023                                                   73850002
         BIN   SNS033                                                   73900002
         BIN   SNS043                                                   73950002
         BIN   SNS053                                                   74000002
         LABEL 'BUFR PRTY CHK','BIT 3','CMP ST ADDR CHK',      @M04AE95*74050001
               'ROTATION ERR','BIT 3','VIS ADDR CHK'           @M04AE95 74070002
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 74100002
         BIN   SNS004                                                   74200002
         BIN   SNS014                                                   74250002
         BIN   SNS024                                                   74300002
         BIN   SNS034                                                   74350002
         BIN   SNS044                                                   74400002
         BIN   SNS054                                                   74450002
         LABEL 'BUFR ADDR CHK','BUFR CHR OVRN','PROG CHK',     @M04AE95*74500002
               'READ DATA CHK','BIT 4','BIT 4'                 @M04AE95 74520001
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 74550002
         BIN   SNS005                                                   74650002
         BIN   SNS015                                                   74700002
         BIN   SNS025                                                   74750002
         BIN   SNS035                                                   74800002
         BIN   SNS045                                                   74850002
         BIN   SNS055                                                   74900002
         LABEL 'BIT 5','BIT 5','TIME-OUT ERR',                 @M04AE95*74950001
               'WRITE DATA CHK','BIT 5','BIT 5'                @M04AE95 74960002
         LINE  (19,20),(3,20),SKIP=1                           @M04AE95 74970002
         BIN   SNS006                                                   75050002
         BIN   SNS016                                                   75100002
         BIN   SNS026                                                   75150002
         BIN   SNS036                                                   75200002
         BIN   SNS046                                                   75250002
         BIN   SNS056                                                   75300002
         LABEL 'BIT 6','BIT 6','DCS SPEC ERR','LOW CRT PMT I',         *75350001
               'BIT 6','BIT 6'                                 @XA20889 75360001
         LINE  (19,20),(3,20),SKIP=2                           @M04AE95 75400002
         BIN   SNS007                                                   75450002
         BIN   SNS017                                                   75500002
         BIN   SNS027                                                   75550002
         BIN   SNS037                                                   75600002
         BIN   SNS047                                                   75650002
         BIN   SNS057                                                   75700002
         LABEL 'BIT 7','BIT 7','BIT 7','LOW DOC PMT I','BIT 7','BIT 7'  75750001
         LINE  (23,91),(2,94),SKIP=0                           @XA20899 75751001
         ROUTINE SNS170,SETHEX                                 @M04AE95 75754002
         HEX   (SNS22,0,3B)                                    @M04AE95 75756002
         LABEL 'CC ADDRESS REG -17-','MCS DATA -6,7,8-'        @XA20891 75758001
         LINE  ,(28),SKIP=1                                    @XA20891 75758301
         ROUTINE SNS170,CCTYPE                                 @XA19168 75759001
         LABEL '            '                                  @XA19168 75759501
         LINE  (22,94),(2,94),SKIP=0                           @XA20899 75760001
         HEX   (SNS61,0,2B)                                    @M04AE95 75762001
         HEX   (SNSMCS,0,2B)                                   @M04AE95 75763001
         LABEL 'ERROR CODE -20,21-','MCS ADDRESS -9,10-'       @XA20885 75766001
         LINE  ,(28),SKIP=2                                    @XA20891 75766601
         ROUTINE SNS200,CCTYPE                                 @XA20891 75767201
         LABEL '            '                                  @XA20891 75767801
         LINE  (22,24),(2,24),SKIP=1                           @XA20891 75768401
         ROUTINE SNS160,SETHEX                                 @M04AE95 75770002
         ROUTINE SNS180,SETHEX                                 @M04AE95 75772002
         ROUTINE SNS190,SETHEX                                 @M04AE95 75774002
         ROUTINE SNS220,SETHEX                                 @XA20899 75776001
         ROUTINE SNS230,SETHEX                                 @XA20899 75777001
         LABEL 'CC ERR REG -16-','UNIT STAT REG -18-',         @XA20891*75778001
               'CC STAT REG -19-',                             @XA20891*75779001
               'MICROFILM -22-','OCR PROC -23-'                @XA20891 75780001
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75782002
         BIN   SNS160                                          @M04AE95 75784002
         BIN   SNS180                                          @M04AE95 75786002
         BIN   SNS190                                          @M04AE95 75788002
         BIN   SNS220                                          @XA20899 75790001
         BIN   SNS230                                          @XA20899 75790801
         LABEL 'BIT 0','BIT 0','ANY CHAN CHK','LAMP CHK FRT',  @XA20899*75791601
               'A-PRTY CHK'                                    @XA20899 75792401
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75794002
         BIN   SNS161                                          @M04AE95 75796002
         BIN   SNS181                                          @M04AE95 75798002
         BIN   SNS191                                          @M04AE95 75800002
         BIN   SNS221                                          @XA20899 75802001
         BIN   SNS231                                          @XA20899 75802801
         LABEL 'BIT 1','BIT 1','UNIT RESP TAG','LAMP CHK RR',  @XA20899*75803601
               'B-PRTY CHK'                                    @XA20899 75804401
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75806002
         BIN   SNS162                                          @M04AE95 75808002
         BIN   SNS182                                          @M04AE95 75810002
         BIN   SNS192                                          @M04AE95 75812002
         BIN   SNS222                                          @XA20899 75814001
         BIN   SNS232                                          @XA20899 75814801
         LABEL 'NON-SELECT CHK','BIT 2','ACTIVE','CAPSTAN CHK',        *75815601
               'FE ADDR CHK'                                   @XA20899 75816401
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75818002
         BIN   SNS163                                          @M04AE95 75820002
         BIN   SNS183                                          @M04AE95 75822002
         BIN   SNS193                                          @M04AE95 75824002
         BIN   SNS223                                          @XA20899 75826001
         BIN   SNS233                                          @XA20899 75826801
         LABEL 'GET DATA CHK','BIT 3','GET DATA TAG',          @XA20899*75827601
               'SHUTTER CHK','VB ADDR CHK'                     @XA20899 75828401
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75830002
         BIN   SNS164                                          @M04AE95 75832002
         BIN   SNS184                                          @M04AE95 75834002
         BIN   SNS194                                          @M04AE95 75836002
         BIN   SNS224                                          @XA20899 75838001
         BIN   SNS234                                          @XA20899 75838601
         LABEL 'PUT DATA CHK','UNIT SELECTED','PUT DATA TAG',  @M04AE95*75840002
               'BIT 4','FB PRTY CHK'                           @XA20891 75842001
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75844002
         BIN   SNS165                                          @M04AE95 75846002
         BIN   SNS185                                          @M04AE95 75848002
         BIN   SNS195                                          @M04AE95 75850002
         BIN   SNS225                                          @XA20899 75853001
         BIN   SNS235                                          @XA20899 75854001
         LABEL 'TAG CHK','PREDICTOR DATA','SET TAG','BIT 5',   @XA20891*75855001
               'VB PRTY CHK'                                   @XA20899 75856001
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75859002
         BIN   SNS166                                          @M04AE95 75862002
         BIN   SNS186                                          @M04AE95 75865002
         BIN   SNS196                                          @M04AE95 75868002
         BIN   SNS226                                          @XA20899 75871001
         BIN   SNS236                                          @XA20899 75872001
         LABEL 'SELECT CHK','UNIT ERR','CHAN BUSY','BIT 6',    @XA20891*75873001
               'CHAN TIME-OUT'                                 @XA20891 75874001
         LINE  (23,24),(3,24),SKIP=1                           @M04AE95 75877002
         BIN   SNS167                                          @M04AE95 75880002
         BIN   SNS187                                          @M04AE95 75883002
         BIN   SNS197                                          @M04AE95 75886002
         BIN   SNS227                                          @XA20899 75889001
         BIN   SNS237                                          @XA20899 75890001
         LABEL 'ADDR CHK','BIT 7','BURST MODE','BIT 7','BIT 7' @XA20891 75891001
         LINE  ,(1,1)                                          @M04AE95 75895002
         LABEL ''                                                       75900002
         DC    X'FF'                                                    75950002
         DC    X'006E'                                         @M04AE95 76000002
         DC    X'0018'                                                  76050002
         DC    X'0000'                                                  76100002
LABELS   DS    0F                                                       76150002
         LSTART                                                         76200002
         END                                                            76250002
