         TITLE 'IFCE2860 - EDIT TABLE - LINKNAME=IFCE2860'              00060020
         TITLE 'IFCE2860 - EDIT TABLE - LINKNAME=IFCE2860'              00120020
         MACRO                                                          00180002
&NAME    DSGEN ,                                                        00200002
.*                            THIS MACRO GENERATES ONE DSECT WORD       00220002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 00240002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  00260002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    00280002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 00300002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   00320002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 00340002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      00360002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  00380002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    00400002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   00420002
         GBLC &ITEM(1500)                                      @YM2954P 00440002
         GBLA &ITEMNBR,&BITS(1500),&SHIFT(1500)                @YM2954P 00460002
         LCLB  &ONLY1,&CTIND                                   @YM2954P 00480002
         LCLA  &START1,&START2,&END1,&END2                     @YM2954P 00500002
         LCLC  &SYMBOL,&EQUSYM                                 @YM2954P 00520002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                        @YM2954P 00540002
         ACTR  100000                                          @YM2954P 00560002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                   @YM2954P 00580002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     00600002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   00620002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        00640002
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1   @YM2954P 00660002
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT    @YM2954P 00680002
         AGO   .SET2A                   BRANCH AROUND          @YM2954P 00700002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'     @YM2954P 00720002
         MEXIT                                                 @YM2954P 00740002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X00760002
               ).SET2                   TEST FOR NO SECOND     @YM2954P 00780002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   00800002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        00820002
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2   @YM2954P 00840002
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2     @YM2954P 00860002
         AGO   .LOOP                                           @YM2954P 00880002
.SET2    ANOP                                                  @YM2954P 00900002
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 00920002
         AGO   .LOOP                                           @YM2954P 00940002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'    @YM2954P 00960002
         MEXIT                                                 @YM2954P 00980002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'      @YM2954P 01000002
         MEXIT                                                 @YM2954P 01020002
.LOOP    ANOP                                                  @YM2954P 01040002
&OP      SETA  &OP+1                                           @YM2954P 01060002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE  @YM2954P 01080002
&ITEMNBR SETA  &ITEMNBR+1                                      @YM2954P 01100002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                   @YM2954P 01120002
         MNOTE '**NULL BIT COUNT FIELD**'                      @YM2954P 01140002
         MEXIT                                                 @YM2954P 01160002
.OK1     ANOP                                                  @YM2954P 01180002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                               @YM2954P 01200002
         AIF   ('&SYMBOL' NE '').OK                            @YM2954P 01220002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         01240002
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                @YM2954P 01260002
         AGO   .START                   GET NEXT               @YM2954P 01280002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        01300002
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU @YM2954P 01320002
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        01340002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         01360002
         AGO   .NO3                     BRANCH AROUND          @YM2954P 01380002
.OK2     ANOP                                                  @YM2954P 01400002
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED     @YM2954P 01420002
.NO3     ANOP                                                  @YM2954P 01440002
&SYMBOL  EQU   *+&BYTE                                         @YM2954P 01460002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL    @YM2954P 01480002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                           @YM2954P 01500002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                           @YM2954P 01520002
.CNT     ANOP                                                  @YM2954P 01540002
&CTIND   SETB  1                        SET COUNT INDICATOR    @YM2954P 01560002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                          @YM2954P 01580002
&BYTE    SETA  &COUNT/8                                        @YM2954P 01600002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        01620002
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        01640002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END    @YM2954P 01660002
&END1    SETA  &END1+1                  INCREMENT COUNT        @YM2954P 01680002
&OP      SETA  &OP-1                    DECREMENT INCREMENT    @YM2954P 01700002
         AGO   .LOOP                    GENERATE NEXT          @YM2954P 01720002
.TSTST   ANOP                                                  @YM2954P 01740002
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END      @YM2954P 01760002
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        01780002
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      01800002
.NSET1   ANOP                                                  @YM2954P 01820002
&OP      SETA  &OP-1                    DECREMENT INDEX        @YM2954P 01840002
&START1  SETA  &START1+1                INCREMENT FIRST COUNT  @YM2954P 01860002
         AGO   .LOOP                    GO DO NEXT             @YM2954P 01880002
.LPDONE  ANOP                                                  @YM2954P 01900002
&ONLY1   SETB  0                        CLEAR INDICATOR        @YM2954P 01920002
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      01940002
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 01960002
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT      @YM2954P 01980002
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES    @YM2954P 02000002
&NAME    DS    &COUNT.C                                        @YM2954P 02020002
.END     MEXIT                                                 @YM2954P 02040002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**' @YM2954P 02060002
         MEXIT                                                 @YM2954P 02080002
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   02100002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'          @YM2954P 02120002
         MEXIT                                                 @YM2954P 02140002
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         02160002
*****               THE FOLLOWING STATEMENT                *****        02180002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        02200002
.EQU2    ANOP                                                  @YM2954P 02220002
&EQUCNT  SETA  0                        CLEAR COUNTER          @YM2954P 02240002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND        @YM2954P 02260002
.EQULOP  ANOP                                                  @YM2954P 02280002
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX        @YM2954P 02300002
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     02320002
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?       @YM2954P 02340002
         AGO   .EQULOP                  NO-GET NEXT            @YM2954P 02360002
.EQUOUT  ANOP                                                  @YM2954P 02380002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME         @YM2954P 02400002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS     @YM2954P 02420002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT        @YM2954P 02440002
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED    @YM2954P 02460002
         AGO   .START                   RETURN FOR NEXT        @YM2954P 02480002
         MEND                                                  @YM2954P 02500002
         EJECT                                                          03180020
         MACRO                                                          03240020
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      03300020
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     03360020
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    03420020
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 03480020
.*                                 ENTRIES. LASTLY IT DETERMINES THE    03540020
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    03600020
.*                                 THE PREVIOUS LINE AND STORES THAT #  03660020
.*                                 INTO THE APPROPRIATE BYTE.           03720020
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    03780020
.*                                 DATA.                                03840020
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 03900020
.*                                 DATA COLUMN STARTING CHARACTERS.     03960020
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   04020020
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 04080020
.*                                 STARTING CHARACTERS.                 04140020
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   04200020
.*                                 TO BEGIN NEXT PRINTED LINE.          04260020
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       04320020
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   04380020
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 04440020
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   04500020
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 04560020
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    04620020
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   04680020
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   04740020
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  04800020
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   04860020
.*                                 THE SUBJECT LINE                     04920020
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  04980020
         GBLA  &LASTCC,&INITIAL                                         05040020
         GBLC  &NRENTSX                                                 05100020
         GBLC  &CARRCON                                                 05160020
         GBLB  &TEST                                                    05220020
         LCLA  &S                                                       05280020
&NAME    DS    0C                                                       05340020
         AIF   (&INITIAL EQ 0).FIRSTLN                                  05400020
         LINEND                                                         05460020
         AGO   .NTFIRST                                                 05520020
.FIRSTLN ANOP                                                           05580020
&NRENTSX SETC  'N&SYSNDX'                                               05640020
&INITIAL SETA  1                                                        05700020
N&SYSNDX EQU   *                                                        05760020
.NTFIRST ANOP                                                           05820020
         DC    AL1(0)                                                   05880020
         AIF   ('&DATA(1)' EQ '').CKDTABS                               05940020
         AIF   (&DATA(1) EQ &DB).CKDTABS                                06000020
&DB      SETA  &DATA(1)                                                 06060020
         AGO   .AA                                                      06120020
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                06180020
         AIF   (&DATA(2) EQ &DT).NCDATA                                 06240020
         AGO   .CC                                                      06300020
.AA      AIF   ('&DATA(2)' EQ '').BB                                    06360020
         AIF   (&DATA(2) EQ &DT).BB                                     06420020
.CC      ANOP                                                           06480020
&DT      SETA  &DATA(2)                                                 06540020
.*                                 CONVERSIONS.                         06600020
.*                            &LOGITEM - NAME OF DATA ITEM TO BE        06660020
.BB      DC    XL2'FFFE'                                                06720020
         DC    FL1'&DB'                                                 06780020
         DC    FL1'&DT'                                                 06840020
&NRENTS  SETA  &NRENTS+1                                                06900020
.NCDATA  ANOP                                                           06960020
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              07020020
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               07080020
&LB      SETA  &LABEL(1)                                                07140020
         AGO   .AAA                                                     07200020
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              07260020
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               07320020
         AGO   .CCC                                                     07380020
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  07440020
         AIF   (&LABEL(2) EQ &LT).BBB                                   07500020
.CCC     ANOP                                                           07560020
&LT      SETA  &LABEL(2)                                                07620020
.BBB     DC    XL2'FFFF'                                                07680020
         DC    FL1'&LB'                                                 07740020
         DC    FL1'&LT'                                                 07800020
&NRENTS  SETA  &NRENTS+1                                                07860020
.NCLABEL ANOP                                                           07920020
         AIF   ('&SKIP' NE '').CONT                                     07980020
         AIF   (&TEST EQ 0).NOCHANG                                     08040020
&S       SETA  &LASTCC                                                  08100020
         AGO   .DEFAULT                                                 08160020
.CONT    ANOP                                                           08220020
         AIF   (&TEST EQ 0).AB                                          08280020
&S       SETA  &SKIP                                                    08340020
.DEFAULT ANOP                                                           08400020
         ORG   &CARRCON+3                                               08460020
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 08520020
         ORG                                                            08580020
&LASTCC  SETA  &S                                                       08640020
&TEST    SETB  0                                                        08700020
         AGO   .DD                                                      08760020
.AB      AIF   (&SKIP EQ &LASTCC).NOCHANG                               08820020
A&SYSNDX DC    XL2'FFFB'                                                08880020
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              08940020
         DC    FL1'9'                                                   09000020
&LASTCC  SETA  &SKIP                                                    09060020
&TEST    SETB  1                                                        09120020
&CARRCON SETC  'A&SYSNDX'                                               09180020
&NRENTS  SETA  &NRENTS+1                                                09240020
.DD      ANOP                                                           09300020
.NOCHANG ANOP                                                           09360020
         MEND                                                           09420020
         EJECT                                                          09480020
         MACRO                                                          09540020
         BIN   &LOGITEM,&SKIP$OR                                        09600020
.*                                 &LOGITEM - NAME OF ITEM IN LOG       09660020
.*                                      RECORD DSECT                    09720020
.*                                 &SKIP$OR - NBR OF SPACES TO SKIP ON  09780020
.*                                 MULTIPLE PRINT OR NBR OF SPACES      09840020
.*                                      TO BACK UP FROM COLUMN FOR      09900020
.*                                      START OF PRINTING. THE LETTER   09960020
.*                                      B PRECEEDS THE NUMBER (B5) IF   10020020
.*                                      THE LATTER IS DESIRED. OMISSION 10080020
.*                                      OF THIS OPERAND FORCES OPTION 2 10140020
.*                                      WITH BACKUP SPACING EQUAL TO    10200020
.*                                 THE NUMBER OF BITS IN THE ITEM       10260020
.*                                 DEFINITION (VIA MACRO 'DSGEN').      10320020
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     10380020
.*                                 TOTAL NUMBER OF BITS TO PRINT.       10440020
         GBLC  &ITEM(1500)                                              10500020
         GBLA  &ITEMNBR,&BITS(1500),&SHIFT(1500),&NRENTS                10560020
         GBLC  &DSECT                                                   10620020
         LCLB  &B                                                       10680020
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   10740020
         LCLA  &TEMP,&T                                                 10800020
         LCLC  &S                                                       10860020
.LOOP    ANOP                                                           10920020
&NDX     SETA  &NDX+1                                                   10980020
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      11040020
         AIF   (&NDX LT &ITEMNBR).LOOP                                  11100020
         MNOTE *,'YOU BLEW IT'                                          11160020
         ROUTINE DUM,SKIPPER                                            11220020
         MEXIT                                                          11280020
.FOUND   ANOP                                                           11340020
&ISHIFT  SETA  &SHIFT(&NDX)                                             11400020
&IBITS   SETA  &BITS(&NDX)                                              11460020
&T       SETA  &IBITS-1                                                 11520020
&B       SETB  0                                                        11580020
         AIF   ('&SKIP$OR' EQ '').BACKUP                                11640020
&K       SETA  K'&SKIP$OR                                               11700020
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 11760020
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   11820020
&T       SETA  &S                                                       11880020
.BACKUP  ANOP                                                           11940020
&NRENTS  SETA  &NRENTS+1                                                12000020
&TEMP    SETA  &ISHIFT                                                  12060020
A&SYSNDX DC    AL.12(&LOGITEM-&DSECT),XL.4'&TEMP'                       12120020
         AIF (&IBITS EQ 1 AND &B EQ 0).OUT                              12180020
         ORG   A&SYSNDX                                                 12240020
&B       SETB  1                                                        12300020
         DC    AL.12(&LOGITEM-&DSECT),XL.4'C'                           12360020
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             12420020
.OUT     ANOP                                                           12480020
         MEND                                                           12540020
         EJECT                                                          12600020
         MACRO                                                 @YL02021 12660002
         HEX   ,                                               @YL02021 12690002
.*                            THIS MACRO FACILITATES GENERATION OF THE  12720002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    12750002
.*                                 CONVERSIONS.                @YL02021 12780002
.*                            &SYSLIST(&OP,1) - NAME OF DATA ITEM TO BE 12810002
.*                                 CONVERTED                   @YL02021 12840002
.*                            &SYSLIST(&OP,2) - # OF SPACES TO SKIP ON  12870002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   12900002
.*                                 BACK UP FROM COLUMN FOR START OF     12930002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  12960002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  12990002
.*                                 DESIRED. OMISSION OF THIS OPERAND    13020002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  13050002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  13080002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 13110002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    13140002
.*                                 IMPLICITLY B).              @YL02021 13170002
.*                            &SYSLIST(&OP,3) - NUMBER OF BYTES TO      13200002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     13230002
.*                                 WITH AN L,R, OR B TO STIPULATE       13260002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     13290002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     13320002
.*                                 RESPECTIVELY. OMISSION OF THIS       13350002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  13380002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 13410002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 13440002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   13470002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     13500002
.*                                 SUBJECT LINE(S).            @YL02021 13530002
         GBLC &ITEM(1500),&DSECT                               @YL02021 13560002
         GBLA &ITEMNBR,&BITS(1500),&SHIFT(1500),&NRENTS        @YL02021 13590002
         GBLA  &INITIAL                                        @YL02021 13620002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                      @YL02021 13650002
         LCLB  &B,&SUB                                         @YL02021 13680002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP,&OP     @YL02021 13710002
         LCLC  &S,&LETTER                                      @YL02021 13740002
         AIF   (&DIAGTST EQ 0).NOMSG                           @YL02021 13770002
         AIF   (&INITIAL EQ 0).NOMSG                           @YL02021 13800002
         AIF   (&DIAGLIN EQ 1).NOMSG                           @YL02021 13830002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'         @YL02021 13860002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****            @YL02021 13890002
*        LINE                                                  @YL02021 13920002
         LINE                                                  @YL02021 13950002
.NOMSG   ANOP                                                  @YL02021 13980002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP         @YL02021 14010002
&SUB     SETB  1                                               @YL02021 14040002
.LOOP    ANOP                                                  @YL02021 14070002
&OP      SETA  &OP+1                                           @YL02021 14100002
.LOOP1   ANOP                                                  @YL02021 14130002
&NDX     SETA  &NDX+1                                          @YL02021 14160002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND      @YL02021 14190002
         AIF   (&NDX LT &ITEMNBR).LOOP1                        @YL02021 14220002
         MNOTE '**LOG ITEM NOT DEFINED**'                      @YL02021 14250002
         MEXIT                                                 @YL02021 14280002
.FOUND   ANOP                                                  @YL02021 14310002
&ISHIFT  SETA  &SHIFT(&NDX)                                    @YL02021 14340002
&IBITS   SETA  &BITS(&NDX)                                     @YL02021 14370002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).ALIGN            @YL02021 14400002
.ERR     MNOTE '**DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY**' @YL02021 14430002
         MEXIT                                                 @YL02021 14460002
.ALIGN   ANOP                                                  @YL02021 14490002
&CODE    SETA  1                                               @YL02021 14520002
         AIF   (&SUB EQ 1).SUBA                                @YL02021 14550002
&K       SETA  K'&SYSLIST(3)                                   @YL02021 14580002
         AGO   .SUBB                                           @YL02021 14610002
.SUBA    ANOP                                                  @YL02021 14640002
&K       SETA  K'&SYSLIST(&OP,3)                               @YL02021 14670002
.SUBB    ANOP                                                  @YL02021 14700002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                   @YL02021 14730002
         MNOTE '**BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL**' 14760002
         MEXIT                                                 @YL02021 14790002
.OK      AIF   (&SUB EQ 1).SUBC                                @YL02021 14820002
         AIF   ('&SYSLIST(3)' EQ '').USEDEFN                   @YL02021 14850002
&LETTER  SETC  '&SYSLIST(3)'(&K,1)                             @YL02021 14880002
&S       SETC  '&SYSLIST(3)'(1,&K-1)                           @YL02021 14910002
         AGO   .SUBD                                           @YL02021 14940002
.SUBC    ANOP                                                  @YL02021 14970002
         AIF   ('&SYSLIST(&OP,3)' EQ '').USEDEFN               @YL02021 15000002
&LETTER  SETC  '&SYSLIST(&OP,3)'(&K,1)                         @YL02021 15030002
&S       SETC  '&SYSLIST(&OP,3)'(1,&K-1)                       @YL02021 15060002
.SUBD    ANOP                                                  @YL02021 15090002
&BYTESP  SETA  &S                                              @YL02021 15120002
         AIF   ('&LETTER' EQ 'B').BOTH                         @YL02021 15150002
         AIF   ('&LETTER' EQ 'L').LEFT                         @YL02021 15180002
&CODE    SETA  2                                               @YL02021 15210002
         AGO   .L                                              @YL02021 15240002
.LEFT    ANOP                                                  @YL02021 15270002
&CODE    SETA  1                                               @YL02021 15300002
         AGO   .L                                              @YL02021 15330002
.USEDEFN ANOP                                                  @YL02021 15360002
&BYTESP  SETA  &IBITS/8                                        @YL02021 15390002
.BOTH    AIF   (&ISHIFT NE 0).ERR                              @YL02021 15420002
&CODE    SETA  3                                               @YL02021 15450002
&T       SETA  &BYTESP*2-1                                     @YL02021 15480002
&S       SETC  '&T'                                            @YL02021 15510002
.OK2     AIF   (&ISHIFT EQ 0).L                                @YL02021 15540002
&CODE    SETA  2                                               @YL02021 15570002
.L       ANOP                                                  @YL02021 15600002
&B       SETB  1                                               @YL02021 15630002
         AIF   (&SUB EQ 1).SUBE                                @YL02021 15660002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                    @YL02021 15690002
&K       SETA  K'&SYSLIST(2)                                   @YL02021 15720002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                     @YL02021 15750002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                       @YL02021 15780002
         AGO   .SUBF                                           @YL02021 15810002
.SUBE    ANOP                                                  @YL02021 15840002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                @YL02021 15870002
&K       SETA  K'&SYSLIST(&OP,2)                               @YL02021 15900002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                 @YL02021 15930002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                   @YL02021 15960002
.SUBF    ANOP                                                  @YL02021 15990002
.BACKUP  ANOP                                                  @YL02021 16020002
&NRENTS  SETA  &NRENTS+1                                       @YL02021 16050002
         AIF   (&BYTESP GT 0 AND &BYTESP LT 16).SUB0           @YL02021 16080002
         MNOTE '**NO. OF BYTES OUTSIDE RANGE OF 1-15**'        @YL02021 16110002
         MEXIT                                                 @YL02021 16140002
.SUB0    AIF   (&SUB EQ 1).SUBG                                @YL02021 16170002
         DC    AL.12(&SYSLIST(1)-&DSECT),XL.4'A'               @YL02021 16200002
         AGO   .SUBH                                           @YL02021 16230002
.SUBG    ANOP                                                  @YL02021 16260002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'A'           @YL02021 16290002
.SUBH    ANOP                                                  @YL02021 16320002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'     @YL02021 16350002
.OUT     ANOP                                                  @YL02021 16380002
&NDX     SETA  0                                               @YL02021 16410002
         AIF   (&SUB EQ 0).OUTA                                @YL02021 16440002
         AIF   (&OP LT N'&SYSLIST).LOOP                        @YL02021 16470002
.OUTA    ANOP                                                  @YL02021 16500002
         MEND                                                  @YL02021 16530002
*  ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO* 17160020
         SPACE 2                                                        17220020
         MACRO                                                          17280020
&NAME    ROUTINE &LOGITEM,&RNAME                                        17340020
         GBLC  &DSECT,&CSECT                                            17400020
         GBLC  &ITEM(1500)                                              17460020
         GBLA  &SHIFT(1500),&ITEMNBR                                    17520020
         GBLA  &NRENTS                                                  17580020
         LCLA  &ISHIFT,&NDX                                             17640020
.LOOP    ANOP                                                           17700020
&NDX     SETA  &NDX+1                                                   17760020
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      17820020
         AIF   (&NDX LT &ITEMNBR).LOOP                                  17880020
         MNOTE *,'LOG ITEM NOT DEFINED'                                 17940020
         MEXIT                                                          18000020
.FOUND   ANOP                                                           18060020
&ISHIFT  SETA  &SHIFT(&NDX)                                             18120020
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           18180020
         DC    AL.4(&ISHIFT),AL.12(&RNAME-&CSECT)                       18240020
&NRENTS  SETA  &NRENTS+1                                                18300020
         MEND                                                           18360020
         EJECT                                                          18420020
*  LABEL MACRO     LABEL MACRO     LABEL MACRO     LABEL MACRO        * 18480020
         SPACE 2                                                        18540020
         MACRO                                                          18600020
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C18660020
               &LABEL7,&LABEL8                                          18720020
.*                            THIS MACRO ALLOWS UP TO ACHT LABELS TO    18780020
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   18840020
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  18900020
.*                                 TION MARKS. THE COLUMN AND LINE END  18960020
.*                                 CONTROLS WILL BE INSERTED BY THE     19020020
.*                                 MACRO. OMITTED OPERANDS MEAN NO      19080020
.*                                 LABEL REQUIRED FOR RESPECTIVE        19140020
.*                                 COLUMN. THIS MACRO WILL ALSO ALERT   19200020
.*                                 THE PROGRAMMER TO EXACTLY WHERE THE  19260020
.*                                 TABLE MUST BE BROKEN IF NECESSARY    19320020
.*                                 TO AVOID EXCEEDING THE MAXIMUM LIMIT 19380020
         GBLC &LABELS(2000)                                             19440020
         GBLC  &LBL(100)                                                19500020
         GBLA  &LBLCTR(100)                                             19560020
         GBLA  &LABELNR                                                 19620020
         GBLA  &NRENTS,&LPTR                                            19680020
         LCLC  &MARGIN,&TACK                                            19740020
         LCLC  &TEXT                                                    19800020
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            19860020
&MARGIN  SETC  '*'                                                      19920020
         AIF   ('&NAME' EQ '').LOOPOUT                                  19980020
&LPTR    SETA  &LPTR+1                                                  20040020
&LBL(&LPTR) SETC '&NAME'                                                20100020
&LBLCTR(&LPTR) SETA &LABELNR+1                                          20160020
.LOOPOUT ANOP                                                           20220020
&OP      SETA  &OP+1                                                    20280020
&K       SETA  K'&SYSLIST(&OP)                                          20340020
         AIF (&K GE 2).NORM                                             20400020
&K       SETA  2                                                        20460020
.NORM    ANOP                                                           20520020
&START   SETA  2                                                        20580020
         AIF (&OP LT N'&SYSLIST).NOTLAST                                20640020
&MARGIN  SETC  '$'                                                      20700020
.NOTLAST ANOP                                                           20760020
&NRCHAR  SETA  8                                                        20820020
&TACK    SETC  ''                                                       20880020
.LOOPIN  ANOP                                                           20940020
&REMAIN  SETA  &K-&START                                                21000020
         AIF (&REMAIN GE 8).MORE                                        21060020
&TACK    SETC  '&MARGIN'                                                21120020
&NRCHAR  SETA  &REMAIN                                                  21180020
.MORE    ANOP                                                           21240020
&TEXT    SETC  ''                                                       21300020
         AIF (&REMAIN EQ 0).ENDTEXT                                     21360020
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          21420020
.ENDTEXT ANOP                                                           21480020
&LABELNR SETA  &LABELNR+1                                               21540020
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  21600020
&START   SETA  &START+8                                                 21660020
         AIF ('&TACK' EQ '').LOOPIN                                     21720020
         AIF ('&TACK' EQ '*').LOOPOUT                                   21780020
         MEND                                                           21840020
         SPACE 2                                                        21900020
         MACRO                                                          21960020
         LSTART                                                         22020020
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  22080020
.*                                 OF THE TABLE IS TO BEGIN.            22140020
         GBLC &LABELS(2000)                                             22200020
         GBLA  &LABELNR                                                 22260020
         GBLC  &LBL(100)                                                22320020
         GBLA  &LBLCTR(100)                                             22380020
         LCLA  &NDX,&CTR                                                22440020
         LINEND                                                         22500020
&CTR     SETA  1                                                        22560020
.LOOP    ANOP                                                           22620020
&NDX     SETA  &NDX+1                                                   22680020
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            22740020
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         22800020
&CTR     SETA  &CTR+1                                                   22860020
         AGO   .LOOPCTL                                                 22920020
.NOLBL   ANOP                                                           22980020
         DC    C'&LABELS(&NDX)'                                         23040020
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  23100020
         MEND                                                           23160020
         SPACE 2                                                        23220020
         MACRO                                                          23280020
         LINEND                                                         23340020
.*                            THIS MACRO IS USED ONLY BY THE LINE       23400020
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   23460020
.*                                 ASSOCIATED WITH EACH LINE.           23520020
         GBLA  &NRENTS                                                  23580020
         GBLC &NRENTSX                                                  23640020
         ORG   &NRENTSX                                                 23700020
         DC    FL1'&NRENTS'                                             23760020
         ORG                                                            23820020
&NRENTS  SETA  0                                                        23880020
B&SYSNDX EQU   *                                                        23940020
&NRENTSX SETC  'B&SYSNDX'                                               24000020
         MEND                                                           24060020
         GBLC  &DSECT,&CSECT                                            24120020
IFCE2860 CSECT                                                          24180020
&CSECT   SETC  'IFCE2860'                                               24240020
&DSECT   SETC  'C2860'                                                  24300020
C2860    DSECT                                                          24360020
DUM      EQU   *                                                        24420020
         DSGEN (XKEY,8),(XRELN,8),(XSWS8,9),(XSWS9,1),(XSWS10,1),      C24460002
               (XSWS11,1),                                             C24500002
               (XSWS12,1),(XSWS13,1),(XSWS14,1),(XSWS15,1)              24540020
         DSGEN (XDUM1,13),(XCRH,1),(XDUM3,18)                  @Z30CIMC 24600002
         DSGEN (XDATE,32)                                               24660020
         DSGEN (XTIME,32)                                               24720020
         DSGEN (XDUM2,8),(XSER,24)                                      24780020
         DSGEN (XMOD,16),(MCEL,16)                                      24840020
         DSGEN (XJOBN,64)                                               24900020
         DSGEN (XAIO1,16),(XAIO2,16),(XAIO3,16),(XAIO4,16)              24960020
         DSGEN (XAIO5,16),(XAIO6,16),(XAIO7,16),(XAIO8,16)              25020020
         DSGEN (XFCCWCC,8),(XFCCWDA,24),(XFCCWFL,8),(XFCCW0,8),        C25080020
               (XFCCWCT,16)                                             25140020
         DSGEN (XCSWK,8),(XCSWCA,24)                                    25200020
         DSGEN (XCSWUS0,1),(XCSWUS1,1),(XCSWUS2,1),(XCSWUS3,1),        *25260020
               (XCSWUS4,1),(XCSWUS5,1),(XCSWUS6,1),(XCSWUS7,1),        *25320020
               (XCSWCS0,1),(XCSWCS1,1),(XCSWCS2,1),(XCSWCS3,1),        *25380020
               (XCSWCS4,1),(XCSWCS5,1),(XCSWCS6,1),(XCSWCS7,1),        *25440020
               (XCSWCT,16)                                              25500020
         DSGEN (XECSW,32)                                               25560020
         DSGEN (XDEVT1,16),(XDEVT2,16)                                  25620020
         DSGEN (XCHID,8),(XCUA,24)                                      25680020
         DSGEN (XMPIN,32)                                               25740020
         ORG   XMPIN                                           @YL02021 25760002
         DSGEN (VCUA,16),(VLGSZ,16)                            @YL02021 25780002
SL130    DSGEN (CLWKEY1,4),(DUM61,4),(CLWCADR,24)                       25800020
         SPACE 2                                                        25860020
SL130A   DSGEN (DUM62,8),(CLWSTAT,8),(CLWCOUNT,16)                      25920020
         SPACE 2                                                        25980020
SL138    DSGEN (CLWBREG,8),(CLWCREG,8),(CLWFREG,5),(CLWCHAD,3),        X26040020
               (CLWUARG,8)                                              26100020
         SPACE 2                                                        26160020
SL138A   DSGEN (CLWDARG,24),(CLWSIMRG,8)                                26220020
         SPACE 2                                                        26280020
SL140    DSGEN (CLWARGFL,1),(CLWBRGFL,1),(CLWCHCML,1),(CLWSEQ1,1),     X26340020
               (CLWSEQ2,1),(CLWSEQ3,1),(CLWSEQ4,1),(CLWSEQ5,1),        X26400020
               (CLWCCWV,1),(CLWREAD,1),(CLWWRITE,1),(CLWSETUP,1),      X26460020
               (CLWTIC,1),(CLWTICHZ,1),(CLWPIRPT,1),(CLWCDALT,1),      X26520020
               (CLWLWT,1),(CLWBCCBT,1),(CLWBCOLT,1),(CLWBCTGR,1),      X26580020
               (CLWBCREG,1),(CLWBIT3,1),(CLWBIT2,1),                   X26640020
               (CLWBIT1,1),(CLWCLOCK,8)                                 26700020
         SPACE 2                                                        26760020
SL140A   DSGEN (CLWOPIN,1),(DUM63,1),                                  X26820020
               (CLWADOLT,1),(CLWSLOLT,1),(CLWSEROT,1),(CLWCOMOT,1),    X26880020
               (CLWSTIO,1),(CLWHTIO,1),                        @YM6454PX26940002
               (CLWIDA00,1),(CLWDIN00,1),(CLWSTO00,1),         @YM6454PX26970002
               (DUM64,2),(CLWSTOCK,1),(DUM65,2),               @YM6454PX27000002
               (CLWPSPR,1),(CLWPOCAR,1),(CLWP1CAR,1),(CLWP2CAR,1),     X27030002
               (CLWPDIB,1),(CLWPOCRG,1),(CLWP1CRG,1),(CLWP2CRG,1),     X27060020
               (CLWPUAR,1),(CLWP0DAR,1),(CLWP1DAR,1),(CLWP2DAR,1),     X27120020
               (CLWPMBR,1),(CLWPCOMR,1),(CLWPFLAG,1),(CLWPSIMR,1)       27180020
         DSGEN (VCCHPR0,1,1,9),(VCCHPR,1,10,16)                @YM2954P 27186002
         DSGEN (VCCHPR1,16,EQU,VCCHPR01)                       @YM2954P 27188002
         DSGEN (VDUM,24),(VFLAG,8),(VNOPRO,16)                 @YM2954P 27190002
         DSGEN (VPROC01,16),(VCHST01,16),(VPROC02,16),(VCHST02,16),    X27192002
               (VPROC03,16),(VCHST03,16),(VPROC04,16),(VCHST04,16),    X27198002
               (VPROC05,16),(VCHST05,16),(VPROC06,16),(VCHST06,16),    X27204002
               (VPROC07,16),(VCHST07,16),(VPROC08,16),(VCHST08,16),    X27210002
               (VPROC09,16),(VCHST09,16),(VPROC10,16),(VCHST10,16),    X27216002
               (VPROC11,16),(VCHST11,16),(VPROC12,16),(VCHST12,16),    X27222002
               (VPROC13,16),(VCHST13,16),(VPROC14,16),(VCHST14,16),    X27228002
               (VPROC15,16),(VCHST15,16),(VPROC16,16),(VCHST16,16)      27234002
         EJECT                                                          27240020
*                                                                       27300020
IFCEP000 DSECT                                                          27360020
         DS    CL6                                                      27420020
         DS    CL1                                                      27480020
         DS    CL1                                                      27540020
XPRTBUF  DS    15CL8                                                    27600020
         DS    5CL8                                                     27660020
         DS    3CL8                                                     27720020
         DS    CL8                                                      27780020
XSWITCH  DS    CL4                                                      27840020
*                                                                       27900020
*      ROUTINE BRANCH TABLE                                             27960020
*                                                                       28020020
         DS    CL112                                                    28080020
*                                                                       28140020
*      LOAD MODULE ENTRYPOINT NAMES                                     28200020
*                                                                       28260020
         DS    CL56                                                     28320020
*                                                                       28380020
*      READ/WRITE BUFFER                                                28440020
*                                                                       28500020
XMCH     DC    XL2'00'                                                  28560020
XCNTBUF  DS    CL8                                                      28620020
XKEYBUF  DS    CL2                                                      28680020
XDADBUF  DS    197CL8                                                   28740020
XDUMMY   DS    CL1                                                      28800020
         SPACE 3                                                        28860020
ERPIB    DSECT                                                    19032 28920020
SOFWFLGS DS    CL1                 PROGRAM FLAGS FIELD IN ERPIB   19032 28980020
PROBERR  DS    CL1                 PROBABLE SOURCE OF ERROR FIELD 19032 29040020
VALFLAGS DS    CL1                 VALIDITY FLAGS FIELD           19032 29100020
CMPLBITS DS    CL1                 TERM AND RETRY CODES FIELD     19032 29160020
MPINFOFD DS    CL2                 MULTI-PROCESSING INFO FIELD    19032 29220020
CHSMS    DS    CL2                 CHANNEL STATUS FIELD           19032 29280020
         EJECT                                                          29340020
IFCE2860 CSECT                                                          29400020
ENTRYPTR DC    A(FORMAT1)                                               29460020
TABLNAME DC    CL8'IFCE2860'                                            29520020
REG9     DC    F'0'                                                     29580020
LP       DS    F                                                        29640020
SPCLCODE EQU   *                                                        29700020
SKIPPER  EQU   *                                                        29760020
         BR    14                                                       29820020
         SPACE 2                                                        29880020
*********************************************************************** 29940020
*                                                                     * 30000020
*                                                                     * 30060020
*    ROUTINE TO PICK UP THE CHANNEL ADDRESS WHICH IS NOT ON A BYTE    * 30120020
*   BOUNDRY, CONVERT IT TO HEX AND STORE IT IN THE PRINT BUFFER.      * 30180020
*                                                                     * 30240020
*                                                                     * 30300020
*********************************************************************** 30360020
         SPACE 2                                                        30420020
@CHANADR DS    0F                                                       30480020
         USING *,15                                                     30540020
         STM   14,12,12(13)        SAVE THE REGS                        30600020
         MVC   MYWORK(1),0(4)                                           30660020
         NI    MYWORK,X'07'                                             30720020
         OI    MYWORK,X'F0'                                             30780020
         S     R3,ONE                   POSITION PRINT BFR              30840020
         MVC   0(1,3),MYWORK                                            30900020
         LM    14,12,12(13)        RESTORE THE REGS                     30960020
         BR    14                  RETURN                               31020020
ONE      DC    F'1'                                                     31080020
*                                                                       31140020
         DROP  R15                                                      31200020
         USING IFCE2860,R9                                              31260020
         USING C2860,R2                                                 31310002
SETSOURC STM   R5,R8,XSAVE              SAVE REGS                       31320020
         XC    NOPRO(4),NOPRO           CLEAR                           31350002
         CLI   L0(R4),HEX20             TEST REC SOURCE                 31380020
         BE    SETCCH                   CCH NORMAL                      31440020
         CLI   L0(R4),HEX21             TEST SOURCE                     31460002
         BE    SETCCH                   CCH VS2(MVM)                    31480002
         CLI   L0(R4),HEX22                                             31500020
         BE    SETCCHC                  CHH CONVERTED                   31560020
         CLI   L0(R4),HEX28                                             31620020
         BE    SETSER1                  SER1 CHAN REC                   31680020
         CLI   L0(R4),HEX2A                                             31740020
         BE    SETSER1C                 SER1 CHAN REC CONVERTED         31800020
         CLI   L0(R4),HEX29                                             31860020
         BE    SETSER0                  SER0 CHAN REC                   31920020
SETSER0C MVC   CSER0A(L9),CONVERTD      SET CONVERTED MSG               31980020
SETSER0  LA    R5,CSER0                 SET SER0 MSG PTR                32040020
         B     SETSRC                                                   32100020
SETSER1C MVC   CSER1A(L9),CONVERTD      SET CONVERTED MSG               32160020
SETSER1  LA    R5,CSER1                 SET SERC MSG PTR                32220020
         B     SETSRC                                                   32280020
SETCCHC  MVC   CCCHA(L9),CONVERTD       SET CONV MSG                    32340020
SETCCH   LA    R5,CCCH                  SET CCH PTR                     32400020
SETSRC   MVC   L0(L14,R3),L0(R5)        MOVE SOURCE TO LINE             32460020
         B     RETURN                   RETURN                          32520020
*                                                                       32580020
CONVREL  STM   R5,R8,XSAVE              SAVE WORK REGS                  32580202
         SR    R6,R6                    CLEAR R6                        32580402
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        32580602
         SRDL  R6,L5                    SAVE REL NO IN R7               32580802
        SLL   R6,L2                    MULTIPLY SYS VALUE BY 4          32581002
         L     R8,XLABELP               PICK UP LABEL POINTER           32581202
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     32581402
         MVC   L0(L4,R8),L0(R6)         MOVE SYSTEM NAME INTO LABEL     32581602
         SR    R6,R6                    CLEAR R6                        32581802
         SLDL  R6,L5                    RETREIVE REL NO.                32582002
         LTR   R6,R6                    IS IT ZERO                      32582202
         BZ    NOREL                    BR-YES                          32582402
         CVD   R6,WORK                  CONVERT IT                      32582602
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFF       32582802
         MVZ   L1(L1,R3),L0(R3)         MOVE ON PROPER ZONE             32583002
         B     RETURN                   EXIT                            32583202
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL            32583402
         B     RETURN                                                   32583602
ALLFFF   STM   R5,R8,SSAVE              SAVE REGS                43068  32630002
AG       CLC   L0(L4,R4),HFFF           IS WORD ALL FF"S         43068  32632002
         BNE   OK                       BR - NO                  43068  32634002
         L     R5,NOLOGPTR              POINT AROUND           @YM2954P 32636002
         ST    R5,REG9                   LOGOUT LINES          @YM2954P 32636602
         L     R5,NOLOGLAB                AND                  @YM2954P 32637202
         ST    R5,LP                       LABELS              @YM2954P 32637802
         MVC   L0(L21,R3),NOLOG                                         32638402
OK       EQU   *                                                        32638802
OV       LM    R5,R8,SSAVE              RESTORE REGS             43068  32639202
         BR    R14                      EXIT                     43068  32639602
SSAVE    DC    4F'0'                    SMALL SAVE AREA          43068  32639702
HFFF     DC    X'FFFFFFFF'                                       43068  32639802
*                                                                       32640020
CRHACT   STM   R5,R8,XSAVE                                     @Z30CIMC 32646002
         TM    L0(R4),HEX04        CHANNEL RECONFIG ACTIVE     @Z30CIMC 32652002
         BO    RETURN              RETURN IF YES               @Z30CIMC 32658002
         L     R5,NOCRH            BYPASS CRH MESSAGE PRINTOUT @Z30CIMC 32664002
         ST    R5,REG9                                         @Z30CIMC 32670002
         L     R5,NOCRH1                                       @Z30CIMC 32676002
         ST    R5,LP                                           @Z30CIMC 32682002
         B     RETURN                                          @Z30CIMC 32688002
SETPGMN  MVC   L0(L8,R3),L0(R4)         MOVE 8 CHAR NAME TO BUFF        32700020
         BR    R14                                                      32760020
*                                                                       32820020
SPACER2  LA    R3,L2(R3)                BUMP R3 PTR BY 2                32880020
         BR    R14                                                      32940020
*                                                                       33000020
SETHEX   STM   R5,R8,XSAVE              SAVE REGS                       33060020
         LA    R8,CHARS                 CHAR TABLE PTR                  33120020
         IC    R7,L0(R4)                PICK UP CHAR                    33180020
         SLL   R7,L24                   MOVE IT TO HI POS               33240020
         SR    R6,R6                                                    33300020
         SLDL  R6,L4                    MOVE 4 BITS TO R6               33360020
         AR    R6,R8                    INDEX FOR CHARS                 33420020
         MVC   L0(L1,R3),L0(R6)         MOVE CHAR TO BUFF               33480020
         SR    R6,R6                                                    33540020
         SLDL  R6,L4                    MOVE LAST 4 BITS TO R6          33600020
         AR    R6,R8                    INDEX INTO TABLE                33660020
         MVC   L1(L1,R3),L0(R6)         MOVE CHAR                       33720020
         B     RETURN                                                   33780020
*                                                                       33840020
*                                                                       33900020
*                                                                       33960020
*                              SET ACTIVE  I/O UNITS                    34020020
SETAIO   STM   R5,R8,XSAVE              SAVE REGS                       34080020
         LR    R5,R3                    SET R5 TO BUFFER                34140020
         SH    R5,H43                   POINT R5 TO BEGGIN OF DATA      34200020
         SR    R7,R7                                                    34260020
         LA    R6,L8                    LOOP COUNT                      34320020
SETAIOLP CLC   L0(L4,R5),CZEROS         TEST FOR ALL ZEROS              34380020
         BE    BLANKOUT                 BE-TO BLANK OUT ZEROS           34440020
SETAIOL1 LA    R5,L5(R5)                BUMP COUNT                      34500020
         BCT   R6,SETAIOLP              LOOP TILL 8 TESTS               34560020
         CH    R7,H8                    ARE ALL ACTIVE IO ZERO          34620020
         BNE   RETURN                   NO RETURN                       34680020
         LR    R5,R3                    YES                             34740020
         SH    R5,H43                   PUT IN NONE                     34800020
         MVC   L0(L4,R5),NONE           INTO PRINT BUFF                 34860020
         B     RETURN                                                   34920020
BLANKOUT MVC   L0(L4,R5),BLANKS         MOVE IN BLANKS                  34980020
         LA    R7,L1(R7)                COUNT # OF ZERO FLDS            35040020
         B     SETAIOL1                 LOOP                            35100020
RETURN   LM    R5,R8,XSAVE                                              35160020
         BR    R14                                                      35220020
*                                                                       35280020
*                                                                       35340020
CHKSW9   TM    L1(R4),HEX40             TEST SWITCHES                   35400020
CHECKCC  BZ    NOPRT                    IF SWITCHES OFF                 35460020
         BR    R14                      DONOT PRINT                     35520020
CHKSW10  TM    L1(R4),HEX20             R15 RETURNED ZERO               35580020
         B     CHECKCC                  STOPS PRINTING                  35640020
CHKSW11  TM    L1(R4),HEX10                                             35700020
         B     CHECKCC                                                  35760020
CHKSW12  TM    L1(R4),HEX08                                             35820020
         B     CHECKCC                                                  35880020
CHKSW13  TM    L1(R4),HEX04                                             35940020
         B     CHECKCC                                                  36000020
CHKSW14  TM    L1(R4),HEX02                                             36060020
         B     CHECKCC                                                  36120020
CHKSW15  TM    L1(R4),HEX01                                             36180020
         B     CHECKCC                                                  36240020
NOPRT    SR    R15,R15                                                  36300020
         BR    R14                                                      36360020
*                                                                       36420020
SETDATE  UNPK  XWORK(L8),L0(L4,R4)      UNPACL DATE                     36480020
         MVZ   XWORK+L7(L1),XWORK       SET ZONE                        36540020
         MVC   L0(L3,R3),XWORK+L5       MOVE DAY                        36600020
         MVC  L6(L2,R3),XWORK+L3                                        36660020
         BR    R14                      RETURN                          36720020
*                                                                       36780020
CONVTIME TM    L0(R4),HEX48             TEST FOR NS/BIN CLOCK           36840020
         BZ    BINCLOCK                 ZERO IS BINARY CLOCK            36900020
         BO    RETURNB                  ONES IS FOR CONV TIME           36960020
         TM    L0(R4),HEX40             IF ON IS N/S CLOCK              37020020
         BO    NSCLOCK                  IF OFF TIME OK                  37080020
RETURNB  BR    R14                      RETURN                          37140020
*                                                                       37200020
         USING C2860,R2                                                 37260020
ISITVS2  STM   R5,R8,XSAVE             SAVE REGS               @YL02021 37261002
         L     R5,DUMPIT                LOCATION OF DUMP PARMS @YM2954P 37261302
         MVC   L0(L2,R5),LOGSIZV2       VS 2 RECORD SIZE       @YM2954P 37261602
         CLI   XKEY,HEX21              VS2?                    @YL02021 37262002
         BE    RETURN                                          @YL02021 37263002
         MVC   L0(L2,R5),LOGSIZV1       VS 1 RECORD SIZE       @YM2954P 37263502
         SR    R15,R15                 ELIM LABEL              @YL02021 37264002
         B     RETURN                                          @YL02021 37265002
VS2TEST  STM   R5,R8,XSAVE             SAVE REGS               @YL02021 37266002
         CLI   XKEY,HEX21              VS2?                    @YL02021 37267002
         BE    RETURN                                          @YL02021 37268002
         SR    R5,R5                   CLEAR REG 5             @YL02021 37269002
         B     COMPL                    SET UP FOR DUMP AND RET         37270002
PROC     STM   R5,R8,XSAVE             SAVE REGS               @YL02021 37274002
         SR    R5,R5                   CLEAR REG 5             @YL02021 37275002
         L     R5,NOPRO                PLACE THE NO. OF PROC. IN REG 5  37276002
         LA    R5,1(R5)                ADD ONE TO REG. 5       @YL02021 37277002
         ST    R5,NOPRO                PLACE BACK IN CORE      @YL02021 37278002
         CLC   VNOPRO(2),NOPRO+2       COMP. WITH ACTUAL NO. OF PROC.   37279002
         BL    COMPL                   FINISHED                @YL02021 37280002
         LR    R5,R3                                           @YL02021 37281002
         LA    R6,L47                   ADJUST OFFSET          @YM2954P 37282002
         SR    R5,R6                                           @YL02021 37283002
         MVC   L0(L17,R5),MSGA                                 @YL02021 37284002
         MVC   L27(L16,R5),MSGB                                @YM2954P 37285002
PROCBIN  LH    R4,L0(R4)           FETCH DATA                  @YM2954P 37285102
         SLL   R4,L15                   POSITION DATA                   37285202
         LA    R6,L46              LENGTH OF LABEL             @YM2954P 37285302
         AR    R5,R6               SET UP POINTER              @YM2954P 37285402
         LA    R6,L16                   CHANGE COUNT           @YM2954P 37285502
TESTIT   SLL   R4,L1                    POSITION CHANNEL IND   @YM2954P 37285602
         LTR   R4,R4                    TEST FOR ON LINE       @YM2954P 37285702
         BNM   CHANACT                  BRANCH ON LINE         @YM2954P 37285802
PRINT    LA    R5,L3(R5)                UP DATE PRINT PTR               37285902
         BCT   R6,TESTIT           NEXT CHANNEL                @YM2954P 37286002
         B     RETURN                                          @YM2954P 37286102
CHANACT  MVI   L0(R5),C'X'         MOVE X TO PRINT             @YM2954P 37286202
         B     PRINT                    NEXT CHANNEL           @YM2954P 37286302
COMPL    SR    R15,R15                 CLEAR LABEL             @YL02021 37287002
         L     R5,DUMP                 LOAD ADDR.              @YL02021 37288002
         ST    R5,REG9                                         @YL02021 37289002
         L     R5,DUMP1                                        @Z30CIMC 37289302
         ST    R5,LP                                           @Z30CIMC 37289602
         B     RETURN                                          @YL02021 37290002
NOPRO    DC    F'00'                                           @YL02021 37291002
MSGA     DC    C'PROCESSOR ADDRESS'                            @YL02021 37292002
MSGB     DC    C'CHANNELS ON LINE'                             @YM2954P 37293002
LOGSIZV1 DC    XL2'68'                                         @YM2954P 37299002
LOGSIZV2 DC    XL2'B0'                                         @YM2954P 37305002
DUMPIT   DC    A(DUMPSIZE)                                     @YM2954P 37311002
NSCLOCK  STM   R14,R12,L12(R13)         SAVE REGS                       37320020
         NI    L0(R4),HEXBF                                             37380020
         MVC   XWORK(L8),XDATE          MOVE DATE                       37440020
         LM    R4,R5,XWORK                                              37500020
         SRDL  R4,L12                   POSITION FOR MICRO SECS         37560020
         D     R4,MILLION               CONVERT TO SECONDS              37620020
         SRA   R4,L19                   POSITION FOR ROUNDING           37680020
         AR    R5,R4                    UP TO NXT SECONDS               37740020
         SR    R4,R4                                                    37800020
         D     R4,SIXTY                 CONVERT TO NINS                 37860020
         CVD   R4,XWORK                 CONVERT IT                      37920020
         LH    R6,XWORK+L6              PICK UP SECONDS                 37980020
         SRL   R6,L4                    SHIFT OFF ZONE                  38040020
         STC   R6,XDATE+L6              STORE SECONDS IN  REC           38100020
         MVI   XDATE+L7,HEX00           ZERO OUT TH'S                   38160020
         SR    R4,R4                                                    38220020
         D     R4,SIXTY                 CONVERT TO HRS                  38280020
         CVD   R4,XWORK                 CONVERT REMAINDER MINUTES       38340020
         LH    R6,XWORK+L6              PICK UP                         38400020
         SRL   R6,L4                    DROP ZONE                       38460020
         STC   R6,XDATE+L5              STORE MINUTES                   38520020
         SR    R4,R4                                                    38580020
         D     R4,T24                   DIVIDE TO GET DAYS              38640020
         CVD   R4,XWORK                 CONV REM                        38700020
         LH    R6,XWORK+L6              PICK UP                         38760020
         SRL   R6,L4                    DROP ZONE                       38820020
         STC   R6,XDATE+L4              STORE HRS                       38880020
         LA    R4,L60                   STARTINY YEAR 1960              38940020
         LA    R6,L1                    INC OF 1                        39000020
LEAPYEAR LA    R7,L3(R4)                ADD 3 YRS                       39060020
         S     R5,LPYEAR                DAYS IN LEAP YEAR 366           39120020
         BZ    THISYEAR                 BR-THIS YR+1                    39180020
         BM    OVERSHOT                 BR-TOOFAR                       39240020
         BXLE  R4,R6,REGYEAR            UPDATE YEAR BY ONE              39300020
REGYEAR  S     R5,RGYEAR                DAYS IN RG YEAR 365             39360020
         BZ    THISYEAR                 BR-YEAR+1                       39420020
         BM    OVERSHT1                 BR-TOO FAR                      39480020
         BXLE  R4,R6,REGYEAR            UPDATE AND TRY AGAIN            39540020
         B     LEAPYEAR                                                 39600020
OVERSHOT A     R5,LPYEAR                ADD BACK LEAP YEAR              39660020
         B     THISYEAR                 & USE                           39720020
OVERSHT1 A     R5,RGYEAR                ADD BACK REG YEAR               39780020
         B     THISYER                  & USE                           39840020
THISYEAR AR    R4,R6                    ADD 1                           39900020
THISYER  AR    R5,R6                    ADD 1                           39960020
         CVD   R5,XWORK                 CONVERT DAYS                    40020020
         MVC   XDATE+L2(L2),XWORK+L6    MOVE DAYS                       40080020
         CVD   R4,XWORK                 CONVERT YEAR                    40140020
         LH    R6,XWORK+L6              PICK UP                         40200020
         SRL   R6,L4                    DROP ZONE                       40260020
         STC   R6,XDATE+L1              PUT YEAR                        40320020
         MVI   XDATE,HEX00              SET TO ZERO                     40380020
RETURNC  OI    XSWS8,HEX08              TURN ON PACKED SWITCH           40440020
         LM    R14,R12,L12(R13)         RETURN                          40500020
         BR    R14                                                      40560020
*                                                                       40620020
*                                                                       40680020
BINCLOCK STM   R14,R12,L12(R13)         SAVE REGS                       40740020
         LR    R8,R2                    SAVE RECORD POINTER       P6566 40770020
         L     R3,XTIME                 PICK UP TIME IN BIN             40800020
         LTR   R3,R3                    TEST FOR ZERO                   40860020
         BZ    RETURNC                  YES-RETURN                      40920020
         SRL   R3,L1                    CONVERT                         40980020
         M     R2,CONSTG                     TO                         41040020
         D     R2,CONSTH                       DECIMAL                  41100020
         LA    R4,L32                   BIT COUNTER                     41160020
         MVI   TIMDIV+L3,DIV1           INITIAL DIVISOR (0A)            41220020
BCLOCKA  SR    R2,R2                    CLEAR                           41280020
         D     R2,TIMDIV                DEVOLP DIGIT-REMAINDER          41340020
         LR    R0,R2                    SAVE REM                        41400020
         SRDL  R0,L4                    SHIFT 4BITS                     41460020
         SH    R4,H4                    DEC BY 4                        41520020
         LTR   R3,R3                    DONE                            41580020
         BZ    BCLOCKB                  BR-YES                          41640020
         CH    R4,H24                   BITS LESS 24                    41700020
         BNL   BCLOCKA                  BR-NO                           41760020
         XI    TIMDIV+L3,DIV2           ALT DIV (0A XI 0C=06)           41820020
         B     BCLOCKA                                                  41880020
BCLOCKB  SRL   R1,L0(R4)                MOVE TO FINAL POS               41940020
         LR    R2,R8                    RESTORE RECORD POINTER    P6566 41970020
         ST    R1,XTIME                 STORE BACK                      42000020
         B     RETURNC                                                  42060020
R0       EQU   0                                                        42120020
R1       EQU   1                                                        42180020
R2       EQU   2                                                        42240020
R3       EQU   3                                                        42300020
R4       EQU   4                                                        42360020
R5       EQU   5                                                        42420020
R6       EQU   6                                                        42480020
R7       EQU   7                                                        42540020
R8       EQU   8                                                        42600020
R9       EQU   9                                                        42660020
R10      EQU   10                                                       42720020
R11      EQU   11                                                       42780020
R12      EQU   12                                                       42840020
R13      EQU   13                                                       42900020
R14      EQU   14                                                       42960020
R15      EQU   15                                                       43020020
L17      EQU   17                                              @YL02021 43050002
L12      EQU   12                                                       43080020
L14      EQU   14                                                       43140020
L27      EQU   27                                              @YM2954P 43150002
L46      EQU   46                                              @YM2954P 43160002
L47      EQU   47                                              @YM2954P 43170002
L19      EQU   19                                                       43200020
L24      EQU   24                                                       43260020
L25      EQU   25                                              @YL02021 43290002
L32      EQU   32                                                       43320020
L44      EQU   44                                              @YL02021 43350002
L60      EQU   60                                                       43380020
L66      EQU   66                                              @YL02021 43410002
HEX48    EQU   X'48'                                                    43440020
HEXBF    EQU   X'BF'                                                    43500020
HEX02    EQU   X'02'                                                    43560020
HEX04    EQU   X'04'                                                    43620020
HEX08    EQU   X'08'                                                    43680020
HEX10    EQU   X'10'                                                    43740020
HEX20    EQU   X'20'                                                    43800020
HEX21    EQU   X'21'                                           @YL02021 43830002
HEX40    EQU   X'40'                                                    43860020
HEX22    EQU   X'22'                                                    43920020
HEX28    EQU   X'28'                                                    43980020
HEX2A    EQU   X'2A'                                                    44040020
HEX29    EQU   X'29'                                                    44100020
HEX01    EQU   X'01'                                                    44160020
HEX00    EQU   X'00'                                                    44220020
DIV1     EQU   X'0A'                                                    44280020
DIV2     EQU   X'0C'                                                    44340020
L0       EQU   0                                                        44400020
L1       EQU   1                                                        44460020
L2       EQU   2                                                        44520020
L3       EQU   3                                                        44580020
L4       EQU   4                                                        44640020
L5       EQU   5                                                        44700020
L6       EQU   6                                                        44760020
L7       EQU   7                                                        44820020
L8       EQU   8                                                        44880020
L9       EQU   9                                                        44940020
L10      EQU   10                                                       45000020
XWORK    DS    D                                                        45060020
XSAVE    DS    4F                                                       45120020
CONSTG   DC    X'00030D40'                                              45180020
CONSTH   DC    X'024AE062'                                              45240020
MILLION  DC    F'1000000'                                               45300020
SIXTY    DC    F'60'                                                    45360020
T24      DC    F'24'                                                    45420020
LPYEAR   DC    F'366'                                                   45480020
RGYEAR   DC    F'365'                                                   45540020
TIMDIV   DC    F'1'                                                     45600020
H4       DC    H'4'                                                     45660020
H8       DC    H'8'                                                     45720020
H24      DC    H'24'                                                    45780020
H43      DC    H'43'                                                    45840020
CHARS    DC    C'0123456789ABCDEF'                                      45900020
NONE     DC    C'NONE'                                                  45960020
CONVERTD DC    C'CONVERTED'                                             46020020
CZEROS   DC    C'0000'                                                  46080020
BLANKS   DC    C'    '                                                  46140020
CCCH     DC    CL5'CCH'                                                 46200020
CCCHA    DC    CL9' '                                                   46260020
CSER1    DC    CL5'SER1'                                                46320020
CSER1A   DC    CL9' '                                                   46380020
CSER0    DC    CL5'SER0'                                                46440020
CSER0A   DC    CL9' '                                                   46500020
MYWORK   DC    F'0'                                                     46560020
VS2FLG   DC    X'00'                                           @YL02021 46580002
DUMP     DC    A(DMPSPACE-4)                                   @Z30CIMC 46600002
DUMP1    DC    A(DMPSPC1-1)                                    @Z30CIMC 46610002
         EJECT                                                          46620020
****    NUMERICAL EQUATES                                               46680020
L13      EQU   13                                                       46740020
L15      EQU   15                                                       46800020
L16      EQU   16                                                       46860020
L20      EQU   20                                                       46920020
L21      EQU   21                                                       46980020
L22      EQU   22                                                       47040020
L26      EQU   26                                                       47100020
L31      EQU   31                                                       47160020
L40      EQU   40                                                       47220020
X01      EQU   X'01'                                                    47280020
X02      EQU   X'02'                                                    47340020
X04      EQU   X'04'                                                    47400020
X08      EQU   X'08'                                                    47460020
X09      EQU   X'09'                                                    47520020
X10      EQU   X'10'                                                    47580020
X20      EQU   X'20'                                                    47640020
X30      EQU   X'30'                                                    47700020
X40      EQU   X'40'                                                    47760020
X80      EQU   X'80'                                                    47820020
****    ADDRESS EQUATES                                                 47880020
AD0      EQU   0                                                        47940020
AD4      EQU   4                                                        48000020
AD12     EQU   12                                                       48060020
AD13     EQU   13                                                       48120020
AD14     EQU   14                                                       48180020
AD15     EQU   15                                                       48240020
AD16     EQU   16                                                       48300020
AD20     EQU   20                                                       48360020
AD37     EQU   37                                                       48420020
AD41     EQU   41                                                       48480020
AD45     EQU   45                                                       48540020
AD55     EQU   55                                                       48600020
AD63     EQU   63                                                       48660020
AD69     EQU   69                                                       48720020
AD108    EQU   108                                                      48780020
****    CONDITION CODE EQUATES                                          48840020
CC1      EQU   1                                                        48900020
CC7      EQU   7                                                        48960020
CC8      EQU   8                                                        49020020
IFCASR01 DS    0H                                                       49080020
         USING *,R15                                                    49140020
         STM   R14,R12,12(R13)          SAVE REGISTERS                  49200020
         CLI   XKEY,HEX21                                      @YL02021 49260002
         BNE   CONTIN                                          @YL02021 49270002
         OI    VS2FLG,X01                                      @YL02021 49280002
CONTIN   ST    R13,SVR13               SAVE REG 13             @YL02021 49290002
         L     R11,NXENTRY              LOAD SUBROUTINE RETURN ADR      49320020
         LTR   R11,R11                  TEST FOR INITIAL ENTRY          49380020
         BZ    IFCASR02                 BRANCH IF 0-INITIAL ENTRY       49440020
         LM    R12,R10,MYSAVE           RELOAD SUBROUTINE REGS          49500020
         BR    R11                      CONTINUE PROCESSING             49560020
IFCASR02 DS    0H                                                       49620020
         SH    R3,TWOX                  SUBTRACT 2 FROM PRNT BFR ADR    49680020
         MVC   L0(L1,R3),L1(R3)         MOVE PRINTER CNTRL CHAR         49740020
         LA    R3,L1(R3)                INCREMENT PRNT BFR ADR          49800020
         USING XDADBUF,R4                                               49860020
         USING XPRTBUF,R3                                               49920020
         USING XKEYBUF,R2                                               49980020
NEWMOVE  CLI   XKEYBUF+1,REL19          RELEASE 19                19E03 50040020
         BE    NEWMOVE1                 BRANCH--YES               19E03 50100020
         MVC   CSWORD(8),XDADBUF+54     MOVE CSW                  19E03 50160020
         MVC   ERPIBFLD(4),XDADBUF+62   MOVE ERPIB                19E03 50220020
         MVC   MULTISYS(4),XDADBUF+74   MOVE CHANSTAT INFO        19E03 50280020
         B     CONTINUE                 CONTINUE                  19E03 50340020
NEWMOVE1 MVC   CSWORD(8),XDADBUF+46     MOVE CSW                  19E03 50400020
         MVC   ERPIBFLD(4),XDADBUF+54   MOVE ERPIB                19E03 50460020
         MVC   MULTISYS(4),XDADBUF+66   MOVE CHANSTAT INFO        19E03 50520020
CONTINUE LA    R9,ERPIBFLD              DSECT ADDRESSIBILITY      19E03 50580020
         USING ERPIB,R9                                                 50640020
         MVI   SETUPBFR+1,C'*'                                     MP   50700020
         MVC   SETUPBFR+2(78),SETUPBFR+1                           MP   50760020
         BAL   BRANPRT,XWRTPRT    MOVE BORDER TO BUFFER AND WRITE  MP   50820020
         L     R6,VS2                                          @YL02021 50830002
         CLI   0(R6),X'01'                                     @YL02021 50840002
         BE    DUMMYTST                                        @YL02021 50850002
         MVI   SETUPBFR,C'-'           SKIP TWO SPACES             MP   50880020
         TM    MPINFOFD,MSBIT      IS MULTI-SYSTEM BIT SET        19032 50940020
         BZ    DUMMYTST      IFNOT,CKECK FOR ENTRANCE FROM ASR01   MP   51000020
         LA    SETUPADR,SETUPBFR       ADDRESS OF PRINT BUFFER     MP   51060020
         MVC   24(24,SETUPADR),MSHEAD   MOVE MULTI-SYSTEM HDR TO BUFMP  51120020
         BAL   BRANPRT,XWRTPRT     WRITE HEADER                    MP   51180020
         MVI   SETUPBFR+1,C'*'                                     MP   51240020
         MVI   VDSTAR,C'*'                                         MP   51300020
         BAL   BRANPRT,XWRTPRT     WRITE LINE DIVIDER              MP   51360020
*                                                                  MP   51420020
*                                                                  MP   51480020
*              THIS ROUTINE FORMATS AND PRINTS A MESSAGE           MP   51540020
*              CONTAINING THE ID OF THE FAILING CPU AND            MP   51600020
*              THE STATUS OF THE MULTI-PROCESSING SYSTEM           MP   51660020
*                                                                  MP   51720020
*                                                                  MP   51780020
         MVC   10(12,SETUPADR),MSCPUID  MOVE CPUID MESSAGE TO BUFFERMP  51840020
         MVC   30(15,SETUPADR),MSCPUST  MOVE CPU STATUS MESSAGE    MP   51900020
         MVI   0(SETUPADR),C'-'    SKIP TWO SPACES AFTER LINE      MP   51960020
         TM    MPINFOFD,ID         TEST FOR WHICH CPU             19032 52020020
         BZ    STATEST       SKIP CPU ID                           MP   52080020
         MVI   14(SETUPADR),C'2'   INSERT CPUID=CPU2               MP   52140020
STATEST  IC    R1,MPINFOFD         GET MS BYTE IN MPINFO          19032 52200020
         SLL   R1,30               CLEAR FOR CPUSTAT               MP   52260020
         LTR   R1,R1               TEST FOR ZERO,NEGATIVE OR POSITIVEMP 52320020
         BC    12,SHARED           IS STATUS NOT PARTITION         MP   52380020
         MVC   45(11,SETUPADR),PART     STATUS WAS PARTITIONED     MP   52440020
         B     CHANTEST      GO FOR CHANNEL STATUS                 MP   52500020
SHARED   MVC   45(6,SETUPADR),SHAR      SHARED STATUS              MP   52560020
         BE    CHANTEST                 WAS CPU RECONFIGURED OUT   MP   52620020
         MVC   51(21,SETUPADR),RECON    YES                        MP   52680020
         EJECT                                                          52740020
*                                                                  MP   52800020
*                                                                  MP   52860020
*              THIS ROUTINE TESTS A TWO BYTE FIELD                 MP   52920020
*              MPINFO FIELD                          TO DETERMINE       52980020
*              THE CHANNEL STATUS FOR BOTH CPUS AND FORMAT         MP   53040020
*              A MESSAGE TO INDICATE THAT STATUS                   MP   53100020
*                                                                  MP   53160020
*                                                                  MP   53220020
CHANTEST BAL   BRANPRT,XWRTPRT          PRINT INFORMATION          MP   53280020
         MVI   0(SETUPADR),C'-'         SKIP TWO SPACES            MP   53340020
         MVC   10(27,SETUPADR),CHCNFIG  CHANNEL CONFIGURATION MESSAGEMP 53400020
         LA    UPKREG,0                                            MP   53460020
         TM    MPINFOFD,ID         WAS CPUID=CPU2                 19032 53520020
         BZ    CCHMOVE                 NO                          MP   53580020
         MVI   14(SETUPADR),C'2'        YES, ENTER ID 2            MP   53640020
CCHMOVE  BAL   BRANPRT,XWRTPRT          PRINT MESSAGE              MP   53700020
         LA    R1,7                     LOOP CONTROL               MP   53760020
         LA    R2,14(SETUPADR)          PTR TO SLOT FOR 'OFF' MESSAGEMP 53820020
         IC    R5,CHSMS(UPKREG)         GET CHANNEL STATUS BYTE    MP   53880020
         MVC   10(55,SETUPADR),CHTAB    GET LIST OF CHANNELS       MP   53940020
         SLL   R5,24                    POSITION BYTE FOR BIT TESTINGMP 54000020
MSLOOP   LTR   R5,R5         IS BIT ON (NEGATIVE REG) OR OFF       MP   54060020
         BC    10,MSUPDT                NO                         MP   54120020
         MVC   0(3,R2),OFF              CHANNEL OFFLINE            MP   54180020
MSUPDT   SLL   R5,1                     MOVE TO NEXT CHANNEL BIT   MP   54240020
         LA    R2,8(R2)                 UPDATE MESSAGE POINTER     MP   54300020
         BCT   R1,MSLOOP                EXIT AFTER 7-BITS PROCESSED MP  54360020
MSREND   BAL   BRANPRT,XWRTPRT          WRITE CHANNEL STATUS MESSAGEMP  54420020
         LTR   UPKREG,UPKREG            TEST FOR SECOND TIME THROUGH MP 54480020
         BC    7,PRTHD                  BOTH BYTES OF CHANSTAT PRINTED  54540020
         LA    UPKREG,1(UPKREG)         PTR TO 2ND.BYTE OF CHANSTATMP   54600020
         MVC   10(27,SETUPADR),CHCNFIG  MOVE IN CHANNEL CONFIGURATIONMP 54660020
*                                       MESSAGE                    MP   54720020
         MVI   0(SETUPADR),C'0'         SKIP SPACE AFTER NEXT MESSAGEMP 54780020
         TM    MPINFOFD,ID         ESTABLISH CPUID                19032 54840020
         BO    CCHMOVE                  BRANCH IF CPUID=CPU2       MP   54900020
         MVI   14(SETUPADR),C'2'        PUT CPU2 IN MESSAGE        MP   54960020
         B     CCHMOVE       PRINT MESSAGE                         MP   55020020
PRTHD    MVI   SETUPBFR+1,C'*'             SETUP TO PRINT DIVIDER       55080020
         MVC   2(78,SETUPADR),1(SETUPADR)                               55140020
         MVI   SETUPBFR,C'0'               SPACE FIRST                  55200020
         BAL   BRANPRT,XWRTPRT             PRINT DIVIDER                55260020
DUMMYTST LA    SETUPADR,SETUPBFR   GET ADDR OF BUFFER FOR PRINT    MP   55320020
         OC    ERPIBFLD+1(3),ERPIBFLD+1  TEST FOR DUMMY ERPIB     19032 55380020
         BNE   MSCONT                   CONTINUE IF MEANINGFUL ERPIB MP 55440020
         MVI   0(SETUPADR),C'-'         SKIP 2 LINES               MP   55560020
         MVC   10(17,SETUPADR),MSNERPIB ERPIB NOT CREATED MESSAGE  MP   55680020
         BAL   BRANPRT,XWRTPRT          PRINT INFORMATION          MP   55740020
         B     RETCNTL       RETURN CONTROL                        MP   55800020
*                                                                  MP   55860020
         EJECT                                                          55920020
MSCONT   EQU   *                                                   MP   55980020
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  56040020
*                          INSTRUCTION ANALYSIS                       * 56100020
*        THIS PROGRAM SECTION WILL INSPECT THE FIRST FOUR(4) BITS IN  * 56160020
*        THE FIRST BYTE  OF THE              ERPIB AREA, TO DETERMINE * 56220020
*        THE INSTRUCTION CAUSING THE ERROR.                           * 56280020
         LA    SETUPADR,SETUPBFR       SET UP HEADER BOARDER.           56340020
         MVC   SETUPBFR+27(25),HEADER    SET UP HEADER MESSAGE          56400020
         MVI   0(SETUPADR),C'0'          SPACE ONE LINE                 56460020
         BAL   BRANPRT,XWRTPRT                                          56520020
*                                                                     * 56580020
*                            TEST FOR INTERRUPT                       * 56640020
*                                                                     * 56700020
         TM    SOFWFLGS,X'40'          INTERRUPT TEST.                  56760020
         BZ    INST                                                     56820020
         MVC   SETUPBFR(42),ERRINT     BUFFER INTERRUPT MESSAGE.        56880020
         B     RITEOUT                                                  56940020
*                                                                     * 57000020
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  57060020
*                                                                     * 57120020
*        BITS 32-35 WILL BE TESTED                                    * 57180020
*                                                                     * 57240020
INST     MVC   SETUPBFR(33),CAUSERR    TYPE-INST ERROR HEADER.          57300020
         TM    SOFWFLGS,X'80'          TEST FOR SIO INSTRUCTION ERROR.  57360020
         BO    PRTERSIO                BRANCH TO SETUP PRINT BUFFER.    57420020
         TM    SOFWFLGS,X'20'          TEST FOR TIO INSTRUCTION.        57480020
         BO    PRTERTIO                BRANCH TO SETUP PRINT BUFFER.    57540020
*                                                                     * 57600020
PRTERHIO MVC   SET1(3),ERRHIO          MOVE HIO LABEL INTO BUFFER.      57660020
         B     RITEOUT                 PREPARE TO WRITE MESSAGE.        57720020
*                                                                     * 57780020
PRTERSIO MVC   SET1(3),ERRSIO          MOVE SIO LABEL INTO BUFFER.      57840020
         B     RITEOUT                 PREPARE TO WRITE MESSAGE.        57900020
*                                                                     * 57960020
PRTERTIO MVC   SET1(3),ERRTIO          MOVE TIO LABEL INTO BUFFER.      58020020
*                                                                     * 58080020
RITEOUT  BAL   BRANPRT,XWRTPRT         WRITE OUT APPROPRIATE MESSAGE.   58140020
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  58200020
*        THE FOLLOWING PROGRAM SECTION WILL INSPECT THE ERPIBFLD        58260020
*        TO DETERMINE IF AN ERPIB IS PRESENT.   IF  ONE IS              58320020
*        NOT FOUND, CONTROL WILL BE RETURNED.                           58380020
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  58440020
         OC    ERPIBFLD+1(3),ERPIBFLD+1  TEST FOR  ERPIB PRESENT  19032 58500020
         BZ    NONEXIST                WRITE MSG TO INDICATE NONEXISTS. 58560020
         B     TEST1         TEST COMPLETION CODE                  MP   58620020
SETVD    EQU   XPRTBUF+33                                          MP   58680020
*                         UCB ADDRESS NON-EXISTANT                      58740020
NONEXIST MVC   SETUPBFR(45),NOUCB        SET UP MSG FOR NO UCB          58800020
         BAL   BRANPRT,XWRTPRT         WRITE MESSAGE.                   58860020
         B     RETCNTL                 RETURN TO CONTROL.               58920020
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  58980020
*        THE FOLLOWING PROGRAM SECTION WILL TEST  BYTE 5     OF THE     59040020
*        ERPIB FOR A NO RETRY BIT SETTING. IF ON, CONTROL IS RETURNED   59100020
*        AFTER MESSAGE IS PRINTED OUT.                                  59160020
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  59220020
*                       OUTPUT RETRY CODE VALUE                         59280020
*                                                                       59340020
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  59400020
*                            TEST SOFTWARE FLAGS                        59460020
TEST     MVC   SETUPBFR(32),RETCDVAL     BUFFER THE BASIC MESSAGE       59520020
         IC    REG,CMPLBITS        CONTENTS OF BYTE 8 INTO R3     19032 59580002
         TM    VALFLAGS,X'10'            TEST FOR VALID RETRY CODE      59640020
         BO    VALFLG              IF VALID, GO SETUP MESSAGE           59700020
         MVC   33(43,SETUPADR),NOTVM  SETUP NOT ASSESSABLE MESSAGE      59760020
         B     BUFITA           GO PRINT IT                             59820020
VALFLG   N     REG,MASK            GET RID OF UNNEED BITS               59880002
         STC   REG,RCMSG+12        STORE NO. IN RETRY CODE MSG          59940002
         OI    RCMSG+12,X'F0'      MAKE PRINTABLE                       60000020
         MH    REG,CONST                                                60001002
         LA    REG,MSGSTRT(REG)    SET UP MSG INDEX                     60002002
         MVC   33(44,SETUPADR),0(REG)  MOVE MSG TO BUFFER               60003002
BUFIT    BAL   BRANPRT,XWRTPRT     PRINT IT                             60240020
         MVC   34(14,SETUPADR),RCMSG  MOVE RETRY MSG TO BUFFER          60300020
BUFITA   BAL   BRANPRT,XWRTPRT                                          60360020
         TM    CMPLBITS,X'08'      IS DISCONNECT IN SET           19032 60420020
         BNO   NOTDISIN            NO, SKIP MSG                   19032 60480020
         MVC   SETUPBFR(23),DISCIN SET UP MSG                     19032 60540020
         BAL   BRANPRT,XWRTPRT     PRINT MSG                      19032 60600020
NOTDISIN EQU   *                                                  19032 60660020
*                                                                       60720020
*                                  TEST NO-RETRY BIT                    60780020
         TM    SOFWFLGS,X'01'          IF NORETRY BIT IS NOT ON,BRANCH  60840020
*                                      TO PRINT VALID INDICATOR MSG.    60900020
         BZ    VALIDIND                                                 60960020
         MVC   SETUPBFR(28),NORETRY    INDICATES THAT THE BIT WAS ON.   61020020
         BAL   BRANPRT,XWRTPRT         WRITE THE MESSAGE.               61080020
         B     RETCNTL                 RETURN CONTROL.                  61140020
VALIDIND MVC   SETUPBFR(29),VALIDITY   RECORDED DATA HEADING TO BUFFER  61200020
         BAL   BRANPRT,XWRTPRT         INDICATOR HEADER.                61260020
*                                                                       61320020
*                                  TEST VALID RETRY CODE                61380020
*                                                                       61440020
*                                                                       61500020
*                            TEST COUNT BIT                             61560020
         MVC   SETUPBFR(42),VALCOUNT   BUFFER THE BASIC MESSAGE.        61620020
         TM    SOFWFLGS,X'02'          TEST COUNT VALIDITY.             61680020
         BZ    INVCOUNT                IF OFF, PRINT INVALID MSG.       61740020
         MVC   33(9,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.    61800020
INVCOUNT BAL   BRANPRT,XWRTPRT         WRITE MESSAGE.                   61860020
*                                                                       61920020
*                            TEST FOR SENSE DATA STORED                 61980020
*                                                                       62040020
         MVC   SETUPBFR(43),SENSDATA   BUFFER THE BASIC MESSAGE.        62100020
         TM    SOFWFLGS,X'04'          TEST SENSE BIT.                  62160020
         BZ    NOSTORE                 IF OFF BRANCH TO WRITE NOSTORE.  62220020
         MVC   33(10,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.   62280020
NOSTORE  BAL   BRANPRT,XWRTPRT         WRITE THE MESSAGE.               62340020
*                            TEST UNIT STATUS BIT                       62400020
         MVC   SETUPBFR(42),INVALUN    BUFFER THE BASIC MESSAGE.        62460020
         TM    VALFLAGS,X'08'          TEST FOR VALID UNIT STATUS.      62520020
         BZ    WRTOUT                  UNIT STATUS INVALID.             62580020
         MVC   33(9,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.    62640020
WRTOUT   BAL   BRANPRT,XWRTPRT         WRITE MESSAGE.                   62700020
*                                                                       62760020
*                            TEST COMMAND ADDRESS BIT                   62820020
*                                                                       62880020
         MVC   SETUPBFR(42),INVALCAD   MOVE INVALID COM MSG TO BUFFER.  62940020
         TM    VALFLAGS,X'04'          TEST FOR VALID COMMAND ADDRESS.  63000020
         BZ    PTOUT                   COMMAND ADDRESS INVALID.         63060020
         MVC   33(9,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.    63120020
PTOUT    BAL   BRANPRT,XWRTPRT         WRITE THE MESSAGE.               63180020
*                                                                       63240020
*                            TEST CHANNEL ADDRESS BIT                   63300020
*                                                                       63360020
         MVC   SETUPBFR(42),INVALCHA   MOVE INVALID CHN MSG TO BFR.     63420020
         TM    VALFLAGS,X'02'          TEST FOR VALID CHANNEL ADDRESS.  63480020
         BZ    OUTWRT                  INVALID CHANNEL ADDRESS.         63540020
         MVC   33(9,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.    63600020
OUTWRT   BAL   BRANPRT,XWRTPRT         WRITE MESSAGE.                   63660020
*                                                                       63720020
*                            TEST FOR VALID DEVICE ADDRESS              63780020
*                                                                       63840020
         MVC   SETUPBFR(42),INVALDVA   MOVE INVALID DVC ADDR MSG TO BFR 63900020
         TM    VALFLAGS,X'01'          TEST FOR VALID DEVICE ADDRESS.   63960020
         BZ    OUTPRT                  INVALID DEVICE ADDRESS.          64020020
         MVC   33(9,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.    64080020
OUTPRT   BAL   BRANPRT,XWRTPRT         WRITE MESSAGE.                   64140020
*                                                                       64200020
*        PROBABLE SOURCE OF ERROR                                       64260020
*                                                                       64320020
         MVC   SETUPBFR(29),PSOERR      INSERT BASE MSG IN BUFFER       64380020
         CLI   PROBERR,X'80'            TEST FOR CPU ERROR              64440020
         BE    CPUER                    BRANCH TO SET UP CPU ERR MSG    64500020
         CLI   PROBERR,X'40'            TEST FOR CHANNEL ERROR          64560020
         BE    CHNER                    BRANCH TO SETUP CHANNEL ERROR   64620020
         CLI   PROBERR,X'20'       TEST FOR SCU ERROR             19032 64680020
         BE    SCUER               YES- GO SET UP FOR SCU ERRMSG  19032 64740020
         CLI   PROBERR,X'10'            TEST FOR STORAGE ERROR          64800020
         BE    STORGER                  GO SETUP STORAGE ERROR MSG      64860020
         CLI   PROBERR,X'08'            TEST FOR I/O INTERFACE ERROR    64920020
         BE    INFER                    GO SETUP I/O INTF ERROR MSG     64980020
         MVC   30(25,SETUPADR),NOTVM    SETUP NOT ASSESSABLE MESSAGE    65040020
         B     WPRMSG                   GO PRINT MSG                    65100020
CPUER    MVC   30(3,SETUPADR),CPUERMSG  BUFFER CPU ERROR MESSAGE        65160020
         B     WPRMSG                   GO PRINT                        65220020
CHNER    MVC   30(7,SETUPADR),CHANERMS  SETUP CHANNEL ERROR MESSAGE     65280020
         B     WPRMSG                   GO PRINT                        65340020
SCUER    MVC   30(20,SETUPADR),SCUERMS  SET UP SCU MSG            19032 65400020
         B     WPRMSG                   GO PRINT IT               19032 65460020
STORGER  MVC   30(7,SETUPADR),STOGERMS  SETUP STORAGE ERROR MESSAGE     65520020
         B     WPRMSG                   GO PRINT                        65580020
INFER    MVC   30(13,SETUPADR),IOINFER  SET UP INTERFACE ERROR MESSAGE  65640020
WPRMSG   BAL   BRANPRT,XWRTPRT          PRINT MESSAGE                   65700020
         B     RETCNTL                                                  65760020
*                                                                       65820020
*                            TEST COMPLETION CODE                       65880020
*                                                                       65940020
TEST1    MVC   SETUPBFR(23),COMCODE    INSERT COMPLETION CODE MESSAGE   66000020
*                                      IN PRINT BUFFER.                 66060020
         TM    CMPLBITS,X'C0'          TEST FOR COMPLETION CODE '3'.    66120020
         BO    SYSRET                  BRANCH FOR SYS RESET MSG OUTPUT. 66180020
         TM    CMPLBITS,X'80'          TEST FOR COMPLETION CODE '2'     66240020
         BO    SELRET                  BRANCH FOR SEL RESET MSG OUTPUT. 66300020
         TM    CMPLBITS,X'40'          TEST FOR COMPLETION CODE '1'     66360020
         BO    FORENDSQ                BRANCH FOR FORCED END MSG OUTPUT 66420020
*                                                                       66480020
*                            INTERFACE DISCONNECT                       66540020
*                                                                       66600020
         MVC   SET2(29),INTDISCN      SET UP INTERFACE DISCONNECT MSG   66660020
         B     WRITER                  MESSAGE AND WRITE IT OUT.        66720020
*                                                                       66780020
*                            SYSTEM RESET                               66840020
*                                                                       66900020
SYSRET   MVC   SET2(21),SYSRES        SETUP  THE SYSTEM RESET MSG AND   66960020
         B     WRITER                  WRITE IT OUT.                    67020020
*                                                                       67080020
*                            SELECTIVE RESET                            67140020
*                                                                       67200020
SELRET   MVC   SET2(24),SELRES          SETUP SELECTIVE RESET  MSG AND  67260020
         B     WRITER                  AND WRITE IT OUT.                67320020
*                                                                       67380020
*                            FORCED ENDING SEQUENCE                     67440020
*                                                                       67500020
FORENDSQ MVC   SET2(31),FORCEND         SETUP FORCE END MESSAGE AND     67560020
*                                      WRITE IT OUT.                    67620020
*                                                                       67680020
*                            OUTPUT OF COMPLETION                       67740020
*                              CODE MESSAGES                            67800020
*                                                                       67860020
WRITER   BAL   BRANPRT,XWRTPRT                                          67920020
         B     TEST                                                     67980020
*                                                                       68040020
*                                 RETURN CONTROL                        68100020
*                                                                       68160020
RETCNTL  EQU   *                                                  19032 68220020
         MVI   SETUPBFR+1,C'*'                                          68280020
         MVC   2(78,SETUPADR),1(SETUPADR)                               68340020
         MVI   0(SETUPADR),C'-'         SETUP TO SPACE TWICE            68400020
         BAL   BRANPRT,XWRTPRT                                          68460020
         TM    CSWORD+5,X'06'           TEST FOR CHN OR INTF CTL CHK    68520020
         BC    8,MSG                   NO, PRINT LOGOUT MESSAGE.        68580020
FIN1     DS    0C                                                       68640020
         LA    R0,0                     ZERO WORK REGISTER              68700020
         ST    R0,NXENTRY               CLEAR ENTRY POINTER             68760020
         L     R13,SVR13                RESTORE REG 13                  68820020
         LM    R14,R12,12(R13)          RESTORE REGISTERS               68880020
         BR    R14                      RETURN                          68940020
*                                                                       69000020
*                            PRINT NO-LOGOUT MESSAGE                    69060020
*                                                                       69120020
MSG      MVC   SETUPBFR+1(78),ERMSG     MESSAGE IN BUFFER               69180002
         BAL   BRANPRT,XWRTPRT                                          69240020
         L     R0,NOLOGPTR              POINT                  @YM2954P 69300002
         L     R1,RG9PTR                 AROUND                @YM2954P 69330002
         ST    R0,AD0(R1)                 LOGOUT               @YM2954P 69360002
         L     R0,NOLOGLAB                 LINES               @YM2954P 69390002
         L     R1,LPPTR                     AND                @YM2954P 69420002
         ST    R0,AD0(R1)                    LABELS            @YM2954P 69450002
         B     FIN1                                                     69480020
         SPACE                                                          69540020
*                                                                  MP   69600020
****    ROUTINE TO RETURN CONTROL TO CONTROL MODULE                     69660020
XWRTPRT  DS    0C                                                       69720020
         ST    BRANPRT,NXENTRY          STORE LINK ADDRESS              69780020
         STM   R12,R10,MYSAVE           SAVE SUBROUTINE REGS            69840020
         L     R0,RTNPTR                LOAD ADCON FOR RETURN POINTER   69900020
         L     R1,RG9PTR                LOAD POINTER TO REG9            69960020
         ST    R0,AD0(R1)               STORE RETURN POINTER            70020020
         L     R0,LBLPTR                LOAD POINTER TO LABEL           70080020
         L     R1,LPPTR                 LOAD POINTER TO LP              70140020
         ST    R0,AD0(R1)               STORE LABEL POINTER             70200020
         MVI   L0(R3),X09               SET CARRIAGE CTL CHAR           70260020
         L     R13,SVR13                RESTORE REG 13                  70320020
         LM    R14,R12,12(R13)          RESTORE REGISTERS               70380020
         BR    R14                      RETURN                          70440020
*                                                                       70500020
*                            STORAGE                                    70560020
*                                                                       70620020
         DS    0F                                                       70680020
TYPE     EQU   XDADBUF+5                                           MP   70740020
ENVCH    EQU   XDADBUF+56                                          MP   70800020
ENVMS    EQU   XDADBUF+63                                          MP   70860020
GPRMS    EQU   XDADBUF+248                                         MP   70920020
ONEVD    EQU   X'01'                                               MP   70980020
TWEN     EQU   X'20'                                               MP   71040020
EIGHTY   EQU   X'80'                                               MP   71100020
VDSTAR   EQU   XPRTBUF+79                                          MP   71160020
PLACE    EQU   ENVCH+32                                            MP   71220020
F252     EQU   252                                                 MP   71280020
FROMVD   EQU   GPRMS+32                                            MP   71340020
OCTVD    EQU     80                                                MP   71400020
AREAVD   EQU   GPRMS+92                                            MP   71460020
ID       EQU   X'08'                                               MP   71520020
MSBIT    EQU   X'10'                                                MP  71580020
K0       EQU   0                                                  19E03 71640020
K1       EQU   1                                                  19E03 71700020
K2       EQU   2                                                  19E03 71760020
K4       EQU   4                                                  19E03 71820020
K8       EQU   8                                                  19E03 71880020
K10      EQU   10                                                 19E03 71940020
K20      EQU   20                                                 19E02 72000020
K21      EQU   21                                                 19E02 72060020
K24      EQU   24                                                 19E03 72120020
FOXDOG   EQU   X'FD'                                              19E03 72180020
REL19    EQU   19                                                 19E02 72240020
XPRTBUF1 EQU   XPRTBUF+1                                          19E03 72300020
*                                                                       72360020
SETUPBFR EQU   XPRTBUF                                                  72420020
CSWORD   DC    D'0'                CSW LOCATION                   19032 72480020
ERPIBFLD DC    F'0'                LAST HALF ERPIB                19032 72540020
MULTISYS DC    F'0'                MULTI-PROCESSING INFO          19032 72600020
MASK     DC    F'7'                                                     72660020
MYSAVE   DS    15F                                                      72720020
SVR13    DS    1F                                                       72780020
NXENTRY  DC    F'0'                                                     72840020
VS2      DC    A(VS2FLG)                                       @YL02021 72870002
RTNPTR   DC    A(PRTERPIB-4)                                            72900020
RG9PTR   DC    A(REG9)                                                  72960020
LBLPTR   DC    A(LABELEND-1)                                            73020020
LPPTR    DC    A(LP)                                                    73080020
NOLOGPTR DC    A(VS2LINE-4)                                    @YM2954P 73140002
NOLOGLAB DC    A(VS2LAB-1)                                     @YM2954P 73170002
NOCRH    DC    A(NOTCRH-4)                                     @Z30CIMC 73180002
NOCRH1   DC    A(NOTCRH1-1)                                    @Z30CIMC 73190002
CONST    DC    H'44'                                                    73200020
TWOX     DC    H'2'                                                     73260020
SET1     EQU   SETUPBFR+22                                              73320020
SET2     EQU   SETUPBFR+21                                              73380020
*                                                                       73440020
*                            REGISTERS                                  73500020
REG      EQU   11                                                       73560002
UPKREG   EQU   6                       ADDRESSES UNPACK AREA.           73620020
SETUPADR EQU   7                       ADDRESSES PRINT BUFFER.          73680020
PRTABREG EQU   8                       ADDRESSES CONVERSION TABLE.      73740020
BASEREG  EQU   9                       BASE REGISTER.                   73800020
BRANPRT  EQU   11                      ADDRESSES PRINT ROUTINE.         73860020
CLEAREG  EQU   12                                                       73920020
SAVADDR  EQU   13                      ADDRESSES REGISTER SAVE AREA.    73980020
BRANADDR EQU   14                      BRANCH REGISTER.                 74040020
*                                                                       74100020
*                            MESSAGES                                   74160020
*                                                                       74220020
*                                                                       74280020
CAUSERR  DC    C'   CSW STORED BY  --             '                     74340020
ERRINT   DC    C'   CSW STORED BY  INTERRUPT               '            74400020
ERRSIO   DC    C'SIO'                                                   74460020
ERRTIO   DC    C'TIO'                                                   74520020
ERRHIO   DC    C'HIO'                                                   74580020
NOUCB    DC    C'   NO ADDITIONAL ERROR INFORMATION AVAILABLE.'         74640020
COMCODE  DC    C'   TERMINATION BY  --  '                               74700020
SYSRES   DC    C' SYSTEM RESET- CODE 3'                                 74760020
SELRES   DC    C' SELECTIVE RESET- CODE 2'                              74820020
FORCEND  DC    C' FORCED ENDING SEQUENCE- CODE 1'                       74880020
INTDISCN DC    C' INTERFACE DISCONNECT- CODE 0'                         74940020
RETCDVAL DC    C'   TIME CHANNEL DETECTED ERROR -'                      75000020
RCMSG    DC    C'RETRY CODE    '                                        75060020
MSGSTRT  DC    C' WHILE EXECUTING TIO                        '          75120020
         DC    C' BETWEEN COMMAND OUT AND UNIT STATUS RETURN '          75180020
         DC    C' COMMAND ACCEPTED BUT BEFORE DATA TRANSFER  '          75240020
         DC    C' SOME DATA TRANSFER-CSW COMMAND ADR UPDATED '          75300020
         DC    C' COMMAND REJECTED OR COMMAND OUT NOT SENT   '          75360020
         DC    C' COMMAND ACCEPTED-DATA TRANSFER UNDETERMINED'          75420020
         DC    C' COULD NOT BE ASSESSED                      '          75480020
NOTVM    DC    C' COULD NOT BE ASSESSED                      '          75540020
NORETRY  DC    C'   PROGRAM ASSESSED NO RETRY'                          75600020
DISCIN   DC    C'   DISCONNECT IN ISSUED'                         19032 75660020
VALIDITY DC    C'   VALIDITY OF RECORDED DATA '                         75720020
VALCOUNT DC    C'            COUNT              = NOT VALID'            75780020
SENSDATA DC    C'            SENSE DATA         = NOT STORED'           75840020
INVALUN  DC    C'            UNIT STATUS        = NOT VALID'            75900020
INVALCAD DC    C'            COMMAND ADDRESS    = NOT VALID'            75960020
INVALCHA DC    C'            CHANNEL ADDRESS    = NOT VALID'            76020020
INVALDVA DC    C'            DEVICE ADDRESS     = NOT VALID'            76080020
PSOERR   DC    C'   PROBABLE SOURCE OF ERROR- '                         76140020
CPUERMSG DC    C'CPU'                                                   76200020
CHANERMS DC    C'CHANNEL'                                               76260020
SCUERMS  DC    C'STORAGE CONTROL UNIT'                            19032 76320020
STOGERMS DC    C'STORAGE'                                               76380020
IOINFER  DC    C'CONTROL UNIT '                                         76440020
HEADER   DC    C' CHANNEL  ERROR  ANALYSIS'                             76500020
ERMSG    DC    C'CHANNEL CTRL OR I/F CTRL CHECK '                       76560020
         DC    C'NOT INDICATED IN CSW-NO LOGOUT'                        76620020
         DC    C' WITH THIS RECORD'                                     76680020
NOLOG    DC    C'CHANNEL FAILED TO LOG'                                 76710002
MSHEAD   DC    C'MULTI-SYSTEM INFORMATION'              MESSAGES   MP   76740020
MSCPUID  DC    C'CPU 1 FAILED'                           FOR        MP  76800020
MSCPUST  DC    C'CPU STATUS WAS '              ONLY THE            MP   76860020
PART     DC    C'PARTITIONED'                           M65MP TO BE  MP 76920020
SHAR     DC    C'SHARED'                        ONLY                MP  76980020
RECON    DC    C' BUT RECONFIGURED OUT'                 WRITTEN ON  MP  77040020
CHCNFIG  DC    C'CPU 1 CHANNEL CONFIGURATION'            SEC       MP   77100020
CHTAB    DC    C'CH0--ON CH1--ON CH2--ON CH3--ON CH4--ON'  *       MP   77160020
         DC    C' CH5--ON CH6--ON'                    STORAGE  FOR   MP 77220020
MSNERPIB DC    C'ERPIB NOT CREATED'         EREP RECORDS           MP   77340020
OFF      DC    C'OFF'                         CONSTANTS            MP   77400020
         DC    C'LINE   '                       MESSAGES            MP  77460020
LEVELVD  EQU    3            MODULE LEVEL INDICATOR                MP   77520020
RELTAB   DS    0C                                              @L03976  77520202
         DC    C'OS  '                                         @L03976  77520302
         DC    C'DOS '                                         @L03976  77520402
         DC    C'VS 1'                                         @L03976  77520502
         DC    C'V370'                                         @L03976  77520602
         DC    C'VS 2'                                         @L03976  77520702
         DC    C'    '                                         @L03976  77520802
         DC    C'    '                                         @L03976  77520902
         DC    C'    '                                         @L03976  77521002
WORK     EQU   XWORK                                                    77521402
XLABELP  EQU   LP                                                       77521602
         DROP  R15                                                      77580020
         EJECT                                                          77640020
FORMAT1  DC    F'0'                                                     77700020
         ENTRY FORMAT1                                                  77760020
FORMAT2  DC    F'0'                                                     77820020
LABELPTR DC    A(LABLAREA)                                              77880020
DISP     DC    FL2'0'                                                   77940020
         DC    X'01'                                                    78000020
         DC         X'000B8B00'         SKIP TO CHANNEL 1               78060020
         LABEL ' '                                                      78120020
*                                                                       78180020
         LINE       (9,40),(1,35),SKIP=2                                78240020
         HEX        XMOD,0,2B                                           78300020
         HEX        XSER,0,3B                                           78360020
         LABEL      'MODEL','SERIAL NO.'                                78420020
*                                                                       78480020
         LINE  (10,)                                                    78481002
         ROUTINE    XRELN,CONVREL                                       78482002
         LABEL      'XXXX REL.'                                         78483002
         LINE       (21,40)                                             78540020
         ROUTINE    XKEY,SETSOURC                                       78600020
         LABEL      '--- RECORD SOURCE -','TYPE - INBOARD'              78660020
*                                                                       78720020
         LINE                                                           78780020
         ROUTINE    XJOBN,SETPGMN                                       78840020
         LABEL      'JOB NAME'                                          78900020
*                                                                       78960020
         LINE       ,(8,40),SKIP=1                                      79020020
         ROUTINE    XSWS8,CONVTIME                                      79080020
         LABEL      'DAY  YEAR','HH MM SS.TH'                           79140020
         LINE       (8,40),(1,40),SKIP=2                                79200020
         ROUTINE    XDATE,SETDATE                                       79260020
         HEX        XTIME,1,4B                                          79320020
         LABEL      'DATE _','TIME _'                                   79380020
*                                                                       79440020
         LINE       (23,1),(1,1)                                        79500020
         HEX        XCUA,0,3B                                           79560020
         LABEL      'CHANNEL/UNIT ADDRESS'                              79620020
*                                                                       79680020
         LINE  (30,1),(1,1),SKIP=2                             @YL02021 79690002
         ROUTINE   XCHID,ISITVS2                               @YL02021 79700002
         HEX   VCUA                                            @YL02021 79710002
         LABEL     'ADDR.STORED IN LOC 184'                    @YL02021 79720002
         LINE       ,(14,1),SKIP=1                                      79740020
         ROUTINE    XKEY,SKIPPER                                        79800020
         LABEL      'CC   DA    FL     CT'                              79860020
         LINE       (14,3),(1,1),SKIP=2                                 79920020
         HEX        XFCCWCC,0,1B                                        79980020
         HEX        XFCCWDA,0,3B                                        80040020
         ROUTINE    XKEY,SPACER2                                        80100020
         HEX        XFCCWFL,0,1B                                        80160020
         HEX        XFCCW0,0,1B                                         80220020
         HEX        XFCCWCT,0,2B                                        80280020
         LABEL      'FAILING CCW'                                       80340020
*                                                                       80400020
         LINE       ,(14,1),SKIP=1                                      80460020
         ROUTINE    XKEY,SKIPPER                                        80520020
         LABEL      'K    CA    US CS  CT'                              80580020
         LINE       (14,3),(1,1),SKIP=2                                 80640020
         HEX        XCSWK,0,1B                                          80700020
         HEX        XCSWCA,0,3B                                         80760020
         ROUTINE    XKEY,SPACER2                                        80820020
         ROUTINE    XCSWUS0,SETHEX                                      80880020
         ROUTINE    XCSWCS0,SETHEX                                      80940020
         HEX        XCSWCT,0,2B                                         81000020
         LABEL      'CSW'                                               81060020
*                                                                       81120020
         LINE       ,(2,38),SKIP=1                                      81180020
         ROUTINE    XKEY,SKIPPER                                        81240020
         LABEL      'UNIT STATUS','CHANNEL STATUS'                      81300020
*                                                                       81360020
         LINE       (21,38),(3,38)                                      81420020
         BIN        XCSWUS0                                             81480020
         BIN        XCSWCS0                                             81540020
         LABEL      'ATTENTION','PRGM-CTLD IRPT'                        81600020
         LINE                                                           81660020
         BIN        XCSWUS1                                             81720020
         BIN        XCSWCS1                                             81780020
         LABEL      'STATUS MODIFIER','INCORRECT LENGTH'                81840020
         LINE                                                           81900020
         BIN        XCSWUS2                                             81960020
         BIN        XCSWCS2                                             82020020
         LABEL      'CONTROL UNIT END','PROGRAM CHECK'                  82080020
         LINE                                                           82140020
         BIN        XCSWUS3                                             82200020
         BIN        XCSWCS3                                             82260020
         LABEL      'BUSY','PROTECTION CHECK'                           82320020
         LINE                                                           82380020
         BIN        XCSWUS4                                             82440020
         BIN        XCSWCS4                                             82500020
         LABEL      'CHANNEL END','CHAN DATA CHECK'                     82560020
         LINE                                                           82620020
         BIN        XCSWUS5                                             82680020
         BIN        XCSWCS5                                             82740020
         LABEL      'DEVICE END','CHAN CTRL CHECK'                      82800020
         LINE                                                           82860020
         BIN        XCSWUS6                                             82920020
         BIN        XCSWCS6                                             82980020
         LABEL      'UNIT CHECK','I/F CTRL CHECK'                       83040020
         LINE       ,,SKIP=2                                            83100020
         BIN        XCSWUS7                                             83160020
         BIN        XCSWCS7                                             83220020
         LABEL      'UNIT EXCEPTION','CHAINING CHECK'                   83280020
*                                                                       83340020
         LINE       ,(1,1),SKIP=1                                       83400020
         ROUTINE    XKEY,SKIPPER                                        83460020
         LABEL      'I/O UNIT FOUND BUSY'                               83520020
         LINE       (27,5),(2,1),SKIP=2                                 83580020
         HEX        XAIO1                                               83640020
         HEX        XAIO2                                               83700020
         HEX        XAIO3                                               83760020
         HEX        XAIO4                                               83820020
         HEX        XAIO5                                               83880020
         HEX        XAIO6                                               83940020
         HEX        XAIO7                                               84000020
         HEX        XAIO8                                               84060020
         ROUTINE    XKEY,SETAIO                                         84120020
         LABEL      'CHANNEL/UNIT ADDR'                                 84180020
*                                                                       84240020
         LINE       ,(1,1),SKIP=1                                       84300020
         LABEL      '--- CHANNEL TYPE ---'                              84360020
         LINE       ,(8,1),SKIP=2                                       84420020
         LABEL      '2860'                                              84480020
         LINE       ,(1,1),SKIP=1                                       84540020
         LABEL      'HEADER SENSE SWITCHES FOUND ON'                    84600020
         LINE       ,(2,1)                                              84660020
         ROUTINE    XSWS8,CHKSW9                                        84720020
         LABEL      'RECORD INCOMPLETE'                                 84780020
         LINE                                                           84840020
         ROUTINE    XSWS8,CHKSW10                                       84900020
         LABEL      'SYSTEM TERMINATED'                                 84960020
         LINE                                                           85020020
         ROUTINE    XSWS8,CHKSW11                                       85080020
         LABEL      'UNSUPPORTED CHANNEL'                               85140020
         LINE                                                           85200020
         ROUTINE    XSWS8,CHKSW12                                       85260020
         LABEL      'CUA ILLEGAL'                                       85320020
         LINE                                                           85380020
         ROUTINE    XSWS8,CHKSW13                                       85440020
         LABEL      'PORTION OF RECORD HAS BEEN DESTROYED'              85500020
         LINE                                                           85560020
         ROUTINE    XSWS8,CHKSW14                                       85620020
         LABEL      'ERP WERE IN PROGRESS'                              85680020
         LINE                                                           85740020
         ROUTINE    XKEY,SKIPPER                                 P0417  85800020
         LABEL      ' '                                          P0417  85860020
PRTERPIB LINE       (1,1),(1,1),SKIP=1                                  85920020
         ROUTINE    XSWS8,IFCASR01                                      85980020
LABELEND LABEL      ''                                                  86040020
         LINE                                                           86090002
         ROUTINE CLWKEY1,ALLFFF                                  43068  86092002
         LABEL ''                                                       86094002
         LINE  ,(1,1),SKIP=2                                            86100020
         LABEL '2860 SEL CHANNEL'                                       86160020
         LINE  (45,),(22,),SKIP=1                                       86220020
         HEX   CLWKEY1,,1L                                              86280020
         LABEL 'KEY'                                                    86340020
         LINE                                                           86400020
         HEX   CLWCADR,,3B                                              86460020
         LABEL 'COMMAND ADR'                                            86520020
         LINE                                                           86580020
         HEX   CLWSTAT,,1B                                     @XA15959 86640000
         LABEL 'STATUS'                                                 86700020
         LINE                                                           86760020
         HEX   CLWCOUNT,,2B                                             86820020
         LABEL 'COUNT'                                                  86880020
         LINE                                                           86940020
         HEX   CLWBREG,,1B                                              87000020
         LABEL 'MARK B REG'                                             87060020
         LINE                                                           87120020
         HEX   CLWCREG,,1B                                              87180020
         LABEL 'COMMAND CODE'                                           87240020
         LINE                                                           87300020
         BIN   CLWFREG,,5                                               87360020
         LABEL 'FLAGS'                                                  87420020
         LINE                                                           87480020
         ROUTINE CLWCHAD,@CHANADR                                       87540020
         LABEL 'CHANNEL ADDRESS'                                        87600020
         LINE                                                           87660020
         HEX   CLWUARG,,1B                                              87720020
         LABEL 'UNIT ADDRESS'                                           87780020
         LINE                                                           87840020
         HEX   CLWDARG,,3B                                              87900020
         LABEL 'DATA ADDRESS'                                           87960020
         LINE                                                           88020020
         HEX   CLWSIMRG,,1B                                             88080020
         LABEL 'SIM IF REG'                                             88140020
         LINE  (45,),(22,),SKIP=2                                       88200020
         HEX   CLWCLOCK,,1B                                             88260020
         LABEL 'CLOCK'                                                  88320020
         LINE  ,(2,),SKIP=2                                             88380020
         LABEL 'CONTROL TRIGGERS'                                       88440020
         LINE  (18,20),(1,20),SKIP=1                                    88500020
         BIN   CLWARGFL                                                 88560020
         BIN   CLWCCWV                                                  88620020
         BIN   CLWLWT                                                   88680020
         LABEL 'A REG FULL','CCW VALID','LAST WORD TGR'                 88740020
         LINE                                                           88800020
         BIN   CLWBRGFL                                                 88860020
         BIN   CLWREAD                                                  88920020
         BIN   CLWBCCBT                                                 88980020
         LABEL 'B REG FULL','READ','BC EQ CTB TGR'                      89040020
         LINE                                                           89100020
         BIN   CLWCHCML                                                 89160020
         BIN   CLWWRITE                                                 89220020
         BIN   CLWBCOLT                                                 89280020
         LABEL 'CHAIN CMND LTH','WRITE','BC EQ 0 LATCH'                 89340020
         LINE                                                           89400020
         BIN   CLWSEQ1                                                  89460020
         BIN   CLWSETUP                                                 89520020
         BIN   CLWBCTGR                                                 89580020
         LABEL 'SEQ 1','SET UP','BC EQ 0 TGR'                           89640020
         LINE                                                           89700020
         BIN   CLWSEQ2                                                  89760020
         BIN   CLWTIC                                                   89820020
         BIN   CLWBCREG                                                 89880020
         LABEL 'SEQ 2','TIC','BC REG PTY'                               89940020
         LINE                                                           90000020
         BIN   CLWSEQ3                                                  90060020
         BIN   CLWTICHZ                                                 90120020
         BIN   CLWBIT3                                                  90180020
         LABEL 'SEQ 3','TIC CYCLE','BIT 3 BC REG'                       90240020
         LINE                                                           90300020
         BIN   CLWSEQ4                                                  90360020
         BIN   CLWPIRPT                                                 90420020
         BIN   CLWBIT2                                                  90480020
         LABEL 'SEQ 4','POLLING IRPT','BIT 2 BC REG'                    90540020
         LINE  (18,20),(1,20),SKIP=2                                    90600020
         BIN   CLWSEQ5                                                  90660020
         BIN   CLWCDALT                                                 90720020
         BIN   CLWBIT1                                                  90780020
         LABEL 'SEQ 5','CDA LATCH','BIT 1 BC REG'                       90840020
         LINE  ,(2,),SKIP=2                                             90900020
         LABEL 'REGISTER PARITIES'                                      90960020
         LINE  (18,20),(1,20),SKIP=1                                    91020020
         BIN   CLWPSPR                                                  91080020
         BIN   CLWPUAR                                                  91140020
         LABEL 'STORAGE PROTECT','UNIT ADDRESS'                         91200020
         LINE                                                           91260020
         BIN   CLWPOCAR                                                 91320020
         BIN   CLWP0DAR                                                 91380020
         LABEL 'P0 COMMAND ADR','P0 DATA ADR'                           91440020
         LINE                                                           91500020
         BIN   CLWP1CAR                                                 91560020
         BIN   CLWP1DAR                                                 91620020
         LABEL 'P1 COMMAND ADR','P1 DATA ADR'                           91680020
         LINE                                                           91740020
         BIN   CLWP2CAR                                                 91800020
         BIN   CLWP2DAR                                                 91860020
         LABEL 'P2 COMMAND ADR','P2 DATA ADR'                           91920020
         LINE                                                           91980020
         BIN   CLWPDIB                                                  92040020
         BIN   CLWPMBR                                                  92100020
         LABEL 'DATA BUS IN','MARK B'                                   92160020
         LINE                                                           92220020
         BIN   CLWPOCRG                                                 92280020
         BIN   CLWPCOMR                                                 92340020
         LABEL 'P0 COUNT','COMMAND'                                     92400020
         LINE                                                           92460020
         BIN   CLWP1CRG                                                 92520020
         BIN   CLWPFLAG                                                 92580020
         LABEL 'P1 COUNT','FLAGS'                                       92640020
         LINE  (18,20),(1,20),SKIP=3                                    92700020
         BIN   CLWP2CRG                                                 92760020
         BIN   CLWPSIMR                                                 92820020
         LABEL 'P2 COUNT','SIM IF'                                      92880020
         LINE  ,(2,),SKIP=2                                             92940020
         LABEL 'IF TAGS'                                                93000020
         LINE  (18,20),(1,20),SKIP=1                                    93060020
         BIN   CLWOPIN                                                  93120020
         BIN   CLWADOLT                                                 93180020
         BIN   CLWSLOLT                                                 93240020
         BIN   CLWSEROT                                                 93300020
         LABEL 'OP-I','AD-O LATCH','SL-O LATCH','SR-O LATCH'            93360020
         LINE                                                           93420020
         BIN   CLWCOMOT                                                 93480020
         BIN   CLWSTIO                                                  93540020
         BIN   CLWHTIO                                                  93600020
         LABEL 'CM-O LATCH','SIO LATCH','HIO LATCH'                     93660020
         LINE  ,                                               @YM6454P 93670002
         BIN  CLWIDA00                                         @YM6454P 93680002
         BIN  CLWDIN00                                         @YM6454P 93690002
         BIN  CLWSTO00                                         @YM6454P 93700002
         LABEL 'IDA FETCH','DISCONNECT IN','STORAGE TIMEOUT'   @YM6454P 93710002
         LINE  (18,20),(1,20),SKIP=2                                    93720020
         BIN   CLWSTOCK                                                 93780020
         LABEL 'STO CHECK'                                              93840020
VS2LINE  LINE  ,,SKIP=1                                        @YM2954P 93840702
         ROUTINE   XCHID,VS2TEST                               @YL02021 93841402
VS2LAB   LABEL ''                                              @YM2954P 93842102
         LINE  (30),(1),SKIP=2                                 @YM2954P 93844202
         HEX   VCCHPR1                                         @YM2954P 93884202
         LABEL 'CCH FOOTPRINTS'                                @YM2954P 93924202
         LINE  (50,1),(20,1),SKIP=1                            @YM2954P 93964202
         BIN   VCCHPR01                                        @YM2954P 94004202
         LABEL 'IOS GPRS SAVED'                                @YM2954P 94044202
         LINE  ,                                               @YM2954P 94084202
         BIN   VCCHPR02                                        @YM2954P 94124202
         LABEL 'UCB ADDRESS ZERO'                              @YM2954P 94164202
         LINE  ,                                               @YM2954P 94204202
         BIN   VCCHPR03                                        @YM2954P 94244202
         LABEL 'ERPIB EXISTS'                                  @YM2954P 94284202
         LINE  ,                                               @YM2954P 94324202
         BIN   VCCHPR04                                        @YM2954P 94364202
         LABEL 'IGFCCHSI ENTERED'                              @YM2954P 94404202
         LINE  ,                                               @YM2954P 94444202
         BIN   VCCHPR05                                        @YM2954P 94484202
         LABEL 'IGFCCHII ENTERED'                              @YM2954P 94524202
         LINE  ,                                               @YM2954P 94564202
         BIN   VCCHPR06                                        @YM2954P 94604202
         LABEL 'IGFCCHFE ENTERED'                              @YM2954P 94644202
         LINE  ,                                               @YM2954P 94684202
         BIN   VCCHPR07                                        @YM2954P 94724202
         LABEL 'IGFC60 ENTERED'                                @YM2954P 94764202
         LINE  ,                                               @YM2954P 94804202
         BIN   VCCHPR08                                        @YM2954P 94844202
         LABEL 'IGFC70 ENTERED'                                @YM2954P 94884202
         LINE  ,                                               @YM2954P 94924202
         BIN   VCCHPR09                                        @YM2954P 94964202
         LABEL 'IGDC80 ENTERED'                                @YM2954P 95004202
         LINE  ,                                               @YM2954P 95044202
         BIN   VCCHPR10                                        @YM2954P 95084202
         LABEL 'IGFCIC ENTERED'                                @YM2954P 95124202
         LINE  ,                                               @YM2954P 95164202
         BIN   VCCHPR11                                        @YM2954P 95204202
         LABEL 'IGFCCHRD ENTERED'                              @YM2954P 95244202
         LINE  ,                                               @YM2954P 95284202
         BIN   VCCHPR12                                        @YM2954P 95324202
         LABEL 'IGFCCHMP ENTERED'                              @YM2954P 95364202
         LINE  ,                                               @YM2954P 95404202
         BIN   VCCHPR13                                        @YM2954P 95444202
         LABEL 'IGFCCHUC ENTERED'                              @YM2954P 95484202
         LINE  ,                                               @YM2954P 95524202
         BIN   VCCHPR14                                        @YM2954P 95564202
         LABEL 'IGFCCHAS ENTERED'                              @YM2954P 95604202
         LINE  ,                                               @YM2954P 95644202
         BIN   VCCHPR15                                        @YM2954P 95684202
         LABEL 'IGFCCHIO ENTERED'                              @YM2954P 95724202
         LINE  ,,SKIP=2                                        @YM2954P 95764202
         BIN   VCCHPR16                                        @YM2954P 95804202
         LABEL 'IGFCCHEX ENTERED'                              @YM2954P 95844202
         LINE  ,(30,30),SKIP=2                                 @YM2954P 95884202
         ROUTINE    XCHID,SKIPPER                              @YM2954P 95924202
         LABEL 'MULTIPROCESSING INFORMATION'                   @YM2954P 95964202
         LINE  ,(22,40),SKIP=2                                 @Z30CIMC 95974202
         ROUTINE XCRH,CRHACT                                   @Z30CIMC 95984202
         LABEL 'CHANNEL RECONFIGURATION HARDWARE IS ACTIVE'    @Z30CIMC 95994202
NOTCRH   LINE  ,(49,1),SKIP=1                                  @Z30CIMC 96004202
NOTCRH1  LABEL '0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15'         96044202
         LINE  (25,25),(30,30),SKIP=1                          @YM2954P 96084202
         HEX   (VPROC01)                                       @YM2954P 96124202
         ROUTINE    VCHST01,PROC                               @YM2954P 96164202
         LABEL ''                                              @YM2954P 96204202
         LINE  ,                                               @YM2954P 96244202
         HEX   (VPROC02)                                       @YM2954P 96284202
         ROUTINE    VCHST02,PROC                               @YM2954P 96324202
         LABEL ''                                              @YM2954P 96364202
         LINE  ,                                               @YM2954P 96404202
         HEX   (VPROC03)                                       @YM2954P 96444202
         ROUTINE    VCHST03,PROC                               @YM2954P 96484202
         LABEL ''                                              @YM2954P 96524202
         LINE  ,                                               @YM2954P 96564202
         HEX   (VPROC04)                                       @YM2954P 96604202
         ROUTINE    VCHST04,PROC                               @YM2954P 96644202
         LABEL ''                                              @YM2954P 96684202
         LINE  ,                                               @YM2954P 96724202
         HEX   (VPROC05)                                       @YM2954P 96764202
         ROUTINE    VCHST05,PROC                               @YM2954P 96804202
         LABEL ''                                              @YM2954P 96844202
         LINE  ,                                               @YM2954P 96884202
         HEX   (VPROC06)                                       @YM2954P 96924202
         ROUTINE    VCHST06,PROC                               @YM2954P 96964202
         LABEL ''                                              @YM2954P 97004202
         LINE  ,                                               @YM2954P 97044202
         HEX   (VPROC07)                                       @YM2954P 97084202
         ROUTINE    VCHST07,PROC                               @YM2954P 97124202
         LABEL ''                                              @YM2954P 97164202
         LINE  ,                                               @YM2954P 97204202
         HEX   (VPROC08)                                       @YM2954P 97244202
         ROUTINE    VCHST08,PROC                               @YM2954P 97284202
         LABEL ''                                              @YM2954P 97324202
         LINE  ,                                               @YM2954P 97364202
         HEX   (VPROC09)                                       @YM2954P 97404202
         ROUTINE    VCHST09,PROC                               @YM2954P 97444202
         LABEL ''                                              @YM2954P 97484202
         LINE  ,                                               @YM2954P 97524202
         HEX   (VPROC10)                                       @YM2954P 97564202
         ROUTINE    VCHST10,PROC                               @YM2954P 97604202
         LABEL ''                                              @YM2954P 97644202
         LINE  ,                                               @YM2954P 97684202
         HEX   (VPROC11)                                       @YM2954P 97724202
         ROUTINE    VCHST11,PROC                               @YM2954P 97764202
         LABEL ''                                              @YM2954P 97804202
         LINE  ,                                               @YM2954P 97844202
         HEX   (VPROC12)                                       @YM2954P 97884202
         ROUTINE    VCHST12,PROC                               @YM2954P 97924202
         LABEL ''                                              @YM2954P 97964202
         LINE  ,                                               @YM2954P 98004202
         HEX   (VPROC13)                                       @YM2954P 98044202
         ROUTINE    VCHST13,PROC                               @YM2954P 98084202
         LABEL ''                                              @YM2954P 98124202
         LINE  ,                                               @YM2954P 98164202
         HEX   (VPROC14)                                       @YM2954P 98204202
         ROUTINE    VCHST14,PROC                               @YM2954P 98244202
         LABEL ''                                              @YM2954P 98284202
         LINE  ,                                               @YM2954P 98324202
         HEX   (VPROC15)                                       @YM2954P 98364202
         ROUTINE    VCHST15,PROC                               @YM2954P 98404202
         LABEL ''                                              @YM2954P 98444202
         LINE  ,                                               @YM2954P 98484202
         HEX   (VPROC16)                                       @YM2954P 98524202
         ROUTINE    VCHST16,PROC                               @YM2954P 98564202
         LABEL ''                                              @YM2954P 98604202
DMPSPACE LINE  ,,SKIP=2                                        @Z30CIMC 98614202
         ROUTINE XDUM1,SKIPPER                                 @Z30CIMC 98624202
DMPSPC1  LABEL ''                                              @Z30CIMC 98634202
DUMPCODE DC    XL1'FF'                                         @YM2954P 98644202
DUMPSIZE DC    XL2'1E8'                                        @YM2954P 98684202
         DC    XL2'18'                                         @YM2954P 98724202
ADDRLABL DC    XL2'0'                                          @YM2954P 98764202
LABLAREA EQU   *                                               @YM2954P 98804202
         LSTART ,                                              @YM2954P 98844202
         END   ENTRYPTR                                        @YM2954P 98884202
