         TITLE 'IFCEXXXA - EDIT TABLE - LINKNAME=IFCE2400,ALIASES=IFCE3C00075002
               211,IFCE3540'                                            00105002
*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 00150002
         SPACE 2                                                        00225002
         SPACE 2                                                        00300002
*  LINE MACRO     LINE MACRO     LINE MACRO     LINE MACRO            * 00375002
         MACRO                                                          00450002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      00525002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     00600002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    00675002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 00750002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    00825002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    00900002
.*                                 THE PREVIOUS LINE AND STORES THAT #  00975002
.*                                 INTO THE APPROPRIATE BYTE.           01050002
.*                                 &DATA(1) - CHARACTER POSITION TO     01125002
.*                                 BEGIN DATA.                          01200002
.*                                                                      01275002
.*                                 &DATA(2) - # OF SPACES BETWEEN       01350002
.*                                 SUCCESSIVE DATA COLUMN STARTING      01425002
.*                                 CHARACTERS.                          01500002
.*                                                                      01575002
.*                                 &LABEL(1) - CHARACTER POSITION       01650002
.*                                 TO BEGIN LABELS.                     01725002
.*                                                                      01800002
.*                                 &LABEL(2) - # OF SPACES BETWEEN      01875002
.*                                 LINE'S LABEL STARTING CHARACTERS.    01950002
.*                                                                      02025002
.*                                 &SKIP= - # OF LINES TO ADVANCE       02100002
.*                                 CARRIAGE TO BEGIN NEXT PRINTED LINE. 02175002
.*                                                                      02250002
.*                                 NEW ENTRIES ARE GENERATED ONLY WHEN  02325002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   02400002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 02475002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   02550002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 02625002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    02700002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   02775002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   02850002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   02925002
.*                                 THE SUBJECT LINE.                    03000002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  03075002
         GBLA  &LASTCC,&INITIAL                                         03150002
         GBLC  &NRENTSX                                                 03225002
         GBLC  &CARRCON                                                 03300002
         GBLB  &TEST                                                    03375002
         LCLA  &S                                                       03450002
&NAME    DS    0C                                                       03525002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  03600002
         LINEND                                                         03675002
         AGO   .NTFIRST                                                 03750002
.FIRSTLN ANOP                                                           03825002
&NRENTSX SETC  'N&SYSNDX'                                               03900002
&INITIAL SETA  1                                                        03975002
&LASTCC  SETA  1                                                        04050002
N&SYSNDX EQU   *                                                        04125002
.NTFIRST ANOP                                                           04200002
         DC    AL1(0)                                                   04275002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               04350002
         AIF   ('&DATA'(1,1) NE '(').SLABEL                             04425002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                04500002
&DB      SETA  &DATA(1)                                                 04575002
         AGO   .AA                                                      04650002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                04725002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 04800002
         AGO   .CC                                                      04875002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    04950002
         AIF   (&DATA(2) EQ &DT).BB                                     05025002
.CC      ANOP                                                           05100002
&DT      SETA  &DATA(2)                                                 05175002
.BB      DC    XL2'FFFE'                                                05250002
         DC    FL1'&DB'                                                 05325002
         DC    FL1'&DT'                                                 05400002
&NRENTS  SETA  &NRENTS+1                                                05475002
.NCDATA  ANOP                                                           05550002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              05625002
         AIF   ('&LABEL'(1,1) NE '(').SLABEL                            05700002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               05775002
&LB      SETA  &LABEL(1)                                                05850002
         AGO   .AAA                                                     05925002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              06000002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               06075002
         AGO   .CCC                                                     06150002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  06225002
         AIF   (&LABEL(2) EQ &LT).BBB                                   06300002
.CCC     ANOP                                                           06375002
&LT      SETA  &LABEL(2)                                                06450002
.BBB     DC    XL2'FFFF'                                                06525002
         DC    FL1'&LB'                                                 06600002
         DC    FL1'&LT'                                                 06675002
&NRENTS  SETA  &NRENTS+1                                                06750002
.NCLABEL ANOP                                                           06825002
         AIF   ('&SKIP' EQ 'E').EJECT                                   06900002
         AIF   ('&SKIP' EQ '').TESTOFF                                  06975002
.CONT    ANOP                                                           07050002
         AIF   (&TEST EQ 0).AB                                          07125002
         AIF   (&SKIP EQ &LASTCC).TESTOFF                               07200002
&S       SETA  &SKIP                                                    07275002
         ORG   &CARRCON+3                                               07350002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 07425002
         ORG                                                            07500002
&LASTCC  SETA  &S                                                       07575002
.SLABEL  ANOP                                                           07650002
.TESTOFF ANOP                                                           07725002
&TEST    SETB  0                                                        07800002
         AGO   .DD                                                      07875002
.EJECT   DC    XL2'FFFB'                                                07950002
&NRENTS  SETA  &NRENTS+1                                                08025002
         DC    X'8B'              SKIP TO CHANNEL 1                     08100002
         DC    AL.3(0),AL.2(&LASTCC),AL.3(1)                            08175002
&TEST    SETB  1                                                        08250002
         AGO   .DD                                                      08325002
.AB      AIF   (&SKIP EQ &LASTCC).NOCHANG                               08400002
A&SYSNDX DC    XL2'FFFB'                                                08475002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              08550002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              08625002
&LASTCC  SETA  &SKIP                                                    08700002
&TEST    SETB  1                                                        08775002
&CARRCON SETC  'A&SYSNDX'                                               08850002
&NRENTS  SETA  &NRENTS+1                                                08925002
.DD      ANOP                                                           09000002
.NOCHANG ANOP                                                           09075002
         MEND                                                           09150002
         EJECT                                                          09225002
         SPACE 2                                                        09300002
*  ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO* 09375002
         MACRO                                                          09450002
&NAME    ROUTINE &LOGITEM,&RNAME                                        09525002
         GBLC  &DSECT,&CSECT                                            09600002
         GBLC  &ITEM(1000)                                              09675002
         GBLA  &SHIFT(1000),&ITEMNBR                                    09750002
         GBLA  &NRENTS                                                  09825002
         LCLA  &ISHIFT,&NDX                                             09900002
.LOOP    ANOP                                                           09975002
&NDX     SETA  &NDX+1                                                   10050002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      10125002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  10200002
         MNOTE *,'LOG ITEM NOT DEFINED'                                 10275002
         MEXIT                                                          10350002
.FOUND   ANOP                                                           10425002
&ISHIFT  SETA  &SHIFT(&NDX)                                             10500002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           10575002
         DC    AL.4(&ISHIFT),AL.12(&RNAME-&CSECT)                       10650002
&NRENTS  SETA  &NRENTS+1                                                10725002
         MEND                                                           10800002
*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 10875002
         SPACE 2                                                        10950002
         MACRO                                                          11025002
&NAME    DSGEN &X1,&X2,&X3,&X4,&X5,&X6,&X7,&X8,&X9,&X10,&X11,&X12,&X13,X11100002
               &X14,&X15,&X16,&X17,&X18,&X19,&X20,&X21,&X22,&X23,&X24, X11175002
               &X25,&X26,&X27,&X28,&X29,&X30,&X31,&X32                  11250002
.*                            THIS MACRO GENERATES ONE DSECT WORD       11325002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 11400002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  11475002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    11550002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 11625002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   11700002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 11775002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      11850002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  11925002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    12000002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   12075002
         GBLC &ITEM(1000)                                               12150002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000)                         12225002
         LCLC  &SYMBOL                                                  12300002
         LCLA  &OP,&COUNT,&BYTE                                         12375002
.LOOP    ANOP                                                           12450002
&OP      SETA  &OP+1                                                    12525002
&ITEMNBR SETA  &ITEMNBR+1                                               12600002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        12675002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            12750002
         MNOTE *,'NULL BIT COUNT FIELD'                                 12825002
         MEXIT                                                          12900002
.OK1     ANOP                                                           12975002
         AIF   ('&SYMBOL' NE '').OK                                     13050002
         MNOTE 'LOG ITEM SYMBOL NOT PROVIDED'                           13125002
         AGO   .CNT                                                     13200002
.OK      ANOP                                                           13275002
         AIF   ('&SYMBOL'(1,1) EQ '''').CNT                *TEMP*       13350002
&SYMBOL  EQU   *+&BYTE                                                  13425002
&ITEM(&ITEMNBR)  SETC '&SYSLIST(&OP,1)'                                 13500002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    13575002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    13650002
.CNT     ANOP                                                           13725002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   13800002
&BYTE    SETA  &COUNT/8                                                 13875002
         AIF (&OP LT N'&SYSLIST).LOOP                                   13950002
         AIF   (&COUNT NE 32).NOT32                                     14025002
&NAME    DS    4C                                                       14100002
         MEXIT                                                          14175002
.NOT32   AIF   (&COUNT NE 64).ERR                                       14250002
&NAME    DS    8C                                                       14325002
         MEXIT                                                          14400002
.ERR     MNOTE '**BIT COUNT FIELDS DO NOT TOTAL 32 OR 64**'             14475002
         MEND                                                           14550002
         MACRO                                                          14625002
         LINEND                                                         14700002
.*                            THIS MACRO IS USED ONLY BY THE LINE       14775002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   14850002
.*                                 ASSOCIATED WITH EACH LINE.           14925002
         GBLA  &NRENTS                                                  15000002
         GBLC &NRENTSX                                                  15075002
         ORG   &NRENTSX                                                 15150002
         DC    FL1'&NRENTS'                                             15225002
         ORG                                                            15300002
&NRENTS  SETA  0                                                        15375002
B&SYSNDX EQU   *                                                        15450002
&NRENTSX SETC  'B&SYSNDX'                                               15525002
         MEND                                                           15600002
         SPACE 2                                                        15675002
         EJECT                                                          15750002
*  LABEL MACRO     LABEL MACRO     LABEL MACRO     LABEL MACRO        * 15825002
         SPACE 2                                                        15900002
         MACRO                                                          15975002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C16050002
               &LABEL7,&LABEL8                                          16125002
.*                            THIS MACRO ALLOWS UP TO ACHT LABELS TO    16200002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   16275002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  16350002
.*                                 TION MARKS. THE COLUMN AND LINE END  16425002
.*                                 CONTROLS WILL BE INSERTED BY THE     16500002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      16575002
.*                                 LABEL REQUIRED FOR RESPECTIVE        16650002
.*                                 COLUMN. THIS MACRO WILL ALSO ALERT   16725002
.*                                 THE PROGRAMMER TO EXACTLY WHERE THE  16800002
.*                                 TABLE MUST BE BROKEN IF NECESSARY    16875002
.*                                 TO AVOID EXCEEDING THE MAXIMUM LIMIT 16950002
         GBLC &LABELS(2000)                                             17025002
         GBLC  &LBL(100)                                                17100002
         GBLA  &LBLCTR(100)                                             17175002
         GBLA  &LABELNR                                                 17250002
         GBLA  &NRENTS,&LPTR                                            17325002
         LCLC  &MARGIN,&TACK                                            17400002
         LCLC  &TEXT                                                    17475002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            17550002
&MARGIN  SETC  '*'                                                      17625002
         AIF   ('&NAME' EQ '').LOOPOUT                                  17700002
&LPTR    SETA  &LPTR+1                                                  17775002
&LBL(&LPTR) SETC '&NAME'                                                17850002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          17925002
.LOOPOUT ANOP                                                           18000002
&OP      SETA  &OP+1                                                    18075002
&K       SETA  K'&SYSLIST(&OP)                                          18150002
         AIF (&K GE 2).NORM                                             18225002
&K       SETA  2                                                        18300002
.NORM    ANOP                                                           18375002
&START   SETA  2                                                        18450002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                18525002
&MARGIN  SETC  '$'                                                      18600002
.NOTLAST ANOP                                                           18675002
&NRCHAR  SETA  8                                                        18750002
&TACK    SETC  ''                                                       18825002
.LOOPIN  ANOP                                                           18900002
&REMAIN  SETA  &K-&START                                                18975002
         AIF (&REMAIN GE 8).MORE                                        19050002
&TACK    SETC  '&MARGIN'                                                19125002
&NRCHAR  SETA  &REMAIN                                                  19200002
.MORE    ANOP                                                           19275002
&TEXT    SETC  ''                                                       19350002
         AIF (&REMAIN EQ 0).ENDTEXT                                     19425002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          19500002
.ENDTEXT ANOP                                                           19575002
&LABELNR SETA  &LABELNR+1                                               19650002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  19725002
&START   SETA  &START+8                                                 19800002
         AIF ('&TACK' EQ '').LOOPIN                                     19875002
         AIF ('&TACK' EQ '*').LOOPOUT                                   19950002
         MEND                                                           20025002
         SPACE 2                                                        20100002
         MACRO                                                          20175002
         LSTART                                                         20250002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  20325002
.*                                 OF THE TABLE IS TO BEGIN.            20400002
         GBLC &LABELS(2000)                                             20475002
         GBLA  &LABELNR                                                 20550002
         GBLC  &LBL(100)                                                20625002
         GBLA  &LBLCTR(100)                                             20700002
         LCLA  &NDX,&CTR                                                20775002
         LINEND                                                         20850002
&CTR     SETA  1                                                        20925002
.LOOP    ANOP                                                           21000002
&NDX     SETA  &NDX+1                                                   21075002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            21150002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         21225002
&CTR     SETA  &CTR+1                                                   21300002
         AGO   .LOOPCTL                                                 21375002
.NOLBL   ANOP                                                           21450002
         DC    C'&LABELS(&NDX)'                                         21525002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  21600002
         MEND                                                           21675002
         SPACE 2                                                        21750002
*  BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO  * 21825002
         SPACE 2                                                        21900002
         MACRO                                                          21975002
         BIN   &LOGITEM,&SKIP$OR                                        22050002
.*                                 &LOGITEM - NAME OF ITEM IN LOG       22125002
.*                                      RECORD DSECT                    22200002
.*                                 &SKIP$OR - NBR OF SPACES TO SKIP ON  22275002
.*                                 MULTIPLE PRINT OR NBR OF SPACES      22350002
.*                                      TO BACK UP FROM COLUMN FOR      22425002
.*                                      START OF PRINTING. THE LETTER   22500002
.*                                      B PRECEEDS THE NUMBER (B5) IF   22575002
.*                                      THE LATTER IS DESIRED. OMISSION 22650002
.*                                      OF THIS OPERAND FORCES OPTION 2 22725002
.*                                      WITH BACKUP SPACING EQUAL TO    22800002
.*                                 THE NUMBER OF BITS IN THE ITEM       22875002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      22950002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     23025002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       23100002
         GBLC &ITEM(1000)                                               23175002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 23250002
         GBLC  &DSECT                                                   23325002
         LCLB  &B                                                       23400002
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   23475002
         LCLA  &TEMP,&T                                                 23550002
         LCLC  &S                                                       23625002
.LOOP    ANOP                                                           23700002
&NDX     SETA  &NDX+1                                                   23775002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      23850002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  23925002
         MNOTE *,'YOU BLEW IT'                                          24000002
         ROUTINE DUM,SKIPPER                                            24075002
         MEXIT                                                          24150002
.FOUND   ANOP                                                           24225002
&ISHIFT  SETA  &SHIFT(&NDX)                                             24300002
&IBITS   SETA  &BITS(&NDX)                                              24375002
&T       SETA  &IBITS-1                                                 24450002
&B       SETB  0                                                        24525002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                24600002
&K       SETA  K'&SKIP$OR                                               24675002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 24750002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   24825002
&T       SETA  &S                                                       24900002
.BACKUP  ANOP                                                           24975002
&NRENTS  SETA  &NRENTS+1                                                25050002
&TEMP    SETA  &ISHIFT                                                  25125002
A&SYSNDX DC    AL.12(&LOGITEM-&DSECT),XL.4'&TEMP'                       25200002
         AIF (&IBITS EQ 1 AND &B EQ 0).OUT                              25275002
         ORG   A&SYSNDX                                                 25350002
&B       SETB  1                                                        25425002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'C'                           25500002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             25575002
.OUT     ANOP                                                           25650002
         MEND                                                           25725002
         EJECT                                                          25800002
*  HEX MACRO     HEX MACRO     HEX MACRO    HEXN MACRO     HEX MACRO  * 25875002
         SPACE 2                                                        25950002
         MACRO                                                          26025002
         HEX   &LOGITEM,&SKIP$OR,&BYTES                                 26100002
.*                            THIS MACRO FACILITATES GENERATION OF THE  26175002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    26250002
.*                                 CONVERSIONS.                         26325002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE        26400002
.*                                 CONVERTED                            26475002
.*                            &SKIP$OR - NUMBER OF SPACES TO SKIP ON    26550002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   26625002
.*                                 BACK UP FROM COLUMN FOR START OF     26700002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  26775002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  26850002
.*                                 DESIRED. OMISSION OF THIS OPERAND    26925002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  27000002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  27075002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 27150002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    27225002
.*                                 IMPLICITLY B).                       27300002
.*                            &BYTES - NUMBER OF TOTAL INPUT BYTES TO   27375002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     27450002
.*                                 WITH AN L,R, OR B TO STIPULATE       27525002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     27600002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     27675002
.*                                 RESPECTIVELY. OMISSION OF THIS       27750002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  27825002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 27900002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 27975002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   28050002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     28125002
.*                                 SUBJECT LINE(S).                     28200002
         GBLC &ITEM(1000),&DSECT                                        28275002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 28350002
         LCLB  &B                                                       28425002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP                  28500002
         LCLC  &S,&LETTER                                               28575002
.LOOP    ANOP                                                           28650002
&NDX     SETA  &NDX+1                                                   28725002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      28800002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  28875002
         MNOTE *,'LOG ITEM NOT DEFINED'                                 28950002
         MEXIT                                                          29025002
.FOUND   ANOP                                                           29100002
&ISHIFT  SETA  &SHIFT(&NDX)                                             29175002
&IBITS   SETA  &BITS(&NDX)                                              29250002
&CODE    SETA  1                                                        29325002
&K       SETA  K'&BYTES                                                 29400002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            29475002
         MNOTE *,'BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL'   29550002
         MEXIT                                                          29625002
.OK      AIF   ('&BYTES' EQ '').USEDEFN                                 29700002
&LETTER  SETC  '&BYTES'(&K,1)                                           29775002
&S       SETC  '&BYTES'(1,&K-1)                                         29850002
&BYTESP  SETA  &S                                                       29925002
         AIF   ('&LETTER' EQ 'B').BOTH                                  30000002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).OK2                       30075002
.ERR     MNOTE *,'DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY'            30150002
         MEXIT                                                          30225002
.USEDEFN ANOP                                                           30300002
&BYTESP  SETA  &IBITS/8                                                 30375002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       30450002
&CODE    SETA  3                                                        30525002
&T       SETA  &BYTESP*2-1                                              30600002
&S       SETC  '&T'                                                     30675002
.OK2     AIF   (&ISHIFT EQ 0).L                                         30750002
&CODE    SETA  2                                                        30825002
.L       ANOP                                                           30900002
&B       SETB  1                                                        30975002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                31050002
&K       SETA  K'&SKIP$OR                                               31125002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 31200002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   31275002
.BACKUP  ANOP                                                           31350002
&NRENTS  SETA  &NRENTS+1                                                31425002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'A'                           31500002
         DC    BL.1'&B',FL.7'&S',FL.4'&BYTESP',FL.4'&CODE'              31575002
.OUT     ANOP                                                           31650002
         MEND                                                           31725002
         MACRO                                                          31800002
         SPECIAL  &ROUTINE,&PARAM,&SPACE=                               31875002
.*                            THIS MACRO GENERATES A SPECIAL ROUTINE    31950002
.*                                 ENTRY TO BE PROCESSED BY THE SUM. M. 32025002
.*                            &ROUTINE - SYMBOL ON SPECIAL ROUTINE EWT. 32100002
.*                            &PARAM - AN 8 BIT BINARY REPRESENTATION   32175002
.*                                 TO OCCUPY THE 'MASK' FIELD BUT TO BE 32250002
.*                                 INTERPRETED AS AN ARGUMENT OF THE    32325002
.*                                 SPECIAL ROUTINE.                     32400002
.*                            &SPACE - THE NUMBER OF 2BYTE COUNTERS TO  32475002
.*                                 ALLOCATE FOR REQUIRED PROCESSING.    32550002
         GBLC  &CSECT                                                   32625002
         GBLA  &COUNTR                                                  32700002
         LCLA  &ADD                                                     32775002
         DC    AL1(128)                                                 32850002
         DC    BL.8'&PARAM'                                             32925002
         DC    AL2(&ROUTINE-&CSECT)                                     33000002
         DC    AL2(&COUNTR)                                             33075002
&ADD     SETA  1                                                        33150002
         AIF   ('&SPACE' EQ '').NORM                                    33225002
&ADD     SETA  &SPACE                                                   33300002
.NORM    ANOP                                                           33375002
&COUNTR  SETA  &COUNTR+&ADD                                             33450002
         MEND                                                           33525002
         MACRO                                                          33600002
         SUM   &LOGITEM,&MASK                                           33675002
.*                            THIS MACRO GENERATES A NORMAL EDIT ENTRY  33750002
.*                                 FOR PROCESSING BY THE SUMMARY MODULE 33825002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE SUMMED 33900002
.*                            &MASK - BYTE MASK FOR BITS TO BE TESTED.  33975002
.*                                 THIS OPERAND SHOULD BE OMITTED FOR   34050002
.*                                 SINGLE BIT ITEMS IN WHICH CASE THE   34125002
.*                                 MASK WILL BE SET ACCORDING TO THE    34200002
.*                                 OFF BYTE BIT DISPLACEMENT OF THE     34275002
.*                                ITEM AS DEFINED BY THE MACRO 'DSGEN'  34350002
         GBLA  &COUNTR,&ITEMNBR,&BITS(1000),&SHIFT(1000)                34425002
         GBLC  &ITEM(1000),&DSECT                                       34500002
         LCLA  &IBITS,&NDX,&ISHIFT,&M,&BITNBR                           34575002
.LOOP    ANOP                                                           34650002
&NDX     SETA  &NDX+1                                                   34725002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      34800002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  34875002
         MNOTE *,'LOGITEM NOT FOUND'                                    34950002
         MEXIT                                                          35025002
.FOUND   ANOP                                                           35100002
         DC    AL1(0)                                                   35175002
&ISHIFT  SETA  &SHIFT(&NDX)                                             35250002
&IBITS   SETA  &BITS(&NDX)                                              35325002
         AIF   ('&MASK' EQ '').FORM                                     35400002
         DC    B'&MASK'                                                 35475002
         AGO   .ITEM                                                    35550002
.FORM    ANOP                                                           35625002
&BITNBR  SETA  &ISHIFT-7                                                35700002
&BITNBR  SETA  0-&BITNBR                                                35775002
&M       SETA  1                                                        35850002
.LOOP2   ANOP                                                           35925002
         AIF   (&BITNBR EQ 0).GOTIT                                     36000002
&M       SETA  &M*2                                                     36075002
&BITNBR  SETA  &BITNBR-1                                                36150002
         AGO   .LOOP2                                                   36225002
.GOTIT   ANOP                                                           36300002
         DC    AL1(&M)                                                  36375002
.ITEM    DC    AL2(&LOGITEM-&DSECT)                                     36450002
         DC    AL2(&COUNTR)                                             36525002
&COUNTR  SETA  &COUNTR+1                                                36600002
         MEND                                                           36675002
         GBLC  &DSECT,&CSECT                                            36750002
IFCEXXXA CSECT                                                          36825002
*                                                                       36900002
&CSECT   SETC  'IFCEXXXA'                                               36975002
&DSECT   SETC  'XXXA'                                                   37050002
*                                                                       37125002
*                OBR EDOT TABLE 2400                                    37200002
*                                                                       37275002
XXXA     DSECT                                                          37350002
*                                                                       37425002
         DSGEN (XDUM1,8),(XRELN,8),(XDUM2,8),                    S21021X37500002
               (SW2B0,1),(SW2B1,1),(SW2B2,1),(SW2B3,1),          S21021X37575002
               (SW2B4,1),(SW2B5,1),(SW2B6,1),(SW2B7,1)           S21021 37650002
         DSGEN (XDUM2A,32)              SPARES                   S21021 37725002
         DSGEN (XDATE,32)                    DATE                       37800002
         DSGEN (XTIME,32)                    TIME                       37875002
         DSGEN (XDUM3,8),(XSER,24)           SPARE AND SERIAL NO        37950002
         DSGEN (XMODEL,16),(XMCEL,16)        MODEL #  AND MCEL          38025002
         DSGEN (XPGN1,32)                    PROGRAM                    38100002
         DSGEN (XPGN2,32)                           NAME                38175002
         DSGEN (XFCCWCC,8),(XFCCWDA,24)      FAILING   COMM & ADDR      38250002
         DSGEN (XFCCWFL,8),(XZERO,8),(XFCCWCT,16)  CCW  CHAIN & COUNT   38325002
         DSGEN (XCSWK,8),(XCSWCA,24)               CSW  COMM & ADDR     38400002
*                                                                       38475002
         DSGEN (XCSWATTN,1),(XCSWSM,1),(XCSWCUE,1),(XCSWBSY,1),        C38550002
               (XCSWCE,1),(XCSWDE,1),(XCSWUC,1),(XCSWUE,1),            C38625002
               (XCSWPCI,1),(XCSWSILI,1),(XCSWPC,1),(XCSWPCHK,1),       C38700002
               (XCSWCDC,1),(XCSWCCC,1),(XCSWICC,1),(XCSWCH,1),         C38775002
               (XCSWCT,16)                                              38850002
         DSGEN (XDUMA,8),(XCUA2,24)                              S21021 38925002
         DSGEN (XDEVT1,16),(XDEVT2,16)       DEVICE TYPE                39000002
         DSGEN (XDUM4,8),(XCUA,24)           SPARE & CUA                39075002
         DSGEN (XDUM5,32)                    SPARES                     39150002
         DSGEN (XVOL1,32)                    VOLUME                     39225002
         DSGEN (XVOL2,16),(XDUM6,8),(XCORR,8)                    S20202 39300002
         DSGEN (XM,8),(XB1,8),(XB2,8),(XC1,8)                           39375002
         DSGEN (XC2,8),(XH1,8),(XH2,8),(XR,8)      SEEK                 39450002
         DSGEN (XDUM7,32)                         HOME                  39525002
         DSGEN (XDUM8,32)                         ADDR                  39600002
         DSGEN (SDR1,8),(SDR2,8),(SDR3,8),(SDR4,8),(SDR5,8),     S21021X39675002
               (SDR6,8),(SDR7,8),(SDR8,8)                        S21021 39750002
         DSGEN (SDR9,8),(SDRA,8),                                S21021X39825002
               (XB0CMDR,1),(XB0INTRQ,1),(XB0BUSC,1),(XB0ECHK,1),       C39900002
               (XB0DCHK,1),(XB0OVRN,1),(XB0WRD,1),(XB0DTC,1),          C39975002
               (XB1NOISE,1),(XB1STATA,1),(XB1STATB,1),(XB17TRK,1),     C40050002
               (XB1LOADP,1),(XB1WTSTA,1),(XB1FLPRT,1),(XB1NCOMP,1)      40125002
         DSGEN (XB2TE0,1),(XB2TE1,1),(XB2TE2,1),(XB2TE3,1),            C40200002
               (XB2TE4,1),(XB2TE5,1),(XB2TE6,1),(XB2TE7,1),            C40275002
               (XB3RWN,1),(XB3LRC,1),(XB3SKW,1),(XB3CRC,1),            C40350002
               (XB3SKV,1),(XB3PED,1),(XB3BKW,1),(XB3CCM,1),            C40425002
               (XB4ECH,1),(XB4REJ,1),(XB4RDC,1),(XB4WRC,1),            C40500002
               (XB4DLY,1),(XB4CSQ,1),(XB4BSQ,1),(XB4ASQ,1),            C40575002
               (XB5BIT0,1),(XB5BIT1,1),(XB5BIT2,1),(XB5BIT3,1),        C40650002
               (XB5BIT4,1),(XB5BIT5,1),(XB5BIT6,1),(XB5BIT7,1) @X60CAFR 40725002
         DSGEN (XB6BIT0,1),(XB6BIT1,1),(XB6BIT2,1),(XB6BIT3,1),        X40726002
               (XB6BIT4,1),(XB6BIT5,1),(XB6BIT6,1),(XB6BIT7,1),        X40727002
               (XB7BIT0,1),(XB7BIT1,1),(XB7BIT2,1),(XB7BIT3,1),        X40728002
               (XB7BIT4,1),(XB7BIT5,1),(XB7BIT6,1),(XB7BIT7,1),        X40729002
               (XB8BIT0,1),(XB8BIT1,1),(XB8BIT2,1),(XB8BIT3,1),        X40730002
               (XB8BIT4,1),(XB8BIT5,1),(XB8BIT6,1),(XB8BIT7,1),        X40731002
               (XB9BIT0,1),(XB9BIT1,1),(XB9BIT2,1),(XB9BIT3,1),        X40732002
               (XB9BIT4,1),(XB9BIT5,1),(XB9BIT6,1),(XB9BIT7,1) @X60CAFR 40733002
         DSGEN (XB10BIT0,1),(XB10BIT1,1),(XB10BIT2,1),(XB10BIT3,1),    X40734002
               (XB10BIT4,1),(XB10BIT5,1),(XB10BIT6,1),(XB10BIT7,1),    X40735002
               (XB11BIT0,1),(XB11BIT1,1),(XB11BIT2,1),(XB11BIT3,1),    X40736002
               (XB11BIT4,1),(XB11BIT5,1),(XB11BIT6,1),(XB11BIT7,1),    X40737002
               (XB12BIT0,1),(XB12BIT1,1),(XB12BIT2,1),(XB12BIT3,1),    X40738002
               (XB12BIT4,1),(XB12BIT5,1),(XB12BIT6,1),(XB12BIT7,1),    X40739002
               (XB13BIT0,1),(XB13BIT1,1),(XB13BIT2,1),(XB13BIT3,1),    X40740002
               (XB13BIT4,1),(XB13BIT5,1),(XB13BIT6,1),(XB13BIT7,1)      40741002
         DSGEN (XB14BIT0,1),(XB14BIT1,1),(XB14BIT2,1),(XB14BIT3,1),    X40742002
               (XB14BIT4,1),(XB14BIT5,1),(XB14BIT6,1),(XB14BIT7,1),    X40743002
               (XB15BIT0,1),(XB15BIT1,1),(XB15BIT2,1),(XB15BIT3,1),    X40744002
               (XB15BIT4,1),(XB15BIT5,1),(XB15BIT6,1),(XB15BIT7,1),    X40745002
               (XB16BIT0,1),(XB16BIT1,1),(XB16BIT2,1),(XB16BIT3,1),    X40746002
               (XB16BIT4,1),(XB16BIT5,1),(XB16BIT6,1),(XB16BIT7,1),    X40747002
               (XB17BIT0,1),(XB17BIT1,1),(XB17BIT2,1),(XB17BIT3,1),    X40748002
               (XB17BIT4,1),(XB17BIT5,1),(XB17BIT6,1),(XB17BIT7,1)      40749002
         DSGEN (XB18BIT0,1),(XB18BIT1,1),(XB18BIT2,1),(XB18BIT3,1),    X40750002
               (XB18BIT4,1),(XB18BIT5,1),(XB18BIT6,1),(XB18BIT7,1),    X40751002
               (XB19BIT0,1),(XB19BIT1,1),(XB19BIT2,1),(XB19BIT3,1),    X40752002
               (XB19BIT4,1),(XB19BIT5,1),(XB19BIT6,1),(XB19BIT7,1),    X40753002
               (XB20BIT0,1),(XB20BIT1,1),(XB20BIT2,1),(XB20BIT3,1),    X40754002
               (XB20BIT4,1),(XB20BIT5,1),(XB20BIT6,1),(XB20BIT7,1),    X40755002
               (XB21BIT0,1),(XB21BIT1,1),(XB21BIT2,1),(XB21BIT3,1),    X40756002
               (XB21BIT4,1),(XB21BIT5,1),(XB21BIT6,1),(XB21BIT7,1)      40757002
         DSGEN (XB22BIT0,1),(XB22BIT1,1),(XB22BIT2,1),(XB22BIT3,1),    X40758002
               (XB22BIT4,1),(XB22BIT5,1),(XB22BIT6,1),(XB22BIT7,1),    X40759002
               (XB23BIT0,1),(XB23BIT1,1),(XB23BIT2,1),(XB23BIT3,1),    X40760002
               (XB23BIT4,1),(XB23BIT5,1),(XB23BIT6,1),(XB23BIT7,1),    X40761002
               (XDUM9,16)                                      @X60CAFR 40762002
EXPNOBR  DSECT                                                   S21021 40800002
EXPNHDRA DS CL52                                                 S21021 40875002
EXPNDEVA DS CL36                                                 S21021 40950002
EXPVOL1  EQU   EXPNOBR+64                                               40951002
EXPCORR1 EQU   EXPVOL1+7                                                40952002
EXPNSDRA DS CL10                                                 S21021 41025002
EXPNSNSA DS    CL24                                            @X60CAFR 41100002
*                                                                S21021 41175002
NORMOBR DSECT                                                    S21021 41250002
NORMHDRA DS    CL72                                             SA53523 41325002
N203SDRA EQU   NORMOBR+64                                               41345002
N203SNSA EQU   NORMOBR+74                                               41365002
NORMSDRA DS CL10                                                 S21021 41400002
NORMSNSA DS    CL24                                            @X60CAFR 41475002
*                                                                S21021 41550002
SHRTOBR DSECT                                                    S21021 41625002
SHRTHDRA DS CL24                                                 S21021 41700002
SHRTDEVA DS CL8                                                  S21021 41775002
SHRTSDRA DS CL10                                                 S21021 41850002
*                                                                       42375002
*                                                                       42450002
IFCEXXXA CSECT                                                          42525002
         USING *,R9                                                     42600002
         USING XXXA,R2                                           S20202 42675002
R0       EQU   0                                                        42750002
R1       EQU   1                                                        42825002
R2       EQU   2                                                        42900002
R3       EQU   3                                                        42975002
R4       EQU   4                                                        43050002
R5       EQU   5                                                        43125002
R6       EQU   6                                                        43200002
R7       EQU   7                                                        43275002
R8       EQU   8                                                        43350002
R9       EQU   9                                                        43425002
R10      EQU   10                                                       43500002
R11      EQU   11                                                       43575002
R12      EQU   12                                                       43650002
R13      EQU   13                                                       43725002
R14      EQU   14                                                       43800002
R15      EQU   15                                                       43875002
L0       EQU   0                                                        43950002
L1       EQU   1                                                        44025002
L2       EQU   2                                                        44100002
L3       EQU   3                                                        44175002
L4       EQU   4                                                        44250002
L5       EQU   5                                                        44325002
L6       EQU   6                                                        44400002
L7       EQU   7                                                        44475002
L8       EQU   8                                                        44550002
L9       EQU   9                                                        44625002
L10      EQU   10                                                       44700002
L11      EQU   11                                                       44775002
L12      EQU   12                                                       44850002
L13      EQU   13                                                       44925002
L14      EQU   14                                                       45000002
L15      EQU   15                                                       45075002
L16      EQU   16                                                       45150002
L17      EQU   17                                                       45225002
L18      EQU   18                                                       45300002
L19      EQU   19                                                       45375002
L20      EQU   20                                                       45450002
L21      EQU   21                                                S21021 45525002
L24      EQU   24                                                       45600002
L26      EQU   26                                                       45675002
L28      EQU   28                                                       45750002
L29      EQU   29                                                S21021 45825002
L30      EQU   30                                                       45900002
L31      EQU   31                                                S21021 45975002
L34      EQU   34                                                S21021 46050002
L36      EQU   36                                                S21021 46125002
L44      EQU   44                                                S21021 46200002
L46      EQU   46                                                S21021 46275002
L50      EQU   50                                                       46350002
L52      EQU   52                                                       46425002
L64      EQU   64                                                S21021 46500002
L72      EQU   72                                                S21021 46575002
L80      EQU   80                                                S21021 46650002
L88      EQU   88                                                S21021 46725002
L104     EQU   104                                               S21021 46800002
L120     EQU   120                                               S21021 46875002
HEX01    EQU   X'01'                                             S21021 46950002
HEX04    EQU   X'04'                                             S21021 47025002
HEX08    EQU   X'08'                                             S21021 47100002
HEX10    EQU   X'10'                                             S21021 47175002
HEX20    EQU   X'20'                                             S21021 47250002
A        EQU   C'A'                                              S21021 47325002
B        EQU   C'B'                                              S21021 47400002
XFF      EQU   X'FF'                                             S21021 47475002
         USING XXXA,R2                                           S21021 47550002
*                                                                       47625002
         DC    A(ENTRIES)               PTR TO EDIT ENTRIES             47700002
         DC    CL8'IFCEXXXA'                                            47775002
XR9PTR   DC    F'0'                     PTR TO NXT EDIT-4        S21021 47850002
XLABELP  DC    F'0'                     LABEL PTR SAVE                  47925002
*                                                                       48000002
*              SPECIAL  ROUTINE SECTION                                 48075002
*                                                                       48150002
*                                                                       48300002
*                                                                       48375002
SPACER1  LA    R3,L1(R3)                SPACE ONE BLANK          S21021 48450002
SKIPPER  BR    R14                 RETURN                      @X60CAFR 48525002
*                                                                       48600002
*                   HEX (SAME AS BIN BUT PRINTS 4 BITS)                 49725002
SETHEX   STM   R5,R8,XSAVE              SAVE REGS                       49800002
         LA    R8,CHARS                 PTR TO CHARS                    49875002
         IC    R7,L0(R4)                PICK UP CHAR                    49950002
         SLL   R7,L24                   MOVE IT TO HI OF R7             50025002
         SR    R6,R6                    CLEAR REG                       50100002
         SLDL  R6,L4                    MOVE 4 BITS TO R6               50175002
         AR    R6,R8                    COMPUTE OFFSET                  50250002
         MVC   L0(L1,R3),L0(R6)         MOVE CHAR TO LINE               50325002
         SR    R6,R6                    CLEAR                           50400002
         SLDL  R6,L4                    MOVE LAST 4 BITS TO R6          50475002
         AR    R6,R8                    COMPUTE OFFSET                  50550002
         MVC   L1(L1,R3),L0(R6)         MOVE CHAR TO LINE + 1           50625002
         B     RETURN                                                   50700002
*                                                                       50775002
*        SET PROGRAM NAME                                               50850002
*                                                                       50925002
SETPGMN  DS    0H                                                S21021 51000002
         TM    SW2B0,HEX20              SHORT RECORD             S21021 51075002
         BCR   1,R14                    YES, NO JOB ID           S21021 51150002
         MVC   0(L12,R3),JOBID          MOVE IN LABEL            S21021 51225002
         MVC   L13(L8,R3),XPGN1         MOVE IN NAME             S21021 51300002
         BR    R14                                               S21021 51375002
NONAME   TM    L0(R4),HEX20             SHORT RECORD?            S21021 51450002
         BCR   14,R14                   NO, LET HEX JOBNAME PRNT S21021 51525002
         ST    R5,XSAVE                 SAVE REG                 S21021 51600002
         LA    R5,L44                   BACK UP BUFFER PNTR      S21021 51675002
         SR    R3,R5                                             S21021 51750002
         MVC   0(L17,R3),BLANKS         CLEAR OUT HEX JOBNAME    S21021 51825002
         L     R5,XSAVE                 RESTORE REG              S21021 51900002
         BR    R14                                               S21021 51975002
*                                                                       52050002
*                                                                       52125002
*                 SET VOLUME LABEL  6 CHARS                             52200002
*                                                                       52275002
SETVOL   CLC   XDEVT2(L2),DEVTABLE      TEST FOR DEVICE TYPE   @Y30OPDP 52350002
         BE    NOVOL               IF A 3211 NO VOLUME PRINTED @X60CAFR 52420002
         CLC   XDEVT2(L2),H3203    IS IT A 3203                @X60CAFR 52440002
         BNE   VOL1                NO,PRINT VOL DATA           @X60CAFR 52460002
NOVOL    EQU   *                   SKIP THIS LABEL             @X60CAFR 52480002
         SR    R15,R15                                           S20202 52500002
         BR    R14                                               S20202 52575002
VOL1     MVC   L0(L6,R3),L0(R4)                                  S20202 52650002
         BR    R14                                               S20202 52725002
*                                                                       52800002
*                 SET CORRELATION NOMBER                         S20202 52875002
*                                                                S20202 52950002
SETCORR  CLC   L0(L2,R4),H3211          TEST FOR 3211            S20202 53025002
         BE    SETCORRD                 YES RETURN               S20202 53100002
         CLC   L0(L2,R4),H3203     TEST FOR A 3203 @X60CAFR             53120001
         BE    SETCORRD            YES,PRINT LINE   @X60CAFR            53140001
         SR    R15,R15                                           S20202 53175002
SETCORRD BR    R14                      RETURN                   S20202 53250002
SETST1   STM   R5,R8,XSAVE              SAVE                     S20202 53325002
         CLC   L0(L2,R4),H3211          TEST FOR 3211            S20202 53400002
         BNE   IS3540                                          @Y30OPDP 53475002
         L     R5,SENS3211         POINT TO 3211 LABELS        @X60CAFR 53550002
         ST    R5,XLABELP               BRANCH                   S20202 53625002
         B     RETURN                   BRANCH                   S20202 53700002
IS3540   CLC   L0(L2,R4),H3540                                 @Y30OPDP 53710002
         BNE   IS3203              IS IT A 3203                @X60CAFR 53720002
         L     R5,SENS3540         POINT TO 3540 LABELS        @X60CAFR 53730002
         ST    R5,XLABELP                                      @Y30OPDP 53740002
         B     RETURN                                          @Y30OPDP 53750002
IS3203   DS    0H                  TEST FOR 3203               @X60CAFR 53753002
         CLC   L0(L2,R4),H3203                                 @X60CAFR 53756002
         BNE   RETURN              NOT 3203,RETURN             @X60CAFR 53759002
         L     R5,SENS3203         POINT TO 3203 LABELS        @X60CAFR 53762002
         ST    R5,XLABELP          PUT IN LABEL PTR            @X60CAFR 53765002
         B     RETURN              GO PROCESS                  @X60CAFR 53768002
*        TEST FOR CONVERTED RECORD KEY 32                               53775002
*                                                                       53850002
SETCONV  TM    L0(R4),HEX02             CONVERT SW ON                   53925002
         BCR   ON,R14                   YES RETURN                      54000002
         SR    R15,R15                  ZERO IS TO STOP PRINT           54075002
         BR    R14                                                      54150002
ON       EQU   1                                                        54225002
HEX02    EQU   X'02'                                                    54300002
*                                                                       54375002
*        SET DEV TYPE                                                   54450002
*                                                                       54525002
*                                                                       54600002
*                                                                       54675002
*                                                                       54750002
*        SETCPU NO AND SERIAL NO.                                       54825002
*                                                                       54900002
SETCPUNO STM   R5,R8,XSAVE              SAVE REGS                       54975002
         SR    R5,R5                                                    55050002
         IC    R5,L0(R4)                PICK UP CPU MODEL               55125002
         SLL   R5,L4                    NUMBER IN R5                    55200002
         IC    R5,L1(R4)                                                55275002
         LTR   R5,R5                    TEST FOR ZERO MODEL      S21021 55350002
         LR    R5,R3                    POINT TO DATA FIELD      S21021 55425002
         BNZ   SETSER                   BRANCH IF MODEL NOT 0    S21021 55500002
         LA    R6,L46                   BACK UP TO SAY 'NONE'    S21021 55575002
         SR    R5,R6                    BACKUP BUFFER            S21021 55650002
         MVC   L0(L29,R5),UNIVERS       SAY NONE, MODEL UNIVERSALS21021 55725002
         B     RETURN                                                   55800002
SETSER   LA    R6,L36                   SET UP TO ADD 'SERIAL NO.S21021 55875002
         SR    R5,R6                                             S21021 55950002
         MVC   0(L10,R5),SERNO                                   S21021 56025002
         B     RETURN                                            S21021 56100002
*                                                                       56175002
*                                                                       56250002
*        SET   DATE                                                     56325002
*                                                                       56400002
SETDATE  CLC   L1(L3,R4),ZERO           IS DATE ZERO                    56475002
         BE    SETDTE                   BR-YES                          56550002
         UNPK  XSAVE(L8),L1(L3,R4)      UNPACK DATE                     56625002
         MVC  L5(L2,R3),XSAVE+L3  MOVE YEAR                             56700002
         MVC   L0(L3,R3),XSAVE+L5                                       56775002
         BR    R14                                                      56850002
SETDTE   MVC   L0(L4,R3),NONE           SET DATE TO NONE                56925002
         BR    R14                                                      57000002
ZERO     DC    XL4'00'                                                  57075002
*                                                                       57150002
*                                                                       57225002
SETDEV   STM   R5,R8,XSAVE              SAVE REGS                S20202 57300002
         LA    R6,DEVTABLE                                       S20202 57375002
         LA    R5,L4               4 POSSIBLE DEVS TO LOOK FOR @X60CAFR 57450002
SETDEVT  CLC   L0(L2,R4),L0(R6)                                  S20202 57525002
         BE    SDEVFND                                           S20202 57600002
         LA    R6,L6(R6)                                         S20202 57675002
         BCT   R5,SETDEVT                                        S20202 57750002
         MVC   L0(L4,R3),NONE                                    S20202 57825002
         B     RETURN                                            S20202 57900002
SDEVFND  MVC   L0(L4,R3),L2(R6)                                  S20202 57975002
         B     RETURN                                            S20202 58050002
DEVTABLE DC    X'0809'                                           S20202 58125002
         DC           C'3211'                                    S20202 58200002
         DC    X'8001'                                           S20202 58275002
         DC           C'2400'                                    S20202 58350002
H3540    DC    X'0844'                                         @Y30OPDP 58370002
         DC           C'3540'                                  @Y30OPDP 58390002
H3203    DC    X'080B'                                         @X60CAFR 58400002
         DC    C'3203'                                         @X60CAFR 58410002
H3211    DC    X'0809'                                           S20202 58425002
DEVCODE  DC    X'8001'                                           S21021 58500002
SENS3211 DC    A(SNS3211)                                      @X60CAFR 58575002
SENS3540 DC    A(SNS3540)                                      @X60CAFR 58875002
SENS3203 DC    A(SNS3203)                                      @X60CAFR 59175002
MORE3203 DC    A(MOR3203-L1)                                   @XA22172 59475001
RETURN   LM    R5,R8,XSAVE                                              59925002
         BR    R14                                                      60000002
*                                                                       60075002
*                                                                       60150002
SPACER16 LA    R3,L16(R3)                                        S21021 60225002
         BR    R14                                               S21021 60300002
SDRCONVL STM   R5,R8,XSAVE              SAVE REGS                S21021 60375002
         SR    R6,R6                    CLEAR REG                S21021 60450002
         IC    R6,L0(R4)                PICK UP COUNTER IN QUEST S21021 60525002
         SRL   R6,L4                    DROP OFF 4 LOW BITS      S21021 60600002
         B     SDRCONVT                                          S21021 60675002
SDRCONVR STM   R5,R8,XSAVE              SAVE REGS                S21021 60750002
         IC    R6,L0(R4)                PICK UP CHAR             S21021 60825002
         SLL   R6,L28                                            S21021 60900002
         SRL   R6,L28                   DROP OFF HI ORDER BITS   S21021 60975002
SDRCONVT CVD   R6,WORK                  CONVERT IT               S21021 61050002
         UNPK  L0(L3,R3),WORK+L5(L3)    TO DECIMAL               S21021 61125002
         MVZ   L2(L1,R3),L0(R3)         PUT ON ZONE              S21021 61200002
         B     RETURN                                            S21021 61275002
*                                                                S21021 61350002
RESETR2  L     R2,SAVE2                 PICK UP SAVED REC POINTERS21021 61425002
         BR    R14                                               S21021 61500002
*                                                                S21021 61575002
TESTMP   TM    L0(R4),HEX10             IS IT A MP RECODR        S21021 61650002
         BZ    NOMP                                              S21021 61725002
         MVC   0(L20,R3),MPCPU                                   S21021 61800002
         TM    L0(R4),HEX08             IS IT CPUA / CPUB        S21021 61875002
         BO    MPB                      BR IT IS B               S21021 61950002
         MVI   L21(R3),A                MOVE 'A' TO PRINT LINE   S21021 62025002
NOMP     BR    R14                                               S21021 62100002
MPB      MVI   L21(R3),B                MOVE 'B' TO PRINT LINE   S21021 62175002
         BR    R14                                               S21021 62250002
NOPRT    SR    R15,R15                  STOP PRINTING            S21021 62325002
         BR    R14                                               S21021 62400002
*                                                                S21021 62475002
RECTYPE  STM   R5,R8,XSAVE                                       S21021 62550002
         LR    R5,R3                    SET UP DATA SLOT FOR TYPES21021 62625002
         LA    R6,L31                                            S21021 62700002
         SR     R5,R6                                            S21021 62775002
         TM    0(R4),HEX20              SHORT RECORD?            S21021 62850002
         BO    RECSHORT                                          S21021 62925002
         MVC   0(L10,R5),UNITCK         INSERT DATA 'UNIT CHECK' S21021 63000002
         B     RETURN                                            S21021 63075002
RECSHORT MVC   0(L10,R5),OVFL           DATA = 'OVERFLOW'        S21021 63150002
         B     RETURN                                            S21021 63225002
CONVREL  STM   R5,R8,XSAVE              SAVE WORK REGS                  63300002
         SR    R6,R6                    CLEAR R6                        63375002
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        63450002
         SRDL  R6,L5                    SAVE REL NO IN R7               63525002
        SLL   R6,L2                    MULTIPLY SYS VALUE BY 4          63600002
         L     R8,XLABELP               PICK UP LABEL POINTER           63675002
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     63750002
         MVC   L0(L4,R8),L0(R6)         MOVE SYSTEM NAME INTO LABEL     63825002
         SR    R6,R6                    CLEAR R6                        63900002
         SLDL  R6,L5                    RETREIVE REL NO.                63975002
         LTR   R6,R6                    IS IT ZERO                      64050002
         BZ    NOREL                    BR-YES                          64125002
         CVD   R6,WORK                  CONVERT IT                      64200002
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFF       64275002
         MVZ   L1(L1,R3),L0(R3)         MOVE ON PROPER ZONE             64350002
         B     RETURN                   EXIT                            64425002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL            64500002
         B     RETURN                                                   64575002
*                                                                S21021 64650002
TESTSHRT TM    SW2B0,HEX20              IS IT A SHORT REC        S21021 64725002
         BZ    SKIPPER                  BR-NO                    S21021 64800002
         BCTR  R3,R0                    BACKUP ONE DATA SPACE    S21021 64875002
         MVC   0(L6,R3),BLANKS          CLEAR OUT HEX 2NDARY CUA S21021 64950002
         MVC   XR9PTR(L8),SHRTADCN      POINT TO STAT EDIT SECT  S21021 65025002
         BR    R14                                               S21021 65100002
*                                                                S21021 65175002
EXPNDRTN STM   R5,R8,XSAVE                                       S21021 65250002
         ST    R2,SAVE2                 SAVE R2 FOR LATER        S21021 65325002
         LA    R5,OBRAREA               PICK UP EXPANDED AREA    S21021 65400002
         USING EXPNOBR,R5                                        S21021 65475002
         USING NORMOBR,R4                                        S21021 65550002
         XC    EXPNOBR(L104),EXPNOBR    CLEAR AREA               S21021 65625002
         TM    SW2B0,HEX20              IS IT A SHORT REC        S21021 65700002
         BO    MOVESHRT                 BR-YES                   S21021 65775002
         TM    XDUM1,HEX02              IS IT A CONVERTED REC    S21021 65850002
         BO    MOVEALL                                           S21021 65925002
         MVC   EXPNHDRA(L72),NORMHDRA   EXPND REC TO COMMON SIZE S21021 66150002
         MVC   EXPNSDRA(L10),NORMSDRA                            S21021 66225002
         CLC   XDEVT2(L2),H3203    IS THIS A 3203?                      66300001
         BNE   EXPND1              NO MOVE SHORT SENSE                  66310001
         MVC   EXPNSNSA(L24),NORMSNSA MOVE 24 BYTES OF SENSE            66320001
         MVI   RECSIZE+1,107       LENGTH OF 3203 RECORD @X60CAFR       66330001
         B     EXPND2              @X60CAFR                             66335001
EXPND1   MVC   EXPNSNSA(L6),NORMSNSA MOVE STANDARD SENSE                66340001
         MVI   RECSIZE+1,L88            SHOW 88 BYTE REC FOR DUMPS21021 66375002
EXPND2   MVC   EXPCORR1(L1),EXPVOL1 MOVE CORRELATION NO.       @X60CAFR 66395002
*                                      FOR 3211 IN A NON CONVERTED REC  66415002
EXPNDRET LR    R2,R5                    SWAP POINTERS            S21021 66450002
         B     RETURN                                            S21021 66525002
MOVEALL  MVC   EXPNOBR(L104),NORMOBR    MOVE ENTIRE RECORD       S21021 66600002
         MVI   RECSIZE+1,L104           SET 104 BYTE DUMP        S21021 66675002
         B     EXPNDRET                                          S21021 66750002
         USING SHRTOBR,R4                                        S21021 66825002
MOVESHRT MVC   EXPNHDRA(L24),SHRTHDRA   MOVE HEADER              S21021 66900002
         MVC   EXPNDEVA(L8),SHRTDEVA                             S21021 66975002
         MVC   EXPNSDRA(L10),SHRTSDRA                            S21021 67050002
         B     EXPNDRET                                          S21021 67125002
CHK3203  DS    0H                  IS DEV A 3203               @X60CAFR 67575002
         STM   R5,R8,XSAVE         SAVE REGS                   @X60CAFR 67581002
         CLC   XDEVT2(L2),H3203    CHECK DEV DESC              @X60CAFR 67587002
         BNE   NOT3203             IF ITS A 3203,CONTINUE      @X60CAFR 67593002
         L     R5,MORE3203         PT TO THE REST OF THE SENSE LABS     67599002
         ST    R5,XLABELP          REMAINDER OF 3203 LABELS    @X60CAFR 67605002
         SR    15,15               SKIP THIS LINE/LABEL SET    @XA22172 67608001
         B     RETURN                                          @X60CAFR 67611002
NOT3203  MVC   XR9PTR(L8),TBLADCON  PT TO END OF THIS TABLE    @XA20650 67617001
         L     R2,SAVE2            PICK UP NORM RECORD         @X60CAFR 67623002
         SR    15,15               SKIP THIS LINE/LABEL SET    @X60CAFR 67635002
         B     RETURN              GO BACK                     @X60CAFR 67641002
*                                                                S21021 67650002
SETSTLBL DS    0H                       SET LABELS FOR STAT COUNTS21021 67725002
         STM   R5,R8,XSAVE              SAVE REGS                S21021 67800002
         LA    R6,L2                    SET BCT COUNT            S21021 67875002
         L     R5,XLABELP               GET CURRENT LABEL PNTR   S21021 67950002
         LA    R8,STLBLIST              POINT TO FIRST LABEL ENTRS21021 68025002
STLBCOMP CLC   XDEVT2(L2),0(R8)         IS THIS THE DEVICE TYPE? S21021 68100002
         BE    STLBLTFD                 YES, GO MOVE LABELS      S21021 68175002
         LA    R8,L18(R8)                                      @Y30OPDP 68250002
         B     STLBCOMP                                        @Y30OPDP 68280002
STLBLTFD DS    0H                  LABELS FOUND                  S21021 68325002
         LA    R8,L2(R8)                USE LABELS               S21021 68400002
         LA    R7,L16(R8)               DETERMINE END POINT      S21021 68475002
         ST    R7,STLBLEND              SAVE FOR COMPARE         S21021 68550002
STLABLP  DS    0H                                                S21021 68625002
         LA    R6,L2                    RESET BCT                S21021 68700002
         TM    SW2B0,HEX20              IS THIS A SHORT RECORD   S21021 68775002
         BO    STLBSHRT                 YES, NO UNIT STATUS      S21021 68850002
         LA    R5,L34(R5)               BUMP PAST UNIT STATUS LABS21021 68925002
STLBSHRT DS    0H                                                S21021 69000002
         CLI   0(R8),XFF                IS THIS 'NOT USED'       S21021 69075002
         BE    STLBLNUS                 YES, LABEL = 'NOT USED'  S21021 69150002
         SR    R7,R7                    CLEAR R7                 S21021 69225002
         IC    R7,0(R8)                 GET INDEX TO LABEL       S21021 69300002
         MH    R7,HW13                  MULTIPLY TO GET LABEL    S21021 69375002
         A     R7,SLTABAD               POINT TO LABEL IN TABLE  S21021 69450002
         MVC   L0(L13,R5),L0(R7)        MOVE IN LABEL            S21021 69525002
         B     STLBL001                                          S21021 69600002
STLBLNUS DS    0H                                                S21021 69675002
         MVC   L0(L13,R5),STLBNTUS      'NOT USED' LABEL         S21021 69750002
STLBL001 DS    0H                                                S21021 69825002
         LA    R5,L14(R5)               BUMP R5                  S21021 69900002
         LA    R8,L1(R8)                POINT TO NEXT INDEX      S21021 69975002
         BCT   R6,STLBSHRT              DO AGAIN                 S21021 70050002
         C     R8,STLBLEND              AT END OF LIST?          S21021 70125002
         BNE   STLABLP                  NO, CONTINUE             S21021 70200002
         B     RETURN                                            S21021 70275002
         DROP  R4,R5                                             S21021 70350002
*                                                                S21021 70425002
WORK     DS    D                                                 S21021 70500002
SAVE2    DS    F                                                 S21021 70575002
SHRTADCN DC    A(SHRTOBRS-L4)                                    S21021 70650002
         DC    A(SHRTOBRL)                                       S21021 70725002
TBLADCON DC    A(ENDTBLS-L4)       PT TO ENDTBL LINE           @XA20650 70745001
         DC    A(ENDTBLL-L1)       PT TO ENDTBL LABEL          @XA22172 70765001
OBRAREA  DS    CL122                                                    70800002
JOBID    DC    C'JOB IDENTITY'                                   S21021 70875002
MPCPU    DC    C'MULTIPROCESSOR - CPU'                           S21021 70950002
SERNO    DC    C'SERIAL NO.'                                     S21021 71025002
UNITCK   DC    C'UNIT CHECK'            RECORD TYPE              S21021 71100002
OVFL     DC    C'OVERFLOW  '            RECORD TYPE              S21021 71175002
STLBNTUS DC    C'NOT USED     '         STAT LABEL               S21021 71250002
UNIVERS  DC    C'UNIVERSAL   SERIAL NO. NONE  '                  S21021 71325002
SLTABAD  DC    A(SLTABL)                                         S21021 71400002
SLTABL   DS    0C                                                S21021 71475002
         DC    C'TEMPY READS  '         00                       S21021 71550002
         DC    C'TEMPY WRITES '         01                       S21021 71625002
         DC    C'INTRVN REQD  '         02                       S21021 71700002
         DC    C'BUS OUT CHK  '         03                       S21021 71775002
         DC    C'EQUIP CHK    '         04                       S21021 71850002
         DC    C'OVERRUN      '         05                       S21021 71925002
         DC    C'WD CT 0      '         06                       S21021 72000002
         DC    C'DATA CONV CHK'         07                       S21021 72075002
         DC    C'R/W VRC      '         08                       S21021 72150002
         DC    C'LRCR         '         09                       S21021 72225002
         DC    C'SKEW         '         0A                       S21021 72300002
         DC    C'CRC          '         0B                       S21021 72375002
         DC    C'SKEW REG VRC '         0C                       S21021 72450002
         DC    C'NOISE        '         0D                       S21021 72525002
         DC    C'RD OPP RECVY '         0E                       S21021 72600002
         DC    C'CHAN DATA CHK'         0F                       S21021 72675002
         DC    C'BUFF PTY CHK '         10                       S21021 72750002
         DC    C'LOAD CHECK   '         11                       S21021 72825002
         DC    C'CMND RETRY   '         12                       S21021 72900002
         DC    C'PRINT CHECK  '         13                       S21021 72975002
         DC    C'PRNT QUALITY '         14                       S21021 73050002
         DC    C'LINE POS     '         15                       S21021 73125002
         DC    C'CMND SUPPRESS'         16                       S21021 73200002
         DC    C'NRF CRC ERR  '               17               @Y30OPDP 73208002
         DC    C'NRF NO CRC ER'               18               @Y30OPDP 73216002
         DC    C'FAST/SLO INDX'               19               @Y30OPDP 73224002
         DC    C'ADR MARK FAIL'               1A               @Y30OPDP 73232002
         DC    C'DATA AM INCOR'               1B               @Y30OPDP 73240002
         DC    C'DATA CRC ERR '               1C               @Y30OPDP 73248002
         DC    C'CTRL U OVRRUN'               1D               @Y30OPDP 73256002
         DC    C'BUS OUT CHECK'               1E               @Y30OPDP 73264002
STLBLIST DS    0C                                                S21021 73275002
         DC    X'0809'                                           S21021 73350002
         DC    X'0001FF03041011FF12131415FF16FF0F' 3211 STAT LABES21021 73425002
         DC    X'0844'                                         @Y30OPDP 73500002
         DC    X'FFFFFF1EFF1718191A1B1C1DFFFFFF0F' 3540 STAT LABE       73520002
         DC    X'8001'                                         @Y30OPDP 73540002
         DC    X'000102030405060708090A0B0C0D0E0F' 2400 STAT LABES21021 73575002
         DC    X'080B'                                         @X60CAFR 73595002
         DC    X'0001FF03041011FF1213FF15FF16FF0F' 3203 STAT LABS       73615002
*                                                                S21021 73650002
HW13     DC    H'13'                                             S21021 73725002
STLBLEND DC    F'0'                                              S21021 73800002
HW21     DC    H'21'                                             S21021 73875002
BLANKS   DC    CL17' '                  USED TO CLEAR DATA FIELDSS21021 73950002
*                                                                       74025002
*                                                                       74100002
*                                                                       74175002
         DS    0F                                                       74250002
XSAVE    DS    4F                                                       74325002
NONE     DC    C'NONE  '                                                74400002
CHARS    DC    C'0123456789ABCDEF'                                      74475002
RELTAB   DS    0C                                                       74550002
         DC    C'OS  '                                                  74600002
         DC    C'DOS '                                                  74650002
         DC    C'VS 1'                                                  74700002
         DC    C'V370'                                                  74750002
         DC    C'VS 2'                                                  74800002
         DC    C'    '                                                  74850002
         DC    C'    '                                                  74900002
         DC    C'    '                                                  74950002
CHAR0    DC    C'0'                                                     75000002
*                                                                       75075002
*                                                                       75150002
ENTRIES  DS    0F                                                       75225002
         DC    XL4'00'        FORMAT 1                                  75300002
         DC    XL4'00'             FORMAT 2                             75375002
         DC    A(LABELS)           LABEL PTR                            75450002
         DC    H'0'                DISP                                 75525002
*                                                                       75600002
*                                                                       75675002
*        SKIP TO CHANNEL 1                                              75750002
*                                                                       75825002
         DC    X'02'                                             S21021 75900002
         DC         X'000B8B00'                                         75975002
         DC    AL.12(XDUM1-XXXA),XL.4'D'  = ROUTINE XDUM1,       S21021 76050002
         DC    AL.4(0),AL.12(EXPNDRTN-IFCEXXXA)   EXPNDRTN       S21021 76125002
*                                                                       76200002
*                                                                       76275002
*                                                                       76350002
         LINE  (55,23),(1,35),SKIP=1                             S21021 76425002
         ROUTINE  SW2B0,RECTYPE                                  S21021 76500002
         HEX   XMODEL,0,2B                                       S21021 76575002
         HEX   XSER,0,3B                                         S21021 76650002
         ROUTINE XMODEL,SETCPUNO                                 S21021 76725002
         LABEL '---RECORD ENTRY TYPE -','   SOURCE - OUTBOARD',  S21021X76800002
               'MODEL-'                                          S21021 76875002
         LINE  (16,1),(4,1)                                      S21021 76950002
         ROUTINE    XRELN,CONVREL                                       77025002
         LABEL      'XXXX REL.'                                         77100002
         LINE  (69,1),(31,19)                                    S21021 77175002
         ROUTINE XPGN1,SETPGMN                                   S21021 77250002
         LABEL 'DAY YEAR','HH MM SS.TH'                          S21021 77325002
         LINE  (31,19),(25,19)                                   S21021 77400002
         ROUTINE XDATE,SETDATE                                   S21021 77475002
         HEX   XTIME,1,4B                                        S21021 77550002
         ROUTINE  XDUM1,SKIPPER                                  S21021 77625002
         HEX   XPGN1,B6,4B                                       S21021 77700002
         HEX   XPGN2,B16,4B                                      S21021 77775002
         ROUTINE  SW2B0,NONAME                                   S21021 77850002
         LABEL 'DATE-','TIME-'                                   S21021 77925002
         LINE  (1,1),(1,1)                                       S21021 78000002
         ROUTINE SW2B0,TESTMP                                    S21021 78075002
         LABEL ''                                                S21021 78150002
         LINE  ,(1,1),SKIP=2                                     S21021 78225002
         ROUTINE XDUM1,SETCONV                                   S21021 78300002
         LABEL 'OBR RECORD CONVERTED TO THE STANDARD FORMAT'     S21021 78375002
         LINE  (61,1),(45,1),SKIP=1                              PT1403 78385002
         HEX   XCORR                                             PT1403 78395002
         ROUTINE   XDEVT2,SETCORR                                PT1403 78405002
         LABEL 'CORRELATION NO'                                  PT1403 78415002
         LINE  (34,1),(2,32),SKIP=1                              S21021 78450002
         ROUTINE  XDEVT2,SETDEV                                  S21021 78525002
         LABEL 'DEVICE TYPE'                                     S21021 78600002
         LINE                                                    S21021 78675002
         HEX   XCUA,B0,3B                                        S21021 78750002
         LABEL 'PRIMARY   CHANNEL UNIT ADDRESS'                  S21021 78825002
         LINE                                                    S21021 78900002
         HEX   XCUA2,B0,3B                                       S21021 78975002
         ROUTINE  XDUM1,TESTSHRT                                 S21021 79050002
         LABEL 'ALTERNATE CHANNEL UNIT ADDRESS  '                S21021 79125002
         LINE                                                    S21021 79200002
         ROUTINE XVOL1,SETVOL                                    S21021 79275002
         LABEL 'VOLUME LABEL'                                    S21021 79350002
         LINE                                                    S21021 79425002
         LABEL ' '                                               S21021 79500002
         LINE  (1,1),(23,38)                                     S21021 79575002
         LABEL 'CC   CA   FL     CT','K    CA   US CS  CT'       S21021 79650002
         LINE  (23,3),(5,51),SKIP=2                              S21021 79725002
         HEX   XFCCWCC,0,1B                                      S21021 79800002
         HEX   XFCCWDA,0,3B                                      S21021 79875002
         ROUTINE  XDUM1,SPACER1                                  S21021 79950002
         HEX   XFCCWFL,0,1B                                      S21021 80025002
         HEX   XZERO,0,1B                                        S21021 80100002
         HEX   XFCCWCT,0,2B                                      S21021 80175002
         ROUTINE  XDUM1,SPACER16                                 S21021 80250002
         HEX   XCSWK,0,1B                                        S21021 80325002
         HEX   XCSWCA,0,3B                                       S21021 80400002
         ROUTINE  XDUM1,SPACER1                                  S21021 80475002
         ROUTINE XCSWATTN,SETHEX                                 S21021 80550002
         ROUTINE XCSWPCI,SETHEX                                  S21021 80625002
         HEX   XCSWCT,0,2B                                       S21021 80700002
         LABEL 'FAILING CCW','CSW'                               S21021 80775002
*                                                                       80850002
         LINE  ,(5,28)                                           S21021 80925002
         ROUTINE  XDUM1,SKIPPER                                  S21021 81000002
         LABEL 'UNIT STATUS','CHANNEL STATUS',                   S21021X81075002
               'STATISTICAL DATA','STATISTICAL DATA'             S21021 81150002
*                                                                       81225002
         LINE  (20,28),(3,28),SKIP=1                             S21021 81300002
         BIN        XCSWATTN                                            81375002
         BIN   XCSWPCI                              DETAIL OF           81450002
         ROUTINE    SDR1,SDRCONVL                                S21021 81525002
         ROUTINE    SDR1,SDRCONVR                                S21021 81600002
         ROUTINE XDUM1,SETSTLBL         SET STATISTICS LABELS    S21021 81675002
         LABEL 'ATTENTION       ','PRGM-CTLD TRPT  ',            S21021X81750002
               '             ','             '                   S21021 81825002
         LINE                                                           81900002
         BIN        XCSWSM                                              81975002
         BIN        XCSWSILI                                            82050002
         ROUTINE    SDR2,SDRCONVL                                S21021 82125002
         ROUTINE    SDR2,SDRCONVR                                S21021 82200002
         LABEL 'STATUS MODIFIER ','INCORRECT LENGTH',            S21021X82275002
               '             ','             '                   S21021 82350002
         LINE                                                           82425002
         BIN        XCSWUE                                              82500002
         BIN        XCSWPC                                              82575002
         ROUTINE    SDR3,SDRCONVL                                S21021 82650002
         ROUTINE SDR3,SDRCONVR                                   S21021 82725002
         LABEL 'CONTROL UNIT END','PROGRAM CHECK   ',            S21021X82800002
               '             ','             '                   S21021 82875002
         LINE                                                           82950002
         BIN        XCSWBSY                                             83025002
         BIN        XCSWPCHK                                            83100002
         ROUTINE SDR4,SDRCONVL                                   S21021 83175002
         ROUTINE SDR4,SDRCONVR                                   S21021 83250002
         LABEL 'BUSY            ','PROTECTION CHECK',            S21021X83325002
               '             ','             '                   S21021 83400002
         LINE                                                           83475002
         BIN        XCSWCE                                              83550002
         BIN        XCSWCDC                                             83625002
         ROUTINE SDR5,SDRCONVL                                   S21021 83700002
         ROUTINE SDR5,SDRCONVR                                   S21021 83775002
         LABEL 'CHANNEL END     ','CHAN DATA CHECK ',            S21021X83850002
               '             ','             '                   S21021 83925002
         LINE                                                           84000002
         BIN        XCSWDE                                              84075002
         BIN        XCSWCCC                                             84150002
         ROUTINE SDR6,SDRCONVL                                   S21021 84225002
         ROUTINE SDR6,SDRCONVR                                   S21021 84300002
         LABEL 'DEVICE END      ','CHAN CTL CHECK  ',            S21021X84375002
               '             ','             '                   S21021 84450002
         LINE                                                           84525002
         BIN        XCSWUC                                              84600002
         BIN        XCSWICC                                             84675002
         ROUTINE SDR7,SDRCONVL                                   S21021 84750002
         ROUTINE SDR7,SDRCONVR                                   S21021 84825002
         LABEL 'UNIT CHECK      ','I/F CTL CHECK   ',            S21021X84900002
               '             ','             '                   S21021 84975002
         LINE       ,,SKIP=2                                            85050002
         BIN        XCSWUE                                              85125002
         BIN        XCSWCH                                              85200002
         ROUTINE SDR8,SDRCONVL                                   S21021 85275002
         ROUTINE SDR8,SDRCONVR                                   S21021 85350002
         LABEL 'UNIT EXCEPTION  ','CHAINING CHECK  ',            S21021X85425002
               '             ','             '                   S21021 85500002
*                                                                       85575002
         LINE  ,(1,1),SKIP=2                                     S21021 85650002
         ROUTINE    XDUM1,SKIPPER                                       85725002
         LABEL      'SENSE BYTE DATA'                                   85800002
*                                                                       85875002
         LINE  (11,19),(1,19),SKIP=2                             S21021 85950002
         ROUTINE  XB0CMDR,SETHEX                                 S21021 86025002
         ROUTINE  XB1NOISE,SETHEX                                S21021 86100002
         ROUTINE  XB2TE0,SETHEX                                         86175002
         ROUTINE  XB3RWN,SETHEX                                  S21021 86250002
         ROUTINE  XB4ECH,SETHEX                                  S21021 86325002
         ROUTINE  XB5BIT0,SETHEX                                 S21021 86400002
         LABEL      'BYTE 0','BYTE 1','BYTE 2','BYTE 3','BYTE 4',      C86475002
               'BYTE 5'                                                 86550002
*                                            INDIVIDUAL LIST OF SENSE   86625002
         LINE       (11,19),(1,19),SKIP=1                               86700002
         BIN        XB0CMDR                                             86775002
         BIN        XB1NOISE                                            86850002
         BIN        XB2TE0                                              86925002
         BIN        XB3RWN                                              87000002
         BIN        XB4ECH                                              87075002
         BIN        XB5BIT0                                             87150002
         ROUTINE    XDEVT2,SETST1                                S20202 87225002
         LABEL  'CMND REJ ','NOISE    ','TRK ERR 0','R/W VRC  ',       C87300002
               'ECHO ERR ','BIT  0   '                                  87375002
*                                                                       87450002
         LINE                                                           87525002
         BIN        XB0INTRQ                                            87600002
         BIN        XB1STATA                                            87675002
         BIN        XB2TE1                                              87750002
         BIN        XB3LRC                                              87825002
         BIN        XB4REJ                                              87900002
         BIN        XB5BIT1                                             87975002
         LABEL  'INTV REQD','TU STAT A','TRK ERR 1','LRCR     ',       C88050002
               'REJECT TU','BIT  1   '                                  88125002
*                                                                       88200002
         LINE                                                           88275002
         BIN        XB0BUSC                                             88350002
         BIN        XB1STATB                                            88425002
         BIN        XB2TE2                                              88500002
         BIN        XB3SKW                                              88575002
         BIN        XB4RDC                                              88650002
         BIN        XB5BIT2                                             88725002
         LABEL  'BUS O CHK','TU STAT B','TRK ERR 2','SKEW     ',       C88800002
               'READ CLCK','BIT  2   '                                  88875002
*                                                                       88950002
         LINE                                                           89025002
         BIN        XB0ECHK                                             89100002
         BIN        XB17TRK                                             89175002
         BIN        XB2TE3                                              89250002
         BIN        XB3CRC                                              89325002
         BIN        XB4WRC                                              89400002
         BIN        XB5BIT3                                             89475002
         LABEL  'EQUIP CHK','7 TRACK  ','TRK ERR 3','CRC/DT CH',       C89550002
               'WRITE CLK','BIT  3   '                                  89625002
*                                                                       89700002
         LINE                                                           89775002
         BIN        XB0DCHK                                             89850002
         BIN        XB1LOADP                                            89925002
         BIN        XB2TE4                                              90000002
         BIN        XB3SKV                                              90075002
         BIN        XB4DLY                                              90150002
         BIN        XB5BIT4                                             90225002
         LABEL  'DATA CHK ','LOAD PT  ','TRK ERR 4','SKEW VRC ',       C90300002
               'ST RD CHK','BIT  4   '                          XA00641 90375002
*                                                                       90450002
         LINE                                                           90525002
         BIN        XB0OVRN                                             90600002
         BIN        XB1WTSTA                                            90675002
         BIN        XB2TE5                                              90750002
         BIN        XB3PED                                              90825002
         BIN        XB4CSQ                                              90900002
         BIN        XB5BIT5                                             90975002
         LABEL  'OVERRUN  ','WRITE STA','TRK ERR 5','PE DRIVE ',       C91050002
               'C SEQUENC','BIT  5   '                                  91125002
*                                                                       91200002
         LINE                                                           91275002
         BIN        XB0WRD                                              91350002
         BIN        XB1FLPRT                                            91425002
         BIN        XB2TE6                                              91500002
         BIN        XB3BKW                                              91575002
         BIN        XB4BSQ                                              91650002
         BIN        XB5BIT6                                             91725002
         LABEL  'WRD CNT 0','FL PROT  ','TRK ERR 6','BACKWARD ',       C91800002
               'B SEQUENC','BIT  6   '                                  91875002
*                                                                       91950002
         LINE  ,,SKIP=2                                          S21021 92025002
         BIN        XB0DTC                                              92100002
         BIN        XB1NCOMP                                            92175002
         BIN        XB2TE7                                              92250002
         BIN        XB3CCM                                              92325002
         BIN        XB4ASQ                                              92400002
         BIN        XB5BIT7                                             92475002
         LABEL  'DT CNVRT ','NOT COMP ','TRK ERR 7','COMPARE  ',       C92625002
               'A SEQUENC','BIT  7   '                                  92700002
         LINE  ,                                               @XA22172 92700201
         ROUTINE XDEVT2,CHK3203                                @XA20650 92700401
         LABEL ''                                              @XA20650 92700601
         LINE  (11,19),(1,19),SKIP=2                           @X60CAFR 92701002
         ROUTINE XB6BIT0,SETHEX                                @X60CAFR 92701202
         ROUTINE XB7BIT0,SETHEX                                @X60CAFR 92701402
         ROUTINE XB8BIT0,SETHEX                                @X60CAFR 92701602
         ROUTINE XB9BIT0,SETHEX                                @X60CAFR 92701802
         ROUTINE XB10BIT0,SETHEX                               @X60CAFR 92702002
         ROUTINE XB11BIT0,SETHEX                               @X60CAFR 92702202
MOR3203  LABEL 'BYTE 6','BYTE 7','BYTE 8','BYTE 9','BYTE 10', X        X92702402
               'BYTE 11'                                       @X60CAFR 92702602
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92702802
         BIN   XB6BIT0                                         @X60CAFR 92703002
         BIN   XB7BIT0                                         @X60CAFR 92703202
         BIN   XB8BIT0                                         @X60CAFR 92703402
         BIN   XB9BIT0                                         @X60CAFR 92703602
         BIN   XB10BIT0                                        @X60CAFR 92703802
         BIN   XB11BIT0                                        @X60CAFR 92704002
         LABEL 'INV FC RQ',                                    @X60CAFRX92704202
               'PRINT CHK',                                    @X60CAFRX92704402
               'FL TO MOV',                                    @X60CAFRX92704602
               'FORMS CHK',                                    @X60CAFRX92704802
               'FCT GO RJ',                                    @X60CAFRX92705002
               'ATTCH RDY'                                              92705201
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92705402
         BIN   XB6BIT1                                         @X60CAFR 92705602
         BIN   XB7BIT1                                         @X60CAFR 92705802
         BIN   XB8BIT1                                         @X60CAFR 92706002
         BIN   XB9BIT1                                         @X60CAFR 92706202
         BIN   XB10BIT1                                        @X60CAFR 92706402
         BIN   XB11BIT1                                        @X60CAFR 92706602
         LABEL 'H/S FAULT',                                    @X60CAFRX92706802
               'CAB 2 PTY',                                    @X60CAFRX92707002
               'ACC SLOW ',                                    @X60CAFRX92707202
               'OUT OF FM',                                    @X60CAFRX92707402
               'MS NPL RY',                                    @X60CAFRX92707602
               'CARR OPER'                                     @X60CAFR 92707802
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92708002
         BIN   XB6BIT2                                         @X60CAFR 92708202
         BIN   XB7BIT2                                         @X60CAFR 92708402
         BIN   XB8BIT2                                         @X60CAFR 92708602
         BIN   XB9BIT2                                         @X60CAFR 92708802
         BIN   XB12BIT2                                        @X60CAFR 92709002
         BIN   XB11BIT2                                        @X60CAFR 92709202
         LABEL 'UNASSIGN ',                                    @X60CAFRX92709402
               'DUCT PTY ',                                    @X60CAFRX92709602
               'MS FB PLS',                                    @X60CAFRX92709802
               'STK FL/JM',                                    @X60CAFRX92710002
               'BL DAT CK',                                            X92710201
               'PRNT OPER'                                     @X60CAFR 92710402
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92710602
         BIN   XB6BIT3                                         @X60CAFR 92710802
         BIN   XB7BIT3                                         @X60CAFR 92711002
         BIN   XB8BIT3                                         @X60CAFR 92711202
         BIN   XB9BIT3                                         @X60CAFR 92711402
         BIN   XB10BIT3                                        @X60CAFR 92711602
         BIN   XB11BIT3                                        @X60CAFR 92711802
         LABEL 'UNASSIGN ',                                    @X60CAFRX92712002
               'INTR OVRN',                                    @X60CAFRX92712202
               'XTR FB PL',                                    @X60CAFRX92712402
               'FT INLK O',                                    @X60CAFRX92712602
               'FOLDING  ',                                            X92712801
               'INTR EXP '                                     @X60CAFR 92713002
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92713202
         BIN   XB6BIT4                                         @X60CAFR 92713402
         BIN   XB7BIT4                                         @X60CAFR 92713602
         BIN   XB8BIT4                                         @X60CAFR 92713802
         BIN   XB9BIT4                                         @X60CAFR 92714002
         BIN   XB10BIT4                                        @X60CAFR 92714202
         BIN   XB11BIT4                                        @X60CAFR 92714402
         LABEL 'UNASSIGN ',                                    @X60CAFRX92714602
               'SPUR INTR',                                    @X60CAFRX92714802
               'STEP CK 1',                                    @X60CAFRX92715002
               'ATT CL PR',                                            X92715201
               'H BR S/NM',                                    @X60CAFRX92715402
               'T O EXP  '                                     @X60CAFR 92715602
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92715802
         BIN   XB6BIT5                                         @X60CAFR 92716002
         BIN   XB7BIT5                                         @X60CAFR 92716202
         BIN   XB8BIT5                                         @X60CAFR 92716402
         BIN   XB9BIT5                                         @X60CAFR 92716602
         BIN   XB10BIT5                                        @X60CAFR 92716802
         BIN   XB11BIT5                                        @X60CAFR 92717002
         LABEL 'INV IO CM',                                    @X60CAFRX92717202
               'MS B STAT',                                    @X60CAFRX92717402
               'STEP CK 2',                                    @X60CAFRX92717602
               'PRT CL PR',                                    @X60CAFRX92717802
               'HM BR BNC',                                    @X60CAFRX92718002
               'IN HMR ST'                                              92718201
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92718402
         BIN   XB6BIT6                                         @X60CAFR 92718602
         BIN   XB7BIT6                                         @X60CAFR 92718802
         BIN   XB8BIT6                                         @X60CAFR 92719002
         BIN   XB9BIT6                                         @X60CAFR 92719202
         BIN   XB10BIT6                                        @X60CAFR 92719402
         BIN   XB11BIT6                                        @X60CAFR 92719602
         LABEL 'CTL BO PY',                                    @X60CAFRX92719802
               'FMR PY CK',                                    @X60CAFRX92720002
               'M3CAROINC',                                            X92720201
               'TRN VL CK',                                    @X60CAFRX92720402
               'SYNC CK 1',                                    @X60CAFRX92720602
               'TN DR OFF'                                              92720801
         LINE  (11,19),(1,19),SKIP=2                                    92721002
         BIN   XB6BIT7                                         @X60CAFR 92721202
         BIN   XB7BIT7                                         @X60CAFR 92721402
         BIN   XB8BIT7                                         @X60CAFR 92721602
         BIN   XB9BIT7                                         @X60CAFR 92721802
         BIN   XB10BIT7                                        @X60CAFR 92722002
         BIN   XB11BIT7                                        @X60CAFR 92722202
         LABEL 'HALT     ',                                    @X60CAFRX92722402
               'TIME OUT ',                                    @X60CAFRX92722602
               'CARR STOP',                                    @X60CAFRX92722802
               'SYNC CK 0',                                    @X60CAFRX92723002
               'SYNC CK 2',                                    @X60CAFRX92723202
               'FD RL IDL'                                     @X60CAFR 92723402
         LINE  (11,19),(1,19),SKIP=2                           @X60CAFR 92723602
         ROUTINE XB12BIT0,SETHEX                               @X60CAFR 92723802
         ROUTINE XB13BIT0,SETHEX                               @X60CAFR 92724002
         ROUTINE XB14BIT0,SETHEX                               @X60CAFR 92724202
         ROUTINE XB15BIT0,SETHEX                               @X60CAFR 92724402
         ROUTINE XB16BIT0,SETHEX                               @X60CAFR 92724602
         ROUTINE XB17BIT0,SETHEX                               @X60CAFR 92724802
         LABEL 'BYTE 12','BYTE 13','BYTE 14','BYTE 15','BYTE 16',      X92725002
               'BYTE 17'                                       @X60CAFR 92725202
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92725402
         BIN   XB12BIT0                                        @X60CAFR 92725602
         BIN   XB13BIT0                                        @X60CAFR 92725802
         BIN   XB14BIT0                                        @X60CAFR 92726002
         BIN   XB15BIT0                                        @X60CAFR 92726202
         BIN   XB16BIT0                                        @X60CAFR 92726402
         BIN   XB17BIT0                                        @X60CAFR 92726602
         LABEL 'BUSY     ',                                            X92726801
               'BIT 0    ',                                    @X60CAFRX92727002
               'PRNT CMPL',                                    @X60CAFRX92727202
               'BIT 0    ',                                    @X60CAFRX92727402
               'ENABLE   ',                                    @X60CAFRX92727602
               'BIT 0    '                                     @X60CAFR 92727802
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92728002
         BIN   XB12BIT1                                        @X60CAFR 92728202
         BIN   XB13BIT1                                        @X60CAFR 92728402
         BIN   XB14BIT1                                        @X60CAFR 92728602
         BIN   XB15BIT1                                        @X60CAFR 92728802
         BIN   XB16BIT1                                        @X60CAFR 92729002
         BIN   XB17BIT1                                        @X60CAFR 92729202
         LABEL 'ERR PEND ',                                    @X60CAFRX92729402
               'BIT 1    ',                                    @X60CAFRX92729602
               'NOT READY',                                    @X60CAFRX92729802
               'BIT 1    ',                                    @X60CAFRX92730002
               'COMPARE  ',                                    @X60CAFRX92730202
               'BIT 1    '                                     @X60CAFR 92730402
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92730602
         BIN   XB12BIT2                                        @X60CAFR 92730802
         BIN   XB13BIT2                                        @X60CAFR 92731002
         BIN   XB14BIT2                                        @X60CAFR 92731202
         BIN   XB15BIT2                                        @X60CAFR 92731402
         BIN   XB12BIT2                                        @X60CAFR 92731602
         BIN   XB17BIT2                                        @X60CAFR 92731802
         LABEL 'GO NT RDY',                                    @X60CAFRX92732002
               'BIT 2    ',                                    @X60CAFRX92732202
               'TIME INTR',                                    @X60CAFRX92732402
               'BIT 2    ',                                    @X60CAFRX92732602
               'FIRED    ',                                    @X60CAFRX92732802
               'BIT 2    '                                     @X60CAFR 92733002
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92733202
         BIN   XB12BIT3                                        @X60CAFR 92733402
         BIN   XB13BIT3                                        @X60CAFR 92733602
         BIN   XB14BIT3                                        @X60CAFR 92733802
         BIN   XB15BIT3                                        @X60CAFR 92734002
         BIN   XB16BIT3                                        @X60CAFR 92734202
         BIN   XB17BIT3                                        @X60CAFR 92734402
         LABEL 'ATTN PEND',                                    @X60CAFRX92734602
               'BIT 3    ',                                    @X60CAFRX92734802
               'ADAPT ERR',                                    @X60CAFRX92735002
               'BIT 3    ',                                    @X60CAFRX92735202
               'HANDLED  ',                                    @X60CAFRX92735402
               'BIT 3    '                                     @X60CAFR 92735602
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92735802
         BIN   XB12BIT4                                        @X60CAFR 92736002
         BIN   XB13BIT4                                        @X60CAFR 92736202
         BIN   XB14BIT4                                        @X60CAFR 92736402
         BIN   XB15BIT4                                        @X60CAFR 92736602
         BIN   XB16BIT4                                        @X60CAFR 92736802
         BIN   XB17BIT4                                        @X60CAFR 92737002
         LABEL 'PLB ERR L',                                            X92737201
               'BIT 4    ',                                    @X60CAFRX92737402
               'OPERATION',                                    @X60CAFRX92737602
               'BIT 4    ',                                    @X60CAFRX92737802
               'DATA CHK ',                                    @X60CAFRX92738002
               'BIT 4    '                                     @X60CAFR 92738202
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92738402
         BIN   XB12BIT5                                        @X60CAFR 92738602
         BIN   XB13BIT5                                        @X60CAFR 92738802
         BIN   XB14BIT5                                        @X60CAFR 92739002
         BIN   XB15BIT5                                        @X60CAFR 92739202
         BIN   XB16BIT5                                        @X60CAFR 92739402
         BIN   XB17BIT5                                        @X60CAFR 92739602
         LABEL 'CARR STOP',                                    @X60CAFRX92739802
               'BIT 5    ',                                    @X60CAFRX92740002
               'MACH CHK ',                                    @X60CAFRX92740202
               'BIT 5    ',                                    @X60CAFRX92740402
               'HMR FAIL ',                                    @X60CAFRX92740602
               'BIT 5    '                                     @X60CAFR 92740802
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92741002
         BIN   XB12BIT6                                        @X60CAFR 92741202
         BIN   XB13BIT6                                        @X60CAFR 92741402
         BIN   XB14BIT6                                        @X60CAFR 92741602
         BIN   XB15BIT6                                        @X60CAFR 92741802
         BIN   XB16BIT6                                        @X60CAFR 92742002
         BIN   XB17BIT6                                        @X60CAFR 92742202
         LABEL 'REQ STACK',                                    @X60CAFRX92742402
               'BIT 6    ',                                    @X60CAFRX92742602
               'INTR ENBL',                                    @X60CAFRX92742802
               'BIT 6    ',                                    @X60CAFRX92743002
               'HMR MSFIR',                                    @X60CAFRX92743202
               'BIT 6    '                                     @X60CAFR 92743402
         LINE  (11,19),(1,19),SKIP=2                                    92743602
         BIN   XB12BIT7                                        @X60CAFR 92743802
         BIN   XB13BIT7                                        @X60CAFR 92744002
         BIN   XB14BIT7                                        @X60CAFR 92744202
         BIN   XB15BIT7                                        @X60CAFR 92744402
         BIN   XB16BIT7                                        @X60CAFR 92744602
         BIN   XB17BIT7                                        @X60CAFR 92744802
         LABEL 'HI SP CAR',                                    @X60CAFRX92745002
               'BIT 7    ',                                    @X60CAFRX92745202
               'INTR REQ ',                                    @X60CAFRX92745402
               'BIT 7    ',                                    @X60CAFRX92745602
               'PLB PRTY ',                                    @X60CAFRX92745802
               'BIT 7    '                                     @X60CAFR 92746002
         LINE  (11,19),(1,19),SKIP=2                           @X60CAFR 92746202
         ROUTINE XB18BIT0,SETHEX                               @X60CAFR 92746402
         ROUTINE XB19BIT0,SETHEX                               @X60CAFR 92746602
         ROUTINE XB20BIT0,SETHEX                               @X60CAFR 92746802
         ROUTINE XB21BIT0,SETHEX                               @X60CAFR 92747002
         ROUTINE XB22BIT0,SETHEX                               @X60CAFR 92747202
         ROUTINE XB23BIT0,SETHEX                               @X60CAFR 92747402
         LABEL 'BYTE 18','BYTE 19','BYTE 20','BYTE 21','BYTE 22',      X92747602
               'BYTE 23'                                       @X60CAFR 92747802
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92748002
         BIN   XB18BIT0                                        @X60CAFR 92748202
         BIN   XB19BIT0                                        @X60CAFR 92748402
         BIN   XB20BIT0                                        @X60CAFR 92748602
         BIN   XB21BIT0                                        @X60CAFR 92748802
         BIN   XB22BIT0                                        @X60CAFR 92749002
         BIN   XB23BIT0                                        @X60CAFR 92749202
         LABEL 'BIT 0    ',                                    @X60CAFRX92749402
               'UNASSIGN ',                                    @X60CAFRX92749602
               'UNASSIGN ',                                    @X60CAFRX92749802
               'UNASSIGN ',                                    @X60CAFRX92750002
               'UNASSIGN ',                                    @X60CAFRX92750202
               'UNASSIGN '                                     @X60CAFR 92750402
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92750602
         BIN   XB18BIT1                                        @X60CAFR 92750802
         BIN   XB19BIT1                                        @X60CAFR 92751002
         BIN   XB20BIT1                                        @X60CAFR 92751202
         BIN   XB21BIT1                                        @X60CAFR 92751402
         BIN   XB22BIT1                                        @X60CAFR 92751602
         BIN   XB23BIT1                                        @X60CAFR 92751802
         LABEL 'BIT 1    ',                                    @X60CAFRX92752002
               'RESTORE  ',                                    @X60CAFRX92752202
               'UNASSIGN ',                                    @X60CAFRX92752402
               'UNASSIGN ',                                    @X60CAFRX92752602
               'UNASSIGN ',                                    @X60CAFRX92752802
               'UNASSIGN '                                     @X60CAFR 92753002
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92753202
         BIN   XB18BIT2                                        @X60CAFR 92753402
         BIN   XB19BIT2                                        @X60CAFR 92753602
         BIN   XB20BIT2                                        @X60CAFR 92753802
         BIN   XB21BIT2                                        @X60CAFR 92754002
         BIN   XB18BIT2                                        @X60CAFR 92754202
         BIN   XB23BIT2                                        @X60CAFR 92754402
         LABEL 'BIT 2    ',                                    @X60CAFRX92754602
               'RST LN CT',                                    @X60CAFRX92754802
               'UNASSIGN ',                                    @X60CAFRX92755002
               'UNASSIGN ',                                    @X60CAFRX92755202
               'UNASSIGN ',                                    @X60CAFRX92755402
               'UNASSIGN '                                     @X60CAFR 92755602
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92755802
         BIN   XB18BIT3                                        @X60CAFR 92756002
         BIN   XB19BIT3                                        @X60CAFR 92756202
         BIN   XB20BIT3                                        @X60CAFR 92756402
         BIN   XB21BIT3                                        @X60CAFR 92756602
         BIN   XB22BIT3                                        @X60CAFR 92756802
         BIN   XB23BIT3                                        @X60CAFR 92757002
         LABEL 'BIT 3    ',                                    @X60CAFRX92757202
               'SPACE KEY',                                    @X60CAFRX92757402
               'UNASSIGN ',                                    @X60CAFRX92757602
               'UNASSIGN ',                                    @X60CAFRX92757802
               'UNASSIGN ',                                    @X60CAFRX92758002
               'UNASSIGN '                                     @X60CAFR 92758202
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92758402
         BIN   XB18BIT4                                        @X60CAFR 92758602
         BIN   XB19BIT4                                        @X60CAFR 92758802
         BIN   XB20BIT4                                        @X60CAFR 92759002
         BIN   XB21BIT4                                        @X60CAFR 92759202
         BIN   XB22BIT4                                        @X60CAFR 92759402
         BIN   XB23BIT4                                        @X60CAFR 92759602
         LABEL 'BIT 4    ',                                    @X60CAFRX92759802
               'UNASSIGN ',                                    @X60CAFRX92760002
               'UNASSIGN ',                                    @X60CAFRX92760202
               'UNASSIGN ',                                    @X60CAFRX92760402
               'UNASSIGN ',                                    @X60CAFRX92760602
               'UNASSIGN '                                     @X60CAFR 92760802
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92761002
         BIN   XB18BIT5                                        @X60CAFR 92761202
         BIN   XB19BIT5                                        @X60CAFR 92761402
         BIN   XB20BIT5                                        @X60CAFR 92761602
         BIN   XB21BIT5                                        @X60CAFR 92761802
         BIN   XB22BIT5                                        @X60CAFR 92762002
         BIN   XB23BIT5                                        @X60CAFR 92762202
         LABEL 'BIT 5    ',                                    @X60CAFRX92762402
               'ST/SNG CY',                                    @X60CAFRX92762602
               'UNASSIGN ',                                    @X60CAFRX92762802
               'UNASSIGN ',                                    @X60CAFRX92763002
               'UNASSIGN ',                                    @X60CAFRX92763202
               'UNASSIGN '                                     @X60CAFR 92763402
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92763602
         BIN   XB18BIT6                                        @X60CAFR 92763802
         BIN   XB19BIT6                                        @X60CAFR 92764002
         BIN   XB20BIT6                                        @X60CAFR 92764202
         BIN   XB21BIT6                                        @X60CAFR 92764402
         BIN   XB22BIT6                                        @X60CAFR 92764602
         BIN   XB23BIT6                                        @X60CAFR 92764802
         LABEL 'BIT 6    ',                                    @X60CAFRX92765002
               'UNASSIGN ',                                    @X60CAFRX92765202
               'UNASSIGN ',                                    @X60CAFRX92765402
               'UNASSIGN ',                                    @X60CAFRX92765602
               'UNASSIGN ',                                    @X60CAFRX92765802
               'UNASSIGN '                                     @X60CAFR 92766002
         LINE  (11,19),(1,19),SKIP=1                           @X60CAFR 92766202
         BIN   XB18BIT7                                        @X60CAFR 92766402
         BIN   XB19BIT7                                        @X60CAFR 92766602
         BIN   XB20BIT7                                        @X60CAFR 92766802
         BIN   XB21BIT7                                        @X60CAFR 92767002
         BIN   XB22BIT7                                        @X60CAFR 92767202
         BIN   XB23BIT7                                        @X60CAFR 92767402
         LABEL 'BIT 7    ',                                    @X60CAFRX92767602
               'NEAR EOFS',                                    @X60CAFRX92767802
               'UNASSIGN ',                                    @X60CAFRX92768002
               'UNASSIGN ',                                    @X60CAFRX92768202
               'UNASSIGN ',                                    @X60CAFRX92768402
               'UNASSIGN '                                     @X60CAFR 92768602
         LINE                                                           92769602
         ROUTINE XDUM1,RESETR2                                          92770602
         LABEL ''                                                       92771602
*                                                                       92775002
ENDTBLS  LINE  ,,SKIP=1            END OF TABLE STATEMENT      @XA20650 92850001
ENDTBLL  LABEL ''                  END OF TABLE LABEL          @XA20650 92925001
*                                                                       93000002
*                                                                       93075002
         DC    X'FF'                                                    93150002
RECSIZE  DC    X'0000'                  SIZE TO DUMP- VARIES     S21021 93225002
         DC    XL2'0018'                                                93300002
         DC    XL2'0018'                                         S21021 93375002
SHRTOBRL LABEL      ''                                           S21021 93450002
SHRTOBRS LINE  ,(1,1),SKIP=2                                     S21021 93525002
         ROUTINE    XDUM1,SKIPPER                                S21021 93600002
         LABEL      'STATISTICAL DATA'                           S21021 93675002
*                                                                S21021 93750002
         LINE       (21,30),(1,30),SKIP=1                        S21021 93825002
         ROUTINE    SDR1,SDRCONVL                                S21021 93900002
         ROUTINE    SDR1,SDRCONVR                                S21021 93975002
         ROUTINE XDUM1,SETSTLBL         SET STATISTICS LABELS    S21021 94050002
         LABEL '             ','             '                   S21021 94125002
*                                                                S21021 94200002
         LINE                                                    S21021 94275002
         ROUTINE    SDR2,SDRCONVL                                S21021 94350002
         ROUTINE    SDR2,SDRCONVR                                S21021 94425002
         LABEL '             ','             '                   S21021 94500002
         LINE                                                    S21021 94575002
         ROUTINE    SDR3,SDRCONVL                                S21021 94650002
         ROUTINE SDR3,SDRCONVR                                   S21021 94725002
         LABEL '             ','             '                   S21021 94800002
         LINE                                                    S21021 94875002
*                                                                S21021 94950002
         ROUTINE SDR4,SDRCONVL                                   S21021 95025002
         ROUTINE SDR4,SDRCONVR                                   S21021 95100002
         LABEL '             ','             '                   S21021 95175002
         LINE                                                    S21021 95250002
         ROUTINE SDR5,SDRCONVL                                   S21021 95325002
         ROUTINE SDR5,SDRCONVR                                   S21021 95400002
         LABEL '             ','             '                   S21021 95475002
         LINE                                                    S21021 95550002
         ROUTINE SDR6,SDRCONVL                                   S21021 95625002
         ROUTINE SDR6,SDRCONVR                                   S21021 95700002
         LABEL '             ','             '                   S21021 95775002
         LINE                                                    S21021 95850002
         ROUTINE SDR7,SDRCONVL                                   S21021 95925002
         ROUTINE SDR7,SDRCONVR                                   S21021 96000002
         LABEL '             ','             '                   S21021 96075002
         LINE                                                    S21021 96150002
         ROUTINE SDR8,SDRCONVL                                   S21021 96225002
         ROUTINE SDR8,SDRCONVR                                   S21021 96300002
         LABEL '             ','             '                   S21021 96375002
         LINE                                                    S21021 96450002
         ROUTINE    XDUM1,RESETR2                                S21021 96525002
         LABEL      ''                                           S21021 96600002
*                                                                S21021 96675002
         DC         X'FF'                                        S21021 96750002
         DC    X'002A'                                           S21021 96825002
         DC         X'0018'                                      S21021 96900002
         DC    X'0018'                                           S21021 96975002
*                                                                S21021 97050002
SNS3211  DC    C'CMND REJ *CMD RETRY*CAR F MOV*UCB PRTY *'              97051002
         DC    C'XTRA SCAN*BIT 0$'                             @X60CAFR 97052002
         DC    C'INTV REQ *PRT CHK  *CAR SQ CK*PLB PRTY *'     @X60CAFR 97053002
         DC    C'PRT TRIG *BIT 1$'                             @X60CAFR 97054002
         DC    C'BUS O CK *PRT QLTY *CAR SP CK*FCB PRTY *'     @X60CAFR 97055002
         DC    C'BLK PRINT*BIT 2$'                             @X60CAFR 97056002
         DC    C'EQUIP CK *LINE POS *PLT F ADV*COIL PRO *'     @X60CAFR 97057002
         DC    C'PLAT INLK*BIT 3$'                             @X60CAFR 97058002
         DC    C'DATA CHK *FRM CHECK*PLT F RET*H. FIR CK*'     @X60CAFR 97059002
         DC    C'CAR GO   *BIT 4$'                             @X60CAFR 97060002
         DC    C'B PAR CK *COMD SUPP*FORMS JAM*SERV AID *'     @X60CAFR 97061002
         DC    C'CAR SETTL*BIT 5$'                             @X60CAFR 97062002
         DC    C'LD CHECK *MECH MOTN*RIB MOT  *UCSAR S C*'     @X60CAFR 97063002
         DC    C'CAR COMPR*BIT 6$'                             @X60CAFR 97064002
         DC    C'CHAN 9   *UNASSIGN *TRN OVLD *PSE S CHK*'     @X60CAFR 97065002
         DC    C'FWD DRIVE*BIT 7$'                             @X60CAFR 97066002
         DC    C'$$$$$$'                                       @X60CAFR 97067002
*                                                              @X60CAFR 97068002
SNS3540  DC    C'CMND REJ*PERM ERR*  FLAGS    *  CC       *'            97069002
         DC    C'   HH       *   R       $'                    @X60CAFR 97070002
         DC    C'INV REQ*AUTO RTRY*'                           @X60CAFR 97071002
         DC    C'            *            *             *           $'  97072002
         DC    C'BUS O CHK*MOT. MAL*'                          @X60CAFR 97073002
         DC    C'            *            *             *           $'  97074002
         DC    C'EQP CK*RETRY/IR*'                             @X60CAFR 97075002
         DC    C'            *            *             *           $'  97076002
         DC    C'DATA CK*SREC XFR*'                            @X60CAFR 97077002
         DC    C'            *            *             *           $'  97078002
         DC    C'NOT USED*NOT USED*'                           @X60CAFR 97079002
         DC    C'            *            *             *           $'  97080002
         DC    C'NOT USED*NOT USED*'                           @X60CAFR 97081002
         DC    C'            *            *             *           $'  97082002
         DC    C'NOT USED*NOT USED*'                           @X60CAFR 97083002
         DC    C'            *            *             *           $'  97084002
         DC    C'$$$$$$'                                       @X60CAFR 97085002
*                                                              @X60CAFR 97086002
SNS3203  DC    C'CMND REJ *ALWAYS 0 *CAR F MOV*UCS PRTY *'              97087001
         DC    C'DEVICE ID*RIBN REV$'                          @X60CAFR 97088002
         DC    C'INTV REQ *PRT CHK  *CAR MO CK*PLB PRTY *'              97089002
         DC    C'UNASSIGN *RST KEY$'                                    97090001
         DC    C'BUS O CK *NOT USED *NOT USED *NOT USED *'     @X60CAFR 97091002
         DC    C'UNASSIGN *RST LN CT$'                         @X60CAFR 97092002
         DC    C'EQUIP CK *LINE POS *NOT USED *COIL PRO *'     @X60CAFR 97093002
         DC    C'UNASSIGN *SPACE KEY$'                         @X60CAFR 97094002
         DC    C'DATA CHK *FRM CHECK*NOT USED *H. FIR CK*'     @X60CAFR 97095002
         DC    C'UNASSIGN *IDLE STAT$'                         @X60CAFR 97096002
         DC    C'B PAR CK *COMD SUPP*FORMS JAM*UNASSIGN *'              97097001
         DC    C'PRINT SS *START KEY$'                         @X60CAFR 97098002
         DC    C'LD CHECK *CTRLR CK *RB RV T O*SYNC CHK *'              97099002
         DC    C'CTRLR CK *STOP KEY$'                          @X60CAFR 97100002
         DC    C'CHAN 9   *UNASSIGN *TRN VELOC*UNASSIGN *'              97101002
         DC    C'STATS    *UNASSIGN $'                                  97102001
         DC    C'$$$$$$'                                       @X60CAFR 97103002
LABELS   DS    0F                                                       97125002
         DC    C'$'                                                     97200002
         LSTART                                                         97275002
         END                                                            97350002
