         TITLE 'IFCEI145 MODEL 145 CHANNEL EDIT'                        00047002
         MACRO                                                          00094002
&NAME    DSGEN                                                          00141002
.*                            THIS MACRO GENERATES ONE DSECT WORD       00188002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 00235002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  00282002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    00329002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 00376002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   00423002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 00470002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      00517002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  00564002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    00611002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   00658002
         GBLC &ITEM(1500)                                               00705002
         GBLA &ITEMNBR,&BITS(1500),&SHIFT(1500)                         00752002
         LCLB  &ONLY1,&CTIND                                            00799002
         LCLA  &START1,&START2,&END1,&END2                              00846002
         LCLC  &SYMBOL,&EQUSYM                                          00893002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 00940002
         ACTR  100000                                                   00987002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            01034002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     01081002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' AND '&SYSLIST(&OP+1,4)' EQ '').ERR1  01128002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   01175002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        01222002
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1            01269002
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT             01316002
         AGO   .SET2A                   BRANCH AROUND                   01363002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              01410002
         MEXIT                                                          01457002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X01504002
               ).SET2                   TEST FOR NO SECOND              01551002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   01598002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        01645002
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2            01692002
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2              01739002
         AGO   .LOOP                                                    01786002
.SET2    ANOP                                                           01833002
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 01880002
         AGO   .LOOP                                                    01927002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             01974002
         MEXIT                                                          02021002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               02068002
         MEXIT                                                          02115002
.LOOP    ANOP                                                           02162002
&OP      SETA  &OP+1                                                    02209002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           02256002
&ITEMNBR SETA  &ITEMNBR+1                                               02303002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            02350002
         MNOTE '**NULL BIT COUNT FIELD**'                               02397002
         MEXIT                                                          02444002
.OK1     ANOP                                                           02491002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        02538002
         AIF   ('&SYMBOL' NE '').OK                                     02585002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         02632002
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                         02679002
         AGO   .START                   GET NEXT                        02726002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        02773002
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU          02820002
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        02867002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         02914002
         AGO   .NO3                     BRANCH AROUND                   02961002
.OK2     ANOP                                                           03008002
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED              03055002
.NO3     ANOP                                                           03102002
&SYMBOL  EQU   *+&BYTE                                                  03149002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL             03196002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    03243002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    03290002
.CNT     ANOP                                                           03337002
&CTIND   SETB  1                        SET COUNT INDICATOR             03384002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   03431002
&BYTE    SETA  &COUNT/8                                                 03478002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        03525002
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        03572002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             03619002
&END1    SETA  &END1+1                  INCREMENT COUNT                 03666002
&OP      SETA  &OP-1                    DECREMENT INCREMENT             03713002
         AGO   .LOOP                    GENERATE NEXT                   03760002
.TSTST   ANOP                                                           03807002
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END               03854002
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        03901002
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      03948002
.NSET1   ANOP                                                           03995002
&OP      SETA  &OP-1                    DECREMENT INDEX                 04042002
&START1  SETA  &START1+1                INCREMENT FIRST COUNT           04089002
         AGO   .LOOP                    GO DO NEXT                      04136002
.LPDONE  ANOP                                                           04183002
&ONLY1   SETB  0                        CLEAR INDICATOR                 04230002
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      04277002
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 04324002
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT               04371002
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES             04418002
&NAME    DS    &COUNT.C                                                 04465002
.END     MEXIT                                                          04512002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          04559002
         MEXIT                                                          04606002
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   04653002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   04700002
         MEXIT                                                          04747002
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         04794002
*****               THE FOLLOWING STATEMENT                *****        04841002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        04888002
.EQU2    ANOP                                                           04935002
&EQUCNT  SETA  0                        CLEAR COUNTER                   04982002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND                 05029002
.EQULOP  ANOP                                                           05076002
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX                 05123002
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     05170002
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?                05217002
         AGO   .EQULOP                  NO-GET NEXT                     05264002
.EQUOUT  ANOP                                                           05311002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME                  05358002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS              05405002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT                 05452002
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED             05499002
         AGO   .START                   RETURN FOR NEXT                 05546002
         MEND                                                           05593002
         EJECT                                                          05640002
*  LINE MACRO     LINE MACRO     LINE MACRO     LINE MACRO            * 05687002
         SPACE 2                                                        05734002
         MACRO                                                          05781002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      05828002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     05875002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    05922002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 05969002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    06016002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    06063002
.*                                 THE PREVIOUS LINE AND STORES THAT #  06110002
.*                                 INTO THE APPROPRIATE BYTE.           06157002
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    06204002
.*                                 DATA.                                06251002
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 06298002
.*                                 DATA COLUMN STARTING CHARACTERS.     06345002
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   06392002
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 06439002
.*                                 STARTING CHARACTERS.                 06486002
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   06533002
.*                                 TO BEGIN NEXT PRINTED LINE.          06580002
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       06627002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   06674002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 06721002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   06768002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 06815002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    06862002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   06909002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   06956002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  07003002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   07050002
.*                                 THE SUBJECT LINE                     07097002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  07144002
         GBLA  &LASTCC,&INITIAL                                         07191002
         GBLC  &NRENTSX                                                 07238002
         GBLC  &CARRCON                                                 07285002
         GBLB  &TEST                                                    07332002
         LCLA  &S                                                       07379002
&NAME    DS    0C                                                       07426002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  07473002
         LINEND                                                         07520002
         AGO   .NTFIRST                                                 07567002
.FIRSTLN ANOP                                                           07614002
&NRENTSX SETC  'N&SYSNDX'                                               07661002
&INITIAL SETA  1                                                        07708002
N&SYSNDX EQU   *                                                        07755002
.NTFIRST ANOP                                                           07802002
         DC    AL1(0)                                                   07849002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               07896002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                07943002
&DB      SETA  &DATA(1)                                                 07990002
         AGO   .AA                                                      08037002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                08084002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 08131002
         AGO   .CC                                                      08178002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    08225002
         AIF   (&DATA(2) EQ &DT).BB                                     08272002
.CC      ANOP                                                           08319002
&DT      SETA  &DATA(2)                                                 08366002
.BB      DC    XL2'FFFE'                                                08413002
         DC    FL1'&DB'                                                 08460002
         DC    FL1'&DT'                                                 08507002
&NRENTS  SETA  &NRENTS+1                                                08554002
.NCDATA  ANOP                                                           08601002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              08648002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               08695002
&LB      SETA  &LABEL(1)                                                08742002
         AGO   .AAA                                                     08789002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              08836002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               08883002
         AGO   .CCC                                                     08930002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  08977002
         AIF   (&LABEL(2) EQ &LT).BBB                                   09024002
.CCC     ANOP                                                           09071002
&LT      SETA  &LABEL(2)                                                09118002
.BBB     DC    XL2'FFFF'                                                09165002
         DC    FL1'&LB'                                                 09212002
         DC    FL1'&LT'                                                 09259002
&NRENTS  SETA  &NRENTS+1                                                09306002
.NCLABEL ANOP                                                           09353002
         AIF   ('&SKIP' NE '').CONT                                     09400002
         AIF   (&TEST EQ 0).NOCHANG                                     09447002
&S       SETA  &LASTCC                                                  09494002
         AGO   .DEFAULT                                                 09541002
.CONT    ANOP                                                           09588002
         AIF   (&TEST EQ 0).AB                                          09635002
&S       SETA  &SKIP                                                    09682002
.DEFAULT ANOP                                                           09729002
         ORG   &CARRCON+3                                               09776002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 09823002
         ORG                                                            09870002
&LASTCC  SETA  &S                                                       09917002
&TEST    SETB  0                                                        09964002
         AGO   .DD                                                      10011002
.AB      AIF   (&SKIP EQ &LASTCC).NOCHANG                               10058002
A&SYSNDX DC    XL2'FFFB'                                                10105002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              10152002
         DC    FL1'9'                                                   10199002
&LASTCC  SETA  &SKIP                                                    10246002
&TEST    SETB  1                                                        10293002
&CARRCON SETC  'A&SYSNDX'                                               10340002
&NRENTS  SETA  &NRENTS+1                                                10387002
.DD      ANOP                                                           10434002
.NOCHANG ANOP                                                           10481002
         MEND                                                           10528002
         EJECT                                                          10575002
         MACRO                                                          10622002
         BIN                                                            10669002
.*                                 &LOGITEM - NAME OF ITEM IN LOG       10716002
.*                                      RECORD DSECT                    10763002
.*                                 &SKIP$OR - NBR OF SPACES TO SKIP ON  10810002
.*                                 MULTIPLE PRINT OR NBR OF SPACES      10857002
.*                                      TO BACK UP FROM COLUMN FOR      10904002
.*                                      START OF PRINTING. THE LETTER   10951002
.*                                      B PRECEEDS THE NUMBER (B5) IF   10998002
.*                                      THE LATTER IS DESIRED. OMISSION 11045002
.*                                      OF THIS OPERAND FORCES OPTION 2 11092002
.*                                      WITH BACKUP SPACING EQUAL TO    11139002
.*                                 THE NUMBER OF BITS IN THE ITEM       11186002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      11233002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     11280002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       11327002
         GBLC &ITEM(1500)                                               11374002
         GBLA &ITEMNBR,&BITS(1500),&SHIFT(1500),&NRENTS                 11421002
         GBLC  &DSECT                                                   11468002
         LCLB  &B                                                       11515002
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   11562002
         LCLA  &TEMP,&T,&OP                                             11609002
         LCLC  &S                                                       11656002
.LOOP    ANOP                                                           11703002
&OP      SETA  &OP+1                                                    11750002
.LOOP1   ANOP                                                           11797002
&NDX     SETA  &NDX+1                                                   11844002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND               11891002
         AIF   (&NDX LT &ITEMNBR).LOOP1                                 11938002
         MNOTE *,'YOU BLEW IT'                                          11985002
         ROUTINE DUM,SKIPPER                                            12032002
         MEXIT                                                          12079002
.FOUND   ANOP                                                           12126002
&ISHIFT  SETA  &SHIFT(&NDX)                                             12173002
&IBITS   SETA  &BITS(&NDX)                                              12220002
&T       SETA  &IBITS-1                                                 12267002
&B       SETB  0                                                        12314002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         12361002
&K       SETA  K'&SYSLIST(&OP,2)                                        12408002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          12455002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            12502002
&T       SETA  &S                                                       12549002
.BACKUP  ANOP                                                           12596002
&NRENTS  SETA  &NRENTS+1                                                12643002
&TEMP    SETA  &ISHIFT                                                  12690002
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                            12737002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'                12784002
         AGO   .OUT                                                     12831002
.BIN2    AIF   ('&SYSLIST(&OP,2)' NE '').BIN3                           12878002
&B       SETB  1                                                        12925002
.BIN3    ANOP                                                           12972002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'                    13019002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             13066002
.OUT     ANOP                                                           13113002
&NDX     SETA  0                                                        13160002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 13207002
         MEND                                                           13254002
         EJECT                                                          13301002
         MACRO                                                 @YM2954P 13348002
         HEX   ,                                               @YM2954P 13368002
.*                            THIS MACRO FACILITATES GENERATION OF THE  13388002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    13408002
.*                                 CONVERSIONS.                @YM2954P 13428002
.*                            &SYSLIST(&OP,1) - NAME OF DATA ITEM TO BE 13448002
.*                                 CONVERTED                   @YM2954P 13468002
.*                            &SYSLIST(&OP,2) - # OF SPACES TO SKIP ON  13488002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   13508002
.*                                 BACK UP FROM COLUMN FOR START OF     13528002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  13548002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  13568002
.*                                 DESIRED. OMISSION OF THIS OPERAND    13588002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  13608002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  13628002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 13648002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    13668002
.*                                 IMPLICITLY B).              @YM2954P 13688002
.*                            &SYSLIST(&OP,3) - NUMBER OF BYTES TO      13708002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     13728002
.*                                 WITH AN L,R, OR B TO STIPULATE       13748002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     13768002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     13788002
.*                                 RESPECTIVELY. OMISSION OF THIS       13808002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  13828002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 13848002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 13868002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   13888002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     13908002
.*                                 SUBJECT LINE(S).            @YM2954P 13928002
         GBLA  &BITS(1500),&ITEMNBR,&SHIFT(1500),&NRENTS       @YM2954P 13948002
         GBLC  &ITEM(1500),&DSECT                              @YM2954P 13968002
         GBLA  &INITIAL                                        @YM2954P 13988002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                      @YM2954P 14008002
         LCLB  &B,&SUB                                         @YM2954P 14028002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP,&OP     @YM2954P 14048002
         LCLC  &S,&LETTER                                      @YM2954P 14068002
         ACTR  500000                                          @YM2954P 14088002
         AIF   (&DIAGTST EQ 0).NOMSG                           @YM2954P 14108002
         AIF   (&INITIAL EQ 0).NOMSG                           @YM2954P 14128002
         AIF   (&DIAGLIN EQ 1).NOMSG                           @YM2954P 14148002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'         @YM2954P 14168002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****            @YM2954P 14188002
*        LINE                                                  @YM2954P 14208002
         LINE                                                  @YM2954P 14228002
.NOMSG   ANOP                                                  @YM2954P 14248002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP         @YM2954P 14268002
&SUB     SETB  1                                               @YM2954P 14288002
.LOOP    ANOP                                                  @YM2954P 14308002
&OP      SETA  &OP+1                                           @YM2954P 14328002
.LOOP1   ANOP                                                  @YM2954P 14348002
&NDX     SETA  &NDX+1                                          @YM2954P 14368002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND      @YM2954P 14388002
         AIF   (&NDX LT &ITEMNBR).LOOP1                        @YM2954P 14408002
         MNOTE '**LOG ITEM NOT DEFINED**'                      @YM2954P 14428002
         MEXIT                                                 @YM2954P 14448002
.FOUND   ANOP                                                  @YM2954P 14468002
&ISHIFT  SETA  &SHIFT(&NDX)                                    @YM2954P 14488002
&IBITS   SETA  &BITS(&NDX)                                     @YM2954P 14508002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).ALIGN            @YM2954P 14528002
.ERR     MNOTE '**DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY**' @YM2954P 14548002
         MEXIT                                                 @YM2954P 14568002
.ALIGN   ANOP                                                  @YM2954P 14588002
&CODE    SETA  1                                               @YM2954P 14608002
         AIF   (&SUB EQ 1).SUBA                                @YM2954P 14628002
&K       SETA  K'&SYSLIST(3)                                   @YM2954P 14648002
         AGO   .SUBB                                           @YM2954P 14668002
.SUBA    ANOP                                                  @YM2954P 14688002
&K       SETA  K'&SYSLIST(&OP,3)                               @YM2954P 14708002
.SUBB    ANOP                                                  @YM2954P 14728002
         AIF   (&K EQ 1).ERR3                                  @YM2954P 14748002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                   @YM2954P 14768002
         MNOTE '**BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL**' 14788002
         MEXIT                                                 @YM2954P 14808002
.OK      AIF   (&SUB EQ 1).SUBC                                @YM2954P 14828002
         AIF   ('&SYSLIST(3)' EQ '').USEDEFN                   @YM2954P 14848002
&LETTER  SETC  '&SYSLIST(3)'(&K,1)                             @YM2954P 14868002
&S       SETC  '&SYSLIST(3)'(1,&K-1)                           @YM2954P 14888002
         AGO   .SUBD                                           @YM2954P 14908002
.SUBC    ANOP                                                  @YM2954P 14928002
         AIF   ('&SYSLIST(&OP,3)' EQ '').USEDEFN               @YM2954P 14948002
&LETTER  SETC  '&SYSLIST(&OP,3)'(&K,1)                         @YM2954P 14968002
&S       SETC  '&SYSLIST(&OP,3)'(1,&K-1)                       @YM2954P 14988002
.SUBD    ANOP                                                  @YM2954P 15008002
&BYTESP  SETA  &S                                              @YM2954P 15028002
         AIF   ('&LETTER' EQ 'B').BOTH                         @YM2954P 15048002
         AIF   ('&LETTER' EQ 'L').LEFT                         @YM2954P 15068002
         AIF   ('&LETTER' EQ 'R').RIGHT                        @YM2954P 15088002
.ERR3    MNOTE '**PARAMETER 3 INCOMPLETE-DSGEN DEFINITION USED**'       15108002
         AGO   .USEDEFN                                        @YM2954P 15128002
.RIGHT   ANOP                                                  @YM2954P 15148002
&CODE    SETA  2                                               @YM2954P 15168002
         AGO   .L                                              @YM2954P 15188002
.LEFT    ANOP                                                  @YM2954P 15208002
&CODE    SETA  1                                               @YM2954P 15228002
         AGO   .L                                              @YM2954P 15248002
.USEDEFN ANOP                                                  @YM2954P 15268002
&BYTESP  SETA  &IBITS/8                                        @YM2954P 15288002
.BOTH    AIF   (&ISHIFT NE 0).ERR                              @YM2954P 15308002
&CODE    SETA  3                                               @YM2954P 15328002
&T       SETA  &BYTESP*2-1                                     @YM2954P 15348002
&S       SETC  '&T'                                            @YM2954P 15368002
.OK2     AIF   (&ISHIFT EQ 0).L                                @YM2954P 15388002
&CODE    SETA  2                                               @YM2954P 15408002
.L       ANOP                                                  @YM2954P 15428002
&B       SETB  1                                               @YM2954P 15448002
         AIF   (&SUB EQ 1).SUBE                                @YM2954P 15468002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                    @YM2954P 15488002
&K       SETA  K'&SYSLIST(2)                                   @YM2954P 15508002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                     @YM2954P 15528002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                       @YM2954P 15548002
         AGO   .SUBF                                           @YM2954P 15568002
.SUBE    ANOP                                                  @YM2954P 15588002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                @YM2954P 15608002
&K       SETA  K'&SYSLIST(&OP,2)                               @YM2954P 15628002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                 @YM2954P 15648002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                   @YM2954P 15668002
.SUBF    ANOP                                                  @YM2954P 15688002
.BACKUP  ANOP                                                  @YM2954P 15708002
&NRENTS  SETA  &NRENTS+1                                       @YM2954P 15728002
         AIF   (&BYTESP GT 0 AND &BYTESP LT 16).SUB0           @YM2954P 15748002
         MNOTE '**NO. OF BYTES OUTSIDE RANGE OF 1-15**'        @YM2954P 15768002
         MEXIT                                                 @YM2954P 15788002
.SUB0    AIF   (&SUB EQ 1).SUBG                                @YM2954P 15808002
         DC    AL.12(&SYSLIST(1)-&DSECT),XL.4'A'               @YM2954P 15828002
         AGO   .SUBH                                           @YM2954P 15848002
.SUBG    ANOP                                                  @YM2954P 15868002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'A'           @YM2954P 15888002
.SUBH    ANOP                                                  @YM2954P 15908002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'     @YM2954P 15928002
.OUT     ANOP                                                  @YM2954P 15948002
&NDX     SETA  0                                               @YM2954P 15968002
         AIF   (&SUB EQ 0).OUTA                                @YM2954P 15988002
         AIF   (&OP LT N'&SYSLIST).LOOP                        @YM2954P 16008002
.OUTA    ANOP                                                  @YM2954P 16028002
         MEND                                                  @YM2954P 16048002
         EJECT                                                          17061002
*  ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO* 17108002
         SPACE 2                                                        17155002
         MACRO                                                          17202002
&NAME    ROUTINE &LOGITEM,&RNAME                                        17249002
         GBLC  &DSECT,&CSECT                                            17296002
         GBLC  &ITEM(1500)                                              17343002
         GBLA  &SHIFT(1500),&ITEMNBR                                    17390002
         GBLA  &NRENTS                                                  17437002
         LCLA  &ISHIFT,&NDX                                             17484002
.LOOP    ANOP                                                           17531002
&NDX     SETA  &NDX+1                                                   17578002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      17625002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  17672002
         MNOTE *,'LOG ITEM NOT DEFINED'                                 17719002
         MEXIT                                                          17766002
.FOUND   ANOP                                                           17813002
&ISHIFT  SETA  &SHIFT(&NDX)                                             17860002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           17907002
         DC    AL.4(&ISHIFT),AL.12(&RNAME-&CSECT)                       17954002
&NRENTS  SETA  &NRENTS+1                                                18001002
         MEND                                                           18048002
         EJECT                                                          18095002
*  LABEL MACRO     LABEL MACRO     LABEL MACRO     LABEL MACRO        * 18142002
         SPACE 2                                                        18189002
         MACRO                                                          18236002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C18283002
               &LABEL7,&LABEL8                                          18330002
.*                            THIS MACRO ALLOWS UP TO ACHT LABELS TO    18377002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   18424002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  18471002
.*                                 TION MARKS. THE COLUMN AND LINE END  18518002
.*                                 CONTROLS WILL BE INSERTED BY THE     18565002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      18612002
.*                                 LABEL REQUIRED FOR RESPECTIVE        18659002
.*                                 COLUMN. THIS MACRO WILL ALSO ALERT   18706002
.*                                 THE PROGRAMMER TO EXACTLY WHERE THE  18753002
.*                                 TABLE MUST BE BROKEN IF NECESSARY    18800002
.*                                 TO AVOID EXCEEDING THE MAXIMUM LIMIT 18847002
         GBLC &LABELS(2000)                                             18894002
         GBLC  &LBL(100)                                                18941002
         GBLA  &LBLCTR(100)                                             18988002
         GBLA  &LABELNR                                                 19035002
         GBLA  &NRENTS,&LPTR                                            19082002
         LCLC  &MARGIN,&TACK                                            19129002
         LCLC  &TEXT                                                    19176002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            19223002
&MARGIN  SETC  '*'                                                      19270002
         AIF   ('&NAME' EQ '').LOOPOUT                                  19317002
&LPTR    SETA  &LPTR+1                                                  19364002
&LBL(&LPTR) SETC '&NAME'                                                19411002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          19458002
.LOOPOUT ANOP                                                           19505002
&OP      SETA  &OP+1                                                    19552002
&K       SETA  K'&SYSLIST(&OP)                                          19599002
         AIF (&K GE 2).NORM                                             19646002
&K       SETA  2                                                        19693002
.NORM    ANOP                                                           19740002
&START   SETA  2                                                        19787002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                19834002
&MARGIN  SETC  '$'                                                      19881002
.NOTLAST ANOP                                                           19928002
&NRCHAR  SETA  8                                                        19975002
&TACK    SETC  ''                                                       20022002
.LOOPIN  ANOP                                                           20069002
&REMAIN  SETA  &K-&START                                                20116002
         AIF (&REMAIN GE 8).MORE                                        20163002
&TACK    SETC  '&MARGIN'                                                20210002
&NRCHAR  SETA  &REMAIN                                                  20257002
.MORE    ANOP                                                           20304002
&TEXT    SETC  ''                                                       20351002
         AIF (&REMAIN EQ 0).ENDTEXT                                     20398002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          20445002
.ENDTEXT ANOP                                                           20492002
&LABELNR SETA  &LABELNR+1                                               20539002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  20586002
&START   SETA  &START+8                                                 20633002
         AIF ('&TACK' EQ '').LOOPIN                                     20680002
         AIF ('&TACK' EQ '*').LOOPOUT                                   20727002
         MEND                                                           20774002
         SPACE 2                                                        20821002
         MACRO                                                          20868002
         LSTART                                                         20915002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  20962002
.*                                 OF THE TABLE IS TO BEGIN.            21009002
         GBLC &LABELS(2000)                                             21056002
         GBLA  &LABELNR                                                 21103002
         GBLC  &LBL(100)                                                21150002
         GBLA  &LBLCTR(100)                                             21197002
         LCLA  &NDX,&CTR                                                21244002
         LINEND                                                         21291002
&CTR     SETA  1                                                        21338002
.LOOP    ANOP                                                           21385002
&NDX     SETA  &NDX+1                                                   21432002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            21479002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         21526002
&CTR     SETA  &CTR+1                                                   21573002
         AGO   .LOOPCTL                                                 21620002
.NOLBL   ANOP                                                           21667002
         DC    C'&LABELS(&NDX)'                                         21714002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  21761002
         MEND                                                           21808002
         SPACE 2                                                        21855002
         MACRO                                                          21902002
         LINEND                                                         21949002
.*                            THIS MACRO IS USED ONLY BY THE LINE       21996002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   22043002
.*                                 ASSOCIATED WITH EACH LINE.           22090002
         GBLA  &NRENTS                                                  22137002
         GBLC &NRENTSX                                                  22184002
         ORG   &NRENTSX                                                 22231002
         DC    FL1'&NRENTS'                                             22278002
         ORG                                                            22325002
&NRENTS  SETA  0                                                        22372002
B&SYSNDX EQU   *                                                        22419002
&NRENTSX SETC  'B&SYSNDX'                                               22466002
         MEND                                                           22513002
         SPACE 2                                                        22560002
         MACRO                                                          22607002
         PARITY &ENTRY,&REPEAT,&SPACES,&PBITS=,&DISP=,&OFFBYTE=         22654002
         GBLC  &ITEM(1500),&DSECT                                       22701002
         GBLA  &SHIFT(1500),&ITEMNBR                                    22748002
         LCLA  &IBITS,&NDX,&ISHIFT                                      22795002
         DC    AL4(&ENTRY)                                              22842002
         DC    AL1(&REPEAT)                                             22889002
         DC    AL1(&SPACES)                                             22936002
         AIF   ('&PBITS' EQ '').HARDCD                                  22983002
.LOOP    ANOP                                                           23030002
&NDX     SETA  &NDX+1                                                   23077002
         AIF   ('&ITEM(&NDX)' EQ '&PBITS').FOUND                        23124002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  23171002
         MNOTE *,'PARITY GROUP NOT FOUND'                               23218002
         MEXIT                                                          23265002
.FOUND   ANOP                                                           23312002
&ISHIFT  SETA  &SHIFT(&NDX)                                             23359002
         DC    AL.12(&PBITS-&DSECT),AL.4(&ISHIFT)                       23406002
         AGO   .OUT                                                     23453002
.HARDCD  ANOP                                                           23500002
&ISHIFT  SETA  &OFFBYTE                                                 23547002
         DC    AL.12(&DISP),AL.4(&ISHIFT)                               23594002
.OUT     ANOP                                                           23641002
         MEND                                                           23688002
         GBLC  &DSECT,&CSECT                                            23735002
&CSECT   SETC  'IFCEI145'                                               23782002
&DSECT   SETC  'CI145'                                                  23829002
IFCEI145 CSECT                                                          23876002
CI145    DSECT                                                          23923002
DUM      EQU   *                                                        23970002
         DSGEN (XKEY,8),(XRELN,8),(XSWS8,9),(SWS9,1),          @XL03976C24017002
               (SWS10,1),(XSWS11,1),                           @XL03976C24037002
               (XSWS12,1),(XSWS13,1),(XSWS14,1),(XSWS15,1)              24064002
         DSGEN (XDUM1,32)                                               24111002
         DSGEN (XDATE,32)                                               24158002
         DSGEN (XTIME,32)                                               24205002
         DSGEN (XDUM2,8),(XSER,24)                                      24252002
         DSGEN (XMOD,16),(MCEL,16)                                      24299002
         DSGEN (XJOBN,64)                                               24346002
         DSGEN (XAIO1,16),(XAIO2,16),(XAIO3,16),(XAIO4,16)              24393002
         DSGEN (XAIO5,16),(XAIO6,16),(XAIO7,16),(XAIO8,16)              24440002
         DSGEN (XFCCWCC,8),(XFCCWDA,24),(XFCCWFL,8),(XFCCW0,8),        C24487002
               (XFCCWCT,16)                                             24534002
         DSGEN (XCSWK,8),(XCSWCA,24)                                    24581002
         DSGEN (XCSWUS0,1),(XCSWUS1,1),(XCSWUS2,1),(XCSWUS3,1),        *24628002
               (XCSWUS4,1),(XCSWUS5,1),(XCSWUS6,1),(XCSWUS7,1),        *24675002
               (XCSWCS0,1),(XCSWCS1,1),(XCSWCS2,1),(XCSWCS3,1),        *24722002
               (XCSWCS4,1),(XCSWCS5,1),(XCSWCS6,1),(XCSWCS7,1),        *24769002
               (XCSWCT,16)                                              24816002
         DSGEN (XECSW,32)                                               24863002
         DSGEN (XDEVT1,16),(XDEVT2,16)                                  24910002
         DSGEN (XCHID,8),(XCUA,24)                                      24957002
         DSGEN (XMPIN,32),(HARDWARE,32)                                 25004002
         ORG   XMPIN                                           @YL02021 25014002
         DSGEN (VCUA,16),(VLGSZ,16),(HD,32)                    @YL02021 25024002
MPXCTREG DSGEN (MCHLOG00,1),(MCHLOG01,1),(MCHLOG02,1),(MCHLOG03,1),    X25051002
               (MCHLOG04,1),(MCHLOG05,1),(MCHLOG06,1),(MCHLOG07,1),    X25098002
               (MCHLOG08,8),(MCHLOG09,16)                               25145002
         DSGEN (MBSLOGA,16),(MBSLOG01,8),(DUMMY,8)                      25192002
         DSGEN (MCLOCREG,8),(CCWADDR,24)                                25239002
         DSGEN (MCHRG00,1),(MCHRG01,1),(MCHRG02,1),(MCHRG03,1),        X25286002
               (MCHRG04,1),(MCHRG05,1),(MCHRG06,1),(MCHRG07,1),        X25333002
               (MCHRG08,1),(MCHRG09,1),(MCHRG10,1),(MCHRG11,1),        X25380002
               (MCHRG12,1),(MCHRG13,1),(MCHRG14,1),(MCHRG15,1),        X25427002
               (MCHRG16,1),(MCHRG17,1),(MCHRG18,1),(MCHRG19,1),        X25474002
               (MCHRG20,1),(MCHRG21,1),(MCHRG22,1),(MCHRG23,1),        X25521002
               (MCHRG24,1),(MCHRG25,1),(MCHRG26,1),(MCHRG27,1),        X25568002
               (MCHRG28,1),(MCHRG29,1),(MCHRG30,1),(MCHRG31,1)          25615002
         DSGEN (MCHRGB00,1),(MCHRGB01,1),(MCHRGB02,1),(MCHRGB03,1),    X25662002
               (MCHRGB04,1),(MCHRGB05,1),(MCHRGB06,1),(MCHRGB07,1),    X25709002
               (MCHRGB08,1),(MCHRGB09,1),(MCHRGB10,1),(MCHRGB11,1),    X25756002
               (MCHRGB12,1),(MCHRGB13,1),(MCHRGB14,1),(MCHRGB15,1),    X25803002
               (MCHRGB16,1),(MCHRGB17,1),(MCHRGB18,1),(MCHRGB19,1),    X25850002
               (MCHRGB20,1),(MCHRGB21,1),(MCHRGB22,1),(MCHRGB23,1),    X25897002
               (MCHRGB24,1),(MCHRGB25,1),(MCHRGB26,1),(MCHRGB27,1),    X25944002
               (MCHRGB28,1),(MCHRGB29,1),(MCHRGB30,1),(MCHRGB31,1)      25991002
         DSGEN (MPXTAG00,1),(MPXTAG01,1),(MPXTAG02,1),(MPXTAG03,1),    X26038002
               (MPXTAG04,1),(MPXTAG05,1),(MPXTAG06,1),(MPXTAG07,1),    X26085002
               (MPXTAG08,1),(MPXTAG09,1),(MPXTAG10,1),(MPXTAG11,1),    X26132002
               (MPXTAG12,1),(MPXTAG13,1),(MPXTAG14,1),(MPXTAG15,1),    X26179002
               (MPXBUSIN,8),(MPXBSOUT,8)                                26226002
         DSGEN (CONSWDIN,8),                                           X26273001
               (CONSWD00,1),(CONSWD01,1),(CONSWD02,1),(CONSWD03,1),    X26320002
               (CONSWD04,1),(CONSWD05,1),(CONSWD06,1),(CONSWD07,1),    X26367002
               (CONSWD08,1),(CONSWD09,1),(CONSWD10,1),(CONSWD11,1),    X26414002
               (CONSWD12,1),(CONSWD13,1),(CONSWD14,1),(CONSWD15,1),    X26461001
               (CONSWOUT,8)                                             26481001
         DSGEN (MDUNUSED,16),(MDCATNBR,8),(,8)                          26508002
         DSGEN (MDREGADD,32,EQU,MDUNUSED)                               26555002
         DSGEN (LOCFLG00,1),(LOCFLG01,1),(LOCFLG02,1),(LOCFLG03,1),    X26602002
               (LOCFLG04,1),(LOCFLG05,1),(LOCFLG06,1),(LOCFLG07,1),    X26649002
               (CHSTAT00,1),(CHSTAT01,1),(CHSTAT02,1),(CHSTAT03,1),    X26696002
               (CHSTAT04,1),(CHSTAT05,1),(CHSTAT06,1),(CHSTAT07,1),    X26743002
               (STORCNTH,8),(STORCNTL,8)                                26790002
         DSGEN (IOCREG,32)                                     @XA21957 26837001
         DSGEN (RETCNTUN,4),(RETCNT2H,4),(RETUNUS,16),(NONRETRY,8)      26884002
         DSGEN (RTYREG1,32),(RTYREG2,32)                                26931002
         DSGEN (REGUNU,8),                                             X26978002
               (HREG0,1),(HREG1,1),(HREG2,1),(HREG3,1),(HREG4,1),      X27025002
               (HREG5,1),(HREG6,1),(HREG7,1),(RETRG23,16)               27072002
         DSGEN (RTYRG400,1),(RTYRG401,1),(RTYRG402,1),(RTYRG403,1),    X27119002
               (RTYRG404,1),(RTYRG405,1),(RTYRG406,1),(RTYRG407,1),    X27166002
               (RTYRG408,1),(RTYRG409,1),(RTYRG410,1),(RTYRG411,1),    X27213002
               (RTYRG412,1),(RTYRG413,1),(RTYRG414,1),(RTYRG415,1),    X27260002
               (RTUNSED,1),(RTYRG417,3),(RTYRG420,3),(RTYEXP,1),       C27307002
               (RTYUNSD,1),                                            C27327002
               (RTYRG425,3),(RTYRG428,3),(RTYNOTUS,1)                   27354002
         DSGEN (CTRLDWD,32)                                             27401002
         DSGEN (SYSREG00,1),(SYSREG01,1),(SYSREG02,1),(SYSREG03,1),    X27448002
               (SYSREG04,1),(SYSREG05,1),(SYSREG06,1),(SYSREG07,1),    X27495002
               (SYSREG08,1),(SYSREG09,1),(SYSREG10,1),(SYSREG11,1),    X27542002
               (SYSREG12,1),(SYSREG13,1),(SYSREG14,1),(SYSREG15,1),    X27589002
               (SYSREG16,1),(SYSREG17,1),(SYSREG18,1),(SYSREG19,1),    X27636002
               (SYSREG20,1),(SYSREG21,1),(SYSREG22,1),(SYSREG23,1),    X27683002
               (SYSREG24,1),(SYSREG25,1),(SYSREG26,1),(SYSREG27,1),    X27730002
               (SYSREG28,1),(SYSREG29,1),(SYSREG30,1),(SYSREG31,1)      27777002
         DSGEN (IREG,8),(IREGB,24)                                      27824002
         DSGEN (UREGA1,2),(UREGA2,2),(UREGA3,4),(UREGA4,4),(UREGA5,4), X27871002
               (UREGC1,8),(UREGC2,8)                                    27918002
         DSGEN (SPARES,32,0,4)                                 @YM2954P 27922002
         DSGEN (VCCHPR0,1,1,9),(VCCHPR,1,10,16)                @YM2954P 27923002
         DSGEN (VCCHPR1,16,EQU,VCCHPR01)                       @YM2954P 27924002
         DSGEN (VDUM,24),(VFLAG,8),(VNOPRO,16)                 @YM2954P 27925002
         DSGEN (VPROC01,16),(VCHST01,16),(VPROC02,16),(VCHST02,16),    X27926002
               (VPROC03,16),(VCHST03,16),(VPROC04,16),(VCHST04,16),    X27930002
               (VPROC05,16),(VCHST05,16),(VPROC06,16),(VCHST06,16),    X27934002
               (VPROC07,16),(VCHST07,16),(VPROC08,16),(VCHST08,16),    X27938002
               (VPROC09,16),(VCHST09,16),(VPROC10,16),(VCHST10,16),    X27942002
               (VPROC11,16),(VCHST11,16),(VPROC12,16),(VCHST12,16),    X27946002
               (VPROC13,16),(VCHST13,16),(VPROC14,16),(VCHST14,16),    X27950002
               (VPROC15,16),(VCHST15,16),(VPROC16,16),(VCHST16,16)      27954002
         EJECT                                                          28200002
*                                                                       28247002
IFCEP000 DSECT                                                          28294002
         DS    CL6                                                      28341002
         DS    CL1                                                      28388002
         DS    CL1                                                      28435002
XPRTBUF  DS    15CL8                                                    28482002
         DS    5CL8                                                     28529002
         DS    3CL8                                                     28576002
         DS    CL8                                                      28623002
XSWITCH  DS    CL4                                                      28670002
*                                                                       28717002
*      ROUTINE BRANCH TABLE                                             28764002
*                                                                       28811002
         DS    CL112                                                    28858002
*                                                                       28905002
*      LOAD MODULE ENTRYPOINT NAMES                                     28952002
*                                                                       28999002
         DS    CL56                                                     29046002
*                                                                       29093002
*      READ/WRITE BUFFER                                                29140002
*                                                                       29187002
XMCH     DC    XL2'00'                                                  29234002
XCNTBUF  DS    CL8                                                      29281002
XKEYBUF  DS    CL2                                                      29328002
XDADBUF  DS    197CL8                                                   29375002
XDUMMY   DS    CL1                                                      29422002
         SPACE 3                                                        29469002
ERPIB    DSECT                                                    19032 29516002
SOFWFLGS DS    CL1                 PROGRAM FLAGS FIELD IN ERPIB   19032 29563002
PROBERR  DS    CL1                 PROBABLE SOURCE OF ERROR FIELD 19032 29610002
VALFLAGS DS    CL1                 VALIDITY FLAGS FIELD           19032 29657002
CMPLBITS DS    CL1                 TERM AND RETRY CODES FIELD     19032 29704002
MPINFOFD DS    CL2                 MULTI-PROCESSING INFO FIELD    19032 29751002
CHSMS    DS    CL2                 CHANNEL STATUS FIELD           19032 29798002
         EJECT                                                          29845002
IFCEI145 CSECT                                                          29892002
ENTRYPTR DC    A(FORMAT1)                                               29939002
TABLNAME DC    CL8'IFCEI145'                                            29986002
REG9     DS    F                                                        30033002
LP       DS    F                                                        30080002
         SPACE 2                                                        30127002
SKIPPER  EQU   *                                                        30174002
         BR    14                                                       30221002
R0       EQU   0                                                        30268002
R1       EQU   1                                                        30315002
R2       EQU   2                                                        30362002
R3       EQU   3                                                        30409002
R4       EQU   4                                                        30456002
R5       EQU   5                                                        30503002
R6       EQU   6                                                        30550002
R7       EQU   7                                                        30597002
R8       EQU   8                                                        30644002
R9       EQU   9                                                        30691002
R10      EQU   10                                                       30738002
R11      EQU   11                                                       30785002
R12      EQU   12                                                       30832002
R13      EQU   13                                                       30879002
R14      EQU   14                                                       30926002
R15      EQU   15                                                       30973002
****    ADDRESS EQUATES                                                 31020002
AD0      EQU   0                                                        31067002
AD1      EQU   1                                                        31114002
***   LENGTH EQUATES                                                    31161002
L0       EQU   0                                                        31208002
L1       EQU   1                                                        31255002
L2       EQU   2                                                        31302002
L3       EQU   3                                                        31349002
L4       EQU   4                                                        31396002
L5       EQU   5                                                        31443002
L6       EQU   6                                                        31490002
L7       EQU   7                                                        31537002
L8       EQU   8                                                        31584002
L10      EQU   10                                                       31631002
L12      EQU   12                                                       31678002
L14      EQU   14                                                       31725002
L16      EQU   16                                                       31772002
L19      EQU   19                                                       31819002
L24      EQU   24                                                       31866002
L26      EQU   26                                              @XA19715 31886001
L32      EQU   32                                                       31913002
L60      EQU   60                                                       31960002
***   CONDITION CODE EQUATES                                            32007002
CC2      EQU   2                                                        32054002
CC4      EQU   4                                                        32101002
****    NUMERICAL EQUATES                                               32148002
X09      EQU   X'09'                                                    32195002
H01      EQU   X'01'                                           @YL02021 32205002
H21      EQU   X'21'                                           @YL02021 32215002
HEXBF    EQU   X'BF'                                                    32242002
HEX48    EQU   X'48'                                                    32289002
HEX02    EQU   X'02'                                                    32336002
HEX04    EQU   X'04'                                                    32383002
HEX08    EQU   X'08'                                                    32430002
HEX10    EQU   X'10'                                                    32477002
HEX20    EQU   X'20'                                                    32524002
HEX40    EQU   X'40'                                                    32571002
HEX00    EQU   X'00'                                                    32618002
DIV1     EQU   X'0A'                                                    32665002
DIV2     EQU   X'0C'                                                    32712002
K1       EQU   1                                                        32759002
         USING IFCEI145,R9,R6                                           32806002
         USING CI145,R2                                        @YM2954P 32826002
*                                                                     * 32853002
* IN CASE OF A INTERFACE CONTROL CHECK THE CATALOG NUMBER IS PUT      * 32900002
* OUT ON THE PRINTOUT BUT IT IS NOT VALID FOR OTHER TYPES OF ERRORS   * 32947002
* AND IS BLANKED OUT                                                  * 32994002
*                                                                     * 33041002
NEWENT   DC    A(SHRTENT-4)                                             33088002
NEWLAB   DC    A(SHRTLAB)                                               33135002
BASE2    DC    A(IFCEI145+4096)                                         33182002
CATNBR   STM   R5,R6,XSAVE        SAVE REGISTERS                        33229002
         L     R6,BASE2           SET ADDRESSABILITY FOR DUMPSIZE       33276002
         LR    R5,R3              GET POINTER TO LINE POSITION          33323002
         TM    L0(R4),X'02'        IS THIS INTERFACE CONTROL CHECK      33370002
         BC    8,BLANK            NO IT IS NOT                          33417002
         MVI   DUMPSIZE+1,X'7C'         SHORT RECORD           @YM2954P 33464002
         CLI   XKEY,H21                 VS2 RELEASE (MVM)      @YM2954P 33473002
         BNE   SHORTVS2                 NO                     @YM2954P 33482002
         MVI   DUMPSIZE+1,X'C4'         SHORT VS2 RECORD SIZE  @YM2954P 33491002
SHORTVS2 EQU   *                                               @YM2954P 33500002
         SH    R5,EIGHT0          POINT TO LABEL POSITION               33511002
         MVC   L0(L14,R5),CATLBL  MOVE IN LABEL                         33558002
         LM    R5,R6,XSAVE        RESTORE REGISTERS                     33605002
         BR    R14                                                      33652002
BLANK    MVI   DUMPSIZE+1,X'B4'   PUT SIZE OF RECORD FOR HEX DUMP       33699002
         CLI   XKEY,H21                 VS2 RELEASE (MVM)      @YM2954P 33708002
         BNE   LONGVS2                  NO                     @YM2954P 33717002
         MVI   DUMPSIZE+1,X'FC'         LONG  VS2 RECORD SIZE  @YM2954P 33726002
LONGVS2  EQU   *                                               @YM2954P 33735002
         SH    R5,SIX2            POINT TO CATALOG NUMBER               33746002
         MVI   L0(R5),X'40'       PUT IN BLANK                          33793002
         MVI   L1(R5),X'40'       PUT IN BLANK                          33840002
         LM    R5,R6,XSAVE        RESTORE REGISTERS                     33887002
         BR    R14                                                      33934002
CATLBL   DC    C'CATALOG NUMBER'                                        33981002
SIX2     DC    H'62'                                                    34028002
EIGHT0   DC    H'80'                                                    34075002
************************************************************** @XA19715 34075501
* PRINT THE CURRENT LINE IF THIS IS A 148 CONSOLE (3148) CCH RECORD   * 34076001
************************************************************** @XA19715 34076501
PRT3148  TM    21(R2),X'48'             IS THIS A 148 CPU      @XA19715 34077001
         BO    CK3148                   YES                    @XA19715 34077501
         B     NOPRT                    NO, DO NOT PRINT LINE  @XA19715 34078001
CK3148   CLC   XDEVT2(L2),DEV3148       3148 CONSOLE CCH ?     @XA19715 34078501
         BCR   8,R14                    YES, PRINT THIS LINE   @XA19715 34079001
         B     NOPRT                    NO, DO NOT PRINT LINE  @XA19715 34079501
************************************************************** @XA19715 34080001
* PRINT THE CURRENT LINE IF THIS IS A 148 CCH RECORD           @XA19715 34080501
************************************************************** @XA19715 34081001
PRT148   TM    21(R2),X'48'             IS THIS A 148 CPU      @XA19715 34081501
         BOR   R14                      YES                    @XA19715 34082001
         B     NOPRT                    NO, DO NOT PRINT LINE  @XA19715 34082501
************************************************************** @XA19715 34083001
* PRINT THE CURRENT LINE IF THIS IS NOT A 148 CONSOLE (3148) CCH RECD * 34083501
************************************************************** @XA19715 34084001
NPRT3148 TM    21(R2),X'48'             IS THIS A 148 CPU      @XA19715 34084501
         BCR   14,R14                   NO, SO PRINT THIS LINE @XA19715 34085001
         CLC   XDEVT2(L2),DEV3148       3148 CONSOLE CCH ?     @XA19715 34085501
         BCR   7,R14                    NO, SO PRINT THIS LINE @XA19715 34086001
         B     NOPRT                    YES, DO NOT PRINT LINE @XA19715 34086501
DEV3148  DC    X'100F'                                         @XA19715 34087001
************************************************************** @XA19715 34087501
* PRINT THE CURRENT LINE IF THIS IS NOT A 148 CCH RECD         @XA19715 34088001
************************************************************** @XA19715 34088501
NPRT148  TM    21(R2),X'48'             IS THIS A 148 CPU      @XA19715 34089001
         BNOR  R14                      NO, SO PRINT THIS LINE @XA19715 34089501
         B     NOPRT                    YES, DO NOT PRINT LINE @XA19715 34090001
************************************************************** @XA19715 34090501
* SKIP OVER FORMATTING 145 TA/TT BYTES IF CURR. RECD IS 148    @XA19715 34091001
************************************************************** @XA19715 34091501
TEST148  TM    21(R2),X'48'             IS THIS A 148 CPU      @XA19715 34092001
         BCR   14,R14                   NO, EXIT               @XA19715 34092501
         CLC   XDEVT2(L2),DEV3148       3148 CONSOLE CCH ?     @XA19715 34093001
         BCR   7,R14                    NO, EXIT               @XA19715 34093501
         MVC   REG9(8),SKIP148          YES, UPDATE L/L PTRS   @XA19715 34094001
         B     NOPRT                    DO NOT PRINT THIS LINE @XA19715 34094501
SKIP148  DC    A(LINE148-4)                                    @XA19715 34095001
         DC    A(LAB148)                                       @XA19715 34095501
************************************************************** @XA19715 34096001
* SKIP OVER FORMATTING 148 TA/TT BYTES BECAUSE CURRENT RECD IS 145    * 34096501
************************************************************** @XA19715 34097001
JUMPN148 MVC   REG9(8),SKIPN148         UPDATE LINE/LABEL PTRS @XA19715 34097501
         SR    R15,R15                  DO NOT PRINT THIS LINE @XA19715 34098001
         BR    R14                      EXIT                   @XA19715 34098501
SKIPN148 DC    A(VS2LINE-4)                                    @XA19715 34099001
         DC    A(LABN148)                                      @XA19715 34099501
************************************************************** @XA19715 34100001
* DETERMINE THE PROPER LABEL FOR BITS 0,1 OF THE 148 TT BYTE   @XA19715 34100501
* BIT 0 1  REQUIRED LABEL                                      @XA19715 34101001
*     0 0  DISPLAY                                             @XA19715 34101501
*     0 1  3286                                                @XA19715 34102001
*     1 0  3203 NO. 1                                          @XA19715 34102501
*     1 1  3203 NO. 2                                          @XA19715 34103001
************************************************************** @XA19715 34103501
EXTPTR   STM   R5,R8,XSAVE              SAVE THE WORK REGS     @XA19715 34104001
         LR    R5,R3                    GET PTR TO POS IN BUFR @XA19715 34104501
         S     R5,TWOFIVE               BACK UP BUFR PTR       @XA19715 34105001
         TM    CONSWD08,X'C0'           CHK EXTN PTR BITS      @XA19715 34105501
         BZ    DISP00                   DISPLAY INDICATED      @XA19715 34106001
         BO    N320311                  3203 NO. 2 INDICATED   @XA19715 34106501
         TM    CONSWD08,X'80'           CHECK BIT              @XA19715 34107001
         BO    N320310                  3203 NO. 1 INDICATED   @XA19715 34107501
         MVC   L0(L26,R5),LAB3286       MOVE IN 3286 LABEL     @XA19715 34108001
         B     RETURN                   EXIT                   @XA19715 34108501
DISP00   MVC   L0(L26,R5),LABDISP       MOVE IN DISPLAY LABEL  @XA19715 34109001
         B     RETURN                   EXIT                   @XA19715 34109501
N320311  MVC   L0(L26,R5),LAB32032      MOVE IN 3203 NO. 2 LAB @XA19715 34110001
         B     RETURN                   EXIT                   @XA19715 34110501
N320310  MVC   L0(L26,R5),LAB32031      MOVE IN 3203 NO. 1 LAB @XA19715 34111001
         B     RETURN                   EXIT                   @XA19715 34111501
TWOFIVE  DC    F'25'                                           @XA19715 34112001
LAB32031 DC    C'EXT PTR (3203 NO. 1)    10'                   @XA19715 34112501
LAB32032 DC    C'EXT PTR (3203 NO. 2)    11'                   @XA19715 34113001
LABDISP  DC    C'EXT PTR (DISPLAY)       00'                   @XA19715 34113501
LAB3286  DC    C'EXT PTR (3286)          01'                   @XA19715 34114001
*                                                                     * 34122002
*                                                                     * 34169002
* IN CASE OF AN INTERFACE CONTROL CHECK ONLY NINE WORDS OF LOGOUT ARE * 34216002
* VALID AND THE REST HAS TO BE SKIPPED OVER.                            34263002
*                                                                     * 34310002
WHERETO  TM    L0(R4),X'02'       IS THIS INTERFACE CONTROL CHECK       34357002
         BCR   8,R14              NO RETURN                             34404002
         ST    R7,XSAVE           SAVE REGISTER                         34451002
         L     R7,NEWENT          GET NEW ENTRY POINTER                 34498002
         ST    R7,REG9                                                  34545002
         L     R7,NEWLAB          GET NEW LABEL POINTER                 34592002
         ST    R7,LP                                                    34639002
         L     R7,XSAVE           RELOAD THE REGISTER                   34686002
         B     NOPRT              GO TO SET REG FOR NO PRINT            34733002
SETSOURC STM   R5,R8,XSAVE              SAVE REGS                       34780002
         XC    NOPRO(4),NOPRO           CLEAR                  @YM2954P 34800002
         MVC   L0(L3,R3),CCCH           MOVE CHANNEL RECORD             34827002
         CLI   L0(R4),HEX20             TEST REC SOURCE                 34874002
         BE    RETURN                                                   34921002
         CLI   L0(R4),H21               TEST SOURCE            @YM2954P 34931002
         BE    RETURN                   CCH VS2(MVM)           @YM2954P 34941002
         MVC   L0(L3,R3),MCHH           MOVE MCH RECORD                 34968002
         B     RETURN                   RETURN                          35015002
*                                                                       35062002
CONVREL  STM   R5,R8,XSAVE              SAVE WORK REGS         @XL03976 35064002
         SR    R6,R6                    CLEAR                  @XL03976 35066002
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        35068002
         SRDL  R6,L5                    SHIFT REL NO. TO R7    @XL03976 35070002
         SLL   R6,L2                    MULTIPLY SYS VALUE BY 4         35072002
         L     R8,LP                    PICK UP LABEL PTR      @XL03976 35074002
         LA    R6,RELTAB(R6)            INDEX INTO SYS TABLE   @XL03976 35076002
         MVC   L0(L4,R8),L0(R6)         MOVE SYS LABEL         @XL03976 35078002
         SR    R6,R6                    CLEAR                  @XL03976 35080002
         SLDL  R6,L5                    RETREIVE REL NO.       @XL03976 35082002
         LTR   R6,R6                    IS IT ZERO             @XL03976 35084002
         BZ    NOREL                                           @XL03976 35086002
         CVD   R6,XWORK                 CONVERT IT                      35088002
         UNPK  L0(L2,R3),XWORK+L6(L2)   INPACK REL. NO.        @YM4854P 35090002
         MVZ   L1(L1,R3),L0(R3)         MOVE PROPER ZONE       @XL03976 35092002
         B     RETURN                   RETURN                 @XL03976 35094002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL.  @XL03976 35096002
         B     RETURN                   RETURN                 @XL03976 35098002
*                                                                       35109002
SETPGMN  MVC   L0(L8,R3),L0(R4)         MOVE 8 CHAR NAME TO BUFF        35156002
         BR    R14                                                      35203002
*                                                                       35250002
SPACER2  LA    R3,L2(R3)                BUMP R3 PTR BY 2                35297002
         BR    R14                                                      35344002
*                                                                       35391002
SETHEX   STM   R5,R8,XSAVE              SAVE REGS                       35438002
         LA    R8,CHARS                 CHAR TABLE PTR                  35485002
         IC    R7,L0(R4)                PICK UP CHAR                    35532002
         SLL   R7,L24                   MOVE IT TO HI POS               35579002
         SR    R6,R6                                                    35626002
         SLDL  R6,L4                    MOVE 4 BITS TO R6               35673002
         AR    R6,R8                    INDEX FOR CHARS                 35720002
         MVC   L0(L1,R3),L0(R6)         MOVE CHAR TO BUFF               35767002
         SR    R6,R6                                                    35814002
         SLDL  R6,L4                    MOVE LAST 4 BITS TO R6          35861002
         AR    R6,R8                    INDEX INTO TABLE                35908002
         MVC   L1(L1,R3),L0(R6)         MOVE CHAR                       35955002
         B     RETURN                                                   36002002
*                                                                       36049002
*                                                                       36096002
*                                                                       36143002
*                              SET ACTIVE  I/O UNITS                    36190002
SETAIO   STM   R5,R8,XSAVE              SAVE REGS                       36237002
         LR    R5,R3                    SET R5 TO BUFFER                36284002
         SH    R5,H44                   POINT R5 TO BEGGIN OF DATA      36331002
         SR    R7,R7                                                    36378002
         LA    R6,L8                    LOOP COUNT                      36425002
SETAIOLP CLC   L0(L4,R5),CZEROS         TEST FOR ALL ZEROS              36472002
         BE    BLANKOUT                 BE-TO BLANK OUT ZEROS           36519002
SETAIOL1 LA    R5,L5(R5)                BUMP COUNT                      36566002
         BCT   R6,SETAIOLP              LOOP TILL 8 TESTS               36613002
         CH    R7,H8                    ARE ALL ACTIVE IO ZERO          36660002
         BNE   RETURN                   NO RETURN                       36707002
         LR    R5,R3                    YES                             36754002
         SH    R5,H44                   PUT IN NONE                     36801002
         MVC   L0(L4,R5),NONE           INTO PRINT BUFF                 36848002
         B     RETURN                                                   36895002
BLANKOUT MVC   L0(L4,R5),BLANKS         MOVE IN BLANKS                  36942002
         LA    R7,L1(R7)                COUNT # OF ZERO FLDS            36989002
         B     SETAIOL1                 LOOP                            37036002
RETURN   LM    R5,R8,XSAVE                                              37083002
         BR    R14                                                      37130002
*                                                                       37177002
*                                                                       37224002
CHKSW9   TM    L1(R4),HEX40             TEST SWITCHES                   37271002
CHECKCC  BZ    NOPRT                    IF SWITCHES OFF                 37318002
         BR    R14                      DONOT PRINT                     37365002
CHKSW10  TM    L1(R4),HEX20             R15 RETURNED ZERO               37412002
         B     CHECKCC                  STOPS PRINTING                  37459002
CHKSW11  TM    L1(R4),HEX10                                             37506002
         B     CHECKCC                                                  37553002
CHKSW12  TM    L1(R4),HEX08                                             37600002
         B     CHECKCC                                                  37647002
CHKSW13  TM    L1(R4),HEX04                                             37694002
         B     CHECKCC                                                  37741002
CHKSW14  TM    L1(R4),HEX02                                             37788002
         B     CHECKCC                                                  37835002
NOPRT    SR    R15,R15                                                  37882002
         BR    R14                                                      37929002
*                                                                       37976002
SETDATE  UNPK  XWORK(L8),L0(L4,R4)      UNPACL DATE                     38023002
         MVZ   XWORK+L7(L1),XWORK       SET ZONE                        38070002
         MVC   L0(L3,R3),XWORK+L5       MOVE DAY                        38117002
         MVC  L6(L2,R3),XWORK+L3                                        38164002
         BR    R14                      RETURN                          38211002
*                                                                       38258002
CONVTIME EQU   *                                               @YM2954P 38305002
RETURNB  BR    R14                      RETURN                          38540002
*                                                                       38587002
ISITVS2  STM   R5,R8,XSAVE             SAVE REGS               @YL02021 38641002
         CLI   XKEY,H21                TEST FOR VS2            @YL02021 38648002
         BE    RETURN                  NOT VS2                 @YL02021 38655002
         SR    R15,R15                 ELIM. LABEL             @YL02021 38662002
         B     RETURN                                          @YL02021 38669002
VS2TEST  STM   R5,R8,XSAVE             SAVE REGS               @YM2954P 38681002
         CLI   XKEY,H21                IS IT VS2               @YM2954P 38741002
         BNE   COMPL                    SET UP FOR DUMP AND RET         38801002
         MVC   LOGSIZA(L2),VLGSZ        GET LOG SIZE           @YM2954P 38861002
         LA    R5,HARDWARE              START OF LOG            YM5678P 38921002
         A     R5,LOGSIZE               ADD SIZE OF LOG                 38981002
         LA    R6,VCCHPR1               START OF VS2 DATA               39041002
         LA    R7,L72                   LENGTH OF VS2 DATA-MAX @YM2954P 39101002
NXTBYT   IC    R8,L0(R7,R5)             MOVE DATA              @YM2954P 39161002
         STC   R8,L0(R7,R6)              BYTE BY BYTE          @YM2954P 39221002
         BCT   R7,NXTBYT                NEXT                   @YM2954P 39281002
         B     RETURN                                          @YM2954P 39341002
PROC     STM   R5,R8,XSAVE             SAVE REGS               @YM2954P 39401002
         SR    R5,R5                   CLEAR REG 5             @YM2954P 39461002
         L     R5,NOPRO                PLACE THE NO. OF PROC. IN REG 5  39521002
         LA    R5,1(R5)                ADD ONE TO REG. 5       @YM2954P 39581002
         ST    R5,NOPRO                PLACE BACK IN CORE      @YM2954P 39641002
         CLC   VNOPRO(2),NOPRO+2       COMP. WITH ACTUAL NO. OF PROC.   39701002
         BL    COMPLETE                FINISHED                @YM2954P 39761002
         LR    R5,R3                                           @YM2954P 39821002
         LA    R6,L47                   ADJUST OFFSET          @YM2954P 39881002
         SR    R5,R6                                           @YM2954P 39941002
         MVC   L0(L17,R5),MSGAA                                @YM2954P 40001002
         MVC   L27(L16,R5),MSGBA                               @YM2954P 40061002
PROCBIN  LH    R4,L0(R4)           FETCH DATA                  @YM2954P 40121002
         SLL   R4,L15                   POSITION DATA          @YM2954P 40181002
         LA    R6,L46              LENGTH OF LABEL             @YM2954P 40241002
         AR    R5,R6               SET UP POINTER              @YM2954P 40301002
         LA    R6,L16                   CHANGE COUNT           @YM2954P 40361002
TESTIT   SLL   R4,L1                    POSITION CHANNEL IND   @YM2954P 40421002
         LTR   R4,R4                    TEST FOR ON LINE       @YM2954P 40481002
         BNM   CHANACT                  BRANCH ON LINE         @YM2954P 40541002
PRINT    LA    R5,L3(R5)                UPDATE PRINT POINTER   @YM4854P 40601002
         BCT   R6,TESTIT           NEXT CHANNEL                @YM2954P 40661002
         B     RETURN                                          @YM2954P 40721002
CHANACT  MVI   L0(R5),C'X'         MOVE X TO PRINT             @YM2954P 40781002
         B     PRINT                    NEXT CHANNEL           @YM2954P 40841002
COMPLETE LA    R5,HARDWARE              START OF LOG            YM5678P 40901002
         A     R5,LOGSIZE               ADD SIZE OF LOG                 40961002
         LA    R6,VCCHPR1               START OF VS2 DATA               41021002
         LA    R7,L72                   LENGTH OF VS2 DATA-MAX @YM2954P 41081002
         SR    R4,R4                    CLEAR                  @YM4854P 41141002
NXTBYTE  IC    R8,L0(R4,R6)             MOVE DATA              @YM4854P 41171002
         STC   R8,L0(R4,R5)              BYTE BY BYTE          @YM4854P 41201002
         LA    R4,L1(R4)                UPDATE                 @YM4854P 41231002
         BCT   R7,NXTBYTE               NEXT                   @YM2954P 41261002
COMPL    L     R5,DUMP                  LOAD ADDR OF DUMP AREA @YM2954P 41321002
         ST    R5,REG9                                         @YM2954P 41381002
         SR    R15,R15                  BLANK LABEL            @YM4854P 41411002
         B     RETURN                                          @YM2954P 41441002
NOPRO    DC    F'00'                                           @YM2954P 41501002
LOGSIZE  DC    F'0'                                            @YM2954P 41561002
LOGSIZA  EQU   LOGSIZE+2                                       @YM2954P 41621002
MSGAA    DC    C'PROCESSOR ADDRESS'                            @YM2954P 41681002
MSGBA    DC    C'CHANNELS ON LINE'                             @YM2954P 41741002
DUMP     DC    A(DUMPCODE-4)                                   @YM2954P 41801002
NOLOG    STM   R4,R7,ZSAVE              SAVE REGS              @YM2954P 41861002
         L     R6,BASE2                 SECOND BASE REG        @YM2954P 41921002
         SH    R4,HTWO                  BACK UP TO REC SIZE    @YM2954P 41981002
         CLI   XKEY,H21                VS2 RELEASE (MVM)       @YM2954P 42041002
         BE    CHKLOG                   YES                    @YM2954P 42101002
         CLC   HDRCNT(L2),L0(R4)        TEST SIZE              @YM2954P 42161002
         BL    NOPRINT                  LOG PRISENT            @YM2954P 42221002
         MVI   DUMPSIZE+1,X'54'         NO LOG RECORD SIZE     @YM2954P 42281002
BYPASLOG L     R5,NOLOGPTR              SET UP                 @YM2954P 42341002
         ST    R5,REG9                   TO                    @YM2954P 42401002
         L     R5,NOLOGLAB                BYPASS               @YM2954P 42461002
         ST    R5,LP                       LOG                 @YM2954P 42521002
         MVC   L0(L27,R3),NOLOGMSG      NO-LOGOUT MESSAGE      @YM4854P 42551002
RESTORE  LM    R4,R7,ZSAVE              RESTORE REGS           @YM2954P 42581002
         BR    R14                                             @YM2954P 42641002
NOPRINT  SR    R15,R15                  BLANK LABEL            @YM2954P 42701002
         B     RESTORE                                         @YM2954P 42761002
CHKLOG   CLC   HDRCNT2(L2),L0(R4)       TEST SIZE              @YM2954P 42821002
         BL    NOPRINT                  LOG PRESENT            @YM2954P 42881002
         MVI   DUMPSIZE+1,X'9C'         NO LOG SIZE            @YM2954P 42941002
         B     BYPASLOG                BYPASS LOG DATA         @YM2954P 43001002
SELCHAN  STM   R4,R7,ZSAVE                                              43710002
         CLI   AD0(R4),K1         TEST FO SEL OR OTHER LOG              43757002
         BE    MPXROUT                                                  43804002
         LA    R5,NXTBL-L4         NEXT TABLE ADDRESS                   43851002
         L     R15,RG9PTR                                               43898002
         ST    R5,0(R15)           STORE INTO R9 POINTER                43945002
         SR    R15,R15                                                  43992002
MPXROUT  LM    R4,R7,ZSAVE                                              44039002
         BR    R14                                                      44086002
ZSAVE    DS    4F                                                       44133002
HDRCNT   DC    XL2'60'                                         @YM2954P 44180002
HDRCNT2  DC    XL2'A0'                                         @YM2954P 44190002
L15      EQU   15                                              @YM2954P 44200002
L17      EQU   17                                              @YM2954P 44210002
L25      EQU   25                                              @YM2954P 44220002
L27      EQU   27                                              @YM2954P 44230002
L46      EQU   46                                              @YM2954P 44240002
L47      EQU   47                                              @YM2954P 44250002
L66      EQU   66                                              @YM2954P 44260002
L72      EQU   72                                              @YM2954P 44270002
HTWO     DC    H'2'                                                     44321002
XWORK    DS    D                                                        44368002
XSAVE    DS    4F                                                       44415002
H8       DC    H'8'                                            @YM2954P 44462002
H44      DC    H'44'                                           @YM2954P 44862002
NXTBL    DC    X'FE'                                                    45402002
         DC    CL8'IFCEJ145'                                            45449002
CHARS    DC    C'0123456789ABCDEF'                                      45496002
NONE     DC    C'NONE'                                                  45543002
CZEROS   DC    C'0000'                                                  45590002
BLANKS   DC    C'    '                                                  45637002
CCCH     DC    CL3'CCH'                                                 45684002
MCHH     DC    CL3'MCH'                                                 45731002
ONE      DC    F'1'                                                     45778002
VS2FLG   DC    X'00'                                           @YL02021 45798002
CHNTYPE  MVC   AD1(L7,R3),MSGA          MOVE UNKOWN TYPE MSG   @XA19715 45799001
         CLI   AD0(R4),KA               COMPARE CCH TYPE TO 0A @XA19715 45800001
         BCR   CC2,R14                  EXIT IF CHAN TYPE HIGH @XA19715 45801001
         BL    CHNTYPE0                 CHAN TYPE LESS THAN 0A @XA19715 45802001
CHANTYPF MVC   AD1(L16,R3),MSGF         MOVE IN MSG F          @XA19715 45803001
         BR    R14                      EXIT                   @XA19715 45804001
CHNTYPE0 CLI   AD0(R4),K2               COMPARE CCH TYPE TO 02 @XA19715 45805001
         BH    CHNTYPE3                 CCH TYPE MORE THAN 02  @XA19715 45806001
         BL    CHNTYPE1                 CONTINUE CHECK         @XA19715 45807001
         MVC   AD1(L10,R3),MSGD         MOVE IN MSG D          @XA19715 45808001
         BR    R14                      EXIT                   @XA19715 45809001
CHNTYPE3 MVC   AD1(L14,R3),MSGB         MOVE IN MSG B          @XA19715 45810001
         BR    R14                      EXIT                   @XA19715 45811001
CHNTYPE1 CLI   AD0(R4),K1               COMPARE CCH TO A 01    @XA19715 45812001
         BCR   CC4,R14                  EXIT IF CCH IS LOW     @XA19715 45813001
         MVC   AD1(L10,R3),MSGC         MOVE IN MSG C          @XA19715 45814001
         BR    R14                      EXIT                   @XA19715 45815001
KA       EQU   X'0A'                                           @XA19715 45816001
MSGA     DC    C'UNKNOWN'                                      @XA19715 45817001
MSGB     DC    C'INTGTD BLK MPX'                               @XA19715 45818001
MSGC     DC    C'INTGTD MPX'                                   @XA19715 45819001
MSGD     DC    C'INTGTD SEL'                                   @XA19715 45820001
MSGF     DC    C'INTGTD FILE ADPT'                             @XA19715 45821001
         DROP  R6                                              @XA19715 45822001
         EJECT                                                          45825002
IFCASR01 DS    0H                                                       45872002
         USING *,R15                                                    45919002
         STM   R14,R12,12(R13)          SAVE REGISTERS                  45966002
         CLI   XKEY,H21                                        @YL02021 46013002
         BNE   CONTIN                                          @YL02021 46023002
         OI    VS2FLG,H01                                      @YL02021 46033002
CONTIN   ST    R13,SVR13               SAVE REG 13             @YL02021 46043002
         L     R11,NXENTRY              LOAD SUBROUTINE RETURN ADR      46060002
         LTR   R11,R11                  TEST FOR INITIAL ENTRY          46107002
         BZ    IFCASR02                 BRANCH IF 0-INITIAL ENTRY       46154002
         LM    R12,R10,MYSAVE           RELOAD SUBROUTINE REGS          46201002
         BR    R11                      CONTINUE PROCESSING             46248002
IFCASR02 DS    0H                                                       46295002
         SH    R3,TWOX                  SUBTRACT 2 FROM PRNT BFR ADR    46342002
         MVC   L0(L1,R3),L1(R3)         MOVE PRINTER CNTRL CHAR         46389002
         LA    R3,L1(R3)                INCREMENT PRNT BFR ADR          46436002
         USING XDADBUF,R4                                               46483002
         USING XPRTBUF,R3                                               46530002
NEWMOVE  CLI   XKEYBUF+1,REL19          RELEASE 19                19E03 46577002
         BE    NEWMOVE1                 BRANCH--YES               19E03 46624002
         MVC   CSWORD(8),XDADBUF+54     MOVE CSW                  19E03 46671002
         MVC   ERPIBFLD(4),XDADBUF+62   MOVE ERPIB                19E03 46718002
         MVC   MULTISYS(4),XDADBUF+74   MOVE CHANSTAT INFO        19E03 46765002
         B     CONTINUE                 CONTINUE                  19E03 46812002
NEWMOVE1 MVC   CSWORD(8),XDADBUF+46     MOVE CSW                  19E03 46859002
         MVC   ERPIBFLD(4),XDADBUF+54   MOVE ERPIB                19E03 46906002
         MVC   MULTISYS(4),XDADBUF+66   MOVE CHANSTAT INFO        19E03 46953002
CONTINUE ST    R9,SAVBASE          SAVE THE BASE ADDRESS                47000002
         LA    R9,ERPIBFLD              DSECT ADDRESSIBILITY      19E03 47047002
         USING ERPIB,R9                                                 47094002
         MVI   SETUPBFR+1,C'*'                                     MP   47141002
         MVC   SETUPBFR+2(78),SETUPBFR+1                           MP   47188002
         BAL   BRANPRT,XWRTPRT    MOVE BORDER TO BUFFER AND WRITE  MP   47235002
         L     R6,VS2                                          @YL02021 47245002
         CLI   0(R6),X'01'                                     @YL02021 47255002
         BE    DUMMYTST                                        @YL02021 47265002
         MVI   SETUPBFR,C'-'           SKIP TWO SPACES             MP   47282002
         TM    MPINFOFD,MSBIT      IS MULTI-SYSTEM BIT SET        19032 47329002
         BZ    DUMMYTST      IFNOT,CKECK FOR ENTRANCE FROM ASR01   MP   47376002
         LA    SETUPADR,SETUPBFR       ADDRESS OF PRINT BUFFER     MP   47423002
         MVC   24(24,SETUPADR),MSHEAD   MOVE MULTI-SYSTEM HDR TO BUFMP  47470002
         BAL   BRANPRT,XWRTPRT     WRITE HEADER                    MP   47517002
         MVI   SETUPBFR+1,C'*'                                     MP   47564002
         MVI   VDSTAR,C'*'                                         MP   47611002
         BAL   BRANPRT,XWRTPRT     WRITE LINE DIVIDER              MP   47658002
*                                                                  MP   47705002
*                                                                  MP   47752002
*              THIS ROUTINE FORMATS AND PRINTS A MESSAGE           MP   47799002
*              CONTAINING THE ID OF THE FAILING CPU AND            MP   47846002
*              THE STATUS OF THE MULTI-PROCESSING SYSTEM           MP   47893002
*                                                                  MP   47940002
*                                                                  MP   47987002
         MVC   10(12,SETUPADR),MSCPUID  MOVE CPUID MESSAGE TO BUFFERMP  48034002
         MVC   30(15,SETUPADR),MSCPUST  MOVE CPU STATUS MESSAGE    MP   48081002
         MVI   0(SETUPADR),C'-'    SKIP TWO SPACES AFTER LINE      MP   48128002
         TM    MPINFOFD,ID         TEST FOR WHICH CPU             19032 48175002
         BZ    STATEST       SKIP CPU ID                           MP   48222002
         MVI   14(SETUPADR),C'2'   INSERT CPUID=CPU2               MP   48269002
STATEST  IC    R1,MPINFOFD         GET MS BYTE IN MPINFO          19032 48316002
         SLL   R1,30               CLEAR FOR CPUSTAT               MP   48363002
         LTR   R1,R1               TEST FOR ZERO,NEGATIVE OR POSITIVEMP 48410002
         BC    12,SHARED           IS STATUS NOT PARTITION         MP   48457002
         MVC   45(11,SETUPADR),PART     STATUS WAS PARTITIONED     MP   48504002
         B     CHANTEST      GO FOR CHANNEL STATUS                 MP   48551002
SHARED   MVC   45(6,SETUPADR),SHAR      SHARED STATUS              MP   48598002
         BE    CHANTEST                 WAS CPU RECONFIGURED OUT   MP   48645002
         MVC   51(21,SETUPADR),RECON    YES                        MP   48692002
         EJECT                                                          48739002
*                                                                  MP   48786002
*                                                                  MP   48833002
*              THIS ROUTINE TESTS A TWO BYTE FIELD                 MP   48880002
*              MPINFO FIELD                          TO DETERMINE       48927002
*              THE CHANNEL STATUS FOR BOTH CPUS AND FORMAT         MP   48974002
*              A MESSAGE TO INDICATE THAT STATUS                   MP   49021002
*                                                                  MP   49068002
*                                                                  MP   49115002
CHANTEST BAL   BRANPRT,XWRTPRT          PRINT INFORMATION          MP   49162002
         MVI   0(SETUPADR),C'-'         SKIP TWO SPACES            MP   49209002
         MVC   10(27,SETUPADR),CHCNFIG  CHANNEL CONFIGURATION MESSAGEMP 49256002
         LA    UPKREG,0                                            MP   49303002
         TM    MPINFOFD,ID         WAS CPUID=CPU2                 19032 49350002
         BZ    CCHMOVE                 NO                          MP   49397002
         MVI   14(SETUPADR),C'2'        YES, ENTER ID 2            MP   49444002
CCHMOVE  BAL   BRANPRT,XWRTPRT          PRINT MESSAGE              MP   49491002
         LA    R1,7                     LOOP CONTROL               MP   49538002
         LA    R2,14(SETUPADR)          PTR TO SLOT FOR 'OFF' MESSAGEMP 49585002
         IC    R5,CHSMS(UPKREG)         GET CHANNEL STATUS BYTE    MP   49632002
         MVC   10(55,SETUPADR),CHTAB    GET LIST OF CHANNELS       MP   49679002
         SLL   R5,24                    POSITION BYTE FOR BIT TESTINGMP 49726002
MSLOOP   LTR   R5,R5         IS BIT ON (NEGATIVE REG) OR OFF       MP   49773002
         BC    10,MSUPDT                NO                         MP   49820002
         MVC   0(3,R2),OFF              CHANNEL OFFLINE            MP   49867002
MSUPDT   SLL   R5,1                     MOVE TO NEXT CHANNEL BIT   MP   49914002
         LA    R2,8(R2)                 UPDATE MESSAGE POINTER     MP   49961002
         BCT   R1,MSLOOP                EXIT AFTER 7-BITS PROCESSED MP  50008002
MSREND   BAL   BRANPRT,XWRTPRT          WRITE CHANNEL STATUS MESSAGEMP  50055002
         LTR   UPKREG,UPKREG            TEST FOR SECOND TIME THROUGH MP 50102002
         BC    7,PRTHD                  BOTH BYTES OF CHANSTAT PRINTED  50149002
         LA    UPKREG,1(UPKREG)         PTR TO 2ND.BYTE OF CHANSTATMP   50196002
         MVC   10(27,SETUPADR),CHCNFIG  MOVE IN CHANNEL CONFIGURATIONMP 50243002
         TM    MPINFOFD,ID         ESTABLISH CPUID                19032 50290002
         BO    CCHMOVE                  BRANCH IF CPUID=CPU2       MP   50337002
         MVI   14(SETUPADR),C'2'        PUT CPU2 IN MESSAGE        MP   50384002
         B     CCHMOVE       PRINT MESSAGE                         MP   50431002
PRTHD    MVI   SETUPBFR+1,C'*'             SETUP TO PRINT DIVIDER       50478002
         MVC   2(78,SETUPADR),1(SETUPADR)                               50525002
         MVI   SETUPBFR,C'0'               SPACE FIRST                  50572002
         BAL   BRANPRT,XWRTPRT             PRINT DIVIDER                50619002
DUMMYTST LA    SETUPADR,SETUPBFR   GET ADDR OF BUFFER FOR PRINT    MP   50666002
*                                       MESSAGE                    MP   50713002
         MVI   0(SETUPADR),C'0'         SKIP SPACE AFTER NEXT MESSAGEMP 50760002
         OC    ERPIBFLD+1(3),ERPIBFLD+1  TEST FOR DUMMY ERPIB     19032 50807002
         BNE   MSCONT                   CONTINUE IF MEANINGFUL ERPIB MP 50854002
         MVC   10(39,SETUPADR),MSASR    PRINT ASR01 ENTRY MESSAGE  MP   50901002
         MVI   0(SETUPADR),C'-'         SKIP 2 LINES               MP   50948002
         BAL   BRANPRT,XWRTPRT          PRINT INFORAMATION         MP   50995002
         MVC   10(17,SETUPADR),MSNERPIB ERPIB NOT CREATED MESSAGE  MP   51042002
         BAL   BRANPRT,XWRTPRT          PRINT INFORMATION          MP   51089002
         B     RETCNTL       RETURN CONTROL                        MP   51136002
*                                                                  MP   51183002
         EJECT                                                          51230002
MSCONT   EQU   *                                                   MP   51277002
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  51324002
*                          INSTRUCTION ANALYSIS                       * 51371002
*        THIS PROGRAM SECTION WILL INSPECT THE FIRST FOUR(4) BITS IN  * 51418002
*        THE FIRST BYTE  OF THE              ERPIB AREA, TO DETERMINE * 51465002
*        THE INSTRUCTION CAUSING THE ERROR.                           * 51512002
         LA    SETUPADR,SETUPBFR       SET UP HEADER BOARDER.           51559002
         MVC   SETUPBFR+27(25),HEADER    SET UP HEADER MESSAGE          51606002
         MVI   0(SETUPADR),C'0'          SPACE ONE LINE                 51653002
         BAL   BRANPRT,XWRTPRT                                          51700002
*                                                                     * 51747002
*                            TEST FOR INTERRUPT                       * 51794002
*                                                                     * 51841002
         TM    SOFWFLGS,X'40'          INTERRUPT TEST.                  51888002
         BZ    INST                                                     51935002
         MVC   SETUPBFR(42),ERRINT     BUFFER INTERRUPT MESSAGE.        51982002
         B     RITEOUT                                                  52029002
*                                                                     * 52076002
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  52123002
*                                                                     * 52170002
*        BITS 32-35 WILL BE TESTED                                    * 52217002
*                                                                     * 52264002
INST     MVC   SETUPBFR(33),CAUSERR    TYPE-INST ERROR HEADER.          52311002
         TM    SOFWFLGS,X'80'          TEST FOR SIO INSTRUCTION ERROR.  52358002
         BO    PRTERSIO                BRANCH TO SETUP PRINT BUFFER.    52405002
         TM    SOFWFLGS,X'20'          TEST FOR TIO INSTRUCTION.        52452002
         BO    PRTERTIO                BRANCH TO SETUP PRINT BUFFER.    52499002
*                                                                     * 52546002
PRTERHIO MVC   SET1(3),ERRHIO          MOVE HIO LABEL INTO BUFFER.      52593002
         B     RITEOUT                 PREPARE TO WRITE MESSAGE.        52640002
*                                                                     * 52687002
PRTERSIO MVC   SET1(3),ERRSIO          MOVE SIO LABEL INTO BUFFER.      52734002
         B     RITEOUT                 PREPARE TO WRITE MESSAGE.        52781002
*                                                                     * 52828002
PRTERTIO MVC   SET1(3),ERRTIO          MOVE TIO LABEL INTO BUFFER.      52875002
*                                                                     * 52922002
RITEOUT  BAL   BRANPRT,XWRTPRT         WRITE OUT APPROPRIATE MESSAGE.   52969002
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  53016002
*        THE FOLLOWING PROGRAM SECTION WILL INSPECT THE ERPIBFLD        53063002
*        TO DETERMINE IF AN ERPIB IS PRESENT.   IF  ONE IS              53110002
*        NOT FOUND, CONTROL WILL BE RETURNED.                           53157002
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  53204002
         OC    ERPIBFLD+1(3),ERPIBFLD+1  TEST FOR  ERPIB PRESENT  19032 53251002
         BZ    NONEXIST                WRITE MSG TO INDICATE NONEXISTS. 53298002
         B     TEST1         TEST COMPLETION CODE                  MP   53345002
*                         UCB ADDRESS NON-EXISTANT                      53392002
NONEXIST MVC   SETUPBFR(45),NOUCB        SET UP MSG FOR NO UCB          53439002
         BAL   BRANPRT,XWRTPRT         WRITE MESSAGE.                   53486002
         B     RETCNTL                 RETURN TO CONTROL.               53533002
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  53580002
*        THE FOLLOWING PROGRAM SECTION WILL TEST  BYTE 5     OF THE     53627002
*        ERPIB FOR A NO RETRY BIT SETTING. IF ON, CONTROL IS RETURNED   53674002
*        AFTER MESSAGE IS PRINTED OUT.                                  53721002
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  53768002
*                       OUTPUT RETRY CODE VALUE                         53815002
*                                                                       53862002
*   *    *    *    *    *    *    *    *    *    *    *    *    *    *  53909002
*                            TEST SOFTWARE FLAGS                        53956002
TEST     MVC   SETUPBFR(32),RETCDVAL     BUFFER THE BASIC MESSAGE       54003002
         IC    WORK,CMPLBITS       CONTENTS OF BYTE 8 INTO R3     19032 54050002
         TM    VALFLAGS,X'10'            TEST FOR VALID RETRY CODE      54097002
         BO    VALFLG              IF VALID, GO SETUP MESSAGE           54144002
         MVC   33(43,SETUPADR),NOTVM  SETUP NOT ASSESSABLE MESSAGE      54191002
         B     BUFITA           GO PRINT IT                             54238002
VALFLG   N     WORK,MASK           GET RID OF UNNEED BITS               54285002
         STC   WORK,RCMSG+12       STORE NUMBER IN RETRY CODE MESSAGE   54332002
         OI    RCMSG+12,X'F0'      MAKE PRINTABLE                       54379002
         MH    WORK,CONST                                               54426002
         LA    WORK,MSGSTRT(WORK)  SETUP MESSAGE INDEX                  54473002
         MVC   33(44,SETUPADR),0(WORK) MOVE MESSAGE TO BUFFER           54520002
BUFIT    BAL   BRANPRT,XWRTPRT     PRINT IT                             54567002
         MVC   34(14,SETUPADR),RCMSG  MOVE RETRY MSG TO BUFFER          54614002
BUFITA   BAL   BRANPRT,XWRTPRT                                          54661002
         TM    CMPLBITS,X'08'      IS DISCONNECT IN SET           19032 54708002
         BNO   NOTDISIN            NO, SKIP MSG                   19032 54755002
         MVC   SETUPBFR(23),DISCIN SET UP MSG                     19032 54802002
         BAL   BRANPRT,XWRTPRT     PRINT MSG                      19032 54849002
NOTDISIN EQU   *                                                  19032 54896002
*                                                                       54943002
*                                  TEST NO-RETRY BIT                    54990002
         TM    SOFWFLGS,X'01'          IF NORETRY BIT IS NOT ON,BRANCH  55037002
*                                      TO PRINT VALID INDICATOR MSG.    55084002
         BZ    VALIDIND                                                 55131002
         MVC   SETUPBFR(28),NORETRY    INDICATES THAT THE BIT WAS ON.   55178002
         BAL   BRANPRT,XWRTPRT         WRITE THE MESSAGE.               55225002
         B     RETCNTL                 RETURN CONTROL.                  55272002
VALIDIND MVC   SETUPBFR(29),VALIDITY   RECORDED DATA HEADING TO BUFFER  55319002
         BAL   BRANPRT,XWRTPRT         INDICATOR HEADER.                55366002
*                                                                       55413002
*                                  TEST VALID RETRY CODE                55460002
*                                                                       55507002
*                                                                       55554002
*                            TEST COUNT BIT                             55601002
         MVC   SETUPBFR(42),VALCOUNT   BUFFER THE BASIC MESSAGE.        55648002
         TM    SOFWFLGS,X'02'          TEST COUNT VALIDITY.             55695002
         BZ    INVCOUNT                IF OFF, PRINT INVALID MSG.       55742002
         MVC   33(9,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.    55789002
INVCOUNT BAL   BRANPRT,XWRTPRT         WRITE MESSAGE.                   55836002
*                                                                       55883002
*                            TEST FOR SENSE DATA STORED                 55930002
*                                                                       55977002
         MVC   SETUPBFR(43),SENSDATA   BUFFER THE BASIC MESSAGE.        56024002
         TM    SOFWFLGS,X'04'          TEST SENSE BIT.                  56071002
         BZ    NOSTORE                 IF OFF BRANCH TO WRITE NOSTORE.  56118002
         MVC   33(10,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.   56165002
NOSTORE  BAL   BRANPRT,XWRTPRT         WRITE THE MESSAGE.               56212002
*                            TEST UNIT STATUS BIT                       56259002
         MVC   SETUPBFR(42),INVALUN    BUFFER THE BASIC MESSAGE.        56306002
         TM    VALFLAGS,X'08'          TEST FOR VALID UNIT STATUS.      56353002
         BZ    WRTOUT                  UNIT STATUS INVALID.             56400002
         MVC   33(9,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.    56447002
WRTOUT   BAL   BRANPRT,XWRTPRT         WRITE MESSAGE.                   56494002
*                                                                       56541002
*                            TEST COMMAND ADDRESS BIT                   56588002
*                                                                       56635002
         MVC   SETUPBFR(42),INVALCAD   MOVE INVALID COM MSG TO BUFFER.  56682002
         TM    VALFLAGS,X'04'          TEST FOR VALID COMMAND ADDRESS.  56729002
         BZ    PTOUT                   COMMAND ADDRESS INVALID.         56776002
         MVC   33(9,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.    56823002
PTOUT    BAL   BRANPRT,XWRTPRT         WRITE THE MESSAGE.               56870002
*                                                                       56917002
*                            TEST CHANNEL ADDRESS BIT                   56964002
*                                                                       57011002
         MVC   SETUPBFR(42),INVALCHA   MOVE INVALID CHN MSG TO BFR.     57058002
         TM    VALFLAGS,X'02'          TEST FOR VALID CHANNEL ADDRESS.  57105002
         BZ    OUTWRT                  INVALID CHANNEL ADDRESS.         57152002
         MVC   33(9,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.    57199002
OUTWRT   BAL   BRANPRT,XWRTPRT         WRITE MESSAGE.                   57246002
*                                                                       57293002
*                            TEST FOR VALID DEVICE ADDRESS              57340002
*                                                                       57387002
         MVC   SETUPBFR(42),INVALDVA   MOVE INVALID DVC ADDR MSG TO BFR 57434002
         TM    VALFLAGS,X'01'          TEST FOR VALID DEVICE ADDRESS.   57481002
         BZ    OUTPRT                  INVALID DEVICE ADDRESS.          57528002
         MVC   33(9,SETUPADR),37(SETUPADR) MODIFY THE BASIC MESSAGE.    57575002
OUTPRT   BAL   BRANPRT,XWRTPRT         WRITE MESSAGE.                   57622002
*                                                                       57669002
*        PROBABLE SOURCE OF ERROR                                       57716002
*                                                                       57763002
         MVC   SETUPBFR(29),PSOERR      INSERT BASE MSG IN BUFFER       57810002
         CLI   PROBERR,X'80'            TEST FOR CPU ERROR              57857002
         BE    CPUER                    BRANCH TO SET UP CPU ERR MSG    57904002
         CLI   PROBERR,X'40'            TEST FOR CHANNEL ERROR          57951002
         BE    CHNER                    BRANCH TO SETUP CHANNEL ERROR   57998002
         CLI   PROBERR,X'20'       TEST FOR SCU ERROR             19032 58045002
         BE    SCUER               YES- GO SET UP FOR SCU ERRMSG  19032 58092002
         CLI   PROBERR,X'10'            TEST FOR STORAGE ERROR          58139002
         BE    STORGER                  GO SETUP STORAGE ERROR MSG      58186002
         CLI   PROBERR,X'08'            TEST FOR I/O INTERFACE ERROR    58233002
         BE    INFER                    GO SETUP I/O INTF ERROR MSG     58280002
         MVC   30(25,SETUPADR),NOTVM    SETUP NOT ASSESSABLE MESSAGE    58327002
         B     WPRMSG                   GO PRINT MSG                    58374002
CPUER    MVC   30(3,SETUPADR),CPUERMSG  BUFFER CPU ERROR MESSAGE        58421002
         B     WPRMSG                   GO PRINT                        58468002
CHNER    MVC   30(7,SETUPADR),CHANERMS  SETUP CHANNEL ERROR MESSAGE     58515002
         B     WPRMSG                   GO PRINT                        58562002
SCUER    MVC   30(20,SETUPADR),SCUERMS  SET UP SCU MSG            19032 58609002
         B     WPRMSG                   GO PRINT IT               19032 58656002
STORGER  MVC   30(7,SETUPADR),STOGERMS  SETUP STORAGE ERROR MESSAGE     58703002
         B     WPRMSG                   GO PRINT                        58750002
INFER    MVC   30(13,SETUPADR),IOINFER  SET UP INTERFACE ERROR MESSAGE  58797002
WPRMSG   BAL   BRANPRT,XWRTPRT          PRINT MESSAGE                   58844002
         B     RETCNTL                                                  58891002
*                                                                       58938002
*                            TEST COMPLETION CODE                       58985002
*                                                                       59032002
TEST1    MVC   SETUPBFR(23),COMCODE    INSERT COMPLETION CODE MESSAGE   59079002
*                                      IN PRINT BUFFER.                 59126002
         TM    CMPLBITS,X'C0'          TEST FOR COMPLETION CODE '3'.    59173002
         BO    SYSRET                  BRANCH FOR SYS RESET MSG OUTPUT. 59220002
         TM    CMPLBITS,X'80'          TEST FOR COMPLETION CODE '2'     59267002
         BO    SELRET                  BRANCH FOR SEL RESET MSG OUTPUT. 59314002
         TM    CMPLBITS,X'40'          TEST FOR COMPLETION CODE '1'     59361002
         BO    FORENDSQ                BRANCH FOR FORCED END MSG OUTPUT 59408002
*                                                                       59455002
*                            INTERFACE DISCONNECT                       59502002
*                                                                       59549002
         MVC   SET2(29),INTDISCN      SET UP INTERFACE DISCONNECT MSG   59596002
         B     WRITER                  MESSAGE AND WRITE IT OUT.        59643002
*                                                                       59690002
*                            SYSTEM RESET                               59737002
*                                                                       59784002
SYSRET   MVC   SET2(21),SYSRES        SETUP  THE SYSTEM RESET MSG AND   59831002
         B     WRITER                  WRITE IT OUT.                    59878002
*                                                                       59925002
*                            SELECTIVE RESET                            59972002
*                                                                       60019002
SELRET   MVC   SET2(24),SELRES          SETUP SELECTIVE RESET  MSG AND  60066002
         B     WRITER                  AND WRITE IT OUT.                60113002
*                                                                       60160002
*                            FORCED ENDING SEQUENCE                     60207002
*                                                                       60254002
FORENDSQ MVC   SET2(31),FORCEND         SETUP FORCE END MESSAGE AND     60301002
*                                      WRITE IT OUT.                    60348002
*                                                                       60395002
*                            OUTPUT OF COMPLETION                       60442002
*                              CODE MESSAGES                            60489002
*                                                                       60536002
WRITER   BAL   BRANPRT,XWRTPRT                                          60583002
         B     TEST                                                     60630002
*                                                                       60677002
*                                 RETURN CONTROL                        60724002
*                                                                       60771002
RETCNTL  EQU   *                                                  19032 60818002
         MVI   SETUPBFR+1,C'*'                                          60865002
         MVC   2(78,SETUPADR),1(SETUPADR)                               60912002
         MVI   0(SETUPADR),C'-'         SETUP TO SPACE TWICE            60959002
         BAL   BRANPRT,XWRTPRT                                          61006002
         TM    CSWORD+5,X'06'          EITHER CHAN CTRL OR I/F CTRL CHK 61053002
         BC    8,MSG                   NO, PRINT LOGOUT MESSAGE.        61100002
FIN1     DS    0C                                                       61147002
         LA    R0,0                     ZERO WORK REGISTER              61194002
         ST    R0,NXENTRY               CLEAR ENTRY POINTER             61241002
         L     R13,SVR13                RESTORE REG 13                  61288002
         LM    R14,R12,12(R13)          RESTORE REGISTERS               61335002
         BR    R14                      RETURN                          61382002
*                                                                       61429002
*                            PRINT NO-LOGOUT MESSAGE                    61476002
*                                                                       61523002
MSG      MVC   SETUPBFR+1(78),ERMSG    BUFFER THE MESSAGE.              61570002
         BAL   BRANPRT,XWRTPRT                                          61617002
         L     R9,SAVBASE         RESTORE THE BASE ADDRESS              61664002
         L     R0,NOLOGPTR              POINT                  @YM2954P 61711002
         L     R1,RG9PTR                 AROUND                @YM2954P 61741002
         ST    R0,AD0(R1)                 LOGOUT               @YM2954P 61771002
         L     R0,NOLOGLAB                 LINES               @YM2954P 61801002
         L     R1,LPPTR                     AND                @YM2954P 61831002
         ST    R0,AD0(R1)                    LABELS            @YM2954P 61861002
         B     FIN1                                                     61899002
SAVBASE  DC    F'0'                                                     61946002
*                                                                  MP   61993002
***      THIS ROUTINE CONVERTS HEX CHARACTERS TO EBCDIC            MP   62040002
*                                                                  MP   62087002
*        INPUT   R1 -         LINKREG                               MP  62134002
*                CLEAREG -    COUNT OF BYTES TO BE CONVERTED        MP  62181002
*                R5 -         ADDRESS OF FIELD TO BE CONVERTED     MP   62228002
***              SETUPADR -   ADDRESS OF OUTPUT AREA               MP   62275002
*                                                                  MP   62322002
*                                                                  MP   62369002
CONVERT  SR    R2,R2                    CLEAR EVEN WORK REG (HI-ORDEMP  62416002
         IC    R2,0(R5)                 GET CHARACTER FROM INPUT FIE MP 62463002
         SRDL  R2,4                     SAVE HIGH ORDER BITS       MP   62510002
         SRL   WORK,28                  SAVE LOW ORDER BITS        MP   62557002
         IC    R2,CONTAB(R2)            GET EBCDIC EQUIVALENT      MP   62604002
         IC    WORK,CONTAB(WORK)             FROM TABLE            MP   62651002
         STC   R2,0(SETUPADR)           STORE CHARACTERS IN PRINTABL MP 62698002
         STC   WORK,1(SETUPADR)              FORM IN BUFFER        MP   62745002
         LA    R5,1(R5)                 UPDATE INPUT FIELD PTR     MP   62792002
         LA    SETUPADR,2(SETUPADR)     UPDATE BUFFER POINTER      MP   62839002
         BCT   CLEAREG,CONVERT          LOOP UNTIL ALL BYTES PROCESS MP 62886002
         BR    R1                       RETURN                     MP   62933002
         SPACE                                                          62980002
****    ROUTINE TO RETURN CONTROL TO CONTROL MODULE                     63027002
XWRTPRT  DS    0C                                                       63074002
         ST    BRANPRT,NXENTRY          STORE LINK ADDRESS              63121002
         STM   R12,R10,MYSAVE           SAVE SUBROUTINE REGS            63168002
         L     R0,RTNPTR                LOAD ADCON FOR RETURN POINTER   63215002
         L     R1,RG9PTR                LOAD POINTER TO REG9            63262002
         ST    R0,AD0(R1)               STORE RETURN POINTER            63309002
         L     R0,LBLPTR                LOAD POINTER TO LABEL           63356002
         L     R1,LPPTR                 LOAD POINTER TO LP              63403002
         ST    R0,AD0(R1)               STORE LABEL POINTER             63450002
         L     R13,SVR13                RESTORE REG 13                  63497002
         MVI   AD0(R3),X09                                              63544002
         LM    R14,R12,12(R13)          RESTORE REGISTERS               63591002
         BR    R14                      RETURN                          63638002
*                                                                       63685002
*                            STORAGE                                    63732002
*                                                                       63779002
RELTAB   DS    0C                                              @XL03976 63783002
         DC    C'OS  '                                         @XL03976 63787002
         DC    C'DOS '                                         @XL03976 63791002
         DC    C'VS 1'                                         @XL03976 63795002
         DC    C'V370'                                         @XL03976 63799002
         DC    C'VS 2'                                         @XL03976 63803002
         DC    C'    '                                         @XL03976 63807002
         DC    C'    '                                         @XL03976 63811002
         DC    C'    '                                         @XL03976 63815002
         DS    0F                                                       63826002
GPRMS    EQU   XDADBUF+248                                         MP   63873002
VDSTAR   EQU   XPRTBUF+79                                          MP   63920002
ID       EQU   X'08'                                               MP   63967002
MSBIT    EQU   X'10'                                                MP  64014002
K0       EQU   0                                                  19E03 64061002
K2       EQU   2                                                  19E03 64108002
K4       EQU   4                                                  19E03 64155002
K8       EQU   8                                                  19E03 64202002
K24      EQU   24                                                 19E03 64249002
FOXDOG   EQU   X'FD'                                              19E03 64296002
REL19    EQU   19                                                 19E02 64343002
XPRTBUF1 EQU   XPRTBUF+1                                          19E03 64390002
MODA48   DC    X'0155'                  MODEL 155 - NS A48        19E02 64437002
DECCOUNT DS    F                                                  19E03 64484002
*                                                                       64531002
SETUPBFR EQU   XPRTBUF                                                  64578002
CSWORD   DC    D'0'                CSW LOCATION                   19032 64625002
ERPIBFLD DC    F'0'                LAST HALF ERPIB                19032 64672002
MULTISYS DC    F'0'                MULTI-PROCESSING INFO          19032 64719002
MASK     DC    F'7'                                                     64766002
CONST    DC    H'44'                                                    64813002
TWOX     DC    H'2'                                                     64860002
SET1     EQU   SETUPBFR+22                                              64907002
SET2     EQU   SETUPBFR+21                                              64954002
*                                                                       65001002
*                            REGISTERS                                  65048002
WORK     EQU   11                                                       65095002
UPKREG   EQU   6                       ADDRESSES UNPACK AREA.           65142002
SETUPADR EQU   7                       ADDRESSES PRINT BUFFER.          65189002
BRANPRT  EQU   11                      ADDRESSES PRINT ROUTINE.         65236002
CLEAREG  EQU   12                                                       65283002
*                                                                       65330002
*                            MESSAGES                                   65377002
*                                                                       65424002
*                                                                       65471002
CAUSERR  DC    C'-  CSW STORED BY  --             '                     65518002
ERRINT   DC    C'-  CSW STORED BY  INTERRUPT               '            65565002
ERRSIO   DC    C'SIO'                                                   65612002
ERRTIO   DC    C'TIO'                                                   65659002
ERRHIO   DC    C'HIO'                                                   65706002
NOUCB    DC    C'   NO ADDITIONAL ERROR INFORMATION AVAILABLE.'         65753002
COMCODE  DC    C'   TERMINATION BY  --  '                               65800002
SYSRES   DC    C' SYSTEM RESET- CODE 3'                                 65847002
SELRES   DC    C' SELECTIVE RESET- CODE 2'                              65894002
FORCEND  DC    C' FORCED ENDING SEQUENCE- CODE 1'                       65941002
INTDISCN DC    C' INTERFACE DISCONNECT- CODE 0'                         65988002
RETCDVAL DC    C'   TIME CHANNEL DETECTED ERROR -'                      66035002
RCMSG    DC    C'RETRY CODE    '                                        66082002
MSGSTRT  DC    C' WHILE EXECUTING TIO                        '          66129002
         DC    C' BETWEEN COMMAND OUT AND UNIT STATUS RETURN '          66176002
         DC    C' COMMAND ACCEPTED BUT BEFORE DATA TRANSFER  '          66223002
         DC    C' SOME DATA TRANSFER-CSW COMMAND ADR UPDATED '          66270002
         DC    C' COMMAND REJECTED OR COMMAND OUT NOT SENT   '          66317002
         DC    C' COMMAND ACCEPTED-DATA TRANSFER UNDETERMINED'          66364002
         DC    C' COULD NOT BE ASSESSED                      '          66411002
NOTVM    DC    C' COULD NOT BE ASSESSED                      '          66458002
NORETRY  DC    C'0  PROGRAM ASSESSED NO RETRY'                          66505002
DISCIN   DC    C'   DISCONNECT IN ISSUED'                         19032 66552002
VALIDITY DC    C'0  VALIDITY OF RECORDED DATA '                         66599002
VALCOUNT DC    C'            COUNT              = NOT VALID'            66646002
SENSDATA DC    C'            SENSE DATA         = NOT STORED'           66693002
INVALUN  DC    C'            UNIT STATUS        = NOT VALID'            66740002
INVALCAD DC    C'            COMMAND ADDRESS    = NOT VALID'            66787002
INVALCHA DC    C'            CHANNEL ADDRESS    = NOT VALID'            66834002
INVALDVA DC    C'            DEVICE ADDRESS     = NOT VALID'            66881002
PSOERR   DC    C'0  PROBABLE SOURCE OF ERROR- '                         66928002
CPUERMSG DC    C'CPU'                                                   66975002
CHANERMS DC    C'CHANNEL'                                               67022002
SCUERMS  DC    C'STORAGE CONTROL UNIT'                            19032 67069002
STOGERMS DC    C'STORAGE'                                               67116002
IOINFER  DC    C'CONTROL UNIT '                                         67163002
HEADER   DC    C' CHANNEL  ERROR  ANALYSIS'                             67210002
ERMSG    DC    C'CHANNEL CTRL OR I/F CTRL CHECK '                       67257002
         DC    C'NOT INDICATED IN CSW-'                        @YM4854P 67304002
NOLOGMSG DC    C'NO LOGOUT WITH THIS RECORD '                  @YM4854P 67344002
MSHEAD   DC    C'MULTI-SYSTEM INFORMATION'              MESSAGES   MP   67398002
MSCPUID  DC    C'CPU 1 FAILED'                           FOR        MP  67445002
MSCPUST  DC    C'CPU STATUS WAS '              ONLY THE            MP   67492002
PART     DC    C'PARTITIONED'                           M65MP TO BE  MP 67539002
SHAR     DC    C'SHARED'                        ONLY                MP  67586002
RECON    DC    C' BUT RECONFIGURED OUT'                 WRITTEN ON  MP  67633002
CHCNFIG  DC    C'CPU 1 CHANNEL CONFIGURATION'            SEC       MP   67680002
CHTAB    DC    C'CH0--ON CH1--ON CH2--ON CH3--ON CH4--ON'  *       MP   67727002
         DC    C' CH5--ON CH6--ON'                    STORAGE  FOR   MP 67774002
MSASR    DC    C'INBOARD RECORD ENTRY CONSTRUCTED BY MCH'  *        MP  67821002
MSNERPIB DC    C'ERPIB NOT CREATED'         EREP RECORDS           MP   67868002
NXENTRY  DC    F'0'                                                     67915002
OFF      DC    C'OFF'                         CONSTANTS            MP   67962002
         DC    C'LINE   '                       MESSAGES            MP  68009002
RTNPTR   DC    A(PRTERPIB-4)                                            68056002
RG9PTR   DC    A(REG9)                                                  68103002
LBLPTR   DC    A(LABELEND-1)                                            68150002
LPPTR    DC    A(LP)                                                    68197002
NOLOGPTR DC    A(VS2LINE-4)                                    @YM2954P 68207002
NOLOGLAB DC    A(VS2LAB-1)                                     @YM2954P 68217002
MYSAVE   DS    15F                                                      68244002
SVR13    DS    1F                                                       68291002
VS2      DC    A(VS2FLG)                                       @YL02021 68311002
CONTAB   DC    C'0123456789ABCDEF'     HEX CHARACTERS F0-F6        MP   68338002
         DROP  R15                                                      68385002
         USING IFCEI145,R9,R6                                  @XA19715 68405001
         EJECT                                                          69748002
FORMAT1  DC    F'0'                                                     69795002
FORMAT2  DC    F'0'                                                     69842002
LABELPTR DC    A(LABLAREA)                                              69889002
DISP     DC    FL2'0'                                                   69936002
         SPACE 2                                                        69983002
         DC    X'01'                                                    70030002
         DC         X'000B8B00'         SKIP TO CHANNEL 1               70077002
         LABEL ' '                                                      70124002
*                                                                       70171002
         LINE       (9,40),(1,35),SKIP=2                                70218002
         HEX        XMOD,0,2B                                           70265002
         HEX        XSER,0,3B                                           70312002
         LABEL      'MODEL','SERIAL NO.'                                70359002
*                                                                       70406002
         LINE  (10,)                                           @XL03976 70416002
         ROUTINE XRELN,CONVREL                                 @XL03976 70426002
         LABEL 'XXXX REL.'                                     @XL03976 70436002
         LINE       (21,40)                                             70453002
         ROUTINE    XKEY,SETSOURC                                       70500002
         LABEL      '--- RECORD SOURCE -','TYPE - INBOARD'              70547002
*                                                                       70594002
         LINE                                                           70641002
         ROUTINE    XJOBN,SETPGMN                                       70688002
         LABEL      'JOB NAME'                                          70735002
*                                                                       70782002
         LINE       ,(8,40),SKIP=1                                      70829002
         ROUTINE    XSWS8,CONVTIME                                      70876002
         LABEL      'DAY  YEAR','HH MM SS.TH'                           70923002
         LINE       (8,40),(1,40),SKIP=2                                70970002
         ROUTINE    XDATE,SETDATE                                       71017002
         HEX        XTIME,1,4B                                          71064002
         LABEL      'DATE _','TIME _'                                   71111002
*                                                                       71158002
         LINE       (23,1),(1,1)                                        71205002
         HEX        XCUA,0,3B                                           71252002
         LABEL      'CHANNEL/UNIT ADDRESS'                              71299002
*                                                                       71346002
         LINE  (30,1),(1,1),SKIP=2                             @YL02021 71355002
         ROUTINE   XKEY,ISITVS2                                @YL02021 71364002
         HEX   VCUA                                            @YL02021 71373002
         LABEL 'ADDR.STORED IN LOC 184'                        @YL02021 71382002
         LINE       ,(14,1),SKIP=1                                      71393002
         ROUTINE    XKEY,SKIPPER                                        71440002
         LABEL      'CC   DA    FL     CT'                              71487002
         LINE       (14,3),(1,1),SKIP=2                                 71534002
         HEX        XFCCWCC,0,1B                                        71581002
         HEX        XFCCWDA,0,3B                                        71628002
         ROUTINE    XKEY,SPACER2                                        71675002
         HEX        XFCCWFL,0,1B                                        71722002
         HEX        XFCCW0,0,1B                                         71769002
         HEX        XFCCWCT,0,2B                                        71816002
         LABEL      'FAILING CCW'                                       71863002
*                                                                       71910002
         LINE       ,(14,1),SKIP=1                                      71957002
         ROUTINE    XKEY,SKIPPER                                        72004002
         LABEL      'K    CA    US CS  CT'                              72051002
         LINE       (14,3),(1,1),SKIP=2                                 72098002
         HEX        XCSWK,0,1B                                          72145002
         HEX        XCSWCA,0,3B                                         72192002
         ROUTINE    XKEY,SPACER2                                        72239002
         ROUTINE    XCSWUS0,SETHEX                                      72286002
         ROUTINE    XCSWCS0,SETHEX                                      72333002
         HEX        XCSWCT,0,2B                                         72380002
         LABEL      'CSW'                                               72427002
*                                                                       72474002
         LINE       ,(2,38),SKIP=1                                      72521002
         ROUTINE    XKEY,SKIPPER                                        72568002
         LABEL      'UNIT STATUS','CHANNEL STATUS'                      72615002
*                                                                       72662002
         LINE       (21,38),(3,38)                                      72709002
         BIN        XCSWUS0                                             72756002
         BIN        XCSWCS0                                             72803002
         LABEL      'ATTENTION','PRGM-CTLD IRPT'                        72850002
         LINE                                                           72897002
         BIN        XCSWUS1                                             72944002
         BIN        XCSWCS1                                             72991002
         LABEL      'STATUS MODIFIER','INCORRECT LENGTH'                73038002
         LINE                                                           73085002
         BIN        XCSWUS2                                             73132002
         BIN        XCSWCS2                                             73179002
         LABEL      'CONTROL UNIT END','PROGRAM CHECK'                  73226002
         LINE                                                           73273002
         BIN        XCSWUS3                                             73320002
         BIN        XCSWCS3                                             73367002
         LABEL      'BUSY','PROTECTION CHECK'                           73414002
         LINE                                                           73461002
         BIN        XCSWUS4                                             73508002
         BIN        XCSWCS4                                             73555002
         LABEL      'CHANNEL END','CHAN DATA CHECK'                     73602002
         LINE                                                           73649002
         BIN        XCSWUS5                                             73696002
         BIN        XCSWCS5                                             73743002
         LABEL      'DEVICE END','CHAN CTRL CHECK'                      73790002
         LINE                                                           73837002
         BIN        XCSWUS6                                             73884002
         BIN        XCSWCS6                                             73931002
         LABEL      'UNIT CHECK','I/F CTRL CHECK'                       73978002
         LINE       ,,SKIP=2                                            74025002
         BIN        XCSWUS7                                             74072002
         BIN        XCSWCS7                                             74119002
         LABEL      'UNIT EXCEPTION','CHAINING CHECK'                   74166002
*                                                                       74213002
         LINE       ,(1,1),SKIP=1                                       74260002
         ROUTINE    XKEY,SKIPPER                                        74307002
         LABEL 'I/O UNITS FOUND BUSY'                                   74354002
         LINE       (27,5),(1,1),SKIP=2                                 74401002
         HEX        XAIO1                                               74448002
         HEX        XAIO2                                               74495002
         HEX        XAIO3                                               74542002
         HEX        XAIO4                                               74589002
         HEX        XAIO5                                               74636002
         HEX        XAIO6                                               74683002
         HEX        XAIO7                                               74730002
         HEX        XAIO8                                               74777002
         ROUTINE    XKEY,SETAIO                                         74824002
         LABEL      'CHANNEL/UNIT ADDR'                                 74871002
*                                                                       74918002
         LINE       ,(1,1),SKIP=1                                       74965002
         LABEL      '--- CHANNEL TYPE ---'                              75012002
         LINE  (1,1),(1,1),SKIP=2                                       75059002
         ROUTINE    XCHID,CHNTYPE                                       75106002
         LABEL      ''                                                  75153002
         LINE       ,(1,1),SKIP=1                                       75200002
         LABEL      'HEADER SENSE SWITCHES FOUND ON'                    75247002
         LINE       ,(2,1)                                              75294002
         ROUTINE    XSWS8,CHKSW9                                        75341002
         LABEL      'RECORD INCOMPLETE'                                 75388002
         LINE                                                           75435002
         ROUTINE    XSWS8,CHKSW10                                       75482002
         LABEL      'SYSTEM TERMINATED'                                 75529002
         LINE                                                           75576002
         ROUTINE    XSWS8,CHKSW11                                       75623002
         LABEL      'UNSUPPORTED CHANNEL'                               75670002
         LINE                                                           75717002
         ROUTINE    XSWS8,CHKSW12                                       75764002
         LABEL      'CUA ILLEGAL'                                       75811002
         LINE                                                           75858002
         ROUTINE    XSWS8,CHKSW13                                       75905002
         LABEL      'PORTION OF RECORD HAS BEEN DESTROYED'              75952002
         LINE                                                           75999002
         ROUTINE    XSWS8,CHKSW14                                       76046002
         LABEL      'ERP WERE IN PROGRESS'                              76093002
         LINE                                                           76140002
         ROUTINE    XKEY,SKIPPER                                 P0417  76187002
         LABEL      ' '                                          P0417  76234002
PRTERPIB LINE  (1,1),(1,1),SKIP=1                                       76281002
         ROUTINE    XSWS8,IFCASR01                                      76328002
LABELEND LABEL      ''                                                  76375002
         EJECT                                                          76422002
         DC    X'01000B8B00'                                            76469002
         LABEL ''                                                       76516002
         LINE                                                           76563002
         ROUTINE    XKEY,NOLOG                                          76610002
         LABEL ''                                              @YM4854P 76657002
         LINE  ,(40,1),SKIP=2                                           76845002
         LABEL 'CPU DEPENDENT LOGOUT'                                   76892002
         LINE  ,(30,1),SKIP=2                                           76939002
         LABEL '----------------------------------------------------'   76986002
         LINE  ,(40,1),SKIP=2                                           77033002
         LABEL 'MACHINE CHECK REGISTER A'                               77080002
         LINE  ,(14,62),SKIP=2                                          77127002
         LABEL 'BYTE 0','BYTE 2'                                        77174002
         LINE  (38,60),(1,59),SKIP=1                                    77221002
         BIN   MCHRG00                                                  77268002
         BIN   MCHRG16                                                  77315002
         LABEL 'LOCAL STORAGE A SOURCE ADDR CHK','ALU 2 HALF SUM CHK'   77362002
         LINE                                                           77409002
         BIN   MCHRG01                                                  77456002
         BIN   MCHRG17                                                  77503002
         LABEL 'LOCAL STORAGE B SOURCE ADDR CHK','ALU 3 HALF SUM CHK'   77550002
         LINE                                                           77597002
         BIN   MCHRG02                                                  77644002
         BIN   MCHRG18                                                  77691002
         LABEL 'LOCAL STORAGE A DEST ADDR CHK','ALU LOGICAL CHK'        77738002
         LINE                                                           77785002
         BIN   MCHRG03                                                  77832002
         BIN   MCHRG19                                                  77879002
         LABEL 'LOCAL STORAGE B DEST ADDR CHK','B REG SHIFT CHK'        77926002
         LINE                                                           77973002
         BIN   MCHRG04                                                  78020002
         BIN   MCHRG20                                                  78067002
         LABEL 'DEST BYTE CTRL CHK','A REG PTY CHK'                     78114002
         LINE                                                           78161002
         BIN   MCHRG05                                                  78208002
         BIN   MCHRG21                                                  78255002
         LABEL 'LOCAL STORAGE A-B DEST ADDR COMPARE','B REG PTY CHK'    78302002
         LINE                                                           78349002
         BIN   MCHRG06                                                  78396002
         BIN   MCHRG22                                                  78443002
         LABEL 'LOCAL STORAGE CTRL ASSM CHK','Z REG PTY CHK'            78490002
         LINE  (38,60),(1,59),SKIP=2                                    78537002
         BIN   MCHRG07                                                  78584002
         BIN   MCHRG23                                                  78631002
         LABEL 'CTRL REG PTY CHK','D REG PTY CHK'                       78678002
         LINE  ,(14,62),SKIP=2                                          78725002
         LABEL 'BYTE 1','BYTE 3'                                        78772002
         LINE  (38,60),(1,59),SKIP=1                                    78819002
         BIN   MCHRG08                                                  78866002
         BIN   MCHRG24                                                  78913002
         LABEL 'ADDR CHK BOUND REC CHK','EXT REG DEST X COMP CHK'       78960002
         LINE                                                           79007002
         BIN   MCHRG09                                                  79054002
         BIN   MCHRG25                                                  79101002
         LABEL 'LOCAL STORAGE COMP CHK','EXT REG DEST Y COMP CHK'       79148002
         LINE                                                           79195002
         BIN   MCHRG10                                                  79242002
         BIN   MCHRG26                                                  79289002
         LABEL 'FLUSH THRU CHK','EXT REG SOURCE Y CHK'                  79336002
         LINE                                                           79383002
         BIN   MCHRG11                                                  79430002
         BIN   MCHRG27                                                  79477002
         LABEL 'H REG PTY CHK','EXT CTRL ASSM PTY CHK'                  79524002
         LINE                                                           79571002
         BIN   MCHRG12                                                  79618002
         BIN   MCHRG28                                                  79665002
         LABEL 'CLOCK COMPARATOR-CPU TIMER CHK','INTERV TIMER PTY CHK'  79712002
         LINE                                                           79759002
         BIN   MCHRG13                                                  79806002
         BIN   MCHRG29                                                  79853002
         LABEL 'P REG PTY CHK','S REC DUP CHK'                          79900002
         LINE                                                           79947002
         BIN   MCHRG14                                                  79994002
         BIN   MCHRG30                                                  80041002
         LABEL 'T REG PTY CHK','TIME OF DAY CLOCK CHK'                  80088002
         LINE  ,,SKIP=2                                                 80135002
         BIN   MCHRG15                                                  80182002
         BIN   MCHRG31                                                  80229002
         ROUTINE XDUM1,NPRT148                                 @XA19715 80276001
         LABEL 'L REG PTY CHK','CTRL STORAGE ADDR CHK'         @XA19715 80281001
************************************************************** @XA19715 80286001
         LINE  ,,SKIP=2                                        @XA19715 80291001
         BIN   MCHRG15                                         @XA19715 80296001
         BIN   MCHRG31                                         @XA19715 80301001
         ROUTINE XDUM1,PRT148                                  @XA19715 80306001
         LABEL 'L REG PTY CHK','INC/DEC CHK'                   @XA19715 80311001
************************************************************** @XA19715 80316001
         LINE  ,(40,1),SKIP=2                                           80323002
         LABEL 'MACHINE CHECK REGISTER B'                               80370002
         LINE  ,(14,62),SKIP=2                                          80417002
         LABEL 'BYTE 0','BYTE 2'                                        80464002
         LINE  (38,60),(1,59),SKIP=1                                    80511002
         BIN   MCHRGB00                                                 80558002
         BIN   MCHRGB16                                                 80605002
         LABEL 'STORAGE ADD CHK','I CYCLE HARD ERROR'                   80652002
         LINE                                                           80699002
         BIN   MCHRGB01                                                 80746002
         BIN   MCHRGB17                                                 80793002
         LABEL 'SDBI PTY CHK','DOUBLE ECC ERROR'                        80840002
         LINE                                                           80887002
         BIN   MCHRGB02                                                 80934002
         BIN   MCHRGB18                                                 80981002
         ROUTINE XDUM1,NPRT148                                 @XA19715 81028001
         LABEL 'SBDO PTR CHK','O2I CTRL LINE PTY CHK'          @XA19715 81033001
************************************************************** @XA19715 81038001
         LINE  ,                                               @XA19715 81043001
         BIN   MCHRGB02                                        @XA19715 81048001
         BIN   MCHRGB18                                        @XA19715 81053001
         ROUTINE XDUM1,PRT148                                  @XA19715 81058001
         LABEL 'SBDO PTR CHK','SPARE'                          @XA19715 81063001
************************************************************** @XA19715 81068001
         LINE                                                           81075002
         BIN   MCHRGB03                                                 81122002
         BIN   MCHRGB19                                                 81169002
         ROUTINE XDUM1,NPRT148                                 @XA19715 81216001
         LABEL 'STORE PTY CHK','BUSY CHK'                      @XA19715 81221001
************************************************************** @XA19715 81226001
         LINE  ,                                               @XA19715 81231001
         BIN   MCHRGB03                                        @XA19715 81236001
         BIN   MCHRGB19                                        @XA19715 81241001
         ROUTINE XDUM1,PRT148                                  @XA19715 81246001
         LABEL 'STORE PTR CHK','MULTIPLY CHK'                  @XA19715 81251001
************************************************************** @XA19715 81256001
         LINE                                                           81263002
         BIN   MCHRGB04                                                 81310002
         BIN   MCHRGB20                                                 81357002
         ROUTINE XDUM1,NPRT148                                 @XA19715 81404001
         LABEL 'TIME OUT CHK','ECC HARDWARE CHK'               @XA19715 81409001
************************************************************** @XA19715 81414001
         LINE  ,                                               @XA19715 81419001
         BIN   MCHRGB04                                        @XA19715 81424001
         BIN   MCHRGB20                                        @XA19715 81429001
         ROUTINE XDUM1,PRT148                                  @XA19715 81434001
         LABEL 'COUNT CHK','SHIFT LOAD CHK'                    @XA19715 81439001
************************************************************** @XA19715 81444001
         LINE                                                           81451002
         BIN   MCHRGB05                                                 81498002
         BIN   MCHRGB21                                                 81545002
         LABEL 'STORAGE PROT STACK PTY CHK','DOUBLE ECC ERROR'          81592002
         LINE                                                           81639002
         BIN   MCHRGB06                                                 81686002
         BIN   MCHRGB22                                                 81733002
         LABEL 'CLOCK SYN CHK A','SINGLE ECC ERROR'                     81780002
         LINE  (38,60),(1,59),SKIP=2                                    81827002
         BIN   MCHRGB07                                                 81874002
         BIN   MCHRGB23                                                 81921002
         LABEL 'CLOCK SYN CHK B','SINGLE DATA BIT CORRCT'               81968002
         LINE  ,(14,62),SKIP=2                                          82015002
         LABEL 'BYTE 1','BYTE 3'                                        82062002
         LINE  (38,60),(1,59),SKIP=1                                    82109002
         BIN   MCHRGB08                                                 82156002
         BIN   MCHRGB24                                                 82203002
         ROUTINE XDUM1,NPRT148                                 @XA19715 82250001
         LABEL 'M REG COMP A CHK','02I CT ERROR CORRCT'        @XA19715 82255001
************************************************************** @XA19715 82260001
         LINE  ,                                               @XA19715 82265001
         BIN   MCHRGB08                                        @XA19715 82270001
         BIN   MCHRGB24                                        @XA19715 82275001
         ROUTINE XDUM1,PRT148                                  @XA19715 82280001
         LABEL 'M REG COMP A CHK','CT ERROR CORRCT'            @XA19715 82285001
************************************************************** @XA19715 82290001
         LINE                                                           82297002
         BIN   MCHRGB09                                                 82344002
         BIN   MCHRGB25                                                 82391002
         LABEL 'M REG COMP B CHK','C32 DATA BIT CORRCT'                 82438002
         LINE                                                           82485002
         BIN   MCHRGB10                                                 82532002
         BIN   MCHRGB26                                                 82579002
         LABEL 'M REG COMP C CHK','C16 DATA BIT CORRCT'                 82626002
         LINE                                                           82673002
         BIN   MCHRGB11                                                 82720002
         BIN   MCHRGB27                                                 82767002
         LABEL 'M REG COMP D CHK','C8 DATA BIT CORRCT'                  82814002
         LINE                                                           82861002
         BIN   MCHRGB12                                                 82908002
         BIN   MCHRGB28                                                 82955002
         LABEL 'NO RELOCATE REGISTER MATCH','C4 DATA BIT CORRCT'        83002002
         LINE                                                           83049002
         BIN   MCHRGB13                                                 83096002
         BIN   MCHRGB29                                                 83143002
         LABEL 'MULT RELOCATE REG MATCH','C2 DATA BIT CORRCT'           83190002
         LINE                                                           83237002
         BIN   MCHRGB14                                                 83284002
         BIN   MCHRGB30                                                 83331002
         LABEL 'RELOCATE LRU INVALID','C1 DATA BIT CORRCT'              83378002
         LINE  (38,60),(1,59),SKIP=2                                    83425002
         BIN   MCHRGB15                                                 83472002
         BIN   MCHRGB31                                                 83519002
         LABEL 'ANY MACH CHK ON','C0 DATA BIT CORRCT'                   83566002
         EJECT                                                          83613002
         DC    X'01000B8B00'                                            83660002
         LABEL ''                                                       83707002
         LINE  (28,1),(1,1),SKIP=3                             @XA21957 83717001
         HEX   IOCREG                                          @XA21957 83727001
         ROUTINE XDUM1,PRT148                                  @XA21957 83732001
         LABEL 'IOC REGISTER'                                  @XA21957 83737001
         LINE  ,,SKIP=1                                                 83754002
         ROUTINE XCSWCS0,WHERETO                                        83801002
         LABEL ''                                                       83848002
         LINE  ,(14,62),SKIP=2                                          83895002
         LABEL 'RETRY COUNTS','RETRY REGS 1,2'                          83942002
         LINE  (38,60),(1,59)                                           83989002
         BIN   RETCNT2H                                                 84036002
         HEX   RTYREG1                                                  84083002
         LABEL 'RETRIES PER CURRENT MACRO','RETRY REG 1'                84130002
         LINE  (38,60),(1,59)                                           84177002
         HEX   NONRETRY                                                 84224002
         HEX   RTYREG2                                                  84271002
         LABEL 'NUMBER OF MACROS RETRIED','RETRY REG 2'                 84318002
         LINE  ,(14,62),SKIP=2                                          84365002
         LABEL 'RETRY REG 3','RETRY REG 4'                              84412002
         LINE  (38,60),(1,59),SKIP=1                                    84459002
         BIN   HREG0                                                    84506002
         BIN   RTYRG404                                                 84553002
         LABEL 'MACHINE CHECK TRAP','DEST BYTE LINE 0'                  84600002
         LINE                                                           84647002
         BIN   HREG1                                                    84694002
         BIN   RTYRG405                                                 84741002
         LABEL 'RETRY TRAP','DEST BYTE LINE 1'                          84788002
         LINE                                                           84835002
         BIN   HREG2                                                    84882002
         BIN   RTYRG406                                                 84929002
         LABEL 'CPU HIGH TRAP','DEST BYTE LINE 2'                       84976002
         LINE                                                           85023002
         BIN   HREG3                                                    85070002
         BIN   RTYRG407                                                 85117002
         LABEL 'INT FILE ADPTR OR SEL CHN 1,2 OR 3','DEST BYTE LINE 3'  85164002
         LINE                                                           85211002
         BIN   HREG4                                                    85258002
         LABEL 'SEL CHN 1,2,3(IF IFA) OR SEL CHN 4','RETRY FLAGS'       85305002
         LINE  (38,60),(1,59)                                           85352002
         BIN   HREG5                                                    85399002
         BIN   RTYRG408                                                 85446002
         LABEL 'MPX TRAP','STORAGE 2 CYCLE ERROR'                       85493002
         LINE                                                           85540002
         BIN   HREG6                                                    85587002
         BIN   RTYRG409                                                 85634002
         LABEL 'INT FILE ADAPTR TRAP','TYPE 1 ERROR'                    85681002
         LINE                                                           85728002
         BIN   HREG7                                                    85775002
         BIN   RTYRG410                                                 85822002
         LABEL 'STORE-DISPLAY','TYPE 2 ERROR'                           85869002
         LINE  (98,1),(60,1)                                            85916002
         BIN   RTYRG411                                                 85963002
         LABEL 'TYPE 3 ERROR'                                           86010002
         LINE  (38,60),(1,59)                                           86057002
         ROUTINE   REGUNU,SKIPPER                                       86104002
         BIN   RTYRG412                                                 86151002
         LABEL 'CTRL WORD ADDR AT TIME','LOCAL(0) OR EXT REG(1) DEST'   86198002
         LINE  (38,60),(5,55)                                           86245002
         HEX   RETRG23                                                  86292002
         BIN   RTYRG413                                                 86339002
         LABEL 'OF FAILURE','STORAGE WORD IN ERROR'                     86386002
         LINE  (98,1),(60,1)                                            86433002
         BIN   RTYRG414                                                 86480002
         LABEL 'ERROR IN TRAP 2 CYCLE'                                  86527002
         LINE                                                           86574002
         BIN   RTYRG415                                                 86621002
         LABEL 'SPARE'                                                  86668002
         LINE  ,(5,55)                                                  86715002
         LABEL 'CONTROL WORD','LOCAL STORAGE DEST'                      86762002
         LINE  (12,86),(64,1)                                           86809002
         HEX   CTRLDWD                                                  86856002
         BIN   RTYRG417                                                 86903002
         LABEL ' ','YYY'                                                86950002
         LINE  (98,1),(65,1)                                            86997002
         BIN   RTYRG420                                                 87044002
         LABEL 'XXX'                                                    87091002
         LINE  (98,1),(60,1),SKIP=2                                     87138002
         BIN   RTYEXP                                                   87148002
         LABEL 'LOCAL STORE(0) OR EXP LOCAL STORE(1)'                   87158002
         LINE  ,(60,1),SKIP=1                                           87168002
         LABEL 'EXTERNAL REGISTER DEST'                                 87178002
         LINE  (98,1),(65,1)                                            87232002
         BIN   RTYRG425                                                 87279002
         LABEL 'YYY'                                                    87326002
         LINE  (98,1),(65,1),SKIP=2                                     87373002
         BIN   RTYRG428                                                 87420002
         LABEL 'XXX'                                                    87467002
         LINE  ,(40,1),SKIP=2                                           87514002
         LABEL 'SYSTEM REGISTER'                                        87561002
         LINE  ,(14,62),SKIP=2                                          87608002
         LABEL 'BYTE 0','BYTE 2'                                        87655002
         LINE  (38,60),(1,59),SKIP=1                                    87702002
         BIN   SYSREG00                                                 87749002
         BIN   SYSREG16                                                 87796002
         LABEL 'MACHINE CHK INTERPT PENDING','ENABLE CLEAR SWITCH'      87843002
         LINE                                                           87890002
         BIN   SYSREG01                                                 87937002
         BIN   SYSREG17                                                 87984002
         LABEL 'RETRY ROUTINE','TMPL'                                   88031002
         LINE                                                           88078002
         BIN   SYSREG02                                                 88125002
         BIN   SYSREG18                                                 88172002
         LABEL 'MACHINE CHK ROUTINE','LOAD FILE WAIT'                   88219002
         LINE                                                           88266002
         BIN   SYSREG03                                                 88313002
         BIN   SYSREG19                                                 88360002
         LABEL 'DOCUMENTARY CONSOLE 2','CE KEY IN CE MODE'              88407002
         LINE                                                           88454002
         BIN   SYSREG04                                                 88501002
         BIN   SYSREG20                                                 88548002
         LABEL 'LOG PRESENT','IPL'                                      88595002
         LINE                                                           88642002
         BIN   SYSREG05                                                 88689002
         BIN   SYSREG21                                                 88736002
         LABEL 'SPARE','POWER ON RESET'                                 88783002
         LINE                                                           88830002
         BIN   SYSREG06                                                 88877002
         BIN   SYSREG22                                                 88924002
         LABEL 'I/O INSTN LATCH','SPARE'                                88971002
         LINE  (38,60),(1,59),SKIP=2                                    89018002
         BIN   SYSREG07                                                 89065002
         BIN   SYSREG23                                                 89112002
         LABEL 'FORCE MODULE 0 TO LSCS','INSTR PROC LATCH'              89159002
         LINE  ,(14,62),SKIP=1                                          89206002
         LABEL 'BYTE 1','BYTE 3'                                        89253002
         LINE  (38,60),(1,59)                                           89300002
         BIN   SYSREG08                                                 89347002
         BIN   SYSREG24                                                 89394002
         LABEL 'ADDR CONTENTS','MACHINE CHECK TRAP'                     89441002
         LINE                                                           89488002
         BIN   SYSREG09                                                 89535002
         BIN   SYSREG25                                                 89582002
         LABEL 'CPU INTRPT FORCE','RETRY TRAP'                          89629002
         LINE                                                           89676002
         BIN   SYSREG10                                                 89723002
         BIN   SYSREG26                                                 89770002
         LABEL 'SAR INTRPT FORCE','CPU HIGH TRAP'                       89817002
         LINE                                                           89864002
         BIN   SYSREG11                                                 89911002
         BIN   SYSREG27                                                 89958002
         LABEL 'PSW RESTART','INT FILE ADAPTR OR SEL CHN 1,2 OR 3'      90005002
         LINE                                                           90052002
         BIN   SYSREG12                                                 90099002
         BIN   SYSREG28                                                 90146002
         LABEL 'EC MODE','SEL CHN 1,2,3(IF IFA) OR SEL CHN 4'           90193002
         LINE                                                           90240002
         BIN   SYSREG13                                                 90287002
         BIN   SYSREG29                                                 90334002
         LABEL 'SYS CTRL INTRPT','MPX TRAP'                             90381002
         LINE                                                           90428002
         BIN   SYSREG14                                                 90475002
         BIN   SYSREG30                                                 90522002
         LABEL 'TIMER INTRPT FORCE','INT FILE ADAPTR TRAP'              90569002
         LINE  (38,60),(1,59),SKIP=1                                    90616002
         BIN   SYSREG15                                                 90663002
         BIN   SYSREG31                                                 90710002
         LABEL 'PRTY INTRUPT','STORE-DISPLAY'                           90757002
         EJECT                                                          90804002
         DC    X'01000B8B00'                                            90851002
         LABEL ''                                                       90898002
         LINE  ,(40,1),SKIP=2                                           90945002
         LABEL '--- LOCAL STORAGE REGISTERS'                            90992002
         LINE  ,(14,53),SKIP=2                                          91039002
         LABEL 'I REGISTER','U REGISTER'                                91086002
         LINE  (23,74),(1,59),SKIP=1                                    91133002
         HEX   IREG                                                     91180002
         BIN   UREGA1                                                   91227002
         LABEL 'KEY','INSTR LENGTH CODE'                                91274002
         LINE                                                           91321002
         HEX   IREGB                                                    91368002
         BIN   UREGA2                                                   91415002
         LABEL 'INSTR ADDR','CONDITION CODE'                            91462002
         LINE  (97,1),(60,1)                                            91509002
         BIN   UREGA3                                                   91556002
         LABEL 'PROGRAM MASK'                                           91603002
         LINE                                                           91650002
         BIN   UREGA4                                                   91697002
         LABEL 'SPECIAL CPU USE'                                        91744002
         LINE                                                           91791002
         BIN   UREGA5                                                   91838002
         LABEL 'AMWP BITS'                                              91885002
         LINE                                                           91932002
         HEX   UREGC1                                                   91979002
         LABEL 'OP CODE'                                                92026002
         LINE  (97,1),(60,1),SKIP=1                                     92073002
         HEX   UREGC2                                                   92120002
         LABEL 'IMMEDIATE BYTE'                                         92167002
         LINE                                                           92214002
SHRTLAB  LABEL ''                                                       92261002
SHRTENT  LINE  ,(2,35),SKIP=1                                           92308002
         ROUTINE    XCHID,SELCHAN                                       92355002
         LABEL 'INSTRUCTION CODES',' ---UNIT ADDRESS --','UCW ADDRESS',X92402002
               'SEQ CODE'                                               92449002
         LINE  (25,30),(1,1),SKIP=1                                     92496002
         BIN   MCHLOG00                                                 92543002
         HEX   MCHLOG08                                                 92590002
         HEX   MCHLOG09                                                 92637002
         HEX   MBSLOG01                                                 92684002
         LABEL 'CHAN LOADED  X'                                         92731002
         LINE  (25,1),(1,1)                                             92778002
         BIN   MCHLOG01                                                 92825002
         LABEL 'CONTROL COMMAND'                                        92872002
         LINE  (25,1),(1,36)                                            92919002
         BIN   MCHLOG02                                                 92966002
         LABEL 'CHAINING','--- INTERRUPT BUFFER','--- BUS IN --',      X93013002
               'BUS OUT'                                                93060002
         LINE  (25,30),(1,1)                                            93107002
         BIN   MCHLOG03                                                 93154002
         HEX   MBSLOGA                                                  93201002
         HEX   MPXBUSIN                                                 93248002
         HEX   MPXBSOUT                                                 93295002
         LABEL 'SHARE REQ'                                              93342002
         LINE  (25,1),(1,1)                                             93389002
         BIN   MCHLOG04                                                 93436002
         LABEL 'INTERRUPT'                                              93483002
         LINE  (25,1),(1,36)                                            93530002
         BIN   MCHLOG05                                                 93577002
         LABEL 'HIO','--- MC REG ---','--- MD REG ---','COUNT'          93624002
         LINE  (25,30),(1,30)                                           93671002
         BIN   MCHLOG06                                                 93718002
         HEX   MCLOCREG                                                 93765002
         HEX   MDREGADD                                                 93812002
         HEX   STORCNTH                                                 93859002
         LABEL 'TIO','  KEY','','    HIGH(MF2)'                         93906002
         LINE  (25,30),(1,32),SKIP=2                                    93953002
         BIN   MCHLOG07                                                 94000002
         HEX   CCWADDR                                                  94047002
         HEX   MDCATNBR                                                 94094002
         HEX   STORCNTL                                                 94141002
         ROUTINE XCSWCS0,CATNBR                                         94188002
         LABEL 'SIO','NEXT CCW ADDR','','LO(MF3)'                       94235002
         LINE  ,(2,30),SKIP=2                                           94282002
         LABEL 'FLAGS AND OPS(MF0)','TAGS IN(MTI)','TAGS OUT(MTO)',    C94329002
               'UCW/CHAN STATUS(MF1)'                                   94349002
         LINE  (25,30),(1,29),SKIP=1                                    94376002
         BIN   LOCFLG00                                                 94423002
         BIN   MPXTAG08                                                 94470002
         BIN   MPXTAG00                                                 94517002
         BIN   CHSTAT00                                                 94564002
         LABEL 'CHAIN DATA','OP IN','OP OUT','ACTIVE/PCI'               94611002
         LINE                                                           94658002
         BIN   LOCFLG01                                                 94705002
         BIN   MPXTAG09                                                 94752002
         BIN   MPXTAG01                                                 94799002
         BIN   CHSTAT01                                                 94846002
         LABEL 'CHAIN COMMAND','ADDR IN','SEL OUT','WLR'                94893002
         LINE                                                           94940002
         BIN   LOCFLG02                                                 94987002
         BIN   MPXTAG10                                                 95034002
         BIN   MPXTAG02                                                 95081002
         BIN   CHSTAT02                                                 95128002
         LABEL 'SLI','STAT IN SIG','ADR OUT','PROG CK'                  95175002
         LINE                                                           95222002
         BIN   LOCFLG03                                                 95269002
         BIN   MPXTAG11                                                 95316002
         BIN   MPXTAG03                                                 95363002
         BIN   CHSTAT03                                                 95410002
         LABEL 'SKIP','SRV IN SIG','CMD OUT','PROT CK'                  95457002
         LINE                                                           95504002
         BIN   LOCFLG04                                                 95551002
         BIN   MPXTAG12                                                 95598002
         BIN   MPXTAG04                                                 95645002
         BIN   CHSTAT04                                                 95692002
         LABEL 'PCI','SEL IN','SRV OUT','CHAN DATA CK'                  95739002
         LINE                                                           95786002
         BIN   LOCFLG05                                                 95833002
         BIN   MPXTAG13                                                 95880002
         BIN   MPXTAG05                                                 95927002
         BIN   CHSTAT05                                                 95974002
         LABEL 'DA ','MPX REQUEST','MPX INT','CHAN CTRL CHECK'          96021002
         LINE                                                           96068002
         BIN   LOCFLG06                                                 96115002
         BIN   MPXTAG14                                                 96162002
         BIN   MPXTAG06                                                 96209002
         BIN   CHSTAT06                                                 96256002
         LABEL 'INPUT/OUTPUT','CONSOLE REQ/MPX','SUPR OUT',            X96303002
               'I/F CTL CHECK'                                          96350002
         LINE  (25,30),(1,29),SKIP=2                                    96397002
         BIN   LOCFLG07                                                 96444002
         BIN   MPXTAG15                                                 96491002
         BIN   MPXTAG07                                                 96538002
         BIN   CHSTAT07                                                 96585002
         LABEL 'INCR/DECR','DISC IN','MPX CHECK','STATUS NEXT'          96632002
         LINE  ,(40,1),SKIP=2                                           96679002
         LABEL 'DOCUMENTARY CONSOLE WORD'                               96726002
         LINE  (15,30),(1,30)                                           96773002
         HEX   CONSWDIN                                                 96820002
         HEX   CONSWOUT                                                 96867002
         LABEL 'BUS IN','BUS OUT','TA','TT'                             96914002
         LINE  (85,30),(60,30),SKIP=1                                   96961002
         BIN   CONSWD00                                                 97008002
         BIN   CONSWD08                                                 97055002
         ROUTINE XDUM1,TEST148                                 @XA19715 97075001
         LABEL 'READ LATCH','ATTENTION'                                 97102002
         LINE                                                           97149002
         BIN   CONSWD01                                                 97196002
         BIN   CONSWD09                                                 97243002
         LABEL 'WRITE LATCH','READY'                                    97290002
         LINE                                                           97337002
         BIN   CONSWD02                                                 97384002
         BIN   CONSWD10                                                 97431002
         LABEL 'STACKED REQ','ALTER/DISPLAY MODE'              @XA19715 97478001
         LINE                                                           97525002
         BIN   CONSWD03                                                 97572002
         BIN   CONSWD11                                        @XA19715 97619001
         LABEL 'SHARE RESET','TIME OUT'                        @XA19715 97659001
         LINE                                                           97713002
         BIN   CONSWD04                                                 97760002
         BIN   CONSWD12                                        @XA19715 97807001
         LABEL 'ATTEN RESET','BALL SIDE'                       @XA19715 97847001
         LINE                                                           97901002
         BIN   CONSWD05                                                 97948002
         BIN   CONSWD13                                        @XA19715 97995001
         LABEL 'SEN SHARE SET','END'                           @XA19715 97999001
************************************************************** @XA19715 98003001
         LINE  ,                                               @XA19715 98007001
         BIN   CONSWD06                                        @XA19715 98011001
         BIN   CONSWD14                                        @XA19715 98015001
         LABEL 'SPARE','CONSOLE REQ'                           @XA19715 98019001
************************************************************** @XA19715 98023001
         LINE  ,,SKIP=2                                        @XA19715 98027001
         BIN   CONSWD07                                        @XA19715 98031001
         BIN   CONSWD15                                        @XA19715 98035001
         LABEL 'ALARM','CANCEL'                                @XA19715 98039001
************************************************************** @XA19715 98043001
         LINE  ,,SKIP=1                                        @XA19715 98047001
         ROUTINE XDUM1,JUMPN148                                @XA19715 98051001
LAB148   LABEL ' '                                             @XA19715 98055001
************************************************************** @XA19715 98059001
LINE148  LINE  (85,30),(60,30),SKIP=1                          @XA19715 98063001
         BIN   CONSWD00                                        @XA19715 98067001
         ROUTINE CONSWD08,EXTPTR                               @XA19715 98071001
         LABEL 'READ MODE'                                     @XA19715 98075001
************************************************************** @XA19715 98079001
         LINE  ,                                               @XA19715 98083001
         BIN   CONSWD01                                        @XA19715 98087001
         BIN   CONSWD10                                        @XA19715 98091001
         LABEL 'WRITE MODE','ALTER/DISPLAY MODE'               @XA19715 98095001
************************************************************** @XA19715 98099001
         LINE  ,                                               @XA19715 98103001
         BIN   CONSWD02                                        @XA19715 98107001
         BIN   CONSWD11                                        @XA19715 98111001
         LABEL 'STACKED REQUEST','TIME OUT'                    @XA19715 98115001
************************************************************** @XA19715 98119001
         LINE  ,                                               @XA19715 98123001
         BIN   CONSWD03                                        @XA19715 98127001
         BIN   CONSWD12                                        @XA19715 98131001
         LABEL 'REQUEST RESET','CPU LOCK'                      @XA19715 98135001
************************************************************** @XA19715 98139001
         LINE  ,                                               @XA19715 98143001
         BIN   CONSWD04                                        @XA19715 98147001
         BIN   CONSWD13                                        @XA19715 98151001
         LABEL 'GENERAL RESET','END'                           @XA19715 98155001
************************************************************** @XA19715 98159001
         LINE  ,                                               @XA19715 98163001
         BIN   CONSWD05                                        @XA19715 98167001
         BIN   CONSWD14                                        @XA19715 98171001
         LABEL 'CCW IN IOCR (EXT 1F)','REQUEST'                @XA19715 98175001
************************************************************** @XA19715 98179001
         LINE  ,                                               @XA19715 98183001
         BIN   CONSWD06                                        @XA19715 98187001
         BIN   CONSWD15                                        @XA19715 98191001
         LABEL 'SET CIO INTERRUPT','SET BURST MODE'            @XA19715 98195001
************************************************************** @XA19715 98199001
         LINE  ,                                               @XA19715 98203001
         BIN   CONSWD07                                        @XA19715 98207001
LABN148  LABEL 'MODIFIER'                                      @XA19715 98211001
************************************************************** @XA19715 98215001
         EJECT                                                          98230002
VS2LINE  LINE  ,,SKIP=1                                        @YM2954P 98277002
         ROUTINE XCHID,VS2TEST                                 @YM2954P 98287002
VS2LAB   LABEL ''                                              @YM2954P 98297002
         LINE  (30),(1),SKIP=2                                 @YM2954P 98307002
         HEX   VCCHPR1                                         @YM2954P 98317002
         LABEL 'CCH FOOTPRINTS'                                @YM2954P 98327002
         LINE  (50,1),(20,1),SKIP=1                            @YM2954P 98337002
         BIN   VCCHPR01                                        @YM2954P 98347002
         LABEL 'IOS GPRS SAVED'                                @YM2954P 98357002
         LINE  ,                                               @YM2954P 98367002
         BIN   VCCHPR02                                        @YM2954P 98377002
         LABEL 'UCB ADDRESS ZERO'                              @YM2954P 98387002
         LINE  ,                                               @YM2954P 98397002
         BIN   VCCHPR03                                        @YM2954P 98407002
         LABEL 'ERPIB EXISTS'                                  @YM2954P 98417002
         LINE  ,                                               @YM2954P 98427002
         BIN   VCCHPR04                                        @YM2954P 98437002
         LABEL 'IGFCCHSI ENTERED'                              @YM2954P 98447002
         LINE  ,                                               @YM2954P 98457002
         BIN   VCCHPR05                                        @YM2954P 98467002
         LABEL 'IGFCCHII ENTERED'                              @YM2954P 98477002
         LINE  ,                                               @YM2954P 98487002
         BIN   VCCHPR06                                        @YM2954P 98497002
         LABEL 'IGFCCHFE ENTERED'                              @YM2954P 98507002
         LINE  ,                                               @YM2954P 98517002
         BIN   VCCHPR07                                        @YM2954P 98527002
         LABEL 'IGFC60 ENTERED'                                @YM2954P 98537002
         LINE  ,                                               @YM2954P 98547002
         BIN   VCCHPR08                                        @YM2954P 98557002
         LABEL 'IGFC70 ENTERED'                                @YM2954P 98567002
         LINE  ,                                               @YM2954P 98577002
         BIN   VCCHPR09                                        @YM2954P 98587002
         LABEL 'IGDC80 ENTERED'                                @YM2954P 98597002
         LINE  ,                                               @YM2954P 98607002
         BIN   VCCHPR10                                        @YM2954P 98617002
         LABEL 'IGFCIC ENTERED'                                @YM2954P 98627002
         LINE  ,                                               @YM2954P 98637002
         BIN   VCCHPR11                                        @YM2954P 98647002
         LABEL 'IGFCCHRD ENTERED'                              @YM2954P 98657002
         LINE  ,                                               @YM2954P 98667002
         BIN   VCCHPR12                                        @YM2954P 98677002
         LABEL 'IGFCCHMP ENTERED'                              @YM2954P 98687002
         LINE  ,                                               @YM2954P 98697002
         BIN   VCCHPR13                                        @YM2954P 98707002
         LABEL 'IGFCCHUC ENTERED'                              @YM2954P 98717002
         LINE  ,                                               @YM2954P 98727002
         BIN   VCCHPR14                                        @YM2954P 98737002
         LABEL 'IGFCCHAS ENTERED'                              @YM2954P 98747002
         LINE  ,                                               @YM2954P 98757002
         BIN   VCCHPR15                                        @YM2954P 98767002
         LABEL 'IGFCCHIO ENTERED'                              @YM2954P 98777002
         LINE  ,,SKIP=2                                        @YM2954P 98787002
         BIN   VCCHPR16                                        @YM2954P 98797002
         LABEL 'IGFCCHEX ENTERED'                              @YM2954P 98807002
         LINE  ,(30,30),SKIP=2                                 @YM2954P 98817002
         ROUTINE    XCHID,SKIPPER                              @YM2954P 98827002
         LABEL 'MULTIPROCESSING INFORMATION'                   @YM2954P 98837002
         LINE  ,(49,1),SKIP=1                                  @YM2954P 98847002
         LABEL '0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15'         98857002
         LINE  (25,25),(30,30),SKIP=1                          @YM2954P 98867002
         HEX   (VPROC01)                                       @YM2954P 98877002
         ROUTINE    VCHST01,PROC                               @YM2954P 98887002
         LABEL ''                                              @YM2954P 98897002
         LINE  ,                                               @YM2954P 98907002
         HEX   (VPROC02)                                       @YM2954P 98917002
         ROUTINE    VCHST02,PROC                               @YM2954P 98927002
         LABEL ''                                              @YM2954P 98937002
         LINE  ,                                               @YM2954P 98947002
         HEX   (VPROC03)                                       @YM2954P 98957002
         ROUTINE    VCHST03,PROC                               @YM2954P 98967002
         LABEL ''                                              @YM2954P 98977002
         LINE  ,                                               @YM2954P 98987002
         HEX   (VPROC04)                                       @YM2954P 98997002
         ROUTINE    VCHST04,PROC                               @YM2954P 99007002
         LABEL ''                                              @YM2954P 99017002
         LINE  ,                                               @YM2954P 99027002
         HEX   (VPROC05)                                       @YM2954P 99037002
         ROUTINE    VCHST05,PROC                               @YM2954P 99047002
         LABEL ''                                              @YM2954P 99057002
         LINE  ,                                               @YM2954P 99067002
         HEX   (VPROC06)                                       @YM2954P 99077002
         ROUTINE    VCHST06,PROC                               @YM2954P 99087002
         LABEL ''                                              @YM2954P 99097002
         LINE  ,                                               @YM2954P 99107002
         HEX   (VPROC07)                                       @YM2954P 99117002
         ROUTINE    VCHST07,PROC                               @YM2954P 99127002
         LABEL ''                                              @YM2954P 99137002
         LINE  ,                                               @YM2954P 99147002
         HEX   (VPROC08)                                       @YM2954P 99157002
         ROUTINE    VCHST08,PROC                               @YM2954P 99167002
         LABEL ''                                              @YM2954P 99177002
         LINE  ,                                               @YM2954P 99187002
         HEX   (VPROC09)                                       @YM2954P 99197002
         ROUTINE    VCHST09,PROC                               @YM2954P 99207002
         LABEL ''                                              @YM2954P 99217002
         LINE  ,                                               @YM2954P 99227002
         HEX   (VPROC10)                                       @YM2954P 99237002
         ROUTINE    VCHST10,PROC                               @YM2954P 99247002
         LABEL ''                                              @YM2954P 99257002
         LINE  ,                                               @YM2954P 99267002
         HEX   (VPROC11)                                       @YM2954P 99277002
         ROUTINE    VCHST11,PROC                               @YM2954P 99287002
         LABEL ''                                              @YM2954P 99297002
         LINE  ,                                               @YM2954P 99307002
         HEX   (VPROC12)                                       @YM2954P 99317002
         ROUTINE    VCHST12,PROC                               @YM2954P 99327002
         LABEL ''                                              @YM2954P 99337002
         LINE  ,                                               @YM2954P 99347002
         HEX   (VPROC13)                                       @YM2954P 99357002
         ROUTINE    VCHST13,PROC                               @YM2954P 99367002
         LABEL ''                                              @YM2954P 99377002
         LINE  ,                                               @YM2954P 99387002
         HEX   (VPROC14)                                       @YM2954P 99397002
         ROUTINE    VCHST14,PROC                               @YM2954P 99407002
         LABEL ''                                              @YM2954P 99417002
         LINE  ,                                               @YM2954P 99427002
         HEX   (VPROC15)                                       @YM2954P 99437002
         ROUTINE    VCHST15,PROC                               @YM2954P 99447002
         LABEL ''                                              @YM2954P 99457002
         LINE  ,                                               @YM2954P 99467002
         HEX   (VPROC16)                                       @YM2954P 99477002
         ROUTINE    VCHST16,PROC                               @YM2954P 99487002
         LABEL ''                                              @YM2954P 99497002
DUMPCODE DC    XL1'FF'                                         @YM2954P 99507002
DUMPSIZE DC    XL2'FC'                                         @YM2954P 99517002
         DC    XL2'18'                                         @YM2954P 99527002
ADDRLABL DC    XL2'0'                                          @YM2954P 99537002
LABLAREA EQU   *                                               @YM2954P 99547002
         LSTART ,                                              @YM2954P 99557002
         END   ENTRYPTR                                        @YM2954P 99567002
