         TITLE 'IFCETUL1 MODEL  145 MACHINE CHECK EDIT'                 00040002
*                                  DSGEN MACRO     DSGEN MACRO          00080002
*                                  DSGEN MACRO     DSGEN MACRO          00120002
         SPACE 2                                                        00160002
         MACRO                                                          00200002
&NAME    DSGEN                                                          00240002
.*       THIS  MACRO               GENERATES ONE DSECT WORD             00280002
.*       FORMATTED FOR             THE SUBJECT LOG RECORD               00320002
.*       EACH  OPERAND             HAS TWO SUB LISTS. THE               00360002
.*       FIRST IS                  THE NAME OF THE LOG ITEM             00400002
.*       WHILE THE                 SECOND IS THE # OF BITS TO           00440002
.*       ALLOCATE FOR              THIS ITEM. ITEMS MUST                00480002
.*       BE    DEFINED             CONTIGUOUSLY WITHOUT GAPS            00520002
.*       UNUSED BIT                GROUPS MUST BE GIVEN                 00560002
.*       DUMMY NAMES.              THE NAMES PROVIDED FOR               00600002
.*       THE   LOG                 ITEMS MAY THEN BE USED IN            00640002
.*       THE   CONVERSION          MACRO INSTRUCTIONS.                  00680002
         GBLC  &ITEM(2000)                                              00720002
         GBLA  &ITEMNBR,&BITS(2000),&SHIFT(2000)                        00760002
         LCLB  &ONLY1,&CTIND                                            00800002
         LCLA  &START1,&START2,&END1,&END2                              00840002
         LCLC  &SYMBOL,&EQUSYM                                          00880002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 00920002
         ACTR  100000                                                   00960002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            01000002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     01040002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' AND '&SYSLIST(&OP+1,4)' EQ '').ERR1  01080002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   01120002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        01160002
&START1  SETA  &SYSLIST(&OP+1,3)   GET START COUNT OF 1                 01200002
&START2  SETA  &SYSLIST(&OP+1,4)   GET FIRST END COUNT                  01240002
         AGO   .SET2A              BRANCH AROUND                        01280002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              01320002
         MEXIT                                                          01360002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X01400002
               ).SET2                   TEST FOR NO SECOND              01440002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   01480002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        01520002
&END1    SETA  &SYSLIST(&OP+1,5)   GET START COUNT OF 2                 01560002
&END2    SETA  &SYSLIST(&OP+1,6)   GET END COUNT OF 2                   01600002
         AGO   .LOOP                                                    01640002
.SET2    ANOP                                                           01680002
&ONLY1   SETB  1                   INDICATE ONLY ONE CONCATENATION      01720002
         AGO   .LOOP                                                    01760002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             01800002
         MEXIT                                                          01840002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               01880002
         MEXIT                                                          01920002
.LOOP    ANOP                                                           01960002
&OP      SETA  &OP+1                                                    02000002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           02040002
&ITEMNBR SETA  &ITEMNBR+1                                               02080002
         AIF   ('&SYSLIST(&OP,2)'  NE '').OK1                           02120002
         MNOTE '**NULL BIT COUNT FIELD**'                               02160002
         MEXIT                                                          02200002
.OK1     ANOP                                                           02240002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        02280002
         AIF   ('&SYMBOL'          NE '').OK                            02320002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         02360002
         AIF   ('&SYSLIST(&OP,3)'  NE 'EQU').CNT                        02400002
         AGO   .START              GET NEXT                             02440002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        02480002
         AIF   ('&SYSLIST(&OP,3)'  EQ 'EQU').EQU   TEST FOR EQU         02520002
         AIF   (&ONLY1).OK2        TEST FOR ONLY ONE CONCAT             02560002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1' GET 1 AND 2 CONCAT               02600002
         AGO   .NO3                BRANCH AROUND                        02640002
.OK2     ANOP                                                           02680002
&SYMBOL  SETC  '&SYMBOL.&START1'   GET 1 CONCATENATED                   02720002
.NO3     ANOP                                                           02760002
&SYMBOL  EQU   *+&BYTE                                                  02800002
&ITEM(&ITEMNBR) SETC '&SYMBOL'     GET LABEL IN GLOBAL                  02840002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    02880002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    02920002
.CNT     ANOP                                                           02960002
&CTIND   SETB  1                   SET COUNT INDICATOR                  03000002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   03040002
&BYTE    SETA  &COUNT/8                                                 03080002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        03120002
         AIF   (&ONLY1).TSTST      TEST FOR ONLY ONE CONCAT             03160002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             03200002
&END1    SETA  &END1+1             INCREMENT COUNT                      03240002
&OP      SETA  &OP-1               DECREMENT INCREMENT                  03280002
         AGO   .LOOP               GENERATE NEXT                        03320002
.TSTST   ANOP                                                           03360002
         AIF   (&START1            EQ &START2).LPDONE   TEST FOR END    03400002
         AIF   (&ONLY1).NSET1      TEST FOR ONLY ONE CONCAT             03440002
&END1    SETA  &SYSLIST(&OP,5)     RE-INIT SECOND START COUNT           03480002
.NSET1   ANOP                                                           03520002
&OP      SETA  &OP-1               DECREMENT INDEX                      03560002
&START1  SETA  &START1+1           INCREMENT FIRST COUNT                03600002
         AGO   .LOOP               GO DO NEXT                           03640002
.LPDONE  ANOP                                                           03680002
&ONLY1   SETB  0                   CLEAR INDICATOR                      03720002
         AGO   .START              GO TEST FOR MORE SUB-LISTS           03760002
.DONE    AIF   (&COUNT-&COUNT/8*8  NE 0).ERR  TEST FOR MULTIPLE OF 8    03800002
         AIF   (&CTIND             EQ 0).END        NO DS IF NO COUNT   03840002
&COUNT   SETA  &COUNT/8            GET NUMBER OF BYTES                  03880002
&NAME    DS    &COUNT.C                                                 03920002
.END     MEXIT                                                          03960002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          04000002
         MEXIT                                                          04040002
.EQU     AIF   ('&SYSLIST(&OP,4)'  NE '').EQU1     TEST FOR NULL LABEL  04080002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   04120002
         MEXIT                                                          04160002
.EQU1    AIF   (&SYSLIST(&OP,2)    LT 16).EQU2  COUNT OVER FIFTEEN      04200002
*****               THE FOLLOWING STATEMENT                *****        04240002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        04280002
.EQU2    ANOP                                                           04320002
&EQUCNT  SETA  0                   CLEAR COUNTER                        04360002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'   GET EQU OPERAND                      04400002
.EQULOP  ANOP                                                           04440002
&EQUCNT  SETA  &EQUCNT+1           INCREMENT INDEX                      04480002
         AIF   ('&ITEM(&EQUCNT)'   EQ '&EQUSYM').EQUOUT  LABEL FOUND?   04520002
         AIF   (&EQUCNT            EQ &ITEMNBR).ERR4    ALL TESTED?     04560002
         AGO   .EQULOP             NO-GET NEXT                          04600002
.EQUOUT  ANOP                                                           04640002
&ITEM(&ITEMNBR) SETC '&SYMBOL'     GET LABEL NAME                       04680002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2) GET NUMBER OF BITS                 04720002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT) GET SHIFT COUNT                   04760002
&SYMBOL  EQU   &EQUSYM             THIS SYMBOL EQUATED                  04800002
         AGO   .START              RETURN FOR NEXT                      04840002
         MEND                                                           04880002
*                                                                       04920002
*                                                                       04960002
         MACRO                                                          05000002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      05040002
.*       THIS  MACRO               ESTABLISHES THE MARGINS OR           05080002
.*       COLUMN SETTINGS           FOR EACH LINE. IT                    05120002
.*       GENERATES NECESSARY       CARRIAGE CONTROL                     05160002
.*       ENTRIES. LASTLY           IT DETERMINES THE                    05200002
.*       NUMBER OF                 ENTRIES ASSOCIATED WITH              05240002
.*       THE   PREVIOUS            LINE AND STORES THAT #               05280002
.*       INTO  THE                 APPROPRIATE BYTE.                    05320002
.*                                                                      05360002
.*       &DATA(1) -                CHARACTER POSITION TO                05400002
.*       BEGIN DATA.                                                    05440002
.*                                                                      05480002
.*       &DATA(2) -                # OF SPACES BETWEEN                  05520002
.*       SUCCESSIVE DATA           COLUMN STARTING                      05560002
.*       CHARACTERS.                                                    05600002
.*                                                                      05640002
.*       &LABEL(1) -               CHARACTER POSITION                   05680002
.*       TO    BEGIN               LABELS.                              05720002
.*                                                                      05760002
.*       &LABEL(2) -               # OF SPACES BETWEEN                  05800002
.*       LINE'S LABEL              STARTING CHARACTERS.                 05840002
.*                                                                      05880002
.*       &SKIP= -                  # OF LINES TO ADVANCE                05920002
.*       CARRIAGE TO               BEGIN NEXT PRINTED LINE.             05960002
.*                                                                      06000002
.*       NEW   ENTRIES             ARE GENERATED ONLY WHEN              06040002
.*       NECESSARY. OMISSION       OF ITEMS MEANS                       06080002
.*       THEY  HAVE                NOT CHANGED SINCE PREVIOUS           06120002
.*       SETTINGS. A               LINE MACRO IS REQUIRED               06160002
.*       FOR   EACH                PRINTED LINE. IF NO SETTING          06200002
.*       CHANGES ARE               REQUIRED ALL OPERANDS                06240002
.*       ARE   OMITTED             IN WHICH CASE ONLY THE               06280002
.*       #     OF                  ENTRIES FOR THE PREVIOUS LINE        06320002
.*       IS    COMPUTED.           THIS MACRO MUST BE THE               06360002
.*       FIRST MACRO               INSTRUCTION ISSUED FOR               06400002
.*       THE   SUBJECT             LINE.                                06440002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  06480002
         GBLA  &LASTCC,&INITIAL                                         06520002
         GBLC  &NRENTSX                                                 06560002
         GBLC  &CARRCON                                                 06600002
         GBLB  &TEST                                                    06640002
         LCLA  &S                                                       06680002
&NAME    DS    0C                                                       06720002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  06760002
         LINEND                                                         06800002
         AGO   .NTFIRST                                                 06840002
.FIRSTLN ANOP                                                           06880002
&NRENTSX SETC  'N&SYSNDX'                                               06920002
&INITIAL SETA  1                                                        06960002
N&SYSNDX EQU   *                                                        07000002
.NTFIRST ANOP                                                           07040002
         DC    AL1(0)                                                   07080002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               07120002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                07160002
&DB      SETA  &DATA(1)                                                 07200002
         AGO   .AA                                                      07240002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                07280002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 07320002
         AGO   .CC                                                      07360002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    07400002
         AIF   (&DATA(2) EQ &DT).BB                                     07440002
.CC      ANOP                                                           07480002
&DT      SETA  &DATA(2)                                                 07520002
.BB      DC    XL2'FFFE'                                                07560002
         DC    FL1'&DB'                                                 07600002
         DC    FL1'&DT'                                                 07640002
&NRENTS  SETA  &NRENTS+1                                                07680002
.NCDATA  ANOP                                                           07720002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              07760002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               07800002
&LB      SETA  &LABEL(1)                                                07840002
         AGO   .AAA                                                     07880002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              07920002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               07960002
         AGO   .CCC                                                     08000002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  08040002
         AIF   (&LABEL(2) EQ &LT).BBB                                   08080002
.CCC     ANOP                                                           08120002
&LT      SETA  &LABEL(2)                                                08160002
.BBB     DC    XL2'FFFF'                                                08200002
         DC    FL1'&LB'                                                 08240002
         DC    FL1'&LT'                                                 08280002
&NRENTS  SETA  &NRENTS+1                                                08320002
.NCLABEL ANOP                                                           08360002
         AIF   ('&SKIP' NE '').CONT                                     08400002
         AIF   (&TEST EQ 0).NOCHANG                                     08440002
&S       SETA  &LASTCC                                                  08480002
         AGO   .DEFAULT                                                 08520002
.CONT    ANOP                                                           08560002
         AIF   (&TEST EQ 0).AB                                          08600002
&S       SETA  &SKIP                                                    08640002
.DEFAULT ANOP                                                           08680002
         ORG   &CARRCON+3                                               08720002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 08760002
         ORG                                                            08800002
&LASTCC  SETA  &S                                                       08840002
&TEST    SETB  0                                                        08880002
         AGO   .DD                                                      08920002
.AB      AIF   (&SKIP EQ &LASTCC).NOCHANG                               08960002
A&SYSNDX DC    XL2'FFFB'                                                09000002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              09040002
         DC    FL1'9'                                                   09080002
&LASTCC  SETA  &SKIP                                                    09120002
&TEST    SETB  1                                                        09160002
&CARRCON SETC  'A&SYSNDX'                                               09200002
&NRENTS  SETA  &NRENTS+1                                                09240002
.DD      ANOP                                                           09280002
.NOCHANG ANOP                                                           09320002
         MEND                                                           09360002
*                                                                       09400002
*                                                                       09440002
*********************************************************************** 09480002
*                                                                       09520002
*                                                                       09560002
         MACRO                                                          09600002
         BIN   ,                                                        09640002
.*       &SYSLIST(&OP,1) -         NAME OF LOG ITEM                     09680002
.*       RECORD DSECT                                                   09720002
.*       $SYSLIST(&OP,2) -         NBR OF SPACES                        09760002
.*       TO    SKIP                ON MULTIPLE                          09800002
.*       PRINT OR                  NBR OF SPACES                        09840002
.*       TO    BACK                UP FROM COLUMN FOR                   09880002
.*       START OF                  PRINTING. THE LETTER                 09920002
.*       B     PRECEEDS            THE NUMBER (B5) IF                   09960002
.*       THE   LATTER              IS DESIRED. OMISSION                 10000002
.*       OF    THIS                OPERAND FORCES OPTION 2              10040002
.*       WITH  BACKUP              SPACING EQUAL TO                     10080002
.*       THE   NUMBER              OF BITS IN THE ITEM                  10120002
.*       DEFINITION (VIA           MACRO 'DSGEN').                      10160002
.*       A     LIMIT               OF 15 BITS IS IMPOSED FOR THE        10200002
.*       TOTAL NUMBER              OF BITS TO PRINT.                    10240002
         GBLA  &INITIAL                                                 10280002
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                               10320002
         GBLC  &ITEM(2000),&DSECT                                       10360002
         GBLA  &BITS(2000),&ITEMNBR,&SHIFT(2000),&NRENTS                10400002
         LCLB  &B,&SUB                                                  10440002
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   10480002
         LCLA  &TEMP,&T,&OP                                             10520002
         LCLC  &S                                                       10560002
         ACTR  500000                                                   10600002
         AIF   (&DIAGTST EQ 0).NOMSG                                    10640002
         AIF   (&INITIAL EQ 0).NOMSG                                    10680002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    10720002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  10760002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     10800002
*        LINE                                                           10840002
         LINE                                                           10880002
.NOMSG   ANOP                                                           10920002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  10960002
&SUB     SETB  1                                                        11000002
.LOOP    ANOP                                                           11040002
&OP      SETA  &OP+1                                                    11080002
.LOOP1   ANOP                                                           11120002
&NDX     SETA  &NDX+1                                                   11160002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND               11200002
         AIF   (&NDX LT &ITEMNBR).LOOP1                                 11240002
         MNOTE '**LOG ITEM NOT DEFINED**'                               11280002
         MEXIT                                                          11320002
.FOUND   ANOP                                                           11360002
&ISHIFT  SETA  &SHIFT(&NDX)                                             11400002
&IBITS   SETA  &BITS(&NDX)                                              11440002
         AIF   (&SUB EQ 1).SUB00                                        11480002
         AIF   ('&SYSLIST(3)' EQ '').SETT                               11520002
&IBITS   SETA  &SYSLIST(3)                                              11560002
         AGO   .SETT                                                    11600002
.SUB00   AIF   ('&SYSLIST(&OP,3)'  EQ '').SETT                          11640002
&IBITS   SETA  &SYSLIST(&OP,3)                                          11680002
.SETT    ANOP                                                           11720002
&T       SETA  &IBITS-1                                                 11760002
&B       SETB  0                                                        11800002
         AIF   (&IBITS GT 0 AND &IBITS LT 16).SUB0                      11840002
         MNOTE '**NO. OF BITS OUTSIDE RANGE OF 1-15**'                  11880002
         MEXIT                                                          11920002
.SUB0    AIF   (&SUB EQ 1).SUBA                                         11960002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             12000002
&K       SETA  K'&SYSLIST(2)                                            12040002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              12080002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                12120002
         AGO   .SUBB                                                    12160002
.SUBA    ANOP                                                           12200002
         AIF   ('&SYSLIST(&OP,2)'  EQ '').BACKUP                        12240002
&K       SETA  K'&SYSLIST(&OP,2)                                        12280002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          12320002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            12360002
.SUBB    ANOP                                                           12400002
&T       SETA  &S                                                       12440002
.BACKUP  ANOP                                                           12480002
&NRENTS  SETA  &NRENTS+1                                                12520002
&TEMP    SETA  &ISHIFT                                                  12560002
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                            12600002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'                12640002
         AGO   .OUT                                                     12680002
.BIN2    AIF   (&SUB EQ 1).BIN2A                                        12720002
         AIF   ('&SYSLIST(2)' NE '').BIN3                               12760002
         AGO   .BIN2B                                                   12800002
.BIN2A   AIF   ('&SYSLIST(&OP,2)'  NE '').BIN3                          12840002
.BIN2B   ANOP                                                           12880002
&B       SETB  1                                                        12920002
.BIN3    ANOP                                                           12960002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'                    13000002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             13040002
.OUT     ANOP                                                           13080002
&NDX     SETA  0                                                        13120002
         AIF   (&SUB EQ 0).OUTA                                         13160002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 13200002
.OUTA    ANOP                                                           13240002
         MEND                                                           13280002
*                                                                       13320002
*                                                                       13360002
*********************************************************************** 13400002
*                                                                       13440002
*                                                                       13480002
         MACRO                                                          13520002
         HEX   &LOGITEM,&SKIP$OR,&BYTES                                 13560002
.*                                                                      13600002
.*       THIS  MACRO               FACILITATES GENERATION               13640002
.*       OF    THE                 TABLE ENTRIES SPECIFYING HEX         13680002
.*       TYPE  CONVERSIONS.                                             13720002
.*                                                                      13760002
.*       &LOGITEM -                NAME OF DATA ITEM TO BE              13800002
.*       CONVERTED.                                                     13840002
.*                                                                      13880002
.*       &SKIP$OR -                NUMBER OF SPACES TO SKIP             13920002
.*       ON    MULTIPLE            PRINT OF NUMBER OF                   13960002
.*       SPACES TO                 BACK UP FROM COLUMN FOR              14000002
.*       START OF                  PRINTING. THE LETTER B               14040002
.*       PRECEEDS THE              NUMBER (B8) IF THE                   14080002
.*       LATTER OPTION             IS DESIRED. OMISSION                 14120002
.*       OF    THIS                OPERAND FORCES OPTION 2 WITH         14160002
.*       BACKUP SPACING            EQUAL TO THE NUMBER                  14200002
.*       OF    BYTES               SPECIFIED BY THE NEXT                14240002
.*       OPERAND (TWICE            THIS NUMBER IF SUFFIX                14280002
.*       IS    EXPLICITLY          OR IMPLICITLY B).                    14320002
.*                                                                      14360002
.*       &BYTES -                  NUMBER OF TOTAL INPUT BYTES          14400002
.*       TO    PROCESS.            THIS NUMBER IS SUFFIXED              14440002
.*       WITH  A                   L,R, OR B TO STIPULATE               14480002
.*       PRINTING OF               THE LEFT HALF, RIGHT                 14520002
.*       HALF, OR                  BOTH HALVES OF THE BYTE              14560002
.*       RESPECTIVELY. OMISSION    OF THIS                              14600002
.*       OPERAND DEFAULTS          TO B WITH THE                        14640002
.*       NUMBER OF                 BYTES EQUAL TO THE ITEM              14680002
.*       LENGTH.                                                        14720002
.*                                                                      14760002
.*       A     NEW                 ENTRY IS GENERATED ONLY WHEN         14800002
.*       NECESSARY. THIS           MACRO MUST BE THE                    14840002
.*       FIRST MACRO               INSTRUCTION ISSUED FOR               14880002
.*       THE   SUBJECT             LINE(S)                              14920002
         GBLC  &ITEM(2000),&DSECT                                       14960002
         GBLA  &ITEMNBR,&BITS(2000),&SHIFT(2000),&NRENTS                15000002
         LCLB  &B                                                       15040002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP                  15080002
         LCLC  &S,&LETTER                                               15120002
.LOOP    ANOP                                                           15160002
&NDX     SETA  &NDX+1                                                   15200002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      15240002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  15280002
         MNOTE '**LOG ITEM NOT FOUND**'                                 15320002
         MEXIT                                                          15360002
.FOUND   ANOP                                                           15400002
&ISHIFT  SETA  &SHIFT(&NDX)                                             15440002
&IBITS   SETA  &BITS(&NDX)                                              15480002
&CODE    SETA  1                                                        15520002
&K       SETA  K'&BYTES                                                 15560002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            15600002
         MNOTE 'BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL'     15640002
         MEXIT                                                          15680002
.OK      AIF   ('&BYTES' EQ '').USEDEFN                                 15720002
&LETTER  SETC  '&BYTES'(&K,1)                                           15760002
&S       SETC  '&BYTES'(1,&K-1)                                         15800002
&BYTESP  SETA  &S                                                       15840002
         AIF   ('&LETTER' EQ 'B').BOTH                                  15880002
         AIF   ('&LETTER' EQ 'L').LEFT                                  15920002
&CODE    SETA  2                                                        15960002
         AGO   .L                                                       16000002
.LEFT    ANOP                                                           16040002
&CODE    SETA  1                                                        16080002
         AGO   .L                                                       16120002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).OK2                       16160002
.ERR     MNOTE 'DATA NOT ALIGNED ON HEX OR BYTE BOUNDARY'               16200002
         MEXIT                                                          16240002
.USEDEFN ANOP                                                           16280002
&BYTESP  SETA  &IBITS/8                                                 16320002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       16360002
&CODE    SETA  3                                                        16400002
&T       SETA  &BYTESP*2-1                                              16440002
&S       SETC  '&T'                                                     16480002
.OK2     AIF   (&ISHIFT EQ 0).L                                         16520002
&CODE    SETA  2                                                        16560002
.L       ANOP                                                           16600002
&B       SETB  1                                                        16640002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                16680002
&K       SETA  K'&SKIP$OR                                               16720002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 16760002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   16800002
.BACKUP  ANOP                                                           16840002
&NRENTS  SETA  &NRENTS+1                                                16880002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'A'                           16920002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'              16960002
.OUT     ANOP                                                           17000002
         MEND                                                           17040002
*                                                                       17080002
*                                                                       17120002
*********************************************************************** 17160002
*                                                                       17200002
*                                                                       17240002
         MACRO                                                          17280002
&NAME    ROUTINE &LOGITEM,&RNAME                                        17320002
         GBLC  &ITEM(2000)                                              17360002
         GBLA  &SHIFT(2000),&ITEMNBR                                    17400002
         GBLC  &DSECT,&CSECT                                            17440002
         GBLA  &NRENTS                                                  17480002
         LCLA  &ISHIFT,&NDX                                             17520002
.LOOP    ANOP                                                           17560002
&NDX     SETA  &NDX+1                                                   17600002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      17640002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  17680002
         MNOTE 'LOG ITEM NOT DEFINED'                                   17720002
         MEXIT                                                          17760002
.FOUND   ANOP                                                           17800002
&ISHIFT  SETA  &SHIFT(&NDX)                                             17840002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           17880002
         DC    AL.4(&ISHIFT),AL.12(&RNAME-&CSECT)                       17920002
&NRENTS  SETA  &NRENTS+1                                                17960002
         MEND                                                           18000002
*                                                                       18040002
*                                                                       18080002
*********************************************************************** 18120002
*                                                                       18160002
*                                                                       18200002
         MACRO                                                          18240002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C18280002
               &LABEL7,&LABEL8                                          18320002
.*       THIS  MACRO               ALLOWS UP TO ACHT LABELS TO          18360002
.*       BE    SPECIFIED           FOR A GIVEN LINE. THE                18400002
.*       LABELS SHOULD             BE ENCLOSED IN QUOTA-                18440002
.*       TION  MARKS.              THE COLUMN AND LINE END              18480002
.*       CONTROLS WILL             BE INSERTED BY THE                   18520002
.*       MACRO. OMITTED            OPERANDS MEAN NO                     18560002
.*       LABEL REQUIRED            FOR RESPECTIVE                       18600002
.*       COLUMN. THIS              MACRO WILL ALSO ALERT                18640002
.*       THE   PROGRAMMER          TO EXACTLY WHERE THE                 18680002
.*       TABLE MUST                BE BROKEN IF NECESSARY               18720002
.*       TO    AVOID               EXCEEDING THE MAXIMUM LIMIT          18760002
         GBLC  &LABELS(2000)                                            18800002
         GBLC  &LBL(100)                                                18840002
         GBLA  &LBLCTR(100)                                             18880002
         GBLA  &LABELNR                                                 18920002
         GBLA  &NRENTS,&LPTR                                            18960002
         LCLC  &MARGIN,&TACK                                            19000002
         LCLC  &TEXT                                                    19040002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            19080002
&MARGIN  SETC  '*'                                                      19120002
         AIF   ('&NAME' EQ '').LOOPOUT                                  19160002
&LPTR    SETA  &LPTR+1                                                  19200002
&LBL(&LPTR) SETC '&NAME'                                                19240002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          19280002
.LOOPOUT ANOP                                                           19320002
&OP      SETA  &OP+1                                                    19360002
&K       SETA  K'&SYSLIST(&OP)                                          19400002
         AIF   (&K GE 2).NORM                                           19440002
&K       SETA  2                                                        19480002
.NORM    ANOP                                                           19520002
&START   SETA  2                                                        19560002
         AIF   (&OP LT N'&SYSLIST).NOTLAST                              19600002
&MARGIN  SETC  '$'                                                      19640002
.NOTLAST ANOP                                                           19680002
&NRCHAR  SETA  8                                                        19720002
&TACK    SETC  ''                                                       19760002
.LOOPIN  ANOP                                                           19800002
&REMAIN  SETA  &K-&START                                                19840002
         AIF   (&REMAIN GE 8).MORE                                      19880002
&TACK    SETC  '&MARGIN'                                                19920002
&NRCHAR  SETA  &REMAIN                                                  19960002
.MORE    ANOP                                                           20000002
&TEXT    SETC  ''                                                       20040002
         AIF   (&REMAIN EQ 0).ENDTEXT                                   20080002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          20120002
.ENDTEXT ANOP                                                           20160002
&LABELNR SETA  &LABELNR+1                                               20200002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  20240002
&START   SETA  &START+8                                                 20280002
         AIF   ('&TACK' EQ '').LOOPIN                                   20320002
         AIF   ('&TACK' EQ '*').LOOPOUT                                 20360002
         MEND                                                           20400002
         SPACE 2                                                        20440002
         MACRO                                                          20480002
         LSTART                                                         20520002
.*       THIS  MACRO               IS ISSUED WHEN THE LABEL AREA        20560002
.*       OF    THE                 TABLE IS TO BEGIN.                   20600002
         GBLC  &LABELS(2000)                                            20640002
         GBLA  &LABELNR                                                 20680002
         GBLC  &LBL(100)                                                20720002
         GBLA  &LBLCTR(100)                                             20760002
         LCLA  &NDX,&CTR                                                20800002
         LINEND                                                         20840002
&CTR     SETA  1                                                        20880002
.LOOP    ANOP                                                           20920002
&NDX     SETA  &NDX+1                                                   20960002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            21000002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         21040002
&CTR     SETA  &CTR+1                                                   21080002
         AGO   .LOOPCTL                                                 21120002
.NOLBL   ANOP                                                           21160002
         DC    C'&LABELS(&NDX)'                                         21200002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  21240002
         MEND                                                           21280002
*                                                                       21320002
*                                                                       21360002
*********************************************************************** 21400002
*                                                                       21440002
*                                                                       21480002
         MACRO                                                          21520002
         LINEND                                                         21560002
.*       THIS  MACRO               IS USED ONLY BY THE LINE             21600002
.*       MACRO TO                  SET THE NUMBER OF ENTRIES            21640002
.*       ASSOCIATED WITH           EACH LINE.                           21680002
         GBLA  &NRENTS                                                  21720002
         GBLC  &NRENTSX                                                 21760002
         ORG   &NRENTSX                                                 21800002
         DC    FL1'&NRENTS'                                             21840002
         ORG                                                            21880002
&NRENTS  SETA  0                                                        21920002
B&SYSNDX EQU   *                                                        21960002
&NRENTSX SETC  'B&SYSNDX'                                               22000002
         MEND                                                           22040002
*                                                                       22080002
*                                                                       22120002
*********************************************************************** 22160002
*                                                                       22200002
*                                                                       22240002
         MACRO                                                          22280002
&NAME    BIND  &Z1,&Z2,&Z3,&Z4                                          22320002
.*       THIS  MACRO               HELPS COLLOCATE BITS IN              22360002
.*       DIFFERENT AREAS           OF THE LOG TO MAKE                   22400002
.*       THEM  ACCESSIBLE          TO THE 'HEX' MACRO.                  22440002
.*       EACH  OPERAND             HAS 3 SUBFIELDS:1 SPE-               22480002
.*       CIFIES BY                 LOGITEM NAME THE BYTE TO             22520002
.*       BE    REFERENCED,2        GIVES THE NUMBER OF                  22560002
.*       UNDESIRED BITS            TO THE LEFT OF THE                   22600002
.*       LOG   ITEM'S FIRST BIT,3 GIVES THE LOG                         22640002
.*       ITEM'S LENGTH             IN BITS. THE MACRO                   22680002
.*       CAUSES THE                INFORMATION TO BE STORED &           22720002
.*       CONTROL IS                GIVEN TO THE 'BINDER' ROU-           22760002
.*       TINE,WHICH STORES         THE COLLOCATED                       22800002
.*       BITS  RIGHT-JUSTIFIED     IN THE FOUR-                         22840002
.*       BYTE  WORK                AREA INSERTED IN THE LOG,            22880002
.*       BEGINNING AT              'LOGWORK1'                           22920002
         GBLC  &DSECT                                                   22960002
         LCLA  &OP                                                      23000002
&NAME    BC    15,BINDER                                                23040002
.LOOP    ANOP                                                           23080002
&OP      SETA  &OP+1                                                    23120002
         DC    AL.16(&SYSLIST(&OP,1)-&DSECT)                            23160002
         DC    FL1'&SYSLIST(&OP,2)'                                     23200002
         DC    FL1'&SYSLIST(&OP,3)'                                     23240002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 23280002
         ORG   &NAME+4                                                  23320002
         DC    AL.4(&OP),AL.12(&SYSLIST(1,1)-&DSECT)                    23360002
         ORG                                                            23400002
         MEND                                                           23440002
         MACRO                                                          23480002
&NAME    CKPARITY &PAR1,&PAR2,&PAR3,&PAR4,&PAR5,&PAR6                   23520002
.*       THIS  MACRO               HELPS SET THE LOCATION               23560002
.*       CONTROLS FOR              A SPECIAL ROUTINE TO                 23600002
.*       CHECK PARITY              ON ITEMS FROM THE LOG                23640002
.*       ALREADY ASSEMBLED         FOR PRINTING IN THE                  23680002
.*       PRINT BUFFER              THAT HAS BEEN SET UP.                23720002
.*       EACH  OPERAND             (UP TO SIX) HAS THREE                23760002
.*       SUBFIELDS:1 GIVES         THE DISPLACEMENT                     23800002
.*       FROM  PRINT               POSITION ZERO TO BEGIN               23840002
.*       THE   PARITY              CHECK(I.E.,LOC. OF PARITY            23880002
.*       BIT   IN                  BUFFER);2 GIVES THE NUMBER OF        23920002
.*       POSITIONS TO              CHECK AGAINST THE PARITY             23960002
.*       BIT   (ASSUMING           1 SPACE BETWEEN PAR BIT              24000002
.*       AND   THE                 FIRST POSITION TO BE CHECKED)        24040002
.*       3     GIVES               THE NUMBER OF SEQUENTIAL PAR.        24080002
.*       CHECKS OF                 THIS SORT TO MAKE,ASSUMING           24120002
.*       TWO   SPACES              BETWEEN THE LAST POSITION            24160002
.*       CHECKED AND               NEXT PAR. BIT POSITION               24200002
         LCLA  &OP                                                      24240002
&NAME    BC    15,PARPUT                                                24280002
         DC    X'0'                                                     24320002
.LOOP    ANOP                                                           24360002
&OP      SETA  &OP+1                                                    24400002
         DC    FL1'&SYSLIST(&OP,1)'                                     24440002
         DC    FL1'&SYSLIST(&OP,2)'                                     24480002
         DC    FL1'&SYSLIST(&OP,3)'                                     24520002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 24560002
         ORG   &NAME+4                                                  24600002
         DC    FL1'&OP'                                                 24640002
         ORG                                                            24680002
         MEND                                                           24720002
         GBLC  &DSECT,&CSECT                                            24760002
IFCETUL1 CSECT                                                          24800002
&CSECT   SETC  'IFCETUL1'                                               24840002
&DSECT   SETC  'DSECT145'                                               24880002
DSECT145 DSECT                                                          24920002
         DS    0F                                                       24960002
         DSGEN (XKEY,8),(XRELN,8),(XSWS0,8),(XSWS8,1),(XSWS9,1),       C25000002
               (XSWS10,1),(XSWS11,1),                                  *25040002
               (XSWS12,1),(XSWS13,1),(XSWS14,1),(XSWS15,1)              25080002
         DSGEN (LOGWORK1,8),(LOGWORK2,6),(LOGWORK3,2),(LOGWRK3A,4),    *25120002
               (LOGWRK3B,3),(LOGWRK3C,1),(LOGWORK4,8)                   25160002
         DSGEN (XDATE,32)                                               25200002
         DSGEN (XTIME,32)                                               25240002
         DSGEN (XDUM2,8),(XSER,24)                                      25280002
         DSGEN (XCPUMOD,16),(XDUM3,16)                                  25320002
         DSGEN (XPGMID,64)                                              25360002
         ORG   XPGMID                                                   25400002
         DSGEN (RECLNT,32),(WAITST,32)                                  25440002
         DSGEN (XJOBID,64)                                              25480002
         ORG   XJOBID                                                   25520002
         DSGEN (MCETEF,1,0,7),(MCEMEF,1,0,7),(MCEIEF,1,0,7),           X25560002
               (MCESEF,1,0,7),(PDAR0,1,0,7),(PDAR1,1,0,7),             X25600002
               (PDAR2,1,0,7),(WDSIZE,8)                                 25640002
         DSGEN (XMCKPSW,64)                                             25680002
         DSGEN (MCIC,1,0,47),(EXTDLOG,16)                               25720002
         DSGEN (RESRVDB,64)                                             25760002
         DSGEN (FAILSTA,32)                                             25800002
         DSGEN (CTRLWD,16),(ERCORCD,8),(RGCODE,1,24,31)                 25840002
         DSGEN (DUMMY1,32)                                              25880002
         DSGEN (MCAR,32)                                                25920002
         DSGEN (MCDR1,32)                                               25960002
         DSGEN (MCDR2,32)                                               26000002
         DSGEN (MANTLTH1,32)                                            26040002
         DSGEN (MANTLTH2,32)                                            26080002
         DSGEN (MCRR1,32)                                               26120002
         DSGEN (MCRR2,32)                                               26160002
         DSGEN (ICM90,32)                                               26200002
         DSGEN (STATUS,32)                                              26240002
         DSGEN (FDUM1,32)                                               26280002
         DSGEN (FDUM2,32)                                               26320002
         DSGEN (FDUM3,32)                                               26360002
         DSGEN (FDUM4,32)                                               26400002
         DSGEN (FDUM5,32)                                               26440002
         DSGEN (FDUM6,32)                                               26480002
         DSGEN (FDUM7,32)                                               26520002
         DSGEN (FDUM8,32)                                               26560002
         DSGEN (FDUM9,32)                                               26600002
         DSGEN (FDUM10,32)                                              26640002
         DSGEN (FDUM11,32)                                              26680002
         DSGEN (FDUM12,32)                                              26720002
         DSGEN (FDUM13,32)                                              26760002
         DSGEN (FDUM14,32)                                              26800002
FLOATPTS DSGEN (FP0,32)                                                 26840002
         DSGEN (FP1,32)                                                 26880002
         DSGEN (FP2,32)                                                 26920002
         DSGEN (FP3,32)                                                 26960002
         DSGEN (FP4,32)                                                 27000002
         DSGEN (FP5,32)                                                 27040002
         DSGEN (FP6,32)                                                 27080002
         DSGEN (FP7,32)                                                 27120002
GENPURPR DSGEN (GPR0,32)                                                27160002
         DSGEN (GPR1,32)                                                27200002
         DSGEN (GPR2,32)                                                27240002
         DSGEN (GPR3,32)                                                27280002
         DSGEN (GPR4,32)                                                27320002
         DSGEN (GPR5,32)                                                27360002
         DSGEN (GPR6,32)                                                27400002
         DSGEN (GPR7,32)                                                27440002
         DSGEN (GPR8,32)                                                27480002
         DSGEN (GPR9,32)                                                27520002
         DSGEN (GP10,32)                                                27560002
         DSGEN (GP11,32)                                                27600002
         DSGEN (GP12,32)                                                27640002
         DSGEN (GP13,32)                                                27680002
         DSGEN (GP14,32)                                                27720002
         DSGEN (GP15,32)                                                27760002
         DSGEN (CTR0,32)                                                27800002
         DSGEN (CTR1,32)                                                27840002
         DSGEN (CTR2,32)                                                27880002
         DSGEN (CTR3,32)                                                27920002
         DSGEN (CTR4,32)                                                27960002
         DSGEN (CTR5,32)                                                28000002
         DSGEN (CTR6,32)                                                28040002
         DSGEN (CTR7,32)                                                28080002
         DSGEN (CTR8,32)                                                28120002
         DSGEN (CTR9,32)                                                28160002
         DSGEN (CR10,32)                                                28200002
         DSGEN (CR11,32)                                                28240002
         DSGEN (CR12,32)                                                28280002
         DSGEN (CR13,32)                                                28320002
         DSGEN (CR14,32)                                                28360002
         DSGEN (CR15,32)                                                28400002
         DSGEN (RETCNTUN,4),(RETCNT2H,4),(RETUNUS,16),(NONRETRY,8)      28440002
         DSGEN (MCHRG00,1),(MCHRG01,1),(MCHRG02,1),(MCHRG03,1),        X28480002
               (MCHRG04,1),(MCHRG05,1),(MCHRG06,1),(MCHRG07,1),        X28520002
               (MCHRG08,1),(MCHRG09,1),(MCHRG10,1),(MCHRG11,1),        X28560002
               (MCHRG12,1),(MCHRG13,1),(MCHRG14,1),(MCHRG15,1),        X28600002
               (MCHRG16,1),(MCHRG17,1),(MCHRG18,1),(MCHRG19,1),        X28640002
               (MCHRG20,1),(MCHRG21,1),(MCHRG22,1),(MCHRG23,1),        X28680002
               (MCHRG24,1),(MCHRG25,1),(MCHRG26,1),(MCHRG27,1),        X28720002
               (MCHRG28,1),(MCHRG29,1),(MCHRG30,1),(MCHRG31,1)          28760002
         DSGEN (MCHRGB00,1),(MCHRGB01,1),(MCHRGB02,1),(MCHRGB03,1),    X28800002
               (MCHRGB04,1),(MCHRGB05,1),(MCHRGB06,1),(MCHRGB07,1),    X28840002
               (MCHRGB08,1),(MCHRGB09,1),(MCHRGB10,1),(MCHRGB11,1),    X28880002
               (MCHRGB12,1),(MCHRGB13,1),(MCHRGB14,1),(MCHRGB15,1),    X28920002
               (MCHRGB16,1),(MCHRGB17,1),(MCHRGB18,1),(MCHRGB19,1),    X28960002
               (MCHRGB20,1),(MCHRGB21,1),(MCHRGB22,1),(MCHRGB23,1),    X29000002
               (MCHRGB24,1),(MCHRGB25,1),(MCHRGB26,1),(MCHRGB27,1),    X29040002
               (MCHRGB28,1),(MCHRGB29,1),(MCHRGB30,1),(MCHRGB31,1)      29080002
         DSGEN (RTYREG1,32),(RTYREG2,32)                                29120002
         DSGEN (REGUNU,8),                                             X29160002
               (HREG0,1),(HREG1,1),(HREG2,1),(HREG3,1),(HREG4,1),      X29200002
               (HREG5,1),(HREG6,1),(HREG7,1),(RETRG23,16)               29240002
         DSGEN (RTYRG400,1),(RTYRG401,1),(RTYRG402,1),(RTYRG403,1),    X29280002
               (RTYRG404,1),(RTYRG405,1),(RTYRG406,1),(RTYRG407,1),    X29320002
               (RTYRG408,1),(RTYRG409,1),(RTYRG410,1),(RTYRG411,1),    X29360002
               (RTYRG412,1),(RTYRG413,1),(RTYRG414,1),(RTYRG415,1),    X29400002
               (RTRUNSED,1),(RTYRG417,3),(RTYRG420,3),(RTYEXP,1),      C29440002
               (RTYUNSD,1),                                            C29480002
               (RTYRG425,3),(RTYRG428,3),(RTYNOTUS,1)                   29520002
         DSGEN (CTRLDWD,32)                                             29560002
         DSGEN (SYSREG00,1),(SYSREG01,1),(SYSREG02,1),(SYSREG03,1),    X29600002
               (SYSREG04,1),(SYSREG05,1),(SYSREG06,1),(SYSREG07,1),    X29640002
               (SYSREG08,1),(SYSREG09,1),(SYSREG10,1),(SYSREG11,1),    X29680002
               (SYSREG12,1),(SYSREG13,1),(SYSREG14,1),(SYSREG15,1),    X29720002
               (SYSREG16,1),(SYSREG17,1),(SYSREG18,1),(SYSREG19,1),    X29760002
               (SYSREG20,1),(SYSREG21,1),(SYSREG22,1),(SYSREG23,1),    X29800002
               (SYSREG24,1),(SYSREG25,1),(SYSREG26,1),(SYSREG27,1),    X29840002
               (SYSREG28,1),(SYSREG29,1),(SYSREG30,1),(SYSREG31,1)      29880002
         DSGEN (IREG,8),(IREGB,24)                                      29920002
         DSGEN (UREGA1,2),(UREGA2,2),(UREGA3,4),(UREGA4,4),(UREGA5,4), X29960002
               (UREGC1,8),(UREGC2,8)                                    30000002
         DSGEN (WREG,32)                                                30040002
         DSGEN (VREG,32)                                                30080002
         DSGEN (XREG,32)                                                30120002
         DSGEN (RREG,32)                                                30160002
         DSGEN (YREG,32)                                                30200002
         DSGEN (QREG,32)                                                30240002
         DSGEN (IBUG,32)                                                30280002
         DSGEN (TRRG,32)                                                30320002
         DSGEN (SPAR,32)                                                30360002
         DSGEN (SNRG,8),(SNRA,8),(SNRB,16)                              30400002
         DSGEN (PNRG,16),(RLPAGE,16)                                    30440002
         DSGEN (WKRG,32)                                                30480002
         DSGEN (NPRGXST,16),                                           X30520002
               (EXPDST00,1),(EXPDST01,1),(EXPDST02,1),(EXPDST03,1),    X30560002
               (EXPDST04,1),(EXPDST05,1),(EXPDST06,1),(EXPDST07,1),    X30600002
               (EXPDST08,1),(EXPDST09,1),(EXPDST10,1),(EXPDST11,1),    X30640002
               (EXPDST12,1),(EXPDST13,1),(EXPDST14,1),(EXPDST15,1)      30680002
         DSGEN (DMREG,32),(RWREG,32)                                    30720002
         DSGEN (CPUREG00,1),(CPUREG01,1),(CPUREG02,1),(CPUREG03,1),    X30760002
               (CPUREG04,1),(CPUREG05,1),(CPUREG06,1),(CPUREG07,1),    X30800002
               (CPUREG16,8),(NEWRELTB,8),(OLDRELTB,8)                   30840002
         DSGEN (PSWCTL00,1),(PSWCTL01,1),(PSWCTL02,1),(PSWCTL03,1),    X30880002
               (PSWCTL04,1),(PSWCTL05,1),(PSWCTL06,1),(PSWCTL07,1),    X30920002
               (PSWCTL08,1),(PSWCTL09,1),(PSWCTL10,1),(PSWCTL11,1),    X30960002
               (PSWCTL12,1),(PSWCTL13,1),(PSWCTL14,1),(PSWCTL15,1),    X31000002
               (PSWCTL16,1),(PSWCTL17,1),(PSWCTL18,1),(PSWCTL19,1),    X31040002
               (PSWCTL20,1),(PSWCTL21,1),(PSWCTL22,1),(PSWCTL23,1),    X31080002
               (PSWCTL24,1),(PSWCTL25,1),(PSWCTL26,1),(PSWCTL27,1),    X31120002
               (PSWCTL28,1),(PSWCTL29,1),(PSWCTL30,1),(PSWCTL31,1)      31160002
         DSGEN (SHCTL00,2),(SHCTL02,2),(SHCTL04,4),(SHCTL10,1),        X31200002
               (SHCTL11,1),(SHCTL12,2),(SHCTL14,4),(SHCTL20,8),        X31240002
               (SHCTL30,8)                                              31280002
         DSGEN (SHHI,32),(SHLO,32)                                      31320002
         ORG   SHCTL12                                                  31360002
         DSGEN (MULTCTR,8)                                              31400002
         DSGEN (DARLNGTH,16),(,48)                                      31440002
         DSGEN (SYSSTAT,1,0,7)                                          31480002
         DSGEN (AREADT,1,0,15)                                          31520002
         DSGEN (ERRTYPE,1,0,7)                                          31560002
         DSGEN (RMSACTN,1,0,7)                                          31600002
         DSGEN (RMSINFO,1,0,7)                                          31640002
         DSGEN (WAITSUFF,8),(,8),(MCHFSAR,32),(,32)                     31680002
         DSGEN (TRNSMOD,32,0,7)                                         31720002
         DSGEN (MCHPDR,1,0,7,0,7)                                       31760002
         DSGEN (MCHFSAV,32),(MCHFSEAV,32),(MCHPDARI,32),(MCHTCBCU,32)   31800002
IFCETUL1 CSECT                                                          31840002
         USING *,9                                                      31880002
         USING DSECT145,R2                                              31920002
ENTRYPTR DC    A(STARTER)                                               31960002
TABLNAME DC    CL8'IFCETUL1'                                            32000002
REG9     DC    F'0'                                                     32040002
LP       DC    F'0'                                                     32080002
SKIPPER  BR    14                                                       32120002
R0       EQU   0                                                        32160002
R1       EQU   1                                                        32200002
R2       EQU   2                                                        32240002
R3       EQU   3                                                        32280002
R4       EQU   4                                                        32320002
R5       EQU   5                                                        32360002
R6       EQU   6                                                        32400002
R7       EQU   7                                                        32440002
R8       EQU   8                                                        32480002
R9       EQU   9                                                        32520002
R10      EQU   10                                                       32560002
R11      EQU   11                                                       32600002
R12      EQU   12                                                       32640002
H01      EQU   X'01'                                                    32680002
H13      EQU   X'13'                                                    32720002
H20      EQU   X'20'                                                    32760002
R13      EQU   13                                                       32800002
R14      EQU   14                                                       32840002
R15      EQU   15                                                       32880002
HEX00    EQU   X'00'                                                    32920002
HEX08    EQU   X'08'                                                    32960002
HEX40    EQU   X'40'                                                    33000002
HEX80    EQU   X'80'                                                    33040002
HEX48    EQU   X'48'                                                    33080002
HEXBF    EQU   X'BF'                                                    33120002
L0       EQU   0                                                        33160002
L1       EQU   1                                                        33200002
L2       EQU   2                                                        33240002
L3       EQU   3                                                        33280002
L4       EQU   4                                                        33320002
L5       EQU   5                                                        33360002
L6       EQU   6                                                        33400002
L7       EQU   7                                                        33440002
L8       EQU   8                                                        33480002
L12      EQU   12                                                       33520002
L19      EQU   19                                                       33560002
L60      EQU   60                                                       33600002
CONVREL  STM   R5,R8,XSAVE         SAVE WORK REGS                       33640002
         SR    R6,R6               CLEAR R6                             33680002
         IC    R6,L0(R4)           PICK UP REL & SYS VALUES             33720002
         SRDL  R6,L5               SAVE REL NO IN R7                    33760002
         SLL   R6,L2               MULTIPLY SYS VALUE BY 4              33800002
         L     R8,XLABELP          PICK UP LABEL POINTER                33840002
         LA    R6,RELTAB(R6)       INDEX INTO TABLE OF SYSTEMS          33880002
         MVC   L0(L4,R8),L0(R6)    MOVE SYSTEM NAME INTO LABEL          33920002
         SR    R6,R6               CLEAR R6                             33960002
         SLDL  R6,L5               RETREIVE REL NO.                     34000002
         LTR   R6,R6               IS IT ZERO                           34040002
         BZ    NOREL               BR-YES                               34080002
         CVD   R6,WORK             CONVERT IT                           34120002
         UNPK  L0(L2,R3),WORK+L6(L2) UNPACK IT INTO PRINT BUFF          34160002
         MVZ   L1(L1,R3),L0(R3)    MOVE ON PROPER ZONE                  34200002
         B     RETURN              EXIT                                 34240002
NOREL    MVC   L0(L4,R3),NONE      MOVE IN NONE FOR REL                 34280002
         B     RETURN                                                   34320002
*                                                                       34360002
SETJOBN  MVC   L0(L8,R3),L0(R4)    MOVE JOB NAME                        34400002
         BR    R14                 RETURN                               34440002
*                                                                       34480002
SETDATE  UNPK  XWORK(L8),L0(L4,R4) UNPACK DATE                          34520002
         MVZ   XWORK+L7(L1),XWORK  SET ZONE                             34560002
         MVC   L0(L3,R3),XWORK+L5  MOVE DAY                             34600002
         MVC   L6(L2,R3),XWORK+L3  MOVE YEAR                            34640002
         BR    R14                 RETURN                               34680002
*                                                                       34720002
TSTREC   STM   R5,R8,XSAVE                                     @XA20224 34760001
         TM    0(R4),HEX80         TEST SHORT FORM RECORD SWITCH        34800002
         BZ    TSTRECN             BRANCH IF LONG FORM                  34840002
         CLI   VS2FLG,H01                                               34880002
         BE    VS2SH                                                    34920002
         LA    R5,SHORTREC-L4      ADDRESS OF END OF SHORT RECORD       34960002
         ST    R5,REG9             INTO ENTRY POINTER                   35000002
         B     RETURN                                          @XA20224 35040001
VS2SH    L     R5,LINEB            SET UP LINE PTR.                     35080002
         L     R6,LABB             SET UP LABEL PTR.                    35120002
         ST    R5,REG9             STORE                                35160002
         ST    R6,XLABELP          STORE                                35200002
         B     RETURN                                          @XA20224 35240001
TSTRECN  SR    R15,R15            DON'T PRINT LAST LINE        @XA20224 35320001
         BR    R14                 RETURN                               35360002
ROUT3    ST    R3,XSAVE            SAVE REG 3                           35400002
         TM    0(R4),HEX80         TEST SHORT FORM RECORD SWITCH        35440002
         BO    ROUT3A              BRANCH IF SHORT FORM                 35480002
         SR    R15,R15             DON'T PRINT LAST LINE                35520002
ROUT3A   L     R3,XSAVE            RESTORE REG 3                        35560002
         BR    R14                 RETURN                               35600002
RETURN   LM    R5,R8,XSAVE         RESTORE WORK REGISTERS               35640002
         BR    R14                 RETURN                               35680002
SYSTERM  STM   R5,R8,XSAVE         SAVE REGS                            35720002
         CLI   VS2FLG,H01          IS IT VS2?                           35760002
         BNE   CONTIN              NO, RETURN                           35800002
         TM    XSWS10,H20          YES,CK FLAG                          35840002
         BO    RETURN              ON,PRINT MSG RETURN                  35880002
CONTIN   SR    R15,R15             ELIM LABEL                           35920002
         B     RETURN                                                   35960002
ISITVS2  STM   R5,R8,XSAVE                                              36000002
         CLI   XKEY,H13            IS IT VS2?                           36040002
         BE    ITIS                YES                                  36080002
         B     RETURN              NO                                   36120002
ITIS     OI    VS2FLG,H01          YES VS2                              36160002
         B     RETURN                                                   36200002
VS2TEST1 STM   R5,R8,XSAVE                                              36240002
         CLI   VS2FLG,H01          IS THIS VS2                          36280002
         BE    ITISVS2             YES VS2                              36320002
FIN      SR    R15,R15             ELIM. LABEL                          36360002
         B     RETURN                                                   36400002
ITISVS2  L     R5,LINEA            CHANGE LINE PTR                      36440002
         L     R6,LABA             CHANGE LABEL PTR                     36480002
         ST    R5,XR9PTR           STORE PTR                            36520002
         ST    R6,XLABELP          STORE LABEL                          36560002
         B     FIN                 CLEAN UP AND RETURN                  36600002
VS2TEST2 STM   R5,R8,XSAVE                                              36640002
         CLI   VS2FLG,H01          IS THIS VS2?                         36680002
         BE    ISVS2               YES                                  36720002
         B     FIN                 NO, RETURN                           36760002
ISVS2    L     R5,LINEB            SET UP LINE PTR                      36800002
         L     R6,LABB             SET UP LABEL PTR                     36840002
         ST    R5,XR9PTR           STORE LINE ADDR.                     36880002
         ST    R6,XLABELP          STORE LABEL PTR                      36920002
         B     FIN                                                      36960002
VS2TEST3 STM   R5,R8,XSAVE                                              37000002
         CLI   VS2FLG,H01                                               37040002
         BE    TESTRL              VS2 BRANCH                           37080002
         TM    XSWS8,HEX80         TEST SIZE OF REC.                    37120002
         BO    SHORT               SHORT REC.                           37160002
         LA    R5,DUMPCODE-4       SET UP BRANCH PTR                    37200002
         ST    R5,REG9                                                  37240002
         B     RETURN              GO BACK                              37280002
SHORT    LA    R5,SHORTREC-4       N-T 0S2 2&T S & 3   CC&              37320002
         ST    R5,REG9             STORE IN CORE                        37360002
         B     RETURN                                                   37400002
TESTRL   TM    XSWS8,HEX80         VS2,WHAT IS REC .                    37440002
         BO    SHTFRM                                                   37480002
         B     RETURN                                                   37520002
SHTFRM   LA    R5,SHTVS2-4         SET UP PTR TO SHORT REC.             37560002
         ST    R5,REG9             STORE IN CORE                        37600002
         B     RETURN              CLOSE OUT                            37640002
*        ELIMINATE LINE IF NOT MVS                             @XA20224 37646001
ISITMVS  CLI   XKEY,H13                IS IT MVS               @XA20224 37652001
         BE    RETURNA                 YES                     @XA20224 37658001
         SR    R15,R15                 ELIM. LABEL             @XA20224 37664001
RETURNA  BR    R14                                             @XA20224 37670001
ISIT148  STM   R5,R8,XSAVE                                              37680002
         LA    R5,40               NO. OF SPACES TO BACK UP             37720002
         LR    R6,R3               GET OUTPUT PTR                       37760002
         SR    R6,R5               BACKUP PTR                           37800002
         MVI   L0(R6),C'8'         MAKE IT 148                          37840002
         CLI   L1(R4),X'48'        IS IT 148                            37880002
         BE    RETURN              YES                                  37920002
         MVC   L0(L3,R6),LAB145    MAKE IT 145-3                        37960002
         B     RETURN              DONE                                 38000002
JUMP     STM   R5,R8,XSAVE                                              38040002
         L     R5,LINEC            SET UP LINE PTR.                     38080002
         ST    R5,XR9PTR           STORE LINE ADDR.                     38120002
         B     FIN                 CLEAN UP AND RETURN                  38160002
REGCODE  LA    R3,49(R3)           POSITION PTR                         38162002
         BR    R14                 RETURN                               38164002
RETRYCNT LA    R3,59(R3)           POSITION PTR                         38166002
         BR    R14                 RETURN                               38168002
HILO     DS    0H                                                       38170002
         MVC   HLSAVE(1),1(R4)     SAVE FLAG BYTE                       38172002
         TM    1(R4),X'01'         HI STORAGE?                          38174002
         BO    HI                  YES                                  38176002
         MVI   0(R3),X'F0'         LOW STORAGE                          38178002
         B     RETHILO             RESET AND RETURN                     38180001
HI       MVI   0(R3),X'F1'         INDICATE HI STORAGE                  38182002
RETHILO  NI    1(R4),X'FC'         TURN OFF LOW BITS                    38184001
         BR    R14                 RETURN                               38186002
RESHILO  DS    0H                  RESTORE LOGREC                       38188002
         MVC   1(1,R4),HLSAVE                                           38190002
         BR    R14                                                      38192002
HLSAVE   DC    X'00'                                                    38194002
VS2FLG   DC    X'00'                                                    38200002
LINEA    DC    A(LINE1-4)                                               38240002
LABA     DC    A(LAB1-1)                                                38280002
LINEB    DC    A(LINE2-4)                                               38320002
LABB     DC    A(LAB2-1)                                                38360002
LINEC    DC    A(DUMPCODE-4)                                            38400002
XWORK    DS    D                                                        38440002
RELTAB   DS    0C                  @L03163                              38480002
         DC    C'OS  '             @L03163                              38520002
         DC    C'DOS '             @L03163                              38560002
         DC    C'VS 1'             @L03163                              38600002
         DC    C'V370'             @L03163                              38640002
         DC    C'VS 2'             @L03163                              38680002
         DC    C'    '             @L03163                              38720002
         DC    C'    '             @L03163                              38760002
         DC    C'    '             @L03163                              38800002
XR9PTR   EQU   REG9                                                     38840002
XLABELP  EQU   LP                                                       38880002
WORK     EQU   XWORK                                                    38920002
XSAVE    DS    2D                                                       38960002
NONE     DC    CL4'NONE'                                                39000002
X148     DC    X'0148'                                                  39040002
LAB145   DC    C'5-3'                                                   39080002
         LTORG                                                          39120002
STARTER  DS    0F                                                       39160002
         DC    XL4'00010001'                                            39200002
         DC    XL4'00010001'                                            39240002
         DC    A(LABAREA)                                               39280002
         DC    H'0'                                                     39320002
         DC    X'01'                                                    39360002
         DC    X'000B8B00'                                              39400002
         LABEL ''                                                       39440002
         LINE  ,,SKIP=2                                                 39480002
         ROUTINE XKEY,ISITVS2                                           39520002
         LABEL ''                                                       39560002
         LINE  (48,1),(1,35),SKIP=2                                     39600002
         HEX   XSER,1,3B                                                39640002
         ROUTINE XCPUMOD,ISIT148                                        39680002
         LABEL 'MODEL 14','SERIAL NO'                                   39720002
*                                                                       39760002
         LINE  (10,)                                                    39800002
         ROUTINE XRELN,CONVREL                                          39840002
         LABEL 'XXXX REL.'                                              39880002
         LINE  (48,1)                                                   39920002
         LABEL '--- RECORD SOURCE - MCH ---','TYPE - CPU'               39960002
*                                                                       40000002
         LINE  (15,1),(1,1)                                             40040002
         HEX   XMCKPSW,1,8B                                             40080002
         LABEL 'MCK OLD PSW'                                            40120002
         LINE  (21,1),(1,1)                                             40160002
         ROUTINE XRELN,SYSTERM                                          40200002
         LABEL 'XXXXX  SYSTEM TERMINATED  XXXXX'                        40240002
         LINE  ,                                                        40280002
         ROUTINE XRELN,VS2TEST1                                         40320002
         LABEL ''                                                       40360002
         LINE  (21,1),(1,1)                                             40400002
         ROUTINE XJOBID,SETJOBN                                         40440002
         LABEL 'JOB NAME'                                               40480002
*                                                                       40520002
         LINE                                                           40560002
         ROUTINE XPGMID,SETJOBN                                         40600002
         LABEL 'PROGRAM NAME'                                           40640002
*                                                                       40680002
LINE1    LINE  ,(8,40),SKIP=1                                           40720002
         ROUTINE XSWS0,SKIPPER                                          40760002
LAB1     LABEL 'DAY  YEAR','HH MM SS.TH'                                40800002
         LINE  (8,40),(1,40),SKIP=2                                     40840002
         ROUTINE XDATE,SETDATE                                          40880002
         HEX   XTIME,1,4B                                               40920002
         LABEL 'DATE _','TIME _'                                        40960002
**********************************************************************  41000002
START    DS    0C                                                       41040002
         LINE  ,(30,1)                                                  41080002
         LABEL '--- MACHINE CHECK INTERRUPT CODE ---'                   41120002
         LINE  (41,50),(1,50),SKIP=1                                    41160002
         LABEL '--- SUB CLASS ---'                                      41200002
         LINE                                                           41240002
         BIN   MCIC0                                                    41280002
         BIN   MCIC4                                                    41320002
         LABEL 'SYSTEM DAMAGE (SD)','TIMING FACILITIES DAMAGE (CD)'     41360002
         LINE                                                           41400002
         BIN   MCIC1                                                    41440002
         BIN   MCIC5                                                    41480002
         LABEL 'INSTRUCTION PROCESSING DAMAGE (PD)',                   C41520002
               'EXTERNAL DAMAGE (ED)'                                   41560002
         LINE                                                           41600002
         BIN   MCIC2                                                    41640002
         BIN   MCIC7                                                    41680002
         LABEL 'SYSTEM RECOVERY (SR)','DEGRADATION (DG)'                41720002
         LINE                                                           41760002
         BIN   MCIC3                                                    41800002
         BIN   MCIC8                                                    41840002
         LABEL 'TIMER DAMAGE','WARNING (W)'                             41880002
         LINE                                                           41920002
         LABEL ''                                                       41960002
         LINE  ,(1,1),SKIP=1                                            42000002
         LABEL '--- INTERRUPT TENSE CODES ---'                          42040002
         LINE  (41,50),(1,50)                                           42080002
         BIN   MCIC14                                                   42120002
         BIN   MCIC15                                                   42160002
         LABEL 'BACKED-UP (B)','DELAYED (D)'                            42200002
         LINE                                                           42240002
         LABEL ''                                                       42280002
         LINE  ,(1,1),SKIP=1                                            42320002
         LABEL '--- STORAGE AND PROTECTION ERROR CODES ---'             42360002
         LINE  (41,50),(1,50)                                           42400002
         BIN   MCIC16                                                   42440002
         BIN   MCIC18                                                   42480002
         LABEL 'UNCORRECTED STORAGE ERRORS (SE)',                      C42520002
               'KEY IN STORAGE ERROR UNCORRECTED (KE)'                  42560002
         LINE                                                           42600002
         BIN   MCIC17                                                   42640002
         LABEL 'CORRECTED STORAGE ERRORS (SC)'                          42680002
         LINE                                                           42720002
         LABEL ''                                                       42760002
         LINE  ,(1,1),SKIP=1                                            42800002
         LABEL '--- PSW VALIDITY CODES ---'                             42840002
         LINE  (41,50),(1,50)                                           42880002
         BIN   MCIC20                                                   42920002
         BIN   MCIC21                                                   42960002
         LABEL 'EMWP BITS OF M.C. OLD ARE VALID (WP)',                 C43000002
               'SYSTEM MASK AND KEY ARE VALID (MS)'                     43040002
         LINE                                                           43080002
         BIN   MCIC22                                                   43120002
         BIN   MCIC23                                                   43160002
         LABEL 'PGM MASK AND COND CODE ARE VALID (PM)',                C43200002
               'INSTR ADDR OF M.C. OLD IS VALID (IA)'                   43240002
         LINE                                                           43280002
         LABEL ''                                                       43320002
         LINE  ,(1,1),SKIP=1                                            43360002
         LABEL '--- MISC VALIDITY CODES ---'                            43400002
         LINE  (41,50),(1,50)                                           43440002
         BIN   MCIC24                                                   43480002
         BIN   MCIC25                                                   43520002
         LABEL 'FAILING STORAGE ADDR IS VALID (FA)','REGION CODE VALID X43560002
                (RC)'                                                   43600002
         LINE                                                           43640002
         BIN   MCIC27                                                   43680002
         BIN   MCIC28                                                   43720002
         LABEL 'FP REGS STORED ARE VALID (FP)','GP REGS STORED ARE VALIX43760002
               D (GP)'                                                  43800002
         LINE                                                           43840002
         BIN   MCIC29                                                   43880002
         BIN   MCIC30                                                   43920002
         LABEL 'CONTROL REGS STORED ARE VALID (CR)','EXTENDED LOGOUT ARX43960002
               EA VALID (LG)'                                           44000002
         LINE                                                           44040002
         BIN   MCIC31                                                   44080002
         BIN   MCIC46                                                   44120002
         LABEL 'INSTR MODIFIED STORAGE VALID (ST)','CPU TIMER VALID'    44160002
         LINE                                                           44200002
         BIN   MCIC47                                                   44240002
         LABEL 'CLOCK COMPARATOR VALID'                                 44280002
         LINE                                                           44320002
         LABEL ''                                                       44360002
         LINE  (58,1),(30,30),SKIP=2                           @XA20224 44368001
         BIN   MCIC32                                          @XA20224 44376001
         ROUTINE  XKEY,ISITMVS                                 @XA20224 44384001
         LABEL '--- LRB MAY NOT BE VALID','---'                @XA20224 44392001
         LINE  (37,50),(1,50),SKIP=2                                    44400002
         HEX   EXTDLOG,1,2B                                             44440002
         LABEL 'EXTENDED LOGOUT LENGTH'                                 44480002
         LINE  (37,1),(1,1)                                             44520002
         HEX   RESRVDB,1,14B                                            44560002
         ROUTINE XSWS8,ROUT3                                            44600002
         LABEL 'MC STATUS FIELD'                                        44640002
         LINE  ,(1,1),SKIP=1                                            44680002
         ROUTINE XSWS8,TSTREC                                           44720002
         LABEL 'ABBREVIATED MACHINE CHECK LOGOUT'                       44760002
         LINE  (35,1),(1,1),SKIP=2                                      44800002
         HEX   FAILSTA,1,4B                                             44840002
         LABEL 'FAILING STORAGE ADDRESS'                                44880002
         LINE  ,(1,1),SKIP=1                                            44920002
         LABEL '--- REGION CODE ---'                                    44960002
         LINE  ,(46,),SKIP=1                                            45000002
         LABEL 'BIT(BYTE 3)'                                            45040002
         LINE  (37,4),(1,46)                                            45080001
         ROUTINE CTRLWD,HILO                                            45100002
         HEX   CTRLWD                                                   45120002
         ROUTINE CTRLWD,REGCODE                                         45140002
         BIN   RGCODE24,B7                                              45160001
         ROUTINE CTRLWD,RESHILO                                         45180002
         LABEL 'CONTROL STORAGE ADDRESS(BYTES 0-1)','0   UNUSED'        45200002
         LINE                                                           45240002
         HEX   ERCORCD                                                  45280002
         BIN   RGCODE25                                                 45320002
         LABEL 'ERROR CORRECTION CODES(BYTE 2)','1   UNUSED'            45360002
         LINE  (91,),(47,)                                              45400002
         BIN   RGCODE26                                                 45440002
         LABEL '2   CHECK BIT OR DATA BIT FAILURE'                      45480002
         LINE                                                           45520002
         BIN   RGCODE27                                                 45560002
         LABEL '3   DATA BIT FAILURE'                                   45600002
         LINE                                                           45640002
         BIN   RGCODE28                                                 45680002
         LABEL '4   CONTROL STORAGE DOUBLE BIT FAILURE'                 45720002
         LINE                                                           45760002
         BIN   RGCODE29                                                 45800002
         LABEL '5   THRESHOLD LIMIT EXCEEDED(BIT 7 ALSO 1)'             45840002
         LINE                                                           45880002
         BIN   RGCODE30                                                 45920002
         LABEL '6   INTERMITTENT SINGLE BIT FAILURE(CS/MS)'             45960002
         LINE                                                           46000002
         BIN   RGCODE31                                                 46040002
         LABEL '7=0 MAIN STORAGE FAILURE IF BIT 6=1'                    46080002
         LINE  ,,SKIP=2                                                 46120002
         LABEL '7=1 CONTROL STORAGE FAILURE IF BIT 6=1'                 46160002
         LINE  ,(5,35),SKIP=1                                           46200002
         LABEL ''                                                       46240002
         DC    X'01000B8B00'                                            46280002
         LABEL ''                                                       46320002
         LINE  ,(5,1)                                                   46360002
         LABEL '--- FLOATING POINT REGISTERS ---'                       46400002
         LINE  (16,15),(1,1)                                            46440002
         HEX   FP0,1,4B                                                 46480002
         HEX   FP1,1,4B                                                 46520002
         HEX   FP2,1,4B                                                 46560002
         HEX   FP3,1,4B                                                 46600002
         LABEL 'FP REGS 0,2'                                            46640002
         LINE  (16,15),(1,1)                                            46680002
         HEX   FP4,1,4B                                                 46720002
         HEX   FP5,1,4B                                                 46760002
         HEX   FP6,1,4B                                                 46800002
         HEX   FP7,1,4B                                                 46840002
         LABEL 'FP REGS 4,6'                                            46880002
         LINE                                                           46920002
         LABEL ''                                                       46960002
         LINE  ,(5,1)                                                   47000002
         LABEL '--- GENERAL PURPOSE REGISTERS ---'                      47040002
         LINE  (16,15),(1,1)                                            47080002
         HEX   GPR0,1,4B                                                47120002
         HEX   GPR1,1,4B                                                47160002
         HEX   GPR2,1,4B                                                47200002
         HEX   GPR3,1,4B                                                47240002
         LABEL 'GP REGS 0-3'                                            47280002
         LINE  (16,15),(1,1)                                            47320002
         HEX   GPR4,1,4B                                                47360002
         HEX   GPR5,1,4B                                                47400002
         HEX   GPR6,1,4B                                                47440002
         HEX   GPR7,1,4B                                                47480002
         LABEL 'GP REGS 4-7'                                            47520002
         LINE  (16,15),(1,1)                                            47560002
         HEX   GPR8,1,4B                                                47600002
         HEX   GPR9,1,4B                                                47640002
         HEX   GP10,1,4B                                                47680002
         HEX   GP11,1,4B                                                47720002
         LABEL 'GP REGS 8-B'                                            47760002
         LINE  (16,15),(1,1)                                            47800002
         HEX   GP12,1,4B                                                47840002
         HEX   GP13,1,4B                                                47880002
         HEX   GP14,1,4B                                                47920002
         HEX   GP15,1,4B                                                47960002
         LABEL 'GP REGS C-F'                                            48000002
         LINE                                                           48040002
         LABEL ''                                                       48080002
         LINE  ,(5,1)                                                   48120002
         LABEL '--- CONTROL REGISTERS ---'                              48160002
         LINE  (16,15),(1,1)                                            48200002
         HEX   CTR0,1,4B                                                48240002
         HEX   CTR1,1,4B                                                48280002
         HEX   CTR2,1,4B                                                48320002
         HEX   CTR3,1,4B                                                48360002
         LABEL 'CR REGS 0-3'                                            48400002
         LINE  (16,15),(1,1)                                            48440002
         HEX   CTR4,1,4B                                                48480002
         HEX   CTR5,1,4B                                                48520002
         HEX   CTR6,1,4B                                                48560002
         HEX   CTR7,1,4B                                                48600002
         LABEL 'CR REGS 4-7'                                            48640002
         LINE  (16,15),(1,1)                                            48680002
         HEX   CTR8,1,4B                                                48720002
         HEX   CTR9,1,4B                                                48760002
         HEX   CR10,1,4B                                                48800002
         HEX   CR11,1,4B                                                48840002
         LABEL 'CR REGS 8-B'                                            48880002
         LINE  (16,15),(1,1)                                            48920002
         HEX   CR12,1,4B                                                48960002
         HEX   CR13,1,4B                                                49000002
         HEX   CR14,1,4B                                                49040002
         HEX   CR15,1,4B                                                49080002
         LABEL 'CR REGS C-F'                                            49120002
         DC    X'01000B8B00'                                            49160002
         LABEL ''                                                       49200002
         LINE  ,(40,1),SKIP=2                                           49240002
         LABEL 'CPU DEPENDENT LOGOUT'                                   49280002
         LINE  ,(30,1),SKIP=2                                           49320002
         LABEL '----------------------------------------------------'   49360002
         LINE  ,(40,1),SKIP=2                                           49400002
         LABEL 'MACHINE CHECK REGISTER A'                               49440002
         LINE  ,(14,62),SKIP=2                                          49480002
         LABEL 'BYTE 0','BYTE 2'                                        49520002
         LINE  (38,60),(1,59),SKIP=1                                    49560002
         BIN   MCHRG00                                                  49600002
         BIN   MCHRG16                                                  49640002
         LABEL 'LOCAL STORAGE A SOURCE ADDR CHK','ALU 2 HALF SUM CHK'   49680002
         LINE                                                           49720002
         BIN   MCHRG01                                                  49760002
         BIN   MCHRG17                                                  49800002
         LABEL 'LOCAL STORAGE B SOURCE ADDR CHK','ALU 3 HALF SUM CHK'   49840002
         LINE                                                           49880002
         BIN   MCHRG02                                                  49920002
         BIN   MCHRG18                                                  49960002
         LABEL 'LOCAL STORAGE A DEST ADDR CHK','ALU LOGICAL CHK'        50000002
         LINE                                                           50040002
         BIN   MCHRG03                                                  50080002
         BIN   MCHRG19                                                  50120002
         LABEL 'LOCAL STORAGE B DEST ADDR CHK','B REG SHIFT CHK'        50160002
         LINE                                                           50200002
         BIN   MCHRG04                                                  50240002
         BIN   MCHRG20                                                  50280002
         LABEL 'DEST BYTE CTRL CHK','A REG PTY CHK'                     50320002
         LINE                                                           50360002
         BIN   MCHRG05                                                  50400002
         BIN   MCHRG21                                                  50440002
         LABEL 'LOCAL STORAGE A-B DEST ADDR COMPARE','B REG PTY CHK'    50480002
         LINE                                                           50520002
         BIN   MCHRG06                                                  50560002
         BIN   MCHRG22                                                  50600002
         LABEL 'LOCAL STORAGE CTRL ASSM CHK','Z REG PTY CHK'            50640002
         LINE  (38,60),(1,59),SKIP=2                                    50680002
         BIN   MCHRG07                                                  50720002
         BIN   MCHRG23                                                  50760002
         LABEL 'CTRL REG PTY CHK','D REG PTY CHK'                       50800002
         LINE  ,(14,62),SKIP=2                                          50840002
         LABEL 'BYTE 1','BYTE 3'                                        50880002
         LINE  (38,60),(1,59),SKIP=1                                    50920002
         BIN   MCHRG08                                                  50960002
         BIN   MCHRG24                                                  51000002
         LABEL 'ADDR CHK BOUND REG CHK','EXT REG DEST X COMP CHK'       51040002
         LINE                                                           51080002
         BIN   MCHRG09                                                  51120002
         BIN   MCHRG25                                                  51160002
         LABEL 'LOCAL STORAGE COMP CHK','EXT REG DEST Y COMP CHK'       51200002
         LINE                                                           51240002
         BIN   MCHRG10                                                  51280002
         BIN   MCHRG26                                                  51320002
         LABEL 'FLUSH THRU CHK','EXT REG SOURCE Y CHK'                  51360002
         LINE                                                           51400002
         BIN   MCHRG11                                                  51440002
         BIN   MCHRG27                                                  51480002
         LABEL 'H REG PTY CHK','EXT CTRL ASSM PTY CHK'                  51520002
         LINE                                                           51560002
         BIN   MCHRG12                                                  51600002
         BIN   MCHRG28                                                  51640002
         LABEL 'CLOCK COMPARATOR-CPU TIMER CHK','INTERV TIMER PTY CHK'  51680002
         LINE                                                           51720002
         BIN   MCHRG13                                                  51760002
         BIN   MCHRG29                                                  51800002
         LABEL 'P REG PTY CHK','S REC DUP CHK'                          51840002
         LINE                                                           51880002
         BIN   MCHRG14                                                  51920002
         BIN   MCHRG30                                                  51960002
         LABEL 'T REG PTY CHK','TIME OF DAY CLOCK CHK'                  52000002
         LINE  ,,SKIP=2            A45391                               52040002
         BIN   MCHRG15                                                  52080002
         BIN   MCHRG31                                                  52120002
         LABEL 'L REG PTY CHK','INC/DEC CHK'                            52160002
         LINE  ,(40,1),SKIP=2                                           52200002
         LABEL 'MACHINE CHECK REGISTER B'                               52240002
         LINE  ,(14,62),SKIP=2                                          52280002
         LABEL 'BYTE 0','BYTE 2'                                        52320002
         LINE  (38,60),(1,59),SKIP=1                                    52360002
         BIN   MCHRGB00                                                 52400002
         BIN   MCHRGB16                                                 52440002
         LABEL 'STORAGE ADD CHK','I CYCLE HARD ERROR'                   52480002
         LINE                                                           52520002
         BIN   MCHRGB01                                                 52560002
         BIN   MCHRGB17                                                 52600002
         LABEL 'SDBI PTY CHK','DOUBLE ECC ERROR'                        52640002
         LINE                                                           52680002
         BIN   MCHRGB02                                                 52720002
         BIN   MCHRGB18                                                 52760002
         LABEL 'SDBO PTY CHK','02I CTRL LINE PTY CHK'                   52800002
         LINE                                                           52840002
         BIN   MCHRGB03                                                 52880002
         BIN   MCHRGB19                                                 52920002
         LABEL 'STORE PTY CHK','MULTIPLY CHK'                           52960002
         LINE                                                           53000002
         BIN   MCHRGB04                                                 53040002
         BIN   MCHRGB20                                                 53080002
         LABEL 'COUNT CHK','SHIFT LOAD CHK'                             53120002
         LINE                                                           53160002
         BIN   MCHRGB05                                                 53200002
         BIN   MCHRGB21                                                 53240002
         LABEL 'STORAGE PROT STACK PTY CHK','DOUBLE ECC ERROR'          53280002
         LINE                                                           53320002
         BIN   MCHRGB06                                                 53360002
         BIN   MCHRGB22                                                 53400002
         LABEL 'CLOCK SYN CHK A','SINGLE ECC ERROR'                     53440002
         LINE  (38,60),(1,59),SKIP=2                                    53480002
         BIN   MCHRGB07                                                 53520002
         BIN   MCHRGB23                                                 53560002
         LABEL 'CLOCK SYN CHK B','SINGLE DATA BIT CORRCT'               53600002
         LINE  ,(14,62),SKIP=2                                          53640002
         LABEL 'BYTE 1','BYTE 3'                                        53680002
         LINE  (38,60),(1,59),SKIP=1                                    53720002
         BIN   MCHRGB08                                                 53760002
         BIN   MCHRGB24                                                 53800002
         LABEL 'M REG COMP A CHK','02I CT ERROR CORRCT'                 53840002
         LINE                                                           53880002
         BIN   MCHRGB09                                                 53920002
         BIN   MCHRGB25                                                 53960002
         LABEL 'M REG COMP B CHK','C32 DATA BIT CORRCT'                 54000002
         LINE                                                           54040002
         BIN   MCHRGB10                                                 54080002
         BIN   MCHRGB26                                                 54120002
         LABEL 'M REG COMP C CHK','C16 DATA BIT CORRCT'                 54160002
         LINE                                                           54200002
         BIN   MCHRGB11                                                 54240002
         BIN   MCHRGB27                                                 54280002
         LABEL 'M REG COMP D CHK','C8 DATA BIT CORRCT'                  54320002
         LINE                                                           54360002
         BIN   MCHRGB12                                                 54400002
         BIN   MCHRGB28                                                 54440002
         LABEL 'NO RELOCATE REGISTER MATCH','C4 DATA BIT CORRCT'        54480002
         LINE                                                           54520002
         BIN   MCHRGB13                                                 54560002
         BIN   MCHRGB29                                                 54600002
         LABEL 'MULT RELOCATE REG MATCH','C2 DATA BIT CORRCT'           54640002
         LINE                                                           54680002
         BIN   MCHRGB14                                                 54720002
         BIN   MCHRGB30                                                 54760002
         LABEL 'RELOCATE LRU INVALID','C1 DATA BIT CORRCT'              54800002
         LINE  (38,60),(1,59),SKIP=2                                    54840002
         BIN   MCHRGB15                                                 54880002
         BIN   MCHRGB31                                                 54920002
         LABEL 'ANY MACH CHK ON','C0 DATA BIT CORRCT'                   54960002
         EJECT                                                          55000002
         DC    X'01000B8B00'                                            55040002
         LABEL ''                                                       55080002
         LINE  ,(14,62),SKIP=2                                          55120002
         LABEL 'RETRY COUNTS','RETRY REGS 1,2'                          55160002
         LINE  (38,60),(1,59)                                           55200002
         BIN   RETCNT2H                                                 55240002
         HEX   RTYREG1                                                  55280002
         LABEL 'RETRIES PER CURRENT MACRO','ABRTY REG'                  55320002
         LINE  (38,60),(1,59)                                           55360002
         HEX   NONRETRY                                                 55400002
         HEX   RTYREG2                                                  55440002
         LABEL 'NUMBER OF MACROS RETRIED','SPTLB REG'                   55480002
         LINE  ,(14,62),SKIP=2                                          55520002
         LABEL 'HMRTY REG','CPURTY REG'                                 55560002
         LINE  (38,60),(1,59),SKIP=1                                    55600002
         BIN   HREG0                                                    55640002
         BIN   RTYRG404                                                 55680002
         LABEL 'MACHINE CHECK TRAP','DEST BYTE LINE 0'                  55720002
         LINE                                                           55760002
         BIN   HREG1                                                    55800002
         BIN   RTYRG405                                                 55840002
         LABEL 'RETRY TRAP','DEST BYTE LINE 1'                          55880002
         LINE                                                           55920002
         BIN   HREG2                                                    55960002
         BIN   RTYRG406                                                 56000002
         LABEL 'CPU HIGH TRAP','DEST BYTE LINE 2'                       56040002
         LINE                                                           56080002
         BIN   HREG3                                                    56120002
         BIN   RTYRG407                                                 56160002
         LABEL 'INT FILE ADPTR OR SEL CHN 1,2 OR 3','DEST BYTE LINE 3'  56200002
         LINE                                                           56240002
         BIN   HREG4                                                    56280002
         LABEL 'SEL CHN 1,2,3(IF IFA) OR SEL CHN 4','RETRY FLAGS'       56320002
         LINE  (38,60),(1,59)                                           56360002
         BIN   HREG5                                                    56400002
         BIN   RTYRG408                                                 56440002
         LABEL 'MPX TRAP','STORAGE 2 CYCLE ERROR'                       56480002
         LINE                                                           56520002
         BIN   HREG6                                                    56560002
         BIN   RTYRG409                                                 56600002
         LABEL 'INT FILE ADAPTR TRAP','TYPE 1 ERROR'                    56640002
         LINE                                                           56680002
         BIN   HREG7                                                    56720002
         BIN   RTYRG410                                                 56760002
         LABEL 'STORE-DISPLAY','TYPE 2 ERROR'                           56800002
         LINE  (98,1),(59,1)                                            56840002
         BIN   RTYRG411                                                 56880002
         LABEL ' ','TYPE 3 ERROR'                                       56920002
         LINE  (38,60),(1,59)                                           56960002
         ROUTINE REGUNU,SKIPPER                                         57000002
         BIN   RTYRG412                                                 57040002
         LABEL 'CTRL WORD ADDR AT TIME','LOCAL(0) OR EXT REG(1) DEST'   57080002
         LINE  (34,4),(1,59)                                            57120001
         ROUTINE RETRG23,HILO                                           57140002
         HEX   RETRG23                                                  57160002
         ROUTINE RETRG23,RETRYCNT                                       57180002
         BIN   RTYRG413,B7                                              57200001
         ROUTINE RETRG23,RESHILO                                        57220002
         LABEL 'OF FAILURE','STORAGE WORD IN ERROR'                     57240002
         LINE  (98,1),(60,1)                                            57280002
         BIN   RTYRG414                                                 57320002
         LABEL 'ERROR IN TRAP 2 CYCLE'                                  57360002
         LINE                                                           57400002
         BIN   RTYRG415                                                 57440002
         LABEL 'SINGLE BIT ERROR-SEL SHARE 2 CYCLE'                     57480002
         LINE  ,(5,55)                                                  57520002
         LABEL 'CONTROL WORD','LOCAL STORAGE DEST'                      57560002
         LINE  (12,86),(64,1)                                           57600002
         HEX   CTRLDWD                                                  57640002
         BIN   RTYRG417                                                 57680002
         LABEL ' ','YYY'                                                57720002
         LINE  (98,1),(65,)                                             57760002
         BIN   RTYRG420                                                 57800002
         LABEL 'XXX'                                                    57840002
         LINE  (98,1),(60,1),SKIP=2                                     57880002
         BIN   RTYEXP                                                   57920002
         LABEL 'LOCAL STORE(0) OR EXP LOCAL STORE(1)'                   57960002
         LINE  ,(60,1),SKIP=1                                           58000002
         LABEL 'EXTERNAL REGISTER DEST'                                 58040002
         LINE  (98,1),(65,1)                                            58080002
         BIN   RTYRG425                                                 58120002
         LABEL 'YYY'                                                    58160002
         LINE  (98,1),(65,1),SKIP=2                                     58200002
         BIN   RTYRG428                                                 58240002
         LABEL 'XXX'                                                    58280002
         LINE  ,(40,1),SKIP=2                                           58320002
         LABEL 'SYSTEM REGISTER'                                        58360002
         LINE  ,(14,62),SKIP=2                                          58400002
         LABEL 'BYTE 0','BYTE 2'                                        58440002
         LINE  (38,60),(1,59),SKIP=1                                    58480002
         BIN   SYSREG00                                                 58520002
         BIN   SYSREG16                                                 58560002
         LABEL 'MACHINE CHK INTERPT PENDING','ENABLE CLEAR SWITCH'      58600002
         LINE                                                           58640002
         BIN   SYSREG01                                                 58680002
         BIN   SYSREG17                                                 58720002
         LABEL 'RETRY ROUTINE','TMPL'                                   58760002
         LINE                                                           58800002
         BIN   SYSREG02                                                 58840002
         BIN   SYSREG18                                                 58880002
         LABEL 'MACHINE CHK ROUTINE','LOAD FILE WAIT'                   58920002
         LINE                                                           58960002
         BIN   SYSREG03                                                 59000002
         BIN   SYSREG19                                                 59040002
         LABEL 'DOCUMENTARY CONSOLE 2','CE KEY IN CE MODE'              59080002
         LINE                                                           59120002
         BIN   SYSREG04                                                 59160002
         BIN   SYSREG20                                                 59200002
         LABEL 'LOG PRESENT','IPL'                                      59240002
         LINE                                                           59280002
         BIN   SYSREG05                                                 59320002
         BIN   SYSREG21                                                 59360002
         LABEL 'SPARE','POWER ON RESET'                                 59400002
         LINE                                                           59440002
         BIN   SYSREG06                                                 59480002
         BIN   SYSREG22                                                 59520002
         LABEL 'I/O INSTN LATCH','SPARE'                                59560002
         LINE  (38,60),(1,59),SKIP=2                                    59600002
         BIN   SYSREG07                                                 59640002
         BIN   SYSREG23                                                 59680002
         LABEL 'FORCE MODULE 0 TO LSCS','INSTR PROC LATCH'              59720002
         LINE  ,(14,62),SKIP=2                                          59760002
         LABEL 'BYTE 1','BYTE 3'                                        59800002
         LINE  (38,60),(1,59),SKIP=1                                    59840002
         BIN   SYSREG08                                                 59880002
         BIN   SYSREG24                                                 59920002
         LABEL 'ADDR CONTENTS','MACHINE CHECK TRAP'                     59960002
         LINE                                                           60000002
         BIN   SYSREG09                                                 60040002
         BIN   SYSREG25                                                 60080002
         LABEL 'CPU INTRPT FORCE','RETRY TRAP'                          60120002
         LINE                                                           60160002
         BIN   SYSREG10                                                 60200002
         BIN   SYSREG26                                                 60240002
         LABEL 'SAR INTRPT FORCE','CPU HIGH TRAP'                       60280002
         LINE                                                           60320002
         BIN   SYSREG11                                                 60360002
         BIN   SYSREG27                                                 60400002
         LABEL 'PSW RESTART','INT FILE ADAPTR OR SEL CHN 1,2 OR 3'      60440002
         LINE                                                           60480002
         BIN   SYSREG12                                                 60520002
         BIN   SYSREG28                                                 60560002
         LABEL 'EC MODE','SEL CHN 1,2,3(IF IFA) OR SEL CHN 4'           60600002
         LINE                                                           60640002
         BIN   SYSREG13                                                 60680002
         BIN   SYSREG29                                                 60720002
         LABEL 'SYS CTRL INTRPT','MPX TRAP'                             60760002
         LINE                                                           60800002
         BIN   SYSREG14                                                 60840002
         BIN   SYSREG30                                                 60880002
         LABEL 'TIMER INTRPT FORCE','INT FILE ADAPTR TRAP'              60920002
         LINE  (38,60),(1,59),SKIP=1                                    60960002
         BIN   SYSREG15                                                 61000002
         BIN   SYSREG31                                                 61040002
         LABEL 'PRTY INTRUPT','STORE-DISPLAY'                           61080002
         EJECT                                                          61120002
         DC    X'01000B8B00'                                            61160002
         LABEL ''                                                       61200002
         LINE  ,(40,1),SKIP=2                                           61240002
         LABEL '--- LOCAL STORAGE REGISTERS'                            61280002
         LINE  ,(14,53),SKIP=2                                          61320002
         LABEL 'I REGISTER','U REGISTER'                                61360002
         LINE  (23,74),(1,59),SKIP=1                                    61400002
         HEX   IREG                                                     61440002
         BIN   UREGA1                                                   61480002
         LABEL 'KEY','INSTR LENGTH CODE'                                61520002
         LINE                                                           61560002
         HEX   IREGB                                                    61600002
         BIN   UREGA2                                                   61640002
         LABEL 'INSTR ADDR','CONDITION CODE'                            61680002
         LINE  (97,1),(60,1)                                            61720002
         BIN   UREGA3                                                   61760002
         LABEL 'PROGRAM MASK'                                           61800002
         LINE                                                           61840002
         BIN   UREGA4                                                   61880002
         LABEL 'SPECIAL CPU USE'                                        61920002
         LINE                                                           61960002
         BIN   UREGA5                                                   62000002
         LABEL 'AMWP BITS'                                              62040002
         LINE                                                           62080002
         HEX   UREGC1                                                   62120002
         LABEL 'OP CODE'                                                62160002
         LINE  (97,1),(60,1),SKIP=2                                     62200002
         HEX   UREGC2                                                   62240002
         LABEL 'IMMEDIATE BYTE'                                         62280002
         LINE  ,(5,35),SKIP=2                                           62320002
         LABEL 'NP REGISTER','CPU REGISTER','---  PSWCTL REGISTER ---'  62360002
         LINE  (25,30),(1,30),SKIP=1                                    62400002
         HEX   NPRGXST                                                  62440002
         BIN   CPUREG00                                                 62480002
         BIN   PSWCTL01                                                 62520002
         BIN   PSWCTL12                                                 62560002
         LABEL 'LAST VIRTUAL ADDRESS','HARD STOP LATCH','EVR MSK',     C62600002
               'EC MODE'                                                62640002
         LINE                                                           62680002
         BIN   EXPDST00                                                 62720002
         BIN   CPUREG02                                                 62760002
         BIN   PSWCTL05                                                 62800002
         BIN   PSWCTL13                                                 62840002
         LABEL 'RELOCATE MODE','ENABLE HARD RETRY','TRANS MODE',       C62880002
               'MACH CHK MSK'                                           62920002
         LINE                                                           62960002
         BIN   EXPDST01                                                 63000002
         BIN   CPUREG03                                                 63040002
         BIN   PSWCTL06                                                 63080002
         BIN   PSWCTL14                                                 63120002
         LABEL 'FORMAT CHK','SG BIT FAIL M STOR','I/O MASTER MSK',     X63160002
               'WAIT STATE'                                             63200002
         LINE                                                           63240002
         BIN   EXPDST02                                                 63280002
         BIN   CPUREG04                                                 63320002
         BIN   PSWCTL07                                                 63360002
         BIN   PSWCTL15                                                 63400002
         LABEL 'SPARE','SG BIT FAIL CT STOR','EXT MASTER MSK',         C63440002
               'PROB STATE'                                             63480002
         LINE                                                           63520002
         BIN   EXPDST03                                                 63560002
         BIN   CPUREG05                                                 63600002
         BIN   PSWCTL16                                                 63640002
         BIN   PSWCTL24                                                 63680002
         LABEL '1 MEG SEGMENT','THRESH MODE CT STOR','TIMER MSK',      C63720002
               'MPX CCH MSK'                                            63760002
         LINE                                                           63800002
         BIN   EXPDST04                                                 63840002
         HEX   CPUREG16                                                 63880002
         BIN   PSWCTL17                                                 63920002
         BIN   PSWCTL25                                                 63960002
         LABEL '4K PAGE SIZE','LST T+S CONS FILE','INTERRUPT KEY MASK',C64000002
               'CHAN 1 MSK'                                             64040002
         LINE                                                           64080002
         BIN   EXPDST05                                                 64120002
         HEX   NEWRELTB                                                 64160002
         BIN   PSWCTL18                                                 64200002
         BIN   PSWCTL26                                                 64240002
         LABEL 'LOCAL MODE','RELOC TABLE LAST USED','EXT SIGNAL MSK',  C64280002
               'CHAN 2 MSK'                                             64320002
         LINE                                                           64360002
         BIN   EXPDST06                                                 64400002
         HEX   OLDRELTB                                                 64440002
         ROUTINE FDUM8,SKIPPER                                          64480002
         BIN   PSWCTL27                                                 64520002
         LABEL 'SEGMENT NUMBER INVALID','RELOC MATCH REG','',          C64560002
               'CHAN 3 MASK'                                            64600002
         LINE                                                           64640002
         BIN   EXPDST07                                                 64680002
         ROUTINE FDUM8,SKIPPER     A45391                               64720002
         ROUTINE FDUM8,SKIPPER                                          64760002
         BIN   PSWCTL28                                                 64800002
         LABEL 'RESET TABLE','','','CHAN 4 MASK'                        64840002
         LINE  (25,1)                                                   64880002
         BIN   EXPDST08                                                 64920002
         LABEL 'PAGE INVALID'                                           64960002
         LINE                                                           65000002
         BIN   EXPDST09                                                 65040002
         LABEL 'SEGMENT VALID'                                          65080002
         LINE                                                           65120002
         BIN   EXPDST10                                                 65160002
         LABEL 'PAGE NUMBER INVALID'                                    65200002
         LINE                                                           65240002
         BIN   EXPDST11                                                 65280002
         LABEL 'PAGE FORMAT INVALID'                                    65320002
         LINE  (25,1),SKIP=3                                            65360002
         BIN   EXPDST12                                                 65400002
         LABEL 'EXECUTED INSTRUCTION'                                   65440002
         LINE  ,(5,35),SKIP=1                                           65480002
         LABEL 'X REGISTER','R REGISTER','Y REGISTER','Q REGISTER'      65520002
         LINE  (8,35),(1,1),SKIP=2                                      65560002
         HEX   XREG                                                     65600002
         HEX   RREG                                                     65640002
         HEX   YREG                                                     65680002
         HEX   QREG                                                     65720002
         LABEL ''                                                       65760002
         LINE  ,(5,35),SKIP=1                                           65800002
         LABEL 'IBU REGISTER','TR REGISTER','SN REGISTER','PN REGISTER' 65840002
         LINE  (8,35),(1,1),SKIP=2                                      65880002
         HEX   IBUG                                                     65920002
         HEX   TRRG                                                     65960002
         HEX   SNRB                                                     66000002
         HEX   RLPAGE                                                   66040002
         LABEL ''                                                       66080002
         LINE  ,(5,35),SKIP=1                                           66120002
         LABEL 'WK REGISTER','DM REGISTER','RW REGISTER','V REGISTER'   66160002
         LINE  (8,35),(1,1),SKIP=2                                      66200002
         HEX   WKRG                                                     66240002
         HEX   DMREG                                                    66280002
         HEX   RWREG                                                    66320002
         HEX   VREG                                                     66360002
         LABEL ''                                                       66400002
         LINE  ,(5,35),SKIP=1                                           66440002
         LABEL 'W REGISTER','SHHI REGISTER','SHLO REGISTER'             66480002
         LINE  (8,35),(1,1),SKIP=5                                      66520002
         HEX   WREG                                                     66560002
         HEX   SHHI                                                     66600002
         HEX   SHLO                                                     66640002
         LABEL ''                                                       66680002
         DC    X'01000B8B00'                                            66720002
         LABEL ''                                                       66760002
         LINE  ,(5,1),SKIP=2                                            66800002
         LABEL 'SHCTL SHIFTER CONTROL REGISTER'                         66840002
         LINE  ,(5,70),SKIP=1                                           66880002
         LABEL '--BYTE 0--','--BYTE 2--'                                66920002
         LINE  (30,70),(5,70)                                           66960002
         BIN   SHCTL00                                                  67000002
         HEX   SHCTL20                                                  67040002
         LABEL 'RESULT CODE','T REGISTER BUFFER'                        67080002
         LINE  (30,1),(5,1)                                             67120002
         BIN   SHCTL02                                                  67160002
         LABEL 'BIT SHIFT AMOUNT'                                       67200002
         LINE  (30,1),(5,1)                                             67240002
         BIN   SHCTL04                                                  67280002
         LABEL 'DIGIT SHIFT AMOUNT'                                     67320002
         LINE  ,(5,70)                                                  67360002
         LABEL '--BYTE 1--','--BYTE 3--'                                67400002
         LINE  (30,70),(5,70)                                           67440002
         BIN   SHCTL10                                                  67480002
         HEX   SHCTL30,0,1L                                             67520002
         LABEL 'SPARE','UNUSED'                                         67560002
         LINE  (30,70),(5,70)                                           67600002
         BIN   SHCTL11                                                  67640002
         HEX   SHCTL30,0,1R                                             67680002
         LABEL 'SPARE','MULTIPLICAN LOW DIGIT'                          67720002
         LINE  (30,1),(5,1)                                             67760002
         BIN   SHCTL12                                                  67800002
         LABEL 'MULTIPLY CONTROLS'                                      67840002
         LINE  (30,1),(5,1)                                             67880002
         BIN   SHCTL14,2,4                                              67920002
         LABEL 'SHIFT CONTROLS'                                         67960002
EJCT     DC    X'01000B8B00'                                            68000002
         LABEL ''                                                       68040002
         LINE  ,(30,),SKIP=2                                            68080002
         ROUTINE FDUM8,SKIPPER                                          68120002
         LABEL 'MACHINE CHECK STATUS FIELD'                             68160002
         LINE  ,                                                        68200002
         ROUTINE XRELN,VS2TEST2                                         68240002
         LABEL ''                                                       68280002
         LINE  (41,),(1,),SKIP=1                                        68320002
         HEX   DARLNGTH,0,2B                                            68360002
         LABEL 'MCSTATD FIELD LENGTH'                                   68400002
         LINE  ,(5,)                                                    68440002
         ROUTINE FDUM8,SKIPPER                                          68480002
         LABEL '--- SYSTEM STATUS ---'                                  68520002
         LINE  (35,35),(1,40)                                           68560002
         BIN   SYSSTAT0                                                 68600002
         BIN   SYSSTAT1                                                 68640002
         LABEL 'HARDWARE RECOVERY','SOFTWARE RECOVERY'                  68680002
         LINE                                                           68720002
         BIN   SYSSTAT2                                                 68760002
         BIN   SYSSTAT3                                                 68800002
         LABEL 'TASK ABORTED','TASK SET NON-DISPATCHABLE'               68840002
         LINE                                                           68880002
         BIN   SYSSTAT4                                                 68920002
         BIN   SYSSTAT5                                                 68960002
         LABEL 'OPERATING SYSTEM TERMINATION','QUIET MODE IN EFFECT'    69000002
         LINE  ,(5,)                                                    69040002
         ROUTINE FDUM8,SKIPPER                                          69080002
         LABEL '--- DAMAGE AREA ---'                                    69120002
         LINE  ,(1,40)                                                  69160002
         BIN   AREADT0                                                  69200002
         BIN   AREADT1                                                  69240002
         LABEL 'MAIN STORAGE','BUFFER'                                  69280002
         LINE                                                           69320002
         BIN   AREADT2                                                  69360002
         BIN   AREADT3                                                  69400002
         LABEL 'CONTROL STORAGE','INTERVAL TIMER'                       69440002
         LINE                                                           69480002
         BIN   AREADT4                                                  69520002
         BIN   AREADT5                                                  69560002
         LABEL 'PROCESSOR','CHANNEL ERROR'                              69600002
         LINE                                                           69640002
         BIN   AREADT6                                                  69680002
         BIN   AREADT7                                                  69720002
         LABEL 'TOD CLOCK','SYSTEM DAMAGE'                              69760002
         LINE  ,(5,)                                                    69800002
         ROUTINE FDUM8,SKIPPER                                          69840002
         LABEL '--- ERROR TYPE ---'                                     69880002
         LINE  ,(1,40)                                                  69920002
         BIN   ERRTYPE0                                                 69960002
         BIN   ERRTYPE1                                                 70000002
         LABEL 'INTERMITTENT','SOLID'                                   70040002
         LINE                                                           70080002
         BIN   ERRTYPE2                                                 70120002
         BIN   ERRTYPE3                                                 70160002
         LABEL 'DATA','RESERVED'                                        70200002
         LINE                                                           70240002
         BIN   ERRTYPE4                                                 70280002
         BIN   ERRTYPE5                                                 70320002
         LABEL 'RESERVED','PROTECT'                                     70360002
         LINE  ,(5,)                                                    70400002
         ROUTINE FDUM8,SKIPPER                                          70440002
         LABEL '--- RMS ACTION DATA ---'                                70480002
         LINE  ,(1,40)                                                  70520002
         BIN   RMSACTN0                                                 70560002
         BIN   RMSACTN1                                                 70600002
         LABEL 'LOOP TIME OUT','REPAIR'                                 70640002
         LINE                                                           70680002
         BIN   RMSACTN2                                                 70720002
         BIN   RMSACTN3                                                 70760002
         LABEL 'STORAGE RECONFIGURE','BUFFER RECONFIGURE'               70800002
         LINE  ,(5,)                                                    70840002
         ROUTINE FDUM8,SKIPPER                                          70880002
         LABEL '--- RMS INFORMATION STATUS ---'                         70920002
         LINE  ,(1,40)                                                  70960002
         BIN   RMSINFO0                                                 71000002
         BIN   RMSINFO1                                                 71040002
         LABEL 'RESERVED','INVALID MCI CODE'                            71080002
         LINE                                                           71120002
         BIN   RMSINFO2                                                 71160002
         BIN   RMSINFO3                                                 71200002
         LABEL 'INVALID FAILING STORAGE ADDRESS','PROGRAM CHECK IN MCH' 71240002
         LINE  ,(5,),SKIP=1                                             71280002
         ROUTINE FDUM8,SKIPPER                                          71320002
         LABEL '--- HISTORY OF TRANSIENT MODULES ---'                   71360002
         LINE  (1,15)                                                   71400002
         HEX   TRNSMOD0,1,4B                                            71440002
         HEX   TRNSMOD1,1,4B                                            71480002
         HEX   TRNSMOD2,1,4B                                            71520002
         HEX   TRNSMOD3,1,4B                                            71560002
         LABEL ''                                                       71600002
         LINE  ,,SKIP=2                                                 71640002
         HEX   TRNSMOD4,1,4B                                            71680002
         HEX   TRNSMOD5,1,4B                                            71720002
         HEX   TRNSMOD6,1,4B                                            71760002
         HEX   TRNSMOD7,1,4B                                            71800002
         LABEL ''                                                       71840002
         LINE  ,(5,),SKIP=1                                             71880002
         LABEL '--- PDAR ACTION ---'                                    71920002
         LINE  (35,35),(1,40)                                           71960002
         BIN   MCHPDR00                                                 72000002
         BIN   MCHPDR01                                                 72040002
         LABEL 'TERMINATION OF CURRENT TASK','RETRY POSSIBLE'           72080002
         LINE                                                           72120002
         BIN   MCHPDR02                                                 72160002
         BIN   MCHPDR03                                                 72200002
         LABEL 'BYPASS(AFFECTED TASK) POSSIBLE','REPAIR UNSUCCESSFUL'   72240002
         LINE                                                           72280002
         BIN   MCHPDR04                                                 72320002
         BIN   MCHPDR05                                                 72360002
         LABEL 'INDETERMINATE INSTRUCTION COUNTER','RESERVED'           72400002
         LINE  ,(5,)                                                    72440002
         LABEL '--- FAILURE TYPE ---'                                   72480002
         LINE  ,(1,40)                                                  72520002
         BIN   MCHPDR10                                                 72560002
         BIN   MCHPDR11                                                 72600002
         LABEL 'SOLID STORAGE DATA ERROR','INTERMITTENT STOR. DATA ERR' 72640002
         LINE                                                           72680002
         BIN   MCHPDR12                                                 72720002
         BIN   MCHPDR13                                                 72760002
         LABEL 'SOLID SPF KEY ERROR','INTERMITTENT SPF KEY ERROR'       72800002
         LINE  ,(5,)                                                    72840002
         LABEL '--- OPERATING SYSTEM STATUS ---'                        72880002
         LINE  ,(1,40)                                                  72920002
         BIN   MCHPDR20                                                 72960002
         BIN   MCHPDR21                                                 73000002
         LABEL 'WAIT PSEUDO TASK','PAGE SUPERVISOR TASK'                73040002
         LINE                                                           73080002
         BIN   MCHPDR22                                                 73120002
         BIN   MCHPDR23                                                 73160002
         LABEL 'MASTER SCHEDULER TASK','SYSTEM TASK'                    73200002
         LINE                                                           73240002
         BIN   MCHPDR24                                                 73280002
         BIN   MCHPDR25                                                 73320002
         LABEL 'PROBLEM PROGRAM TASK','CURRENT PSW DISABLED FOR I/O'    73360002
         LINE  ,(5,)                                                    73400002
         LABEL '--- LOCATION OF FAILURE ---'                            73440002
         LINE  ,(1,40)                                                  73480002
         BIN   MCHPDR30                                                 73520002
         BIN   MCHPDR31                                                 73560002
         LABEL 'NUCLEUS','SQA AREA'                                     73600002
         LINE                                                           73640002
         BIN   MCHPDR32                                                 73680002
         BIN   MCHPDR33                                                 73720002
         LABEL 'LSQA AREA','PQA'                                        73760002
         LINE                                                           73800002
         BIN   MCHPDR34                                                 73840002
         BIN   MCHPDR35                                                 73880002
         LABEL 'PAGEABLE AREA','FIXED PAGE AREA'                        73920002
         LINE                                                           73960002
         BIN   MCHPDR36                                                 74000002
         BIN   MCHPDR37                                                 74040002
         LABEL 'V=R ADDRESS AREA','CRITICAL AREA'                       74080002
         LINE  ,(5,)                                                    74120002
         LABEL '--- REQUESTED OPERATOR AWARENESS ---'                   74160002
         LINE  ,(1,40)                                                  74200002
         BIN   MCHPDR50                                                 74240002
         BIN   MCHPDR51                                                 74280002
         LABEL 'SUPERVISOR DAMAGE MESSAGE','TASK ABNORM TERMINATION MSGC74320002
               '                                                        74360002
         LINE                                                           74400002
         BIN   MCHPDR52                                                 74440002
         BIN   MCHPDR53                                                 74480002
         LABEL 'DAMAGED PAGE NOW UNAVAILABLE MSG','DAMAGED PAGE NOW DELC74520002
               ETED MSG'                                                74560002
         LINE                                                           74600002
         BIN   MCHPDR54                                                 74640002
         BIN   MCHPDR55                                                 74680002
         LABEL 'TASK NON-DISPATCHABLE MESSAGE','SOFTWARE RECOVERY MESSAC74720002
               GE'                                                      74760002
         LINE  ,(5,)                                                    74800002
         LABEL '--- FOOTPRINTS ---'                                     74840002
         LINE  ,(1,40)                                                  74880002
         BIN   MCHPDR60                                                 74920002
         BIN   MCHPDR61                                                 74960002
         LABEL 'CHANGE BIT ACTIVE','KEY IN EXTERNAL PAGE TABLE'         75000002
         LINE                                                           75040002
         BIN   MCHPDR62                                                 75080002
         BIN   MCHPDR63                                                 75120002
         LABEL 'PAGE RECURSION','PAGE FIX ACTIVE IN LOW END'            75160002
         LINE                                                           75200002
         BIN   MCHPDR64                                                 75240002
         BIN   MCHPDR65                                                 75280002
         LABEL 'TRANSLATE ERROR','NO PAGE EXISTS'                       75320002
         LINE                                                           75360002
         BIN   MCHPDR66                                                 75400002
         BIN   MCHPDR67                                                 75440002
         LABEL 'RELOCATE OFF','LOW END INTERFACE ACTIVE'                75480002
         DC    X'01000B8B00'                                            75520002
         LABEL ''                                                       75560002
         LINE  ,(5,)                                                    75600002
         LABEL '--- FOOTPRINTS - INTERFACES ---'                        75640002
         LINE  ,(1,40)                                                  75680002
         BIN   MCHPDR70                                                 75720002
         BIN   MCHPDR71                                                 75760002
         LABEL 'ABTERM INTERFACE ACTIVE','TRANSLATE INTERFACE ACTIVE'   75800002
         LINE                                                           75840002
         BIN   MCHPDR72                                                 75880002
         BIN   MCHPDR73                                                 75920002
         LABEL 'FIND PAGE INTERFACE ACTIVE','PAGE DEQUEUE INTERFACE ACTC75960002
               .'                                                       76000002
         LINE                                                           76040002
         BIN   MCHPDR74                                                 76080002
         BIN   MCHPDR75                                                 76120002
         LABEL 'PAGE ENQUEUE INTERFACE ACTIVE',                        C76160002
               'STAT FUNCTION INTERFACE ACT.'                           76200002
         LINE  ,,SKIP=2                                                 76240002
         BIN   MCHPDR76                                                 76280002
         BIN   MCHPDR77                                                 76320002
         LABEL 'V=R RELEASE INTERFACE ACTIVE','POST INTERFACE ACTIVE'   76360002
         LINE  (45,1),(1,),SKIP=1                                       76400002
         HEX   MCHFSAR,0,4B                                             76440002
         LABEL 'FAILING STORAGE REAL ADDRESS'                           76480002
         LINE                                                           76520002
         HEX   MCHFSAV,0,4B                                             76560002
         LABEL 'BEGINNING FAILING STORAGE VIRTUAL ADDRESS'              76600002
         LINE                                                           76640002
         HEX   MCHFSEAV,0,4B                                            76680002
         LABEL 'ENDING FAILING STORAGE VIRTUAL ADDRESS'                 76720002
         LINE                                                           76760002
         HEX   MCHPDARI,0,4B                                            76800002
         LABEL 'INSTRUCTION ADDRESS AT FAILURE'                         76840002
         LINE  ,,SKIP=1                                                 76880002
         HEX   MCHTCBCU,0,4B                                            76920002
         LABEL 'CURRENT TCB POINTER'                                    76960002
         LINE  ,                                                        77000002
         ROUTINE XRELN,JUMP                                             77040002
         LABEL ''                                                       77080002
LINE2    LINE  (41,1),(1,1),SKIP=2                                      77120002
         HEX   RECLNT                                                   77160002
LAB2     LABEL 'RECORD LENGTH'                                          77200002
         LINE  ,                                                        77240002
         HEX   WAITST                                                   77280002
         LABEL 'WAIT STATE'                                             77320002
         LINE  ,(52,),SKIP=2                                            77360002
         ROUTINE XRELN,SKIPPER                                          77400002
         LABEL 'MACHINE-CHECK-ERROR INDICATORS'                         77440002
         LINE  (5,35),(1,31)                                            77480002
         ROUTINE XRELN,SKIPPER                                          77520002
         LABEL 'TERMINAL ERROR FLAGS','HARD-MACHINE ERROR FLAGS',      X77560002
               'INTERMEDIATE ERROR','SOFT-MACHINE-ERROR FLAGS'          77600002
         LINE  (26,31),(1,31),SKIP=1                                    77640002
         BIN   (MCETEF0),(MCEMEF0),(MCEIEF0),(MCESEF0)                  77680002
         LABEL 'RESERVED','ASSUMED HD ERR FLG','RESERVED',             X77720002
               'ASSUMED SOFT ERROR'                                     77760002
         LINE  ,                                                        77800002
         BIN   (MCETEF1),(MCEMEF1),(MCEIEF1),(MCESEF1)                  77840002
         LABEL 'RESERVED','RESERVED','RESERVED','RESERVED'              77880002
         LINE  ,                                                        77920002
         BIN   (MCETEF2),(MCEMEF2),(MCEIEF2),(MCESEF2)                  77960002
         LABEL 'THRESHOLD REACHED','RESERVED','RESERVED','RESERVED'     78000001
         LINE  ,                                                        78040002
         BIN   (MCETEF3),(MCEMEF3),(MCEIEF3),(MCESEF3)                  78080002
         LABEL 'SECONDARY ERROR FLAG','SYSTEM DAMAGE FLAG',   @XA20543 *78120001
               'RESERVED','RESERVED'                                    78140001
         LINE  ,                                                        78160002
         BIN   (MCETEF4),(MCEMEF4),(MCEIEF4),(MCESEF4)                  78200002
         LABEL 'CHECK STOP FLAG','REG/PSW INVALID FLAG',               X78240002
               'TOD CLOCK ERROR FLAG','EXT DAMAGE FLAG'                 78280002
         LINE  ,                                                        78320002
         BIN   (MCETEF5),(MCEMEF5),(MCEIEF5),(MCESEF5)                  78360002
         LABEL 'POWER WARNING FLAG','HARD STOR. ERR. FLAG',            X78400002
               'CLOCK COMP ERR. FLAG','ECC CORR. STOR. ERR.'            78440002
         LINE  ,                                                        78480002
         BIN   (MCETEF6),(MCEMEF6),(MCEIEF6),(MCESEF6)                  78520002
         LABEL 'RESERVED','HARD PROTECT. KEY ERR.',           @XA20543 *78560001
               'CPU TIMER ERR. FLAG','HIR CORR. PROC ERR FG'            78600002
         LINE  ,SKIP=2                                                  78640002
         BIN   (MCETEF7),(MCEMEF7),(MCEIEF7),(MCESEF7)                  78680002
         LABEL 'INVALID LOGOUT FLAG','INST. PROC. DAMAGE FLAG',        X78720002
               'INTERVAL TIMER ERR. FLAG','BUFFER ERR. FLAG'            78760002
         LINE  ,(30),SKIP=2                                             78800002
         ROUTINE XRELN,SKIPPER                                          78840002
         LABEL 'PROGRAM DAMAGE ASSESSMENT AND REPAIR'                   78880002
         LINE  (30,32),(1,35),SKIP=2                                    78920002
         ROUTINE XRELN,SKIPPER                                          78960002
         LABEL 'PDAR DATA','STOR. RECONFIG. STATUS',                   X79000002
               'STORAGE RECONFIG. STATUS'                               79040002
         LINE  (26,32),(1,32),SKIP=1                                    79080002
         BIN   (PDAR00),(PDAR10),(PDAR20)                               79120002
         LABEL 'RESERVED','RESERVED','FR OFF LN/SCHED OFF LN'           79160002
         LINE  ,                                                        79200002
         BIN   (PDAR01),(PDAR11),(PDAR21)                               79240002
         LABEL 'RESERVED','RESERVED','INTERCEPT'                        79280002
         LINE  ,                                                        79320002
         BIN   (PDAR02),(PDAR12),(PDAR22)                               79360002
         LABEL 'RESERVED','RESERVED','PERM. ERR. IN FRAME'              79400002
         LINE  ,                                                        79440002
         BIN   (PDAR03),(PDAR13),(PDAR23)                               79480002
         LABEL 'STORAGE RECONFIG.','RESERVED',                         X79520002
               'FRAME-PERM. RES. SYS.'                                  79560002
         LINE  ,                                                        79600002
         BIN   (PDAR04),(PDAR14),(PDAR24)                               79640002
         LABEL 'STOR REFIG STST AVAIL.','RESERVED','FRAME USE SQA'      79680002
         LINE  ,                                                        79720002
         BIN   (PDAR05),(PDAR15),(PDAR25)                               79760002
         LABEL 'STOR REFIG. NOT ATTEMP.','RESERVED','FRAME USE LSQA'    79800002
         LINE  ,                                                        79840002
         BIN   (PDAR06),(PDAR16),(PDAR26)                               79880002
         LABEL 'RESERVED','STOR ERR SET IN FRAME','FRAME-FIXED PG DATA' 79920002
         LINE  ,,SKIP=2                                                 79960002
         BIN   (PDAR07),(PDAR17),(PDAR27)                               80000002
         LABEL 'RESERVED','FRAME-CHG IND. ON','FRAME-IS V=R OR SCHED.'  80040002
         LINE  (25,30),(1,),SKIP=2                                      80080002
         HEX   WDSIZE                                                   80120002
         LABEL 'PHYSICAL WORD LENGTH'                                   80160002
         LINE  ,,SKIP=1                                                 80200002
         ROUTINE XRELN,VS2TEST3                                         80240002
         LABEL ''                                                       80280002
         DC    X'FF'                                                    80320002
         DC    X'1B8'                                                   80360002
         DC    XL2'30'                                                  80400002
         DC    XL2'0'                                                   80440002
DUMPCODE DC    X'FF'                                                    80480002
         DC    X'0208'                                                  80520002
         DC    XL2'30'                                                  80560002
         DC    XL2'0'                                                   80600002
SHORTREC DC    X'FF'                                                    80640002
         DC    XL2'80'                                                  80680002
         DC    XL2'30'                                                  80720002
         DC    XL2'0'                                                   80760002
SHTVS2   DC    X'FF'                                                    80800002
         DC    XL2'30'                                                  80840002
         DC    XL2'30'                                                  80880002
         DC    XL2'0'                                                   80920002
LABAREA  EQU   *                                                        80960002
         LSTART                                                         81000002
         END                                                            81040002
