*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 00060002
         SPACE 2                                                        00120002
         MACRO                                                          00180002
&NAME    DSGEN &X1,&X2,&X3,&X4,&X5,&X6,&X7,&X8,&X9,&X10,&X11,&X12,&X13,X00240002
               &X14,&X15,&X16,&X17,&X18,&X19,&X20,&X21,&X22,&X23,&X24, X00300002
               &X25,&X26,&X27,&X28,&X29,&X30,&X31,&X32                  00360002
.*                            THIS MACRO GENERATES ONE DSECT WORD       00420002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 00480002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  00540002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    00600002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 00660002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   00720002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 00780002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      00840002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  00900002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    00960002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   01020002
         GBLC &ITEM(1000)                                               01080002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000)                         01140002
         LCLC  &SYMBOL                                                  01200002
         LCLA  &OP,&COUNT,&BYTE                                         01260002
.LOOP    ANOP                                                           01320002
&OP      SETA  &OP+1                                                    01380002
&ITEMNBR SETA  &ITEMNBR+1                                               01440002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        01500002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            01560002
         MNOTE *,'NULL BIT COUNT FIELD'                                 01620002
         MEXIT                                                          01680002
.OK1     ANOP                                                           01740002
         AIF   ('&SYMBOL' NE '').OK                                     01800002
         MNOTE 'LOG ITEM SYMBOL NOT PROVIDED'                           01860002
         AGO   .CNT                                                     01920002
.OK      ANOP                                                           01980002
         AIF   ('&SYMBOL'(1,1) EQ '''').CNT                *TEMP*       02040002
&SYMBOL  EQU   *+&BYTE                                                  02100002
&ITEM(&ITEMNBR)  SETC '&SYSLIST(&OP,1)'                                 02160002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    02220002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    02280002
.CNT     ANOP                                                           02340002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   02400002
&BYTE    SETA  &COUNT/8                                                 02460002
         AIF (&OP LT N'&SYSLIST).LOOP                                   02520002
         AIF   (&COUNT NE 32).NOT32                                     02580002
&NAME    DS    4C                                                       02640002
         MEXIT                                                          02700002
.NOT32   AIF   (&COUNT NE 64).ERR                                       02760002
&NAME    DS    8C                                                       02820002
         MEXIT                                                          02880002
.ERR     MNOTE '**BIT COUNT FIELDS DO NOT TOTAL 32 OR 64**'             02940002
         MEND                                                           03000002
         EJECT                                                          03060002
*  LINE MACRO     LINE MACRO     LINE MACRO     LINE MACRO            * 03120002
         SPACE 2                                                        03180002
         MACRO                                                          03240002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      03300002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     03360002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    03420002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 03480002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    03540002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    03600002
.*                                 THE PREVIOUS LINE AND STORES THAT #  03660002
.*                                 INTO THE APPROPRIATE BYTE.           03720002
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    03780002
.*                                 DATA.                                03840002
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 03900002
.*                                 DATA COLUMN STARTING CHARACTERS.     03960002
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   04020002
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 04080002
.*                                 STARTING CHARACTERS.                 04140002
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   04200002
.*                                 TO BEGIN NEXT PRINTED LINE.          04260002
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       04320002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   04380002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 04440002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   04500002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 04560002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    04620002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   04680002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   04740002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  04800002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   04860002
.*                                 THE SUBJECT LINE                     04920002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  04980002
         GBLA  &LASTCC,&INITIAL                                         05040002
         GBLC  &NRENTSX                                                 05100002
         GBLC  &CARRCON                                                 05160002
         GBLB  &TEST                                                    05220002
         LCLA  &S                                                       05280002
&NAME    DS    0C                                                       05340002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  05400002
         LINEND                                                         05460002
         AGO   .NTFIRST                                                 05520002
.FIRSTLN ANOP                                                           05580002
&NRENTSX SETC  'N&SYSNDX'                                               05640002
&INITIAL SETA  1                                                        05700002
N&SYSNDX EQU   *                                                        05760002
.NTFIRST ANOP                                                           05820002
         DC    AL1(0)                                                   05880002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               05940002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                06000002
&DB      SETA  &DATA(1)                                                 06060002
         AGO   .AA                                                      06120002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                06180002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 06240002
         AGO   .CC                                                      06300002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    06360002
         AIF   (&DATA(2) EQ &DT).BB                                     06420002
.CC      ANOP                                                           06480002
&DT      SETA  &DATA(2)                                                 06540002
.BB      DC    XL2'FFFE'                                                06600002
         DC    FL1'&DB'                                                 06660002
         DC    FL1'&DT'                                                 06720002
&NRENTS  SETA  &NRENTS+1                                                06780002
.NCDATA  ANOP                                                           06840002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              06900002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               06960002
&LB      SETA  &LABEL(1)                                                07020002
         AGO   .AAA                                                     07080002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              07140002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               07200002
         AGO   .CCC                                                     07260002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  07320002
         AIF   (&LABEL(2) EQ &LT).BBB                                   07380002
.CCC     ANOP                                                           07440002
&LT      SETA  &LABEL(2)                                                07500002
.BBB     DC    XL2'FFFF'                                                07560002
         DC    FL1'&LB'                                                 07620002
         DC    FL1'&LT'                                                 07680002
&NRENTS  SETA  &NRENTS+1                                                07740002
.NCLABEL ANOP                                                           07800002
         AIF   ('&SKIP' NE '').CONT                                     07860002
         AIF   (&TEST EQ 0).NOCHANG                                     07920002
&S       SETA  &LASTCC                                                  07980002
         AGO   .DEFAULT                                                 08040002
.CONT    ANOP                                                           08100002
         AIF   (&TEST EQ 0).AB                                          08160002
&S       SETA  &SKIP                                                    08220002
.DEFAULT ANOP                                                           08280002
         ORG   &CARRCON+3                                               08340002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 08400002
         ORG                                                            08460002
&LASTCC  SETA  &S                                                       08520002
&TEST    SETB  0                                                        08580002
         AGO   .DD                                                      08640002
.AB      AIF   (&SKIP EQ &LASTCC).NOCHANG                               08700002
A&SYSNDX DC    XL2'FFFB'                                                08760002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              08820002
         DC    FL1'9'                                                   08880002
&LASTCC  SETA  &SKIP                                                    08940002
&TEST    SETB  1                                                        09000002
&CARRCON SETC  'A&SYSNDX'                                               09060002
&NRENTS  SETA  &NRENTS+1                                                09120002
.DD      ANOP                                                           09180002
.NOCHANG ANOP                                                           09240002
         MEND                                                           09300002
         EJECT                                                          09360002
*  BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO  * 09420002
         SPACE 2                                                        09480002
         MACRO                                                          09540002
         BIN   &LOGITEM,&SKIP$OR                                        09600002
.*                                 &LOGITEM - NAME OF ITEM IN LOG       09660002
.*                                      RECORD DSECT                    09720002
.*                                 &SKIP$OR - NBR OF SPACES TO SKIP ON  09780002
.*                                 MULTIPLE PRINT OR NBR OF SPACES      09840002
.*                                      TO BACK UP FROM COLUMN FOR      09900002
.*                                      START OF PRINTING. THE LETTER   09960002
.*                                      B PRECEEDS THE NUMBER (B5) IF   10020002
.*                                      THE LATTER IS DESIRED. OMISSION 10080002
.*                                      OF THIS OPERAND FORCES OPTION 2 10140002
.*                                      WITH BACKUP SPACING EQUAL TO    10200002
.*                                 THE NUMBER OF BITS IN THE ITEM       10260002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      10320002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     10380002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       10440002
         GBLC &ITEM(1000)                                               10500002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 10560002
         GBLC  &DSECT                                                   10620002
         LCLB  &B                                                       10680002
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   10740002
         LCLA  &TEMP,&T                                                 10800002
         LCLC  &S                                                       10860002
.LOOP    ANOP                                                           10920002
&NDX     SETA  &NDX+1                                                   10980002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      11040002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  11100002
         MNOTE *,'YOU BLEW IT'                                          11160002
         ROUTINE DUM,SKIPPER                                            11220002
         MEXIT                                                          11280002
.FOUND   ANOP                                                           11340002
&ISHIFT  SETA  &SHIFT(&NDX)                                             11400002
&IBITS   SETA  &BITS(&NDX)                                              11460002
&T       SETA  &IBITS-1                                                 11520002
&B       SETB  0                                                        11580002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                11640002
&K       SETA  K'&SKIP$OR                                               11700002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 11760002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   11820002
&T       SETA  &S                                                       11880002
.BACKUP  ANOP                                                           11940002
&NRENTS  SETA  &NRENTS+1                                                12000002
&TEMP    SETA  &ISHIFT                                                  12060002
A&SYSNDX DC    AL.12(&LOGITEM-&DSECT),XL.4'&TEMP'                       12120002
         AIF (&IBITS EQ 1 AND &B EQ 0).OUT                              12180002
         ORG   A&SYSNDX                                                 12240002
&B       SETB  1                                                        12300002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'C'                           12360002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             12420002
.OUT     ANOP                                                           12480002
         MEND                                                           12540002
         EJECT                                                          12600002
*  HEX MACRO     HEX MACRO     HEX MACRO    HEXN MACRO     HEX MACRO  * 12660002
         SPACE 2                                                        12720002
         MACRO                                                          12780002
         HEX   &LOGITEM,&SKIP$OR,&BYTES                                 12840002
.*                            THIS MACRO FACILITATES GENERATION OF THE  12900002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    12960002
.*                                 CONVERSIONS.                         13020002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE        13080002
.*                                 CONVERTED                            13140002
.*                            &SKIP$OR - NUMBER OF SPACES TO SKIP ON    13200002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   13260002
.*                                 BACK UP FROM COLUMN FOR START OF     13320002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  13380002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  13440002
.*                                 DESIRED. OMISSION OF THIS OPERAND    13500002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  13560002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  13620002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 13680002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    13740002
.*                                 IMPLICITLY B).                       13800002
.*                            &BYTES - NUMBER OF TOTAL INPUT BYTES TO   13860002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     13920002
.*                                 WITH AN L,R, OR B TO STIPULATE       13980002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     14040002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     14100002
.*                                 RESPECTIVELY. OMISSION OF THIS       14160002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  14220002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 14280002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 14340002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   14400002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     14460002
.*                                 SUBJECT LINE(S).                     14520002
         GBLC &ITEM(1000),&DSECT                                        14580002
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 14640002
         LCLB  &B                                                       14700002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP                  14760002
         LCLC  &S,&LETTER                                               14820002
.LOOP    ANOP                                                           14880002
&NDX     SETA  &NDX+1                                                   14940002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      15000002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  15060002
         MNOTE *,'LOG ITEM NOT DEFINED'                                 15120002
         MEXIT                                                          15180002
.FOUND   ANOP                                                           15240002
&ISHIFT  SETA  &SHIFT(&NDX)                                             15300002
&IBITS   SETA  &BITS(&NDX)                                              15360002
&CODE    SETA  1                                                        15420002
&K       SETA  K'&BYTES                                                 15480002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            15540002
         MNOTE *,'BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL'   15600002
         MEXIT                                                          15660002
.OK      AIF   ('&BYTES' EQ '').USEDEFN                                 15720002
&LETTER  SETC  '&BYTES'(&K,1)                                           15780002
&S       SETC  '&BYTES'(1,&K-1)                                         15840002
&BYTESP  SETA  &S                                                       15900002
         AIF   ('&LETTER' EQ 'B').BOTH                                  15960002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).OK2                       16020002
.ERR     MNOTE *,'DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY'            16080002
         MEXIT                                                          16140002
.USEDEFN ANOP                                                           16200002
&BYTESP  SETA  &IBITS/8                                                 16260002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       16320002
&CODE    SETA  3                                                        16380002
&T       SETA  &BYTESP*2-1                                              16440002
&S       SETC  '&T'                                                     16500002
.OK2     AIF   (&ISHIFT EQ 0).L                                         16560002
&CODE    SETA  2                                                        16620002
.L       ANOP                                                           16680002
&B       SETB  1                                                        16740002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                16800002
&K       SETA  K'&SKIP$OR                                               16860002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 16920002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   16980002
.BACKUP  ANOP                                                           17040002
&NRENTS  SETA  &NRENTS+1                                                17100002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'A'                           17160002
         DC    BL.1'&B',FL.7'&S',FL.4'&BYTESP',FL.4'&CODE'              17220002
.OUT     ANOP                                                           17280002
         MEND                                                           17340002
         SPACE 2                                                        17400002
*  ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO* 17460002
         SPACE 2                                                        17520002
         MACRO                                                          17580002
&NAME    ROUTINE &LOGITEM,&RNAME                                        17640002
         GBLC  &DSECT,&CSECT                                            17700002
         GBLC  &ITEM(1000)                                              17760002
         GBLA  &SHIFT(1000),&ITEMNBR                                    17820002
         GBLA  &NRENTS                                                  17880002
         LCLA  &ISHIFT,&NDX                                             17940002
.LOOP    ANOP                                                           18000002
&NDX     SETA  &NDX+1                                                   18060002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      18120002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  18180002
         MNOTE *,'LOG ITEM NOT DEFINED'                                 18240002
         MEXIT                                                          18300002
.FOUND   ANOP                                                           18360002
&ISHIFT  SETA  &SHIFT(&NDX)                                             18420002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           18480002
         DC    AL.4(&ISHIFT),AL.12(&RNAME-&CSECT)                       18540002
&NRENTS  SETA  &NRENTS+1                                                18600002
         MEND                                                           18660002
         EJECT                                                          18720002
*  LABEL MACRO     LABEL MACRO     LABEL MACRO     LABEL MACRO        * 18780002
         SPACE 2                                                        18840002
         MACRO                                                          18900002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C18960002
               &LABEL7,&LABEL8                                          19020002
.*                            THIS MACRO ALLOWS UP TO ACHT LABELS TO    19080002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   19140002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  19200002
.*                                 TION MARKS. THE COLUMN AND LINE END  19260002
.*                                 CONTROLS WILL BE INSERTED BY THE     19320002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      19380002
.*                                 LABEL REQUIRED FOR RESPECTIVE        19440002
.*                                 COLUMN. THIS MACRO WILL ALSO ALERT   19500002
.*                                 THE PROGRAMMER TO EXACTLY WHERE THE  19560002
.*                                 TABLE MUST BE BROKEN IF NECESSARY    19620002
.*                                 TO AVOID EXCEEDING THE MAXIMUM LIMIT 19680002
         GBLC &LABELS(2000)                                             19740002
         GBLC  &LBL(100)                                                19800002
         GBLA  &LBLCTR(100)                                             19860002
         GBLA  &LABELNR                                                 19920002
         GBLA  &NRENTS,&LPTR                                            19980002
         LCLC  &MARGIN,&TACK                                            20040002
         LCLC  &TEXT                                                    20100002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            20160002
&MARGIN  SETC  '*'                                                      20220002
         AIF   ('&NAME' EQ '').LOOPOUT                                  20280002
&LPTR    SETA  &LPTR+1                                                  20340002
&LBL(&LPTR) SETC '&NAME'                                                20400002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          20460002
.LOOPOUT ANOP                                                           20520002
&OP      SETA  &OP+1                                                    20580002
&K       SETA  K'&SYSLIST(&OP)                                          20640002
         AIF (&K GE 2).NORM                                             20700002
&K       SETA  2                                                        20760002
.NORM    ANOP                                                           20820002
&START   SETA  2                                                        20880002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                20940002
&MARGIN  SETC  '$'                                                      21000002
.NOTLAST ANOP                                                           21060002
&NRCHAR  SETA  8                                                        21120002
&TACK    SETC  ''                                                       21180002
.LOOPIN  ANOP                                                           21240002
&REMAIN  SETA  &K-&START                                                21300002
         AIF (&REMAIN GE 8).MORE                                        21360002
&TACK    SETC  '&MARGIN'                                                21420002
&NRCHAR  SETA  &REMAIN                                                  21480002
.MORE    ANOP                                                           21540002
&TEXT    SETC  ''                                                       21600002
         AIF (&REMAIN EQ 0).ENDTEXT                                     21660002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          21720002
.ENDTEXT ANOP                                                           21780002
&LABELNR SETA  &LABELNR+1                                               21840002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  21900002
&START   SETA  &START+8                                                 21960002
         AIF ('&TACK' EQ '').LOOPIN                                     22020002
         AIF ('&TACK' EQ '*').LOOPOUT                                   22080002
         MEND                                                           22140002
         SPACE 2                                                        22200002
         MACRO                                                          22260002
         LSTART                                                         22320002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  22380002
.*                                 OF THE TABLE IS TO BEGIN.            22440002
         GBLC &LABELS(2000)                                             22500002
         GBLA  &LABELNR                                                 22560002
         GBLC  &LBL(100)                                                22620002
         GBLA  &LBLCTR(100)                                             22680002
         LCLA  &NDX,&CTR                                                22740002
         LINEND                                                         22800002
&CTR     SETA  1                                                        22860002
.LOOP    ANOP                                                           22920002
&NDX     SETA  &NDX+1                                                   22980002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            23040002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         23100002
&CTR     SETA  &CTR+1                                                   23160002
         AGO   .LOOPCTL                                                 23220002
.NOLBL   ANOP                                                           23280002
         DC    C'&LABELS(&NDX)'                                         23340002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  23400002
         MEND                                                           23460002
         SPACE 2                                                        23520002
         MACRO                                                          23580002
         LINEND                                                         23640002
.*                            THIS MACRO IS USED ONLY BY THE LINE       23700002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   23760002
.*                                 ASSOCIATED WITH EACH LINE.           23820002
         GBLA  &NRENTS                                                  23880002
         GBLC &NRENTSX                                                  23940002
         ORG   &NRENTSX                                                 24000002
         DC    FL1'&NRENTS'                                             24060002
         ORG                                                            24120002
&NRENTS  SETA  0                                                        24180002
B&SYSNDX EQU   *                                                        24240002
&NRENTSX SETC  'B&SYSNDX'                                               24300002
         MEND                                                           24360002
         GBLC  &DSECT,&CSECT                                            24420002
         TITLE 'IFCEXXXB-EDIT TABLE FOR 3420 TAPES'                     24480002
IFCEXXXB CSECT                                                          24540002
&CSECT   SETC  'IFCEXXXB'                                               24600002
&DSECT   SETC  'M3420'                                                  24660002
M3420    DSECT                                                          24720002
         DSGEN (CLASSRC,8),(SYSREL,8),(SWITCHES,16),(SPARES,32)         24780002
         DSGEN (DUM1,8),(YEAR,8),(DAY,16),(TIME,32)                     24840002
         DSGEN (SPARE1,8),(CPUSER,24),(CPUID,16),(SPARE2,16)            24900002
         DSGEN (JOBID,64)                                               24960002
         DSGEN (COMMCODE,8),(DATAADDR,24),(FLAGS,8),(RESERVED,8),      C25020002
               (CCWCOUNT,16)                                            25080002
         DSGEN (CSWKEY,8),(COMMADDR,24),(ATTEN,1),(STATMOD,1),         C25140002
               (CONTUEND,1),(BUSY,1),(CHANEND,1),(DEVEND,1),           C25200002
               (UNITCHK,1),(UNITEXEP,1),(CHSTAT,8),(CSWCOUNT,16)        25260002
         ORG   ATTEN                                           @XA19935 25270060
         DSGEN (ATTENBIT,8),(,24)                              @XA19935 25280060
         ORG   CSWKEY+8                                        @XA19935 25290060
         DSGEN (DDCOUNT,8),(SECONCUA,24),(DEVTYPE,32)                   25320002
         DSGEN (SDRCOUNT,8),(PRIMCUA,24),(IORETRYS,16),(SNSBYTES,16)    25380002
         DSGEN (VOLID,48),(BLKLENG,16)                                  25440002
         DSGEN (DUM2,32),(TEMPRDS,8),(TEMPWRTS,8),(SIOCNT,16)           25500002
         DSGEN (PERMRDS,8),(PERMWRTS,8),(NOISEBLK,8),(MODESET,8)        25560002
         DSGEN (ERASEGPS,16),(CLNRACTS,16)                              25620002
         DSGEN (DUM3,8),(NOISE,8),(RWVRC,8),(MTELRCR,8)                 25680002
         DSGEN (EDCCRC,8),(ENVCKVRC,8),(OVERRUN,4),(SKEWCHK,4),        C25740002
               (CCOMPARE,4),(WRTTRVRC,4)                                25800002
         DSGEN (PEIDCHK,1),(MASKEXP,6),(PARITY,1),(TRKINERR,8),        C25860002
               (WRTTMCHK,4),(STRDCHK,4),(PARTREC,4),(EXCPAMB,4)         25920002
         DSGEN  (ORDROP,4),(FEEDTHRU,4),(EXP,4),(EARLBGRD,4),          C25980002
               (EARLNDRD,4),(SLBGRD,4),(SLWNDRD,4),(VELRETRY,4),       C26040002
               (EXP2,4),(VELCHNG,4),(EXP3A,4),(EXP3,4),(BACKWARD,8),   C26100002
               (BUSOCHK,4),(ALUHRDER,4)                                 26160002
         DSGEN (SNB000,1),(SNB001,1),(SNB002,1),(SNB003,1),(SNB004,1), C26220002
               (SNB005,1),(SNB006,1),(SNB007,1),(SNB010,1),(SNB011,1), C26280002
               (SNB012,1),(SNB013,1),(SNB014,1),(SNB015,1),(SNB016,1), C26340002
               (SNB017,1),(SNB020,1),(SNB021,1),(SNB022,1),(SNB023,1), C26400002
               (SNB024,1),(SNB025,1),(SNB026,1),(SNB027,1),(SNB030,1), C26460002
               (SNB031,1),(SNB032,1),(SNB033,1),(SNB034,1),(SNB035,1), C26520002
               (SNB036,1),(SNB037,1)                                    26580002
         DSGEN (SNB040,1),(SNB041,1),(SNB042,1),(SNB043,1),(SNB044,1), C26640002
               (SNB045,1),(SNB046,1),(SNB047,1),(SNB050,1),(SNB051,1), C26700002
               (SNB052,1),(SNB053,1),(SNB054,1),(SNB055,1),(SNB056,1), C26760002
               (SNB057,1),(SNB060,1),(SNB061,1),(SNB062,1),(SNB063,1), C26820002
               (SNB064,1),(SNB065,1),(SNB066,1),(SNB067,1),(SNB070,1), C26880002
               (SNB071,1),(SNB072,1),(SNB073,1),(SNB074,1),(SNB075,1), C26940002
               (SNB076,1),(SNB077,1)                                    27000002
         DSGEN (SNB080,1),                                             C27060002
               (SNB081,1),(SNB082,1),(SNB083,1),(SNB084,1),(SNB085,1), C27120002
               (SNB086,1),(SNB087,1),(SNB090,1),(SNB091,1),(SNB092,1), C27180002
               (SNB093,1),(SNB094,1),(SNB095,1),(SNB096,1),(SNB097,1), C27240002
               (SNB100,1),(SNB101,1),(SNB102,1),(SNB103,1),(SNB104,1), C27300002
               (SNB105,1),(SNB106,1),(SNB107,1),(SNB110,1),(SNB111,1), C27360002
               (SNB112,1),(SNB113,1),(SNB114,1),(SNB115,1),(SNB116,1), C27420002
               (SNB117,1)                                               27480002
         DSGEN (SNB120,1),(SNB121,1),(SNB122,1),(SNB123,1),(SNB124,1), C27540002
               (SNB125,1),(SNB126,1),(SNB127,1),(TCSERIAL,16),         C27600002
               (TUSERIAL,16),(SNB170,1),(SNB171,1),                    C27660002
               (SNB172,1),(SNB173,1),(SNB174,1),(SNB175,1),(SNB176,1), C27720002
               (SNB177,1),(SNB180,1),(SNB181,1),(SNB182,1),(SNB183,1), C27780002
               (SNB184,1),(SNB185,1),(SNB186,1),(SNB187,1),(SNB190,1), C27840002
               (SNB191,1),(SNB192,1),(SNB193,1),(SNB194,1),(SNB195,1), C27900002
               (SNB196,1),(SNB197,1)                                    27960002
         DSGEN (SNB200,1),(SNB201,1),(SNB202,1),(SNB203,1),(SNB204,1), C28020002
               (SNB205,1),(SNB206,1),(SNB207,1),(SNB210,1),(SNB211,1), C28080002
               (SNB212,1),(SNB213,1),(SNB214,1),(SNB215,1),(SNB216,1), C28140002
               (SNB217,1),(SNB22,8),(SNB23,8)                           28200002
IFCEXXXB CSECT                                                          28260002
*                                                                     * 28320002
*                       EDIT TABLE FOR THE 3420 DEVICE                * 28380002
*                                                                     * 28440002
         USING *,R9                                                     28500002
         USING M3420,R2                                                 28620002
         DC    A(ENTRIES)                                               28680002
         DC    CL8'IFCEXXXB'                                            28740002
NINE     DC    F'0'                                                     28800002
LABELPTR DC    F'0'                                                     28860002
R2       EQU   2                                                        28920002
R3       EQU   3                                                        28980002
R4       EQU   4                                                        29040002
R5       EQU   5                                                        29100002
R6       EQU   6                                                        29160002
R7       EQU   7                                                        29220002
R8       EQU   8                                                        29280002
R9       EQU   9                                                        29340002
R14      EQU   14                                                       29400002
R15      EQU   15                                                       29460002
L0       EQU   0                                                        29520002
L1       EQU   1                                                        29580002
L2       EQU   2                                                        29640002
L3       EQU   3                                                        29700002
L4       EQU   4                                                        29760002
L5       EQU   5                                                        29820002
L6       EQU   6                                                        29880002
L7       EQU   7                                                        29940002
L8       EQU   8                                                        30000002
L9       EQU   9                                                        30060002
L10      EQU   10                                                       30120002
L11      EQU   11                                                       30180002
L13      EQU   13                                                       30240002
L20      EQU   20                                                       30300002
L21      EQU   21                                                       30360002
L24      EQU   24                                                       30420002
L27      EQU   27                                                       30480002
L28      EQU   28                                                       30540002
L88      EQU   88                                                       30570002
CHAR0    EQU   X'F0'              ZONE USED IN BIT PRINT                30660002
RELONLY  EQU   X'1F'                                                    30720002
DENS16   EQU   X'04'                                                    30780002
BIRCH    EQU   X'08'                                             S99223 30810002
DENS8    EQU   X'10'                                                    30840002
DISMOUNT EQU   X'84'                                             XM9111 30900002
FE       EQU   X'FE'                                                    30960002
LONG     EQU   X'40'                                                    31020002
SHORT    EQU   X'30'                                                    31080002
ZERO     EQU   X'00'                                                    31140002
SHRTRECD EQU   X'20'                                                    31200002
ZEROHI   EQU   X'3F'                                                    31260002
*                                                                     * 31320002
*                         SPECIAL ROUTINE SECTION                     * 31380002
*                                                                     * 31440002
* UPON ENTRY TO ANY SPECIAL ROUTINE REG4 POINTS TO THE FIELD IN THE   * 31500002
* LOGREC RECORD WHICH WILL BE PROCESSED. REG3 POINTS TO THE PRINT     * 31560002
* POSITION OF THE PRINT BUFFER WHERE THE DATA SHOULD BE PUT. REG9     * 31620002
* IS USED FOR ADDRESSABILITY. THEN REG15 IS ZEROED BEFORE A RETURN    * 31680002
* THE BUFFER THAT WAS JUST PROCESSED IS NOT PRINTED.                  * 31740002
*                                                                     * 31800002
*                                                                     * 31860002
CONVREL  STM   R5,R8,XSAVE              SAVE WORK REGS                  31920002
         SR    R6,R6                    CLEAR R6                        31980002
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        32040002
         SRDL  R6,L5                    SAVE REL NO IN R7               32100002
        SLL   R6,L2                    MULTIPLY SYS VALUE BY 4          32160002
         L     R8,XLABELP               PICK UP LABEL POINTER           32220002
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     32280002
         MVC   L88(L4,R8),L0(R6)        MOVE SYSTEM NAME INTO LABEL     32340002
         SR    R6,R6                    CLEAR R6                        32400002
         SLDL  R6,L5                    RETREIVE REL NO.                32460002
         LTR   R6,R6                    IS IT ZERO                      32520002
         BZ    NOREL                    BR-YES                          32580002
         CVD   R6,WORK                  CONVERT IT                      32640002
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFF       32700002
         MVZ   L1(L1,R3),L0(R3)         MOVE ON PROPER ZONE             32760002
         B     RETURN                   EXIT                            32820002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL            32880002
RETURN   LM    R5,R8,XSAVE                                              32940002
         BR    R14                                                      33000002
*                                                                     * 33060002
* THIS ROUTINE WILL CONVERT ONE BYTE OF BITS TO THEIR EBCDIC          * 33120002
* EQUIVALENT.                                                         * 33180002
*                                                                     * 33240002
SETBINA  STM   R5,R8,STOREREG     SAVE REGISTERS                        33300002
         LR    R8,R3              PUT LINE POINTER TO REGISTER          33360002
         LA    R5,L8              PUT COUNTER IN REGISTER               33420002
         IC    R7,L0(R4)          GET THE BYTE TO PRINT                 33480002
         SLL   R7,L24             SHIFT TO LOW BIT POSITIONS            33540002
CHNGBITS SR    R6,R6              CLEAR REGISTER                        33600002
         SLDL  R6,L1              MOVE ONE BIT INTO REG                 33660002
         STC   R6,L0(R8)          STORE THE BIT ON PRINT LINE           33720002
         OI    L0(R8),CHAR0       MOVE ZONE TO MAKE IT A PRINTABLE CHAR 33780002
         LA    R8,L1(R8)          INCREMENT PRINT LINE                  33840002
         BCT   R5,CHNGBITS        ALL BITS BEEN PRINTED                 33900002
         LM    R5,R8,STOREREG     RESTORE REGISTERS                     33960002
DONOTHNG BR    R14                RETURN                                34020002
*                                                                     * 34800002
*                                                                     * 34860002
*                                                                     * 34920002
*THIS ROUTINE WILL TAKE A ONE BYTE COUNTER FROM THE LOGREC ENTRY AND  * 34980002
* CONVERT IT TO EBCDIC AND PUT IT INTO THE PRINT BUFFER               * 35040002
* IT IS ALSO USED TO CONVERT WHATEVER BINARY VALUE THAT IS IN R4 TO   * 35100002
* A PRINTABLE FORM.R6 MUST BE SET TO THE LENGTH OF THE RECEIVING FIELD* 35160002
* FOR THE EXECUTE INSTRUCTION                                         * 35220002
*                                                                     * 35280002
ONEBYTE  STM   R5,R8,STOREREG     STORE REGISTERS                       35340002
         SR    R5,R5              CLEAR REGISTER5                       35400002
         IC    R5,L0(R4)          GET THE BYTE TO BE CONVERTED          35460002
PROCDEC  LA    R8,INLINE          LOAD THE RETURN ADDRESS               35520002
         LA    R6,SHORT           GET LENGTH FOR EXECUTE INSTRUCTION    35580002
CONVERT  CVD   R5,DECBYTES        CONVERT TO DECIMAL                    35640002
         EX    R6,UNPACK          UNPACK INTO THE PRINT BUFFER          35700002
         BR    R8                 RETURN TO INLINE PROCESSING           35760002
INLINE   OI    L3(R3),CHAR0       MAKE THE LAST CHAR A PRINTABLE NBR    35820002
         LM    R5,R8,STOREREG     RELOAD REGISTERS                      35880002
         BR    R14                RETURN                                35940002
UNPACK   UNPK  L0(L1,R3),DECBYTES(8) UNPACK NUMBER5 TO PRINT LINE       36000002
*                                                                     * 36060002
* THIS ROUTINE IS USED TO ISOLATE THE RIGHT HALF OF A BYTE AND GOES   * 36120002
* TO HAVE IT CONVERTED TO PRINTABLE FORM                              * 36180002
*                                                                     * 36240002
RGHTHALF STM   R5,R8,STOREREG     STORE REGISTERS                       36300002
         SR    R5,R5              CLEAR REGISTER                        36360002
         IC    R5,L0(R4)          GET A BYTE FROM RECORD                36420002
         SLL   R5,L28             GET RID OF LOW ORDER BITS             36480002
         SRL   R5,L28             MOVE BACK                             36540002
         B     PROCDEC            GO TO CONVERT IT                      36600002
STOREREG DC    6F'0'                                                    36660002
FULLCNTR EQU   STOREREG+20                                              36720002
HALFCNTR EQU   STOREREG+22                                              36780002
THOUSAND DC    H'10000'                                        @ZA01048 36800002
SERNUMBR DC    H'0'                                            @ZA01048 36820002
*                                                                     * 36840002
* THIS ROUTINE IS USED TO ISOLATE THE LEFT HALF OF A BYTE AND GOES    * 36900002
* TO HAVE IT CONVERTED TO PRINTABLE FORM                              * 36960002
*                                                                     * 37020002
LEFTHALF STM   R5,R8,STOREREG     STORE REGISTERS                       37080002
         SR    R5,R5              CLEAR REGISTER                        37140002
         IC    R5,L0(R4)          GET BYTE FROM THE RECORD              37200002
         SRL   R5,L4              GET RID OF HIGH ORDER BITS            37260002
         B     PROCDEC            GO TO CONVERT IT                      37320002
*                                                                     * 37380002
* USED TO GET A HALFWORD COUNTER FROM THE RECORD AND GOES TO HAVE IT  * 37440002
* CONVERTED TO PRINTABLE FORM.RETURNS TO HAVE THE ZONE CHANGED BECAUSE* 37500002
* THIS WILL BE REPRESENTED AS A FIVE DIGIT NUMERAL RATHER THAN A FOUR * 37560002
* DIGIT AS THE SINGLE AND HALF BYTE COUNTERS.                         * 37620002
*                                                                     * 37680002
TWOBYTES STM   R5,R8,STOREREG     STORE REGISTERS                       37740002
         MVC   HALFCNTR(L2),L0(R4) MOVE THE COUNTER TO STORAGE          37800002
         L     R5,FULLCNTR        PUT THE COUNTER INTO A REGISTER       37860002
MOVESER1 LA    R6,LONG             GET LENGTH FOR EXEC INST    @XA19935 37920060
         BAL   R8,CONVERT         GO TO CONVERT THE NUMBER TO EBCDIC    37980002
         OI    L4(R3),CHAR0       MAKE LAST CHARACTER PRINTABLE         38040002
         LM    R5,R8,STOREREG     RESTORE REGISTERS                     38100002
         BR    R14                RETURN                                38160002
*                                                                  *    38220002
* THE HIGH ORDER TWO BITS OF THE TCSERIAL ARE RESERVED FOR FUTURE     * 38280002
* USE AND ARE NOT PART OF THE SERIAL NUMBER. THEY HAVE TO CLEARED     * 38340002
* TO PUT THE SERIAL NUMBER OUT IN EBCDIC BUT RESTORED FOR THE HEX  *    38400002
* DUMP. THAT IS WHAT THESE ROUTINES WILL DO.                       *    38460002
*                                                                  *    38520002
MOVESER  STM   R5,R8,STOREREG      STORE REGISTERS             @ZA01048 38580002
         MVC   SERNUMBR(L2),L0(R4) SAVE SERIAL NO.             @ZA01048 38610002
         NI    SERNUMBR,ZEROHI     ZERO THE HI ORDER TWO BITS  @XA19935 38640060
         LH    R5,SERNUMBR                                     @XA19935 38710060
         AH    R5,THOUSAND         ADD  TEN THOUSAND           @XA19935 38780060
         B     MOVESER1            PRINT VALUE                 @XA19935 38850060
*                                                                     * 38940002
* THIS ROUTINE WILL CHECK THE MODEL BITS IN THE LAST HALF OF BYTE SIX * 39000002
* AND PUT THE EBCDIC VALUE ON THE PRINT BUFFER.                       * 39060002
*        3410 MODEL BITS           3420 MODEL BITS                    * 39120002
*        0000  MODEL 1             0011  MODEL 3                 S99223 39180002
*        0001  MODEL 2             0100  MODEL 5                 S99223 39210002
*        0010  MODEL 3             0101  MODEL 7                 S99223 39240002
*                                  1011  MODEL 4                 S99223 39270002
*                                  1100  MODEL 6                 S99223 39300002
*                                  1101  MODEL 8                 S99223 39330002
*                                                                S99223 39360002
MODEL    STM   R6,R7,STOREREG     SAVE THE REGISTERS                    39420002
         IC    R7,L0(R4)          GET THE MODEL BITS                    39480002
         SLL   R7,L28             SHIFT OUT UNNEEDED BITS               39540002
         SRL   R7,L28             MOVE BACL INTO POSITION               39600002
         LA    R6,MODNO(R7)       GET THE ADDRESS OF EBCDIC NUMBER      39660002
         MVC   L0(L1,R3),L0(R6)   MOVE THE DIGIT TO THE PRINT BUFFER    39720002
         LM    R6,R7,STOREREG     GET THE PREVIOUSLY SAVED REGISTERS    39780002
         BR    R14                RETURN                                39840002
PUTMOD   STM   R5,R8,STOREREG      SAVE THE REGISTERS          @ZA01048 39843002
         IC    R7,L0(R4)           GET THE MODEL BITS          @ZA01048 39846002
         SLL   R7,L28              SHIFT OUT UNNEEDED BITS     @ZA01048 39849002
         SRL   R7,L28              MOVE BACK INTO POSITION     @ZA01048 39852002
         LA    R6,MODNO(R7)        GET ADDRESS OF EBCDIC NUMBER         39855002
         IC    R5,L0(R6)           PUT MODEL NO IN REG         @ZA01048 39858002
         LR    R6,R5               LOAD INTO REGISTER          @ZA01048 39861002
         SLL   R6,L28              SHIFT OUT UNNEEDED BITS     @ZA01048 39864002
         SRL   R6,L28              MOVE BACK INTO POSITION     @ZA01048 39867002
         MH    R6,THOUSAND         MULT BY A THOUSAND          @ZA01048 39870002
         SR    R5,R5               CLEAR REG5                  @XA19935 39873060
         ICM   R5,3,L9(R4)         PUT TWO BYTES INTO REG5     @XA19935 39874060
         AR    R6,R5               ADD MODEL NO.TO SER NO.     @XA19935 39876060
         LR    R5,R6               PUT COUNT INTO REGISTER     @ZA01048 39879002
         LA    R6,LONG             GET LENGTH FOR EXECUTE      @ZA01048 39882002
         BAL   R8,CONVERT          GO TO CONVERT TO EBCDIC     @ZA01048 39885002
         OI    L4(R3),CHAR0        MAKE LAST CHARACTER PRINTABLE        39888002
         LM    R5,R8,STOREREG      RESTORE REGISTERS           @ZA01048 39891002
         BR    R14                                             @ZA01048 39894002
MODNO   DC    X'F1F2F3F3F5F76060606060F4F6F8'                    S99223 39900002
*                                                                     * 39960002
* THIS CODE WILL MOVE THE JOB NAME AND VOLID FROM THE RECORD TO THE   * 40020002
* BUFFER                                                              * 40080002
*                                                                     * 40140002
JOBNAME  MVC   L0(L8,R3),L0(R4)   MOVE THE JOBID TO PRINT LINE          40200002
         BR    R14                RETURN                                40260002
VOLNAME  MVC   L0(L6,R3),L0(R4)   MOVE THE VOLID TO PRINT LINE          40320002
         BR    R14                RETURN                                40380002
*                                                                     * 40440002
*                                                                     * 40500002
* THIS CODE WILL TAKE THE DATE FROM THE RECORD UNPACK IT AND PUT IT   * 40560002
* IN THE PRINT BUFFER.                                                * 40620002
*                                                                     * 40680002
SETDATE  UNPK  DECBYTES(5),L0(L3,R4) UNPACK THE DATE                    40740002
         MVC   L0(L3,R3),DECBYTES+L2 MOVE DAY TO PRINT BUFFER           40800002
         OI    L2(R3),CHAR0       MAKE LAST DIGIT PRINTABLE             40860002
         MVC   L4(L2,R3),DECBYTES MOVE YEAR TO PRINT BUFFER             40920002
         BR    R14                  RETURN                              40980002
*                                                                     * 41040002
* USED TO INCREMENT THE PRINT BUFFER BY TWO BYTES                     * 41100002
*                                                                     * 41160002
SPACE2B  NI    L2(R3),FE  ZERO HIGH ORDER BIT OF COMMAND ADDR  @XA19935 41190060
SPACE2   LA    R3,L2(R3)          INCREMENT LINE POINTER BY TWO BYTES   41220002
         BR    R14                RETURN                                41280002
*                                                                     * 41820002
*                                                                     * 41880002
* THE FOLLOWING ARE ROUTINES TO INCREMENT THE PRINT BUFFER POINTER.   * 41940002
*                                                                     * 42000002
*                                                                     * 42060002
ADD27    LA    R3,L6(R3)                                       @XA19935 42070060
ADD21    LA    R3,L8(R3)                                       @XA19935 42080060
ADD13    LA    R3,L8(R3)                                       @XA19935 42090060
ADD5     LA    R3,L5(R3)          INCREMENT LINE POINTER BY 5           42360002
         BR    R14                RETURN                                42420002
*                                                                     * 44520002
*                                                                     * 44580002
* IF THE RECORD BEING PROCESSED IS A DISMOUNT RECORD THE HEX DUMP     * 44640002
* LENGTH FIELD IS SET TO ZERO FOR NO DUMP. IF IT IS A FULL OBR THE    * 44700002
* LENGTH FIELD IS SET FOR A 24 BYTE HEADER AND A 132 BYTE FULL RECORD * 44760002
* THE ROUTINE THEN DETERMINES WHAT TYPE OF RECORD FORMAT IS TO        * 44820002
* BE PRINTED. IF THERE IS NO DISMOUNT RECORD, ADDRESSES ARE SET TO    * 44880002
* PRINT A FULL OBR. IF THE RECORD IS A DISMOUNT RECORD A TEST IS MADE * 44940002
* TO SEE IF COLUMN LABELS MUST BE PRINTED. IF THEY MUST THE ROUTINE   * 45000002
* SETS THE SWITCH AND RETURNS. IF NOT THE ADDRESSES ARE UPDATED TO    * 45060002
* BYPASS PRINTING THE LABELS.                                         * 45120002
*                                                                     * 45180002
TYPEREC  STM   R6,R8,STOREREG     SAVE REGISTERS                        45300002
         TM    L1(R4),DISMOUNT    IS THIS A SHORT RECORD                45360002
         BC    8,NODIS            BRANCH FOR FULL LENGTH RECORD         45480002
         LA    R6,EXIT-4                                       @XA19935 45540060
         ST    R6,NINE                                         @XA19935 45570060
         B     NOPRINTA                                        @XA19935 45600060
NODIS    CLC   SNSBYTES(L2),NINER NINE SENSE BYTES?             SA55024 45640002
         BNH   NOPRINTA            GO FOR NORMAL PROCESSING    @XA19935 45740060
         LA    R7,LONGLAB2-1                                   @XA19935 45760060
         ST    R7,LABELPTR                                     @XA19935 45780060
         LA    R7,LONGENT2-4                                   @XA19935 45800060
         ST    R7,NINE                                         @XA19935 45820060
NOPRINTA LM    R6,R8,STOREREG     RELOAD SAVED REGISTERS                46320002
NOPRINT  SR    R15,R15            SET REGISTER FOR NO PRINT             46380002
         BR    R14                RETURN CONTROL                        46440002
XSAVE    EQU   STOREREG                                        @XA19935 49380060
NONE     DC    C'NONE'                                                  49440002
XLABELP  EQU   LABELPTR                                                 49500002
XRELN    EQU   SYSREL                                                   49560002
RELTAB   DS    0C                                                       49620002
         DC    C'OS  '                                                  49660002
         DC    C'DOS '                                                  49700002
         DC    C'VS 1'                                                  49740002
         DC    C'V370'                                                  49780002
         DC    C'VS 2'                                                  49820002
         DC    C'    '                                                  49860002
         DC    C'    '                                                  49900002
         DC    C'    '                                                  49940002
TWELVE   DC    H'12'                                                    50100002
NINER    DC    H'9'                                                     50190002
DECBYTES DC    D'0'               PACKED NUMERIC AREA                   50220002
WORK     EQU   DECBYTES                                        @XA19935 50230060
         EJECT                                                 @XA19935 50250060
ENTRIES  DS    0F                                                       50400002
         DC    XL4'00'            FORMAT 1                              50460002
         DC    XL4'00'            FORMAT 2                              50520002
         DC    A(LABLES)          LABEL POINTER                         50580002
         DC    H'0'               DISP                                  50640002
         LINE ,(10,55)                                                  50820002
         ROUTINE SWITCHES,TYPEREC                                       50880002
         LABEL ''                                                       50940002
* THIS IS THE FULL OBR PRINTOUT FOR PERMANENT ERRORS                  * 54360002
LONGENT1 DC    X'01'                                                    54420002
         DC    X'000B8B01'                                     @XA19935 54480060
LONGLAB1 LABEL ''                                                       54540002
         LINE  (109,1),(1,76),SKIP=0                                    54660002
         ROUTINE SYSREL,CONVREL                                         54750002
         LABEL '--- RECORD ENTRY SOURCE - OBR          TYPE -OUTBOARD  C54840002
                   MODEL-','SERIAL NO.            XXXX REL.'            54900002
         LINE  (67,21),,SKIP=2                                          54910002
         HEX   CPUID,0,2B                                               54920002
         HEX   CPUSER,0,3B                                              54930002
         LABEL ''                                                       54940002
         LINE       (67,21),(2,12),SKIP=1                               55140002
         LABEL 'DEVICE','PRIMARY','SECONDARY','PROGRAM',               C55320002
               'VOLUME','MODE','DATE','TIME'                            55380002
         LINE  ,(2,12)                                                  55440002
         LABEL 'TYPE','CUA','CUA','IDENTITY',                          C55560002
               'SERIAL','SET','DAY YR','HH MM SS.TH'                    55620002
         LINE  (14,12),(1,),SKIP=2                                      55680002
         HEX   PRIMCUA,0,3B                                             55740002
         HEX   SECONCUA,0,3B                                            55800002
         ROUTINE JOBID,JOBNAME                                          55860002
         ROUTINE VOLID,VOLNAME                                          55920002
         HEX   MODESET,0,1B                                             55980002
         ROUTINE YEAR,SETDATE                                           56040002
         HEX   TIME,1,4B                                                56100002
          LABEL ' 3410'                                                 56160002
         LINE  ,(14,50),SKIP=1                                          56220002
         LABEL 'CC   DA    FL     CT','K    CA    US CS  CT'            56340002
         LINE  (14,3),(1,57),SKIP=2                            @XA19935 56400060
         HEX   COMMCODE,0,1B                                   @XA19935 56460060
         HEX   DATAADDR,0,3B                                   @XA19935 56560060
         ROUTINE SPARES,SPACE2                                 @XA19935 56660060
         HEX   FLAGS,0,1B                                      @XA19935 56760060
         HEX   RESERVED,0,1B                                   @XA19935 56860060
         HEX   CCWCOUNT,0,2B                                   @XA19935 56960060
         ROUTINE SPARES,ADD27                                  @XA19935 57060060
         HEX   CSWKEY,0,1B                                     @XA19935 57160060
         HEX   COMMADDR,0,3B                                   @XA19935 57260060
         ROUTINE SPARES,SPACE2B                                @XA19935 57360060
         HEX   ATTENBIT,0,1B                                   @XA19935 57460060
         HEX   CHSTAT,0,1B                                     @XA19935 57560060
         HEX   CSWCOUNT,0,2B                                   @XA19935 57660060
         LABEL 'FAILING CCW','CSW'                                      58020002
         LINE  (15,17),(1,17),SKIP=2                                    58080002
         LABEL 'UNIT STATUS','BYTE 0','BYTE 1','BYTE 2','BYTE 3',      C58200002
               'BYTE 4','BYTE 5'                                        58260002
         LINE   ,,SKIP=1                                                58320002
         BIN   ATTEN                                                    58380002
         BIN   SNB000                                                   58440002
         BIN   SNB010                                                   58500002
         BIN   SNB020                                                   58560002
         BIN   SNB030                                                   58620002
         BIN   SNB040                                                   58680002
         BIN   SNB050                                                   58740002
         LABEL 'ATTENTION','CMND REJECT','NOISE','TRK ERR 0',          C58800002
               'VRC','TU POSN CHK','NEW SUBSY'                          58860002
         LINE                                                           58920002
         BIN   STATMOD                                                  58980002
         BIN   SNB001                                                   59040002
         BIN   SNB011                                                   59100002
         BIN   SNB021                                                   59160002
         BIN   SNB031                                                   59220002
         BIN   SNB041                                                   59280002
         BIN   SNB051                                                   59340002
         LABEL 'STATUS MODIF','INTV REQUIRED','TU STAT A',       XM1356C59400002
               'TRK ERR 1','MTE/LRCR','TU REJECT','NEW SUBSY'    XM1356 59460002
         LINE                                                           59520002
         BIN   CONTUEND                                                 59580002
         BIN   SNB002                                                   59640002
         BIN   SNB012                                                   59700002
         BIN   SNB022                                                   59760002
         BIN   SNB032                                                   59820002
         BIN   SNB042                                                   59880002
         BIN   SNB052                                                   59940002
         LABEL 'CONT UN END','BUS OUT CHK','TU STAT B','TRK ERR 2',    C60000002
               'SKEW','TAPE IND','WRT TM CHK'                    XM1356 60060002
         LINE                                                           60120002
         BIN   BUSY                                                     60180002
         BIN   SNB003                                                   60240002
         BIN   SNB013                                                   60300002
         BIN   SNB023                                                   60360002
         BIN   SNB033                                                   60420002
         BIN   SNB043                                                   60480002
         BIN   SNB053                                                   60540002
         LABEL 'BUSY','EQUIP CHK','7 TRACK','TRK ERR 3',         S99231C60600002
               'EDC/CRCR','RESERVED','PE ID BUR'                 S99231 60660002
         LINE                                                           60720002
         BIN   CHANEND                                                  60780002
         BIN   SNB004                                                   60840002
         BIN   SNB014                                                   60900002
         BIN   SNB024                                                   60960002
         BIN   SNB034                                                   61020002
         BIN   SNB044                                                   61080002
         BIN   SNB054                                                   61140002
         LABEL 'CHANNEL END','DATA CHECK','LOAD POINT','TRK ERR 4',    C61200002
               'ENV CHECK','RESERVED','P COMP'                   XM1356 61260002
         LINE                                                           61320002
         BIN   DEVEND                                                   61380002
         BIN   SNB005                                                   61440002
         BIN   SNB015                                                   61500002
         BIN   SNB025                                                   61560002
         BIN   SNB035                                                   61620002
         BIN   SNB045                                                   61680002
         BIN   SNB055                                                   61740002
         LABEL 'DEVICE END','OVERRUN','WRITE STA','TRK ERR 5',         C61800002
               '1600 BPI','DIAG TRK ERR','TACH CHK'                     61860002
         LINE                                                           61920002
         BIN   UNITCHK                                                  61980002
         BIN   SNB006                                                   62040002
         BIN   SNB016                                                   62100002
         BIN   SNB026                                                   62160002
         BIN   SNB036                                                   62220002
         BIN   SNB046                                                   62280002
         BIN   SNB056                                                   62340002
         LABEL 'UNIT CHECK','WRD COUNT','FL PROT','TRK ERR 6',         C62400002
               'BACKWARD','TU CHECK','FALSE END CHK'                    62460002
         LINE   ,,SKIP=2                                                62520002
         BIN   UNITEXEP                                                 62580002
         BIN   SNB007                                                   62640002
         BIN   SNB017                                                   62700002
         BIN   SNB027                                                   62760002
         BIN   SNB037                                                   62820002
         BIN   SNB047                                                   62880002
         BIN   SNB057                                                   62940002
         LABEL 'UNIT EXCEP','DT CNVTT','NOT CAPABLE',            S99231C63000002
               'TRK ERR 7','RESERVED','ILLEGAL CMND','RPQ'       S99231 63060002
         LINE                                                           63120002
         LABEL 'BYTE 6','BYTE 7','BYTE 8'                               63240002
         LINE   ,,SKIP=1                                                63300002
         BIN   SNB060                                                   63360002
         BIN   SNB070                                                   63420002
         BIN   SNB080                                                   63480002
         LABEL '7 TRACK','LAMP FAIL','RESERVED'                  S99231 63540002
         LINE                                                           63600002
         BIN   SNB061                                                   63660002
         BIN   SNB071                                                   63720002
         BIN   SNB081                                                   63780002
         LABEL 'SHORT GAP','LEFT COL CHK','FEED THRU'                   63840002
         LINE                                                           63900002
         BIN   SNB062                                                   63960002
         BIN   SNB072                                                   64020002
         BIN   SNB082                                                   64080002
         LABEL 'DUAL DEN','RHT COL CHK','RESERVED'                      64140002
         LINE                                                           64200002
         BIN   SNB063                                                   64260002
         BIN   SNB073                                                   64320002
         BIN   SNB083                                                   64380002
         LABEL 'ALT DEN','READY RES','END VEL CHK'               XM1356 64440002
         LINE  (32,17),(18,17)                                          64500002
         BIN   SNB074                                                   64560002
         BIN   SNB084                                                   64620002
         LABEL 'DSE','RDBK NOT DET'                              XM1356 64680002
         LINE  (15,17),(1,17)                                           64740002
         ROUTINE SNB060,MODEL                                           64800002
         BIN   SNB075                                                   64860002
         BIN   SNB085                                                   64920002
         LABEL 'MODEL','RESERVED','ST VEL CHK'                          64980002
         LINE  (32,17),(18,17)                                          65040002
         BIN   SNB076                                                   65100002
         BIN   SNB086                                                   65160002
         LABEL 'RESERVED','RESERVED'                                    65220002
         LINE  ,,SKIP=1                                                 65280002
         BIN   SNB077                                                   65340002
         BIN   SNB087                                                   65400002
SDRLAB1  LABEL 'RESERVED','RESERVED'                             XM1356 65460002
SDRENT1  LINE  ,(1,92),SKIP=2                                           65520002
         LABEL 'SDR AREA','DEVICE DEPENDENT INFORMATION'                65640002
         LINE  (15,23),(1,23),SKIP=1                                    65700002
         ROUTINE NOISE,ONEBYTE                                          65760002
         ROUTINE CCOMPARE,RGHTHALF                                      65820002
         ROUTINE EXP,RGHTHALF                                           65880002
         ROUTINE SPARES,DONOTHNG                                        65940002
         ROUTINE BLKLENG,TWOBYTES                                       66000002
         LABEL 'NOISE','RESERVED','END VEL CHK','',              XM1356C66060002
               'BLOCK LENGTH'                                    XM1356 66090002
         LINE                                                           66120002
         ROUTINE RWVRC,ONEBYTE                                          66180002
         ROUTINE WRTTMCHK,LEFTHALF                                      66240002
         ROUTINE EARLNDRD,LEFTHALF                                      66300002
         BIN   PEIDCHK,0                                                66360002
         ROUTINE TEMPRDS,ONEBYTE                                        66420002
         LABEL 'VRC','WRT TM CHK','RDBK NOT DET','PE ID CHK',    XM1356C66480002
               'TEMP RDS'                                               66540002
         LINE                                                           66600002
         ROUTINE MTELRCR,ONEBYTE                                        66660002
         ROUTINE WRTTMCHK,RGHTHALF                                      66720002
         ROUTINE EARLNDRD,RGHTHALF                                      66780002
         ROUTINE TEMPWRTS,DONOTHNG                                      66840002
         ROUTINE TEMPWRTS,ONEBYTE                                       66900002
         LABEL 'MTE/LRCR','P COMP','ST VEL CHK','','TEMP WRTS'   XM1356 66960002
         LINE  (15,1),(1,23)                                            67020002
         ROUTINE EDCCRC,ONEBYTE                                         67080002
         ROUTINE SPARES,ADD21                                           67140002
         ROUTINE PARTREC,LEFTHALF                                       67200002
         ROUTINE SPARES,ADD21                                           67260002
         ROUTINE SLWNDRD,LEFTHALF                                       67320002
         ROUTINE SPARES,ADD13                                           67380002
         ROUTINE SPARES,ADD5                                            67440002
         BIN   PARITY                                                   67500002
         ROUTINE TRKINERR,SETBINA                                       67560002
         ROUTINE SPARES,ADD21                                           67620002
         ROUTINE SPARES,DONOTHNG                                        67680002
         ROUTINE SIOCNT,TWOBYTES                                        67740002
         LABEL 'EDC/CRCR','TACH CHK','RESERVED','TRK IN ERR',          C67800002
               'SIO COUNT'                                              67860002
         LINE  (15,23),(1,23)                                           67920002
         ROUTINE ENVCKVRC,ONEBYTE                                       67980002
         ROUTINE PARTREC,RGHTHALF                                       68040002
         ROUTINE SLWNDRD,RGHTHALF                                       68100002
         ROUTINE ERASEGPS,DONOTHNG                                      68160002
         ROUTINE ERASEGPS,TWOBYTES                                      68220002
         LABEL 'ENV CHECK','FALSE END CHK','RESERVED','',        XM1356C68280002
               'ERASE GAPS'                                      XM1356 68310002
         LINE                                                           68340002
         ROUTINE OVERRUN,LEFTHALF                                       68400002
         ROUTINE ORDROP,LEFTHALF                                        68460002
         ROUTINE EXP2,RGHTHALF                                          68520002
         ROUTINE BACKWARD,ONEBYTE                                       68580002
         ROUTINE CLNRACTS,TWOBYTES                                      68640002
         LABEL 'OVERRUN','RESERVED','RESERVED','BACKWARD',             C68700002
               'CLEAN ACTS'                                             68760002
         LINE                                                           68820002
         ROUTINE OVERRUN,RGHTHALF                                       68880002
         ROUTINE ORDROP,RGHTHALF                                        68940002
         ROUTINE EXP3A,LEFTHALF                                         69000002
         ROUTINE BUSOCHK,LEFTHALF                                       69060002
         LABEL 'SKEW','FEED THRU','RESERVED','BUS OUT CHK'              69120002
         LINE                                                           69180002
         ROUTINE CCOMPARE,LEFTHALF                                      69240002
         ROUTINE EXP,LEFTHALF                                           69300002
         ROUTINE EXP3A,RGHTHALF                                         69360002
         ROUTINE BUSOCHK,RGHTHALF                                       69420002
         LABEL 'RESERVED','RESERVED','RESERVED','TU POSN CHK'           69480002
LASTENT  LINE  ,(1,)                                                    69540002
         LABEL ' '                                                      69660002
         DC    X'FF'                                                    69720002
         DC    X'0075'                                         @XA19935 69780060
         DC    XL2'0018'                                                69840002
         DC    XL2'0000'                                                69900002
         EJECT                                                 @XA19935 69960060
* THIS IS THE FULL OBR PRINTOUT FOR PERMANENT ERRORS                  * 73740002
LONGENT2 DC    X'01'                                                    73800002
         DC    X'000B8B09'                                     @XA19935 73860060
LONGLAB2 LABEL ''                                                       73920002
         LINE  (109,1),(1,76),SKIP=0                                    74040002
         ROUTINE SYSREL,CONVREL                                         74130002
         LABEL '--- RECORD ENTRY SOURCE - OBR          TYPE -OUTBOARD  C74220002
                   MODEL-','SERIAL NO.            XXXX REL.'            74280002
         LINE  (67,21),,SKIP=2                                          74320002
         HEX   CPUID,0,2B                                               74360002
         HEX   CPUSER,0,3B                                              74400002
         LABEL ''                                                       74440002
         LINE       (67,21),(2,12),SKIP=1                               74520002
         LABEL 'DEVICE','TCU','TU','PRIMARY','SECONDARY','PROGRAM',    C74700002
               'VOLUME','MODE','DATE','TIME'                            74760002
         LINE  ,(2,12)                                                  74820002
         LABEL 'TYPE','SERIAL','SERIAL','CUA','CUA','IDENTITY',        C74940002
               'SERIAL','SET','DAY YR','HH MM SS.TH'                    75000002
         LINE  (14,12),(1,),SKIP=2                             @XA19935 75060060
         ROUTINE TCSERIAL,MOVESER                              @XA19935 75120060
         ROUTINE SNB060,PUTMOD                                 @ZA01048 75300002
         HEX   PRIMCUA,0,3B                                             75360002
         HEX   SECONCUA,0,3B                                            75420002
         ROUTINE JOBID,JOBNAME                                          75480002
         ROUTINE VOLID,VOLNAME                                          75540002
         HEX   MODESET,0,1B                                             75600002
         ROUTINE YEAR,SETDATE                                           75660002
         HEX   TIME,1,4B                                                75720002
         LABEL ' 3420'                                                  75780002
         LINE  ,(14,50),SKIP=1                                          75840002
         LABEL 'CC   DA    FL     CT','K    CA    US CS  CT'            75960002
         LINE  (14,3),(1,57),SKIP=2                            @XA19935 76020060
         HEX   COMMCODE,0,1B                                   @XA19935 76080060
         HEX   DATAADDR,0,3B                                   @XA19935 76180060
         ROUTINE SPARES,SPACE2                                 @XA19935 76280060
         HEX   FLAGS,0,1B                                      @XA19935 76380060
         HEX   RESERVED,0,1B                                   @XA19935 76480060
         HEX   CCWCOUNT,0,2B                                   @XA19935 76580060
         ROUTINE SPARES,ADD27                                  @XA19935 76680060
         HEX   CSWKEY,0,1B                                     @XA19935 76780060
         HEX   COMMADDR,0,3B                                   @XA19935 76880060
         ROUTINE SPARES,SPACE2B                                @XA19935 76980060
         HEX   ATTENBIT,0,1B                                   @XA19935 77080060
         HEX   CHSTAT,0,1B                                     @XA19935 77180060
         HEX   CSWCOUNT,0,2B                                   @XA19935 77280060
         LABEL 'FAILING CCW','CSW'                                      77640002
         LINE  (15,17),(1,17),SKIP=2                                    77700002
         LABEL 'UNIT STATUS','BYTE 0','BYTE 1','BYTE 2','BYTE 3',      C77820002
               'BYTE 4','BYTE 5'                                        77880002
         LINE   ,,SKIP=1                                                77940002
         BIN   ATTEN                                                    78000002
         BIN   SNB000                                                   78060002
         BIN   SNB010                                                   78120002
         BIN   SNB020                                                   78180002
         BIN   SNB030                                                   78240002
         BIN   SNB040                                                   78300002
         BIN   SNB050                                                   78360002
         LABEL 'ATTENTION','CMND REJECT','NOISE','TRK ERR 0',          C78420002
               'R/W VRC','ALU CK/MP ERR','NEW SUBSY'             S99223 78480002
         LINE                                                           78540002
         BIN   STATMOD                                                  78600002
         BIN   SNB001                                                   78660002
         BIN   SNB011                                                   78720002
         BIN   SNB021                                                   78780002
         BIN   SNB031                                                   78840002
         BIN   SNB041                                                   78900002
         BIN   SNB051                                                   78960002
         LABEL 'STATUS MODIF','INTV REQUIRED','TU STAT A',       S99223C79020002
               'TRK ERR 1','MTE/LRCR','REJECT TU','NEW SUBSY'    S99223 79080002
         LINE                                                           79140002
         BIN   CONTUEND                                                 79200002
         BIN   SNB002                                                   79260002
         BIN   SNB012                                                   79320002
         BIN   SNB022                                                   79380002
         BIN   SNB032                                                   79440002
         BIN   SNB042                                                   79500002
         BIN   SNB052                                                   79560002
         LABEL 'CONT UN END','BUS OUT CHK','TU STAT B','TRK ERR 2',    C79620002
               'SKEW','TAPE INDICATE','WRT TM CHK'               S99223 79680002
         LINE                                                           79740002
         BIN   BUSY                                                     79800002
         BIN   SNB003                                                   79860002
         BIN   SNB013                                                   79920002
         BIN   SNB023                                                   79980002
         BIN   SNB033                                                   80040002
         BIN   SNB043                                                   80100002
         BIN   SNB053                                                   80160002
         LABEL 'BUSY','EQUIP CHK','7 TRACK','TRK ERR 3','EDC/CRCR',    C80220002
               'WRT TR VRC','ID BURST CHK'                       S99223 80280002
         LINE                                                           80340002
         BIN   CHANEND                                                  80400002
         BIN   SNB004                                                   80460002
         BIN   SNB014                                                   80520002
         BIN   SNB024                                                   80580002
         BIN   SNB034                                                   80640002
         BIN   SNB044                                                   80700002
         BIN   SNB054                                                   80760002
         LABEL 'CHANNEL END','DATA CHECK','LOAD POINT','TRK ERR 4',    C80820002
               'ENV/ECC','U-PGM DET/RES','ST RD CHK'             S99223 80880002
         LINE                                                           80940002
         BIN   DEVEND                                                   81000002
         BIN   SNB005                                                   81060002
         BIN   SNB015                                                   81120002
         BIN   SNB025                                                   81180002
         BIN   SNB035                                                   81240002
         BIN   SNB045                                                   81300002
         BIN   SNB055                                                   81360002
         LABEL 'DEVICE END','OVERRUN','WRITE STATUS',            S99223C81420002
               'TRK ERR 5','1600 BPI TU','LOOP W/R',             S99223C81460002
               'PARTIAL REC'                                     S99223 81500002
         LINE                                                           81540002
         BIN   UNITCHK                                                  81600002
         BIN   SNB006                                                   81660002
         BIN   SNB016                                                   81720002
         BIN   SNB026                                                   81780002
         BIN   SNB036                                                   81840002
         BIN   SNB046                                                   81900002
         BIN   SNB056                                                   81960002
         LABEL 'UNIT CHECK','WORD COUNT','FILE PROTECT',         S99223C82020002
               'TRK ERR 6','BACKWARD','TU CHECK',                S99223C82060002
               'EXC POST OR TM'                                  S99223 82100002
         LINE   ,,SKIP=2                                                82140002
         BIN   UNITEXEP                                                 82200002
         BIN   SNB007                                                   82260002
         BIN   SNB017                                                   82320002
         BIN   SNB027                                                   82380002
         BIN   SNB037                                                   82440002
         BIN   SNB047                                                   82500002
         BIN   SNB057                                                   82560002
         LABEL 'UNIT EXCEP','DT CNVTT','NOT CAPABLE','TRK ERR 7',      C82620002
               'C/P COMPARE','RES FOR RPQ','RES FOR RPQ'         S99223 82680002
         LINE                                                           82740002
         LABEL 'BYTE 6','BYTE 7','BYTE 8','BYTE 9','BYTE 10','BYTE 11',C82860002
               'BYTE 12'                                                82920002
         LINE   ,,SKIP=1                                                82980002
         BIN   SNB060                                                   83040002
         BIN   SNB070                                                   83100002
         BIN   SNB080                                                   83160002
         BIN   SNB090                                                   83220002
         BIN   SNB100                                                   83280002
         BIN   SNB110                                                   83340002
         BIN   SNB120                                                   83400002
         LABEL '7 TRACK','LAMP FAIL','IBG DROP','6250 CORRECTN', S99223C83460002
               'CMD ST REJ','B BUS LSR/MP1','B BUS LSR/MP2'      S99223 83520002
         LINE                                                           83580002
         BIN   SNB061                                                   83640002
         BIN   SNB071                                                   83700002
         BIN   SNB081                                                   83760002
         BIN   SNB091                                                   83820002
         BIN   SNB101                                                   83880002
         BIN   SNB111                                                   83940002
         BIN   SNB121                                                   84000002
         LABEL 'WRT HD CR','TP BOTTOM LF','FEED THRU/RES',       S99223C84060002
               'VEL CHG','RESERVED','SPARE','SPARE'              S99223 84120002
         LINE                                                           84180002
         BIN   SNB062                                                   84240002
         BIN   SNB072                                                   84300002
         BIN   SNB082                                                   84360002
         BIN   SNB092                                                   84420002
         BIN   SNB102                                                   84480002
         BIN   SNB112                                                   84540002
         BIN   SNB122                                                   84600002
         LABEL 'DUAL DEN','TP BOTTOM RH','RESERVED','CBC',       S99223C84660002
               'CTL ST REJ','XFER/LOIC','XFER/LOIC'              S99223 84720002
         LINE                                                           84780002
         BIN   SNB063                                                   84840002
         BIN   SNB073                                                   84900002
         BIN   SNB083                                                   84960002
         BIN   SNB093                                                   85020002
         BIN   SNB103                                                   85080002
         BIN   SNB113                                                   85140002
         BIN   SNB123                                                   85200002
         LABEL 'NOT 1600','RES-DOOR','EARLY BOR','CRC III',      S99223C85260002
               'NO BOR/WTM','INST/HIIC','INST/HIIC'              S99223 85320002
         LINE  (32,17),(18,17)                                          85380002
         BIN   SNB074                                                   85440002
         BIN   SNB084                                                   85500002
         BIN   SNB094                                                   85560002
         BIN   SNB104                                                   85620002
         BIN   SNB114                                                   85680002
         BIN   SNB124                                                   85740002
         LABEL 'DSE','E END/SAGC CK','RLC/3803-2',               S99223C85800002
               'WTM/DRC','U-PGM ERR','U-PGM ERR'                 S99223 85860002
         LINE  (15,17),(1,17)                                           85920002
         ROUTINE SNB060,MODEL                                           85980002
         BIN   SNB075                                                   86040002
         BIN   SNB085                                                   86100002
         BIN   SNB095                                                   86160002
         BIN   SNB105                                                   86220002
         BIN   SNB115                                                   86280002
         BIN   SNB125                                                   86340002
         LABEL 'MODEL','ERASE HD','SLOW BOR','RESERVED','TACH FAIL',   C86400002
               'D BUS PTY','D BUS PTY'                                  86460002
         LINE  (32,17),(18,17)                                          86520002
         BIN   SNB076                                                   86580002
         BIN   SNB086                                                   86640002
         BIN   SNB096                                                   86700002
         BIN   SNB106                                                   86760002
         BIN   SNB116                                                   86820002
         BIN   SNB126                                                   86880002
         LABEL 'AIR PRES','SLOW END','RESERVED','RESERVED','RESERVED', C86940002
               'RESERVED'                                               87000002
         LINE  ,,SKIP=2                                                 87060002
         BIN   SNB077                                                   87120002
         BIN   SNB087                                                   87180002
         BIN   SNB097                                                   87240002
         BIN   SNB107                                                   87300002
         BIN   SNB117                                                   87360002
         BIN   SNB127                                                   87420002
         LABEL 'LOAD FAIL','VEL RETRY','CNTL UNIT RES','VEL CHK',      C87480002
               'BOC ALU1/MP1','BOC ALU2/MP2'                     S99223 87540002
         LINE  ,(1,17)                                                  87600002
         LABEL 'BYTE 17','BYTE 18','BYTE 19','BYTE 20','BYTE 21',      C87720002
               'BYTE 22','BYTE 23'                                      87780002
         LINE  (15,17),(1,17),SKIP=1                                    87840002
         BIN   SNB170                                                   87900002
         BIN   SNB180                                                   87960002
         BIN   SNB190                                                   88020002
         BIN   SNB200                                                   88080002
         BIN   SNB210                                                   88140002
         HEX   SNB22,0,1B                                               88200002
         HEX   SNB23,0,1B                                               88260002
         LABEL '2 CHN SW(MIS)','PWRCHK/AIRFLW','DE DR 7','DE DR F',    C88320002
               'LD BUTTON','FRU ALU 1','FRU ALU 2'                      88380002
         LINE                                                           88440002
         BIN   SNB171                                                   88500002
         BIN   SNB181                                                   88560002
         BIN   SNB191                                                   88620002
         BIN   SNB201                                                   88680002
         BIN   SNB211                                                   88740002
         LABEL 'FEATURE','RESERVED','DE DR 6','DE DR E','LFT REEL'      88800002
         LINE                                                           88860002
         BIN   SNB172                                                   88920002
         BIN   SNB182                                                   88980002
         BIN   SNB192                                                   89040002
         BIN   SNB202                                                   89100002
         BIN   SNB212                                                   89160002
         LABEL 'FEATURE','RESERVED','DE DR 5','DE DR D','RHT REEL'      89220002
         LINE                                                           89280002
         BIN   SNB173                                                   89340002
         BIN   SNB183                                                   89400002
         BIN   SNB193                                                   89460002
         BIN   SNB203                                                   89520002
         BIN   SNB213                                                   89580002
         LABEL 'FEATURE','RESERVED','DE DR 4','DE DR C','TAPE PRES'     89640002
         LINE                                                           89700002
         BIN   SNB174                                                   89760002
         BIN   SNB184                                                   89820002
         BIN   SNB194                                                   89880002
         BIN   SNB204                                                   89940002
         BIN   SNB214                                                   90000002
         LABEL 'EC OF CU','EC OF DRV','DE DR 3','DE DR B','REELS LDD'   90060002
         LINE                                                           90120002
         BIN   SNB175                                                   90180002
         BIN   SNB185                                                   90240002
         BIN   SNB195                                                   90300002
         BIN   SNB205                                                   90360002
         BIN   SNB215                                                   90420002
         LABEL 'EC OF CU','EC OF DRV','DE DR 2','DE DR A','LD RWD'      90480002
         LINE                                                           90540002
         BIN   SNB176                                                   90600002
         BIN   SNB186                                                   90660002
         BIN   SNB196                                                   90720002
         BIN   SNB206                                                   90780002
         BIN   SNB216                                                   90840002
         LABEL 'EC OF CU','EC OF DRV','DE DR 1','DE DR 9','LD COMPL'    90900002
         LINE   ,,SKIP=2                                                90960002
         BIN   SNB177                                                   91020002
         BIN   SNB187                                                   91080002
         BIN   SNB197                                                   91140002
         BIN   SNB207                                                   91200002
         BIN   SNB217                                                   91260002
SDRLAB2  LABEL 'EC OF CU','EC OF DRV','DE DR 0','DE DR 8','LD CHK'      91320002
SDRENT2  LINE  ,(1,92),SKIP=2                                           91380002
         LABEL 'SDR AREA','DEVICE DEPENDENT INFORMATION'                91500002
         LINE  (15,23),(1,23),SKIP=1                                    91560002
         ROUTINE NOISE,ONEBYTE                                          91620002
         ROUTINE CCOMPARE,RGHTHALF                                      91680002
         ROUTINE EXP,RGHTHALF                                           91740002
         ROUTINE EXP3A,RGHTHALF                                  S99223 91800002
         ROUTINE BLKLENG,TWOBYTES                                       91860002
         LABEL 'NOISE','WRT TR VRC','EARLY BOR','CRC III',       S99223C91920002
               'BLOCK LENGTH'                                           91950002
         LINE                                                           91980002
         ROUTINE RWVRC,ONEBYTE                                          92040002
         ROUTINE WRTTMCHK,LEFTHALF                                      92100002
         ROUTINE EARLNDRD,LEFTHALF                                      92160002
         BIN   PEIDCHK,0                                                92220002
         ROUTINE TEMPRDS,ONEBYTE                                        92280002
         LABEL 'R/W VRC','WRT TM CHK','E END/SAGC CK',           S99223C92340002
               'ID BURST CHK','TEMP RDS'                         S99223 92400002
         LINE                                                           92460002
         ROUTINE MTELRCR,ONEBYTE                                        92520002
         ROUTINE WRTTMCHK,RGHTHALF                                      92580002
         ROUTINE EARLNDRD,RGHTHALF                                      92640002
         ROUTINE TEMPWRTS,DONOTHNG                                      92700002
         ROUTINE TEMPWRTS,ONEBYTE                                       92760002
         LABEL 'MTE/LRCR','ST RD CHK','SLOW BOR',' ','TEMP WRTS'        92820002
         LINE  (15,1),(1,23)                                            92880002
         ROUTINE EDCCRC,ONEBYTE                                         92940002
         ROUTINE SPARES,ADD21                                           93000002
         ROUTINE PARTREC,LEFTHALF                                       93060002
         ROUTINE SPARES,ADD21                                           93120002
         ROUTINE SLWNDRD,LEFTHALF                                       93180002
         ROUTINE SPARES,ADD13                                           93240002
         ROUTINE SPARES,ADD5                                            93300002
         BIN   PARITY                                                   93360002
         ROUTINE TRKINERR,SETBINA                                       93420002
         ROUTINE SPARES,ADD21                                           93480002
         ROUTINE SPARES,DONOTHNG                                        93540002
         ROUTINE SIOCNT,TWOBYTES                                        93600002
         LABEL 'EDC/CRCR','PARTIAL REC','SLOW END','TRK IN ERR',       C93660002
               'SIO COUNT'                                              93720002
         LINE  (15,23),(1,23)                                           93780002
         ROUTINE ENVCKVRC,ONEBYTE                                       93840002
         ROUTINE PARTREC,RGHTHALF                                       93900002
         ROUTINE SLWNDRD,RGHTHALF                                       93960002
         ROUTINE ERASEGPS,DONOTHNG                                      94020002
         ROUTINE ERASEGPS,TWOBYTES                                      94080002
         LABEL 'ENV/ECC','EXC POST OR TM','VEL RETRY',' ','ERASE GAPS'  94140002
         LINE                                                           94200002
         ROUTINE OVERRUN,LEFTHALF                                       94260002
         ROUTINE ORDROP,LEFTHALF                                        94320002
         ROUTINE EXP2,LEFTHALF                                          94380002
         ROUTINE BACKWARD,ONEBYTE                                       94440002
         ROUTINE CLNRACTS,TWOBYTES                                      94500002
         LABEL 'OVERRUN','IBG DROP','6250 CORRECTN','BACKWARD',  S99223C94560002
               'CLEAN ACTS'                                             94620002
         LINE                                                           94680002
         ROUTINE OVERRUN,RGHTHALF                                       94740002
         ROUTINE ORDROP,RGHTHALF                                        94800002
         ROUTINE EXP2,RGHTHALF                                   S99223 94860002
         ROUTINE BUSOCHK,LEFTHALF                                       94920002
         LABEL 'SKEW','FEED THRU/RES','VEL CHG','BUS OUT CHK'    S99223 94980002
         LINE                                                           95040002
         ROUTINE CCOMPARE,LEFTHALF                                      95100002
         ROUTINE EXP,LEFTHALF                                           95160002
         ROUTINE EXP3A,LEFTHALF                                         95220002
         ROUTINE BUSOCHK,RGHTHALF                                       95280002
         LABEL 'C/P COMPARE','RESERVED','CBC','ALU CK/MP ERR'    S99223 95340002
         LINE  ,(1,)                                           @XA19935 95400060
         LABEL ' '                                             @XA19935 95430060
         DC    X'FF'                                           @XA19935 95460060
         DC    XL2'0084'                                       @XA19935 95490060
         DC    XL2'0018'                                       @XA19935 95520060
         DC    XL2'0000'                                       @XA19935 95550060
EXIT     DC    X'FF'                                           @XA19935 95580060
         DC    XL2'0000'                                       @XA19935 95610060
         DC    XL2'0000'                                       @XA19935 95640060
         DC    XL2'0000'                                       @XA19935 95670060
LABLES   DS    0F                                                       95700002
         LSTART                                                         95760002
         END                                                            95820002
