         TITLE 'IFCE0145 MODEL  145 MACHINE CHECK EDIT'                 00060002
*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO          00120002
         SPACE 2                                                        00180002
         MACRO                                                          00240002
&NAME    DSGEN                                                          00300002
.*                            THIS MACRO GENERATES ONE DSECT WORD       00320002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 00340002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  00360002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    00380002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 00400002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   00420002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 00440002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      00460002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  00480002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    00500002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   00520002
         GBLC &ITEM(2000)                                               00540002
         GBLA &ITEMNBR,&BITS(2000),&SHIFT(2000)                         00560002
         LCLB  &ONLY1,&CTIND                                            00580002
         LCLA  &START1,&START2,&END1,&END2                              00600002
         LCLC  &SYMBOL,&EQUSYM                                          00620002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 00640002
         ACTR  100000                                                   00660002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            00680002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     00700002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' AND '&SYSLIST(&OP+1,4)' EQ '').ERR1  00720002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   00740002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        00760002
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1            00780002
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT             00800002
         AGO   .SET2A                   BRANCH AROUND                   00820002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              00840002
         MEXIT                                                          00860002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X00880002
               ).SET2                   TEST FOR NO SECOND              00900002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   00920002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        00940002
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2            00960002
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2              00980002
         AGO   .LOOP                                                    01000002
.SET2    ANOP                                                           01020002
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 01040002
         AGO   .LOOP                                                    01060002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             01080002
         MEXIT                                                          01100002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               01120002
         MEXIT                                                          01140002
.LOOP    ANOP                                                           01160002
&OP      SETA  &OP+1                                                    01180002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           01200002
&ITEMNBR SETA  &ITEMNBR+1                                               01220002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            01240002
         MNOTE '**NULL BIT COUNT FIELD**'                               01260002
         MEXIT                                                          01280002
.OK1     ANOP                                                           01300002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        01320002
         AIF   ('&SYMBOL' NE '').OK                                     01340002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         01360002
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                         01380002
         AGO   .START                   GET NEXT                        01400002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        01420002
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU          01440002
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        01460002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         01480002
         AGO   .NO3                     BRANCH AROUND                   01500002
.OK2     ANOP                                                           01520002
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED              01540002
.NO3     ANOP                                                           01560002
&SYMBOL  EQU   *+&BYTE                                                  01580002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL             01600002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    01620002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    01640002
.CNT     ANOP                                                           01660002
&CTIND   SETB  1                        SET COUNT INDICATOR             01680002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   01700002
&BYTE    SETA  &COUNT/8                                                 01720002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        01740002
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        01760002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             01780002
&END1    SETA  &END1+1                  INCREMENT COUNT                 01800002
&OP      SETA  &OP-1                    DECREMENT INCREMENT             01820002
         AGO   .LOOP                    GENERATE NEXT                   01840002
.TSTST   ANOP                                                           01860002
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END               01880002
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        01900002
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      01920002
.NSET1   ANOP                                                           01940002
&OP      SETA  &OP-1                    DECREMENT INDEX                 01960002
&START1  SETA  &START1+1                INCREMENT FIRST COUNT           01980002
         AGO   .LOOP                    GO DO NEXT                      02000002
.LPDONE  ANOP                                                           02020002
&ONLY1   SETB  0                        CLEAR INDICATOR                 02040002
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      02060002
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 02080002
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT               02100002
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES             02120002
&NAME    DS    &COUNT.C                                                 02140002
.END     MEXIT                                                          02160002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          02180002
         MEXIT                                                          02200002
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   02220002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   02240002
         MEXIT                                                          02260002
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         02280002
*****               THE FOLLOWING STATEMENT                *****        02300002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        02320002
.EQU2    ANOP                                                           02340002
&EQUCNT  SETA  0                        CLEAR COUNTER                   02360002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND                 02380002
.EQULOP  ANOP                                                           02400002
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX                 02420002
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     02440002
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?                02460002
         AGO   .EQULOP                  NO-GET NEXT                     02480002
.EQUOUT  ANOP                                                           02500002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME                  02520002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS              02540002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT                 02560002
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED             02580002
         AGO   .START                   RETURN FOR NEXT                 02600002
         MEND                                                           02620002
*                                                                       03120002
*                                                                       03180002
         MACRO                                                          03240002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      03300002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     03360002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    03420002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 03480002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    03540002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    03600002
.*                                 THE PREVIOUS LINE AND STORES THAT #  03660002
.*                                 INTO THE APPROPRIATE BYTE.           03720002
.*                                                                      03780002
.*                                 &DATA(1) - CHARACTER POSITION TO     03840002
.*                                 BEGIN DATA.                          03900002
.*                                                                      03960002
.*                                 &DATA(2) - # OF SPACES BETWEEN       04020002
.*                                 SUCCESSIVE DATA COLUMN STARTING      04080002
.*                                 CHARACTERS.                          04140002
.*                                                                      04200002
.*                                 &LABEL(1) - CHARACTER POSITION       04260002
.*                                 TO BEGIN LABELS.                     04320002
.*                                                                      04380002
.*                                 &LABEL(2) - # OF SPACES BETWEEN      04440002
.*                                 LINE'S LABEL STARTING CHARACTERS.    04500002
.*                                                                      04560002
.*                                 &SKIP= - # OF LINES TO ADVANCE       04620002
.*                                 CARRIAGE TO BEGIN NEXT PRINTED LINE. 04680002
.*                                                                      04740002
.*                                 NEW ENTRIES ARE GENERATED ONLY WHEN  04800002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   04860002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 04920002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   04980002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 05040002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    05100002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   05160002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   05220002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  05280002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   05340002
.*                                 THE SUBJECT LINE.                    05400002
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  05460002
         GBLA  &LASTCC,&INITIAL                                         05520002
         GBLC  &NRENTSX                                                 05580002
         GBLC  &CARRCON                                                 05640002
         GBLB  &TEST                                                    05700002
         LCLA  &S                                                       05760002
&NAME    DS    0C                                                       05820002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  05880002
         LINEND                                                         05940002
         AGO   .NTFIRST                                                 06000002
.FIRSTLN ANOP                                                           06060002
&NRENTSX SETC  'N&SYSNDX'                                               06120002
&INITIAL SETA  1                                                        06180002
N&SYSNDX EQU   *                                                        06240002
.NTFIRST ANOP                                                           06300002
         DC    AL1(0)                                                   06360002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               06420002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                06480002
&DB      SETA  &DATA(1)                                                 06540002
         AGO   .AA                                                      06600002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                06660002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 06720002
         AGO   .CC                                                      06780002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    06840002
         AIF   (&DATA(2) EQ &DT).BB                                     06900002
.CC      ANOP                                                           06960002
&DT      SETA  &DATA(2)                                                 07020002
.BB      DC    XL2'FFFE'                                                07080002
         DC    FL1'&DB'                                                 07140002
         DC    FL1'&DT'                                                 07200002
&NRENTS  SETA  &NRENTS+1                                                07260002
.NCDATA  ANOP                                                           07320002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              07380002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               07440002
&LB      SETA  &LABEL(1)                                                07500002
         AGO   .AAA                                                     07560002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              07620002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               07680002
         AGO   .CCC                                                     07740002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  07800002
         AIF   (&LABEL(2) EQ &LT).BBB                                   07860002
.CCC     ANOP                                                           07920002
&LT      SETA  &LABEL(2)                                                07980002
.BBB     DC    XL2'FFFF'                                                08040002
         DC    FL1'&LB'                                                 08100002
         DC    FL1'&LT'                                                 08160002
&NRENTS  SETA  &NRENTS+1                                                08220002
.NCLABEL ANOP                                                           08280002
         AIF   ('&SKIP' NE '').CONT                                     08340002
         AIF   (&TEST EQ 0).NOCHANG                                     08400002
&S       SETA  &LASTCC                                                  08460002
         AGO   .DEFAULT                                                 08520002
.CONT    ANOP                                                           08580002
         AIF   (&TEST EQ 0).AB                                          08640002
&S       SETA  &SKIP                                                    08700002
.DEFAULT ANOP                                                           08760002
         ORG   &CARRCON+3                                               08820002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 08880002
         ORG                                                            08940002
&LASTCC  SETA  &S                                                       09000002
&TEST    SETB  0                                                        09060002
         AGO   .DD                                                      09120002
.AB      AIF   (&SKIP EQ &LASTCC).NOCHANG                               09180002
A&SYSNDX DC    XL2'FFFB'                                                09240002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              09300002
         DC    FL1'9'                                                   09360002
&LASTCC  SETA  &SKIP                                                    09420002
&TEST    SETB  1                                                        09480002
&CARRCON SETC  'A&SYSNDX'                                               09540002
&NRENTS  SETA  &NRENTS+1                                                09600002
.DD      ANOP                                                           09660002
.NOCHANG ANOP                                                           09720002
         MEND                                                           09780002
*                                                                       09840002
*                                                                       09900002
*********************************************************************** 09960002
*                                                                       10020002
*                                                                       10080002
         MACRO                                                 @YL02021 10080602
         BIN   ,                                               @YL02021 10081202
.*                                 &SYSLIST(&OP,1) - NAME OF LOG ITEM   10081802
.*                                      RECORD DSECT           @YL02021 10082402
.*                                 $SYSLIST(&OP,2) - NBR OF SPACES      10083002
.*                                      TO SKIP ON MULTIPLE    @YL02021 10083602
.*                                      PRINT OR NBR OF SPACES @YL02021 10084202
.*                                      TO BACK UP FROM COLUMN FOR      10084802
.*                                      START OF PRINTING. THE LETTER   10085402
.*                                      B PRECEEDS THE NUMBER (B5) IF   10086002
.*                                      THE LATTER IS DESIRED. OMISSION 10086602
.*                                      OF THIS OPERAND FORCES OPTION 2 10087202
.*                                      WITH BACKUP SPACING EQUAL TO    10087802
.*                                 THE NUMBER OF BITS IN THE ITEM       10088402
.*                                 DEFINITION (VIA MACRO 'DSGEN').      10089002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     10089602
.*                                 TOTAL NUMBER OF BITS TO PRINT.       10090202
         GBLA  &INITIAL                                        @YL02021 10090802
         GBLB  &DIAGTST,&DIAGSET,&DIAGLIN                      @YL02021 10091402
         GBLC  &ITEM(2000),&DSECT                              @YL02021 10092002
         GBLA  &BITS(2000),&ITEMNBR,&SHIFT(2000),&NRENTS       @YL02021 10092602
         LCLB  &B,&SUB                                         @YL02021 10093202
         LCLA  &IBITS,&NDX,&ISHIFT,&K                          @YL02021 10093802
         LCLA  &TEMP,&T,&OP                                    @YL02021 10094402
         LCLC  &S                                              @YL02021 10095002
         ACTR  500000                                          @YL02021 10095602
         AIF   (&DIAGTST EQ 0).NOMSG                           @YL02021 10096202
         AIF   (&INITIAL EQ 0).NOMSG                           @YL02021 10096802
         AIF   (&DIAGLIN EQ 1).NOMSG                           @YL02021 10097402
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'         @YL02021 10098002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****            @YL02021 10098602
*        LINE                                                  @YL02021 10099202
         LINE                                                  @YL02021 10099802
.NOMSG   ANOP                                                  @YL02021 10100402
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP         @YL02021 10101002
&SUB     SETB  1                                               @YL02021 10101602
.LOOP    ANOP                                                  @YL02021 10102202
&OP      SETA  &OP+1                                           @YL02021 10102802
.LOOP1   ANOP                                                  @YL02021 10103402
&NDX     SETA  &NDX+1                                          @YL02021 10104002
         AIF   ('&ITEM(&NDX)' EQ '&SYSLIST(&OP,1)').FOUND      @YL02021 10104602
         AIF   (&NDX LT &ITEMNBR).LOOP1                        @YL02021 10105202
         MNOTE '**LOG ITEM NOT DEFINED**'                      @YL02021 10105802
         MEXIT                                                 @YL02021 10106402
.FOUND   ANOP                                                  @YL02021 10107002
&ISHIFT  SETA  &SHIFT(&NDX)                                    @YL02021 10107602
&IBITS   SETA  &BITS(&NDX)                                     @YL02021 10108202
         AIF   (&SUB EQ 1).SUB00                               @YL02021 10108802
         AIF   ('&SYSLIST(3)' EQ '').SETT                      @YL02021 10109402
&IBITS   SETA  &SYSLIST(3)                                     @YL02021 10110002
         AGO   .SETT                                           @YL02021 10110602
.SUB00   AIF   ('&SYSLIST(&OP,3)' EQ '').SETT                  @YL02021 10111202
&IBITS   SETA  &SYSLIST(&OP,3)                                 @YL02021 10111802
.SETT    ANOP                                                  @YL02021 10112402
&T       SETA  &IBITS-1                                        @YL02021 10113002
&B       SETB  0                                               @YL02021 10113602
         AIF   (&IBITS GT 0 AND &IBITS LT 16).SUB0             @YL02021 10114202
         MNOTE '**NO. OF BITS OUTSIDE RANGE OF 1-15**'         @YL02021 10114802
         MEXIT                                                 @YL02021 10115402
.SUB0    AIF   (&SUB EQ 1).SUBA                                @YL02021 10116002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                    @YL02021 10116602
&K       SETA  K'&SYSLIST(2)                                   @YL02021 10117202
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                     @YL02021 10117802
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                       @YL02021 10118402
         AGO   .SUBB                                           @YL02021 10119002
.SUBA    ANOP                                                  @YL02021 10119602
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                @YL02021 10120202
&K       SETA  K'&SYSLIST(&OP,2)                               @YL02021 10120802
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                 @YL02021 10121402
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                   @YL02021 10122002
.SUBB    ANOP                                                  @YL02021 10122602
&T       SETA  &S                                              @YL02021 10123202
.BACKUP  ANOP                                                  @YL02021 10123802
&NRENTS  SETA  &NRENTS+1                                       @YL02021 10124402
&TEMP    SETA  &ISHIFT                                         @YL02021 10125002
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                   @YL02021 10125602
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'       @YL02021 10126202
         AGO   .OUT                                            @YL02021 10126802
.BIN2    AIF   (&SUB EQ 1).BIN2A                               @YL02021 10127402
         AIF   ('&SYSLIST(2)' NE '').BIN3                      @YL02021 10128002
         AGO   .BIN2B                                          @YL02021 10128602
.BIN2A   AIF   ('&SYSLIST(&OP,2)' NE '').BIN3                  @YL02021 10129202
.BIN2B   ANOP                                                  @YL02021 10129802
&B       SETB  1                                               @YL02021 10130402
.BIN3    ANOP                                                  @YL02021 10131002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'           @YL02021 10131602
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'    @YL02021 10132202
.OUT     ANOP                                                  @YL02021 10132802
&NDX     SETA  0                                               @YL02021 10133402
         AIF   (&SUB EQ 0).OUTA                                @YL02021 10134002
         AIF   (&OP LT N'&SYSLIST).LOOP                        @YL02021 10134602
.OUTA    ANOP                                                  @YL02021 10135202
         MEND                                                  @YL02021 10135802
*                                                                       13200002
*                                                                       13260002
*********************************************************************** 13320002
*                                                                       13380002
*                                                                       13440002
         MACRO                                                          13500002
         HEX   &LOGITEM,&SKIP$OR,&BYTES                                 13560002
.*                                                                      13620002
.*                                 THIS MACRO FACILITATES GENERATION    13680002
.*                                 OF THE TABLE ENTRIES SPECIFYING HEX  13740002
.*                                 TYPE CONVERSIONS.                    13800002
.*                                                                      13860002
.*                                 &LOGITEM - NAME OF DATA ITEM TO BE   13920002
.*                                 CONVERTED.                           13980002
.*                                                                      14040002
.*                                 &SKIP$OR - NUMBER OF SPACES TO SKIP  14100002
.*                                 ON MULTIPLE PRINT OF NUMBER OF       14160002
.*                                 SPACES TO BACK UP FROM COLUMN FOR    14220002
.*                                 START OF PRINTING. THE LETTER B      14280002
.*                                 PRECEEDS THE NUMBER (B8) IF THE      14340002
.*                                 LATTER OPTION IS DESIRED. OMISSION   14400002
.*                                 OF THIS OPERAND FORCES OPTION 2 WITH 14460002
.*                                 BACKUP SPACING EQUAL TO THE NUMBER   14520002
.*                                 OF BYTES SPECIFIED BY THE NEXT       14580002
.*                                 OPERAND (TWICE THIS NUMBER IF SUFFIX 14640002
.*                                 IS EXPLICITLY OR IMPLICITLY B).      14700002
.*                                                                      14760002
.*                                 &BYTES - NUMBER OF TOTAL INPUT BYTES 14820002
.*                                 TO PROCESS. THIS NUMBER IS SUFFIXED  14880002
.*                                 WITH A L,R, OR B TO STIPULATE        14940002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     15000002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     15060002
.*                                 RESPECTIVELY. OMISSION OF THIS       15120002
.*                                 OPERAND DEFAULTS TO B WITH THE       15180002
.*                                 NUMBER OF BYTES EQUAL TO THE ITEM    15240002
.*                                 LENGTH.                              15300002
.*                                                                      15360002
.*                                 A NEW ENTRY IS GENERATED ONLY WHEN   15420002
.*                                 NECESSARY. THIS MACRO MUST BE THE    15480002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   15540002
.*                                 THE SUBJECT LINE(S)                  15600002
         GBLC  &ITEM(2000),&DSECT                                       15660002
         GBLA  &ITEMNBR,&BITS(2000),&SHIFT(2000),&NRENTS                15720002
         LCLB  &B                                                       15780002
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP                  15840002
         LCLC  &S,&LETTER                                               15900002
.LOOP    ANOP                                                           15960002
&NDX     SETA  &NDX+1                                                   16020002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      16080002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  16140002
         MNOTE '**LOG ITEM NOT FOUND**'                                 16200002
         MEXIT                                                          16260002
.FOUND   ANOP                                                           16320002
&ISHIFT  SETA  &SHIFT(&NDX)                                             16380002
&IBITS   SETA  &BITS(&NDX)                                              16440002
&CODE    SETA  1                                                        16500002
&K       SETA  K'&BYTES                                                 16560002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            16620002
         MNOTE 'BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL'     16680002
         MEXIT                                                          16740002
.OK      AIF   ('&BYTES' EQ '').USEDEFN                                 16800002
&LETTER  SETC  '&BYTES'(&K,1)                                           16860002
&S       SETC  '&BYTES'(1,&K-1)                                         16920002
&BYTESP  SETA  &S                                                       16980002
         AIF   ('&LETTER' EQ 'B').BOTH                                  17040002
         AIF   ('&LETTER' EQ 'L').LEFT                                  17100002
&CODE    SETA  2                                                        17160002
         AGO   .L                                                       17220002
.LEFT    ANOP                                                           17280002
&CODE    SETA  1                                                        17340002
         AGO   .L                                                       17400002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).OK2                       17460002
.ERR     MNOTE 'DATA NOT ALIGNED ON HEX OR BYTE BOUNDARY'               17520002
         MEXIT                                                          17580002
.USEDEFN ANOP                                                           17640002
&BYTESP  SETA  &IBITS/8                                                 17700002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       17760002
&CODE    SETA  3                                                        17820002
&T       SETA  &BYTESP*2-1                                              17880002
&S       SETC  '&T'                                                     17940002
.OK2     AIF   (&ISHIFT EQ 0).L                                         18000002
&CODE    SETA  2                                                        18060002
.L       ANOP                                                           18120002
&B       SETB  1                                                        18180002
         AIF   ('&SKIP$OR' EQ '').BACKUP                                18240002
&K       SETA  K'&SKIP$OR                                               18300002
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 18360002
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   18420002
.BACKUP  ANOP                                                           18480002
&NRENTS  SETA  &NRENTS+1                                                18540002
         DC    AL.12(&LOGITEM-&DSECT),XL.4'A'                           18600002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'              18660002
.OUT     ANOP                                                           18720002
         MEND                                                           18780002
*                                                                       18840002
*                                                                       18900002
*********************************************************************** 18960002
*                                                                       19020002
*                                                                       19080002
         MACRO                                                          19140002
&NAME    ROUTINE  &LOGITEM,&RNAME                                       19200002
         GBLC  &ITEM(2000)                                              19260002
         GBLA  &SHIFT(2000),&ITEMNBR                                    19320002
         GBLC  &DSECT,&CSECT                                            19380002
         GBLA  &NRENTS                                                  19440002
         LCLA  &ISHIFT,&NDX                                             19500002
.LOOP    ANOP                                                           19560002
&NDX     SETA  &NDX+1                                                   19620002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      19680002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  19740002
         MNOTE 'LOG ITEM NOT DEFINED'                                   19800002
         MEXIT                                                          19860002
.FOUND   ANOP                                                           19920002
&ISHIFT  SETA  &SHIFT(&NDX)                                             19980002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           20040002
         DC    AL.4(&ISHIFT),AL.12(&RNAME-&CSECT)                       20100002
&NRENTS  SETA  &NRENTS+1                                                20160002
         MEND                                                           20220002
*                                                                       20280002
*                                                                       20340002
*********************************************************************** 20400002
*                                                                       20460002
*                                                                       20520002
         MACRO                                                          20580002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C20640002
               &LABEL7,&LABEL8                                          20700002
.*                            THIS MACRO ALLOWS UP TO ACHT LABELS TO    20760002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   20820002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  20880002
.*                                 TION MARKS. THE COLUMN AND LINE END  20940002
.*                                 CONTROLS WILL BE INSERTED BY THE     21000002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      21060002
.*                                 LABEL REQUIRED FOR RESPECTIVE        21120002
.*                                 COLUMN. THIS MACRO WILL ALSO ALERT   21180002
.*                                 THE PROGRAMMER TO EXACTLY WHERE THE  21240002
.*                                 TABLE MUST BE BROKEN IF NECESSARY    21300002
.*                                 TO AVOID EXCEEDING THE MAXIMUM LIMIT 21360002
         GBLC &LABELS(2000)                                             21420002
         GBLC  &LBL(100)                                                21480002
         GBLA  &LBLCTR(100)                                             21540002
         GBLA  &LABELNR                                                 21600002
         GBLA  &NRENTS,&LPTR                                            21660002
         LCLC  &MARGIN,&TACK                                            21720002
         LCLC  &TEXT                                                    21780002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            21840002
&MARGIN  SETC  '*'                                                      21900002
         AIF   ('&NAME' EQ '').LOOPOUT                                  21960002
&LPTR    SETA  &LPTR+1                                                  22020002
&LBL(&LPTR) SETC '&NAME'                                                22080002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          22140002
.LOOPOUT ANOP                                                           22200002
&OP      SETA  &OP+1                                                    22260002
&K       SETA  K'&SYSLIST(&OP)                                          22320002
         AIF (&K GE 2).NORM                                             22380002
&K       SETA  2                                                        22440002
.NORM    ANOP                                                           22500002
&START   SETA  2                                                        22560002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                22620002
&MARGIN  SETC  '$'                                                      22680002
.NOTLAST ANOP                                                           22740002
&NRCHAR  SETA  8                                                        22800002
&TACK    SETC  ''                                                       22860002
.LOOPIN  ANOP                                                           22920002
&REMAIN  SETA  &K-&START                                                22980002
         AIF (&REMAIN GE 8).MORE                                        23040002
&TACK    SETC  '&MARGIN'                                                23100002
&NRCHAR  SETA  &REMAIN                                                  23160002
.MORE    ANOP                                                           23220002
&TEXT    SETC  ''                                                       23280002
         AIF (&REMAIN EQ 0).ENDTEXT                                     23340002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          23400002
.ENDTEXT ANOP                                                           23460002
&LABELNR SETA  &LABELNR+1                                               23520002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  23580002
&START   SETA  &START+8                                                 23640002
         AIF ('&TACK' EQ '').LOOPIN                                     23700002
         AIF ('&TACK' EQ '*').LOOPOUT                                   23760002
         MEND                                                           23820002
         SPACE 2                                                        23880002
         MACRO                                                          23940002
         LSTART                                                         24000002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  24060002
.*                                 OF THE TABLE IS TO BEGIN.            24120002
         GBLC &LABELS(2000)                                             24180002
         GBLA  &LABELNR                                                 24240002
         GBLC  &LBL(100)                                                24300002
         GBLA  &LBLCTR(100)                                             24360002
         LCLA  &NDX,&CTR                                                24420002
         LINEND                                                         24480002
&CTR     SETA  1                                                        24540002
.LOOP    ANOP                                                           24600002
&NDX     SETA  &NDX+1                                                   24660002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            24720002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         24780002
&CTR     SETA  &CTR+1                                                   24840002
         AGO   .LOOPCTL                                                 24900002
.NOLBL   ANOP                                                           24960002
         DC    C'&LABELS(&NDX)'                                         25020002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  25080002
         MEND                                                           25140002
*                                                                       25200002
*                                                                       25260002
*********************************************************************** 25320002
*                                                                       25380002
*                                                                       25440002
         MACRO                                                          25500002
         LINEND                                                         25560002
.*                                 THIS MACRO IS USED ONLY BY THE LINE  25620002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   25680002
.*                                 ASSOCIATED WITH EACH LINE.           25740002
         GBLA  &NRENTS                                                  25800002
         GBLC  &NRENTSX                                                 25860002
         ORG   &NRENTSX                                                 25920002
         DC    FL1'&NRENTS'                                             25980002
         ORG                                                            26040002
&NRENTS  SETA  0                                                        26100002
B&SYSNDX EQU   *                                                        26160002
&NRENTSX SETC  'B&SYSNDX'                                               26220002
         MEND                                                           26280002
*                                                                       26340002
*                                                                       26400002
*********************************************************************** 26460002
*                                                                       26520002
*                                                                       26580002
         MACRO                                                          26640002
&NAME    BIND  &Z1,&Z2,&Z3,&Z4                                          26700002
.*                                 THIS MACRO HELPS COLLOCATE BITS IN   26760002
.*                                 DIFFERENT AREAS OF THE LOG TO MAKE   26820002
.*                                 THEM ACCESSIBLE TO THE 'HEX' MACRO.  26880002
.*                                 EACH OPERAND HAS 3 SUBFIELDS:1 SPE-  26940002
.*                                 CIFIES BY LOGITEM NAME THE BYTE TO   27000002
.*                                 BE REFERENCED,2 GIVES THE NUMBER OF  27060002
.*                                 UNDESIRED BITS TO THE LEFT OF THE    27120002
.*                                 LOG ITEM'S FIRST BIT,3 GIVES THE LOG 27180002
.*                                ITEM'S LENGTH IN BITS. THE MACRO      27240002
.*                                CAUSES THE INFORMATION TO BE STORED & 27300002
.*                                CONTROL IS GIVEN TO THE 'BINDER' ROU- 27360002
.*                                TINE,WHICH STORES THE COLLOCATED      27420002
.*                                BITS RIGHT-JUSTIFIED IN THE FOUR-     27480002
.*                                BYTE WORK AREA INSERTED IN THE LOG,   27540002
.*                                BEGINNING AT 'LOGWORK1'               27600002
         GBLC      &DSECT                                               27660002
         LCLA  &OP                                                      27720002
&NAME    BC    15,BINDER                                                27780002
.LOOP    ANOP                                                           27840002
&OP      SETA  &OP+1                                                    27900002
         DC    AL.16(&SYSLIST(&OP,1)-&DSECT)                            27960002
         DC    FL1'&SYSLIST(&OP,2)'                                     28020002
         DC    FL1'&SYSLIST(&OP,3)'                                     28080002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 28140002
         ORG   &NAME+4                                                  28200002
         DC    AL.4(&OP),AL.12(&SYSLIST(1,1)-&DSECT)                    28260002
         ORG                                                            28320002
         MEND                                                           28380002
         MACRO                                                          28440002
&NAME    CKPARITY  &PAR1,&PAR2,&PAR3,&PAR4,&PAR5,&PAR6                  28500002
.*                                THIS MACRO HELPS SET THE LOCATION     28560002
.*                                CONTROLS FOR A SPECIAL ROUTINE TO     28620002
.*                                CHECK PARITY ON ITEMS FROM THE LOG    28680002
.*                                ALREADY ASSEMBLED FOR PRINTING IN THE 28740002
.*                                PRINT BUFFER THAT HAS BEEN SET UP.    28800002
.*                                EACH OPERAND (UP TO SIX) HAS THREE    28860002
.*                                SUBFIELDS:1 GIVES THE DISPLACEMENT    28920002
.*                                FROM PRINT POSITION ZERO TO BEGIN     28980002
.*                                THE PARITY CHECK(I.E.,LOC. OF PARITY  29040002
.*                                BIT IN BUFFER);2 GIVES THE NUMBER OF  29100002
.*                                POSITIONS TO CHECK AGAINST THE PARITY 29160002
.*                                BIT (ASSUMING 1 SPACE BETWEEN PAR BIT 29220002
.*                                AND THE FIRST POSITION TO BE CHECKED) 29280002
.*                                3 GIVES THE NUMBER OF SEQUENTIAL PAR. 29340002
.*                                CHECKS OF THIS SORT TO MAKE,ASSUMING  29400002
.*                                TWO SPACES BETWEEN THE LAST POSITION  29460002
.*                                CHECKED AND NEXT PAR. BIT POSITION    29520002
         LCLA  &OP                                                      29580002
&NAME    BC    15,PARPUT                                                29640002
         DC    X'0'                                                     29700002
.LOOP    ANOP                                                           29760002
&OP      SETA  &OP+1                                                    29820002
         DC    FL1'&SYSLIST(&OP,1)'                                     29880002
         DC    FL1'&SYSLIST(&OP,2)'                                     29940002
         DC    FL1'&SYSLIST(&OP,3)'                                     30000002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 30060002
         ORG   &NAME+4                                                  30120002
         DC    FL1'&OP'                                                 30180002
         ORG                                                            30240002
         MEND                                                           30300002
         GBLC  &DSECT,&CSECT                                            30360002
IFCE0145 CSECT                                                          30420002
&CSECT   SETC  'IFCE0145'                                               30480002
&DSECT   SETC  'DSECT145'                                               30540002
DSECT145 DSECT                                                          30600002
         DS    0F                                                       30660002
         DSGEN (XKEY,8),(XRELN,8),(XSWS0,8),(XSWS8,1),(XSWS9,1),       C30720002
               (XSWS10,1),(ERRORID,1),                                 X30780002
               (XSWS12,1),(XSWS13,1),(XSWS14,1),(XSWS15,1)              30840002
         DSGEN (,8),(LOGWORK2,6),(LOGWORK3,2),(LOGWRK3A,4),            X30900002
               (LOGWRK3B,3),(LOGWRK3C,1),(LOGWORK4,8)                   30960002
         DSGEN (XDATE,32)                                               31020002
         DSGEN (XTIME,32)                                               31080002
         DSGEN (XDUM2,8),(XSER,24)                                      31140002
         DSGEN (XCPUMOD,16),(XDUM3,16)                                  31200002
         DSGEN (XPGMID,64)                                              31260002
         ORG   XPGMID                                          @YL02021 31280002
         DSGEN (RECLNT,32),(WAITST,32)                         @YL02021 31300002
         DSGEN (XJOBID,64)                                              31320002
         ORG   XJOBID                                          @YL02021 31330002
         DSGEN (MCETEF,1,0,7),(MCEMEF,1,0,7),(MCEIEF,1,0,7),   @YL02021X31340002
               (MCESEF,1,0,7),(PDAR0,1,0,7),(PDAR1,1,0,7),     @YL02021X31350002
               (PDAR2,1,0,7),(WDSIZE,8)                        @YL02021 31360002
         DSGEN (XMCKPSW,64)                                             31380002
         DSGEN (MCIC,1,0,47),(EXTDLOG,16)                               31440002
         DSGEN (RESRVDB,64)                                             31920002
         DSGEN (FAILSTA,32)                                             31980002
         DSGEN (CTRLWD,16),(ERCORCD,8),(RGCODE,1,24,31)                 32040002
         DSGEN (DUMMY1,32)                                              32100002
         DSGEN (MCAR,32)                                                32160002
         DSGEN (MCDR1,32)                                               32220002
         DSGEN (MCDR2,32)                                               32280002
         DSGEN (MANTLTH1,32)                                            32340002
         DSGEN (MANTLTH2,32)                                            32400002
         DSGEN (MCRR1,32)                                               32460002
         DSGEN (MCRR2,32)                                               32520002
         DSGEN (ICM90,32)                                               32580002
         DSGEN (STATUS,32)                                              32640002
         DSGEN (FDUM1,32)                                               32700002
         DSGEN (FDUM2,32)                                               32760002
         DSGEN (FDUM3,32)                                               32820002
         DSGEN (FDUM4,32)                                               32880002
         DSGEN (FDUM5,32)                                               32940002
         DSGEN (FDUM6,32)                                               33000002
         DSGEN (FDUM7,32)                                               33060002
         DSGEN (FDUM8,32)                                               33120002
         DSGEN (FDUM9,32)                                               33180002
         DSGEN (FDUM10,32)                                              33240002
         DSGEN (FDUM11,32)                                              33300002
         DSGEN (FDUM12,32)                                              33360002
         DSGEN (FDUM13,32)                                              33420002
         DSGEN (FDUM14,32)                                              33480002
FLOATPTS DSGEN (FP0,32)                                                 33540002
         DSGEN (FP1,32)                                                 33600002
         DSGEN (FP2,32)                                                 33660002
         DSGEN (FP3,32)                                                 33720002
         DSGEN (FP4,32)                                                 33780002
         DSGEN (FP5,32)                                                 33840002
         DSGEN (FP6,32)                                                 33900002
         DSGEN (FP7,32)                                                 33960002
GENPURPR DSGEN (GPR0,32)                                                34020002
         DSGEN (GPR1,32)                                                34080002
         DSGEN (GPR2,32)                                                34140002
         DSGEN (GPR3,32)                                                34200002
         DSGEN (GPR4,32)                                                34260002
         DSGEN (GPR5,32)                                                34320002
         DSGEN (GPR6,32)                                                34380002
         DSGEN (GPR7,32)                                                34440002
         DSGEN (GPR8,32)                                                34500002
         DSGEN (GPR9,32)                                                34560002
         DSGEN (GP10,32)                                                34620002
         DSGEN (GP11,32)                                                34680002
         DSGEN (GP12,32)                                                34740002
         DSGEN (GP13,32)                                                34800002
         DSGEN (GP14,32)                                                34860002
         DSGEN (GP15,32)                                                34920002
         DSGEN (CTR0,32)                                                34980002
         DSGEN (CTR1,32)                                                35040002
         DSGEN (CTR2,32)                                                35100002
         DSGEN (CTR3,32)                                                35160002
         DSGEN (CTR4,32)                                                35220002
         DSGEN (CTR5,32)                                                35280002
         DSGEN (CTR6,32)                                                35340002
         DSGEN (CTR7,32)                                                35400002
         DSGEN (CTR8,32)                                                35460002
         DSGEN (CTR9,32)                                                35520002
         DSGEN (CR10,32)                                                35580002
         DSGEN (CR11,32)                                                35640002
         DSGEN (CR12,32)                                                35700002
         DSGEN (CR13,32)                                                35760002
         DSGEN (CR14,32)                                                35820002
         DSGEN (CR15,32)                                                35880002
         DSGEN (RETCNTUN,4),(RETCNT2H,4),(RETUNUS,16),(NONRETRY,8)      35940002
         DSGEN (MCHRG00,1),(MCHRG01,1),(MCHRG02,1),(MCHRG03,1),        X36000002
               (MCHRG04,1),(MCHRG05,1),(MCHRG06,1),(MCHRG07,1),        X36060002
               (MCHRG08,1),(MCHRG09,1),(MCHRG10,1),(MCHRG11,1),        X36120002
               (MCHRG12,1),(MCHRG13,1),(MCHRG14,1),(MCHRG15,1),        X36180002
               (MCHRG16,1),(MCHRG17,1),(MCHRG18,1),(MCHRG19,1),        X36240002
               (MCHRG20,1),(MCHRG21,1),(MCHRG22,1),(MCHRG23,1),        X36300002
               (MCHRG24,1),(MCHRG25,1),(MCHRG26,1),(MCHRG27,1),        X36360002
               (MCHRG28,1),(MCHRG29,1),(MCHRG30,1),(MCHRG31,1)          36420002
         DSGEN (MCHRGB00,1),(MCHRGB01,1),(MCHRGB02,1),(MCHRGB03,1),    X36480002
               (MCHRGB04,1),(MCHRGB05,1),(MCHRGB06,1),(MCHRGB07,1),    X36540002
               (MCHRGB08,1),(MCHRGB09,1),(MCHRGB10,1),(MCHRGB11,1),    X36600002
               (MCHRGB12,1),(MCHRGB13,1),(MCHRGB14,1),(MCHRGB15,1),    X36660002
               (MCHRGB16,1),(MCHRGB17,1),(MCHRGB18,1),(MCHRGB19,1),    X36720002
               (MCHRGB20,1),(MCHRGB21,1),(MCHRGB22,1),(MCHRGB23,1),    X36780002
               (MCHRGB24,1),(MCHRGB25,1),(MCHRGB26,1),(MCHRGB27,1),    X36840002
               (MCHRGB28,1),(MCHRGB29,1),(MCHRGB30,1),(MCHRGB31,1)      36900002
         DSGEN (RTYREG1,32),(RTYREG2,32)                                36960002
         DSGEN (REGUNU,8),                                             X37020002
               (HREG0,1),(HREG1,1),(HREG2,1),(HREG3,1),(HREG4,1),      X37080002
               (HREG5,1),(HREG6,1),(HREG7,1),(RETRG23,16)               37140002
         DSGEN (RTYRG400,1),(RTYRG401,1),(RTYRG402,1),(RTYRG403,1),    X37200002
               (RTYRG404,1),(RTYRG405,1),(RTYRG406,1),(RTYRG407,1),    X37260002
               (RTYRG408,1),(RTYRG409,1),(RTYRG410,1),(RTYRG411,1),    X37320002
               (RTYRG412,1),(RTYRG413,1),(RTYRG414,1),(RTYRG415,1),    X37380002
               (RTRUNSED,1),(RTYRG417,3),(RTYRG420,3),(RTYEXP,1),      C37440002
               (RTYUNSD,1),                                            C37470002
               (RTYRG425,3),(RTYRG428,3),(RTYNOTUS,1)                   37500002
         DSGEN (CTRLDWD,32)                                             37560002
         DSGEN (SYSREG00,1),(SYSREG01,1),(SYSREG02,1),(SYSREG03,1),    X37620002
               (SYSREG04,1),(SYSREG05,1),(SYSREG06,1),(SYSREG07,1),    X37680002
               (SYSREG08,1),(SYSREG09,1),(SYSREG10,1),(SYSREG11,1),    X37740002
               (SYSREG12,1),(SYSREG13,1),(SYSREG14,1),(SYSREG15,1),    X37800002
               (SYSREG16,1),(SYSREG17,1),(SYSREG18,1),(SYSREG19,1),    X37860002
               (SYSREG20,1),(SYSREG21,1),(SYSREG22,1),(SYSREG23,1),    X37920002
               (SYSREG24,1),(SYSREG25,1),(SYSREG26,1),(SYSREG27,1),    X37980002
               (SYSREG28,1),(SYSREG29,1),(SYSREG30,1),(SYSREG31,1)      38040002
         DSGEN (IREG,8),(IREGB,24)                                      38100002
         DSGEN (UREGA1,2),(UREGA2,2),(UREGA3,4),(UREGA4,4),(UREGA5,4), X38160002
               (UREGC1,8),(UREGC2,8)                                    38220002
         DSGEN (WREG,32)                                                38280002
         DSGEN (VREG,32)                                                38340002
         DSGEN (XREG,32)                                                38400002
         DSGEN (RREG,32)                                                38460002
         DSGEN (YREG,32)                                                38520002
         DSGEN (QREG,32)                                                38580002
         DSGEN (IBUG,32)                                                38640002
         DSGEN (TRRG,32)                                                38700002
         DSGEN (SPAR,32)                                                38760002
         DSGEN (SNRG,8),(SNRA,8),(SNRB,16)                              38820002
         DSGEN (PNRG,16),(RLPAGE,16)                                    38880002
         DSGEN (WKRG,32)                                                38940002
         DSGEN (NPRGXST,16),                                           X39000002
               (EXPDST00,1),(EXPDST01,1),(EXPDST02,1),(EXPDST03,1),    X39060002
               (EXPDST04,1),(EXPDST05,1),(EXPDST06,1),(EXPDST07,1),    X39120002
               (EXPDST08,1),(EXPDST09,1),(EXPDST10,1),(EXPDST11,1),    X39180002
               (EXPDST12,1),(EXPDST13,1),(EXPDST14,1),(EXPDST15,1)      39240002
         DSGEN (DMREG,32),(RWREG,32)                                    39300002
         DSGEN (CPUREG00,1),(CPUREG01,1),(CPUREG02,1),(CPUREG03,1),    X39360002
               (CPUREG04,1),(CPUREG05,1),(CPUREG06,1),(CPUREG07,1),    X39420002
               (CPUREG16,8),(NEWRELTB,8),(OLDRELTB,8)                   39480002
         DSGEN (PSWCTL00,1),(PSWCTL01,1),(PSWCTL02,1),(PSWCTL03,1),    X39540002
               (PSWCTL04,1),(PSWCTL05,1),(PSWCTL06,1),(PSWCTL07,1),    X39600002
               (PSWCTL08,1),(PSWCTL09,1),(PSWCTL10,1),(PSWCTL11,1),    X39660002
               (PSWCTL12,1),(PSWCTL13,1),(PSWCTL14,1),(PSWCTL15,1),    X39720002
               (PSWCTL16,1),(PSWCTL17,1),(PSWCTL18,1),(PSWCTL19,1),    X39780002
               (PSWCTL20,1),(PSWCTL21,1),(PSWCTL22,1),(PSWCTL23,1),    X39840002
               (PSWCTL24,1),(PSWCTL25,1),(PSWCTL26,1),(PSWCTL27,1),    X39900002
               (PSWCTL28,1),(PSWCTL29,1),(PSWCTL30,1),(PSWCTL31,1)      39960002
         DSGEN (DARLNGTH,16),(,48)                                      40020002
         DSGEN (SYSSTAT,1,0,7)                                          40120002
         DSGEN (AREADT,1,0,15)                                          40220002
         DSGEN (ERRTYPE,1,0,7)                                          40320002
         DSGEN (RMSACTN,1,0,7)                                          40420002
         DSGEN (RMSINFO,1,0,7)                                          40520002
         DSGEN (WAITSUFF,8),(,8),(MCHFSAR,32),(,32)                     40620002
         DSGEN (TRNSMOD,32,0,7)                                         40720002
         DSGEN (MCHPDR,1,0,7,0,7)                                       40820002
         DSGEN (MCHFSAV,32),(MCHFSEAV,32),(MCHPDARI,32),(MCHTCBCU,32)   40920002
IFCE0145 CSECT                                                          41460002
         USING     *,9                                                  41520002
         USING DSECT145,R2                                     @YL02021 41550002
ENTRYPTR DC    A(STARTER)                                               41580002
TABLNAME DC    CL8'IFCE0145'                                            41640002
REG9     DC    F'0'                                                     41700002
LP       DC    F'0'                                                     41760002
SKIPPER  BR        14                                                   41820002
R0       EQU   0                                                        41880002
R1       EQU   1                                                        41940002
R2       EQU   2                                                        42000002
R3       EQU   3                                                        42060002
R4       EQU   4                                                        42120002
R5       EQU   5                                                        42180002
R6       EQU   6                                                        42240002
R7       EQU   7                                                        42300002
R8       EQU   8                                                        42360002
R9       EQU   9                                                        42420002
R10      EQU   10                                                       42480002
R11      EQU   11                                                       42540002
R12      EQU   12                                                       42600002
H01      EQU   X'01'                                           @YL02021 42660002
H13      EQU   X'13'                                           @YL02021 42680002
H20      EQU   X'20'                                           @YL02021 42700002
R13      EQU   13                                                       42720002
R14      EQU   14                                                       42780002
R15      EQU   15                                                       42840002
HEX00    EQU   X'00'                                                    42900002
HEX08    EQU   X'08'                                                    42960002
HEX40    EQU   X'40'                                                    43020002
HEX80    EQU   X'80'                                                    43080002
HEX48    EQU   X'48'                                                    43140002
HEXBF    EQU   X'BF'                                                    43200002
L0       EQU   0                                                        43260002
L1       EQU   1                                                        43320002
L2       EQU   2                                                        43380002
L3       EQU   3                                                        43440002
L4       EQU   4                                                        43500002
L5       EQU   5                                                        43560002
L6       EQU   6                                                        43620002
L7       EQU   7                                                        43680002
L8       EQU   8                                                        43740002
L12      EQU   12                                                       43800002
L19      EQU   19                                                       43860002
L60      EQU   60                                                       43920002
CONVREL  STM   R5,R8,XSAVE              SAVE WORK REGS                  43980002
         SR    R6,R6                    CLEAR R6                        44040002
         IC    R6,L0(R4)                PICK UP REL & SYS VALUES        44100002
         SRDL  R6,L5                    SAVE REL NO IN R7               44160002
        SLL   R6,L2                    MULTIPLY SYS VALUE BY 4          44220002
         L     R8,XLABELP               PICK UP LABEL POINTER           44280002
         LA    R6,RELTAB(R6)            INDEX INTO TABLE OF SYSTEMS     44340002
         MVC   L0(L4,R8),L0(R6)         MOVE SYSTEM NAME INTO LABEL     44400002
         SR    R6,R6                    CLEAR R6                        44460002
         SLDL  R6,L5                    RETREIVE REL NO.                44520002
         LTR   R6,R6                    IS IT ZERO                      44580002
         BZ    NOREL                    BR-YES                          44640002
         CVD   R6,WORK                  CONVERT IT                      44700002
         UNPK  L0(L2,R3),WORK+L6(L2)    UNPACK IT INTO PRINT BUFF       44760002
         MVZ   L1(L1,R3),L0(R3)         MOVE ON PROPER ZONE             44820002
         B     RETURN                   EXIT                            44880002
NOREL    MVC   L0(L4,R3),NONE           MOVE IN NONE FOR REL            44940002
         B     RETURN                                                   45000002
NOID     TM    0(R4),X'10'         ERRORID PRESENT?            @G17EFFR 45010002
         BNOR  R14                 NO,PRINT THIS LINE          @G17EFFR 45020002
NOPRT    SR    R15,R15             ERRORID PRESENT SKIP LINE   @G17EFFR 45030002
         BR    R14                 RETURN                      @G17EFFR 45040002
CHKID    TM    0(R4),X'10'         ERRORID PRESENT?            @G17EFFR 45060002
         BNO   NOPRT               NO,SKIP  THIS LINE          @G17EFFR 45060802
         STM   R4,R8,XSAVE         SAVE REGS                   @G17EFFR 45061602
         LR    R5,R2               PTR TO RECORD               @G17EFFR 45062402
         SH    R5,TWO              BACKUP TO RECORD COUNT      @G17EFFR 45063202
         MVC   WRKID(2),0(R5)      RECORD COUNT TO WRKIDAREA   @G17EFFR 45064002
         AH    R5,WRKID            ADD COUNT TO REC PTR        @G17EFFR 45064802
         SH    R5,EIGHT            PT TO ERRORID               @G17EFFR 45065602
         MVC   WRKID+2(10),0(R5)   MOVE ERRORID TO WRKIDAREA   @G17EFFR 45066402
         LA    R5,WRKID+2          PT TO WRKIDAREA             @G17EFFR 45067202
         LA    R4,ERRID            PT TO OUTPUT LABEL          @G17EFFR 45068002
         BAL   R7,CONVERT          CONVERT SEQUENCE NO.        @G17EFFR 45068802
         MVC   SEQOUT(5,R4),XWORK  MOVE TO LABEL               @G17EFFR 45069602
         LH    R6,WRKID+4          GET HEX CPUID               @G17EFFR 45070402
         BAL   R5,HEXCNV           CONVERT HEX TO EBCDIC       @G17EFFR 45070902
         MVC   CPUOUT(4,R4),XWORK  MOVE EBCDIC TO MSG          @G17EFFR 45071402
         LH    R6,WRKID+6          GET HEX ASID                @G17EFFR 45071902
         BAL   R5,HEXCNV           CONVERT HEX TO EBCDIC       @G17EFFR 45072402
         MVC   ASIDOUT(4,R4),XWORK MOVE EBCDIC TO MSG          @G17EFFR 45072902
*                                                              @G17EFFR 45073602
         L     R6,WRKID+8          PICK UP TENTHS OF SECS      @G17EFFR 45074402
         C     R6,TEN              LESS 10/10 OF A SEC         @G17EFFR 45075202
         BL    TENTHS              YES                         @G17EFFR 45076002
         SRDA  R6,32(0)            SHIFT TENTHS TO R7          @G17EFFR 45076802
         D     R6,TEN              DIVIDE TO GET SECONDS       @G17EFFR 45077602
TENTHS   STC   R6,TSECOUT(R4)      REMAINDER IS TENTHS         @G17EFFR 45078402
         OI    TSECOUT(R4),X'F0'   MAKE IT XWORK               @G17EFFR 45079202
*                                                              @G17EFFR 45080002
         LA    R5,WRKID            PT TO WRKIDAREA             @G17EFFR 45080802
         XC    0(6,R5),0(R5)       CLEAR WRKIDAREA             @G17EFFR 45081602
         LA    R8,2                                            @G17EFFR 45082402
COMP     C     R7,SIXTY            LESS THAN SIXTY             @G17EFFR 45083202
         BL    DONE                YES,WE ARE DONE             @G17EFFR 45084002
         SR    R6,R6               CLEAR REG 6 FOR DIVIDE      @G17EFFR 45084802
         D     R6,SIXTY            DIVIDE FOR SEC,MIN OR HRS   @G17EFFR 45085602
         STH   R6,0(R5)            STORE REMAINDER IN WRKIDAREA@G17EFFR 45086402
         LA    R5,2(R5)            NEXT HALF WORD OF WRKID     @G17EFFR 45087202
         BCT   R8,COMP             PROCESS NEXT TIME INCR      @G17EFFR 45088002
DONE     STH   R7,0(R5)            LAST INCR INTO WRKID        @G17EFFR 45088802
         LA    R5,WRKID            PT TO BEGIN OF WRKID        @G17EFFR 45089602
         LA    R4,SECOUT(R4)       PT TO SECONDS IN LABEL      @G17EFFR 45090402
         LA    R8,3                LOOP COUNT                  @G17EFFR 45091202
HHMMSS   BAL   R7,CONVERT          CONVERT TO XWORK            @G17EFFR 45092002
         MVC   0(2,R4),XWORK+3     MOVE TO LABEL               @G17EFFR 45092802
         SH    R4,THREE            DECREMENT LABEL PTR         @G17EFFR 45093602
         LA    R5,2(R5)                                        Z12033FR 45094002
         BCT   R8,HHMMSS           LOOP BACK FOR NEXT          @G17EFFR 45094402
*                                                              @G17EFFR 45095202
         LM    R4,R8,XSAVE         RESTORE REGS                @G17EFFR 45096002
         BR    R14                 GO PRINT ERRORID            @G17EFFR 45096802
HEXCNV   DS    0H                  HEX CONVERSION ROUTINE      @G17EFFR 45097602
         SRDL  R6,12               SHIFT OFF ALL BUT 1ST 4 BITS@G17EFFR 45097702
         LA    R8,3                LOOP CONTROL                @G17EFFR 45097802
SHIFT    SLL   R6,4                SPACE OVER 4 BITS           @G17EFFR 45097902
         SLDL  R6,4                GET NEXT 4 BITS             @G17EFFR 45098002
         BCT   R8,SHIFT            LOOP BACK FOR NEXT          @G17EFFR 45098102
         ST    R6,XWORK            STORE RESULT IN WORK AREA   @G17EFFR 45098202
         NI    XWORK,X'0F'         CLEAR SIGN BITS             @G17EFFR 45098302
         TR    XWORK(4),XLATE      TRANSLATE TO EBCDIC         @G17EFFR 45098402
         BR    R5                  RETURN TO CALLER            @G17EFFR 45098502
XLATE    DC    C'0123456789ABCDEF'                             @G17EFFR 45098602
CONVERT  DS    0H                  DECIMAL CONVERSION ROUTINE  @G17EFFR 45098702
         LH    R6,0(R5)            GET HALF WORD TO BE CONVERTED        45099202
         CVD   R6,XWORK            CONVERT TO DECIMAL          @G17EFFR 45100002
         UNPK  XWORK(5),XWORK+5(3) 5 DIGITS MAX                @G17EFFR 45100802
         OI    XWORK+4,X'F0'       LAST CHAR TO XWORK          @G17EFFR 45101602
         BR    R7                  RETURN TO CALLER            @G17EFFR 45103202
ERRIDOUT EQU   0                                               @G17EFFR 45104002
SEQOUT   EQU   ERRIDOUT+11                                     @G17EFFR 45104802
CPUOUT   EQU   ERRIDOUT+20                                     @G17EFFR 45105602
ASIDOUT  EQU   ERRIDOUT+29                                     @G17EFFR 45106402
HRSOUT   EQU   ERRIDOUT+38                                     @G17EFFR 45107202
MINOUT   EQU   ERRIDOUT+41                                     @G17EFFR 45108002
SECOUT   EQU   ERRIDOUT+44                                     @G17EFFR 45108802
TSECOUT  EQU   ERRIDOUT+47                                     @G17EFFR 45109602
TEN      DC    F'10'                                           @G17EFFR 45110402
SIXTY    DC    F'60'                                           @G17EFFR 45111202
EIGHT    DC    H'8'                                            @G17EFFR 45112002
THREE    DC    H'3'                                            @G17EFFR 45112802
TWO      DC    H'2'                                            @G17EFFR 45113602
WRKID    DS    3F                                              @G17EFFR 45114402
SETJOBN  MVC   L0(L8,R3),L0(R4)         MOVE JOB NAME                   45120002
         BR    R14                      RETURN                          45180002
*                                                                       45240002
SETDATE  UNPK  XWORK(L8),L0(L4,R4)      UNPACK DATE                     45300002
         MVZ   XWORK+L7(L1),XWORK       SET ZONE                        45360002
         MVC   L0(L3,R3),XWORK+L5       MOVE DAY                        45420002
         MVC   L6(L2,R3),XWORK+L3 MOVE YEAR                             45480002
         BR    R14                      RETURN                          45540002
*                                                                       45600002
TSTREC   STM   R5,R8,XSAVE                                     @XA20224 49320001
         TM    0(R4),HEX80        TEST SHORT FORM RECORD SWITCH         49380002
         BZ    TSTRECN            BRANCH IF LONG FORM                   49440002
         CLI   VS2FLG,H01                                      @YL02021 49460002
         BE    VS2SH                                           @YL02021 49480002
         LA    R5,SHORTREC-L4           ADDRESS OF END OF SHORT RECORD  49500002
         ST    R5,REG9            INTO ENTRY POINTER                    49560002
         B     RETURN                                          @XA20224 49620001
VS2SH    L     R5,LINEB                SET UP LINE PTR.        @YL02021 49630002
         L     R6,LABB                 SET UP LABEL PTR.       @YL02021 49640002
         ST    R5,REG9                 STORE                   @YL02021 49650002
         ST    R6,XLABELP              STORE                   @YL02021 49660002
         B     RETURN                                          @XA20224 49670001
TSTRECN  SR    R15,R15            DON'T PRINT LAST LINE        @XA20224 49740001
         BR    R14                RETURN                                49800002
ROUT3    ST    R3,XSAVE           SAVE REG 3                            49860002
         TM    0(R4),HEX80        TEST SHORT FORM RECORD SWITCH         49920002
         BO    ROUT3A             BRANCH IF SHORT FORM                  49980002
         SR    R15,R15            DON'T PRINT LAST LINE                 50040002
ROUT3A   L     R3,XSAVE           RESTORE REG 3                         50100002
         BR    R14                RETURN                                50160002
RETURN   LM    R5,R8,XSAVE         RESTORE WORK REGISTERS               50220002
         BR    R14                 RETURN                               50280002
SYSTERM  STM   R5,R8,XSAVE             SAVE REGS               @YL02021 50285002
         CLI   VS2FLG,H01              IS IT VS2?              @YL02021 50290002
         BNE   CONTIN                  NO, RETURN              @YL02021 50295002
         TM    XSWS10,H20              YES,CK FLAG             @YL02021 50300002
         BO    RETURN                  ON,PRINT MSG RETURN     @YL02021 50305002
CONTIN   SR    R15,R15                 ELIM LABEL              @YL02021 50310002
         B     RETURN                                          @YL02021 50315002
ISITVS2  STM   R5,R8,XSAVE                                     @YL02021 50320002
         CLI   XKEY,H13                IS IT VS2?              @YL02021 50325002
         BE    ITIS                    YES                     @YL02021 50330002
         B     RETURN                  NO                      @YL02021 50335002
ITIS     OI    VS2FLG,H01              YES VS2                 @YL02021 50340002
         B     RETURN                                          @YL02021 50345002
VS2TEST1 STM   R5,R8,XSAVE                                     @YL02021 50350002
         CLI   VS2FLG,H01              IS THIS VS2             @YL02021 50355002
         BE    ITISVS2                 YES VS2                 @YL02021 50360002
FIN      SR    R15,R15                 ELIM. LABEL             @YL02021 50365002
         B     RETURN                                          @YL02021 50370002
ITISVS2  L     R5,LINEA                CHANGE LINE PTR         @YL02021 50375002
         L     R6,LABA                 CHANGE LABEL PTR        @YL02021 50380002
         ST    R5,XR9PTR               STORE PTR               @YL02021 50385002
         ST    R6,XLABELP              STORE LABEL             @YL02021 50390002
         B     FIN                     CLEAN UP AND RETURN     @YL02021 50395002
VS2TEST2 STM   R5,R8,XSAVE                                     @YL02021 50400002
         CLI   VS2FLG,H01              IS THIS VS2?            @YL02021 50405002
         BE    ISVS2                   YES                     @YL02021 50410002
         B     FIN                     NO, RETURN              @YL02021 50415002
ISVS2    L     R5,LINEB                SET UP LINE PTR         @YL02021 50420002
         L     R6,LABB                 SET UP LABEL PTR        @YL02021 50425002
         ST    R5,XR9PTR               STORE LINE ADDR.        @YL02021 50430002
         ST    R6,XLABELP              STORE LABEL PTR         @YL02021 50435002
         B     FIN                                             @YL02021 50440002
*        ELIMINATE LINE IF NOT MVS                             @XA20224 50440801
ISITMVS  CLI   XKEY,H13                IS IT MVS               @XA20224 50441601
         BE    RETURNA                 YES                     @XA20224 50442401
         SR    R15,R15                 ELIM. LABEL             @XA20224 50443201
RETURNA  BR    R14                                             @XA20224 50444001
VS2TEST3 STM   R5,R8,XSAVE                                     @YL02021 50445002
         CLI   VS2FLG,H01                                      @YL02021 50450002
         BE    TESTRL                  VS2 BRANCH              @YL02021 50455002
         TM    XSWS8,HEX80             TEST SIZE OF REC.       @YL02021 50460002
         BO    SHORT                   SHORT REC.              @YL02021 50465002
         LA    R5,DUMPCODE-4           SET UP BRANCH PTR       @YL02021 50470002
         ST    R5,REG9                                         @YL02021 50475002
         B     RETURN                  GO BACK                 @YL02021 50480002
SHORT    LA    R5,SHORTREC-4           N-T 0S2 2&T S & 3   CC& @YL02021 50485002
         ST    R5,REG9                 STORE IN CORE           @YL02021 50490002
         B     RETURN                                          @YL02021 50495002
TESTRL   TM    XSWS8,HEX80             VS2,WHAT IS REC .       @YL02021 50500002
         BO    SHTFRM                                          @YL02021 50505002
         B     RETURN                                          @YL02021 50510002
SHTFRM   LA    R5,SHTVS2-4             SET UP PTR TO SHORT REC.         50515002
         ST    R5,REG9                 STORE IN CORE           @YL02021 50520002
         B     RETURN                  CLOSE OUT               @YL02021 50525002
JUMP     STM   R5,R8,XSAVE                                     @YL02021 50550002
         L     R5,LINEC                SET UP LINE PTR.        @YL02021 50555002
         ST    R5,XR9PTR               STORE LINE ADDR.        @YL02021 50560002
         B     FIN                     CLEAN UP AND RETURN     @YL02021 50565002
CHK145I  EQU   *                                               @X60CAFR 50565302
         STM   R5,R8,XSAVE         FREE REGS FOR WORK          @X60CAFR 50565602
         CLI   21(R2),X'48'        IS THIS A 148               @X60CAFR 50565902
         BE    TUL148              YES                         @X60CAFR 50566202
         CLI   XDUM2,X'01'         TEST VERSION CODE FOR TULLY @X60CAFR 50566502
         BNE   RETURN              NO,THIS IS REGULAR 145      @X60CAFR 50566802
TUL148   LA    R5,TULLY-4          SET UP TO GO TO IFCETUL1    @X60CAFR 50567102
         ST    R5,REG9             SET TABLE PTR TO IFCETUL1   @X60CAFR 50567402
         B     RETURN                                          @X60CAFR 50567702
         SPACE                                                          50568002
TULLY    DC    X'FE'                                           @X60CAFR 50568302
         DC    CL8'IFCETUL1'                                   @X60CAFR 50568602
VS2FLG   DC    X'00'                                           @YL02021 50570002
LINEA    DC    A(LINE1-4)                                      @YL02021 50575002
LABA     DC    A(LAB1-1)                                       @YL02021 50580002
LINEB    DC    A(LINE2-4)                                      @YL02021 50585002
LABB     DC    A(LAB2-1)                                       @YL02021 50590002
LINEC    DC    A(DUMPCODE-4)                                   @YL02021 50595002
XWORK    DS    D                                                        50640002
RELTAB   DS    0C                                              @L03163  50700002
         DC    C'OS  '                                         @L03163  50740002
         DC    C'DOS '                                         @L03163  50780002
         DC    C'VS 1'                                         @L03163  50820002
         DC    C'V370'                                         @L03163  50860002
         DC    C'VS 2'                                         @L03163  50900002
         DC    C'    '                                         @L03163  50940002
         DC    C'    '                                         @L03163  50980002
         DC    C'    '                                         @L03163  51020002
XR9PTR   EQU   REG9                                            @YL02021 51040002
XLABELP  EQU   LP                                                       51060002
WORK     EQU   XWORK                                                    51120002
XSAVE    DS    5F                                                       51180002
NONE     DC    CL4'NONE'                                                51240002
         LTORG                                                          51300002
STARTER  DS    0F                                                       51360002
         DC    XL4'00010001'                                            51420002
         DC    XL4'00010001'                                            51480002
         DC    A(LABAREA)                                               51540002
         DC    H'0'                                                     51600002
         DC    X'01'                                                    51660002
         DC    X'000B8B00'                                              51720002
         LABEL     ''                                                   51780002
         LINE  (1,1)                                           @X60CAFR 51790002
         ROUTINE EXTDLOG,CHK145I                               @X60CAFR 51800002
         LABEL ''                                              @X60CAFR 51810002
         LINE      ,,SKIP=2                                             51840002
         ROUTINE   XKEY,ISITVS2                                @YL02021 51870002
         LABEL     ''                                                   51900002
         LINE  (48,1),(1,35),SKIP=2                                     51960002
         HEX   XSER,1,3B                                                52020002
         LABEL 'MODEL 145','SERIAL NO'                                  52080002
*                                                                       52140002
         LINE  (10,)                                                    52200002
         ROUTINE    XRELN,CONVREL                                       52260002
         LABEL      'XXXX REL.'                                         52320002
         LINE  (48,1)                                                   52380002
         LABEL '--- RECORD SOURCE - MCH ---','TYPE - CPU'               52440002
*                                                                       52500002
         LINE  (1,1),(16,1),SKIP=2                                      52510002
         ROUTINE ERRORID,CHKID                                          52520002
ERRID    LABEL 'ERRORID=SEQXXXXX CPUXXXX ASIDXXXX TIMEXX.XX.XX.X'       52530002
         LINE                                                           52537002
         ROUTINE ERRORID,NOID                                           52544002
         LABEL 'NO ERRORID ASSOCIATED WITH THIS RECORD'                 52551002
         LINE  (15,1),(1,1)                                             52560002
         HEX   XMCKPSW,1,8B                                             52620002
         LABEL 'MCK OLD PSW'                                            52680002
         LINE  (21,1),(1,1)                                    @YL02021 52688002
         ROUTINE   XRELN,SYSTERM                               @YL02021 52696002
         LABEL 'XXXXX  SYSTEM TERMINATED  XXXXX'               @YL02021 52704002
         LINE  ,                                               @YL02021 52712002
         ROUTINE   XRELN,VS2TEST1                              @YL02021 52720002
         LABEL ''                                              @YL02021 52728002
         LINE  (21,1),(1,1)                                             52740002
         ROUTINE    XJOBID,SETJOBN                                      52800002
         LABEL      'JOB NAME'                                          52860002
*                                                                       52920002
         LINE                                                           52980002
         ROUTINE    XPGMID,SETJOBN                                      53040002
         LABEL 'PROGRAM NAME'                                           53100002
*                                                                       53160002
LINE1    LINE  ,(8,40),SKIP=1                                  @YL02021 53220002
         ROUTINE XSWS0,SKIPPER                                          53280002
LAB1     LABEL 'DAY  YEAR','HH MM SS.TH'                       @YL02021 53340002
         LINE       (8,40),(1,40),SKIP=2                                53400002
         ROUTINE    XDATE,SETDATE                                       53460002
         HEX        XTIME,1,4B                                          53520002
         LABEL      'DATE _','TIME _'                                   53580002
**********************************************************************  53640002
START    DS    0C                                                       53700002
         LINE  ,(30,1)                                                  53760002
         LABEL '--- MACHINE CHECK INTERRUPT CODE ---'                   53820002
         LINE  (41,50),(1,50),SKIP=1                                    53880002
         LABEL '--- SUB CLASS ---'                                      53940002
         LINE                                                           54000002
         BIN   MCIC0                                                    54060002
         BIN   MCIC4                                                    54120002
         LABEL 'SYSTEM DAMAGE (SD)','TIMING FACILITIES DAMAGE (CD)'     54180002
         LINE                                                           54240002
         BIN   MCIC1                                                    54300002
         BIN   MCIC5                                                    54340002
         LABEL 'INSTRUCTION PROCESSING DAMAGE (PD)',                   C54380002
               'EXTERNAL DAMAGE (ED)'                                   54420002
         LINE                                                           54480002
         BIN   MCIC2                                                    54540002
         BIN   MCIC7                                                    54600002
         LABEL 'SYSTEM RECOVERY (SR)','DEGRADATION (DG)'                54660002
         LINE                                                           54720002
         BIN   MCIC3                                                    54780002
         BIN   MCIC8                                                    54840002
         LABEL 'TIMER DAMAGE','WARNING (W)'                             54900002
         LINE                                                           54960002
         LABEL     ''                                                   55020002
         LINE  ,(1,1),SKIP=1                                            55080002
         LABEL '--- INTERRUPT TENSE CODES ---'                          55140002
         LINE  (41,50),(1,50)                                           55200002
         BIN   MCIC14                                                   55260002
         BIN   MCIC15                                                   55320002
         LABEL 'BACKED-UP (B)','DELAYED (D)'                            55380002
         LINE                                                           55440002
         LABEL     ''                                                   55500002
         LINE  ,(1,1),SKIP=1                                            55560002
         LABEL '--- STORAGE AND PROTECTION ERROR CODES ---'             55620002
         LINE  (41,50),(1,50)                                           55680002
         BIN   MCIC16                                                   55740002
         BIN   MCIC18                                                   55800002
         LABEL 'UNCORRECTED STORAGE ERRORS (SE)',                      C55860002
               'KEY IN STORAGE ERROR UNCORRECTED (KE)'                  55920002
         LINE                                                           55980002
         BIN   MCIC17                                                   56040002
         LABEL 'CORRECTED STORAGE ERRORS (SC)'                          56100002
         LINE                                                           56160002
         LABEL     ''                                                   56220002
         LINE  ,(1,1),SKIP=1                                            56280002
         LABEL '--- PSW VALIDITY CODES ---'                             56340002
         LINE  (41,50),(1,50)                                           56400002
         BIN   MCIC20                                                   56460002
         BIN   MCIC21                                                   56520002
         LABEL 'EMWP BITS OF M.C. OLD ARE VALID (WP)',                 C56580002
               'SYSTEM MASK AND KEY ARE VALID (MS)'                     56640002
         LINE                                                           56700002
         BIN   MCIC22                                                   56760002
         BIN   MCIC23                                                   56820002
         LABEL 'PGM MASK AND COND CODE ARE VALID (PM)',                C56880002
               'INSTR ADDR OF M.C. OLD IS VALID (IA)'                   56940002
         LINE                                                           57000002
         LABEL     ''                                                   57060002
         LINE  ,(1,1),SKIP=1                                            57120002
         LABEL '--- MISC VALIDITY CODES ---'                            57180002
         LINE  (41,50),(1,50)                                           57240002
         BIN   MCIC24                                                   57300002
         BIN   MCIC25                                                   57360002
         LABEL 'FAILING STORAGE ADDR IS VALID (FA)','REGION CODE VALID X57420002
                (RC)'                                                   57480002
         LINE                                                           57540002
         BIN   MCIC27                                                   57600002
         BIN   MCIC28                                                   57660002
         LABEL 'FP REGS STORED ARE VALID (FP)','GP REGS STORED ARE VALIX57720002
               D (GP)'                                                  57780002
         LINE                                                           57840002
         BIN   MCIC29                                                   57900002
         BIN   MCIC30                                                   57960002
         LABEL 'CONTROL REGS STORED ARE VALID (CR)','EXTENDED LOGOUT ARX58020002
               EA VALID (LG)'                                           58080002
         LINE                                                           58140002
         BIN   MCIC31                                                   58200002
         BIN   MCIC46                                                   58220002
         LABEL 'INSTR MODIFIED STORAGE VALID (ST)','CPU TIMER VALID'    58240002
         LINE                                                           58260002
         BIN   MCIC47                                                   58280002
         LABEL 'CLOCK COMPARATOR VALID'                                 58300002
         LINE                                                           58320002
         LABEL ''                                                       58380002
         LINE  (58,1),(30,30),SKIP=2                           @XA20224 58390001
         BIN   MCIC32                                          @XA20224 58400001
         ROUTINE  XKEY,ISITMVS                                 @XA20224 58410001
         LABEL '--- LRB MAY NOT BE VALID','---'                @XA20224 58420001
         LINE  (37,50),(1,50),SKIP=2                                    58440002
         HEX   EXTDLOG,1,2B                                             58500002
         LABEL 'EXTENDED LOGOUT LENGTH'                                 58560002
         LINE      (37,1),(1,1)                                         58620002
         HEX       RESRVDB,1,14B                                        58680002
         ROUTINE   XSWS8,ROUT3                                          58740002
         LABEL     'MC STATUS FIELD'                                    58800002
         LINE  ,(1,1),SKIP=1                                            58860002
         ROUTINE   XSWS8,TSTREC                                         58920002
         LABEL 'ABBREVIATED MACHINE CHECK LOGOUT'                       58980002
         LINE  (35,1),(1,1),SKIP=2                                      59040002
         HEX   FAILSTA,1,4B                                             59100002
         LABEL 'FAILING STORAGE ADDRESS'                                59160002
         LINE  ,(1,1),SKIP=1                                            59220002
         LABEL '--- REGION CODE ---'                                    59280002
         LINE   ,(46,),SKIP=1                                           59340002
         LABEL 'BIT(BYTE 3)'                                            59348002
         LINE  (41,50),(1,46)                                           59356002
         HEX   CTRLWD                                                   59364002
         BIN   RGCODE24                                                 59372002
         LABEL 'CONTROL STORAGE ADDRESS(BYTES 0-1)','0   UNUSED'        59380002
         LINE                                                           59388002
         HEX   ERCORCD                                                  59396002
         BIN   RGCODE25                                                 59404002
         LABEL 'ERROR CORRECTION CODES(BYTE 2)','1   UNUSED'            59412002
         LINE  (91,),(47,)                                              59420002
         BIN   RGCODE26                                                 59428002
         LABEL '2   CHECK BIT OR DATA BIT FAILURE'                      59436002
         LINE                                                           59444002
         BIN   RGCODE27                                                 59452002
         LABEL '3   DATA BIT FAILURE'                                   59460002
         LINE                                                           59468002
         BIN   RGCODE28                                                 59476002
         LABEL '4   CONTROL STORAGE DOUBLE BIT FAILURE'                 59484002
         LINE                                                           59492002
         BIN   RGCODE29                                                 59500002
         LABEL '5   THRESHOLD LIMIT EXCEEDED(BIT 7 ALSO 1)'             59508002
         LINE                                                           59516002
         BIN   RGCODE30                                                 59524002
         LABEL '6   INTERMITTENT SINGLE BIT FAILURE(CS/MS)'             59532002
         LINE                                                           59540002
         BIN   RGCODE31                                                 59548002
         LABEL '7=0 MAIN STORAGE FAILURE IF BIT 6=1'                    59556002
         LINE  ,,SKIP=2                                                 59564002
         LABEL '7=1 CONTROL STORAGE FAILURE IF BIT 6=1'                 59572002
         LINE                                                           59580002
         LABEL     ''                                                   59640002
         DC    X'01000B8B00'                                            59700002
         LABEL ''                                                       59760002
         LINE  ,(5,1)                                                   59820002
         LABEL '--- FLOATING POINT REGISTERS ---'                       59880002
         LINE  (16,15),(1,1)                                            59940002
         HEX   FP0,1,4B                                                 60000002
         HEX   FP1,1,4B                                                 60060002
         HEX   FP2,1,4B                                                 60120002
         HEX   FP3,1,4B                                                 60180002
         LABEL 'FP REGS 0,2'                                            60240002
         LINE  (16,15),(1,1)                                            60300002
         HEX   FP4,1,4B                                                 60360002
         HEX   FP5,1,4B                                                 60420002
         HEX   FP6,1,4B                                                 60480002
         HEX   FP7,1,4B                                                 60540002
         LABEL 'FP REGS 4,6'                                            60600002
         LINE                                                           60660002
         LABEL     ''                                                   60720002
         LINE  ,(5,1)                                                   60780002
         LABEL '--- GENERAL PURPOSE REGISTERS ---'                      60840002
         LINE  (16,15),(1,1)                                            60900002
         HEX   GPR0,1,4B                                                60960002
         HEX   GPR1,1,4B                                                61020002
         HEX   GPR2,1,4B                                                61080002
         HEX   GPR3,1,4B                                                61140002
         LABEL 'GP REGS 0-3'                                            61200002
         LINE  (16,15),(1,1)                                            61260002
         HEX   GPR4,1,4B                                                61320002
         HEX   GPR5,1,4B                                                61380002
         HEX   GPR6,1,4B                                                61440002
         HEX   GPR7,1,4B                                                61500002
         LABEL 'GP REGS 4-7'                                            61560002
         LINE  (16,15),(1,1)                                            61620002
         HEX   GPR8,1,4B                                                61680002
         HEX   GPR9,1,4B                                                61740002
         HEX   GP10,1,4B                                                61800002
         HEX   GP11,1,4B                                                61860002
         LABEL 'GP REGS 8-B'                                            61920002
         LINE  (16,15),(1,1)                                            61980002
         HEX   GP12,1,4B                                                62040002
         HEX   GP13,1,4B                                                62100002
         HEX   GP14,1,4B                                                62160002
         HEX   GP15,1,4B                                                62220002
         LABEL 'GP REGS C-F'                                            62280002
         LINE                                                           62340002
         LABEL     ''                                                   62400002
         LINE  ,(5,1)                                                   62460002
         LABEL '--- CONTROL REGISTERS ---'                              62520002
         LINE  (16,15),(1,1)                                            62580002
         HEX   CTR0,1,4B                                                62640002
         HEX   CTR1,1,4B                                                62700002
         HEX   CTR2,1,4B                                                62760002
         HEX   CTR3,1,4B                                                62820002
         LABEL 'CR REGS 0-3'                                            62880002
         LINE  (16,15),(1,1)                                            62940002
         HEX   CTR4,1,4B                                                63000002
         HEX   CTR5,1,4B                                                63060002
         HEX   CTR6,1,4B                                                63120002
         HEX   CTR7,1,4B                                                63180002
         LABEL 'CR REGS 4-7'                                            63240002
         LINE  (16,15),(1,1)                                            63300002
         HEX   CTR8,1,4B                                                63360002
         HEX   CTR9,1,4B                                                63420002
         HEX   CR10,1,4B                                                63480002
         HEX   CR11,1,4B                                                63540002
         LABEL 'CR REGS 8-B'                                            63600002
         LINE  (16,15),(1,1)                                            63660002
         HEX   CR12,1,4B                                                63720002
         HEX   CR13,1,4B                                                63780002
         HEX   CR14,1,4B                                                63840002
         HEX   CR15,1,4B                                                63900002
         LABEL 'CR REGS C-F'                                            63960002
         DC    X'01000B8B00'                                            64020002
         LABEL ''                                                       64080002
         LINE  ,(40,1),SKIP=2                                           64140002
         LABEL 'CPU DEPENDENT LOGOUT'                                   64200002
         LINE  ,(30,1),SKIP=2                                           64260002
         LABEL '----------------------------------------------------'   64320002
         LINE  ,(40,1),SKIP=2                                           64380002
         LABEL 'MACHINE CHECK REGISTER A'                               64440002
         LINE  ,(14,62),SKIP=2                                          64500002
         LABEL 'BYTE 0','BYTE 2'                                        64560002
         LINE  (38,60),(1,59),SKIP=1                                    64620002
         BIN   MCHRG00                                                  64680002
         BIN   MCHRG16                                                  64740002
         LABEL 'LOCAL STORAGE A SOURCE ADDR CHK','ALU 2 HALF SUM CHK'   64800002
         LINE                                                           64860002
         BIN   MCHRG01                                                  64920002
         BIN   MCHRG17                                                  64980002
         LABEL 'LOCAL STORAGE B SOURCE ADDR CHK','ALU 3 HALF SUM CHK'   65040002
         LINE                                                           65100002
         BIN   MCHRG02                                                  65160002
         BIN   MCHRG18                                                  65220002
         LABEL 'LOCAL STORAGE A DEST ADDR CHK','ALU LOGICAL CHK'        65280002
         LINE                                                           65340002
         BIN   MCHRG03                                                  65400002
         BIN   MCHRG19                                                  65460002
         LABEL 'LOCAL STORAGE B DEST ADDR CHK','B REG SHIFT CHK'        65520002
         LINE                                                           65580002
         BIN   MCHRG04                                                  65640002
         BIN   MCHRG20                                                  65700002
         LABEL 'DEST BYTE CTRL CHK','A REG PTY CHK'                     65760002
         LINE                                                           65820002
         BIN   MCHRG05                                                  65880002
         BIN   MCHRG21                                                  65940002
         LABEL 'LOCAL STORAGE A-B DEST ADDR COMPARE','B REG PTY CHK'    66000002
         LINE                                                           66060002
         BIN   MCHRG06                                                  66120002
         BIN   MCHRG22                                                  66180002
         LABEL 'LOCAL STORAGE CTRL ASSM CHK','Z REG PTY CHK'            66240002
         LINE  (38,60),(1,59),SKIP=2                                    66300002
         BIN   MCHRG07                                                  66360002
         BIN   MCHRG23                                                  66420002
         LABEL 'CTRL REG PTY CHK','D REG PTY CHK'                       66480002
         LINE  ,(14,62),SKIP=2                                          66540002
         LABEL 'BYTE 1','BYTE 3'                                        66600002
         LINE  (38,60),(1,59),SKIP=1                                    66660002
         BIN   MCHRG08                                                  66720002
         BIN   MCHRG24                                                  66780002
         LABEL 'ADDR CHK BOUND REG CHK','EXT REG DEST X COMP CHK'       66840002
         LINE                                                           66900002
         BIN   MCHRG09                                                  66960002
         BIN   MCHRG25                                                  67020002
         LABEL 'LOCAL STORAGE COMP CHK','EXT REG DEST Y COMP CHK'       67080002
         LINE                                                           67140002
         BIN   MCHRG10                                                  67200002
         BIN   MCHRG26                                                  67260002
         LABEL 'FLUSH THRU CHK','EXT REG SOURCE Y CHK'                  67320002
         LINE                                                           67380002
         BIN   MCHRG11                                                  67440002
         BIN   MCHRG27                                                  67500002
         LABEL 'H REG PTY CHK','EXT CTRL ASSM PTY CHK'                  67560002
         LINE                                                           67620002
         BIN   MCHRG12                                                  67680002
         BIN   MCHRG28                                                  67740002
         LABEL 'CLOCK COMPARATOR-CPU TIMER CHK','INTERV TIMER PTY CHK'  67800002
         LINE                                                           67860002
         BIN   MCHRG13                                                  67920002
         BIN   MCHRG29                                                  67980002
         LABEL 'P REG PTY CHK','S REC DUP CHK'                          68040002
         LINE                                                           68100002
         BIN   MCHRG14                                                  68160002
         BIN   MCHRG30                                                  68220002
         LABEL 'T REG PTY CHK','TIME OF DAY CLOCK CHK'                  68280002
         LINE  ,,SKIP=2                                          A45391 68340002
         BIN   MCHRG15                                                  68400002
         BIN   MCHRG31                                                  68460002
         LABEL 'L REG PTY CHK','CTRL STORAGE ADDR CHK'                  68520002
         LINE  ,(40,1),SKIP=2                                           68580002
         LABEL 'MACHINE CHECK REGISTER B'                               68640002
         LINE  ,(14,62),SKIP=2                                          68700002
         LABEL 'BYTE 0','BYTE 2'                                        68760002
         LINE  (38,60),(1,59),SKIP=1                                    68820002
         BIN   MCHRGB00                                                 68880002
         BIN   MCHRGB16                                                 68940002
         LABEL 'STORAGE ADD CHK','I CYCLE HARD ERROR'                   69000002
         LINE                                                           69060002
         BIN   MCHRGB01                                                 69120002
         BIN   MCHRGB17                                                 69180002
         LABEL 'SDBI PTY CHK','DOUBLE ECC ERROR'                        69240002
         LINE                                                           69300002
         BIN   MCHRGB02                                                 69360002
         BIN   MCHRGB18                                                 69420002
         LABEL 'SDBO PTY CHK','02I CTRL LINE PTY CHK'                   69480002
         LINE                                                           69540002
         BIN   MCHRGB03                                                 69600002
         BIN   MCHRGB19                                                 69660002
         LABEL 'STORE PTY CHK','BUSY CHK'                               69720002
         LINE                                                           69780002
         BIN   MCHRGB04                                                 69840002
         BIN   MCHRGB20                                                 69900002
         LABEL 'TIME OUT CHK','ECC HARDWARE CHK'                        69960002
         LINE                                                           70020002
         BIN   MCHRGB05                                                 70080002
         BIN   MCHRGB21                                                 70140002
         LABEL 'STORAGE PROT STACK PTY CHK','DOUBLE ECC ERROR'          70200002
         LINE                                                           70260002
         BIN   MCHRGB06                                                 70320002
         BIN   MCHRGB22                                                 70380002
         LABEL 'CLOCK SYN CHK A','SINGLE ECC ERROR'                     70440002
         LINE  (38,60),(1,59),SKIP=2                                    70500002
         BIN   MCHRGB07                                                 70560002
         BIN   MCHRGB23                                                 70620002
         LABEL 'CLOCK SYN CHK B','SINGLE DATA BIT CORRCT'               70680002
         LINE  ,(14,62),SKIP=2                                          70740002
         LABEL 'BYTE 1','BYTE 3'                                        70800002
         LINE  (38,60),(1,59),SKIP=1                                    70860002
         BIN   MCHRGB08                                                 70920002
         BIN   MCHRGB24                                                 70980002
         LABEL 'M REG COMP A CHK','02I CT ERROR CORRCT'                 71040002
         LINE                                                           71100002
         BIN   MCHRGB09                                                 71160002
         BIN   MCHRGB25                                                 71220002
         LABEL 'M REG COMP B CHK','C32 DATA BIT CORRCT'                 71280002
         LINE                                                           71340002
         BIN   MCHRGB10                                                 71400002
         BIN   MCHRGB26                                                 71460002
         LABEL 'M REG COMP C CHK','C16 DATA BIT CORRCT'                 71520002
         LINE                                                           71580002
         BIN   MCHRGB11                                                 71640002
         BIN   MCHRGB27                                                 71700002
         LABEL 'M REG COMP D CHK','C8 DATA BIT CORRCT'                  71760002
         LINE                                                           71820002
         BIN   MCHRGB12                                                 71880002
         BIN   MCHRGB28                                                 71940002
         LABEL 'NO RELOCATE REGISTER MATCH','C4 DATA BIT CORRCT'        72000002
         LINE                                                           72060002
         BIN   MCHRGB13                                                 72120002
         BIN   MCHRGB29                                                 72180002
         LABEL 'MULT RELOCATE REG MATCH','C2 DATA BIT CORRCT'           72240002
         LINE                                                           72300002
         BIN   MCHRGB14                                                 72360002
         BIN   MCHRGB30                                                 72420002
         LABEL 'RELOCATE LRU INVALID','C1 DATA BIT CORRCT'              72480002
         LINE  (38,60),(1,59),SKIP=2                                    72540002
         BIN   MCHRGB15                                                 72600002
         BIN   MCHRGB31                                                 72660002
         LABEL 'ANY MACH CHK ON','C0 DATA BIT CORRCT'                   72720002
         EJECT                                                          72780002
         DC    X'01000B8B00'                                            72840002
         LABEL ''                                                       72900002
         LINE  ,(14,62),SKIP=2                                          72960002
         LABEL 'RETRY COUNTS','RETRY REGS 1,2'                          73020002
         LINE  (38,60),(1,59)                                           73080002
         BIN   RETCNT2H                                                 73140002
         HEX   RTYREG1                                                  73200002
         LABEL 'RETRIES PER CURRENT MACRO','RETRY REG 1'                73260002
         LINE  (38,60),(1,59)                                           73320002
         HEX   NONRETRY                                                 73380002
         HEX   RTYREG2                                                  73440002
         LABEL 'NUMBER OF MACROS RETRIED','RETRY REG 2'                 73500002
         LINE  ,(14,62),SKIP=2                                          73560002
         LABEL 'RETRY REG 3','RETRY REG 4'                              73620002
         LINE  (38,60),(1,59),SKIP=1                                    73680002
         BIN   HREG0                                                    73740002
         BIN   RTYRG404                                                 73800002
         LABEL 'MACHINE CHECK TRAP','DEST BYTE LINE 0'                  73860002
         LINE                                                           73920002
         BIN   HREG1                                                    73980002
         BIN   RTYRG405                                                 74040002
         LABEL 'RETRY TRAP','DEST BYTE LINE 1'                          74100002
         LINE                                                           74160002
         BIN   HREG2                                                    74220002
         BIN   RTYRG406                                                 74280002
         LABEL 'CPU HIGH TRAP','DEST BYTE LINE 2'                       74340002
         LINE                                                           74400002
         BIN   HREG3                                                    74460002
         BIN   RTYRG407                                                 74520002
         LABEL 'INT FILE ADPTR OR SEL CHN 1,2 OR 3','DEST BYTE LINE 3'  74580002
         LINE                                                           74640002
         BIN   HREG4                                                    74700002
         LABEL 'SEL CHN 1,2,3(IF IFA) OR SEL CHN 4','RETRY FLAGS'       74760002
         LINE  (38,60),(1,59)                                           74820002
         BIN   HREG5                                                    74880002
         BIN   RTYRG408                                                 74940002
         LABEL 'MPX TRAP','STORAGE 2 CYCLE ERROR'                       75000002
         LINE                                                           75060002
         BIN   HREG6                                                    75120002
         BIN   RTYRG409                                                 75180002
         LABEL 'INT FILE ADAPTR TRAP','TYPE 1 ERROR'                    75240002
         LINE                                                           75300002
         BIN   HREG7                                                    75360002
         BIN   RTYRG410                                                 75420002
         LABEL 'STORE-DISPLAY','TYPE 2 ERROR'                           75480002
         LINE  (98,1),(59,1)                                            75540002
         BIN   RTYRG411                                                 75600002
         LABEL ' ','TYPE 3 ERROR'                                       75660002
         LINE  (38,60),(1,59)                                           75720002
         ROUTINE   REGUNU,SKIPPER                                       75780002
         BIN   RTYRG412                                                 75840002
         LABEL 'CTRL WORD ADDR AT TIME','LOCAL(0) OR EXT REG(1) DEST'   75900002
         LINE  (38,60),(5,55)                                           75960002
         HEX   RETRG23                                                  76020002
         BIN   RTYRG413                                                 76080002
         LABEL 'OF FAILURE','STORAGE WORD IN ERROR'                     76140002
         LINE  (98,1),(60,1)                                            76200002
         BIN   RTYRG414                                                 76260002
         LABEL 'ERROR IN TRAP 2 CYCLE'                                  76320002
         LINE                                                           76380002
         BIN   RTYRG415                                                 76440002
         LABEL 'SPARE'                                                  76500002
         LINE  ,(5,55)                                                  76560002
         LABEL 'CONTROL WORD','LOCAL STORAGE DEST'                      76620002
         LINE  (12,86),(64,1)                                           76680002
         HEX   CTRLDWD                                                  76740002
         BIN   RTYRG417                                                 76800002
         LABEL ' ','YYY'                                                76860002
         LINE  (98,1),(65,)                                             76920002
         BIN   RTYRG420                                                 76980002
         LABEL 'XXX'                                                    77040002
         LINE  (98,1),(60,1),SKIP=2                                     77100002
         BIN   RTYEXP                                                   77120002
         LABEL 'LOCAL STORE(0) OR EXP LOCAL STORE(1)'                   77140002
         LINE  ,(60,1),SKIP=1                                           77160002
         LABEL 'EXTERNAL REGISTER DEST'                                 77180002
         LINE  (98,1),(65,1)                                            77220002
         BIN   RTYRG425                                                 77280002
         LABEL 'YYY'                                                    77340002
         LINE  (98,1),(65,1),SKIP=2                                     77400002
         BIN   RTYRG428                                                 77460002
         LABEL 'XXX'                                                    77520002
         LINE  ,(40,1),SKIP=2                                           77580002
         LABEL 'SYSTEM REGISTER'                                        77640002
         LINE  ,(14,62),SKIP=2                                          77700002
         LABEL 'BYTE 0','BYTE 2'                                        77760002
         LINE  (38,60),(1,59),SKIP=1                                    77820002
         BIN   SYSREG00                                                 77880002
         BIN   SYSREG16                                                 77940002
         LABEL 'MACHINE CHK INTERPT PENDING','ENABLE CLEAR SWITCH'      78000002
         LINE                                                           78060002
         BIN   SYSREG01                                                 78120002
         BIN   SYSREG17                                                 78180002
         LABEL 'RETRY ROUTINE','TMPL'                                   78240002
         LINE                                                           78300002
         BIN   SYSREG02                                                 78360002
         BIN   SYSREG18                                                 78420002
         LABEL 'MACHINE CHK ROUTINE','LOAD FILE WAIT'                   78480002
         LINE                                                           78540002
         BIN   SYSREG03                                                 78600002
         BIN   SYSREG19                                                 78660002
         LABEL 'DOCUMENTARY CONSOLE 2','CE KEY IN CE MODE'              78720002
         LINE                                                           78780002
         BIN   SYSREG04                                                 78840002
         BIN   SYSREG20                                                 78900002
         LABEL 'LOG PRESENT','IPL'                                      78960002
         LINE                                                           79020002
         BIN   SYSREG05                                                 79080002
         BIN   SYSREG21                                                 79140002
         LABEL 'SPARE','POWER ON RESET'                                 79200002
         LINE                                                           79260002
         BIN   SYSREG06                                                 79320002
         BIN   SYSREG22                                                 79380002
         LABEL 'I/O INSTN LATCH','SPARE'                                79440002
         LINE  (38,60),(1,59),SKIP=2                                    79500002
         BIN   SYSREG07                                                 79560002
         BIN   SYSREG23                                                 79620002
         LABEL 'FORCE MODULE 0 TO LSCS','INSTR PROC LATCH'              79680002
         LINE  ,(14,62),SKIP=2                                          79740002
         LABEL 'BYTE 1','BYTE 3'                                        79800002
         LINE  (38,60),(1,59),SKIP=1                                    79860002
         BIN   SYSREG08                                                 79920002
         BIN   SYSREG24                                                 79980002
         LABEL 'ADDR CONTENTS','MACHINE CHECK TRAP'                     80040002
         LINE                                                           80100002
         BIN   SYSREG09                                                 80160002
         BIN   SYSREG25                                                 80220002
         LABEL 'CPU INTRPT FORCE','RETRY TRAP'                          80280002
         LINE                                                           80340002
         BIN   SYSREG10                                                 80400002
         BIN   SYSREG26                                                 80460002
         LABEL 'SAR INTRPT FORCE','CPU HIGH TRAP'                       80520002
         LINE                                                           80580002
         BIN   SYSREG11                                                 80640002
         BIN   SYSREG27                                                 80700002
         LABEL 'PSW RESTART','INT FILE ADAPTR OR SEL CHN 1,2 OR 3'      80760002
         LINE                                                           80820002
         BIN   SYSREG12                                                 80880002
         BIN   SYSREG28                                                 80940002
         LABEL 'EC MODE','SEL CHN 1,2,3(IF IFA) OR SEL CHN 4'           81000002
         LINE                                                           81060002
         BIN   SYSREG13                                                 81120002
         BIN   SYSREG29                                                 81180002
         LABEL 'SYS CTRL INTRPT','MPX TRAP'                             81240002
         LINE                                                           81300002
         BIN   SYSREG14                                                 81360002
         BIN   SYSREG30                                                 81420002
         LABEL 'TIMER INTRPT FORCE','INT FILE ADAPTR TRAP'              81480002
         LINE  (38,60),(1,59),SKIP=1                                    81540002
         BIN   SYSREG15                                                 81600002
         BIN   SYSREG31                                                 81660002
         LABEL 'PRTY INTRUPT','STORE-DISPLAY'                           81720002
         EJECT                                                          81780002
         DC    X'01000B8B00'                                            81840002
         LABEL ''                                                       81900002
         LINE  ,(40,1),SKIP=2                                           81960002
         LABEL '--- LOCAL STORAGE REGISTERS'                            82020002
         LINE  ,(14,53),SKIP=2                                          82080002
         LABEL 'I REGISTER','U REGISTER'                                82140002
         LINE  (23,74),(1,59),SKIP=1                                    82200002
         HEX   IREG                                                     82260002
         BIN   UREGA1                                                   82320002
         LABEL 'KEY','INSTR LENGTH CODE'                                82380002
         LINE                                                           82440002
         HEX   IREGB                                                    82500002
         BIN   UREGA2                                                   82560002
         LABEL 'INSTR ADDR','CONDITION CODE'                            82620002
         LINE  (97,1),(60,1)                                            82680002
         BIN   UREGA3                                                   82740002
         LABEL 'PROGRAM MASK'                                           82800002
         LINE                                                           82860002
         BIN   UREGA4                                                   82920002
         LABEL 'SPECIAL CPU USE'                                        82980002
         LINE                                                           83040002
         BIN   UREGA5                                                   83100002
         LABEL 'AMWP BITS'                                              83160002
         LINE                                                           83220002
         HEX   UREGC1                                                   83280002
         LABEL 'OP CODE'                                                83340002
         LINE  (97,1),(60,1),SKIP=2                                     83400002
         HEX   UREGC2                                                   83460002
         LABEL 'IMMEDIATE BYTE'                                         83520002
         LINE  ,(5,35),SKIP=2                                           83580002
         LABEL 'NP REGISTER','CPU REGISTER','---  PSWCTL REGISTER ---'  83640002
         LINE  (25,30),(1,30),SKIP=1                                    83700002
         HEX   NPRGXST                                                  83760002
         BIN   CPUREG00                                                 83820002
         BIN   PSWCTL01                                                 83880002
         BIN   PSWCTL12                                                 83940002
         LABEL 'LAST VIRTUAL ADDRESS','HARD STOP LATCH','EVR MSK',     C84000002
               'EC MODE'                                                84030002
         LINE                                                           84060002
         BIN   EXPDST00                                                 84120002
         BIN   CPUREG02                                                 84180002
         BIN   PSWCTL05                                                 84240002
         BIN   PSWCTL13                                                 84300002
         LABEL 'RELOCATE MODE','ENABLE HARD RETRY','TRANS MODE',       C84360002
               'MACH CHK MSK'                                           84420002
         LINE                                                           84480002
         BIN   EXPDST01                                                 84540002
         BIN   CPUREG03                                                 84600002
         BIN   PSWCTL06                                                 84660002
         BIN   PSWCTL14                                                 84720002
         LABEL 'FORMAT CHK','SG BIT FAIL M STOR','I/O MASTER MSK',     X84780002
               'WAIT STATE'                                             84840002
         LINE                                                           84900002
         BIN   EXPDST02                                                 84960002
         BIN   CPUREG04                                                 85020002
         BIN   PSWCTL07                                                 85080002
         BIN   PSWCTL15                                                 85140002
         LABEL 'SPARE','SG BIT FAIL CT STOR','EXT MASTER MSK',         C85200002
               'PROB STATE'                                             85260002
         LINE                                                           85320002
         BIN   EXPDST03                                                 85380002
         BIN   CPUREG05                                                 85440002
         BIN   PSWCTL16                                                 85500002
         BIN   PSWCTL24                                                 85560002
         LABEL '1 MEG SEGMENT','THRESH MODE CT STOR','TIMER MSK',      C85620002
               'MPX CCH MSK'                                            85650002
         LINE                                                           85680002
         BIN   EXPDST04                                                 85740002
         HEX   CPUREG16                                                 85800002
         BIN   PSWCTL17                                                 85860002
         BIN   PSWCTL25                                                 85920002
         LABEL '4K PAGE SIZE','LST T+S CONS FILE','INTERRUPT KEY MASK',C85980002
               'CHAN 1 MSK'                                             86040002
         LINE                                                           86100002
         BIN   EXPDST05                                                 86160002
         HEX   NEWRELTB                                                 86220002
         BIN   PSWCTL18                                                 86280002
         BIN   PSWCTL26                                                 86340002
         LABEL 'LOCAL MODE','RELOC TABLE LAST USED','EXT SIGNAL MSK',  C86400002
               'CHAN 2 MSK'                                             86460002
         LINE                                                           86520002
         BIN   EXPDST06                                                 86580002
         HEX   OLDRELTB                                                 86640002
         ROUTINE    FDUM8,SKIPPER                                       86700002
         BIN   PSWCTL27                                                 86760002
         LABEL 'SEGMENT NUMBER INVALID','RELOC MATCH REG','',          C86820002
               'CHAN 3 MASK'                                            86850002
         LINE                                                           86880002
         BIN   EXPDST07                                                 86940002
         ROUTINE  FDUM8,SKIPPER                                  A45391 87000002
         ROUTINE    FDUM8,SKIPPER                                       87060002
         BIN   PSWCTL28                                                 87120002
         LABEL 'RESET TABLE','','','CHAN 4 MASK'                        87180002
         LINE  (25,1)                                                   87240002
         BIN   EXPDST08                                                 87300002
         LABEL 'PAGE INVALID'                                           87360002
         LINE                                                           87420002
         BIN   EXPDST09                                                 87480002
         LABEL 'SEGMENT VALID'                                          87540002
         LINE                                                           87600002
         BIN   EXPDST10                                                 87660002
         LABEL 'PAGE NUMBER INVALID'                                    87720002
         LINE                                                           87780002
         BIN   EXPDST11                                                 87840002
         LABEL 'PAGE FORMAT INVALID'                                    87900002
         LINE  (25,1),SKIP=3                                            87960002
         BIN   EXPDST12                                                 88020002
         LABEL 'EXECUTED INSTRUCTION'                                   88080002
         LINE  ,(5,35),SKIP=1                                           88140002
         LABEL 'X REGISTER','R REGISTER','Y REGISTER','Q REGISTER'      88200002
         LINE  (8,35),(1,1),SKIP=2                                      88260002
         HEX   XREG                                                     88320002
         HEX   RREG                                                     88380002
         HEX   YREG                                                     88440002
         HEX   QREG                                                     88500002
         LABEL ''                                                       88560002
         LINE  ,(5,35),SKIP=1                                           88620002
         LABEL 'IBU REGISTER','TR REGISTER','SN REGISTER','PN REGISTER' 88680002
         LINE  (8,35),(1,1),SKIP=2                                      88740002
         HEX   IBUG                                                     88800002
         HEX   TRRG                                                     88860002
         HEX   SNRB                                                     88920002
         HEX   RLPAGE                                                   88980002
         LABEL ''                                                       89040002
         LINE  ,(5,35),SKIP=1                                           89100002
         LABEL 'WK REGISTER','DM REGISTER','RW REGISTER','V REGISTER'   89160002
         LINE  (8,35),(1,1),SKIP=2                                      89220002
         HEX   WKRG                                                     89280002
         HEX   DMREG                                                    89340002
         HEX   RWREG                                                    89400002
         HEX   VREG                                                     89460002
         LABEL ''                                                       89520002
         LINE  ,(5,1),SKIP=1                                            89580002
         LABEL 'W REGISTER'                                             89640002
         LINE  (8,1),(1,1),SKIP=2                                       89700002
         HEX   WREG                                                     89760002
         LABEL     ''                                                   89820002
         DC    X'01000B8B00'                                            89880002
         LABEL ''                                                       89900002
         LINE  ,(30,),SKIP=2                                            89920002
         ROUTINE FDUM8,SKIPPER                                          89940002
         LABEL 'MACHINE CHECK STATUS FIELD'                             89960002
         LINE  ,                                               @YL02021 89965002
         ROUTINE   XRELN,VS2TEST2                              @YL02021 89970002
         LABEL ''                                              @YL02021 89975002
         LINE  (41,),(1,),SKIP=1                                        89980002
         HEX   DARLNGTH,0,2B                                            90000002
         LABEL 'MCSTATD FIELD LENGTH'                                   90020002
         LINE  ,(5,)                                                    90040002
         ROUTINE FDUM8,SKIPPER                                          90060002
         LABEL '--- SYSTEM STATUS ---'                                  90080002
         LINE  (35,35),(1,40)                                           90100002
         BIN   SYSSTAT0                                                 90120002
         BIN   SYSSTAT1                                                 90140002
         LABEL 'HARDWARE RECOVERY','SOFTWARE RECOVERY'                  90160002
         LINE                                                           90180002
         BIN   SYSSTAT2                                                 90200002
         BIN   SYSSTAT3                                                 90220002
         LABEL 'TASK ABORTED','TASK SET NON-DISPATCHABLE'               90240002
         LINE                                                           90260002
         BIN   SYSSTAT4                                                 90280002
         BIN   SYSSTAT5                                                 90300002
         LABEL 'OPERATING SYSTEM TERMINATION','QUIET MODE IN EFFECT'    90320002
         LINE  ,(5,)                                                    90340002
         ROUTINE FDUM8,SKIPPER                                          90360002
         LABEL '--- DAMAGE AREA ---'                                    90380002
         LINE  ,(1,40)                                                  90400002
         BIN   AREADT0                                                  90420002
         BIN   AREADT1                                                  90440002
         LABEL 'MAIN STORAGE','BUFFER'                                  90460002
         LINE                                                           90480002
         BIN   AREADT2                                                  90500002
         BIN   AREADT3                                                  90520002
         LABEL 'CONTROL STORAGE','INTERVAL TIMER'                       90540002
         LINE                                                           90560002
         BIN   AREADT4                                                  90580002
         BIN   AREADT5                                                  90600002
         LABEL 'PROCESSOR','CHANNEL ERROR'                              90620002
         LINE                                                           90640002
         BIN   AREADT6                                                  90660002
         BIN   AREADT7                                                  90680002
         LABEL 'TOD CLOCK','SYSTEM DAMAGE'                              90700002
         LINE  ,(5,)                                                    90720002
         ROUTINE FDUM8,SKIPPER                                          90740002
         LABEL '--- ERROR TYPE ---'                                     90760002
         LINE  ,(1,40)                                                  90780002
         BIN   ERRTYPE0                                                 90800002
         BIN   ERRTYPE1                                                 90820002
         LABEL 'INTERMITTENT','SOLID'                                   90840002
         LINE                                                           90860002
         BIN   ERRTYPE2                                                 90880002
         BIN   ERRTYPE3                                                 90900002
         LABEL 'DATA','RESERVED'                                        90920002
         LINE                                                           90940002
         BIN   ERRTYPE4                                                 90960002
         BIN   ERRTYPE5                                                 90980002
         LABEL 'RESERVED','PROTECT'                                     91000002
         LINE  ,(5,)                                                    91020002
         ROUTINE FDUM8,SKIPPER                                          91040002
         LABEL '--- RMS ACTION DATA ---'                                91060002
         LINE  ,(1,40)                                                  91080002
         BIN   RMSACTN0                                                 91100002
         BIN   RMSACTN1                                                 91120002
         LABEL 'LOOP TIME OUT','REPAIR'                                 91140002
         LINE                                                           91160002
         BIN   RMSACTN2                                                 91180002
         BIN   RMSACTN3                                                 91200002
         LABEL 'STORAGE RECONFIGURE','BUFFER RECONFIGURE'               91220002
         LINE  ,(5,)                                                    91240002
         ROUTINE FDUM8,SKIPPER                                          91260002
         LABEL '--- RMS INFORMATION STATUS ---'                         91280002
         LINE  ,(1,40)                                                  91300002
         BIN   RMSINFO0                                                 91320002
         BIN   RMSINFO1                                                 91340002
         LABEL 'RESERVED','INVALID MCI CODE'                            91360002
         LINE                                                           91380002
         BIN   RMSINFO2                                                 91400002
         BIN   RMSINFO3                                                 91420002
         LABEL 'INVALID FAILING STORAGE ADDRESS','PROGRAM CHECK IN MCH' 91440002
         LINE  ,(5,),SKIP=1                                             91580002
         ROUTINE FDUM8,SKIPPER                                          91600002
         LABEL '--- HISTORY OF TRANSIENT MODULES ---'                   91620002
         LINE  (1,15)                                                   91640002
         HEX   TRNSMOD0,1,4B                                            91660002
         HEX   TRNSMOD1,1,4B                                            91680002
         HEX   TRNSMOD2,1,4B                                            91700002
         HEX   TRNSMOD3,1,4B                                            91720002
         LABEL ''                                                       91740002
         LINE  ,,SKIP=2                                                 91760002
         HEX   TRNSMOD4,1,4B                                            91780002
         HEX   TRNSMOD5,1,4B                                            91800002
         HEX   TRNSMOD6,1,4B                                            91820002
         HEX   TRNSMOD7,1,4B                                            91840002
         LABEL ''                                                       91860002
         LINE  ,(5,),SKIP=1                                             91880002
         LABEL '--- PDAR ACTION ---'                                    91900002
         LINE  (35,35),(1,40)                                           91920002
         BIN   MCHPDR00                                                 91940002
         BIN   MCHPDR01                                                 91960002
         LABEL 'TERMINATION OF CURRENT TASK','RETRY POSSIBLE'           91980002
         LINE                                                           92000002
         BIN   MCHPDR02                                                 92020002
         BIN   MCHPDR03                                                 92040002
         LABEL 'BYPASS(AFFECTED TASK) POSSIBLE','REPAIR UNSUCCESSFUL'   92060002
         LINE                                                           92080002
         BIN   MCHPDR04                                                 92100002
         BIN   MCHPDR05                                                 92120002
         LABEL 'INDETERMINATE INSTRUCTION COUNTER','RESERVED'           92140002
         LINE  ,(5,)                                                    92160002
         LABEL '--- FAILURE TYPE ---'                                   92180002
         LINE ,(1,40)                                                   92200002
         BIN   MCHPDR10                                                 92220002
         BIN   MCHPDR11                                                 92240002
         LABEL 'SOLID STORAGE DATA ERROR','INTERMITTENT STOR. DATA ERR' 92260002
         LINE                                                           92280002
         BIN   MCHPDR12                                                 92300002
         BIN   MCHPDR13                                                 92320002
         LABEL 'SOLID SPF KEY ERROR','INTERMITTENT SPF KEY ERROR'       92340002
         LINE  ,(5,)                                                    92360002
         LABEL '--- OPERATING SYSTEM STATUS ---'                        92380002
         LINE ,(1,40)                                                   92400002
         BIN   MCHPDR20                                                 92420002
         BIN   MCHPDR21                                                 92440002
         LABEL 'WAIT PSEUDO TASK','PAGE SUPERVISOR TASK'                92460002
         LINE                                                           92480002
         BIN   MCHPDR22                                                 92500002
         BIN   MCHPDR23                                                 92520002
         LABEL 'MASTER SCHEDULER TASK','SYSTEM TASK'                    92540002
         LINE                                                           92560002
         BIN   MCHPDR24                                                 92580002
         BIN   MCHPDR25                                                 92600002
         LABEL 'PROBLEM PROGRAM TASK','CURRENT PSW DISABLED FOR I/O'    92620002
         LINE  ,(5,)                                                    92640002
         LABEL '--- LOCATION OF FAILURE ---'                            92660002
         LINE ,(1,40)                                                   92680002
         BIN   MCHPDR30                                                 92700002
         BIN   MCHPDR31                                                 92720002
         LABEL 'NUCLEUS','SQA AREA'                                     92740002
         LINE                                                           92760002
         BIN   MCHPDR32                                                 92780002
         BIN   MCHPDR33                                                 92800002
         LABEL 'LSQA AREA','PQA'                                        92820002
         LINE                                                           92840002
         BIN   MCHPDR34                                                 92860002
         BIN   MCHPDR35                                                 92880002
         LABEL 'PAGEABLE AREA','FIXED PAGE AREA'                        92900002
         LINE                                                           92920002
         BIN   MCHPDR36                                                 92940002
         BIN   MCHPDR37                                                 92960002
         LABEL 'V=R ADDRESS AREA','CRITICAL AREA'                       92980002
         LINE  ,(5,)                                                    93000002
         LABEL '--- REQUESTED OPERATOR AWARENESS ---'                   93020002
         LINE ,(1,40)                                                   93040002
         BIN   MCHPDR50                                                 93060002
         BIN   MCHPDR51                                                 93080002
         LABEL 'SUPERVISOR DAMAGE MESSAGE','TASK ABNORM TERMINATION MSGC93100002
               '                                                        93120002
         LINE                                                           93140002
         BIN   MCHPDR52                                                 93160002
         BIN   MCHPDR53                                                 93180002
         LABEL 'DAMAGED PAGE NOW UNAVAILABLE MSG','DAMAGED PAGE NOW DELC93200002
               ETED MSG'                                                93220002
         LINE                                                           93240002
         BIN   MCHPDR54                                                 93260002
         BIN   MCHPDR55                                                 93280002
         LABEL 'TASK NON-DISPATCHABLE MESSAGE','SOFTWARE RECOVERY MESSAC93300002
               GE'                                                      93320002
         LINE  ,(5,)                                                    93340002
         LABEL '--- FOOTPRINTS ---'                                     93360002
         LINE ,(1,40)                                                   93380002
         BIN   MCHPDR60                                                 93400002
         BIN   MCHPDR61                                                 93420002
         LABEL 'CHANGE BIT ACTIVE','KEY IN EXTERNAL PAGE TABLE'         93440002
         LINE                                                           93460002
         BIN   MCHPDR62                                                 93480002
         BIN   MCHPDR63                                                 93500002
         LABEL 'PAGE RECURSION','PAGE FIX ACTIVE IN LOW END'            93520002
         LINE                                                           93540002
         BIN   MCHPDR64                                                 93560002
         BIN   MCHPDR65                                                 93580002
         LABEL 'TRANSLATE ERROR','NO PAGE EXISTS'                       93600002
         LINE                                                           93620002
         BIN   MCHPDR66                                                 93640002
         BIN   MCHPDR67                                                 93660002
         LABEL 'RELOCATE OFF','LOW END INTERFACE ACTIVE'                93680002
         DC    X'01000B8B00'                                            93700002
         LABEL ''                                                       93720002
         LINE  ,(5,)                                                    93740002
         LABEL '--- FOOTPRINTS - INTERFACES ---'                        93760002
         LINE ,(1,40)                                                   93780002
         BIN   MCHPDR70                                                 93800002
         BIN   MCHPDR71                                                 93820002
         LABEL 'ABTERM INTERFACE ACTIVE','TRANSLATE INTERFACE ACTIVE'   93840002
         LINE                                                           93860002
         BIN   MCHPDR72                                                 93880002
         BIN   MCHPDR73                                                 93900002
         LABEL 'FIND PAGE INTERFACE ACTIVE','PAGE DEQUEUE INTERFACE ACTC93920002
               .'                                                       93940002
         LINE                                                           93960002
         BIN   MCHPDR74                                                 93980002
         BIN   MCHPDR75                                                 94000002
         LABEL 'PAGE ENQUEUE INTERFACE ACTIVE',                        C94020002
               'STAT FUNCTION INTERFACE ACT.'                           94040002
         LINE  ,,SKIP=2                                                 94060002
         BIN   MCHPDR76                                                 94080002
         BIN   MCHPDR77                                                 94100002
         LABEL 'V=R RELEASE INTERFACE ACTIVE','POST INTERFACE ACTIVE'   94120002
         LINE  (45,1),(1,),SKIP=1                                       94140002
         HEX   MCHFSAR,0,4B                                             94160002
         LABEL 'FAILING STORAGE REAL ADDRESS'                           94180002
         LINE                                                           94200002
         HEX   MCHFSAV,0,4B                                             94220002
         LABEL 'BEGINNING FAILING STORAGE VIRTUAL ADDRESS'              94240002
         LINE                                                           94260002
         HEX   MCHFSEAV,0,4B                                            94280002
         LABEL 'ENDING FAILING STORAGE VIRTUAL ADDRESS'                 94300002
         LINE                                                           94320002
         HEX   MCHPDARI,0,4B                                            94340002
         LABEL 'INSTRUCTION ADDRESS AT FAILURE'                         94360002
         LINE  ,,SKIP=1                                        @YL02021 94380002
         HEX   MCHTCBCU,0,4B                                            94400002
         LABEL 'CURRENT TCB POINTER'                                    94420002
         LINE  ,                                               @YL02021 94430002
         ROUTINE   XRELN,JUMP                                  @YL02021 94440002
         LABEL ''                                              @YL02021 94450002
LINE2    LINE  (41,1),(1,1),SKIP=2                             @YL02021 94460002
         HEX   RECLNT                                          @YL02021 94470002
LAB2     LABEL 'RECORD LENGTH'                                 @YL02021 94480002
         LINE  ,                                               @YL02021 94490002
         HEX   WAITST                                          @YL02021 94500002
         LABEL 'WAIT STATE'                                    @YL02021 94510002
         LINE  ,(52,),SKIP=2                                   @YL02021 94520002
         ROUTINE   XRELN,SKIPPER                               @YL02021 94530002
         LABEL 'MACHINE-CHECK-ERROR INDICATORS'                @YL02021 94540002
         LINE  (5,35),(1,31)                                   @YL02021 94550002
         ROUTINE   XRELN,SKIPPER                               @YL02021 94560002
         LABEL 'TERMINAL ERROR FLAGS','HARD-MACHINE ERROR FLAGS',      X94570002
               'INTERMEDIATE ERROR','SOFT-MACHINE-ERROR FLAGS' @YL02021 94580002
         LINE  (26,31),(1,31),SKIP=1                           @YL02021 94590002
         BIN   (MCETEF0),(MCEMEF0),(MCEIEF0),(MCESEF0)         @YL02021 94600002
         LABEL 'RESERVED','ASSUMED HD ERR FLG','RESERVED',     @YL02021X94610002
               'ASSUMED SOFT ERROR'                            @YL02021 94620002
         LINE  ,                                               @YL02021 94630002
         BIN   (MCETEF1),(MCEMEF1),(MCEIEF1),(MCESEF1)         @YL02021 94640002
         LABEL 'RESERVED','RESERVED','RESERVED','RESERVED'     @YL02021 94650002
         LINE  ,                                               @YL02021 94660002
         BIN   (MCETEF2),(MCEMEF2),(MCEIEF2),(MCESEF2)         @YL02021 94670002
         LABEL 'THRESHOLD REACHED','RESERVED','RESERVED','RESERVED'     94680001
         LINE  ,                                               @YL02021 94690002
         BIN   (MCETEF3),(MCEMEF3),(MCEIEF3),(MCESEF3)         @YL02021 94700002
         LABEL 'SECONDARY ERROR FLAG','SYSTEM DAMAGE FLAG',  @XA20542  *94710001
               'RESERVED','RESERVED'                                    94715001
         LINE  ,                                               @YL02021 94720002
         BIN   (MCETEF4),(MCEMEF4),(MCEIEF4),(MCESEF4)         @YL02021 94730002
         LABEL 'CHECK STOP FLAG','REG/PSW INVALID FLAG',       @YL02021X94740002
               'TOD CLOCK ERROR FLAG','EXT DAMAGE FLAG'        @YL02021 94750002
         LINE  ,                                               @YL02021 94760002
         BIN   (MCETEF5),(MCEMEF5),(MCEIEF5),(MCESEF5)         @YL02021 94770002
         LABEL 'POWER WARNING FLAG','HARD STOR. ERR. FLAG',    @YL02021X94780002
               'CLOCK COMP ERR. FLAG','ECC CORR. STOR. ERR.'   @YL02021 94790002
         LINE  ,                                               @YL02021 94800002
         BIN   (MCETEF6),(MCEMEF6),(MCEIEF6),(MCESEF6)         @YL02021 94810002
         LABEL 'RESERVED','HARD PROTECT. KEY ERR.',            @XA20542*94820001
               'CPU TIMER ERR. FLAG','HIR CORR. PROC ERR FG'   @YL02021 94830002
         LINE  ,SKIP=2                                         @YL02021 94840002
         BIN   (MCETEF7),(MCEMEF7),(MCEIEF7),(MCESEF7)         @YL02021 94850002
         LABEL 'INVALID LOGOUT FLAG','INST. PROC. DAMAGE FLAG',        X94860002
               'INTERVAL TIMER ERR. FLAG','BUFFER ERR. FLAG'   @YL02021 94870002
         LINE  ,(30),SKIP=2                                    @YL02021 94880002
         ROUTINE   XRELN,SKIPPER                               @YL02021 94890002
         LABEL 'PROGRAM DAMAGE ASSESSMENT AND REPAIR'          @YL02021 94900002
         LINE  (30,32),(1,35),SKIP=2                           @YL02021 94910002
         ROUTINE   XRELN,SKIPPER                               @YL02021 94920002
         LABEL 'PDAR DATA','STOR. RECONFIG. STATUS',           @YL02021X94930002
               'STORAGE RECONFIG. STATUS'                      @YL02021 94940002
         LINE  (26,32),(1,32),SKIP=1                           @YL02021 94950002
         BIN   (PDAR00),(PDAR10),(PDAR20)                      @YL02021 94960002
         LABEL 'RESERVED','RESERVED','FR OFF LN/SCHED OFF LN'  @YL02021 94970002
         LINE  ,                                               @YL02021 94980002
         BIN   (PDAR01),(PDAR11),(PDAR21)                      @YL02021 94990002
         LABEL 'RESERVED','RESERVED','INTERCEPT'               @YL02021 95000002
         LINE  ,                                               @YL02021 95010002
         BIN   (PDAR02),(PDAR12),(PDAR22)                      @YL02021 95020002
         LABEL 'RESERVED','RESERVED','PERM. ERR. IN FRAME'     @YL02021 95030002
         LINE  ,                                               @YL02021 95040002
         BIN   (PDAR03),(PDAR13),(PDAR23)                      @YL02021 95050002
         LABEL 'STORAGE RECONFIG.','RESERVED',                 @YL02021X95060002
               'FRAME-PERM. RES. SYS.'                         @YL02021 95070002
         LINE  ,                                               @YL02021 95080002
         BIN   (PDAR04),(PDAR14),(PDAR24)                      @YL02021 95090002
         LABEL 'STOR REFIG STST AVAIL.','RESERVED','FRAME USE SQA'      95100002
         LINE  ,                                               @YL02021 95110002
         BIN   (PDAR05),(PDAR15),(PDAR25)                      @YL02021 95120002
         LABEL 'STOR REFIG. NOT ATTEMP.','RESERVED','FRAME USE LSQA'    95130002
         LINE  ,                                               @YL02021 95140002
         BIN   (PDAR06),(PDAR16),(PDAR26)                      @YL02021 95150002
         LABEL 'RESERVED','STOR ERR SET IN FRAME','FRAME-FIXED PG DATA' 95160002
         LINE  ,,SKIP=2                                        @YL02021 95170002
         BIN   (PDAR07),(PDAR17),(PDAR27)                      @YL02021 95180002
         LABEL 'RESERVED','FRAME-CHG IND. ON','FRAME-IS V=R OR SCHED.'  95190002
         LINE  (25,30),(1,),SKIP=2                             @YL02021 95200002
         HEX   WDSIZE                                          @YL02021 95210002
         LABEL 'PHYSICAL WORD LENGTH'                          @YL02021 95220002
         LINE  ,,SKIP=1                                        @YL02021 95230002
         ROUTINE   XRELN,VS2TEST3                              @YL02021 95240002
         LABEL ''                                              @YL02021 95250002
         DC    X'FF'                                           @YL02021 95260002
         DC    X'1B8'                                          @YL02021 95270002
         DC    XL2'30'                                         @YL02021 95280002
         DC    XL2'0'                                          @YL02021 95290002
DUMPCODE DC    X'FF'                                                    95820002
         DC    X'0208'                                         @YL02021 95880002
         DC    XL2'30'                                                  95940002
         DC    XL2'0'                                                   96000002
SHORTREC DC    X'FF'                                                    96060002
         DC    XL2'80'                                                  96120002
         DC    XL2'30'                                                  96180002
         DC    XL2'0'                                                   96240002
SHTVS2   DC    X'FF'                                           @YL02021 96250002
         DC    XL2'30'                                         @YL02021 96260002
         DC    XL2'30'                                         @YL02021 96270002
         DC    XL2'0'                                          @YL02021 96280002
LABAREA  EQU   *                                                        96300002
         LSTART                                                         96360002
         END                                                            96420002
