         TITLE 'IFCFRAMM - OUTPUT MCH INDEPENDENT INFO                 *00001000
                        '                                               00002000
IFCFRAMM CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IFCFRAMM  78.012'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @12,0                                               0001 00012000
@PSTART  LA    @11,4095(,@12)                                      0001 00013000
         LA    @10,4095(,@11)                                      0001 00014000
         LA    @05,4095(,@10)                                      0001 00015000
         USING @PSTART,@12                                         0001 00016000
         USING @PSTART+4095,@11                                    0001 00017000
         USING @PSTART+8190,@10                                    0001 00018000
         USING @PSTART+12285,@05                                   0001 00019000
         ST    @13,@SA00001+4                                      0001 00020000
         LA    @14,@SA00001                                        0001 00021000
         ST    @14,8(,@13)                                         0001 00022000
         LR    @13,@14                                             0001 00023000
         B     @PB00002                                            0135 00024000
CONVBIN2 STM   @14,@12,12(@13)                                     0135 00025000
         MVC   @PC00002(8),0(@01)                                  0135 00026000
* R8 = BWORD2;                                             /*@0001VLS*/ 00027000
         L     @06,@PC00002                                        0139 00028000
         L     R8,BWORD2(,@06)                                     0139 00029000
* CVD(R8,DBLWORD);                                         /*@0001VLS*/ 00030000
         CVD   R8,DBLWORD                                          0140 00031000
* UNPK(WORK(1:8),DBLWORD);                                 /*@0001VLS*/ 00032000
         UNPK  WORK(8),DBLWORD(8)                                  0141 00033000
* WORK(8) = WORK(8) | FOXZERO;                             /*@0001VLS*/ 00034000
         OI    WORK+7,C'0'                                         0142 00035000
* SWITCH1 = OFF;                                           /*@0001VLS*/ 00036000
         NI    SWITCH1,B'01111111'                                 0143 00037000
* DO L = 1 BY 1 TO 7 WHILE(SWITCH1 = OFF);                 /*@0001VLS*/ 00038000
         LA    L,1                                                 0144 00039000
@DL00144 TM    SWITCH1,B'10000000'                                 0144 00040000
         BNZ   @DC00144                                            0144 00041000
*  IF WORK(L) = FOXZERO THEN     /*REMOVE THE LEADING ZEROS  @0001VLS*/ 00042000
         LA    @09,WORK-1(L)                                       0145 00043000
         CLI   0(@09),C'0'                                         0145 00044000
         BNE   @RF00145                                            0145 00045000
*    WORK(L) = BLANK;            /*REPLACE WITH A BLANK CHARACTER    */ 00046000
         LA    @09,WORK-1(L)                                       0146 00047000
         MVI   0(@09),C' '                                         0146 00048000
*   ELSE                                                           0147 00049000
*    SWITCH1 = ON;               /*TELL LOOP THE END OF LEADING ZEROS*/ 00050000
         B     @RC00145                                            0147 00051000
@RF00145 OI    SWITCH1,B'10000000'                                 0147 00052000
* END;                                                     /*@0001VLS*/ 00053000
@RC00145 AH    L,@CH00055                                          0148 00054000
         CH    L,@CH00082                                          0148 00055000
         BNH   @DL00144                                            0148 00056000
@DC00144 DS    0H                                                  0149 00057000
* DADDR2(1:2) = WORK(7:8);                                 /*@G51DGVS*/ 00058000
         L     @09,@PC00002+4                                      0149 00059000
         MVC   DADDR2(2,@09),WORK+6                                0149 00060000
* RESPECIFY (R8) UNRESTRICTED;                             /*@0001VLS*/ 00061000
*END;                                                      /*@0001VLS*/ 00062000
@EL00002 DS    0H                                                  0151 00063000
@EF00002 DS    0H                                                  0151 00064000
@ER00002 LM    @14,@12,12(@13)                                     0151 00065000
         BR    @14                                                 0151 00066000
*/*                                                          @0001VLS*/ 00067000
*/* CONVERT A BINARY NUMBER TO PRINTABLE.  PRINT ONLY FIVE DIGITS.   */ 00068000
*/*                                                          @0001VLS*/ 00069000
*CONVBIN: PROC(BINWORD,DECADDR);                           /*@0001VLS*/ 00070000
CONVBIN  STM   @14,@12,12(@13)                                     0152 00071000
         MVC   @PC00003(8),0(@01)                                  0152 00072000
* DCL  BINWORD FIXED(31);                                  /*@0001VLS*/ 00073000
* DCL  DECADDR CHAR(20);                                   /*@0001VLS*/ 00074000
* RESPECIFY (R8) RESTRICTED;                               /*@0001VLS*/ 00075000
* R8 = BINWORD;                  /*LOAD THE ITEM TO CONVERT  @0001VLS*/ 00076000
         L     @06,@PC00003                                        0156 00077000
         L     R8,BINWORD(,@06)                                    0156 00078000
* CVD(R8,DBLWORD);                                         /*@0001VLS*/ 00079000
         CVD   R8,DBLWORD                                          0157 00080000
* UNPK(WORK(1:8),DBLWORD);                                 /*@0001VLS*/ 00081000
         UNPK  WORK(8),DBLWORD(8)                                  0158 00082000
* WORK(8) = WORK(8) | FOXZERO;                             /*@0001VLS*/ 00083000
         OI    WORK+7,C'0'                                         0159 00084000
* SWITCH1 = OFF;                                           /*@0001VLS*/ 00085000
         NI    SWITCH1,B'01111111'                                 0160 00086000
* DO L = 1 BY 1 TO 7 WHILE(SWITCH1 = OFF);                 /*@0001VLS*/ 00087000
         LA    L,1                                                 0161 00088000
@DL00161 TM    SWITCH1,B'10000000'                                 0161 00089000
         BNZ   @DC00161                                            0161 00090000
*  IF WORK(L) = FOXZERO THEN     /*REMOVE THE LEADING ZEROS  @0001VLS*/ 00091000
         LA    @09,WORK-1(L)                                       0162 00092000
         CLI   0(@09),C'0'                                         0162 00093000
         BNE   @RF00162                                            0162 00094000
*    WORK(L) = BLANK;            /*REPLACE WITH A BLANK CHARACTER    */ 00095000
         LA    @09,WORK-1(L)                                       0163 00096000
         MVI   0(@09),C' '                                         0163 00097000
*   ELSE                                                           0164 00098000
*    SWITCH1 = ON;               /*TELL LOOP THE END OF LEADING ZEROS*/ 00099000
         B     @RC00162                                            0164 00100000
@RF00162 OI    SWITCH1,B'10000000'                                 0164 00101000
* END;                                                     /*@0001VLS*/ 00102000
@RC00162 AH    L,@CH00055                                          0165 00103000
         CH    L,@CH00082                                          0165 00104000
         BNH   @DL00161                                            0165 00105000
@DC00161 DS    0H                                                  0166 00106000
* DECADDR(1:5) = WORK(4:8);      /* MOVE THE DATA TO THE OUTPUT LINE */ 00107000
         L     @09,@PC00003+4                                      0166 00108000
         MVC   DECADDR(5,@09),WORK+3                               0166 00109000
* RESPECIFY (R8) UNRESTRICTED;                             /*@0001VLS*/ 00110000
*END;                                                      /*@0001VLS*/ 00111000
@EL00003 DS    0H                                                  0168 00112000
@EF00003 DS    0H                                                  0168 00113000
@ER00003 LM    @14,@12,12(@13)                                     0168 00114000
         BR    @14                                                 0168 00115000
* /*                                                         @0001VLS*/ 00116000
* /* CONVERT CHARACTERS TO PRINTABLE                         @0001VLS*/ 00117000
* /*                                                         @0001VLS*/ 00118000
*CONVERT: PROC(NEXTBYTE,ADDNUM,LENNUM);                    /*@0001VLS*/ 00119000
CONVERT  STM   @14,@12,12(@13)                                     0169 00120000
         MVC   @PC00004(12),0(@01)                                 0169 00121000
* DCL NEXTBYTE  CHAR(11);                                  /*@0001VLS*/ 00122000
* DCL ADDNUM    CHAR(133);                                 /*@0001VLS*/ 00123000
* DCL LENNUM    FIXED(31);        /* HOW MUCH TO CONVERT     @0001VLS*/ 00124000
* RESPECIFY (R8,R9) RESTRICTED;                            /*@0001VLS*/ 00125000
* DO L = LENNUM BY -1 TO ONE;                              /*@0001VLS*/ 00126000
         L     @06,@PC00004+8                                      0174 00127000
         L     L,LENNUM(,@06)                                      0174 00128000
         B     @DE00174                                            0174 00129000
@DL00174 DS    0H                                                  0175 00130000
*  R8 = NEXTBYTE(L);              /* LOAD THE NEXT BYTE      @0001VLS*/ 00131000
         L     @06,@PC00004                                        0175 00132000
         BCTR  @06,0                                               0175 00133000
         SLR   R8,R8                                               0175 00134000
         IC    R8,NEXTBYTE(L,@06)                                  0175 00135000
*  J = TWO * L;                   /* INDEX FOR STORING CONVERTED 1/2 */ 00136000
         LR    @06,L                                               0176 00137000
         ALR   @06,@06                                             0176 00138000
         ST    @06,J                                               0176 00139000
*                                 /* BYTE.  INPUT IS 2 CHARS @0001VLS*/ 00140000
*  SRDL(R8,FOUR);                 /* SPLIT THE BYTE IN HALF  @0001VLS*/ 00141000
         SRDL  R8,4                                                0177 00142000
*  SRL(R9,28);                    /* RIGHT JUSTIFY SPLIT HALF BYTE   */ 00143000
         SRL   R9,28                                               0178 00144000
*  R9 = R9 + ONE;                                          /*@0001VLS*/ 00145000
         LA    @04,1                                               0179 00146000
         ALR   R9,@04                                              0179 00147000
*  R8 = R8 + ONE;                                          /*@0001VLS*/ 00148000
         ALR   R8,@04                                              0180 00149000
*  ADDNUM(J-ONE) = CHARS(R8);     /* CHARS IS 16 CHAR STRING FOR     */ 00150000
         L     @04,@PC00004+4                                      0181 00151000
         ALR   @06,@04                                             0181 00152000
         BCTR  @06,0                                               0181 00153000
         BCTR  @06,0                                               0181 00154000
         LA    @01,CHARS-1(R8)                                     0181 00155000
         MVC   ADDNUM(1,@06),0(@01)                                0181 00156000
*  ADDNUM(J)     = CHARS(R9);     /* CONVERTING HEX NUMS TO PRINT    */ 00157000
         L     @06,J                                               0182 00158000
         ALR   @04,@06                                             0182 00159000
         BCTR  @04,0                                               0182 00160000
         LA    @06,CHARS-1(R9)                                     0182 00161000
         MVC   ADDNUM(1,@04),0(@06)                                0182 00162000
* END;                                                     /*@0001VLS*/ 00163000
         BCTR  L,0                                                 0183 00164000
@DE00174 LTR   L,L                                                 0183 00165000
         BP    @DL00174                                            0183 00166000
*END;                                                      /*@0001VLS*/ 00167000
@EL00004 DS    0H                                                  0184 00168000
@EF00004 DS    0H                                                  0184 00169000
@ER00004 LM    @14,@12,12(@13)                                     0184 00170000
         BR    @14                                                 0184 00171000
*RESPECIFY (R8,R9) UNRESTRICTED;                           /*@0001VLS*/ 00172000
*/*                                                          @0001VLS*/ 00173000
*/* OUTPUT THE PRINT LINE.  IF A PAGE OVERFLOW OCCURS, EJECT TO A NEW*/ 00174000
*/* PAGE.  THE PRINT LINE IS PLACE IN THE VARIABLE BLINE.    @0001VLS*/ 00175000
*/*                                                          @0001VLS*/ 00176000
*PRINTER: PROC(LINENO);                                    /*@0001VLS*/ 00177000
PRINTER  STM   @14,@02,@SA00005                                    0186 00178000
         STM   @04,@12,@SA00005+20                                 0186 00179000
         MVC   @PC00005(4),0(@01)                                  0186 00180000
*  DCL LINENO CHAR(134);                                   /*@0001VLS*/ 00181000
*  IF MYLINCT < ONE THEN                                           0188 00182000
         LTR   MYLINCT,MYLINCT                                     0188 00183000
         BP    @RF00188                                            0188 00184000
*    DO;                                                   /*@0001VLS*/ 00185000
*      PRINTADR = ADDR(EJECT);                             /*@0001VLS*/ 00186000
         LA    @06,EJECT                                           0190 00187000
         ST    @06,PRINTADR(,R2)                                   0190 00188000
*      RESPECIFY (R15) RESTRICTED;                         /*@0001VLS*/ 00189000
*      CALL IOHND(RITEPRTR);                               /*@0001VLS*/ 00190000
         L     @15,ADIOHND(,R2)                                    0192 00191000
         LA    @01,@AL00192                                        0192 00192000
         BALR  @14,@15                                             0192 00193000
*      IF R15 ^= ZERO THEN                                         0193 00194000
         LTR   R15,R15                                             0193 00195000
         BZ    @RF00193                                            0193 00196000
*        GEN( DC X'0000');                                 /*@0001VLS*/ 00197000
          DC X'0000'                                                    00198000
*      RESPECIFY (R15) UNRESTRICTED;                       /*@0001VLS*/ 00199000
@RF00193 DS    0H                                                  0196 00200000
*      MYLINCT = LINECT - 1;                               /*@0001VLS*/ 00201000
         LH    MYLINCT,LINECT(,R2)                                 0196 00202000
         BCTR  MYLINCT,0                                           0196 00203000
*    END;                                                  /*@0001VLS*/ 00204000
*  BLINE = LINENO;                                         /*@0001VLS*/ 00205000
@RF00188 L     @06,@PC00005                                        0198 00206000
         MVC   BLINE(134),LINENO(@06)                              0198 00207000
*  PRINTADR = ADDR(BLINE);                                 /*@0001VLS*/ 00208000
         LA    @06,BLINE                                           0199 00209000
         ST    @06,PRINTADR(,R2)                                   0199 00210000
*  RESPECIFY (R15) RESTRICTED;                             /*@0001VLS*/ 00211000
*  CALL IOHND(RITEPRTR);                                   /*@0001VLS*/ 00212000
         L     @15,ADIOHND(,R2)                                    0201 00213000
         LA    @01,@AL00201                                        0201 00214000
         BALR  @14,@15                                             0201 00215000
*  IF R15 ^= ZERO THEN                                             0202 00216000
         LTR   R15,R15                                             0202 00217000
         BZ    @RF00202                                            0202 00218000
*    GEN ( DC X'0000');                                    /*@0001VLS*/ 00219000
          DC X'0000'                                                    00220000
*  RESPECIFY (R15) UNRESTRICTED;                           /*@0001VLS*/ 00221000
@RF00202 DS    0H                                                  0205 00222000
*  MYLINCT = MYLINCT - 1;                                  /*@0001VLS*/ 00223000
         BCTR  MYLINCT,0                                           0205 00224000
* END;                                                     /*@0001VLS*/ 00225000
@EL00005 DS    0H                                                  0206 00226000
@EF00005 DS    0H                                                  0206 00227000
@ER00005 LM    @14,@02,@SA00005                                    0206 00228000
         LM    @04,@12,@SA00005+20                                 0206 00229000
         BR    @14                                                 0206 00230000
*/*                                                          @0001VLS*/ 00231000
*/* OUTPUT THE EXTERNAL DAMAGE SECTION OF THE REPORT.        @0001VLS*/ 00232000
*/*                                                          @0001VLS*/ 00233000
*EXTDAM: PROC;                                             /*@0001VLS*/ 00234000
EXTDAM   STM   @14,@02,@SA00006                                    0207 00235000
         STM   @04,@12,@SA00006+20                                 0207 00236000
*  CALL PRINTER(BLINE);                                    /*@0001VLS*/ 00237000
         LA    @01,@AL00208                                        0208 00238000
         BAL   @14,PRINTER                                         0208 00239000
*  CALL PRINTER(LINE28C);                                  /*@0001VLS*/ 00240000
         LA    @01,@AL00209                                        0209 00241000
         BAL   @14,PRINTER                                         0209 00242000
*  CALL PRINTER(BLINE);                                    /*@0001VLS*/ 00243000
         LA    @01,@AL00210                                        0210 00244000
         BAL   @14,PRINTER                                         0210 00245000
*  IF LRBRESV = ON THEN                                            0211 00246000
         TM    LRBRESV(R7),B'10000000'                             0211 00247000
         BNO   @RF00211                                            0211 00248000
*    RESV = FOXONE;                                        /*@0001VLS*/ 00249000
         MVI   RESV,C'1'                                           0212 00250000
*  ELSE                                                            0213 00251000
*    RESV = FOXZERO;                                       /*@0001VLS*/ 00252000
         B     @RC00211                                            0213 00253000
@RF00211 MVI   RESV,C'0'                                           0213 00254000
*  IF LRBMCCF = ON THEN                                            0214 00255000
@RC00211 TM    LRBMCCF(R7),B'00001000'                             0214 00256000
         BNO   @RF00214                                            0214 00257000
*    MCCF = FOXONE;                                        /*@0001VLS*/ 00258000
         MVI   MCCF,C'1'                                           0215 00259000
*  ELSE                                                            0216 00260000
*    MCCF = FOXZERO;                                       /*@0001VLS*/ 00261000
         B     @RC00214                                            0216 00262000
@RF00214 MVI   MCCF,C'0'                                           0216 00263000
*  CALL PRINTER(LINE28D);                                  /*@0001VLS*/ 00264000
@RC00214 LA    @01,@AL00217                                        0217 00265000
         BAL   @14,PRINTER                                         0217 00266000
*  IF LRBMCOPR = ON THEN                                           0218 00267000
         TM    LRBMCOPR(R7),B'01000000'                            0218 00268000
         BNO   @RF00218                                            0218 00269000
*    MCOPR = FOXONE;                                       /*@0001VLS*/ 00270000
         MVI   MCOPR,C'1'                                          0219 00271000
*  ELSE                                                            0220 00272000
*    MCOPR = FOXZERO;                                      /*@0001VLS*/ 00273000
         B     @RC00218                                            0220 00274000
@RF00218 MVI   MCOPR,C'0'                                          0220 00275000
*  IF LRBMINST = ON THEN                                           0221 00276000
@RC00218 TM    LRBMINST(R7),B'00000100'                            0221 00277000
         BNO   @RF00221                                            0221 00278000
*    MINST = FOXONE;                                       /*@0001VLS*/ 00279000
         MVI   MINST,C'1'                                          0222 00280000
*  ELSE                                                            0223 00281000
*    MINST = FOXZERO;                                      /*@0001VLS*/ 00282000
         B     @RC00221                                            0223 00283000
@RF00221 MVI   MINST,C'0'                                          0223 00284000
*  CALL PRINTER(LINE28E);                                  /*@0001VLS*/ 00285000
@RC00221 LA    @01,@AL00224                                        0224 00286000
         BAL   @14,PRINTER                                         0224 00287000
*  IF LRBMEXSR = ON THEN                                           0225 00288000
         TM    LRBMEXSR(R7),B'00100000'                            0225 00289000
         BNO   @RF00225                                            0225 00290000
*    MEXSR = FOXONE;                                       /*@0001VLS*/ 00291000
         MVI   MEXSR,C'1'                                          0226 00292000
*  ELSE                                                            0227 00293000
*    MEXSR = FOXZERO;                                      /*@0001VLS*/ 00294000
         B     @RC00225                                            0227 00295000
@RF00225 MVI   MEXSR,C'0'                                          0227 00296000
*  IF LRBMINTR = ON THEN                                           0228 00297000
@RC00225 TM    LRBMINTR(R7),B'00000010'                            0228 00298000
         BNO   @RF00228                                            0228 00299000
*    MINTR = FOXONE;                                       /*@0001VLS*/ 00300000
         MVI   MINTR,C'1'                                          0229 00301000
*  ELSE                                                            0230 00302000
*    MINTR = FOXZERO;                                      /*@0001VLS*/ 00303000
         B     @RC00228                                            0230 00304000
@RF00228 MVI   MINTR,C'0'                                          0230 00305000
*  CALL PRINTER(LINE28F);                                  /*@0001VLS*/ 00306000
@RC00228 LA    @01,@AL00231                                        0231 00307000
         BAL   @14,PRINTER                                         0231 00308000
*  IF LRBMCNOP = ON THEN                                           0232 00309000
         TM    LRBMCNOP(R7),B'00010000'                            0232 00310000
         BNO   @RF00232                                            0232 00311000
*    MCNOP = FOXONE;                                       /*@0001VLS*/ 00312000
         MVI   MCNOP,C'1'                                          0233 00313000
*  ELSE                                                            0234 00314000
*    MCNOP = FOXZERO;                                      /*@0001VLS*/ 00315000
         B     @RC00232                                            0234 00316000
@RF00232 MVI   MCNOP,C'0'                                          0234 00317000
*  IF LRBMDISC = ON THEN                                           0235 00318000
@RC00232 TM    LRBMDISC(R7),B'00000001'                            0235 00319000
         BNO   @RF00235                                            0235 00320000
*    MDISC = FOXONE;                                       /*@0001VLS*/ 00321000
         MVI   MDISC,C'1'                                          0236 00322000
*  ELSE                                                            0237 00323000
*    MDISC = FOXZERO;                                      /*@0001VLS*/ 00324000
         B     @RC00235                                            0237 00325000
@RF00235 MVI   MDISC,C'0'                                          0237 00326000
*  CALL PRINTER(LINE28G);                                  /*@0001VLS*/ 00327000
@RC00235 LA    @01,@AL00238                                        0238 00328000
         BAL   @14,PRINTER                                         0238 00329000
*  RETURN;                                                 /*@0001VLS*/ 00330000
@EL00006 DS    0H                                                  0239 00331000
@EF00006 DS    0H                                                  0239 00332000
@ER00006 LM    @14,@02,@SA00006                                    0239 00333000
         LM    @04,@12,@SA00006+20                                 0239 00334000
         BR    @14                                                 0239 00335000
*END;                                                      /*@0001VLS*/ 00336000
*/*                                                          @0001VLS*/ 00337000
*/* OUTPUT THE MVS MACHINE LOGOUT INFORMATION.               @0001VLS*/ 00338000
*/*                                                          @0001VLS*/ 00339000
*MVSLOG: PROC;                                             /*@0001VLS*/ 00340000
MVSLOG   STM   @14,@12,@SA00007                                    0241 00341000
*    CALL PRINTER(BLINE);                                  /*@VS48736*/ 00342000
         LA    @01,@AL00242                                        0242 00343000
         BAL   @14,PRINTER                                         0242 00344000
*CALL PRINTER(BLIN1);                                      /*@0001VLS*/ 00345000
         LA    @01,@AL00243                                        0243 00346000
         BAL   @14,PRINTER                                         0243 00347000
*    CALL PRINTER(BLINE);                                  /*@VS48736*/ 00348000
         LA    @01,@AL00244                                        0244 00349000
         BAL   @14,PRINTER                                         0244 00350000
*CALL PRINTER(BLIN2);                                      /*@0001VLS*/ 00351000
         LA    @01,@AL00245                                        0245 00352000
         BAL   @14,PRINTER                                         0245 00353000
*    CALL PRINTER(BLINE);                                  /*@VS48736*/ 00354000
         LA    @01,@AL00246                                        0246 00355000
         BAL   @14,PRINTER                                         0246 00356000
*IF LRBMHHRD = ON THEN                                             0247 00357000
         TM    LRBMHHRD(R7),B'10000000'                            0247 00358000
         BNO   @RF00247                                            0247 00359000
*  BLIN3P2 = FOXONE;                                       /*@0001VLS*/ 00360000
         MVI   BLIN3P2,C'1'                                        0248 00361000
*ELSE                                                              0249 00362000
*  BLIN3P2 = FOXZERO;                                      /*@0001VLS*/ 00363000
         B     @RC00247                                            0249 00364000
@RF00247 MVI   BLIN3P2,C'0'                                        0249 00365000
*IF LRBMSSFT= ON THEN                                              0250 00366000
@RC00247 TM    LRBMSSFT(R7),B'10000000'                            0250 00367000
         BNO   @RF00250                                            0250 00368000
*  BLIN3P4 = FOXONE;                                       /*@0001VLS*/ 00369000
         MVI   BLIN3P4,C'1'                                        0251 00370000
*ELSE                                                              0252 00371000
*  BLIN3P4 = FOXZERO;                                      /*@0001VLS*/ 00372000
         B     @RC00250                                            0252 00373000
@RF00250 MVI   BLIN3P4,C'0'                                        0252 00374000
*CALL PRINTER(BLIN3);                                      /*@0001VLS*/ 00375000
@RC00250 LA    @01,@AL00253                                        0253 00376000
         BAL   @14,PRINTER                                         0253 00377000
*CALL PRINTER(BLIN4);                                      /*@0001VLS*/ 00378000
         LA    @01,@AL00254                                        0254 00379000
         BAL   @14,PRINTER                                         0254 00380000
*CALL PRINTER(BLIN5);                                      /*@0001VLS*/ 00381000
         LA    @01,@AL00255                                        0255 00382000
         BAL   @14,PRINTER                                         0255 00383000
*IF LRBMTSEC = ON THEN                                             0256 00384000
         TM    LRBMTSEC(R7),B'00010000'                            0256 00385000
         BNO   @RF00256                                            0256 00386000
*  BLIN6P1 = FOXONE;                                       /*@0001VLS*/ 00387000
         MVI   BLIN6P1,C'1'                                        0257 00388000
*ELSE                                                              0258 00389000
*  BLIN6P1 = FOXZERO;                                      /*@0001VLS*/ 00390000
         B     @RC00256                                            0258 00391000
@RF00256 MVI   BLIN6P1,C'0'                                        0258 00392000
*CALL PRINTER(BLIN6);                                      /*@0001VLS*/ 00393000
@RC00256 LA    @01,@AL00259                                        0259 00394000
         BAL   @14,PRINTER                                         0259 00395000
*IF LRBMTCKS= ON THEN                                              0260 00396000
         TM    LRBMTCKS(R7),B'00001000'                            0260 00397000
         BNO   @RF00260                                            0260 00398000
*  BLIN7P1 = FOXONE;                                       /*@0001VLS*/ 00399000
         MVI   BLIN7P1,C'1'                                        0261 00400000
*ELSE                                                              0262 00401000
*  BLIN7P1 = FOXZERO;                                      /*@0001VLS*/ 00402000
         B     @RC00260                                            0262 00403000
@RF00260 MVI   BLIN7P1,C'0'                                        0262 00404000
*IF LRBMHINV = ON THEN                                             0263 00405000
@RC00260 TM    LRBMHINV(R7),B'00001000'                            0263 00406000
         BNO   @RF00263                                            0263 00407000
*  BLIN7P2 = FOXONE;                                       /*@0001VLS*/ 00408000
         MVI   BLIN7P2,C'1'                                        0264 00409000
*ELSE                                                              0265 00410000
*  BLIN7P2 = FOXZERO;                                      /*@0001VLS*/ 00411000
         B     @RC00263                                            0265 00412000
@RF00263 MVI   BLIN7P2,C'0'                                        0265 00413000
*IF LRBMITOD = ON THEN                                             0266 00414000
@RC00263 TM    LRBMITOD(R7),B'00001000'                            0266 00415000
         BNO   @RF00266                                            0266 00416000
*  BLIN7P3 = FOXONE;                                       /*@0001VLS*/ 00417000
         MVI   BLIN7P3,C'1'                                        0267 00418000
*ELSE                                                              0268 00419000
*  BLIN7P3 = FOXZERO;                                      /*@0001VLS*/ 00420000
         B     @RC00266                                            0268 00421000
@RF00266 MVI   BLIN7P3,C'0'                                        0268 00422000
*IF LRBMSEXD = ON THEN                                             0269 00423000
@RC00266 TM    LRBMSEXD(R7),B'00001000'                            0269 00424000
         BNO   @RF00269                                            0269 00425000
*  BLIN7P4 = FOXONE;                                       /*@0001VLS*/ 00426000
         MVI   BLIN7P4,C'1'                                        0270 00427000
*ELSE                                                              0271 00428000
*  BLIN7P4 = FOXZERO;                                      /*@0001VLS*/ 00429000
         B     @RC00269                                            0271 00430000
@RF00269 MVI   BLIN7P4,C'0'                                        0271 00431000
*CALL PRINTER(BLIN7);                                      /*@0001VLS*/ 00432000
@RC00269 LA    @01,@AL00272                                        0272 00433000
         BAL   @14,PRINTER                                         0272 00434000
*IF LRBMTWRN= ON THEN                                              0273 00435000
         TM    LRBMTWRN(R7),B'00000100'                            0273 00436000
         BNO   @RF00273                                            0273 00437000
*  BLIN8P1 = FOXONE;                                       /*@0001VLS*/ 00438000
         MVI   BLIN8P1,C'1'                                        0274 00439000
*ELSE                                                              0275 00440000
*  BLIN8P1 = FOXZERO;                                      /*@0001VLS*/ 00441000
         B     @RC00273                                            0275 00442000
@RF00273 MVI   BLIN8P1,C'0'                                        0275 00443000
*IF LRBMHSTO = ON THEN                                             0276 00444000
@RC00273 TM    LRBMHSTO(R7),B'00000100'                            0276 00445000
         BNO   @RF00276                                            0276 00446000
*  BLIN8P2 = FOXONE;                                       /*@0001VLS*/ 00447000
         MVI   BLIN8P2,C'1'                                        0277 00448000
*ELSE                                                              0278 00449000
*  BLIN8P2 = FOXZERO;                                      /*@0001VLS*/ 00450000
         B     @RC00276                                            0278 00451000
@RF00276 MVI   BLIN8P2,C'0'                                        0278 00452000
*IF LRBMICKC = ON THEN                                             0279 00453000
@RC00276 TM    LRBMICKC(R7),B'00000100'                            0279 00454000
         BNO   @RF00279                                            0279 00455000
*  BLIN8P3 = FOXONE;                                       /*@0001VLS*/ 00456000
         MVI   BLIN8P3,C'1'                                        0280 00457000
*ELSE                                                              0281 00458000
*  BLIN8P3 = FOXZERO;                                      /*@0001VLS*/ 00459000
         B     @RC00279                                            0281 00460000
@RF00279 MVI   BLIN8P3,C'0'                                        0281 00461000
*IF LRBMSECC = ON THEN                                             0282 00462000
@RC00279 TM    LRBMSECC(R7),B'00000100'                            0282 00463000
         BNO   @RF00282                                            0282 00464000
*  BLIN8P4 = FOXONE;                                       /*@0001VLS*/ 00465000
         MVI   BLIN8P4,C'1'                                        0283 00466000
*ELSE                                                              0284 00467000
*  BLIN8P4 = FOXZERO;                                      /*@0001VLS*/ 00468000
         B     @RC00282                                            0284 00469000
@RF00282 MVI   BLIN8P4,C'0'                                        0284 00470000
*CALL PRINTER(BLIN8);                                      /*@0001VLS*/ 00471000
@RC00282 LA    @01,@AL00285                                        0285 00472000
         BAL   @14,PRINTER                                         0285 00473000
*IF LRBMTDMG = ON THEN                                             0286 00474000
         TM    LRBMTDMG(R7),B'00000010'                            0286 00475000
         BNO   @RF00286                                            0286 00476000
*  BLIN9P1 = FOXONE;                                       /*@0001VLS*/ 00477000
         MVI   BLIN9P1,C'1'                                        0287 00478000
*ELSE                                                              0288 00479000
*  BLIN9P1 = FOXZERO;                                      /*@0001VLS*/ 00480000
         B     @RC00286                                            0288 00481000
@RF00286 MVI   BLIN9P1,C'0'                                        0288 00482000
*IF LRBMHSPF = ON THEN                                             0289 00483000
@RC00286 TM    LRBMHSPF(R7),B'00000010'                            0289 00484000
         BNO   @RF00289                                            0289 00485000
*  BLIN9P2 = FOXONE;                                       /*@0001VLS*/ 00486000
         MVI   BLIN9P2,C'1'                                        0290 00487000
*ELSE                                                              0291 00488000
*  BLIN9P2 = FOXZERO;                                      /*@0001VLS*/ 00489000
         B     @RC00289                                            0291 00490000
@RF00289 MVI   BLIN9P2,C'0'                                        0291 00491000
*IF LRBMICTM = ON THEN                                             0292 00492000
@RC00289 TM    LRBMICTM(R7),B'00000010'                            0292 00493000
         BNO   @RF00292                                            0292 00494000
*  BLIN9P3 = FOXONE;                                       /*@0001VLS*/ 00495000
         MVI   BLIN9P3,C'1'                                        0293 00496000
*ELSE                                                              0294 00497000
*  BLIN9P3 = FOXZERO;                                      /*@0001VLS*/ 00498000
         B     @RC00292                                            0294 00499000
@RF00292 MVI   BLIN9P3,C'0'                                        0294 00500000
*IF LRBMSHIR = ON THEN                                             0295 00501000
@RC00292 TM    LRBMSHIR(R7),B'00000010'                            0295 00502000
         BNO   @RF00295                                            0295 00503000
*  BLIN9P4 = FOXONE;                                       /*@0001VLS*/ 00504000
         MVI   BLIN9P4,C'1'                                        0296 00505000
*ELSE                                                              0297 00506000
*  BLIN9P4 = FOXZERO;                                      /*@0001VLS*/ 00507000
         B     @RC00295                                            0297 00508000
@RF00295 MVI   BLIN9P4,C'0'                                        0297 00509000
*CALL PRINTER(BLIN9);                                      /*@0001VLS*/ 00510000
@RC00295 LA    @01,@AL00298                                        0298 00511000
         BAL   @14,PRINTER                                         0298 00512000
*IF LRBMTINV= ON THEN                                              0299 00513000
         TM    LRBMTINV(R7),B'00000001'                            0299 00514000
         BNO   @RF00299                                            0299 00515000
*  BLIN10P1 = FOXONE;                                      /*@0001VLS*/ 00516000
         MVI   BLIN10P1,C'1'                                       0300 00517000
*ELSE                                                              0301 00518000
*  BLIN10P1 = FOXZERO;                                     /*@0001VLS*/ 00519000
         B     @RC00299                                            0301 00520000
@RF00299 MVI   BLIN10P1,C'0'                                       0301 00521000
*IF LRBMHIPD = ON THEN                                             0302 00522000
@RC00299 TM    LRBMHIPD(R7),B'00000001'                            0302 00523000
         BNO   @RF00302                                            0302 00524000
*  BLIN10P2 = FOXONE;                                      /*@0001VLS*/ 00525000
         MVI   BLIN10P2,C'1'                                       0303 00526000
*ELSE                                                              0304 00527000
*  BLIN10P2 = FOXZERO;                                     /*@0001VLS*/ 00528000
         B     @RC00302                                            0304 00529000
@RF00302 MVI   BLIN10P2,C'0'                                       0304 00530000
*IF LRBMIL80 = ON THEN                                             0305 00531000
@RC00302 TM    LRBMIL80(R7),B'00000001'                            0305 00532000
         BNO   @RF00305                                            0305 00533000
*  BLIN10P3 = FOXONE;                                      /*@0001VLS*/ 00534000
         MVI   BLIN10P3,C'1'                                       0306 00535000
*ELSE                                                              0307 00536000
*  BLIN10P3 = FOXZERO;                                     /*@0001VLS*/ 00537000
         B     @RC00305                                            0307 00538000
@RF00305 MVI   BLIN10P3,C'0'                                       0307 00539000
*IF LRBMSBUF = ON THEN                                             0308 00540000
@RC00305 TM    LRBMSBUF(R7),B'00000001'                            0308 00541000
         BNO   @RF00308                                            0308 00542000
*  BLIN10P4 = FOXONE;                                      /*@0001VLS*/ 00543000
         MVI   BLIN10P4,C'1'                                       0309 00544000
*ELSE                                                              0310 00545000
*  BLIN10P4 = FOXZERO;                                     /*@0001VLS*/ 00546000
         B     @RC00308                                            0310 00547000
@RF00308 MVI   BLIN10P4,C'0'                                       0310 00548000
*CALL PRINTER(BLIN10);                                     /*@0001VLS*/ 00549000
@RC00308 LA    @01,@AL00311                                        0311 00550000
         BAL   @14,PRINTER                                         0311 00551000
*CALL PRINTER(BLINE);                                      /*@0001VLS*/ 00552000
         LA    @01,@AL00312                                        0312 00553000
         BAL   @14,PRINTER                                         0312 00554000
*CALL PRINTER(BLIN11A);                                    /*@0001VLS*/ 00555000
         LA    @01,@AL00313                                        0313 00556000
         BAL   @14,PRINTER                                         0313 00557000
*    CALL PRINTER(BLINE);                                  /*@VS48736*/ 00558000
         LA    @01,@AL00314                                        0314 00559000
         BAL   @14,PRINTER                                         0314 00560000
*CALL PRINTER(BLIN11);                                     /*@0001VLS*/ 00561000
         LA    @01,@AL00315                                        0315 00562000
         BAL   @14,PRINTER                                         0315 00563000
*    CALL PRINTER(BLINE);                                  /*@VS48736*/ 00564000
         LA    @01,@AL00316                                        0316 00565000
         BAL   @14,PRINTER                                         0316 00566000
*IF LRBMOFLN = ON THEN                                             0317 00567000
         TM    LRBMOFLN(R7),B'10000000'                            0317 00568000
         BNO   @RF00317                                            0317 00569000
*  BLIN12P3 = FOXONE;                                      /*@0001VLS*/ 00570000
         MVI   BLIN12P3,C'1'                                       0318 00571000
*ELSE                                                              0319 00572000
*  BLIN12P3 = FOXZERO;                                     /*@0001VLS*/ 00573000
         B     @RC00317                                            0319 00574000
@RF00317 MVI   BLIN12P3,C'0'                                       0319 00575000
*CALL PRINTER(BLIN12);                                     /*@0001VLS*/ 00576000
@RC00317 LA    @01,@AL00320                                        0320 00577000
         BAL   @14,PRINTER                                         0320 00578000
*IF LRBMINTC = ON THEN                                             0321 00579000
         TM    LRBMINTC(R7),B'01000000'                            0321 00580000
         BNO   @RF00321                                            0321 00581000
*  BLIN13P3 = FOXONE;                                      /*@0001VLS*/ 00582000
         MVI   BLIN13P3,C'1'                                       0322 00583000
*ELSE                                                              0323 00584000
*  BLIN13P3 = FOXZERO;                                     /*@0001VLS*/ 00585000
         B     @RC00321                                            0323 00586000
@RF00321 MVI   BLIN13P3,C'0'                                       0323 00587000
*CALL PRINTER(BLIN13);                                     /*@0001VLS*/ 00588000
@RC00321 LA    @01,@AL00324                                        0324 00589000
         BAL   @14,PRINTER                                         0324 00590000
*IF LRBMSPER = ON THEN                                             0325 00591000
         TM    LRBMSPER(R7),B'00100000'                            0325 00592000
         BNO   @RF00325                                            0325 00593000
*  BLIN14P3 = FOXONE;                                      /*@0001VLS*/ 00594000
         MVI   BLIN14P3,C'1'                                       0326 00595000
*ELSE                                                              0327 00596000
*  BLIN14P3 = FOXZERO;                                     /*@0001VLS*/ 00597000
         B     @RC00325                                            0327 00598000
@RF00325 MVI   BLIN14P3,C'0'                                       0327 00599000
*CALL PRINTER(BLIN14);                                     /*@0001VLS*/ 00600000
@RC00325 LA    @01,@AL00328                                        0328 00601000
         BAL   @14,PRINTER                                         0328 00602000
*IF LRBMINVP = ON THEN                                             0329 00603000
         TM    LRBMINVP(R7),B'00010000'                            0329 00604000
         BNO   @RF00329                                            0329 00605000
*  BLIN15P1 = FOXONE;                                      /*@0001VLS*/ 00606000
         MVI   BLIN15P1,C'1'                                       0330 00607000
*ELSE                                                              0331 00608000
*  BLIN15P1 = FOXZERO;                                     /*@0001VLS*/ 00609000
         B     @RC00329                                            0331 00610000
@RF00329 MVI   BLIN15P1,C'0'                                       0331 00611000
*IF LRBMNUCL = ON THEN                                             0332 00612000
@RC00329 TM    LRBMNUCL(R7),B'00010000'                            0332 00613000
         BNO   @RF00332                                            0332 00614000
*  BLIN15P3 = FOXONE;                                      /*@0001VLS*/ 00615000
         MVI   BLIN15P3,C'1'                                       0333 00616000
*ELSE                                                              0334 00617000
*  BLIN15P3 = FOXZERO;                                     /*@0001VLS*/ 00618000
         B     @RC00332                                            0334 00619000
@RF00332 MVI   BLIN15P3,C'0'                                       0334 00620000
*CALL PRINTER(BLIN15);                                     /*@0001VLS*/ 00621000
@RC00332 LA    @01,@AL00335                                        0335 00622000
         BAL   @14,PRINTER                                         0335 00623000
*IF LRBMRSRC = ON THEN                                             0336 00624000
         TM    LRBMRSRC(R7),B'00001000'                            0336 00625000
         BNO   @RF00336                                            0336 00626000
*  BLIN16P1 = FOXONE;                                      /*@0001VLS*/ 00627000
         MVI   BLIN16P1,C'1'                                       0337 00628000
*ELSE                                                              0338 00629000
*  BLIN16P1 = FOXZERO;                                     /*@0001VLS*/ 00630000
         B     @RC00336                                            0338 00631000
@RF00336 MVI   BLIN16P1,C'0'                                       0338 00632000
*IF LRBMFSQA = ON THEN                                             0339 00633000
@RC00336 TM    LRBMFSQA(R7),B'00001000'                            0339 00634000
         BNO   @RF00339                                            0339 00635000
*  BLIN16P3 = FOXONE;                                      /*@0001VLS*/ 00636000
         MVI   BLIN16P3,C'1'                                       0340 00637000
*ELSE                                                              0341 00638000
*  BLIN16P3 = FOXZERO;                                     /*@0001VLS*/ 00639000
         B     @RC00339                                            0341 00640000
@RF00339 MVI   BLIN16P3,C'0'                                       0341 00641000
*CALL PRINTER(BLIN16);                                     /*@0001VLS*/ 00642000
@RC00339 LA    @01,@AL00342                                        0342 00643000
         BAL   @14,PRINTER                                         0342 00644000
*IF LRBMRSRF = ON THEN                                             0343 00645000
         TM    LRBMRSRF(R7),B'00000100'                            0343 00646000
         BNO   @RF00343                                            0343 00647000
*  BLIN17P1 = FOXONE;                                      /*@0001VLS*/ 00648000
         MVI   BLIN17P1,C'1'                                       0344 00649000
*ELSE                                                              0345 00650000
*  BLIN17P1 = FOXZERO;                                     /*@0001VLS*/ 00651000
         B     @RC00343                                            0345 00652000
@RF00343 MVI   BLIN17P1,C'0'                                       0345 00653000
*IF LRBMLSQA = ON THEN                                             0346 00654000
@RC00343 TM    LRBMLSQA(R7),B'00000100'                            0346 00655000
         BNO   @RF00346                                            0346 00656000
*  BLIN17P3 = FOXONE;                                      /*@0001VLS*/ 00657000
         MVI   BLIN17P3,C'1'                                       0347 00658000
*ELSE                                                              0348 00659000
*  BLIN17P3 = FOXZERO;                                     /*@0001VLS*/ 00660000
         B     @RC00346                                            0348 00661000
@RF00346 MVI   BLIN17P3,C'0'                                       0348 00662000
*CALL PRINTER(BLIN17);                                     /*@0001VLS*/ 00663000
@RC00346 LA    @01,@AL00349                                        0349 00664000
         BAL   @14,PRINTER                                         0349 00665000
*IF LRBMSER  = ON THEN                                             0350 00666000
         TM    LRBMSER(R7),B'00000010'                             0350 00667000
         BNO   @RF00350                                            0350 00668000
*  BLIN18P2 = FOXONE;                                      /*@0001VLS*/ 00669000
         MVI   BLIN18P2,C'1'                                       0351 00670000
*ELSE                                                              0352 00671000
*  BLIN18P2 = FOXZERO;                                     /*@0001VLS*/ 00672000
         B     @RC00350                                            0352 00673000
@RF00350 MVI   BLIN18P2,C'0'                                       0352 00674000
*IF LRBMPGFX = ON THEN                                             0353 00675000
@RC00350 TM    LRBMPGFX(R7),B'00000010'                            0353 00676000
         BNO   @RF00353                                            0353 00677000
*  BLIN18P3 = FOXONE;                                      /*@0001VLS*/ 00678000
         MVI   BLIN18P3,C'1'                                       0354 00679000
*ELSE                                                              0355 00680000
*  BLIN18P3 = FOXZERO;                                     /*@0001VLS*/ 00681000
         B     @RC00353                                            0355 00682000
@RF00353 MVI   BLIN18P3,C'0'                                       0355 00683000
*CALL PRINTER(BLIN18);                                     /*@0001VLS*/ 00684000
@RC00353 LA    @01,@AL00356                                        0356 00685000
         BAL   @14,PRINTER                                         0356 00686000
*IF LRBMCHNG = ON THEN                                             0357 00687000
         TM    LRBMCHNG(R7),B'00000001'                            0357 00688000
         BNO   @RF00357                                            0357 00689000
*  BLIN19P2 = FOXONE;                                      /*@0001VLS*/ 00690000
         MVI   BLIN19P2,C'1'                                       0358 00691000
*ELSE                                                              0359 00692000
*  BLIN19P2 = FOXZERO;                                     /*@0001VLS*/ 00693000
         B     @RC00357                                            0359 00694000
@RF00357 MVI   BLIN19P2,C'0'                                       0359 00695000
*IF LRBMVEQR = ON THEN                                             0360 00696000
@RC00357 TM    LRBMVEQR(R7),B'00000001'                            0360 00697000
         BNO   @RF00360                                            0360 00698000
*  BLIN19P3 = FOXONE;                                      /*@0001VLS*/ 00699000
         MVI   BLIN19P3,C'1'                                       0361 00700000
*ELSE                                                              0362 00701000
*  BLIN19P3 = FOXZERO;                                     /*@0001VLS*/ 00702000
         B     @RC00360                                            0362 00703000
@RF00360 MVI   BLIN19P3,C'0'                                       0362 00704000
*CALL PRINTER(BLIN19);                                     /*@0001VLS*/ 00705000
@RC00360 LA    @01,@AL00363                                        0363 00706000
         BAL   @14,PRINTER                                         0363 00707000
*CALL PRINTER(BLINE);                                      /*@0001VLS*/ 00708000
         LA    @01,@AL00364                                        0364 00709000
         BAL   @14,PRINTER                                         0364 00710000
*I = LRBMPWL;                                              /*@0001VLS*/ 00711000
         SLR   @06,@06                                             0365 00712000
         IC    @06,LRBMPWL(,R7)                                    0365 00713000
         ST    @06,I                                               0365 00714000
*CALL CONVBIN(I,BLIN20P1);                                 /*@0001VLS*/ 00715000
         LA    @01,@AL00366                                        0366 00716000
         BAL   @14,CONVBIN                                         0366 00717000
*CALL PRINTER(BLIN20);                                     /*@0001VLS*/ 00718000
         LA    @01,@AL00367                                        0367 00719000
         BAL   @14,PRINTER                                         0367 00720000
*RETURN;                                                   /*@0001VLS*/ 00721000
@EL00007 DS    0H                                                  0368 00722000
@EF00007 DS    0H                                                  0368 00723000
@ER00007 LM    @14,@12,@SA00007                                    0368 00724000
         BR    @14                                                 0368 00725000
*END;                                                      /*@0001VLS*/ 00726000
@PB00007 DS    0H                                                  0370 00727000
*/*                                                          @0001VLS*/ 00728000
*/* MAIN LINE                                                @0001VLS*/ 00729000
*/*                                                          @0001VLS*/ 00730000
*MYLINCT = ZERO;                                           /*@0001VLS*/ 00731000
         SLR   MYLINCT,MYLINCT                                     0370 00732000
*CALL PRINTER(BLINE);                                      /*@0001VLS*/ 00733000
         LA    @01,@AL00371                                        0371 00734000
         BAL   @14,PRINTER                                         0371 00735000
*CALL CONVERT(LRBHMDL,LMODEL,2);                           /*@0001VLS*/ 00736000
         MVC   @AL00001+4(8),@AL00372                              0372 00737000
         LA    @06,LRBHMDL(,R7)                                    0372 00738000
         ST    @06,@AL00001                                        0372 00739000
         LA    @01,@AL00001                                        0372 00740000
         BAL   @14,CONVERT                                         0372 00741000
*CALL CONVERT (LRBHCSER,SERIAL,3);                         /*@0001VLS*/ 00742000
         MVC   @AL00001+4(8),@AL00373                              0373 00743000
         LA    @06,LRBHCSER(,R7)                                   0373 00744000
         ST    @06,@AL00001                                        0373 00745000
         LA    @01,@AL00001                                        0373 00746000
         BAL   @14,CONVERT                                         0373 00747000
*CALL PRINTER(LINE1);                                      /*@0001VLS*/ 00748000
         LA    @01,@AL00374                                        0374 00749000
         BAL   @14,PRINTER                                         0374 00750000
*CALL PRINTER(BLINE);                                      /*@0001VLS*/ 00751000
         LA    @01,@AL00375                                        0375 00752000
         BAL   @14,PRINTER                                         0375 00753000
*I = LRBHSYS & '1F'X;                                      /*@0001VLS*/ 00754000
         LA    @06,31                                              0376 00755000
         MVC   @ZT00003+3(1),LRBHSYS(R7)                           0376 00756000
         N     @06,@ZT00003                                        0376 00757000
         ST    @06,I                                               0376 00758000
*IF LRBHSYS1 = ON THEN                                             0377 00759000
         TM    LRBHSYS1(R7),B'10000000'                            0377 00760000
         BNO   @RF00377                                            0377 00761000
*  SYS(1:4) = 'VS 2';                                      /*@0001VLS*/ 00762000
         MVC   SYS(4),@CC01703                                     0378 00763000
*ELSE                                                              0379 00764000
*  IF LRBHSYS2 = ON & LRBHSYS3 = ON THEN                           0379 00765000
         B     @RC00377                                            0379 00766000
@RF00377 TM    LRBHSYS2(R7),B'01100000'                            0379 00767000
         BNO   @RF00379                                            0379 00768000
*    SYS(1:4) = 'VM  ';                                    /*@0001VLS*/ 00769000
         MVC   SYS(4),@CC01704                                     0380 00770000
*  ELSE                                                            0381 00771000
*    IF LRBHSYS2 = ON THEN                                         0381 00772000
         B     @RC00379                                            0381 00773000
@RF00379 TM    LRBHSYS2(R7),B'01000000'                            0381 00774000
         BNO   @RF00381                                            0381 00775000
*      SYS(1:4) = 'VS 1';                                  /*@0001VLS*/ 00776000
         MVC   SYS(4),@CC01705                                     0382 00777000
*    ELSE                                                          0383 00778000
*      IF LRBHSYS3 = ON THEN                                       0383 00779000
         B     @RC00381                                            0383 00780000
@RF00381 TM    LRBHSYS3(R7),B'00100000'                            0383 00781000
         BNO   @RF00383                                            0383 00782000
*        DO;                                               /*@0001VLS*/ 00783000
*          SYS(1:4) = 'DOS ';                              /*@0001VLS*/ 00784000
         MVC   SYS(4),@CC01706                                     0385 00785000
*          I = I + 28;                                     /*@0001VLS*/ 00786000
         LA    @06,28                                              0386 00787000
         AL    @06,I                                               0386 00788000
         ST    @06,I                                               0386 00789000
*        END;                                              /*@0001VLS*/ 00790000
*      ELSE                                                        0388 00791000
*        SYS(1:4) = 'OS  ';                                /*@0001VLS*/ 00792000
         B     @RC00383                                            0388 00793000
@RF00383 MVC   SYS(4),@CC01707                                     0388 00794000
*  CALL CONVBIN2 (I,REL);                                  /*@VS48736*/ 00795000
@RC00383 DS    0H                                                  0389 00796000
@RC00381 DS    0H                                                  0389 00797000
@RC00379 DS    0H                                                  0389 00798000
@RC00377 LA    @01,@AL00389                                        0389 00799000
         BAL   @14,CONVBIN2                                        0389 00800000
*CALL PRINTER(LINE2);                                      /*@0001VLS*/ 00801000
         LA    @01,@AL00390                                        0390 00802000
         BAL   @14,PRINTER                                         0390 00803000
*CALL PRINTER(BLINE);                                      /*@0001VLS*/ 00804000
         LA    @01,@AL00391                                        0391 00805000
         BAL   @14,PRINTER                                         0391 00806000
*CALL PRINTER(LINE3);                                      /*@0001VLS*/ 00807000
         LA    @01,@AL00392                                        0392 00808000
         BAL   @14,PRINTER                                         0392 00809000
*CALL PRINTER(BLINE);                                      /*@0001VLS*/ 00810000
         LA    @01,@AL00393                                        0393 00811000
         BAL   @14,PRINTER                                         0393 00812000
*IF LRBERRID = ON THEN                                             0394 00813000
         TM    LRBERRID(R7),B'00010000'                            0394 00814000
         BNO   @RF00394                                            0394 00815000
*  DO;                                                     /*@0001VLS*/ 00816000
*    I = LRBESEQ;                                          /*@0001VLS*/ 00817000
         LR    @06,R7                                              0396 00818000
         AL    @06,RECLNGT1(,R2)                                   0396 00819000
         AL    @06,@CF01723                                        0396 00820000
         MVC   @ZT00002+2(2),LRBESEQ(@06)                          0396 00821000
         L     @06,@ZT00002                                        0396 00822000
         ST    @06,I                                               0396 00823000
*    CALL CONVBIN(I,SEQ);                                  /*@0001VLS*/ 00824000
         LA    @01,@AL00397                                        0397 00825000
         BAL   @14,CONVBIN                                         0397 00826000
*    CALL CONVERT(LRBCPUID,CPU,2);                         /*@0001VLS*/ 00827000
         MVC   @AL00001+4(8),@AL00398                              0398 00828000
         LR    @06,R7                                              0398 00829000
         AL    @06,RECLNGT1(,R2)                                   0398 00830000
         AL    @06,@CF01724                                        0398 00831000
         ST    @06,@AL00001                                        0398 00832000
         LA    @01,@AL00001                                        0398 00833000
         BAL   @14,CONVERT                                         0398 00834000
*    CALL CONVERT(LRBASID,ASID,2);                         /*@0001VLS*/ 00835000
         MVC   @AL00001+4(8),@AL00399                              0399 00836000
         LR    @06,R7                                              0399 00837000
         AL    @06,RECLNGT1(,R2)                                   0399 00838000
         AL    @06,@CF01725                                        0399 00839000
         ST    @06,@AL00001                                        0399 00840000
         LA    @01,@AL00001                                        0399 00841000
         BAL   @14,CONVERT                                         0399 00842000
*    I = LRBETIME;                                         /*@0001VLS*/ 00843000
         LR    @06,R7                                              0400 00844000
         AL    @06,RECLNGT1(,R2)                                   0400 00845000
         AL    @06,@CF01726                                        0400 00846000
         MVC   @TF00001(4),LRBETIME-6(@06)                         0400 00847000
         L     @06,@TF00001                                        0400 00848000
         ST    @06,I                                               0400 00849000
*    J = I/(60*60*10);                                     /*@0001VLS*/ 00850000
         LR    @00,@06                                             0401 00851000
         SRDA  @00,32                                              0401 00852000
         D     @00,@CF01713                                        0401 00853000
         ST    @01,J                                               0401 00854000
*    CALL CONVBIN2(J,ERRORHH);                             /*@0001VLS*/ 00855000
         LA    @01,@AL00402                                        0402 00856000
         BAL   @14,CONVBIN2                                        0402 00857000
*    I = I - J*60*60*10;                                   /*@0001VLS*/ 00858000
         L     @01,J                                               0403 00859000
         M     @00,@CF01713                                        0403 00860000
         LCR   @01,@01                                             0403 00861000
         AL    @01,I                                               0403 00862000
         ST    @01,I                                               0403 00863000
*    J = I/(60*10);                                        /*@0001VLS*/ 00864000
         LR    @08,@01                                             0404 00865000
         SRDA  @08,32                                              0404 00866000
         D     @08,@CF01714                                        0404 00867000
         ST    @09,J                                               0404 00868000
*    CALL CONVBIN2(J,ERRORMM);                             /*@0001VLS*/ 00869000
         LA    @01,@AL00405                                        0405 00870000
         BAL   @14,CONVBIN2                                        0405 00871000
*    I = I - J*60*10;                                      /*@0001VLS*/ 00872000
         L     @06,J                                               0406 00873000
         MH    @06,@CH01714                                        0406 00874000
         LCR   @06,@06                                             0406 00875000
         AL    @06,I                                               0406 00876000
         ST    @06,I                                               0406 00877000
*    J = I/10;                                             /*@0001VLS*/ 00878000
         LR    @00,@06                                             0407 00879000
         SRDA  @00,32                                              0407 00880000
         D     @00,@CF00035                                        0407 00881000
         ST    @01,J                                               0407 00882000
*    CALL CONVBIN2(J,ERRORSS);                             /*@0001VLS*/ 00883000
         LA    @01,@AL00408                                        0408 00884000
         BAL   @14,CONVBIN2                                        0408 00885000
*    I = I - J*10;                                         /*@0001VLS*/ 00886000
         L     @06,J                                               0409 00887000
         MH    @06,@CH00035                                        0409 00888000
         LCR   @06,@06                                             0409 00889000
         AL    @06,I                                               0409 00890000
         ST    @06,I                                               0409 00891000
*    CALL CONVBIN2(I,ERRORTH);                             /*@0001VLS*/ 00892000
         LA    @01,@AL00410                                        0410 00893000
         BAL   @14,CONVBIN2                                        0410 00894000
*  IF ERRORMM(1) = BLANK THEN                                      0411 00895000
         CLI   ERRORMM,C' '                                        0411 00896000
         BNE   @RF00411                                            0411 00897000
*     ERRORMM(1) = CHARS(1);                               /*@VS48736*/ 00898000
         MVC   ERRORMM(1),CHARS                                    0412 00899000
*  IF ERRORSS(1) = BLANK THEN                                      0413 00900000
@RF00411 CLI   ERRORSS,C' '                                        0413 00901000
         BNE   @RF00413                                            0413 00902000
*     ERRORSS(1) = CHARS(1);                               /*@VS48736*/ 00903000
         MVC   ERRORSS(1),CHARS                                    0414 00904000
*  IF ERRORTH(1) = BLANK THEN                                      0415 00905000
@RF00413 CLI   ERRORTH,C' '                                        0415 00906000
         BNE   @RF00415                                            0415 00907000
*     ERRORTH(1) = CHARS(1);                               /*@VS48736*/ 00908000
         MVC   ERRORTH(1),CHARS                                    0416 00909000
*    CALL PRINTER(LINE4B);                                 /*@0001VLS*/ 00910000
@RF00415 LA    @01,@AL00417                                        0417 00911000
         BAL   @14,PRINTER                                         0417 00912000
*  END;                                                    /*@0001VLS*/ 00913000
*ELSE                                                              0419 00914000
*  CALL PRINTER(LINE4A);                                   /*@0001VLS*/ 00915000
         B     @RC00394                                            0419 00916000
@RF00394 LA    @01,@AL00419                                        0419 00917000
         BAL   @14,PRINTER                                         0419 00918000
*CALL PRINTER(BLINE);                                      /*@0001VLS*/ 00919000
@RC00394 LA    @01,@AL00420                                        0420 00920000
         BAL   @14,PRINTER                                         0420 00921000
*CALL CONVERT(LRBMMOSW,WORK,8);                            /*@0001VLS*/ 00922000
         MVC   @AL00001+4(8),@AL00421                              0421 00923000
         LA    @06,LRBMMOSW(,R7)                                   0421 00924000
         ST    @06,@AL00001                                        0421 00925000
         LA    @01,@AL00001                                        0421 00926000
         BAL   @14,CONVERT                                         0421 00927000
*DO I = 1 TO 8;                                            /*@0001VLS*/ 00928000
         LA    @06,1                                               0422 00929000
         ST    @06,I                                               0422 00930000
@DL00422 DS    0H                                                  0423 00931000
*  MCKPSW(I) = WORK(2*I-1:2*I);                            /*@0001VLS*/ 00932000
         LR    @04,@06                                             0423 00933000
         MH    @04,@CH00076                                        0423 00934000
         LA    @01,MCKPSW-3(@04)                                   0423 00935000
         LR    @04,@06                                             0423 00936000
         ALR   @04,@04                                             0423 00937000
         LA    @15,WORK-2(@04)                                     0423 00938000
         MVC   0(2,@01),0(@15)                                     0423 00939000
*END;                                                      /*@0001VLS*/ 00940000
         AH    @06,@CH00055                                        0424 00941000
         ST    @06,I                                               0424 00942000
         CH    @06,@CH00066                                        0424 00943000
         BNH   @DL00422                                            0424 00944000
*CALL PRINTER(LINE5);                                      /*@0001VLS*/ 00945000
         LA    @01,@AL00425                                        0425 00946000
         BAL   @14,PRINTER                                         0425 00947000
*CALL PRINTER(BLINE);                                      /*@0001VLS*/ 00948000
         LA    @01,@AL00426                                        0426 00949000
         BAL   @14,PRINTER                                         0426 00950000
*IF LRBHSYS1 = ON THEN                                             0427 00951000
         TM    LRBHSYS1(R7),B'10000000'                            0427 00952000
         BNO   @RF00427                                            0427 00953000
*  DO;                                                     /*@0001VLS*/ 00954000
*    CALL PRINTER(LINE6A);                                 /*@0001VLS*/ 00955000
         LA    @01,@AL00429                                        0429 00956000
         BAL   @14,PRINTER                                         0429 00957000
*    CALL CONVERT(LRBRLEN,RECLEN,4);                       /*@0001VLS*/ 00958000
         MVC   @AL00001+4(8),@AL00430                              0430 00959000
         LA    @06,LRBRLEN(,R7)                                    0430 00960000
         ST    @06,@AL00001                                        0430 00961000
         LA    @01,@AL00001                                        0430 00962000
         BAL   @14,CONVERT                                         0430 00963000
*    CALL CONVERT(LRBWAIT,WAITCODE,4);                     /*@0001VLS*/ 00964000
         MVC   @AL00001+4(8),@AL00431                              0431 00965000
         LA    @06,LRBWAIT(,R7)                                    0431 00966000
         ST    @06,@AL00001                                        0431 00967000
         LA    @01,@AL00001                                        0431 00968000
         BAL   @14,CONVERT                                         0431 00969000
*    CALL PRINTER(LINE6C);                                 /*@0001VLS*/ 00970000
         LA    @01,@AL00432                                        0432 00971000
         BAL   @14,PRINTER                                         0432 00972000
*  END;                                                    /*@0001VLS*/ 00973000
*ELSE                                                              0434 00974000
*  DO;                                                     /*@0001VLS*/ 00975000
         B     @RC00427                                            0434 00976000
@RF00427 DS    0H                                                  0435 00977000
*    JOBNAME = LRBJOBID;                                   /*@0001VLS*/ 00978000
         MVC   JOBNAME(8),LRBJOBID(R7)                             0435 00979000
*    CALL PRINTER(LINE6B1);                                /*@0001VLS*/ 00980000
         LA    @01,@AL00436                                        0436 00981000
         BAL   @14,PRINTER                                         0436 00982000
*    CALL PRINTER(BLINE);                                  /*@0001VLS*/ 00983000
         LA    @01,@AL00437                                        0437 00984000
         BAL   @14,PRINTER                                         0437 00985000
*    IFCESUMS = LRBPRGID;                                  /*@0001VLS*/ 00986000
         MVC   IFCESUMS(8),LRBPRGID(R7)                            0438 00987000
*    CALL PRINTER(LINE6B2);                                /*@0001VLS*/ 00988000
         LA    @01,@AL00439                                        0439 00989000
         BAL   @14,PRINTER                                         0439 00990000
*  END;                                                    /*@0001VLS*/ 00991000
*CALL PRINTER(BLINE);                                      /*@0001VLS*/ 00992000
@RC00427 LA    @01,@AL00441                                        0441 00993000
         BAL   @14,PRINTER                                         0441 00994000
*CALL PRINTER(LINE7);                                      /*@0001VLS*/ 00995000
         LA    @01,@AL00442                                        0442 00996000
         BAL   @14,PRINTER                                         0442 00997000
*CALL CONVERT (LRBHDATE,WORK,4);                           /*@0001VLS*/ 00998000
         MVC   @AL00001+4(8),@AL00443                              0443 00999000
         LA    @06,LRBHDATE(,R7)                                   0443 01000000
         ST    @06,@AL00001                                        0443 01001000
         LA    @01,@AL00001                                        0443 01002000
         BAL   @14,CONVERT                                         0443 01003000
*DAY(1:3) = WORK(5:7);                                     /*@0001VLS*/ 01004000
         MVC   DAY(3),WORK+4                                       0444 01005000
*YEAR(1:2) = WORK(3:4);                                    /*@0001VLS*/ 01006000
         MVC   YEAR(2),WORK+2                                      0445 01007000
*CALL CONVERT(LRBHTIME,WORK,4);                            /*@0001VLS*/ 01008000
         MVC   @AL00001+4(8),@AL00446                              0446 01009000
         LA    @06,LRBHTIME(,R7)                                   0446 01010000
         ST    @06,@AL00001                                        0446 01011000
         LA    @01,@AL00001                                        0446 01012000
         BAL   @14,CONVERT                                         0446 01013000
*TIMEHH = WORK(1:2);                                       /*@0001VLS*/ 01014000
         MVI   TIMEHH+2,C' '                                       0447 01015000
         MVC   TIMEHH(2),WORK                                      0447 01016000
*TIMEMM = WORK(3:4);                                       /*@0001VLS*/ 01017000
         MVI   TIMEMM+2,C' '                                       0448 01018000
         MVC   TIMEMM(2),WORK+2                                    0448 01019000
*TIMESS = WORK(5:6);                                       /*@0001VLS*/ 01020000
         MVI   TIMESS+2,C' '                                       0449 01021000
         MVC   TIMESS(2),WORK+4                                    0449 01022000
*TIMETH = WORK(7:8);                                       /*@0001VLS*/ 01023000
         MVC   TIMETH(2),WORK+6                                    0450 01024000
*CALL PRINTER(LINE8);                                      /*@0001VLS*/ 01025000
         LA    @01,@AL00451                                        0451 01026000
         BAL   @14,PRINTER                                         0451 01027000
*CALL PRINTER(BLINE);                                      /*@0001VLS*/ 01028000
         LA    @01,@AL00452                                        0452 01029000
         BAL   @14,PRINTER                                         0452 01030000
*CALL PRINTER(LINE9);                                      /*@0001VLS*/ 01031000
         LA    @01,@AL00453                                        0453 01032000
         BAL   @14,PRINTER                                         0453 01033000
*CALL PRINTER(BLINE);                                      /*@0001VLS*/ 01034000
         LA    @01,@AL00454                                        0454 01035000
         BAL   @14,PRINTER                                         0454 01036000
*CALL PRINTER(LINE10);                                     /*@0001VLS*/ 01037000
         LA    @01,@AL00455                                        0455 01038000
         BAL   @14,PRINTER                                         0455 01039000
*IF LRBMFSD = ON THEN                                              0456 01040000
         TM    LRBMFSD(R7),B'10000000'                             0456 01041000
         BNO   @RF00456                                            0456 01042000
*  SDAMAGE = FOXONE;                                       /*@0001VLS*/ 01043000
         MVI   SDAMAGE,C'1'                                        0457 01044000
*ELSE                                                              0458 01045000
*  SDAMAGE = FOXZERO;                                      /*@0001VLS*/ 01046000
         B     @RC00456                                            0458 01047000
@RF00456 MVI   SDAMAGE,C'0'                                        0458 01048000
*IF LRBMFPD = ON THEN                                              0459 01049000
@RC00456 TM    LRBMFPD(R7),B'01000000'                             0459 01050000
         BNO   @RF00459                                            0459 01051000
*  IDAMAGE = FOXONE;                                       /*@0001VLS*/ 01052000
         MVI   IDAMAGE,C'1'                                        0460 01053000
*ELSE                                                              0461 01054000
*  IDAMAGE = FOXZERO;                                      /*@0001VLS*/ 01055000
         B     @RC00459                                            0461 01056000
@RF00459 MVI   IDAMAGE,C'0'                                        0461 01057000
*CALL PRINTER(LINE11);                                     /*@0001VLS*/ 01058000
@RC00459 LA    @01,@AL00462                                        0462 01059000
         BAL   @14,PRINTER                                         0462 01060000
*IF LRBMFSR = ON THEN                                              0463 01061000
         TM    LRBMFSR(R7),B'00100000'                             0463 01062000
         BNO   @RF00463                                            0463 01063000
*  SRECO = FOXONE;                                         /*@0001VLS*/ 01064000
         MVI   SRECO,C'1'                                          0464 01065000
*ELSE                                                              0465 01066000
*  SRECO = FOXZERO;                                        /*@0001VLS*/ 01067000
         B     @RC00463                                            0465 01068000
@RF00463 MVI   SRECO,C'0'                                          0465 01069000
*IF LRBMFTD = ON THEN                                              0466 01070000
@RC00463 TM    LRBMFTD(R7),B'00010000'                             0466 01071000
         BNO   @RF00466                                            0466 01072000
*  TDAMAGE = FOXONE;                                       /*@0001VLS*/ 01073000
         MVI   TDAMAGE,C'1'                                        0467 01074000
*ELSE                                                              0468 01075000
*  TDAMAGE = FOXZERO;                                      /*@0001VLS*/ 01076000
         B     @RC00466                                            0468 01077000
@RF00466 MVI   TDAMAGE,C'0'                                        0468 01078000
*CALL PRINTER(LINE12);                                     /*@0001VLS*/ 01079000
@RC00466 LA    @01,@AL00469                                        0469 01080000
         BAL   @14,PRINTER                                         0469 01081000
*IF LRBMFCD = ON THEN                                              0470 01082000
         TM    LRBMFCD(R7),B'00001000'                             0470 01083000
         BNO   @RF00470                                            0470 01084000
*  CDAMAGE = FOXONE;                                       /*@0001VLS*/ 01085000
         MVI   CDAMAGE,C'1'                                        0471 01086000
*ELSE                                                              0472 01087000
*  CDAMAGE = FOXZERO;                                      /*@0001VLS*/ 01088000
         B     @RC00470                                            0472 01089000
@RF00470 MVI   CDAMAGE,C'0'                                        0472 01090000
*IF LRBMFED = ON THEN                                              0473 01091000
@RC00470 TM    LRBMFED(R7),B'00000100'                             0473 01092000
         BNO   @RF00473                                            0473 01093000
*  EDAMAGE = FOXONE;                                       /*@0001VLS*/ 01094000
         MVI   EDAMAGE,C'1'                                        0474 01095000
*ELSE                                                              0475 01096000
*  EDAMAGE = FOXZERO;                                      /*@0001VLS*/ 01097000
         B     @RC00473                                            0475 01098000
@RF00473 MVI   EDAMAGE,C'0'                                        0475 01099000
*CALL PRINTER(LINE13);                                     /*@0001VLS*/ 01100000
@RC00473 LA    @01,@AL00476                                        0476 01101000
         BAL   @14,PRINTER                                         0476 01102000
*IF LRBMFDG = ON THEN                                              0477 01103000
         TM    LRBMFDG(R7),B'00000001'                             0477 01104000
         BNO   @RF00477                                            0477 01105000
*  DEGRAD = FOXONE;                                        /*@0001VLS*/ 01106000
         MVI   DEGRAD,C'1'                                         0478 01107000
*ELSE                                                              0479 01108000
*  DEGRAD = FOXZERO;                                       /*@0001VLS*/ 01109000
         B     @RC00477                                            0479 01110000
@RF00477 MVI   DEGRAD,C'0'                                         0479 01111000
*IF LRBMFWN = ON THEN                                              0480 01112000
@RC00477 TM    LRBMFWN(R7),B'10000000'                             0480 01113000
         BNO   @RF00480                                            0480 01114000
*  WARNING = FOXONE;                                       /*@0001VLS*/ 01115000
         MVI   WARNING,C'1'                                        0481 01116000
*ELSE                                                              0482 01117000
*  WARNING = FOXZERO;                                      /*@0001VLS*/ 01118000
         B     @RC00480                                            0482 01119000
@RF00480 MVI   WARNING,C'0'                                        0482 01120000
*CALL PRINTER(LINE14);                                     /*@0001VLS*/ 01121000
@RC00480 LA    @01,@AL00483                                        0483 01122000
         BAL   @14,PRINTER                                         0483 01123000
*CALL PRINTER(LINE15);                                     /*@0001VLS*/ 01124000
         LA    @01,@AL00484                                        0484 01125000
         BAL   @14,PRINTER                                         0484 01126000
*IF LRBMIBU = ON THEN                                              0485 01127000
         TM    LRBMIBU(R7),B'00000010'                             0485 01128000
         BNO   @RF00485                                            0485 01129000
*  BACKED = FOXONE;                                        /*@0001VLS*/ 01130000
         MVI   BACKED,C'1'                                         0486 01131000
*ELSE                                                              0487 01132000
*  BACKED = FOXZERO;                                       /*@0001VLS*/ 01133000
         B     @RC00485                                            0487 01134000
@RF00485 MVI   BACKED,C'0'                                         0487 01135000
*IF LRBMIDY = ON THEN                                              0488 01136000
@RC00485 TM    LRBMIDY(R7),B'00000001'                             0488 01137000
         BNO   @RF00488                                            0488 01138000
*  DELAYED = FOXONE;                                       /*@0001VLS*/ 01139000
         MVI   DELAYED,C'1'                                        0489 01140000
*ELSE                                                              0490 01141000
*  DELAYED = FOXZERO;                                      /*@0001VLS*/ 01142000
         B     @RC00488                                            0490 01143000
@RF00488 MVI   DELAYED,C'0'                                        0490 01144000
*CALL PRINTER(LINE16);                                     /*@0001VLS*/ 01145000
@RC00488 LA    @01,@AL00491                                        0491 01146000
         BAL   @14,PRINTER                                         0491 01147000
*CALL PRINTER(LINE17);                                     /*@0001VLS*/ 01148000
         LA    @01,@AL00492                                        0492 01149000
         BAL   @14,PRINTER                                         0492 01150000
*IF LRBMFSE = ON THEN                                              0493 01151000
         TM    LRBMFSE(R7),B'10000000'                             0493 01152000
         BNO   @RF00493                                            0493 01153000
*  SERRORU = FOXONE;                                       /*@0001VLS*/ 01154000
         MVI   SERRORU,C'1'                                        0494 01155000
*ELSE                                                              0495 01156000
*  SERRORU = FOXZERO;                                      /*@0001VLS*/ 01157000
         B     @RC00493                                            0495 01158000
@RF00493 MVI   SERRORU,C'0'                                        0495 01159000
*IF LRBMFSC = ON THEN                                              0496 01160000
@RC00493 TM    LRBMFSC(R7),B'01000000'                             0496 01161000
         BNO   @RF00496                                            0496 01162000
*  SERRORC = FOXONE;                                       /*@0001VLS*/ 01163000
         MVI   SERRORC,C'1'                                        0497 01164000
*ELSE                                                              0498 01165000
*  SERRORC = FOXZERO;                                      /*@0001VLS*/ 01166000
         B     @RC00496                                            0498 01167000
@RF00496 MVI   SERRORC,C'0'                                        0498 01168000
*CALL PRINTER(LINE18);                                     /*@0001VLS*/ 01169000
@RC00496 LA    @01,@AL00499                                        0499 01170000
         BAL   @14,PRINTER                                         0499 01171000
*IF LRBMFKE = ON THEN                                              0500 01172000
         TM    LRBMFKE(R7),B'00100000'                             0500 01173000
         BNO   @RF00500                                            0500 01174000
*  SKEYERR = FOXONE;                                       /*@0001VLS*/ 01175000
         MVI   SKEYERR,C'1'                                        0501 01176000
*ELSE                                                              0502 01177000
*  SKEYERR = FOXZERO;                                      /*@0001VLS*/ 01178000
         B     @RC00500                                            0502 01179000
@RF00500 MVI   SKEYERR,C'0'                                        0502 01180000
*CALL PRINTER(LINE19);                                     /*@0001VLS*/ 01181000
@RC00500 LA    @01,@AL00503                                        0503 01182000
         BAL   @14,PRINTER                                         0503 01183000
*CALL PRINTER(LINE20);                                     /*@0001VLS*/ 01184000
         LA    @01,@AL00504                                        0504 01185000
         BAL   @14,PRINTER                                         0504 01186000
*IF LRBMVWP = ON THEN                                              0505 01187000
         TM    LRBMVWP(R7),B'00001000'                             0505 01188000
         BNO   @RF00505                                            0505 01189000
*  PSWEMWP = FOXONE;                                       /*@0001VLS*/ 01190000
         MVI   PSWEMWP,C'1'                                        0506 01191000
*ELSE                                                              0507 01192000
*  PSWEMWP = FOXZERO;                                      /*@0001VLS*/ 01193000
         B     @RC00505                                            0507 01194000
@RF00505 MVI   PSWEMWP,C'0'                                        0507 01195000
*IF LRBMVMS = ON THEN                                              0508 01196000
@RC00505 TM    LRBMVMS(R7),B'00000100'                             0508 01197000
         BNO   @RF00508                                            0508 01198000
*  PSWMASK = FOXONE;                                       /*@0001VLS*/ 01199000
         MVI   PSWMASK,C'1'                                        0509 01200000
*ELSE                                                              0510 01201000
*  PSWMASK = FOXZERO;                                      /*@0001VLS*/ 01202000
         B     @RC00508                                            0510 01203000
@RF00508 MVI   PSWMASK,C'0'                                        0510 01204000
*CALL PRINTER(LINE21);                                     /*@0001VLS*/ 01205000
@RC00508 LA    @01,@AL00511                                        0511 01206000
         BAL   @14,PRINTER                                         0511 01207000
*IF LRBMVPM = ON THEN                                              0512 01208000
         TM    LRBMVPM(R7),B'00000010'                             0512 01209000
         BNO   @RF00512                                            0512 01210000
*  PSWCODE = FOXONE;                                       /*@0001VLS*/ 01211000
         MVI   PSWCODE,C'1'                                        0513 01212000
*ELSE                                                              0514 01213000
*  PSWCODE = FOXZERO;                                      /*@0001VLS*/ 01214000
         B     @RC00512                                            0514 01215000
@RF00512 MVI   PSWCODE,C'0'                                        0514 01216000
*IF LRBMVIA = ON THEN                                              0515 01217000
@RC00512 TM    LRBMVIA(R7),B'00000001'                             0515 01218000
         BNO   @RF00515                                            0515 01219000
*  INSTADD = FOXONE;                                       /*@0001VLS*/ 01220000
         MVI   INSTADD,C'1'                                        0516 01221000
*ELSE                                                              0517 01222000
*  INSTADD = FOXZERO;                                      /*@0001VLS*/ 01223000
         B     @RC00515                                            0517 01224000
@RF00515 MVI   INSTADD,C'0'                                        0517 01225000
*CALL PRINTER(LINE22);                                     /*@0001VLS*/ 01226000
@RC00515 LA    @01,@AL00518                                        0518 01227000
         BAL   @14,PRINTER                                         0518 01228000
*IF LRBMVFA = ON THEN                                              0519 01229000
         TM    LRBMVFA(R7),B'10000000'                             0519 01230000
         BNO   @RF00519                                            0519 01231000
*  FAILADD = FOXONE;                                       /*@0001VLS*/ 01232000
         MVI   FAILADD,C'1'                                        0520 01233000
*ELSE                                                              0521 01234000
*  FAILADD = FOXZERO;                                      /*@0001VLS*/ 01235000
         B     @RC00519                                            0521 01236000
@RF00519 MVI   FAILADD,C'0'                                        0521 01237000
*IF LRBMVRC = ON THEN                                              0522 01238000
@RC00519 TM    LRBMVRC(R7),B'01000000'                             0522 01239000
         BNO   @RF00522                                            0522 01240000
*  RGNCODE = FOXONE;                                       /*@0001VLS*/ 01241000
         MVI   RGNCODE,C'1'                                        0523 01242000
*ELSE                                                              0524 01243000
*  RGNCODE = FOXZERO;                                      /*@0001VLS*/ 01244000
         B     @RC00522                                            0524 01245000
@RF00522 MVI   RGNCODE,C'0'                                        0524 01246000
*CALL PRINTER(LINE23);                                     /*@0001VLS*/ 01247000
@RC00522 LA    @01,@AL00525                                        0525 01248000
         BAL   @14,PRINTER                                         0525 01249000
*IF LRBMVFP = ON THEN                                              0526 01250000
         TM    LRBMVFP(R7),B'00010000'                             0526 01251000
         BNO   @RF00526                                            0526 01252000
*  FPREGS = FOXONE;                                        /*@0001VLS*/ 01253000
         MVI   FPREGS,C'1'                                         0527 01254000
*ELSE                                                              0528 01255000
*  FPREGS = FOXZERO;                                       /*@0001VLS*/ 01256000
         B     @RC00526                                            0528 01257000
@RF00526 MVI   FPREGS,C'0'                                         0528 01258000
*IF LRBMVGR = ON THEN                                              0529 01259000
@RC00526 TM    LRBMVGR(R7),B'00001000'                             0529 01260000
         BNO   @RF00529                                            0529 01261000
*  GPREGS = FOXONE;                                        /*@0001VLS*/ 01262000
         MVI   GPREGS,C'1'                                         0530 01263000
*ELSE                                                              0531 01264000
*  GPREGS = FOXZERO;                                       /*@0001VLS*/ 01265000
         B     @RC00529                                            0531 01266000
@RF00529 MVI   GPREGS,C'0'                                         0531 01267000
*CALL PRINTER(LINE24);                                     /*@0001VLS*/ 01268000
@RC00529 LA    @01,@AL00532                                        0532 01269000
         BAL   @14,PRINTER                                         0532 01270000
*IF LRBMVCR = ON THEN                                              0533 01271000
         TM    LRBMVCR(R7),B'00000100'                             0533 01272000
         BNO   @RF00533                                            0533 01273000
*  CREGS = FOXONE;                                         /*@0001VLS*/ 01274000
         MVI   CREGS,C'1'                                          0534 01275000
*ELSE                                                              0535 01276000
*  CREGS = FOXZERO;                                        /*@0001VLS*/ 01277000
         B     @RC00533                                            0535 01278000
@RF00533 MVI   CREGS,C'0'                                          0535 01279000
*IF LRBMVLG = ON THEN                                              0536 01280000
@RC00533 TM    LRBMVLG(R7),B'00000010'                             0536 01281000
         BNO   @RF00536                                            0536 01282000
*  ELOGOUT = FOXONE;                                       /*@0001VLS*/ 01283000
         MVI   ELOGOUT,C'1'                                        0537 01284000
*ELSE                                                              0538 01285000
*  ELOGOUT = FOXZERO;                                      /*@0001VLS*/ 01286000
         B     @RC00536                                            0538 01287000
@RF00536 MVI   ELOGOUT,C'0'                                        0538 01288000
*CALL PRINTER(LINE25);                                     /*@0001VLS*/ 01289000
@RC00536 LA    @01,@AL00539                                        0539 01290000
         BAL   @14,PRINTER                                         0539 01291000
*IF LRBMVST = ON THEN                                              0540 01292000
         TM    LRBMVST(R7),B'00000001'                             0540 01293000
         BNO   @RF00540                                            0540 01294000
*  STLOG = FOXONE;                                         /*@0001VLS*/ 01295000
         MVI   STLOG,C'1'                                          0541 01296000
*ELSE                                                              0542 01297000
*  STLOG = FOXZERO;                                        /*@0001VLS*/ 01298000
         B     @RC00540                                            0542 01299000
@RF00540 MVI   STLOG,C'0'                                          0542 01300000
*IF LRBMVED = ON THEN                                              0543 01301000
@RC00540 TM    LRBMVED(R7),B'00100000'                             0543 01302000
         BNO   @RF00543                                            0543 01303000
*  EDAMCOD = FOXONE;                                       /*@0001VLS*/ 01304000
         MVI   EDAMCOD,C'1'                                        0544 01305000
*ELSE                                                              0545 01306000
*  EDAMCOD = FOXZERO;                                      /*@0001VLS*/ 01307000
         B     @RC00543                                            0545 01308000
@RF00543 MVI   EDAMCOD,C'0'                                        0545 01309000
*CALL PRINTER(LINE26);                                     /*@0001VLS*/ 01310000
@RC00543 LA    @01,@AL00546                                        0546 01311000
         BAL   @14,PRINTER                                         0546 01312000
*IF LRBHTYPE = '13'X THEN                                  /*@VS48642*/ 01313000
         CLI   LRBHTYPE(R7),X'13'                                  0547 01314000
         BNE   @RF00547                                            0547 01315000
*  DO;                                                     /*@VS48642*/ 01316000
*      IF LRBMNVF = ON THEN                                /*@VS48642*/ 01317000
         TM    LRBMNVF(R7),B'10000000'                             0549 01318000
         BNO   @RF00549                                            0549 01319000
*        INVLRB = FOXONE;                                  /*@VS48642*/ 01320000
         MVI   INVLRB,C'1'                                         0550 01321000
*      ELSE                                                /*@VS48642*/ 01322000
*        INVLRB = FOXZERO;                                 /*@VS48642*/ 01323000
         B     @RC00549                                            0551 01324000
@RF00549 MVI   INVLRB,C'0'                                         0551 01325000
*      CALL PRINTER(LINE26A);                              /*@VS48642*/ 01326000
@RC00549 LA    @01,@AL00552                                        0552 01327000
         BAL   @14,PRINTER                                         0552 01328000
*  END;                                                    /*@VS48642*/ 01329000
*CALL CONVERT (LRBMCELL,WORK,2);                           /*@0001VLS*/ 01330000
@RF00547 MVC   @AL00001+4(8),@AL00554                              0554 01331000
         LA    @06,LRBMCELL(,R7)                                   0554 01332000
         ST    @06,@AL00001                                        0554 01333000
         LA    @01,@AL00001                                        0554 01334000
         BAL   @14,CONVERT                                         0554 01335000
*ELOGLEN(1:2) = WORK(1:2);                                 /*@0001VLS*/ 01336000
         MVC   ELOGLEN(2),WORK                                     0555 01337000
*ELOGLEN(4:5) = WORK(3:4);                                 /*@0001VLS*/ 01338000
         MVC   ELOGLEN+3(2),WORK+2                                 0556 01339000
*CALL PRINTER(LINE27);                                     /*@0001VLS*/ 01340000
         LA    @01,@AL00557                                        0557 01341000
         BAL   @14,PRINTER                                         0557 01342000
*IF LRBMCHST = ON THEN                                             0558 01343000
         TM    LRBMCHST(R7),B'10000000'                            0558 01344000
         BNO   @RF00558                                            0558 01345000
*  DO;                                                     /*@0001VLS*/ 01346000
*    CALL CONVERT (LRBMF1,WORK,14);                        /*@0001VLS*/ 01347000
         MVC   @AL00001+4(8),@AL00560                              0560 01348000
         LA    @06,LRBMF1(,R7)                                     0560 01349000
         ST    @06,@AL00001                                        0560 01350000
         LA    @01,@AL00001                                        0560 01351000
         BAL   @14,CONVERT                                         0560 01352000
*    DO I = 1 TO 14;                                       /*@0001VLS*/ 01353000
         LA    @06,1                                               0561 01354000
         ST    @06,I                                               0561 01355000
@DL00561 DS    0H                                                  0562 01356000
*      MCSTAT(I) = WORK(2*I-1:2*I);                        /*@0001VLS*/ 01357000
         LR    @04,@06                                             0562 01358000
         MH    @04,@CH00076                                        0562 01359000
         LA    @01,MCSTAT-3(@04)                                   0562 01360000
         LR    @04,@06                                             0562 01361000
         ALR   @04,@04                                             0562 01362000
         LA    @15,WORK-2(@04)                                     0562 01363000
         MVC   0(2,@01),0(@15)                                     0562 01364000
*    END;                                                  /*@0001VLS*/ 01365000
         AH    @06,@CH00055                                        0563 01366000
         ST    @06,I                                               0563 01367000
         CH    @06,@CH00532                                        0563 01368000
         BNH   @DL00561                                            0563 01369000
*    CALL PRINTER(LINE28A);                                /*@0001VLS*/ 01370000
         LA    @01,@AL00564                                        0564 01371000
         BAL   @14,PRINTER                                         0564 01372000
*  END;                                                    /*@0001VLS*/ 01373000
*ELSE                                                              0566 01374000
*  DO;                                                     /*@0001VLS*/ 01375000
         B     @RC00558                                            0566 01376000
@RF00558 DS    0H                                                  0567 01377000
*    CALL EXTDAM;                                          /*@0001VLS*/ 01378000
         BAL   @14,EXTDAM                                          0567 01379000
*    CALL PRINTER(BLINE);                                  /*@0001VLS*/ 01380000
         LA    @01,@AL00568                                        0568 01381000
         BAL   @14,PRINTER                                         0568 01382000
*    CALL PRINTER(LINE28B);                                /*@0001VLS*/ 01383000
         LA    @01,@AL00569                                        0569 01384000
         BAL   @14,PRINTER                                         0569 01385000
*    CALL PRINTER(BLINE);                                  /*@0001VLS*/ 01386000
         LA    @01,@AL00570                                        0570 01387000
         BAL   @14,PRINTER                                         0570 01388000
*    CALL CONVERT (LRBMCIC,WORK,8);                        /*@0001VLS*/ 01389000
         MVC   @AL00001+4(8),@AL00571                              0571 01390000
         LA    @06,LRBMCIC(,R7)                                    0571 01391000
         ST    @06,@AL00001                                        0571 01392000
         LA    @01,@AL00001                                        0571 01393000
         BAL   @14,CONVERT                                         0571 01394000
*    DO I = 1 TO 8;                                        /*@0001VLS*/ 01395000
         LA    @06,1                                               0572 01396000
         ST    @06,I                                               0572 01397000
@DL00572 DS    0H                                                  0573 01398000
*      MKINT(I) = WORK(2*I-1:2*I);                         /*@0001VLS*/ 01399000
         LR    @04,@06                                             0573 01400000
         MH    @04,@CH00076                                        0573 01401000
         LA    @01,MKINT-3(@04)                                    0573 01402000
         LR    @04,@06                                             0573 01403000
         ALR   @04,@04                                             0573 01404000
         LA    @15,WORK-2(@04)                                     0573 01405000
         MVC   0(2,@01),0(@15)                                     0573 01406000
*    END;                                                  /*@0001VLS*/ 01407000
         AH    @06,@CH00055                                        0574 01408000
         ST    @06,I                                               0574 01409000
         CH    @06,@CH00066                                        0574 01410000
         BNH   @DL00572                                            0574 01411000
*    CALL PRINTER(LINE29);                                 /*@0001VLS*/ 01412000
         LA    @01,@AL00575                                        0575 01413000
         BAL   @14,PRINTER                                         0575 01414000
*    CALL PRINTER(BLINE);                                  /*@0001VLS*/ 01415000
         LA    @01,@AL00576                                        0576 01416000
         BAL   @14,PRINTER                                         0576 01417000
*    CALL PRINTER(BLINE);                                  /*@0001VLS*/ 01418000
         LA    @01,@AL00577                                        0577 01419000
         BAL   @14,PRINTER                                         0577 01420000
*    CALL PRINTER(LINE36);                                 /*@0001VLS*/ 01421000
         LA    @01,@AL00578                                        0578 01422000
         BAL   @14,PRINTER                                         0578 01423000
*    CALL CONVERT (LRBFPR,WORK,16);                        /*@0001VLS*/ 01424000
         MVC   @AL00001+4(8),@AL00579                              0579 01425000
         LA    @06,LRBFPR(,R7)                                     0579 01426000
         ST    @06,@AL00001                                        0579 01427000
         LA    @01,@AL00001                                        0579 01428000
         BAL   @14,CONVERT                                         0579 01429000
*    DO I = 1 TO 8;                                        /*@0001VLS*/ 01430000
         LA    @06,1                                               0580 01431000
         ST    @06,I                                               0580 01432000
@DL00580 DS    0H                                                  0581 01433000
*      FPR0(I) = WORK(2*I-1:2*I);                          /*@0001VLS*/ 01434000
         LR    @04,@06                                             0581 01435000
         MH    @04,@CH00076                                        0581 01436000
         LA    @01,FPR0-3(@04)                                     0581 01437000
         LR    @15,@06                                             0581 01438000
         ALR   @15,@15                                             0581 01439000
         LA    @14,WORK-2(@15)                                     0581 01440000
         MVC   0(2,@01),0(@14)                                     0581 01441000
*      FPR2(I) = WORK(16+2*I-1:16+2*I);                    /*@0001VLS*/ 01442000
         LA    @01,FPR2-3(@04)                                     0582 01443000
         LA    @04,WORK+14(@15)                                    0582 01444000
         MVC   0(2,@01),0(@04)                                     0582 01445000
*    END;                                                  /*@0001VLS*/ 01446000
         AH    @06,@CH00055                                        0583 01447000
         ST    @06,I                                               0583 01448000
         CH    @06,@CH00066                                        0583 01449000
         BNH   @DL00580                                            0583 01450000
*    CALL PRINTER(LINE37);                                 /*@0001VLS*/ 01451000
         LA    @01,@AL00584                                        0584 01452000
         BAL   @14,PRINTER                                         0584 01453000
*    CALL CONVERT (LRBFPR(17),WORK,16);                    /*@0001VLS*/ 01454000
         MVC   @AL00001+4(8),@AL00585                              0585 01455000
         LA    @06,LRBFPR+16(,R7)                                  0585 01456000
         ST    @06,@AL00001                                        0585 01457000
         LA    @01,@AL00001                                        0585 01458000
         BAL   @14,CONVERT                                         0585 01459000
*    DO I = 1 TO 8;                                        /*@0001VLS*/ 01460000
         LA    @06,1                                               0586 01461000
         ST    @06,I                                               0586 01462000
@DL00586 DS    0H                                                  0587 01463000
*      FPR4(I) = WORK(2*I-1:2*I);                          /*@0001VLS*/ 01464000
         LR    @04,@06                                             0587 01465000
         MH    @04,@CH00076                                        0587 01466000
         LA    @01,FPR4-3(@04)                                     0587 01467000
         LR    @15,@06                                             0587 01468000
         ALR   @15,@15                                             0587 01469000
         LA    @14,WORK-2(@15)                                     0587 01470000
         MVC   0(2,@01),0(@14)                                     0587 01471000
*      FPR6(I) = WORK(16+2*I-1:16+2*I);                    /*@0001VLS*/ 01472000
         LA    @01,FPR6-3(@04)                                     0588 01473000
         LA    @04,WORK+14(@15)                                    0588 01474000
         MVC   0(2,@01),0(@04)                                     0588 01475000
*    END;                                                  /*@0001VLS*/ 01476000
         AH    @06,@CH00055                                        0589 01477000
         ST    @06,I                                               0589 01478000
         CH    @06,@CH00066                                        0589 01479000
         BNH   @DL00586                                            0589 01480000
*    CALL PRINTER(LINE38);                                 /*@0001VLS*/ 01481000
         LA    @01,@AL00590                                        0590 01482000
         BAL   @14,PRINTER                                         0590 01483000
*    CALL PRINTER(BLINE);                                  /*@0001VLS*/ 01484000
         LA    @01,@AL00591                                        0591 01485000
         BAL   @14,PRINTER                                         0591 01486000
*    CALL CONVERT (LRBGPR,WORK,16);                        /*@0001VLS*/ 01487000
         MVC   @AL00001+4(8),@AL00592                              0592 01488000
         LA    @06,LRBGPR(,R7)                                     0592 01489000
         ST    @06,@AL00001                                        0592 01490000
         LA    @01,@AL00001                                        0592 01491000
         BAL   @14,CONVERT                                         0592 01492000
*    DO I = 1 TO 4;                                        /*@0001VLS*/ 01493000
         LA    @06,1                                               0593 01494000
         ST    @06,I                                               0593 01495000
@DL00593 DS    0H                                                  0594 01496000
*      GPR0(I) = WORK(2*I-1:2*I);                          /*@0001VLS*/ 01497000
         LR    @04,@06                                             0594 01498000
         MH    @04,@CH00076                                        0594 01499000
         LA    @01,GPR0-3(@04)                                     0594 01500000
         LR    @15,@06                                             0594 01501000
         ALR   @15,@15                                             0594 01502000
         LA    @14,WORK-2(@15)                                     0594 01503000
         MVC   0(2,@01),0(@14)                                     0594 01504000
*      GPR1(I) = WORK(8+2*I-1:8+2*I);                      /*@0001VLS*/ 01505000
         LA    @01,GPR1-3(@04)                                     0595 01506000
         LA    @14,WORK+6(@15)                                     0595 01507000
         MVC   0(2,@01),0(@14)                                     0595 01508000
*      GPR2(I) = WORK(16+2*I-1:16+2*I);                    /*@0001VLS*/ 01509000
         LA    @01,GPR2-3(@04)                                     0596 01510000
         LA    @14,WORK+14(@15)                                    0596 01511000
         MVC   0(2,@01),0(@14)                                     0596 01512000
*      GPR3(I) = WORK(24+2*I-1:24+2*I);                    /*@0001VLS*/ 01513000
         LA    @01,GPR3-3(@04)                                     0597 01514000
         LA    @04,WORK+22(@15)                                    0597 01515000
         MVC   0(2,@01),0(@04)                                     0597 01516000
*    END;                                                  /*@0001VLS*/ 01517000
         AH    @06,@CH00055                                        0598 01518000
         ST    @06,I                                               0598 01519000
         CH    @06,@CH00064                                        0598 01520000
         BNH   @DL00593                                            0598 01521000
*    CALL PRINTER(LINE39);                                 /*@0001VLS*/ 01522000
         LA    @01,@AL00599                                        0599 01523000
         BAL   @14,PRINTER                                         0599 01524000
*    CALL CONVERT (LRBGPR(17),WORK,16);                    /*@0001VLS*/ 01525000
         MVC   @AL00001+4(8),@AL00600                              0600 01526000
         LA    @06,LRBGPR+16(,R7)                                  0600 01527000
         ST    @06,@AL00001                                        0600 01528000
         LA    @01,@AL00001                                        0600 01529000
         BAL   @14,CONVERT                                         0600 01530000
*    DO I = 1 TO 4;                                        /*@0001VLS*/ 01531000
         LA    @06,1                                               0601 01532000
         ST    @06,I                                               0601 01533000
@DL00601 DS    0H                                                  0602 01534000
*      GPR4(I) = WORK(2*I-1:2*I);                          /*@0001VLS*/ 01535000
         LR    @04,@06                                             0602 01536000
         MH    @04,@CH00076                                        0602 01537000
         LA    @01,GPR4-3(@04)                                     0602 01538000
         LR    @15,@06                                             0602 01539000
         ALR   @15,@15                                             0602 01540000
         LA    @14,WORK-2(@15)                                     0602 01541000
         MVC   0(2,@01),0(@14)                                     0602 01542000
*      GPR5(I) = WORK(8+2*I-1:8+2*I);                      /*@0001VLS*/ 01543000
         LA    @01,GPR5-3(@04)                                     0603 01544000
         LA    @14,WORK+6(@15)                                     0603 01545000
         MVC   0(2,@01),0(@14)                                     0603 01546000
*      GPR6(I) = WORK(16+2*I-1:16+2*I);                    /*@0001VLS*/ 01547000
         LA    @01,GPR6-3(@04)                                     0604 01548000
         LA    @14,WORK+14(@15)                                    0604 01549000
         MVC   0(2,@01),0(@14)                                     0604 01550000
*      GPR7(I) = WORK(24+2*I-1:24+2*I);                    /*@0001VLS*/ 01551000
         LA    @01,GPR7-3(@04)                                     0605 01552000
         LA    @04,WORK+22(@15)                                    0605 01553000
         MVC   0(2,@01),0(@04)                                     0605 01554000
*    END;                                                  /*@0001VLS*/ 01555000
         AH    @06,@CH00055                                        0606 01556000
         ST    @06,I                                               0606 01557000
         CH    @06,@CH00064                                        0606 01558000
         BNH   @DL00601                                            0606 01559000
*    CALL PRINTER(LINE40);                                 /*@0001VLS*/ 01560000
         LA    @01,@AL00607                                        0607 01561000
         BAL   @14,PRINTER                                         0607 01562000
*    CALL CONVERT (LRBGPR(33),WORK,16);                    /*@0001VLS*/ 01563000
         MVC   @AL00001+4(8),@AL00608                              0608 01564000
         LA    @06,LRBGPR+32(,R7)                                  0608 01565000
         ST    @06,@AL00001                                        0608 01566000
         LA    @01,@AL00001                                        0608 01567000
         BAL   @14,CONVERT                                         0608 01568000
*    DO I = 1 TO 4;                                        /*@0001VLS*/ 01569000
         LA    @06,1                                               0609 01570000
         ST    @06,I                                               0609 01571000
@DL00609 DS    0H                                                  0610 01572000
*      GPR8(I) = WORK(2*I-1:2*I);                          /*@0001VLS*/ 01573000
         LR    @04,@06                                             0610 01574000
         MH    @04,@CH00076                                        0610 01575000
         LA    @01,GPR8-3(@04)                                     0610 01576000
         LR    @15,@06                                             0610 01577000
         ALR   @15,@15                                             0610 01578000
         LA    @14,WORK-2(@15)                                     0610 01579000
         MVC   0(2,@01),0(@14)                                     0610 01580000
*      GPR9(I) = WORK(8+2*I-1:8+2*I);                      /*@0001VLS*/ 01581000
         LA    @01,GPR9-3(@04)                                     0611 01582000
         LA    @14,WORK+6(@15)                                     0611 01583000
         MVC   0(2,@01),0(@14)                                     0611 01584000
*      GPRA(I) = WORK(16+2*I-1:16+2*I);                    /*@0001VLS*/ 01585000
         LA    @01,GPRA-3(@04)                                     0612 01586000
         LA    @14,WORK+14(@15)                                    0612 01587000
         MVC   0(2,@01),0(@14)                                     0612 01588000
*      GPRB(I) = WORK(24+2*I-1:24+2*I);                    /*@0001VLS*/ 01589000
         LA    @01,GPRB-3(@04)                                     0613 01590000
         LA    @04,WORK+22(@15)                                    0613 01591000
         MVC   0(2,@01),0(@04)                                     0613 01592000
*    END;                                                  /*@0001VLS*/ 01593000
         AH    @06,@CH00055                                        0614 01594000
         ST    @06,I                                               0614 01595000
         CH    @06,@CH00064                                        0614 01596000
         BNH   @DL00609                                            0614 01597000
*    CALL PRINTER(LINE41);                                 /*@0001VLS*/ 01598000
         LA    @01,@AL00615                                        0615 01599000
         BAL   @14,PRINTER                                         0615 01600000
*    CALL CONVERT (LRBGPR(49),WORK,16);                    /*@0001VLS*/ 01601000
         MVC   @AL00001+4(8),@AL00616                              0616 01602000
         LA    @06,LRBGPR+48(,R7)                                  0616 01603000
         ST    @06,@AL00001                                        0616 01604000
         LA    @01,@AL00001                                        0616 01605000
         BAL   @14,CONVERT                                         0616 01606000
*    DO I = 1 TO 4;                                        /*@0001VLS*/ 01607000
         LA    @06,1                                               0617 01608000
         ST    @06,I                                               0617 01609000
@DL00617 DS    0H                                                  0618 01610000
*      GPRC(I) = WORK(2*I-1:2*I);                          /*@0001VLS*/ 01611000
         LR    @04,@06                                             0618 01612000
         MH    @04,@CH00076                                        0618 01613000
         LA    @01,GPRC-3(@04)                                     0618 01614000
         LR    @15,@06                                             0618 01615000
         ALR   @15,@15                                             0618 01616000
         LA    @14,WORK-2(@15)                                     0618 01617000
         MVC   0(2,@01),0(@14)                                     0618 01618000
*      GPRD(I) = WORK(8+2*I-1:8+2*I);                      /*@0001VLS*/ 01619000
         LA    @01,GPRD-3(@04)                                     0619 01620000
         LA    @14,WORK+6(@15)                                     0619 01621000
         MVC   0(2,@01),0(@14)                                     0619 01622000
*      GPRE(I) = WORK(16+2*I-1:16+2*I);                    /*@0001VLS*/ 01623000
         LA    @01,GPRE-3(@04)                                     0620 01624000
         LA    @14,WORK+14(@15)                                    0620 01625000
         MVC   0(2,@01),0(@14)                                     0620 01626000
*      GPRF(I) = WORK(24+2*I-1:24+2*I);                    /*@0001VLS*/ 01627000
         LA    @01,GPRF-3(@04)                                     0621 01628000
         LA    @04,WORK+22(@15)                                    0621 01629000
         MVC   0(2,@01),0(@04)                                     0621 01630000
*    END;                                                  /*@0001VLS*/ 01631000
         AH    @06,@CH00055                                        0622 01632000
         ST    @06,I                                               0622 01633000
         CH    @06,@CH00064                                        0622 01634000
         BNH   @DL00617                                            0622 01635000
*    CALL PRINTER(LINE42);                                 /*@0001VLS*/ 01636000
         LA    @01,@AL00623                                        0623 01637000
         BAL   @14,PRINTER                                         0623 01638000
*    CALL PRINTER(BLINE);                                  /*@0001VLS*/ 01639000
         LA    @01,@AL00624                                        0624 01640000
         BAL   @14,PRINTER                                         0624 01641000
*    CALL PRINTER(LINE43);                                 /*@0001VLS*/ 01642000
         LA    @01,@AL00625                                        0625 01643000
         BAL   @14,PRINTER                                         0625 01644000
*    CALL CONVERT (LRBECR,WORK,16);                        /*@0001VLS*/ 01645000
         MVC   @AL00001+4(8),@AL00626                              0626 01646000
         LA    @06,LRBECR(,R7)                                     0626 01647000
         ST    @06,@AL00001                                        0626 01648000
         LA    @01,@AL00001                                        0626 01649000
         BAL   @14,CONVERT                                         0626 01650000
*    DO I = 1 TO 4;                                        /*@0001VLS*/ 01651000
         LA    @06,1                                               0627 01652000
         ST    @06,I                                               0627 01653000
@DL00627 DS    0H                                                  0628 01654000
*      ECR0(I) = WORK(2*I-1:2*I);                          /*@0001VLS*/ 01655000
         LR    @04,@06                                             0628 01656000
         MH    @04,@CH00076                                        0628 01657000
         LA    @01,ECR0-3(@04)                                     0628 01658000
         LR    @15,@06                                             0628 01659000
         ALR   @15,@15                                             0628 01660000
         LA    @14,WORK-2(@15)                                     0628 01661000
         MVC   0(2,@01),0(@14)                                     0628 01662000
*      ECR1(I) = WORK(8+2*I-1:8+2*I);                      /*@0001VLS*/ 01663000
         LA    @01,ECR1-3(@04)                                     0629 01664000
         LA    @14,WORK+6(@15)                                     0629 01665000
         MVC   0(2,@01),0(@14)                                     0629 01666000
*      ECR2(I) = WORK(16+2*I-1:16+2*I);                    /*@0001VLS*/ 01667000
         LA    @01,ECR2-3(@04)                                     0630 01668000
         LA    @14,WORK+14(@15)                                    0630 01669000
         MVC   0(2,@01),0(@14)                                     0630 01670000
*      ECR3(I) = WORK(24+2*I-1:24+2*I);                    /*@0001VLS*/ 01671000
         LA    @01,ECR3-3(@04)                                     0631 01672000
         LA    @04,WORK+22(@15)                                    0631 01673000
         MVC   0(2,@01),0(@04)                                     0631 01674000
*    END;                                                  /*@0001VLS*/ 01675000
         AH    @06,@CH00055                                        0632 01676000
         ST    @06,I                                               0632 01677000
         CH    @06,@CH00064                                        0632 01678000
         BNH   @DL00627                                            0632 01679000
*    CALL PRINTER(LINE44);                                 /*@0001VLS*/ 01680000
         LA    @01,@AL00633                                        0633 01681000
         BAL   @14,PRINTER                                         0633 01682000
*    CALL CONVERT (LRBECR(17),WORK,16);                    /*@0001VLS*/ 01683000
         MVC   @AL00001+4(8),@AL00634                              0634 01684000
         LA    @06,LRBECR+16(,R7)                                  0634 01685000
         ST    @06,@AL00001                                        0634 01686000
         LA    @01,@AL00001                                        0634 01687000
         BAL   @14,CONVERT                                         0634 01688000
*    DO I = 1 TO 4;                                        /*@0001VLS*/ 01689000
         LA    @06,1                                               0635 01690000
         ST    @06,I                                               0635 01691000
@DL00635 DS    0H                                                  0636 01692000
*      ECR4(I) = WORK(2*I-1:2*I);                          /*@0001VLS*/ 01693000
         LR    @04,@06                                             0636 01694000
         MH    @04,@CH00076                                        0636 01695000
         LA    @01,ECR4-3(@04)                                     0636 01696000
         LR    @15,@06                                             0636 01697000
         ALR   @15,@15                                             0636 01698000
         LA    @14,WORK-2(@15)                                     0636 01699000
         MVC   0(2,@01),0(@14)                                     0636 01700000
*      ECR5(I) = WORK(8+2*I-1:8+2*I);                      /*@0001VLS*/ 01701000
         LA    @01,ECR5-3(@04)                                     0637 01702000
         LA    @14,WORK+6(@15)                                     0637 01703000
         MVC   0(2,@01),0(@14)                                     0637 01704000
*      ECR6(I) = WORK(16+2*I-1:16+2*I);                    /*@0001VLS*/ 01705000
         LA    @01,ECR6-3(@04)                                     0638 01706000
         LA    @14,WORK+14(@15)                                    0638 01707000
         MVC   0(2,@01),0(@14)                                     0638 01708000
*      ECR7(I) = WORK(24+2*I-1:24+2*I);                    /*@0001VLS*/ 01709000
         LA    @01,ECR7-3(@04)                                     0639 01710000
         LA    @04,WORK+22(@15)                                    0639 01711000
         MVC   0(2,@01),0(@04)                                     0639 01712000
*    END;                                                  /*@0001VLS*/ 01713000
         AH    @06,@CH00055                                        0640 01714000
         ST    @06,I                                               0640 01715000
         CH    @06,@CH00064                                        0640 01716000
         BNH   @DL00635                                            0640 01717000
*    CALL PRINTER(LINE45);                                 /*@0001VLS*/ 01718000
         LA    @01,@AL00641                                        0641 01719000
         BAL   @14,PRINTER                                         0641 01720000
*    CALL CONVERT (LRBECR(33),WORK,16);                    /*@0001VLS*/ 01721000
         MVC   @AL00001+4(8),@AL00642                              0642 01722000
         LA    @06,LRBECR+32(,R7)                                  0642 01723000
         ST    @06,@AL00001                                        0642 01724000
         LA    @01,@AL00001                                        0642 01725000
         BAL   @14,CONVERT                                         0642 01726000
*    DO I = 1 TO 4;                                        /*@0001VLS*/ 01727000
         LA    @06,1                                               0643 01728000
         ST    @06,I                                               0643 01729000
@DL00643 DS    0H                                                  0644 01730000
*      ECR8(I) = WORK(2*I-1:2*I);                          /*@0001VLS*/ 01731000
         LR    @04,@06                                             0644 01732000
         MH    @04,@CH00076                                        0644 01733000
         LA    @01,ECR8-3(@04)                                     0644 01734000
         LR    @15,@06                                             0644 01735000
         ALR   @15,@15                                             0644 01736000
         LA    @14,WORK-2(@15)                                     0644 01737000
         MVC   0(2,@01),0(@14)                                     0644 01738000
*      ECR9(I) = WORK(8+2*I-1:8+2*I);                      /*@0001VLS*/ 01739000
         LA    @01,ECR9-3(@04)                                     0645 01740000
         LA    @14,WORK+6(@15)                                     0645 01741000
         MVC   0(2,@01),0(@14)                                     0645 01742000
*      ECRA(I) = WORK(16+2*I-1:16+2*I);                    /*@0001VLS*/ 01743000
         LA    @01,ECRA-3(@04)                                     0646 01744000
         LA    @14,WORK+14(@15)                                    0646 01745000
         MVC   0(2,@01),0(@14)                                     0646 01746000
*      ECRB(I) = WORK(24+2*I-1:24+2*I);                    /*@0001VLS*/ 01747000
         LA    @01,ECRB-3(@04)                                     0647 01748000
         LA    @04,WORK+22(@15)                                    0647 01749000
         MVC   0(2,@01),0(@04)                                     0647 01750000
*    END;                                                  /*@0001VLS*/ 01751000
         AH    @06,@CH00055                                        0648 01752000
         ST    @06,I                                               0648 01753000
         CH    @06,@CH00064                                        0648 01754000
         BNH   @DL00643                                            0648 01755000
*    CALL PRINTER(LINE46);                                 /*@0001VLS*/ 01756000
         LA    @01,@AL00649                                        0649 01757000
         BAL   @14,PRINTER                                         0649 01758000
*    CALL CONVERT (LRBECR(49),WORK,16);                    /*@0001VLS*/ 01759000
         MVC   @AL00001+4(8),@AL00650                              0650 01760000
         LA    @06,LRBECR+48(,R7)                                  0650 01761000
         ST    @06,@AL00001                                        0650 01762000
         LA    @01,@AL00001                                        0650 01763000
         BAL   @14,CONVERT                                         0650 01764000
*    DO I = 1 TO 4;                                        /*@0001VLS*/ 01765000
         LA    @06,1                                               0651 01766000
         ST    @06,I                                               0651 01767000
@DL00651 DS    0H                                                  0652 01768000
*      ECRC(I) = WORK(2*I-1:2*I);                          /*@0001VLS*/ 01769000
         LR    @04,@06                                             0652 01770000
         MH    @04,@CH00076                                        0652 01771000
         LA    @01,ECRC-3(@04)                                     0652 01772000
         LR    @15,@06                                             0652 01773000
         ALR   @15,@15                                             0652 01774000
         LA    @14,WORK-2(@15)                                     0652 01775000
         MVC   0(2,@01),0(@14)                                     0652 01776000
*      ECRD(I) = WORK(8+2*I-1:8+2*I);                      /*@0001VLS*/ 01777000
         LA    @01,ECRD-3(@04)                                     0653 01778000
         LA    @14,WORK+6(@15)                                     0653 01779000
         MVC   0(2,@01),0(@14)                                     0653 01780000
*      ECRE(I) = WORK(16+2*I-1:16+2*I);                    /*@0001VLS*/ 01781000
         LA    @01,ECRE-3(@04)                                     0654 01782000
         LA    @14,WORK+14(@15)                                    0654 01783000
         MVC   0(2,@01),0(@14)                                     0654 01784000
*      ECRF(I) = WORK(24+2*I-1:24+2*I);                    /*@0001VLS*/ 01785000
         LA    @01,ECRF-3(@04)                                     0655 01786000
         LA    @04,WORK+22(@15)                                    0655 01787000
         MVC   0(2,@01),0(@04)                                     0655 01788000
*    END;                                                  /*@0001VLS*/ 01789000
         AH    @06,@CH00055                                        0656 01790000
         ST    @06,I                                               0656 01791000
         CH    @06,@CH00064                                        0656 01792000
         BNH   @DL00651                                            0656 01793000
*    CALL PRINTER(LINE47);                                 /*@0001VLS*/ 01794000
         LA    @01,@AL00657                                        0657 01795000
         BAL   @14,PRINTER                                         0657 01796000
*  END;                                                    /*@0001VLS*/ 01797000
*IF LRBHTYPE = '13'X THEN                                          0659 01798000
@RC00558 CLI   LRBHTYPE(R7),X'13'                                  0659 01799000
         BNE   @RF00659                                            0659 01800000
*  CALL MVSLOG;                                            /*@0001VLS*/ 01801000
         BAL   @14,MVSLOG                                          0660 01802000
*RESPECIFY (R15) RESTRICTED;                               /*@0001VLS*/ 01803000
@RF00659 DS    0H                                                  0662 01804000
*R15 = ZERO;                                               /*@0001VLS*/ 01805000
         SLR   R15,R15                                             0662 01806000
*RETURN;                                                   /*@0001VLS*/ 01807000
@EL00001 L     @13,4(,@13)                                         0663 01808000
@EF00001 DS    0H                                                  0663 01809000
@ER00001 L     @14,12(,@13)                                        0663 01810000
         LM    @00,@12,20(@13)                                     0663 01811000
         BR    @14                                                 0663 01812000
*RESPECIFY (R15) UNRESTRICTED;                             /*@0001VLS*/ 01813000
*END                                                       /*@0001VLS*/ 01814000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 01815000
*/*%INCLUDE SYSLIB  (COMTABLE)                                        * 01816000
*;                                                                 0665 01817000
@DATA    DS    0H                                                       01818000
@CH00055 DC    H'1'                                                     01819000
@CH00082 DC    H'7'                                                     01820000
         DS    0F                                                       01821000
@AL00192 EQU   *                       LIST WITH   1 ARGUMENT(S)        01822000
@AL00201 DC    A(@CF00074+2)           LIST WITH   1 ARGUMENT(S)        01823000
@AL00208 EQU   *                       LIST WITH   1 ARGUMENT(S)        01824000
@AL00210 EQU   *                       LIST WITH   1 ARGUMENT(S)        01825000
@AL00242 EQU   *                       LIST WITH   1 ARGUMENT(S)        01826000
@AL00244 EQU   *                       LIST WITH   1 ARGUMENT(S)        01827000
@AL00246 EQU   *                       LIST WITH   1 ARGUMENT(S)        01828000
@AL00312 EQU   *                       LIST WITH   1 ARGUMENT(S)        01829000
@AL00314 EQU   *                       LIST WITH   1 ARGUMENT(S)        01830000
@AL00316 EQU   *                       LIST WITH   1 ARGUMENT(S)        01831000
@AL00364 EQU   *                       LIST WITH   1 ARGUMENT(S)        01832000
@AL00371 EQU   *                       LIST WITH   1 ARGUMENT(S)        01833000
@AL00375 EQU   *                       LIST WITH   1 ARGUMENT(S)        01834000
@AL00391 EQU   *                       LIST WITH   1 ARGUMENT(S)        01835000
@AL00393 EQU   *                       LIST WITH   1 ARGUMENT(S)        01836000
@AL00420 EQU   *                       LIST WITH   1 ARGUMENT(S)        01837000
@AL00426 EQU   *                       LIST WITH   1 ARGUMENT(S)        01838000
@AL00437 EQU   *                       LIST WITH   1 ARGUMENT(S)        01839000
@AL00441 EQU   *                       LIST WITH   1 ARGUMENT(S)        01840000
@AL00452 EQU   *                       LIST WITH   1 ARGUMENT(S)        01841000
@AL00454 EQU   *                       LIST WITH   1 ARGUMENT(S)        01842000
@AL00568 EQU   *                       LIST WITH   1 ARGUMENT(S)        01843000
@AL00570 EQU   *                       LIST WITH   1 ARGUMENT(S)        01844000
@AL00576 EQU   *                       LIST WITH   1 ARGUMENT(S)        01845000
@AL00577 EQU   *                       LIST WITH   1 ARGUMENT(S)        01846000
@AL00591 EQU   *                       LIST WITH   1 ARGUMENT(S)        01847000
@AL00624 DC    A(BLINE)                LIST WITH   1 ARGUMENT(S)        01848000
@AL00209 DC    A(LINE28C)              LIST WITH   1 ARGUMENT(S)        01849000
@AL00217 DC    A(LINE28D)              LIST WITH   1 ARGUMENT(S)        01850000
@AL00224 DC    A(LINE28E)              LIST WITH   1 ARGUMENT(S)        01851000
@AL00231 DC    A(LINE28F)              LIST WITH   1 ARGUMENT(S)        01852000
@AL00238 DC    A(LINE28G)              LIST WITH   1 ARGUMENT(S)        01853000
@AL00243 DC    A(BLIN1)                LIST WITH   1 ARGUMENT(S)        01854000
@AL00245 DC    A(BLIN2)                LIST WITH   1 ARGUMENT(S)        01855000
@AL00253 DC    A(BLIN3)                LIST WITH   1 ARGUMENT(S)        01856000
@AL00254 DC    A(BLIN4)                LIST WITH   1 ARGUMENT(S)        01857000
@AL00255 DC    A(BLIN5)                LIST WITH   1 ARGUMENT(S)        01858000
@AL00259 DC    A(BLIN6)                LIST WITH   1 ARGUMENT(S)        01859000
@AL00272 DC    A(BLIN7)                LIST WITH   1 ARGUMENT(S)        01860000
@AL00285 DC    A(BLIN8)                LIST WITH   1 ARGUMENT(S)        01861000
@AL00298 DC    A(BLIN9)                LIST WITH   1 ARGUMENT(S)        01862000
@AL00311 DC    A(BLIN10)               LIST WITH   1 ARGUMENT(S)        01863000
@AL00313 DC    A(BLIN11A)              LIST WITH   1 ARGUMENT(S)        01864000
@AL00315 DC    A(BLIN11)               LIST WITH   1 ARGUMENT(S)        01865000
@AL00320 DC    A(BLIN12)               LIST WITH   1 ARGUMENT(S)        01866000
@AL00324 DC    A(BLIN13)               LIST WITH   1 ARGUMENT(S)        01867000
@AL00328 DC    A(BLIN14)               LIST WITH   1 ARGUMENT(S)        01868000
@AL00335 DC    A(BLIN15)               LIST WITH   1 ARGUMENT(S)        01869000
@AL00342 DC    A(BLIN16)               LIST WITH   1 ARGUMENT(S)        01870000
@AL00349 DC    A(BLIN17)               LIST WITH   1 ARGUMENT(S)        01871000
@AL00356 DC    A(BLIN18)               LIST WITH   1 ARGUMENT(S)        01872000
@AL00363 DC    A(BLIN19)               LIST WITH   1 ARGUMENT(S)        01873000
@AL00366 DC    A(I)                    LIST WITH   2 ARGUMENT(S)        01874000
         DC    A(BLIN20P1)                                              01875000
@AL00367 DC    A(BLIN20)               LIST WITH   1 ARGUMENT(S)        01876000
@AL00372 DC    A(LMODEL)               LIST WITH   2 ARGUMENT(S)        01877000
         DC    A(@CF00074)                                              01878000
@AL00373 DC    A(SERIAL)               LIST WITH   2 ARGUMENT(S)        01879000
         DC    A(@CF00076)                                              01880000
@AL00374 DC    A(LINE1)                LIST WITH   1 ARGUMENT(S)        01881000
@AL00389 DC    A(I)                    LIST WITH   2 ARGUMENT(S)        01882000
         DC    A(REL)                                                   01883000
@AL00390 DC    A(LINE2)                LIST WITH   1 ARGUMENT(S)        01884000
@AL00392 DC    A(LINE3)                LIST WITH   1 ARGUMENT(S)        01885000
@AL00397 DC    A(I)                    LIST WITH   2 ARGUMENT(S)        01886000
         DC    A(SEQ)                                                   01887000
@AL00398 DC    A(CPU)                  LIST WITH   2 ARGUMENT(S)        01888000
         DC    A(@CF00074)                                              01889000
@AL00399 DC    A(ASID)                 LIST WITH   2 ARGUMENT(S)        01890000
         DC    A(@CF00074)                                              01891000
@AL00402 DC    A(J)                    LIST WITH   2 ARGUMENT(S)        01892000
         DC    A(ERRORHH)                                               01893000
@AL00405 DC    A(J)                    LIST WITH   2 ARGUMENT(S)        01894000
         DC    A(ERRORMM)                                               01895000
@AL00408 DC    A(J)                    LIST WITH   2 ARGUMENT(S)        01896000
         DC    A(ERRORSS)                                               01897000
@AL00410 DC    A(I)                    LIST WITH   2 ARGUMENT(S)        01898000
         DC    A(ERRORTH)                                               01899000
@AL00417 DC    A(LINE4B)               LIST WITH   1 ARGUMENT(S)        01900000
@AL00419 DC    A(LINE4A)               LIST WITH   1 ARGUMENT(S)        01901000
@AL00421 EQU   *                       LIST WITH   2 ARGUMENT(S)        01902000
@AL00571 DC    A(WORK)                 LIST WITH   2 ARGUMENT(S)        01903000
         DC    A(@CF00066)                                              01904000
@AL00425 DC    A(LINE5)                LIST WITH   1 ARGUMENT(S)        01905000
@AL00429 DC    A(LINE6A)               LIST WITH   1 ARGUMENT(S)        01906000
@AL00430 DC    A(RECLEN)               LIST WITH   2 ARGUMENT(S)        01907000
         DC    A(@CF00064)                                              01908000
@AL00431 DC    A(WAITCODE)             LIST WITH   2 ARGUMENT(S)        01909000
         DC    A(@CF00064)                                              01910000
@AL00432 DC    A(LINE6C)               LIST WITH   1 ARGUMENT(S)        01911000
@AL00436 DC    A(LINE6B1)              LIST WITH   1 ARGUMENT(S)        01912000
@AL00439 DC    A(LINE6B2)              LIST WITH   1 ARGUMENT(S)        01913000
@AL00442 DC    A(LINE7)                LIST WITH   1 ARGUMENT(S)        01914000
@AL00443 EQU   *                       LIST WITH   2 ARGUMENT(S)        01915000
@AL00446 DC    A(WORK)                 LIST WITH   2 ARGUMENT(S)        01916000
         DC    A(@CF00064)                                              01917000
@AL00451 DC    A(LINE8)                LIST WITH   1 ARGUMENT(S)        01918000
@AL00453 DC    A(LINE9)                LIST WITH   1 ARGUMENT(S)        01919000
@AL00455 DC    A(LINE10)               LIST WITH   1 ARGUMENT(S)        01920000
@AL00462 DC    A(LINE11)               LIST WITH   1 ARGUMENT(S)        01921000
@AL00469 DC    A(LINE12)               LIST WITH   1 ARGUMENT(S)        01922000
@AL00476 DC    A(LINE13)               LIST WITH   1 ARGUMENT(S)        01923000
@AL00483 DC    A(LINE14)               LIST WITH   1 ARGUMENT(S)        01924000
@AL00484 DC    A(LINE15)               LIST WITH   1 ARGUMENT(S)        01925000
@AL00491 DC    A(LINE16)               LIST WITH   1 ARGUMENT(S)        01926000
@AL00492 DC    A(LINE17)               LIST WITH   1 ARGUMENT(S)        01927000
@AL00499 DC    A(LINE18)               LIST WITH   1 ARGUMENT(S)        01928000
@AL00503 DC    A(LINE19)               LIST WITH   1 ARGUMENT(S)        01929000
@AL00504 DC    A(LINE20)               LIST WITH   1 ARGUMENT(S)        01930000
@AL00511 DC    A(LINE21)               LIST WITH   1 ARGUMENT(S)        01931000
@AL00518 DC    A(LINE22)               LIST WITH   1 ARGUMENT(S)        01932000
@AL00525 DC    A(LINE23)               LIST WITH   1 ARGUMENT(S)        01933000
@AL00532 DC    A(LINE24)               LIST WITH   1 ARGUMENT(S)        01934000
@AL00539 DC    A(LINE25)               LIST WITH   1 ARGUMENT(S)        01935000
@AL00546 DC    A(LINE26)               LIST WITH   1 ARGUMENT(S)        01936000
@AL00552 DC    A(LINE26A)              LIST WITH   1 ARGUMENT(S)        01937000
@AL00554 DC    A(WORK)                 LIST WITH   2 ARGUMENT(S)        01938000
         DC    A(@CF00074)                                              01939000
@AL00557 DC    A(LINE27)               LIST WITH   1 ARGUMENT(S)        01940000
@AL00560 DC    A(WORK)                 LIST WITH   2 ARGUMENT(S)        01941000
         DC    A(@CF00532)                                              01942000
@AL00564 DC    A(LINE28A)              LIST WITH   1 ARGUMENT(S)        01943000
@AL00569 DC    A(LINE28B)              LIST WITH   1 ARGUMENT(S)        01944000
@AL00575 DC    A(LINE29)               LIST WITH   1 ARGUMENT(S)        01945000
@AL00578 DC    A(LINE36)               LIST WITH   1 ARGUMENT(S)        01946000
@AL00579 EQU   *                       LIST WITH   2 ARGUMENT(S)        01947000
@AL00585 EQU   *                       LIST WITH   2 ARGUMENT(S)        01948000
@AL00592 EQU   *                       LIST WITH   2 ARGUMENT(S)        01949000
@AL00600 EQU   *                       LIST WITH   2 ARGUMENT(S)        01950000
@AL00608 EQU   *                       LIST WITH   2 ARGUMENT(S)        01951000
@AL00616 EQU   *                       LIST WITH   2 ARGUMENT(S)        01952000
@AL00626 EQU   *                       LIST WITH   2 ARGUMENT(S)        01953000
@AL00634 EQU   *                       LIST WITH   2 ARGUMENT(S)        01954000
@AL00642 EQU   *                       LIST WITH   2 ARGUMENT(S)        01955000
@AL00650 DC    A(WORK)                 LIST WITH   2 ARGUMENT(S)        01956000
         DC    A(@CF00088)                                              01957000
@AL00584 DC    A(LINE37)               LIST WITH   1 ARGUMENT(S)        01958000
@AL00590 DC    A(LINE38)               LIST WITH   1 ARGUMENT(S)        01959000
@AL00599 DC    A(LINE39)               LIST WITH   1 ARGUMENT(S)        01960000
@AL00607 DC    A(LINE40)               LIST WITH   1 ARGUMENT(S)        01961000
@AL00615 DC    A(LINE41)               LIST WITH   1 ARGUMENT(S)        01962000
@AL00623 DC    A(LINE42)               LIST WITH   1 ARGUMENT(S)        01963000
@AL00625 DC    A(LINE43)               LIST WITH   1 ARGUMENT(S)        01964000
@AL00633 DC    A(LINE44)               LIST WITH   1 ARGUMENT(S)        01965000
@AL00641 DC    A(LINE45)               LIST WITH   1 ARGUMENT(S)        01966000
@AL00649 DC    A(LINE46)               LIST WITH   1 ARGUMENT(S)        01967000
@AL00657 DC    A(LINE47)               LIST WITH   1 ARGUMENT(S)        01968000
         DS    0F                                                       01969000
@SA00001 DS    18F                                                      01970000
@PC00002 DS    2F                                                       01971000
@PC00003 DS    2F                                                       01972000
@PC00004 DS    3F                                                       01973000
@SA00005 DS    14F                                                      01974000
@PC00005 DS    1F                                                       01975000
@SA00006 DS    14F                                                      01976000
@SA00007 DS    15F                                                      01977000
@AL00001 DS    3A                                                       01978000
@TF00001 DS    F                                                        01979000
@ZTEMPS  DS    0F                                                       01980000
@ZT00002 DC    F'0'                                                     01981000
@ZT00003 DC    F'0'                                                     01982000
@ZTEMPND EQU   *                                                        01983000
@ZLEN    EQU   @ZTEMPND-@ZTEMPS                                         01984000
         DS    0F                                                       01985000
@CF00074 DC    F'2'                                                     01986000
@CH00074 EQU   @CF00074+2                                               01987000
@CF00076 DC    F'3'                                                     01988000
@CH00076 EQU   @CF00076+2                                               01989000
@CF00064 DC    F'4'                                                     01990000
@CH00064 EQU   @CF00064+2                                               01991000
@CF00066 DC    F'8'                                                     01992000
@CH00066 EQU   @CF00066+2                                               01993000
@CF00035 DC    F'10'                                                    01994000
@CH00035 EQU   @CF00035+2                                               01995000
@CF00532 DC    F'14'                                                    01996000
@CH00532 EQU   @CF00532+2                                               01997000
@CF00088 DC    F'16'                                                    01998000
@CF01714 DC    F'600'                                                   01999000
@CH01714 EQU   @CF01714+2                                               02000000
@CF01713 DC    F'36000'                                                 02001000
@CF01723 DC    F'-10'                                                   02002000
@CF01724 DC    F'-8'                                                    02003000
@CF01725 DC    F'-6'                                                    02004000
@CF01726 DC    F'-4'                                                    02005000
         DS    0D                                                       02006000
I        DS    F                                                        02007000
J        DS    F                                                        02008000
@CC01703 DC    C'VS 2'                                                  02009000
@CC01704 DC    C'VM  '                                                  02010000
@CC01705 DC    C'VS 1'                                                  02011000
@CC01706 DC    C'DOS '                                                  02012000
@CC01707 DC    C'OS  '                                                  02013000
EJECT    DC    CL134'0'                                                 02014000
         ORG   EJECT                                                    02015000
@NM00012 DS    CL1                                                      02016000
@NM00013 DC    X'89'                                                    02017000
         ORG   EJECT+134                                                02018000
BLINE    DC    CL134'0'                                                 02019000
         ORG   BLINE                                                    02020000
@NM00014 DS    CL1                                                      02021000
@NM00015 DC    X'09'                                                    02022000
         ORG   BLINE+134                                                02023000
LINE1    DC    CL134'0'                                                 02024000
         ORG   LINE1                                                    02025000
@NM00016 DS    CL1                                                      02026000
@NM00017 DC    X'09'                                                    02027000
@NM00018 DC    CL6'MODEL'                                               02028000
LMODEL   DS    CL4                                                      02029000
@NM00019 DS    CL24                                                     02030000
@NM00020 DC    CL12'SERIAL NO.'                                         02031000
SERIAL   DS    CL6                                                      02032000
         ORG   LINE1+134                                                02033000
LINE2    DC    CL134'0'                                                 02034000
         ORG   LINE2                                                    02035000
@NM00021 DS    CL1                                                      02036000
@NM00022 DC    X'09'                                                    02037000
SYS      DS    CL5                                                      02038000
@NM00023 DC    CL4'REL.'                                                02039000
REL      DS    CL2                                                      02040000
         ORG   LINE2+134                                                02041000
LINE3    DC    CL134'0'                                                 02042000
         ORG   LINE3                                                    02043000
@NM00024 DS    CL1                                                      02044000
@NM00025 DC    X'09'                                                    02045000
@NM00026 DC    CL36'--- RECORD SOURCE - MCH ---'                        02046000
@NM00027 DC    CL20'TYPE - CPU'                                         02047000
         ORG   LINE3+134                                                02048000
LINE4A   DC    CL134'0'                                                 02049000
         ORG   LINE4A                                                   02050000
@NM00028 DS    CL1                                                      02051000
@NM00029 DC    X'09'                                                    02052000
@NM00030 DC    CL16' '                                                  02053000
@NM00031 DC    CL50'NO ERRORID ASSOCIATED WITH THIS RECORD'             02054000
         ORG   LINE4A+134                                               02055000
LINE4B   DC    CL134'0'                                                 02056000
         ORG   LINE4B                                                   02057000
@NM00032 DS    CL1                                                      02058000
@NM00033 DC    X'09'                                                    02059000
@NM00034 DC    CL11'ERRORID=SEQ'                                        02060000
SEQ      DS    CL6                                                      02061000
@NM00035 DC    CL3'CPU'                                                 02062000
CPU      DS    CL5                                                      02063000
@NM00036 DC    CL4'ASID'                                                02064000
ASID     DS    CL5                                                      02065000
@NM00037 DC    CL4'TIME'                                                02066000
ERRORHH  DS    CL2                                                      02067000
@NM00038 DC    CL1'.'                                                   02068000
ERRORMM  DS    CL2                                                      02069000
@NM00039 DC    CL1'.'                                                   02070000
ERRORSS  DS    CL2                                                      02071000
@NM00040 DC    CL1'.'                                                   02072000
ERRORTH  DS    CL1                                                      02073000
         ORG   LINE4B+134                                               02074000
LINE5    DC    CL134'0'                                                 02075000
         ORG   LINE5                                                    02076000
@NM00041 DS    CL1                                                      02077000
@NM00042 DC    X'09'                                                    02078000
@NM00043 DC    CL14'MCK OLD PSW'                                        02079000
@NM00044 DS    CL3                                                      02080000
         ORG   @NM00044+0                                               02081000
MCKPSW   DS    CL2                                                      02082000
@NM00045 DS    CL1                                                      02083000
         ORG   LINE5+134                                                02084000
LINE6A   DC    CL134'0'                                                 02085000
         ORG   LINE6A                                                   02086000
@NM00046 DS    CL1                                                      02087000
@NM00047 DC    X'09'                                                    02088000
@NM00048 DC    CL40'-----  SYSTEM TERMINATED  -----'                    02089000
         ORG   LINE6A+134                                               02090000
LINE6C   DC    CL134'0'                                                 02091000
         ORG   LINE6C                                                   02092000
@NM00049 DS    CL1                                                      02093000
@NM00050 DC    X'09'                                                    02094000
@NM00051 DC    CL15'RECORD LENGTH'                                      02095000
RECLEN   DS    CL8                                                      02096000
@NM00052 DS    CL5                                                      02097000
@NM00053 DC    CL15'WAIT STATE'                                         02098000
WAITCODE DS    CL8                                                      02099000
         ORG   LINE6C+134                                               02100000
LINE6B1  DC    CL134'0'                                                 02101000
         ORG   LINE6B1                                                  02102000
@NM00054 DS    CL1                                                      02103000
@NM00055 DC    X'09'                                                    02104000
@NM00056 DC    CL20'JOB NAME'                                           02105000
JOBNAME  DS    CL8                                                      02106000
         ORG   LINE6B1+134                                              02107000
LINE6B2  DC    CL134'0'                                                 02108000
         ORG   LINE6B2                                                  02109000
@NM00057 DS    CL1                                                      02110000
@NM00058 DC    X'09'                                                    02111000
@NM00059 DC    CL20'PROGRAM NAME'                                       02112000
IFCESUMS DS    CL8                                                      02113000
         ORG   LINE6B2+134                                              02114000
LINE7    DC    CL134'0'                                                 02115000
         ORG   LINE7                                                    02116000
@NM00060 DS    CL1                                                      02117000
@NM00061 DC    X'09'                                                    02118000
@NM00062 DC    CL7' '                                                   02119000
@NM00063 DC    CL40'DAY  YEAR'                                          02120000
@NM00064 DC    CL40'HH MM SS.TH'                                        02121000
         ORG   LINE7+134                                                02122000
LINE8    DC    CL134'0'                                                 02123000
         ORG   LINE8                                                    02124000
@NM00065 DS    CL1                                                      02125000
@NM00066 DC    X'09'                                                    02126000
@NM00067 DC    CL7'DATE _'                                              02127000
DAY      DS    CL6                                                      02128000
YEAR     DS    CL27                                                     02129000
@NM00068 DC    CL7'TIME _'                                              02130000
TIMEHH   DS    CL3                                                      02131000
TIMEMM   DS    CL3                                                      02132000
TIMESS   DS    CL3                                                      02133000
TIMETH   DS    CL2                                                      02134000
         ORG   LINE8+134                                                02135000
LINE9    DC    CL134'0'                                                 02136000
         ORG   LINE9                                                    02137000
@NM00069 DS    CL1                                                      02138000
@NM00070 DC    X'09'                                                    02139000
@NM00071 DC    CL4' '                                                   02140000
@NM00072 DC    CL40'--- MACHINE CHECK INTERRUPT CODE ---'               02141000
         ORG   LINE9+134                                                02142000
LINE10   DC    CL134'0'                                                 02143000
         ORG   LINE10                                                   02144000
@NM00073 DS    CL1                                                      02145000
@NM00074 DC    X'09'                                                    02146000
@NM00075 DC    CL4' '                                                   02147000
@NM00076 DC    CL40'--- INTERRUPTION SUB CLASSES ---'                   02148000
         ORG   LINE10+134                                               02149000
LINE11   DC    CL134'0'                                                 02150000
         ORG   LINE11                                                   02151000
@NM00077 DS    CL1                                                      02152000
@NM00078 DC    X'09'                                                    02153000
@NM00079 DC    CL4' '                                                   02154000
@NM00080 DC    CL40'SYSTEM DAMAGE (SD)'                                 02155000
SDAMAGE  DS    CL1                                                      02156000
@NM00081 DS    CL9                                                      02157000
@NM00082 DC    CL40'INSTRUCTION PROCESSING DAMAGE (PD)'                 02158000
IDAMAGE  DS    CL1                                                      02159000
         ORG   LINE11+134                                               02160000
LINE12   DC    CL134'0'                                                 02161000
         ORG   LINE12                                                   02162000
@NM00083 DS    CL1                                                      02163000
@NM00084 DC    X'09'                                                    02164000
@NM00085 DC    CL4' '                                                   02165000
@NM00086 DC    CL40'SYSTEM RECOVERY (SR)'                               02166000
SRECO    DS    CL1                                                      02167000
@NM00087 DS    CL9                                                      02168000
@NM00088 DC    CL40'TIMER DAMAGE (TD)'                                  02169000
TDAMAGE  DS    CL1                                                      02170000
         ORG   LINE12+134                                               02171000
LINE13   DC    CL134'0'                                                 02172000
         ORG   LINE13                                                   02173000
@NM00089 DS    CL1                                                      02174000
@NM00090 DC    X'09'                                                    02175000
@NM00091 DC    CL4' '                                                   02176000
@NM00092 DC    CL40'CLOCK DAMAGE (CD)'                                  02177000
CDAMAGE  DS    CL1                                                      02178000
@NM00093 DS    CL9                                                      02179000
@NM00094 DC    CL40'EXTERNAL DAMAGE (ED)'                               02180000
EDAMAGE  DS    CL1                                                      02181000
         ORG   LINE13+134                                               02182000
LINE14   DC    CL134'0'                                                 02183000
         ORG   LINE14                                                   02184000
@NM00095 DS    CL1                                                      02185000
@NM00096 DC    X'09'                                                    02186000
@NM00097 DC    CL4' '                                                   02187000
@NM00098 DC    CL40'DEGRADATION (DG)'                                   02188000
DEGRAD   DS    CL1                                                      02189000
@NM00099 DS    CL9                                                      02190000
@NM00100 DC    CL40'WARNING (W)'                                        02191000
WARNING  DS    CL1                                                      02192000
         ORG   LINE14+134                                               02193000
LINE15   DC    CL134'0'                                                 02194000
         ORG   LINE15                                                   02195000
@NM00101 DS    CL1                                                      02196000
@NM00102 DC    X'09'                                                    02197000
@NM00103 DC    CL4' '                                                   02198000
@NM00104 DC    CL40'--- INTERRUPT TENSE CODES ---'                      02199000
         ORG   LINE15+134                                               02200000
LINE16   DC    CL134'0'                                                 02201000
         ORG   LINE16                                                   02202000
@NM00105 DS    CL1                                                      02203000
@NM00106 DC    X'09'                                                    02204000
@NM00107 DC    CL4' '                                                   02205000
@NM00108 DC    CL40'BACKED UP (B)'                                      02206000
BACKED   DS    CL1                                                      02207000
@NM00109 DS    CL9                                                      02208000
@NM00110 DC    CL40'DELAYED (D)'                                        02209000
DELAYED  DS    CL1                                                      02210000
         ORG   LINE16+134                                               02211000
LINE17   DC    CL134'0'                                                 02212000
         ORG   LINE17                                                   02213000
@NM00111 DS    CL1                                                      02214000
@NM00112 DC    X'09'                                                    02215000
@NM00113 DC    CL4' '                                                   02216000
@NM00114 DC    CL60'--- STORAGE AND PROTECTION ERROR CODES ---'         02217000
         ORG   LINE17+134                                               02218000
LINE18   DC    CL134'0'                                                 02219000
         ORG   LINE18                                                   02220000
@NM00115 DS    CL1                                                      02221000
@NM00116 DC    X'09'                                                    02222000
@NM00117 DC    CL4' '                                                   02223000
@NM00118 DC    CL40'STORAGE ERROR UNCORRECTED (SE)'                     02224000
SERRORU  DS    CL1                                                      02225000
@NM00119 DS    CL9                                                      02226000
@NM00120 DC    CL40'STORAGE ERROR CORRECTED (SC)'                       02227000
SERRORC  DS    CL1                                                      02228000
         ORG   LINE18+134                                               02229000
LINE19   DC    CL134'0'                                                 02230000
         ORG   LINE19                                                   02231000
@NM00121 DS    CL1                                                      02232000
@NM00122 DC    X'09'                                                    02233000
@NM00123 DC    CL4' '                                                   02234000
@NM00124 DC    CL40'STORAGE KEY ERROR UNCORRECTED (KE)'                 02235000
SKEYERR  DS    CL1                                                      02236000
         ORG   LINE19+134                                               02237000
LINE20   DC    CL134'0'                                                 02238000
         ORG   LINE20                                                   02239000
@NM00125 DS    CL1                                                      02240000
@NM00126 DC    X'09'                                                    02241000
@NM00127 DC    CL4' '                                                   02242000
@NM00128 DC    CL40'--- VALIDITY BITS ---'                              02243000
         ORG   LINE20+134                                               02244000
LINE21   DC    CL134'0'                                                 02245000
         ORG   LINE21                                                   02246000
@NM00129 DS    CL1                                                      02247000
@NM00130 DC    X'09'                                                    02248000
@NM00131 DC    CL4' '                                                   02249000
@NM00132 DC    CL40'PSW EMWP VALIDITY (WP)'                             02250000
PSWEMWP  DS    CL1                                                      02251000
@NM00133 DS    CL9                                                      02252000
@NM00134 DC    CL40'PSW MASKS AND KEY VALID (MS)'                       02253000
PSWMASK  DS    CL1                                                      02254000
         ORG   LINE21+134                                               02255000
LINE22   DC    CL134'0'                                                 02256000
         ORG   LINE22                                                   02257000
@NM00135 DS    CL1                                                      02258000
@NM00136 DC    X'09'                                                    02259000
@NM00137 DC    CL4' '                                                   02260000
@NM00138 DC    CL40'PGM MASK AND COND. CODE VALID (PM)'                 02261000
PSWCODE  DS    CL1                                                      02262000
@NM00139 DS    CL9                                                      02263000
@NM00140 DC    CL40'INSTRUCTION ADDRESS VALID (IA)'                     02264000
INSTADD  DS    CL1                                                      02265000
         ORG   LINE22+134                                               02266000
LINE23   DC    CL134'0'                                                 02267000
         ORG   LINE23                                                   02268000
@NM00141 DS    CL1                                                      02269000
@NM00142 DC    X'09'                                                    02270000
@NM00143 DC    CL4' '                                                   02271000
@NM00144 DC    CL40'FAILING STORAGE ADDRESS VALID (FA)'                 02272000
FAILADD  DS    CL1                                                      02273000
@NM00145 DS    CL9                                                      02274000
@NM00146 DC    CL40'REGION CODE VALID (RC)'                             02275000
RGNCODE  DS    CL1                                                      02276000
         ORG   LINE23+134                                               02277000
LINE24   DC    CL134'0'                                                 02278000
         ORG   LINE24                                                   02279000
@NM00147 DS    CL1                                                      02280000
@NM00148 DC    X'09'                                                    02281000
@NM00149 DC    CL4' '                                                   02282000
@NM00150 DC    CL40'FP REGS STORED ARE VALID (FP)'                      02283000
FPREGS   DS    CL1                                                      02284000
@NM00151 DS    CL9                                                      02285000
@NM00152 DC    CL40'GP REGS STORED ARE VALID (GP)'                      02286000
GPREGS   DS    CL1                                                      02287000
         ORG   LINE24+134                                               02288000
LINE25   DC    CL134'0'                                                 02289000
         ORG   LINE25                                                   02290000
@NM00153 DS    CL1                                                      02291000
@NM00154 DC    X'09'                                                    02292000
@NM00155 DC    CL4' '                                                   02293000
@NM00156 DC    CL40'CONTROL REGS STORED ARE VALID (CR)'                 02294000
CREGS    DS    CL1                                                      02295000
@NM00157 DS    CL9                                                      02296000
@NM00158 DC    CL40'EXTENDED LOGOUT AREA VALID (LG)'                    02297000
ELOGOUT  DS    CL1                                                      02298000
         ORG   LINE25+134                                               02299000
LINE26   DC    CL134'0'                                                 02300000
         ORG   LINE26                                                   02301000
@NM00159 DS    CL1                                                      02302000
@NM00160 DC    X'09'                                                    02303000
@NM00161 DC    CL4' '                                                   02304000
@NM00162 DC    CL40'STORAGE LOGICAL VALID (ST)'                         02305000
STLOG    DS    CL1                                                      02306000
@NM00163 DS    CL9                                                      02307000
@NM00164 DC    CL40'EXT DAMAGE CODE VALID'                              02308000
EDAMCOD  DS    CL1                                                      02309000
         ORG   LINE26+134                                               02310000
LINE26A  DC    CL134'0'                                                 02311000
         ORG   LINE26A                                                  02312000
@NM00165 DS    CL1                                                      02313000
@NM00166 DC    X'09'                                                    02314000
@NM00167 DC    CL32' '                                                  02315000
@NM00168 DC    CL28'--- LRB MAY NOT BE VALID'                           02316000
INVLRB   DS    CL1                                                      02317000
@NM00169 DC    CL4' ---'                                                02318000
         ORG   LINE26A+134                                              02319000
LINE27   DC    CL134'0'                                                 02320000
         ORG   LINE27                                                   02321000
@NM00170 DS    CL1                                                      02322000
@NM00171 DC    X'09'                                                    02323000
@NM00172 DC    CL4' '                                                   02324000
@NM00173 DC    CL36'EXTENDED LOGOUT LENGTH'                             02325000
ELOGLEN  DS    CL5                                                      02326000
         ORG   LINE27+134                                               02327000
LINE28A  DC    CL134'0'                                                 02328000
         ORG   LINE28A                                                  02329000
@NM00174 DS    CL1                                                      02330000
@NM00175 DC    X'09'                                                    02331000
@NM00176 DC    CL36'MC STATUS FIELD'                                    02332000
@NM00177 DS    CL3                                                      02333000
         ORG   @NM00177+0                                               02334000
MCSTAT   DS    CL2                                                      02335000
@NM00178 DS    CL1                                                      02336000
         ORG   LINE28A+134                                              02337000
LINE28C  DC    CL134'0'                                                 02338000
         ORG   LINE28C                                                  02339000
@NM00179 DS    CL1                                                      02340000
@NM00180 DC    X'09'                                                    02341000
@NM00181 DC    CL30' '                                                  02342000
@NM00182 DC    CL36'EXTERNAL DAMAGE CODE'                               02343000
         ORG   LINE28C+134                                              02344000
LINE28D  DC    CL134'0'                                                 02345000
         ORG   LINE28D                                                  02346000
@NM00183 DS    CL1                                                      02347000
@NM00184 DC    X'09'                                                    02348000
@NM00185 DC    CL4' '                                                   02349000
@NM00186 DC    CL40'RESERVED'                                           02350000
RESV     DS    CL1                                                      02351000
@NM00187 DS    CL9                                                      02352000
@NM00188 DC    CL40'CHANNEL CNTL FAILURE'                               02353000
MCCF     DS    CL1                                                      02354000
         ORG   LINE28D+134                                              02355000
LINE28E  DC    CL134'0'                                                 02356000
         ORG   LINE28E                                                  02357000
@NM00189 DS    CL1                                                      02358000
@NM00190 DC    X'09'                                                    02359000
@NM00191 DC    CL4' '                                                   02360000
@NM00192 DC    CL40'CHANNEL OPERATIONAL'                                02361000
MCOPR    DS    CL1                                                      02362000
@NM00193 DS    CL9                                                      02363000
@NM00194 DC    CL40'I/O INSTRUCTION TIMEOUT'                            02364000
MINST    DS    CL1                                                      02365000
         ORG   LINE28E+134                                              02366000
LINE28F  DC    CL134'0'                                                 02367000
         ORG   LINE28F                                                  02368000
@NM00195 DS    CL1                                                      02369000
@NM00196 DC    X'09'                                                    02370000
@NM00197 DC    CL4' '                                                   02371000
@NM00198 DC    CL40'EXT SECONDARY REPORT'                               02372000
MEXSR    DS    CL1                                                      02373000
@NM00199 DS    CL9                                                      02374000
@NM00200 DC    CL40'I/O INTERRUPTION TIMEOUT'                           02375000
MINTR    DS    CL1                                                      02376000
         ORG   LINE28F+134                                              02377000
LINE28G  DC    CL134'0'                                                 02378000
         ORG   LINE28G                                                  02379000
@NM00201 DS    CL1                                                      02380000
@NM00202 DC    X'09'                                                    02381000
@NM00203 DC    CL4' '                                                   02382000
@NM00204 DC    CL40'CHANNEL NOT OPERATIONAL'                            02383000
MCNOP    DS    CL1                                                      02384000
@NM00205 DS    CL9                                                      02385000
@NM00206 DC    CL40'DISCOUNT CHANNEL SET FAILURE'                       02386000
MDISC    DS    CL1                                                      02387000
         ORG   LINE28G+134                                              02388000
LINE28B  DC    CL134'0'                                                 02389000
         ORG   LINE28B                                                  02390000
@NM00207 DS    CL1                                                      02391000
@NM00208 DC    X'09'                                                    02392000
@NM00209 DC    CL30' '                                                  02393000
@NM00210 DC    CL36'STATUS LOG'                                         02394000
         ORG   LINE28B+134                                              02395000
LINE29   DC    CL134'0'                                                 02396000
         ORG   LINE29                                                   02397000
@NM00211 DS    CL1                                                      02398000
@NM00212 DC    X'09'                                                    02399000
@NM00213 DC    CL9' '                                                   02400000
@NM00214 DC    CL18'MK INTRPT CODE'                                     02401000
@NM00215 DS    CL3                                                      02402000
         ORG   @NM00215+0                                               02403000
MKINT    DS    CL2                                                      02404000
@NM00216 DS    CL1                                                      02405000
         ORG   LINE29+134                                               02406000
LINE36   DC    CL134'0'                                                 02407000
         ORG   LINE36                                                   02408000
@NM00217 DS    CL1                                                      02409000
@NM00218 DC    X'09'                                                    02410000
@NM00219 DC    CL30' '                                                  02411000
@NM00220 DC    CL30'FPRS - GPRS'                                        02412000
         ORG   LINE36+134                                               02413000
LINE37   DC    CL134'0'                                                 02414000
         ORG   LINE37                                                   02415000
@NM00221 DS    CL1                                                      02416000
@NM00222 DC    X'09'                                                    02417000
@NM00223 DC    CL6' '                                                   02418000
@NM00224 DC    CL5'FPR0'                                                02419000
@NM00225 DS    CL3                                                      02420000
         ORG   @NM00225+0                                               02421000
FPR0     DS    CL2                                                      02422000
@NM00226 DS    CL1                                                      02423000
         ORG   LINE37+37                                                02424000
@NM00227 DS    CL7                                                      02425000
@NM00228 DC    CL5'FPR2'                                                02426000
@NM00229 DS    CL3                                                      02427000
         ORG   @NM00229+0                                               02428000
FPR2     DS    CL2                                                      02429000
@NM00230 DS    CL1                                                      02430000
         ORG   LINE37+134                                               02431000
LINE38   DC    CL134'0'                                                 02432000
         ORG   LINE38                                                   02433000
@NM00231 DS    CL1                                                      02434000
@NM00232 DC    X'09'                                                    02435000
@NM00233 DC    CL6' '                                                   02436000
@NM00234 DC    CL5'FPR4'                                                02437000
@NM00235 DS    CL3                                                      02438000
         ORG   @NM00235+0                                               02439000
FPR4     DS    CL2                                                      02440000
@NM00236 DS    CL1                                                      02441000
         ORG   LINE38+37                                                02442000
@NM00237 DS    CL7                                                      02443000
@NM00238 DC    CL5'FPR6'                                                02444000
@NM00239 DS    CL3                                                      02445000
         ORG   @NM00239+0                                               02446000
FPR6     DS    CL2                                                      02447000
@NM00240 DS    CL1                                                      02448000
         ORG   LINE38+134                                               02449000
LINE39   DC    CL134'0'                                                 02450000
         ORG   LINE39                                                   02451000
@NM00241 DS    CL1                                                      02452000
@NM00242 DC    X'09'                                                    02453000
@NM00243 DC    CL3' '                                                   02454000
@NM00244 DC    CL5'GPR0'                                                02455000
@NM00245 DS    CL3                                                      02456000
         ORG   @NM00245+0                                               02457000
GPR0     DS    CL2                                                      02458000
@NM00246 DS    CL1                                                      02459000
         ORG   LINE39+22                                                02460000
@NM00247 DS    CL1                                                      02461000
@NM00248 DC    CL5'GPR1'                                                02462000
@NM00249 DS    CL3                                                      02463000
         ORG   @NM00249+0                                               02464000
GPR1     DS    CL2                                                      02465000
@NM00250 DS    CL1                                                      02466000
         ORG   LINE39+40                                                02467000
@NM00251 DC    CL5'GPR2'                                                02468000
@NM00252 DS    CL3                                                      02469000
         ORG   @NM00252+0                                               02470000
GPR2     DS    CL2                                                      02471000
@NM00253 DS    CL1                                                      02472000
         ORG   LINE39+57                                                02473000
@NM00254 DS    CL1                                                      02474000
@NM00255 DC    CL5'GPR3'                                                02475000
@NM00256 DS    CL3                                                      02476000
         ORG   @NM00256+0                                               02477000
GPR3     DS    CL2                                                      02478000
@NM00257 DS    CL1                                                      02479000
         ORG   LINE39+134                                               02480000
LINE40   DC    CL134'0'                                                 02481000
         ORG   LINE40                                                   02482000
@NM00258 DS    CL1                                                      02483000
@NM00259 DC    X'09'                                                    02484000
@NM00260 DC    CL3' '                                                   02485000
@NM00261 DC    CL5'GPR4'                                                02486000
@NM00262 DS    CL3                                                      02487000
         ORG   @NM00262+0                                               02488000
GPR4     DS    CL2                                                      02489000
@NM00263 DS    CL1                                                      02490000
         ORG   LINE40+22                                                02491000
@NM00264 DS    CL1                                                      02492000
@NM00265 DC    CL5'GPR5'                                                02493000
@NM00266 DS    CL3                                                      02494000
         ORG   @NM00266+0                                               02495000
GPR5     DS    CL2                                                      02496000
@NM00267 DS    CL1                                                      02497000
         ORG   LINE40+40                                                02498000
@NM00268 DC    CL5'GPR6'                                                02499000
@NM00269 DS    CL3                                                      02500000
         ORG   @NM00269+0                                               02501000
GPR6     DS    CL2                                                      02502000
@NM00270 DS    CL1                                                      02503000
         ORG   LINE40+57                                                02504000
@NM00271 DS    CL1                                                      02505000
@NM00272 DC    CL5'GPR7'                                                02506000
@NM00273 DS    CL3                                                      02507000
         ORG   @NM00273+0                                               02508000
GPR7     DS    CL2                                                      02509000
@NM00274 DS    CL1                                                      02510000
         ORG   LINE40+134                                               02511000
LINE41   DC    CL134'0'                                                 02512000
         ORG   LINE41                                                   02513000
@NM00275 DS    CL1                                                      02514000
@NM00276 DC    X'09'                                                    02515000
@NM00277 DC    CL3' '                                                   02516000
@NM00278 DC    CL5'GPR8'                                                02517000
@NM00279 DS    CL3                                                      02518000
         ORG   @NM00279+0                                               02519000
GPR8     DS    CL2                                                      02520000
@NM00280 DS    CL1                                                      02521000
         ORG   LINE41+22                                                02522000
@NM00281 DS    CL1                                                      02523000
@NM00282 DC    CL5'GPR9'                                                02524000
@NM00283 DS    CL3                                                      02525000
         ORG   @NM00283+0                                               02526000
GPR9     DS    CL2                                                      02527000
@NM00284 DS    CL1                                                      02528000
         ORG   LINE41+40                                                02529000
@NM00285 DC    CL5'GPRA'                                                02530000
@NM00286 DS    CL3                                                      02531000
         ORG   @NM00286+0                                               02532000
GPRA     DS    CL2                                                      02533000
@NM00287 DS    CL1                                                      02534000
         ORG   LINE41+57                                                02535000
@NM00288 DS    CL1                                                      02536000
@NM00289 DC    CL5'GPRB'                                                02537000
@NM00290 DS    CL3                                                      02538000
         ORG   @NM00290+0                                               02539000
GPRB     DS    CL2                                                      02540000
@NM00291 DS    CL1                                                      02541000
         ORG   LINE41+134                                               02542000
LINE42   DC    CL134'0'                                                 02543000
         ORG   LINE42                                                   02544000
@NM00292 DS    CL1                                                      02545000
@NM00293 DC    X'09'                                                    02546000
@NM00294 DC    CL3' '                                                   02547000
@NM00295 DC    CL5'GPRC'                                                02548000
@NM00296 DS    CL3                                                      02549000
         ORG   @NM00296+0                                               02550000
GPRC     DS    CL2                                                      02551000
@NM00297 DS    CL1                                                      02552000
         ORG   LINE42+22                                                02553000
@NM00298 DS    CL1                                                      02554000
@NM00299 DC    CL5'GPRD'                                                02555000
@NM00300 DS    CL3                                                      02556000
         ORG   @NM00300+0                                               02557000
GPRD     DS    CL2                                                      02558000
@NM00301 DS    CL1                                                      02559000
         ORG   LINE42+40                                                02560000
@NM00302 DC    CL5'GPRE'                                                02561000
@NM00303 DS    CL3                                                      02562000
         ORG   @NM00303+0                                               02563000
GPRE     DS    CL2                                                      02564000
@NM00304 DS    CL1                                                      02565000
         ORG   LINE42+57                                                02566000
@NM00305 DS    CL1                                                      02567000
@NM00306 DC    CL5'GPRF'                                                02568000
@NM00307 DS    CL3                                                      02569000
         ORG   @NM00307+0                                               02570000
GPRF     DS    CL2                                                      02571000
@NM00308 DS    CL1                                                      02572000
         ORG   LINE42+134                                               02573000
LINE43   DC    CL134'0'                                                 02574000
         ORG   LINE43                                                   02575000
@NM00309 DS    CL1                                                      02576000
@NM00310 DC    X'09'                                                    02577000
@NM00311 DC    CL30' '                                                  02578000
@NM00312 DC    CL30'CONTROL REGS'                                       02579000
         ORG   LINE43+134                                               02580000
LINE44   DC    CL134'0'                                                 02581000
         ORG   LINE44                                                   02582000
@NM00313 DS    CL1                                                      02583000
@NM00314 DC    X'09'                                                    02584000
@NM00315 DC    CL3' '                                                   02585000
@NM00316 DC    CL5'ECR0'                                                02586000
@NM00317 DS    CL3                                                      02587000
         ORG   @NM00317+0                                               02588000
ECR0     DS    CL2                                                      02589000
@NM00318 DS    CL1                                                      02590000
         ORG   LINE44+22                                                02591000
@NM00319 DS    CL1                                                      02592000
@NM00320 DC    CL5'ECR1'                                                02593000
@NM00321 DS    CL3                                                      02594000
         ORG   @NM00321+0                                               02595000
ECR1     DS    CL2                                                      02596000
@NM00322 DS    CL1                                                      02597000
         ORG   LINE44+40                                                02598000
@NM00323 DC    CL5'ECR2'                                                02599000
@NM00324 DS    CL3                                                      02600000
         ORG   @NM00324+0                                               02601000
ECR2     DS    CL2                                                      02602000
@NM00325 DS    CL1                                                      02603000
         ORG   LINE44+57                                                02604000
@NM00326 DS    CL1                                                      02605000
@NM00327 DC    CL5'ECR3'                                                02606000
@NM00328 DS    CL3                                                      02607000
         ORG   @NM00328+0                                               02608000
ECR3     DS    CL2                                                      02609000
@NM00329 DS    CL1                                                      02610000
         ORG   LINE44+134                                               02611000
LINE45   DC    CL134'0'                                                 02612000
         ORG   LINE45                                                   02613000
@NM00330 DS    CL1                                                      02614000
@NM00331 DC    X'09'                                                    02615000
@NM00332 DC    CL3' '                                                   02616000
@NM00333 DC    CL5'ECR4'                                                02617000
@NM00334 DS    CL3                                                      02618000
         ORG   @NM00334+0                                               02619000
ECR4     DS    CL2                                                      02620000
@NM00335 DS    CL1                                                      02621000
         ORG   LINE45+22                                                02622000
@NM00336 DS    CL1                                                      02623000
@NM00337 DC    CL5'ECR5'                                                02624000
@NM00338 DS    CL3                                                      02625000
         ORG   @NM00338+0                                               02626000
ECR5     DS    CL2                                                      02627000
@NM00339 DS    CL1                                                      02628000
         ORG   LINE45+40                                                02629000
@NM00340 DC    CL5'ECR6'                                                02630000
@NM00341 DS    CL3                                                      02631000
         ORG   @NM00341+0                                               02632000
ECR6     DS    CL2                                                      02633000
@NM00342 DS    CL1                                                      02634000
         ORG   LINE45+57                                                02635000
@NM00343 DS    CL1                                                      02636000
@NM00344 DC    CL5'ECR7'                                                02637000
@NM00345 DS    CL3                                                      02638000
         ORG   @NM00345+0                                               02639000
ECR7     DS    CL2                                                      02640000
@NM00346 DS    CL1                                                      02641000
         ORG   LINE45+134                                               02642000
LINE46   DC    CL134'0'                                                 02643000
         ORG   LINE46                                                   02644000
@NM00347 DS    CL1                                                      02645000
@NM00348 DC    X'09'                                                    02646000
@NM00349 DC    CL3' '                                                   02647000
@NM00350 DC    CL5'ECR8'                                                02648000
@NM00351 DS    CL3                                                      02649000
         ORG   @NM00351+0                                               02650000
ECR8     DS    CL2                                                      02651000
@NM00352 DS    CL1                                                      02652000
         ORG   LINE46+22                                                02653000
@NM00353 DS    CL1                                                      02654000
@NM00354 DC    CL5'ECR9'                                                02655000
@NM00355 DS    CL3                                                      02656000
         ORG   @NM00355+0                                               02657000
ECR9     DS    CL2                                                      02658000
@NM00356 DS    CL1                                                      02659000
         ORG   LINE46+40                                                02660000
@NM00357 DC    CL5'ECRA'                                                02661000
@NM00358 DS    CL3                                                      02662000
         ORG   @NM00358+0                                               02663000
ECRA     DS    CL2                                                      02664000
@NM00359 DS    CL1                                                      02665000
         ORG   LINE46+57                                                02666000
@NM00360 DS    CL1                                                      02667000
@NM00361 DC    CL5'ECRB'                                                02668000
@NM00362 DS    CL3                                                      02669000
         ORG   @NM00362+0                                               02670000
ECRB     DS    CL2                                                      02671000
@NM00363 DS    CL1                                                      02672000
         ORG   LINE46+134                                               02673000
LINE47   DC    CL134'0'                                                 02674000
         ORG   LINE47                                                   02675000
@NM00364 DS    CL1                                                      02676000
@NM00365 DC    X'09'                                                    02677000
@NM00366 DC    CL3' '                                                   02678000
@NM00367 DC    CL5'ECRC'                                                02679000
@NM00368 DS    CL3                                                      02680000
         ORG   @NM00368+0                                               02681000
ECRC     DS    CL2                                                      02682000
@NM00369 DS    CL1                                                      02683000
         ORG   LINE47+22                                                02684000
@NM00370 DS    CL1                                                      02685000
@NM00371 DC    CL5'ECRD'                                                02686000
@NM00372 DS    CL3                                                      02687000
         ORG   @NM00372+0                                               02688000
ECRD     DS    CL2                                                      02689000
@NM00373 DS    CL1                                                      02690000
         ORG   LINE47+40                                                02691000
@NM00374 DC    CL5'ECRE'                                                02692000
@NM00375 DS    CL3                                                      02693000
         ORG   @NM00375+0                                               02694000
ECRE     DS    CL2                                                      02695000
@NM00376 DS    CL1                                                      02696000
         ORG   LINE47+57                                                02697000
@NM00377 DS    CL1                                                      02698000
@NM00378 DC    CL5'ECRF'                                                02699000
@NM00379 DS    CL3                                                      02700000
         ORG   @NM00379+0                                               02701000
ECRF     DS    CL2                                                      02702000
@NM00380 DS    CL1                                                      02703000
         ORG   LINE47+134                                               02704000
BLIN1    DC    CL134'0'                                                 02705000
         ORG   BLIN1                                                    02706000
@NM00381 DS    CL1                                                      02707000
@NM00382 DC    X'09'                                                    02708000
@NM00383 DS    CL51                                                     02709000
@NM00384 DC    CL30'MACHINE-CHECK-ERROR INDICATORS'                     02710000
         ORG   BLIN1+134                                                02711000
BLIN2    DC    CL134'0'                                                 02712000
         ORG   BLIN2                                                    02713000
@NM00385 DS    CL1                                                      02714000
@NM00386 DC    X'09'                                                    02715000
@NM00387 DC    CL31'TERMINAL ERROR FLAGS'                               02716000
@NM00388 DC    CL31'HARD-MACHINE ERROR FLAGS'                           02717000
@NM00389 DC    CL31'INTERMEDIATE ERROR'                                 02718000
@NM00390 DC    CL31'SOFT-MACHINE ERROR FLAGS'                           02719000
         ORG   BLIN2+134                                                02720000
BLIN3    DC    CL134'0'                                                 02721000
         ORG   BLIN3                                                    02722000
@NM00391 DS    CL1                                                      02723000
@NM00392 DC    X'09'                                                    02724000
@NM00393 DC    CL25'RESERVED'                                           02725000
BLIN3P1  DS    CL1                                                      02726000
@NM00394 DS    CL5                                                      02727000
@NM00395 DC    CL25'ASSUMED HD ERR FLG'                                 02728000
BLIN3P2  DS    CL1                                                      02729000
@NM00396 DS    CL5                                                      02730000
@NM00397 DC    CL25'RESERVED'                                           02731000
BLIN3P3  DS    CL1                                                      02732000
@NM00398 DS    CL5                                                      02733000
@NM00399 DC    CL25'ASSUMED SOFT ERROR'                                 02734000
BLIN3P4  DS    CL1                                                      02735000
         ORG   BLIN3+134                                                02736000
BLIN4    DC    CL134'0'                                                 02737000
         ORG   BLIN4                                                    02738000
@NM00400 DS    CL1                                                      02739000
@NM00401 DC    X'09'                                                    02740000
@NM00402 DC    CL25'RESERVED'                                           02741000
BLIN4P1  DS    CL1                                                      02742000
@NM00403 DS    CL5                                                      02743000
@NM00404 DC    CL25'RESERVED'                                           02744000
BLIN4P2  DS    CL1                                                      02745000
@NM00405 DS    CL5                                                      02746000
@NM00406 DC    CL25'RESERVED'                                           02747000
BLIN4P3  DS    CL1                                                      02748000
@NM00407 DS    CL5                                                      02749000
@NM00408 DC    CL25'RESERVED'                                           02750000
BLIN4P4  DS    CL1                                                      02751000
         ORG   BLIN4+134                                                02752000
BLIN5    DC    CL134'0'                                                 02753000
         ORG   BLIN5                                                    02754000
@NM00409 DS    CL1                                                      02755000
@NM00410 DC    X'09'                                                    02756000
@NM00411 DC    CL25'RESERVED'                                           02757000
BLIN5P1  DS    CL1                                                      02758000
@NM00412 DS    CL5                                                      02759000
@NM00413 DC    CL25'RESERVED'                                           02760000
BLIN5P2  DS    CL1                                                      02761000
@NM00414 DS    CL5                                                      02762000
@NM00415 DC    CL25'RESERVED'                                           02763000
BLIN5P3  DS    CL1                                                      02764000
@NM00416 DS    CL5                                                      02765000
@NM00417 DC    CL25'RESERVED'                                           02766000
BLIN5P4  DS    CL1                                                      02767000
         ORG   BLIN5+134                                                02768000
BLIN6    DC    CL134'0'                                                 02769000
         ORG   BLIN6                                                    02770000
@NM00418 DS    CL1                                                      02771000
@NM00419 DC    X'09'                                                    02772000
@NM00420 DC    CL25'SECONDARY ERROR FLAG'                               02773000
BLIN6P1  DS    CL1                                                      02774000
@NM00421 DS    CL5                                                      02775000
@NM00422 DC    CL25'RESERVED'                                           02776000
BLIN6P2  DS    CL1                                                      02777000
@NM00423 DS    CL5                                                      02778000
@NM00424 DC    CL25'RESERVED'                                           02779000
BLIN6P3  DS    CL1                                                      02780000
@NM00425 DS    CL5                                                      02781000
@NM00426 DC    CL25'RESERVED'                                           02782000
BLIN6P4  DS    CL1                                                      02783000
         ORG   BLIN6+134                                                02784000
BLIN7    DC    CL134'0'                                                 02785000
         ORG   BLIN7                                                    02786000
@NM00427 DS    CL1                                                      02787000
@NM00428 DC    X'09'                                                    02788000
@NM00429 DC    CL25'CHECK STOP FLAG'                                    02789000
BLIN7P1  DS    CL1                                                      02790000
@NM00430 DS    CL5                                                      02791000
@NM00431 DC    CL25'REG/BW INVALID FLAG'                                02792000
BLIN7P2  DS    CL1                                                      02793000
@NM00432 DS    CL5                                                      02794000
@NM00433 DC    CL25'TOD CLOCK ERROR FLAG'                               02795000
BLIN7P3  DS    CL1                                                      02796000
@NM00434 DS    CL5                                                      02797000
@NM00435 DC    CL25'EXT DAMAGE FLAG'                                    02798000
BLIN7P4  DS    CL1                                                      02799000
         ORG   BLIN7+134                                                02800000
BLIN8    DC    CL134'0'                                                 02801000
         ORG   BLIN8                                                    02802000
@NM00436 DS    CL1                                                      02803000
@NM00437 DC    X'09'                                                    02804000
@NM00438 DC    CL25'POWER WARNING FLAG'                                 02805000
BLIN8P1  DS    CL1                                                      02806000
@NM00439 DS    CL5                                                      02807000
@NM00440 DC    CL25'HARD STOR. ERR. FLAG'                               02808000
BLIN8P2  DS    CL1                                                      02809000
@NM00441 DS    CL5                                                      02810000
@NM00442 DC    CL25'CLOCK COMP ERR. FLAG'                               02811000
BLIN8P3  DS    CL1                                                      02812000
@NM00443 DS    CL5                                                      02813000
@NM00444 DC    CL25'ECC CORR. STOR. ERR. FLAG'                          02814000
BLIN8P4  DS    CL1                                                      02815000
         ORG   BLIN8+134                                                02816000
BLIN9    DC    CL134'0'                                                 02817000
         ORG   BLIN9                                                    02818000
@NM00445 DS    CL1                                                      02819000
@NM00446 DC    X'09'                                                    02820000
@NM00447 DC    CL25'SYS DAMAGE FLAG'                                    02821000
BLIN9P1  DS    CL1                                                      02822000
@NM00448 DS    CL5                                                      02823000
@NM00449 DC    CL25'HARD PROTECT. KEY ERR'                              02824000
BLIN9P2  DS    CL1                                                      02825000
@NM00450 DS    CL5                                                      02826000
@NM00451 DC    CL25'CPU TIMER ERR. FLAG'                                02827000
BLIN9P3  DS    CL1                                                      02828000
@NM00452 DS    CL5                                                      02829000
@NM00453 DC    CL25'HIR CORR PROC. ERR FLG'                             02830000
BLIN9P4  DS    CL1                                                      02831000
         ORG   BLIN9+134                                                02832000
BLIN10   DC    CL134'0'                                                 02833000
         ORG   BLIN10                                                   02834000
@NM00454 DS    CL1                                                      02835000
@NM00455 DC    X'09'                                                    02836000
@NM00456 DC    CL25'INVALID LOGOUT FLAG'                                02837000
BLIN10P1 DS    CL1                                                      02838000
@NM00457 DS    CL5                                                      02839000
@NM00458 DC    CL25'INST. PROC. DAMAGE FLAG'                            02840000
BLIN10P2 DS    CL1                                                      02841000
@NM00459 DS    CL5                                                      02842000
@NM00460 DC    CL25'INTERVAL TIMER ERR. FLAG'                           02843000
BLIN10P3 DS    CL1                                                      02844000
@NM00461 DS    CL5                                                      02845000
@NM00462 DC    CL25'BUFFER ERR. FLAG'                                   02846000
BLIN10P4 DS    CL1                                                      02847000
         ORG   BLIN10+134                                               02848000
BLIN11A  DC    CL134'0'                                                 02849000
         ORG   BLIN11A                                                  02850000
@NM00463 DS    CL1                                                      02851000
@NM00464 DC    X'09'                                                    02852000
@NM00465 DS    CL29                                                     02853000
@NM00466 DC    CL50'PROGRAM DAMAGE ASSESSMENT AND REPAIR'               02854000
         ORG   BLIN11A+134                                              02855000
BLIN11   DC    CL134'0'                                                 02856000
         ORG   BLIN11                                                   02857000
@NM00467 DS    CL1                                                      02858000
@NM00468 DC    X'09'                                                    02859000
@NM00469 DC    CL35'PDAR DATA'                                          02860000
@NM00470 DC    CL35'STOR. RECONFIG.STATUS'                              02861000
@NM00471 DC    CL35'STORAGE RECONFIG. STATUS'                           02862000
         ORG   BLIN11+134                                               02863000
BLIN12   DC    CL134'0'                                                 02864000
         ORG   BLIN12                                                   02865000
@NM00472 DS    CL1                                                      02866000
@NM00473 DC    X'09'                                                    02867000
@NM00474 DC    CL29'RESERVED'                                           02868000
BLIN12P1 DS    CL1                                                      02869000
@NM00475 DS    CL5                                                      02870000
@NM00476 DC    CL29'RESERVED'                                           02871000
BLIN12P2 DS    CL1                                                      02872000
@NM00477 DS    CL5                                                      02873000
@NM00478 DC    CL29'FR OFF LN/SCHED OFF LN'                             02874000
BLIN12P3 DS    CL1                                                      02875000
         ORG   BLIN12+134                                               02876000
BLIN13   DC    CL134'0'                                                 02877000
         ORG   BLIN13                                                   02878000
@NM00479 DS    CL1                                                      02879000
@NM00480 DC    X'09'                                                    02880000
@NM00481 DC    CL29'RESERVED'                                           02881000
BLIN13P1 DS    CL1                                                      02882000
@NM00482 DS    CL5                                                      02883000
@NM00483 DC    CL29'RESERVED'                                           02884000
BLIN13P2 DS    CL1                                                      02885000
@NM00484 DS    CL5                                                      02886000
@NM00485 DC    CL29'INTERCEPT'                                          02887000
BLIN13P3 DS    CL1                                                      02888000
         ORG   BLIN13+134                                               02889000
BLIN14   DC    CL134'0'                                                 02890000
         ORG   BLIN14                                                   02891000
@NM00486 DS    CL1                                                      02892000
@NM00487 DC    X'09'                                                    02893000
@NM00488 DC    CL29'RESERVED'                                           02894000
BLIN14P1 DS    CL1                                                      02895000
@NM00489 DS    CL5                                                      02896000
@NM00490 DC    CL29'RESERVED'                                           02897000
BLIN14P2 DS    CL1                                                      02898000
@NM00491 DS    CL5                                                      02899000
@NM00492 DC    CL29'PERM. ERR. IN FRAME'                                02900000
BLIN14P3 DS    CL1                                                      02901000
         ORG   BLIN14+134                                               02902000
BLIN15   DC    CL134'0'                                                 02903000
         ORG   BLIN15                                                   02904000
@NM00493 DS    CL1                                                      02905000
@NM00494 DC    X'09'                                                    02906000
@NM00495 DC    CL29'STORAGE RECONFIG.'                                  02907000
BLIN15P1 DS    CL1                                                      02908000
@NM00496 DS    CL5                                                      02909000
@NM00497 DC    CL29'RESERVED'                                           02910000
BLIN15P2 DS    CL1                                                      02911000
@NM00498 DS    CL5                                                      02912000
@NM00499 DC    CL29'FRAME-PERM. RES. SYS.'                              02913000
BLIN15P3 DS    CL1                                                      02914000
         ORG   BLIN15+134                                               02915000
BLIN16   DC    CL134'0'                                                 02916000
         ORG   BLIN16                                                   02917000
@NM00500 DS    CL1                                                      02918000
@NM00501 DC    X'09'                                                    02919000
@NM00502 DC    CL29'STOR. REFIG. STST AVAIL.'                           02920000
BLIN16P1 DS    CL1                                                      02921000
@NM00503 DS    CL5                                                      02922000
@NM00504 DC    CL29'RESERVED'                                           02923000
BLIN16P2 DS    CL1                                                      02924000
@NM00505 DS    CL5                                                      02925000
@NM00506 DC    CL29'FRAME USE SQA'                                      02926000
BLIN16P3 DS    CL1                                                      02927000
         ORG   BLIN16+134                                               02928000
BLIN17   DC    CL134'0'                                                 02929000
         ORG   BLIN17                                                   02930000
@NM00507 DS    CL1                                                      02931000
@NM00508 DC    X'09'                                                    02932000
@NM00509 DC    CL29'STOR. REFIG. NOT ATTEMP.'                           02933000
BLIN17P1 DS    CL1                                                      02934000
@NM00510 DS    CL5                                                      02935000
@NM00511 DC    CL29'RESERVED'                                           02936000
BLIN17P2 DS    CL1                                                      02937000
@NM00512 DS    CL5                                                      02938000
@NM00513 DC    CL29'FRAME USE LSQA'                                     02939000
BLIN17P3 DS    CL1                                                      02940000
         ORG   BLIN17+134                                               02941000
BLIN18   DC    CL134'0'                                                 02942000
         ORG   BLIN18                                                   02943000
@NM00514 DS    CL1                                                      02944000
@NM00515 DC    X'09'                                                    02945000
@NM00516 DC    CL29'RESERVED'                                           02946000
BLIN18P1 DS    CL1                                                      02947000
@NM00517 DS    CL5                                                      02948000
@NM00518 DC    CL29'STOR ERR SET IN FRAME'                              02949000
BLIN18P2 DS    CL1                                                      02950000
@NM00519 DS    CL5                                                      02951000
@NM00520 DC    CL29'FRAME-FIXED PG DATA'                                02952000
BLIN18P3 DS    CL1                                                      02953000
         ORG   BLIN18+134                                               02954000
BLIN19   DC    CL134'0'                                                 02955000
         ORG   BLIN19                                                   02956000
@NM00521 DS    CL1                                                      02957000
@NM00522 DC    X'09'                                                    02958000
@NM00523 DC    CL29'RESERVED'                                           02959000
BLIN19P1 DS    CL1                                                      02960000
@NM00524 DS    CL5                                                      02961000
@NM00525 DC    CL29'FRAME-CHG IND. ON'                                  02962000
BLIN19P2 DS    CL1                                                      02963000
@NM00526 DS    CL5                                                      02964000
@NM00527 DC    CL29'FRAME-IS V=R OR SCHED.'                             02965000
BLIN19P3 DS    CL1                                                      02966000
         ORG   BLIN19+134                                               02967000
BLIN20   DC    CL134'0'                                                 02968000
         ORG   BLIN20                                                   02969000
@NM00528 DS    CL1                                                      02970000
@NM00529 DC    X'09'                                                    02971000
@NM00530 DC    CL24'PHYSICAL WORD LENGTH'                               02972000
BLIN20P1 DS    CL5                                                      02973000
         ORG   BLIN20+134                                               02974000
WORK     DS    CL50                                                     02975000
DBLWORD  DS    CL8                                                      02976000
SWITCH1  DS    BL1                                                      02977000
SUPERZAP DC    3CL10'SUPERZAP'                                          02978000
CHARS    DC    CL1'0'                                                   02979000
         DC    CL1'1'                                                   02980000
         DC    CL1'2'                                                   02981000
         DC    CL1'3'                                                   02982000
         DC    CL1'4'                                                   02983000
         DC    CL1'5'                                                   02984000
         DC    CL1'6'                                                   02985000
         DC    CL1'7'                                                   02986000
         DC    CL1'8'                                                   02987000
         DC    CL1'9'                                                   02988000
         DC    CL1'A'                                                   02989000
         DC    CL1'B'                                                   02990000
         DC    CL1'C'                                                   02991000
         DC    CL1'D'                                                   02992000
         DC    CL1'E'                                                   02993000
         DC    CL1'F'                                                   02994000
IFCFRAMM CSECT                                                          02995000
        DC    S(SUPERZAP)                                               02996000
IFCFRAMM CSECT                                                          02997000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02998000
@01      EQU   01                                                       02999000
@02      EQU   02                                                       03000000
@03      EQU   03                                                       03001000
@04      EQU   04                                                       03002000
@05      EQU   05                                                       03003000
@06      EQU   06                                                       03004000
@07      EQU   07                                                       03005000
@08      EQU   08                                                       03006000
@09      EQU   09                                                       03007000
@10      EQU   10                                                       03008000
@11      EQU   11                                                       03009000
@12      EQU   12                                                       03010000
@13      EQU   13                                                       03011000
@14      EQU   14                                                       03012000
@15      EQU   15                                                       03013000
L        EQU   @03                                                      03014000
MYLINCT  EQU   @03                                                      03015000
R2       EQU   @02                                                      03016000
R7       EQU   @07                                                      03017000
R8       EQU   @08                                                      03018000
R9       EQU   @09                                                      03019000
R15      EQU   @15                                                      03020000
R0       EQU   @00                                                      03021000
R1       EQU   @01                                                      03022000
R10      EQU   @10                                                      03023000
R11      EQU   @11                                                      03024000
R12      EQU   @12                                                      03025000
R13      EQU   @13                                                      03026000
R14      EQU   @14                                                      03027000
R3       EQU   @03                                                      03028000
R4       EQU   @04                                                      03029000
R5       EQU   @05                                                      03030000
R6       EQU   @06                                                      03031000
IOHND    EQU   0                                                        03032000
PARM     EQU   0                                                        03033000
RECTYPE  EQU   PARM                                                     03034000
SWITCHES EQU   PARM+2                                                   03035000
DEBUG    EQU   PARM+4                                                   03036000
DEBUGA   EQU   PARM+8                                                   03037000
MISC     EQU   PARM+12                                                  03038000
PRINTES  EQU   MISC                                                     03039000
OPENCLSE EQU   PARM+13                                                  03040000
OPENIO   EQU   OPENCLSE                                                 03041000
CLOSEIO  EQU   OPENCLSE+2                                               03042000
DATENOW  EQU   PARM+17                                                  03043000
STDT     EQU   PARM+23                                                  03044000
STDATE   EQU   STDT                                                     03045000
PSTD     EQU   STDATE+1                                                 03046000
ENDDT    EQU   PARM+31                                                  03047000
ENDDATE  EQU   ENDDT                                                    03048000
PEND     EQU   ENDDATE+1                                                03049000
STTIME1  EQU   PARM+39                                                  03050000
ENDTIME1 EQU   PARM+43                                                  03051000
STTIME2  EQU   PARM+47                                                  03052000
ENDTIME2 EQU   PARM+51                                                  03053000
STRTDATE EQU   PARM+55                                                  03054000
@NM00007 EQU   PARM+75                                                  03055000
ERRID    EQU   PARM+92                                                  03056000
IDTIMEA  EQU   ERRID+6                                                  03057000
IDTIME   EQU   IDTIMEA                                                  03058000
CCHHRLNG EQU   PARM+112                                                 03059000
LINECT   EQU   PARM+120                                                 03060000
ADIOHND  EQU   PARM+124                                                 03061000
ADIFCMSG EQU   PARM+128                                                 03062000
ADEDITB  EQU   PARM+132                                                 03063000
EVPTR    EQU   PARM+136                                                 03064000
SORTADR  EQU   PARM+140                                                 03065000
PRINTADR EQU   PARM+148                                                 03066000
CUAPTR   EQU   PARM+152                                                 03067000
DEVPTR   EQU   PARM+156                                                 03068000
MODPTR   EQU   PARM+160                                                 03069000
SERPTR   EQU   PARM+164                                                 03070000
VOLPTR   EQU   PARM+168                                                 03071000
CPUPTR   EQU   PARM+172                                                 03072000
CPCUAPTR EQU   PARM+176                                                 03073000
LIBADPTR EQU   PARM+180                                                 03074000
SYMCDPTR EQU   PARM+184                                                 03075000
SYSUMPTR EQU   PARM+188                                                 03076000
TRENPTR  EQU   PARM+192                                                 03077000
SHAREPTR EQU   PARM+196                                                 03078000
RECLNGT1 EQU   PARM+204                                                 03079000
MERDCPTR EQU   PARM+208                                                 03080000
DUMPTABL EQU   PARM+228                                                 03081000
DUMPINFO EQU   DUMPTABL+4                                               03082000
TRENDONE EQU   0                                                        03083000
TREGEN   EQU   TRENDONE+8                                               03084000
TRECCH0  EQU   TREGEN+8                                                 03085000
TREND2   EQU   0                                                        03086000
TRENDKEY EQU   TREND2                                                   03087000
TRENDRT  EQU   TRENDKEY+1                                               03088000
TRENCPUS EQU   TRENDKEY+3                                               03089000
TRENDITM EQU   TRENDKEY+4                                               03090000
EVTABLE  EQU   0                                                        03091000
EVSTOP   EQU   EVTABLE                                                  03092000
EVKEY    EQU   EVTABLE+6                                                03093000
SORTABLE EQU   0                                                        03094000
SORTKEY  EQU   SORTABLE                                                 03095000
SORTCCHR EQU   SORTABLE+5                                               03096000
SYSUMONE EQU   0                                                        03097000
SYSUM2   EQU   0                                                        03098000
SYSUMKEY EQU   SYSUM2                                                   03099000
SYSRT    EQU   SYSUMKEY+1                                               03100000
SYSCPUS  EQU   SYSUMKEY+3                                               03101000
SYSITEM  EQU   SYSUMKEY+4                                               03102000
SHARE    EQU   0                                                        03103000
SHAREIO  EQU   SHARE+2                                                  03104000
SHRCUCPU EQU   SHAREIO                                                  03105000
SHARECUA EQU   SHRCUCPU                                                 03106000
EDITLOAD EQU   0                                                        03107000
EDITABLE EQU   EDITLOAD+4                                               03108000
CUA      EQU   0                                                        03109000
CUAVAL   EQU   CUA+2                                                    03110000
DEVICE   EQU   0                                                        03111000
MODELS   EQU   0                                                        03112000
DEVSERAL EQU   0                                                        03113000
VOLUME   EQU   0                                                        03114000
CPUS     EQU   0                                                        03115000
CPUCUAS  EQU   0                                                        03116000
CPUCUAV  EQU   CPUCUAS+2                                                03117000
LIBADR   EQU   0                                                        03118000
SYMCODE  EQU   0                                                        03119000
SYMVAL   EQU   SYMCODE+2                                                03120000
MERIDIAN EQU   0                                                        03121000
MCHREC   EQU   0                                                        03122000
LRBHTYPE EQU   MCHREC                                                   03123000
LRBHSYS  EQU   MCHREC+1                                                 03124000
LRBHSYS1 EQU   LRBHSYS                                                  03125000
LRBHSYS2 EQU   LRBHSYS                                                  03126000
LRBHSYS3 EQU   LRBHSYS                                                  03127000
LRBHSW1  EQU   MCHREC+3                                                 03128000
LRBMCHST EQU   LRBHSW1                                                  03129000
LRBMACT  EQU   MCHREC+4                                                 03130000
LRBERRID EQU   LRBMACT                                                  03131000
LRBHDATE EQU   MCHREC+8                                                 03132000
LRBHTIME EQU   MCHREC+12                                                03133000
LRBHCSER EQU   MCHREC+17                                                03134000
LRBHMDL  EQU   MCHREC+20                                                03135000
LRBPRGID EQU   MCHREC+24                                                03136000
LRBRLEN  EQU   LRBPRGID                                                 03137000
LRBWAIT  EQU   LRBPRGID+4                                               03138000
LRBJOBID EQU   MCHREC+32                                                03139000
LRBMTSEC EQU   LRBJOBID                                                 03140000
LRBMTCKS EQU   LRBJOBID                                                 03141000
LRBMTWRN EQU   LRBJOBID                                                 03142000
LRBMTDMG EQU   LRBJOBID                                                 03143000
LRBMTINV EQU   LRBJOBID                                                 03144000
LRBMHHRD EQU   LRBJOBID+1                                               03145000
LRBMHINV EQU   LRBJOBID+1                                               03146000
LRBMHSTO EQU   LRBJOBID+1                                               03147000
LRBMHSPF EQU   LRBJOBID+1                                               03148000
LRBMHIPD EQU   LRBJOBID+1                                               03149000
LRBMITOD EQU   LRBJOBID+2                                               03150000
LRBMICKC EQU   LRBJOBID+2                                               03151000
LRBMICTM EQU   LRBJOBID+2                                               03152000
LRBMIL80 EQU   LRBJOBID+2                                               03153000
LRBMSSFT EQU   LRBJOBID+3                                               03154000
LRBMSEXD EQU   LRBJOBID+3                                               03155000
LRBMSECC EQU   LRBJOBID+3                                               03156000
LRBMSHIR EQU   LRBJOBID+3                                               03157000
LRBMSBUF EQU   LRBJOBID+3                                               03158000
LRBMINVP EQU   LRBJOBID+4                                               03159000
LRBMRSRC EQU   LRBJOBID+4                                               03160000
LRBMRSRF EQU   LRBJOBID+4                                               03161000
LRBMSER  EQU   LRBJOBID+5                                               03162000
LRBMCHNG EQU   LRBJOBID+5                                               03163000
LRBMOFLN EQU   LRBJOBID+6                                               03164000
LRBMINTC EQU   LRBJOBID+6                                               03165000
LRBMSPER EQU   LRBJOBID+6                                               03166000
LRBMNUCL EQU   LRBJOBID+6                                               03167000
LRBMFSQA EQU   LRBJOBID+6                                               03168000
LRBMLSQA EQU   LRBJOBID+6                                               03169000
LRBMPGFX EQU   LRBJOBID+6                                               03170000
LRBMVEQR EQU   LRBJOBID+6                                               03171000
LRBMPWL  EQU   LRBJOBID+7                                               03172000
LRBMMOSW EQU   MCHREC+40                                                03173000
LRBMCIC  EQU   MCHREC+48                                                03174000
LRBMFSD  EQU   LRBMCIC                                                  03175000
LRBMFPD  EQU   LRBMCIC                                                  03176000
LRBMFSR  EQU   LRBMCIC                                                  03177000
LRBMFTD  EQU   LRBMCIC                                                  03178000
LRBMFCD  EQU   LRBMCIC                                                  03179000
LRBMFED  EQU   LRBMCIC                                                  03180000
LRBMFDG  EQU   LRBMCIC                                                  03181000
LRBMFWN  EQU   LRBMCIC+1                                                03182000
LRBMIBU  EQU   LRBMCIC+1                                                03183000
LRBMIDY  EQU   LRBMCIC+1                                                03184000
LRBMFSE  EQU   LRBMCIC+2                                                03185000
LRBMFSC  EQU   LRBMCIC+2                                                03186000
LRBMFKE  EQU   LRBMCIC+2                                                03187000
LRBMVWP  EQU   LRBMCIC+2                                                03188000
LRBMVMS  EQU   LRBMCIC+2                                                03189000
LRBMVPM  EQU   LRBMCIC+2                                                03190000
LRBMVIA  EQU   LRBMCIC+2                                                03191000
LRBMVFA  EQU   LRBMCIC+3                                                03192000
LRBMVRC  EQU   LRBMCIC+3                                                03193000
LRBMVED  EQU   LRBMCIC+3                                                03194000
LRBMVFP  EQU   LRBMCIC+3                                                03195000
LRBMVGR  EQU   LRBMCIC+3                                                03196000
LRBMVCR  EQU   LRBMCIC+3                                                03197000
LRBMVLG  EQU   LRBMCIC+3                                                03198000
LRBMVST  EQU   LRBMCIC+3                                                03199000
LRBMNVF  EQU   LRBMCIC+4                                                03200000
LRBMCELL EQU   LRBMCIC+6                                                03201000
LRBMF1   EQU   MCHREC+56                                                03202000
LRBMEDC  EQU   LRBMF1+4                                                 03203000
LRBRESV  EQU   LRBMEDC                                                  03204000
LRBMCOPR EQU   LRBMEDC                                                  03205000
LRBMEXSR EQU   LRBMEDC                                                  03206000
LRBMCNOP EQU   LRBMEDC                                                  03207000
LRBMCCF  EQU   LRBMEDC                                                  03208000
LRBMINST EQU   LRBMEDC                                                  03209000
LRBMINTR EQU   LRBMEDC                                                  03210000
LRBMDISC EQU   LRBMEDC                                                  03211000
@NM00548 EQU   MCHREC+68                                                03212000
@NM00549 EQU   @NM00548                                                 03213000
LRBFPR   EQU   @NM00548+100                                             03214000
LRBGPR   EQU   @NM00548+132                                             03215000
LRBECR   EQU   @NM00548+196                                             03216000
MCHERRID EQU   0                                                        03217000
LRBESEQ  EQU   MCHERRID                                                 03218000
LRBCPUID EQU   MCHERRID+2                                               03219000
LRBASID  EQU   MCHERRID+4                                               03220000
LRBETIME EQU   MCHERRID+6                                               03221000
IFCMSG   EQU   0                                                        03222000
BWORD2   EQU   0                                                        03223000
DADDR2   EQU   0                                                        03224000
BINWORD  EQU   0                                                        03225000
DECADDR  EQU   0                                                        03226000
NEXTBYTE EQU   0                                                        03227000
ADDNUM   EQU   0                                                        03228000
LENNUM   EQU   0                                                        03229000
LINENO   EQU   0                                                        03230000
TRECCH   EQU   TRECCH0                                                  03231000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03232000
LRBRETCR EQU   @NM00549+48                                              03233000
LRBECCTR EQU   @NM00549+44                                              03234000
LRBSTAT  EQU   @NM00549+40                                              03235000
LRBEMICM EQU   @NM00549+36                                              03236000
LRBMCRR  EQU   @NM00549+28                                              03237000
LRBMNTLH EQU   @NM00549+20                                              03238000
LRBMCDR  EQU   @NM00549+12                                              03239000
LRBMCAR  EQU   @NM00549+8                                               03240000
@NM00550 EQU   @NM00549                                                 03241000
LRBMFSA  EQU   MCHREC+64                                                03242000
@NM00547 EQU   LRBMF1                                                   03243000
LRBMVCC  EQU   LRBMCIC+5                                                03244000
LRBMVPT  EQU   LRBMCIC+5                                                03245000
@NM00546 EQU   LRBMCIC+5                                                03246000
@NM00545 EQU   LRBMCIC+4                                                03247000
@NM00544 EQU   LRBMCIC+2                                                03248000
@NM00543 EQU   LRBMCIC+1                                                03249000
@NM00542 EQU   LRBMCIC                                                  03250000
@NM00541 EQU   LRBJOBID+5                                               03251000
@NM00540 EQU   LRBJOBID+4                                               03252000
@NM00539 EQU   LRBJOBID+4                                               03253000
@NM00538 EQU   LRBJOBID+3                                               03254000
@NM00537 EQU   LRBJOBID+2                                               03255000
@NM00536 EQU   LRBJOBID+1                                               03256000
@NM00535 EQU   LRBJOBID                                                 03257000
LRBHMCEL EQU   MCHREC+22                                                03258000
@NM00534 EQU   MCHREC+16                                                03259000
@NM00533 EQU   MCHREC+7                                                 03260000
LRBHCNT  EQU   MCHREC+6                                                 03261000
LRBMCLB  EQU   MCHREC+5                                                 03262000
@NM00532 EQU   LRBMACT                                                  03263000
LRBMCHSY EQU   LRBHSW1                                                  03264000
@NM00531 EQU   LRBHSW1                                                  03265000
LRBHSW0  EQU   MCHREC+2                                                 03266000
MODEL    EQU   MERIDIAN+2                                               03267000
MRDNUMBR EQU   MERIDIAN                                                 03268000
SYMVAL2  EQU   SYMVAL+2                                                 03269000
SYMVAL1  EQU   SYMVAL                                                   03270000
SYMCDNUM EQU   SYMCODE                                                  03271000
LIBVAL   EQU   LIBADR+2                                                 03272000
LIBADNUM EQU   LIBADR                                                   03273000
CPUCUX3  EQU   CPUCUAV+5                                                03274000
CPUCUX2  EQU   CPUCUAV+3                                                03275000
CPUCUX1  EQU   CPUCUAV                                                  03276000
CPCUANUM EQU   CPUCUAS                                                  03277000
CPUVAL   EQU   CPUS+2                                                   03278000
CPUNUM   EQU   CPUS                                                     03279000
VOLVAL   EQU   VOLUME+2                                                 03280000
VOLNUM   EQU   VOLUME                                                   03281000
SERVAL   EQU   DEVSERAL+2                                               03282000
SERNUM   EQU   DEVSERAL                                                 03283000
MODVAL   EQU   MODELS+2                                                 03284000
MODNUM   EQU   MODELS                                                   03285000
MDRVAL   EQU   DEVICE+204                                               03286000
MDRNUM   EQU   DEVICE+202                                               03287000
DEVVAL   EQU   DEVICE+2                                                 03288000
DEVNUM   EQU   DEVICE                                                   03289000
CUA2     EQU   CUAVAL+2                                                 03290000
CUA1     EQU   CUAVAL                                                   03291000
CUANUM   EQU   CUA                                                      03292000
LOADPTR  EQU   EDITABLE+8                                               03293000
LOADNAME EQU   EDITABLE                                                 03294000
EDITNUM  EQU   EDITLOAD                                                 03295000
SHARLET  EQU   SHAREIO+10                                               03296000
SHARSERB EQU   SHAREIO+7                                                03297000
SHARECUB EQU   SHAREIO+5                                                03298000
SHARSERA EQU   SHRCUCPU+2                                               03299000
SHAREDX  EQU   SHARECUA                                                 03300000
SHARENUM EQU   SHARE                                                    03301000
SYSTEMP  EQU   SYSUM2+9                                                 03302000
SYSPERM  EQU   SYSUM2+7                                                 03303000
SYSDEV   EQU   SYSUM2+5                                                 03304000
SYSOLDA  EQU   SYSITEM                                                  03305000
SYS3705  EQU   SYSITEM                                                  03306000
SYSOLD   EQU   SYSCPUS                                                  03307000
SYSCPU   EQU   SYSCPUS                                                  03308000
SYSCUA   EQU   SYSRT                                                    03309000
SYSGROUP EQU   SYSUMKEY                                                 03310000
SYSUMEOD EQU   SYSUMONE+96                                              03311000
SYSUMPER EQU   SYSUMONE+92                                              03312000
SYSUMPEA EQU   SYSUMONE+88                                              03313000
SYSUMPEI EQU   SYSUMONE+84                                              03314000
SYSUMCH  EQU   SYSUMONE+20                                              03315000
SYSUMMCN EQU   SYSUMONE+16                                              03316000
SYSUMMCR EQU   SYSUMONE+12                                              03317000
SYSUMNXT EQU   SYSUMONE+8                                               03318000
SYSUMIPL EQU   SYSUMONE+4                                               03319000
SYSUMNUM EQU   SYSUMONE                                                 03320000
SORTCORE EQU   SORTCCHR                                                 03321000
SORTTIME EQU   SORTKEY+1                                                03322000
SORTYEAR EQU   SORTKEY                                                  03323000
EVLETTER EQU   EVKEY+5                                                  03324000
EVSERIAL EQU   EVKEY+2                                                  03325000
EVMODEL  EQU   EVKEY                                                    03326000
EVNUM    EQU   EVTABLE+4                                                03327000
EVDAY    EQU   EVSTOP+1                                                 03328000
EVYEAR   EQU   EVSTOP                                                   03329000
TRETMP   EQU   TREND2+10                                                03330000
TREPRM   EQU   TREND2+8                                                 03331000
TRENDDEV EQU   TREND2+6                                                 03332000
TRENDDAT EQU   TRENDKEY+5                                               03333000
TRENDOD  EQU   TRENDITM                                                 03334000
TREND037 EQU   TRENDITM                                                 03335000
TRENDOLD EQU   TRENCPUS                                                 03336000
TRENDCPU EQU   TRENCPUS                                                 03337000
@NM00011 EQU   TRENDRT+1                                                03338000
TRENDCUA EQU   TRENDRT                                                  03339000
TRENDGRP EQU   TRENDKEY                                                 03340000
TREPRE   EQU   TREGEN+72                                                03341000
TRECCHF  EQU   TREGEN+68                                                03342000
TRECCHE  EQU   TREGEN+64                                                03343000
TRECCHD  EQU   TREGEN+60                                                03344000
TRECCHC  EQU   TREGEN+56                                                03345000
TRECCHB  EQU   TREGEN+52                                                03346000
TRECCHA  EQU   TREGEN+48                                                03347000
TRECCH9  EQU   TREGEN+44                                                03348000
TRECCH8  EQU   TREGEN+40                                                03349000
TRECCH7  EQU   TREGEN+36                                                03350000
TRECCH6  EQU   TREGEN+32                                                03351000
TRECCH5  EQU   TREGEN+28                                                03352000
TRECCH4  EQU   TREGEN+24                                                03353000
TRECCH3  EQU   TREGEN+20                                                03354000
TRECCH2  EQU   TREGEN+16                                                03355000
TRECCH1  EQU   TREGEN+12                                                03356000
TREMCH   EQU   TREGEN+4                                                 03357000
TREIPL   EQU   TREGEN                                                   03358000
TRENUM   EQU   TRENDONE+4                                               03359000
TRENEXT  EQU   TRENDONE                                                 03360000
DUMPSIZE EQU   DUMPINFO+4                                               03361000
DUMPADR  EQU   DUMPINFO                                                 03362000
DUMPNUM  EQU   DUMPTABL                                                 03363000
@NM00010 EQU   PARM+212                                                 03364000
FRAMEPTR EQU   PARM+200                                                 03365000
ADCPUT   EQU   PARM+144                                                 03366000
RECLNGTH EQU   CCHHRLNG+6                                               03367000
@NM00009 EQU   CCHHRLNG+5                                               03368000
RECCCHHR EQU   CCHHRLNG                                                 03369000
USERPGM  EQU   PARM+102                                                 03370000
IDTSEC   EQU   IDTIME+3                                                 03371000
IDSEC    EQU   IDTIME+2                                                 03372000
IDMIN    EQU   IDTIME+1                                                 03373000
IDHOUR   EQU   IDTIME                                                   03374000
IDASID   EQU   ERRID+4                                                  03375000
IDCPU    EQU   ERRID+3                                                  03376000
@NM00008 EQU   ERRID+2                                                  03377000
IDVALUE  EQU   ERRID                                                    03378000
NUMDAYS  EQU   PARM+88                                                  03379000
SORTNUM  EQU   PARM+84                                                  03380000
TABSIZE  EQU   PARM+80                                                  03381000
SYSRETRN EQU   @NM00007                                                 03382000
@NM00006 EQU   PARM+72                                                  03383000
WRTHRSH  EQU   PARM+69                                                  03384000
RDTHRSH  EQU   PARM+66                                                  03385000
TERM     EQU   PARM+58                                                  03386000
EVSDAY   EQU   STRTDATE+1                                               03387000
EVSYEAR  EQU   STRTDATE                                                 03388000
PENSEC2  EQU   ENDTIME2+2                                               03389000
PENMIN2  EQU   ENDTIME2+1                                               03390000
PENHOUR2 EQU   ENDTIME2                                                 03391000
PSTSEC2  EQU   STTIME2+2                                                03392000
PSTMIN2  EQU   STTIME2+1                                                03393000
PSTHOUR2 EQU   STTIME2                                                  03394000
PENSEC1  EQU   ENDTIME1+2                                               03395000
PENMIN1  EQU   ENDTIME1+1                                               03396000
PENHOUR1 EQU   ENDTIME1                                                 03397000
PSTSEC1  EQU   STTIME1+2                                                03398000
PSTMIN1  EQU   STTIME1+1                                                03399000
PSTHOUR1 EQU   STTIME1                                                  03400000
@NM00005 EQU   ENDDT+4                                                  03401000
PENDY    EQU   PEND+1                                                   03402000
PENYR    EQU   PEND                                                     03403000
@NM00004 EQU   ENDDATE                                                  03404000
@NM00003 EQU   STDT+4                                                   03405000
PSTDY    EQU   PSTD+1                                                   03406000
PSTYR    EQU   PSTD                                                     03407000
@NM00002 EQU   STDATE                                                   03408000
YEARNOW  EQU   DATENOW+4                                                03409000
@NM00001 EQU   DATENOW+3                                                03410000
DAYNOW   EQU   DATENOW                                                  03411000
CSNAP    EQU   CLOSEIO                                                  03412000
CDRCTWRK EQU   CLOSEIO                                                  03413000
CSYSIN   EQU   CLOSEIO                                                  03414000
CACCDEV  EQU   CLOSEIO                                                  03415000
CACCIN   EQU   CLOSEIO                                                  03416000
CSERLOG  EQU   CLOSEIO                                                  03417000
CEREPPT  EQU   CLOSEIO                                                  03418000
CTOURIST EQU   CLOSEIO                                                  03419000
OSNAP    EQU   OPENIO                                                   03420000
ODRCTWRK EQU   OPENIO                                                   03421000
OSYSIN   EQU   OPENIO                                                   03422000
OACCDEV  EQU   OPENIO                                                   03423000
OACCIN   EQU   OPENIO                                                   03424000
OSERLOG  EQU   OPENIO                                                   03425000
OEREPPT  EQU   OPENIO                                                   03426000
OTOURIST EQU   OPENIO                                                   03427000
PASSFLAG EQU   MISC                                                     03428000
PLOGREC  EQU   MISC                                                     03429000
ERRORID  EQU   MISC                                                     03430000
PSUM     EQU   PRINTES                                                  03431000
PEDIT    EQU   PRINTES                                                  03432000
PHIST    EQU   MISC                                                     03433000
PACC     EQU   MISC                                                     03434000
PZERO    EQU   MISC                                                     03435000
DEBUG63  EQU   DEBUGA+3                                                 03436000
DEBUG62  EQU   DEBUGA+3                                                 03437000
DEBUG61  EQU   DEBUGA+3                                                 03438000
DEBUG60  EQU   DEBUGA+3                                                 03439000
DEBUG59  EQU   DEBUGA+3                                                 03440000
DEBUG58  EQU   DEBUGA+3                                                 03441000
DEBUG57  EQU   DEBUGA+3                                                 03442000
DEBUG56  EQU   DEBUGA+3                                                 03443000
DEBUG55  EQU   DEBUGA+2                                                 03444000
DEBUG54  EQU   DEBUGA+2                                                 03445000
DEBUG53  EQU   DEBUGA+2                                                 03446000
DEBUG52  EQU   DEBUGA+2                                                 03447000
DEBUG51  EQU   DEBUGA+2                                                 03448000
DEBUG50  EQU   DEBUGA+2                                                 03449000
DEBUG49  EQU   DEBUGA+2                                                 03450000
DEBUG48  EQU   DEBUGA+2                                                 03451000
DEBUG47  EQU   DEBUGA+1                                                 03452000
DEBUG46  EQU   DEBUGA+1                                                 03453000
DEBUG45  EQU   DEBUGA+1                                                 03454000
DEBUG44  EQU   DEBUGA+1                                                 03455000
DEBUG43  EQU   DEBUGA+1                                                 03456000
DEBUG42  EQU   DEBUGA+1                                                 03457000
DEBUG41  EQU   DEBUGA+1                                                 03458000
DEBUG40  EQU   DEBUGA+1                                                 03459000
DEBUG39  EQU   DEBUGA                                                   03460000
DEBUG38  EQU   DEBUGA                                                   03461000
DEBUG37  EQU   DEBUGA                                                   03462000
DEBUG36  EQU   DEBUGA                                                   03463000
DEBUG35  EQU   DEBUGA                                                   03464000
DEBUG34  EQU   DEBUGA                                                   03465000
DEBUG33  EQU   DEBUGA                                                   03466000
DEBUG32  EQU   DEBUGA                                                   03467000
DEBUG31  EQU   DEBUG+3                                                  03468000
DEBUG30  EQU   DEBUG+3                                                  03469000
DEBUG29  EQU   DEBUG+3                                                  03470000
DEBUG28  EQU   DEBUG+3                                                  03471000
DEBUG27  EQU   DEBUG+3                                                  03472000
DEBUG26  EQU   DEBUG+3                                                  03473000
DEBUG25  EQU   DEBUG+3                                                  03474000
DEBUG24  EQU   DEBUG+3                                                  03475000
DEBUG23  EQU   DEBUG+2                                                  03476000
DEBUG22  EQU   DEBUG+2                                                  03477000
DEBUG21  EQU   DEBUG+2                                                  03478000
DEBUG20  EQU   DEBUG+2                                                  03479000
DEBUG19  EQU   DEBUG+2                                                  03480000
DEBUG18  EQU   DEBUG+2                                                  03481000
DEBUG17  EQU   DEBUG+2                                                  03482000
DEBUG16  EQU   DEBUG+2                                                  03483000
DEBUG15  EQU   DEBUG+1                                                  03484000
DEBUG14  EQU   DEBUG+1                                                  03485000
DEBUG13  EQU   DEBUG+1                                                  03486000
DEBUG12  EQU   DEBUG+1                                                  03487000
DEBUG11  EQU   DEBUG+1                                                  03488000
DEBUG10  EQU   DEBUG+1                                                  03489000
DEBUG9   EQU   DEBUG+1                                                  03490000
DEBUG8   EQU   DEBUG+1                                                  03491000
DEBUG7   EQU   DEBUG                                                    03492000
DEBUG6   EQU   DEBUG                                                    03493000
DEBUG5   EQU   DEBUG                                                    03494000
DEBUG4   EQU   DEBUG                                                    03495000
DEBUG3   EQU   DEBUG                                                    03496000
DEBUG2   EQU   DEBUG                                                    03497000
DEBUG1   EQU   DEBUG                                                    03498000
DEBUG0   EQU   DEBUG                                                    03499000
SORTBRK  EQU   SWITCHES+1                                               03500000
COREFAIL EQU   SWITCHES+1                                               03501000
ANALYSIS EQU   SWITCHES+1                                               03502000
SHIFT3RD EQU   SWITCHES+1                                               03503000
DEVEXCL  EQU   SWITCHES+1                                               03504000
ZEROALL  EQU   SWITCHES+1                                               03505000
NOTALL   EQU   SWITCHES+1                                               03506000
NOSDR    EQU   SWITCHES                                                 03507000
TIMESEQ  EQU   SWITCHES                                                 03508000
SYSUM    EQU   SWITCHES                                                 03509000
PARMTHR  EQU   SWITCHES                                                 03510000
TREND    EQU   SWITCHES                                                 03511000
SHORTOBR EQU   SWITCHES                                                 03512000
PARMMES  EQU   SWITCHES                                                 03513000
RDESUM   EQU   SWITCHES                                                 03514000
PCCHFRAM EQU   RECTYPE+1                                                03515000
PMCHFRAM EQU   RECTYPE+1                                                03516000
PTTYP    EQU   RECTYPE+1                                                03517000
PEOD     EQU   RECTYPE                                                  03518000
PMIH     EQU   RECTYPE                                                  03519000
PDDR     EQU   RECTYPE                                                  03520000
PIPL     EQU   RECTYPE                                                  03521000
PSOFT    EQU   RECTYPE                                                  03522000
POBR     EQU   RECTYPE                                                  03523000
PCHAN    EQU   RECTYPE                                                  03524000
PMCH     EQU   RECTYPE                                                  03525000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03526000
@PB00006 EQU   @PB00007                                                 03527000
@PB00005 EQU   @PB00006                                                 03528000
@PB00004 EQU   @PB00005                                                 03529000
@PB00003 EQU   @PB00004                                                 03530000
@PB00002 EQU   @PB00003                                                 03531000
@ENDDATA EQU   *                                                        03532000
         END   IFCFRAMM,(C'PLS2205',0701,78012)                         03533000
