         TITLE 'IFCFRAMC - OUTPUT CCH INDEPENDENT INFO                 *00001000
                        '                                               00002000
IFCFRAMC CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IFCFRAMC  78.226'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @12,0                                               0001 00012000
@PSTART  LA    @11,4095(,@12)                                      0001 00013000
         LA    @10,4095(,@11)                                      0001 00014000
         LA    @05,4095(,@10)                                      0001 00015000
         LA    @06,4095(,@05)                                      0001 00016000
         USING @PSTART,@12                                         0001 00017000
         USING @PSTART+4095,@11                                    0001 00018000
         USING @PSTART+8190,@10                                    0001 00019000
         USING @PSTART+12285,@05                                   0001 00020000
         USING @PSTART+16380,@06                                   0001 00021000
         ST    @13,@SA00001+4                                      0001 00022000
         LA    @14,@SA00001                                        0001 00023000
         ST    @14,8(,@13)                                         0001 00024000
         LR    @13,@14                                             0001 00025000
         B     @PB00002                                            0180 00026000
CONVBIN2 STM   @14,@12,12(@13)                                     0180 00027000
         MVC   @PC00002(8),0(@01)                                  0180 00028000
* R8 = BWORD2;                                             /*@G51DGVS*/ 00029000
         L     @04,@PC00002                                        0184 00030000
         L     R8,BWORD2(,@04)                                     0184 00031000
* CVD(R8,DBLWORD);                                         /*@G51DGVS*/ 00032000
         CVD   R8,DBLWORD                                          0185 00033000
* UNPK(WORK(1:8),DBLWORD);                                 /*@G51DGVS*/ 00034000
         UNPK  WORK(8),DBLWORD(8)                                  0186 00035000
* WORK(8) = WORK(8) | FOXZERO;                             /*@G51DGVS*/ 00036000
         OI    WORK+7,C'0'                                         0187 00037000
* IF WORK(7) = FOXZERO THEN                                        0188 00038000
         CLI   WORK+6,C'0'                                         0188 00039000
         BNE   @RF00188                                            0188 00040000
*   WORK(7) = BLANK;                                       /*@G51DGVS*/ 00041000
         MVI   WORK+6,C' '                                         0189 00042000
* DADDR2(1:2) = WORK(7:8);                                 /*@G51DGVS*/ 00043000
@RF00188 L     @09,@PC00002+4                                      0190 00044000
         MVC   DADDR2(2,@09),WORK+6                                0190 00045000
* RESPECIFY (R8) UNRESTRICTED;                             /*@G51DGVS*/ 00046000
*END;                                                      /*@G51DGVS*/ 00047000
@EL00002 DS    0H                                                  0192 00048000
@EF00002 DS    0H                                                  0192 00049000
@ER00002 LM    @14,@12,12(@13)                                     0192 00050000
         BR    @14                                                 0192 00051000
* /*                                                         @G51DGVS*/ 00052000
* /* CONVERT CHARACTERS TO PRINTABLE                         @G51DGVS*/ 00053000
* /*                                                         @G51DGVS*/ 00054000
*CONVERT: PROC(NEXTBYTE,ADDNUM,LENNUM);                    /*@G51DGVS*/ 00055000
CONVERT  STM   @14,@12,12(@13)                                     0193 00056000
         MVC   @PC00003(12),0(@01)                                 0193 00057000
* DCL NEXTBYTE  CHAR(11);                                  /*@G51DGVS*/ 00058000
* DCL ADDNUM    CHAR(133);                                 /*@G51DGVS*/ 00059000
* DCL LENNUM    FIXED(31);        /* HOW MUCH TO CONVERT     @G51DGVS*/ 00060000
* RESPECIFY (R8,R9) RESTRICTED;                            /*@G51DGVS*/ 00061000
* DO L = LENNUM BY -1 TO ONE;                              /*@G51DGVS*/ 00062000
         L     @04,@PC00003+8                                      0198 00063000
         L     L,LENNUM(,@04)                                      0198 00064000
         B     @DE00198                                            0198 00065000
@DL00198 DS    0H                                                  0199 00066000
*  R8 = NEXTBYTE(L);              /* LOAD THE NEXT BYTE      @G51DGVS*/ 00067000
         L     @04,@PC00003                                        0199 00068000
         BCTR  @04,0                                               0199 00069000
         SLR   R8,R8                                               0199 00070000
         IC    R8,NEXTBYTE(L,@04)                                  0199 00071000
*  J = TWO * L;                   /* INDEX FOR STORING CONVERTED 1/2 */ 00072000
         LR    @04,L                                               0200 00073000
         ALR   @04,@04                                             0200 00074000
         ST    @04,J                                               0200 00075000
*                                 /* BYTE.  INPUT IS 2 CHARS @G51DGVS*/ 00076000
*  SRDL(R8,FOUR);                 /* SPLIT THE BYTE IN HALF  @G51DGVS*/ 00077000
         SRDL  R8,4                                                0201 00078000
*  SRL(R9,28);                    /* RIGHT JUSTIFY SPLIT HALF BYTE   */ 00079000
         SRL   R9,28                                               0202 00080000
*  R9 = R9 + ONE;                                          /*@G51DGVS*/ 00081000
         LA    @15,1                                               0203 00082000
         ALR   R9,@15                                              0203 00083000
*  R8 = R8 + ONE;                                          /*@G51DGVS*/ 00084000
         ALR   R8,@15                                              0204 00085000
*  ADDNUM(J-ONE) = CHARS(R8);     /* CHARS IS 16 CHAR STRING FOR     */ 00086000
         L     @15,@PC00003+4                                      0205 00087000
         ALR   @04,@15                                             0205 00088000
         BCTR  @04,0                                               0205 00089000
         BCTR  @04,0                                               0205 00090000
         LA    @01,CHARS-1(R8)                                     0205 00091000
         MVC   ADDNUM(1,@04),0(@01)                                0205 00092000
*  ADDNUM(J)     = CHARS(R9);     /* CONVERTING HEX NUMS TO PRINT    */ 00093000
         L     @04,J                                               0206 00094000
         ALR   @15,@04                                             0206 00095000
         BCTR  @15,0                                               0206 00096000
         LA    @04,CHARS-1(R9)                                     0206 00097000
         MVC   ADDNUM(1,@15),0(@04)                                0206 00098000
* END;                                                     /*@G51DGVS*/ 00099000
         BCTR  L,0                                                 0207 00100000
@DE00198 LTR   L,L                                                 0207 00101000
         BP    @DL00198                                            0207 00102000
*END;                                                      /*@G51DGVS*/ 00103000
@EL00003 DS    0H                                                  0208 00104000
@EF00003 DS    0H                                                  0208 00105000
@ER00003 LM    @14,@12,12(@13)                                     0208 00106000
         BR    @14                                                 0208 00107000
*RESPECIFY (R8,R9) UNRESTRICTED;                           /*@G51DGVS*/ 00108000
*/*                                                          @G51DGVS*/ 00109000
*/* OUTPUT THE PRINT LINE.  IF A PAGE OVERFLOW OCCURS, EJECT TO A NEW*/ 00110000
*/* PAGE.  THE PRINT LINE IS PLACE IN THE VARIABLE BLINE.    @G51DGVS*/ 00111000
*/*                                                          @G51DGVS*/ 00112000
*PRINTER: PROC(LINENO);                                    /*@G51DGVS*/ 00113000
PRINTER  STM   @14,@12,@SA00004                                    0210 00114000
         MVC   @PC00004(4),0(@01)                                  0210 00115000
*  DCL LINENO CHAR(134);                                   /*@G51DGVS*/ 00116000
*  IF MYLINCT < ONE THEN                                           0212 00117000
         L     @04,MYLINCT                                         0212 00118000
         LTR   @04,@04                                             0212 00119000
         BP    @RF00212                                            0212 00120000
*    DO;                                                   /*@G51DGVS*/ 00121000
*      PRINTADR = ADDR(EJECT);                             /*@G51DGVS*/ 00122000
         LA    @04,EJECT                                           0214 00123000
         ST    @04,PRINTADR(,R2)                                   0214 00124000
*      RESPECIFY (R15) RESTRICTED;                         /*@G51DGVS*/ 00125000
*      CALL IOHND(RITEPRTR);                               /*@G51DGVS*/ 00126000
         L     @15,ADIOHND(,R2)                                    0216 00127000
         LA    @01,@AL00216                                        0216 00128000
         BALR  @14,@15                                             0216 00129000
*      IF R15 ^= ZERO THEN                                         0217 00130000
         LTR   R15,R15                                             0217 00131000
         BZ    @RF00217                                            0217 00132000
*        GEN( DC X'0000');                                 /*@G51DGVS*/ 00133000
          DC X'0000'                                                    00134000
*      RESPECIFY (R15) UNRESTRICTED;                       /*@G51DGVS*/ 00135000
@RF00217 DS    0H                                                  0220 00136000
*      MYLINCT = LINECT - 1;                               /*@G51DGVS*/ 00137000
         LH    @04,LINECT(,R2)                                     0220 00138000
         BCTR  @04,0                                               0220 00139000
         ST    @04,MYLINCT                                         0220 00140000
*    END;                                                  /*@G51DGVS*/ 00141000
*  BLINE = LINENO;                                         /*@G51DGVS*/ 00142000
@RF00212 L     @04,@PC00004                                        0222 00143000
         MVC   BLINE(134),LINENO(@04)                              0222 00144000
*  PRINTADR = ADDR(BLINE);                                 /*@G51DGVS*/ 00145000
         LA    @04,BLINE                                           0223 00146000
         ST    @04,PRINTADR(,R2)                                   0223 00147000
*  RESPECIFY (R15) RESTRICTED;                             /*@G51DGVS*/ 00148000
*  CALL IOHND(RITEPRTR);                                   /*@G51DGVS*/ 00149000
         L     @15,ADIOHND(,R2)                                    0225 00150000
         LA    @01,@AL00225                                        0225 00151000
         BALR  @14,@15                                             0225 00152000
*  IF R15 ^= ZERO THEN                                             0226 00153000
         LTR   R15,R15                                             0226 00154000
         BZ    @RF00226                                            0226 00155000
*    GEN( DC X'0000');                                     /*@G51DGVS*/ 00156000
          DC X'0000'                                                    00157000
*  RESPECIFY (R15) UNRESTRICTED;                           /*@G51DGVS*/ 00158000
@RF00226 DS    0H                                                  0229 00159000
*  MYLINCT = MYLINCT - 1;                                  /*@G51DGVS*/ 00160000
         L     @04,MYLINCT                                         0229 00161000
         BCTR  @04,0                                               0229 00162000
         ST    @04,MYLINCT                                         0229 00163000
* END;                                                     /*@G51DGVS*/ 00164000
@EL00004 DS    0H                                                  0230 00165000
@EF00004 DS    0H                                                  0230 00166000
@ER00004 LM    @14,@12,@SA00004                                    0230 00167000
         BR    @14                                                 0230 00168000
*/*                                                          @G51DGVS*/ 00169000
*/* OUTPUT THE CHANNEL ONLINE-OFFLINE LINE.  PLACE THE WORD ON OR    */ 00170000
*/* OFF IN THE OUTPUT LINE DEPENDING ON THE VALUE IN THE ERPIB.      */ 00171000
*/*                                                          @G51DGVS*/ 00172000
*CHONOFF: PROC (INDEX);                                    /*@G51DGVS*/ 00173000
CHONOFF  STM   @14,@12,12(@13)                                     0231 00174000
         MVC   @PC00005(4),0(@01)                                  0231 00175000
*  DCL INDEX FIXED(31);                                    /*@G51DGVS*/ 00176000
*  IF (LRBCHCUA(INDEX) & HEX80) = HEX80 THEN                       0233 00177000
         L     @04,@PC00005                                        0233 00178000
         L     @04,INDEX(,@04)                                     0233 00179000
         ALR   @04,R7                                              0233 00180000
         MVC   @TS00001(1),LRBCHCUA-1(@04)                         0233 00181000
         NI    @TS00001,X'80'                                      0233 00182000
         CLI   @TS00001,X'80'                                      0233 00183000
         BNE   @RF00233                                            0233 00184000
*    CHAN0 = OFF;                                          /*@G51DGVS*/ 00185000
         XC    CHAN0+1(2),CHAN0+1                                  0234 00186000
         MVI   CHAN0,B'00000000'                                   0234 00187000
*  ELSE                                                            0235 00188000
*    CHAN0 = ON;                                           /*@G51DGVS*/ 00189000
         B     @RC00233                                            0235 00190000
@RF00233 XC    CHAN0+1(2),CHAN0+1                                  0235 00191000
         MVI   CHAN0,B'10000000'                                   0235 00192000
*  IF (LRBCHCUA(INDEX) & HEX40) = HEX40 THEN                       0236 00193000
@RC00233 L     @04,@PC00005                                        0236 00194000
         L     @04,INDEX(,@04)                                     0236 00195000
         ALR   @04,R7                                              0236 00196000
         MVC   @TS00001(1),LRBCHCUA-1(@04)                         0236 00197000
         NI    @TS00001,X'40'                                      0236 00198000
         CLI   @TS00001,X'40'                                      0236 00199000
         BNE   @RF00236                                            0236 00200000
*    CHAN1 = OFF;                                          /*@G51DGVS*/ 00201000
         XC    CHAN1+1(2),CHAN1+1                                  0237 00202000
         MVI   CHAN1,B'00000000'                                   0237 00203000
*  ELSE                                                            0238 00204000
*    CHAN1 = ON;                                           /*@G51DGVS*/ 00205000
         B     @RC00236                                            0238 00206000
@RF00236 XC    CHAN1+1(2),CHAN1+1                                  0238 00207000
         MVI   CHAN1,B'10000000'                                   0238 00208000
*  IF (LRBCHCUA(INDEX) & HEX20) = HEX20 THEN                       0239 00209000
@RC00236 L     @04,@PC00005                                        0239 00210000
         L     @04,INDEX(,@04)                                     0239 00211000
         ALR   @04,R7                                              0239 00212000
         MVC   @TS00001(1),LRBCHCUA-1(@04)                         0239 00213000
         NI    @TS00001,X'20'                                      0239 00214000
         CLI   @TS00001,X'20'                                      0239 00215000
         BNE   @RF00239                                            0239 00216000
*    CHAN2 = OFF;                                          /*@G51DGVS*/ 00217000
         XC    CHAN2+1(2),CHAN2+1                                  0240 00218000
         MVI   CHAN2,B'00000000'                                   0240 00219000
*  ELSE                                                            0241 00220000
*    CHAN2 = ON;                                           /*@G51DGVS*/ 00221000
         B     @RC00239                                            0241 00222000
@RF00239 XC    CHAN2+1(2),CHAN2+1                                  0241 00223000
         MVI   CHAN2,B'10000000'                                   0241 00224000
*  IF (LRBCHCUA(INDEX) & HEX10) = HEX10 THEN                       0242 00225000
@RC00239 L     @04,@PC00005                                        0242 00226000
         L     @04,INDEX(,@04)                                     0242 00227000
         ALR   @04,R7                                              0242 00228000
         MVC   @TS00001(1),LRBCHCUA-1(@04)                         0242 00229000
         NI    @TS00001,X'10'                                      0242 00230000
         CLI   @TS00001,X'10'                                      0242 00231000
         BNE   @RF00242                                            0242 00232000
*    CHAN3 = OFF;                                          /*@G51DGVS*/ 00233000
         XC    CHAN3+1(2),CHAN3+1                                  0243 00234000
         MVI   CHAN3,B'00000000'                                   0243 00235000
*  ELSE                                                            0244 00236000
*    CHAN3 = ON;                                           /*@G51DGVS*/ 00237000
         B     @RC00242                                            0244 00238000
@RF00242 XC    CHAN3+1(2),CHAN3+1                                  0244 00239000
         MVI   CHAN3,B'10000000'                                   0244 00240000
*  IF (LRBCHCUA(INDEX) & HEX08) = HEX08 THEN                       0245 00241000
@RC00242 L     @04,@PC00005                                        0245 00242000
         L     @04,INDEX(,@04)                                     0245 00243000
         ALR   @04,R7                                              0245 00244000
         MVC   @TS00001(1),LRBCHCUA-1(@04)                         0245 00245000
         NI    @TS00001,X'08'                                      0245 00246000
         CLI   @TS00001,X'08'                                      0245 00247000
         BNE   @RF00245                                            0245 00248000
*    CHAN4 = OFF;                                          /*@G51DGVS*/ 00249000
         XC    CHAN4+1(2),CHAN4+1                                  0246 00250000
         MVI   CHAN4,B'00000000'                                   0246 00251000
*  ELSE                                                            0247 00252000
*    CHAN4 = ON;                                           /*@G51DGVS*/ 00253000
         B     @RC00245                                            0247 00254000
@RF00245 XC    CHAN4+1(2),CHAN4+1                                  0247 00255000
         MVI   CHAN4,B'10000000'                                   0247 00256000
*  IF (LRBCHCUA(INDEX) & HEX04) = HEX04 THEN                       0248 00257000
@RC00245 L     @04,@PC00005                                        0248 00258000
         L     @04,INDEX(,@04)                                     0248 00259000
         ALR   @04,R7                                              0248 00260000
         MVC   @TS00001(1),LRBCHCUA-1(@04)                         0248 00261000
         NI    @TS00001,X'04'                                      0248 00262000
         CLI   @TS00001,X'04'                                      0248 00263000
         BNE   @RF00248                                            0248 00264000
*    CHAN5 = OFF;                                          /*@G51DGVS*/ 00265000
         XC    CHAN5+1(2),CHAN5+1                                  0249 00266000
         MVI   CHAN5,B'00000000'                                   0249 00267000
*  ELSE                                                            0250 00268000
*    CHAN5 = ON;                                           /*@G51DGVS*/ 00269000
         B     @RC00248                                            0250 00270000
@RF00248 XC    CHAN5+1(2),CHAN5+1                                  0250 00271000
         MVI   CHAN5,B'10000000'                                   0250 00272000
*  IF (LRBCHCUA(INDEX) & HEX02) = HEX02 THEN                       0251 00273000
@RC00248 L     @04,@PC00005                                        0251 00274000
         L     @04,INDEX(,@04)                                     0251 00275000
         ALR   @04,R7                                              0251 00276000
         MVC   @TS00001(1),LRBCHCUA-1(@04)                         0251 00277000
         NI    @TS00001,X'02'                                      0251 00278000
         CLI   @TS00001,X'02'                                      0251 00279000
         BNE   @RF00251                                            0251 00280000
*    CHAN6 = OFF;                                          /*@G51DGVS*/ 00281000
         XC    CHAN6+1(2),CHAN6+1                                  0252 00282000
         MVI   CHAN6,B'00000000'                                   0252 00283000
*  ELSE                                                            0253 00284000
*    CHAN6 = ON;                                           /*@G51DGVS*/ 00285000
         B     @RC00251                                            0253 00286000
@RF00251 XC    CHAN6+1(2),CHAN6+1                                  0253 00287000
         MVI   CHAN6,B'10000000'                                   0253 00288000
*END;                                                      /*@G51DGVS*/ 00289000
@EL00005 DS    0H                                                  0254 00290000
@EF00005 DS    0H                                                  0254 00291000
@ER00005 LM    @14,@12,12(@13)                                     0254 00292000
         BR    @14                                                 0254 00293000
*/*                                                          @G51DGVS*/ 00294000
*/* OUTPUT THE VALID ERPIB INFORMATION.                      @G51DGVS*/ 00295000
*/*                                                          @G51DGVS*/ 00296000
*VALERPIB: PROC;                                           /*@G51DGVS*/ 00297000
VALERPIB STM   @14,@12,@SA00006                                    0255 00298000
*  CALL PRINTER(LINE37);                                   /*@G51DGVS*/ 00299000
         LA    @01,@AL00256                                        0256 00300000
         BAL   @14,PRINTER                                         0256 00301000
*  CALL PRINTER(BLINE);                                    /*@G51DGVS*/ 00302000
         LA    @01,@AL00257                                        0257 00303000
         BAL   @14,PRINTER                                         0257 00304000
*  IF (LRBCECSW(1) & HEX40) = HEX40 THEN                           0258 00305000
         MVC   @TS00001(1),LRBCECSW(R7)                            0258 00306000
         NI    @TS00001,X'40'                                      0258 00307000
         CLI   @TS00001,X'40'                                      0258 00308000
         BNE   @RF00258                                            0258 00309000
*    CSWSTO = CSWINT;                                      /*@G51DGVS*/ 00310000
         MVC   CSWSTO(10),CSWINT                                   0259 00311000
*  ELSE                                                            0260 00312000
*    IF (LRBCECSW(1) & HEX80) = HEX80 THEN                         0260 00313000
         B     @RC00258                                            0260 00314000
@RF00258 MVC   @TS00001(1),LRBCECSW(R7)                            0260 00315000
         NI    @TS00001,X'80'                                      0260 00316000
         CLI   @TS00001,X'80'                                      0260 00317000
         BNE   @RF00260                                            0260 00318000
*      CSWSTO = CSWSIO;                                    /*@G51DGVS*/ 00319000
         MVC   CSWSTO(10),CSWSIO                                   0261 00320000
*    ELSE                                                          0262 00321000
*      IF (LRBCECSW(1) & HEX20) = HEX20 THEN                       0262 00322000
         B     @RC00260                                            0262 00323000
@RF00260 MVC   @TS00001(1),LRBCECSW(R7)                            0262 00324000
         NI    @TS00001,X'20'                                      0262 00325000
         CLI   @TS00001,X'20'                                      0262 00326000
         BNE   @RF00262                                            0262 00327000
*        CSWSTO = CSWTIO;                                  /*@G51DGVS*/ 00328000
         MVC   CSWSTO(10),CSWTIO                                   0263 00329000
*      ELSE                                                        0264 00330000
*        CSWSTO = CSWHIO;                                  /*@G51DGVS*/ 00331000
         B     @RC00262                                            0264 00332000
@RF00262 MVC   CSWSTO(10),CSWHIO                                   0264 00333000
*  CALL PRINTER(LINE38);                                   /*@G51DGVS*/ 00334000
@RC00262 DS    0H                                                  0265 00335000
@RC00260 DS    0H                                                  0265 00336000
@RC00258 LA    @01,@AL00265                                        0265 00337000
         BAL   @14,PRINTER                                         0265 00338000
*  IF LRBCECSW(2:4) = HEXZERO(1:3) THEN                            0266 00339000
         CLC   LRBCECSW+1(3,R7),HEXZERO                            0266 00340000
         BNE   @RF00266                                            0266 00341000
*    CALL PRINTER(LINE40);                                 /*@G51DGVS*/ 00342000
         LA    @01,@AL00267                                        0267 00343000
         BAL   @14,PRINTER                                         0267 00344000
*  ELSE                                                            0268 00345000
*    CALL VALUCB;                                          /*@G51DGVS*/ 00346000
         B     @RC00266                                            0268 00347000
@RF00266 BAL   @14,VALUCB                                          0268 00348000
* END;                                                     /*@G51DGVS*/ 00349000
@EL00006 DS    0H                                                  0269 00350000
@EF00006 DS    0H                                                  0269 00351000
@ER00006 LM    @14,@12,@SA00006                                    0269 00352000
         BR    @14                                                 0269 00353000
*/*                                                          @G51DGVS*/ 00354000
*/* OUTPUT THE VALID UCB INFORMATION.                        @G51DGVS*/ 00355000
*/*                                                          @G51DGVS*/ 00356000
*VALUCB: PROC;                                             /*@G51DGVS*/ 00357000
VALUCB   STM   @14,@12,@SA00007                                    0270 00358000
*  IF (LRBCECSW(4) & HEXC0) = HEXC0 THEN                           0271 00359000
         MVC   @TS00001(1),LRBCECSW+3(R7)                          0271 00360000
         NI    @TS00001,X'C0'                                      0271 00361000
         CLI   @TS00001,X'C0'                                      0271 00362000
         BNE   @RF00271                                            0271 00363000
*    TERMBY = TERM3;                                       /*@G51DGVS*/ 00364000
         MVC   TERMBY(30),TERM3                                    0272 00365000
*  ELSE                                                            0273 00366000
*    IF (LRBCECSW(4) & HEX80) = HEX80 THEN                         0273 00367000
         B     @RC00271                                            0273 00368000
@RF00271 MVC   @TS00001(1),LRBCECSW+3(R7)                          0273 00369000
         NI    @TS00001,X'80'                                      0273 00370000
         CLI   @TS00001,X'80'                                      0273 00371000
         BNE   @RF00273                                            0273 00372000
*      TERMBY = TERM2;                                     /*@G51DGVS*/ 00373000
         MVC   TERMBY(30),TERM2                                    0274 00374000
*    ELSE                                                          0275 00375000
*      IF (LRBCECSW(4) & HEX40) = HEX40 THEN                       0275 00376000
         B     @RC00273                                            0275 00377000
@RF00273 MVC   @TS00001(1),LRBCECSW+3(R7)                          0275 00378000
         NI    @TS00001,X'40'                                      0275 00379000
         CLI   @TS00001,X'40'                                      0275 00380000
         BNE   @RF00275                                            0275 00381000
*        TERMBY = TERM1;                                   /*@G51DGVS*/ 00382000
         MVC   TERMBY(30),TERM1                                    0276 00383000
*      ELSE                                                        0277 00384000
*        TERMBY = TERM0;                                   /*@G51DGVS*/ 00385000
         B     @RC00275                                            0277 00386000
@RF00275 MVC   TERMBY(30),TERM0                                    0277 00387000
*  CALL PRINTER(LINE39);                                   /*@G51DGVS*/ 00388000
@RC00275 DS    0H                                                  0278 00389000
@RC00273 DS    0H                                                  0278 00390000
@RC00271 LA    @01,@AL00278                                        0278 00391000
         BAL   @14,PRINTER                                         0278 00392000
*  IF (LRBCECSW(4) & HEX10) = HEX10 THEN                           0279 00393000
         MVC   @TS00001(1),LRBCECSW+3(R7)                          0279 00394000
         NI    @TS00001,X'10'                                      0279 00395000
         CLI   @TS00001,X'10'                                      0279 00396000
         BNE   @RF00279                                            0279 00397000
*    CALL PRINTER(LINE39A);                                /*@G51DGVS*/ 00398000
         LA    @01,@AL00280                                        0280 00399000
         BAL   @14,PRINTER                                         0280 00400000
*  IF (LRBCECSW(3) & HEX01) = HEXZERO(1) THEN                      0281 00401000
@RF00279 MVC   @TS00001(1),LRBCECSW+2(R7)                          0281 00402000
         NI    @TS00001,X'01'                                      0281 00403000
         CLC   @TS00001(1),HEXZERO                                 0281 00404000
         BNE   @RF00281                                            0281 00405000
*    CALL PRINTER(LINE41G);                                /*@G51DGVS*/ 00406000
         LA    @01,@AL00282                                        0282 00407000
         BAL   @14,PRINTER                                         0282 00408000
*  ELSE                                                            0283 00409000
*    DO I = LRBCECSW(4) & HEX07;                           /*@G51DGVS*/ 00410000
         B     @RC00281                                            0283 00411000
@RF00281 LA    @04,7                                               0283 00412000
         MVC   @ZT00003+3(1),LRBCECSW+3(R7)                        0283 00413000
         N     @04,@ZT00003                                        0283 00414000
         ST    @04,I                                               0283 00415000
*      IF I = 0 THEN                                               0284 00416000
         LTR   @04,@04                                             0284 00417000
         BNZ   @RF00284                                            0284 00418000
*        CALL PRINTER(LINE41A);                            /*@G51DGVS*/ 00419000
         LA    @01,@AL00285                                        0285 00420000
         BAL   @14,PRINTER                                         0285 00421000
*      ELSE                                                        0286 00422000
*        IF I = 1 THEN                                             0286 00423000
         B     @RC00284                                            0286 00424000
@RF00284 CLC   I(4),@CF00056                                       0286 00425000
         BNE   @RF00286                                            0286 00426000
*          CALL PRINTER(LINE41B);                          /*@G51DGVS*/ 00427000
         LA    @01,@AL00287                                        0287 00428000
         BAL   @14,PRINTER                                         0287 00429000
*        ELSE                                                      0288 00430000
*          IF I = 2 THEN                                           0288 00431000
         B     @RC00286                                            0288 00432000
@RF00286 CLC   I(4),@CF00075                                       0288 00433000
         BNE   @RF00288                                            0288 00434000
*            CALL PRINTER(LINE41C);                        /*@G51DGVS*/ 00435000
         LA    @01,@AL00289                                        0289 00436000
         BAL   @14,PRINTER                                         0289 00437000
*          ELSE                                                    0290 00438000
*            IF I = 3 THEN                                         0290 00439000
         B     @RC00288                                            0290 00440000
@RF00288 CLC   I(4),@CF00077                                       0290 00441000
         BNE   @RF00290                                            0290 00442000
*              CALL PRINTER(LINE41D);                      /*@G51DGVS*/ 00443000
         LA    @01,@AL00291                                        0291 00444000
         BAL   @14,PRINTER                                         0291 00445000
*            ELSE                                                  0292 00446000
*              IF I = 4 THEN                                       0292 00447000
         B     @RC00290                                            0292 00448000
@RF00290 CLC   I(4),@CF00065                                       0292 00449000
         BNE   @RF00292                                            0292 00450000
*                CALL PRINTER(LINE41E);                    /*@G51DGVS*/ 00451000
         LA    @01,@AL00293                                        0293 00452000
         BAL   @14,PRINTER                                         0293 00453000
*              ELSE                                                0294 00454000
*                IF I = 5 THEN                                     0294 00455000
         B     @RC00292                                            0294 00456000
@RF00292 CLC   I(4),@CF00036                                       0294 00457000
         BNE   @RF00294                                            0294 00458000
*                  CALL PRINTER(LINE41F);                  /*@G51DGVS*/ 00459000
         LA    @01,@AL00295                                        0295 00460000
         BAL   @14,PRINTER                                         0295 00461000
*                ELSE                                              0296 00462000
*                  CALL PRINTER(LINE41G);                  /*@G51DGVS*/ 00463000
         B     @RC00294                                            0296 00464000
@RF00294 LA    @01,@AL00296                                        0296 00465000
         BAL   @14,PRINTER                                         0296 00466000
*      RCODE = I | FOXZERO;                                /*@G51DGVS*/ 00467000
@RC00294 DS    0H                                                  0297 00468000
@RC00292 DS    0H                                                  0297 00469000
@RC00290 DS    0H                                                  0297 00470000
@RC00288 DS    0H                                                  0297 00471000
@RC00286 DS    0H                                                  0297 00472000
@RC00284 LA    @04,240                                             0297 00473000
         O     @04,I                                               0297 00474000
         STC   @04,RCODE                                           0297 00475000
*      CALL PRINTER(LINE42);                               /*@G51DGVS*/ 00476000
         LA    @01,@AL00298                                        0298 00477000
         BAL   @14,PRINTER                                         0298 00478000
*    END;                                                  /*@G51DGVS*/ 00479000
*  IF (LRBCECSW(4) & HEX08) = HEX08 THEN                           0300 00480000
@RC00281 MVC   @TS00001(1),LRBCECSW+3(R7)                          0300 00481000
         NI    @TS00001,X'08'                                      0300 00482000
         CLI   @TS00001,X'08'                                      0300 00483000
         BNE   @RF00300                                            0300 00484000
*     CALL PRINTER(LINE43);                                /*@G51DGVS*/ 00485000
         LA    @01,@AL00301                                        0301 00486000
         BAL   @14,PRINTER                                         0301 00487000
*  IF (LRBCECSW(1) & HEX01) ^= HEX01 THEN                          0302 00488000
@RF00300 MVC   @TS00001(1),LRBCECSW(R7)                            0302 00489000
         NI    @TS00001,X'01'                                      0302 00490000
         CLI   @TS00001,X'01'                                      0302 00491000
         BE    @RF00302                                            0302 00492000
*    DO;                                                   /*@G51DGVS*/ 00493000
*      CALL PRINTER(LINE45);                               /*@G51DGVS*/ 00494000
         LA    @01,@AL00304                                        0304 00495000
         BAL   @14,PRINTER                                         0304 00496000
*      IF (LRBCECSW(1) & HEX02) = HEX02 THEN                       0305 00497000
         MVC   @TS00001(1),LRBCECSW(R7)                            0305 00498000
         NI    @TS00001,X'02'                                      0305 00499000
         CLI   @TS00001,X'02'                                      0305 00500000
         BNE   @RF00305                                            0305 00501000
*        CVAL = VALID;                                     /*@G51DGVS*/ 00502000
         MVC   CVAL(10),VALID                                      0306 00503000
*      ELSE                                                        0307 00504000
*        CVAL = NVALID;                                    /*@G51DGVS*/ 00505000
         B     @RC00305                                            0307 00506000
@RF00305 MVC   CVAL(10),NVALID                                     0307 00507000
*      CALL PRINTER(LINE46);                               /*@G51DGVS*/ 00508000
@RC00305 LA    @01,@AL00308                                        0308 00509000
         BAL   @14,PRINTER                                         0308 00510000
*      IF (LRBCECSW(1) & HEX04) = HEX04 THEN                       0309 00511000
         MVC   @TS00001(1),LRBCECSW(R7)                            0309 00512000
         NI    @TS00001,X'04'                                      0309 00513000
         CLI   @TS00001,X'04'                                      0309 00514000
         BNE   @RF00309                                            0309 00515000
*        SVAL = STORED;                                    /*@G51DGVS*/ 00516000
         MVC   SVAL(10),STORED                                     0310 00517000
*      ELSE                                                        0311 00518000
*        SVAL = NSTORED;                                   /*@G51DGVS*/ 00519000
         B     @RC00309                                            0311 00520000
@RF00309 MVC   SVAL(10),NSTORED                                    0311 00521000
*      CALL PRINTER(LINE47);                               /*@G51DGVS*/ 00522000
@RC00309 LA    @01,@AL00312                                        0312 00523000
         BAL   @14,PRINTER                                         0312 00524000
*      IF (LRBCECSW(3) & HEX08) = HEX08 THEN                       0313 00525000
         MVC   @TS00001(1),LRBCECSW+2(R7)                          0313 00526000
         NI    @TS00001,X'08'                                      0313 00527000
         CLI   @TS00001,X'08'                                      0313 00528000
         BNE   @RF00313                                            0313 00529000
*        UVAL = VALID;                                     /*@G51DGVS*/ 00530000
         MVC   UVAL(10),VALID                                      0314 00531000
*      ELSE                                                        0315 00532000
*        UVAL = NVALID;                                    /*@G51DGVS*/ 00533000
         B     @RC00313                                            0315 00534000
@RF00313 MVC   UVAL(10),NVALID                                     0315 00535000
*      CALL PRINTER(LINE48);                               /*@G51DGVS*/ 00536000
@RC00313 LA    @01,@AL00316                                        0316 00537000
         BAL   @14,PRINTER                                         0316 00538000
*      IF (LRBCECSW(3) & HEX04) = HEX04 THEN                       0317 00539000
         MVC   @TS00001(1),LRBCECSW+2(R7)                          0317 00540000
         NI    @TS00001,X'04'                                      0317 00541000
         CLI   @TS00001,X'04'                                      0317 00542000
         BNE   @RF00317                                            0317 00543000
*        CAVAL = VALID;                                    /*@G51DGVS*/ 00544000
         MVC   CAVAL(10),VALID                                     0318 00545000
*      ELSE                                                        0319 00546000
*        CAVAL = NVALID;                                   /*@G51DGVS*/ 00547000
         B     @RC00317                                            0319 00548000
@RF00317 MVC   CAVAL(10),NVALID                                    0319 00549000
*      CALL PRINTER(LINE49);                               /*@G51DGVS*/ 00550000
@RC00317 LA    @01,@AL00320                                        0320 00551000
         BAL   @14,PRINTER                                         0320 00552000
*      IF (LRBCECSW(3) & HEX02) = HEX02 THEN                       0321 00553000
         MVC   @TS00001(1),LRBCECSW+2(R7)                          0321 00554000
         NI    @TS00001,X'02'                                      0321 00555000
         CLI   @TS00001,X'02'                                      0321 00556000
         BNE   @RF00321                                            0321 00557000
*        CHVAL = VALID;                                    /*@G51DGVS*/ 00558000
         MVC   CHVAL(10),VALID                                     0322 00559000
*      ELSE                                                        0323 00560000
*        CHVAL = NVALID;                                   /*@G51DGVS*/ 00561000
         B     @RC00321                                            0323 00562000
@RF00321 MVC   CHVAL(10),NVALID                                    0323 00563000
*      CALL PRINTER(LINE50);                               /*@G51DGVS*/ 00564000
@RC00321 LA    @01,@AL00324                                        0324 00565000
         BAL   @14,PRINTER                                         0324 00566000
*      IF (LRBCECSW(3) & HEX01) = HEX01 THEN                       0325 00567000
         MVC   @TS00001(1),LRBCECSW+2(R7)                          0325 00568000
         NI    @TS00001,X'01'                                      0325 00569000
         CLI   @TS00001,X'01'                                      0325 00570000
         BNE   @RF00325                                            0325 00571000
*        DVAL = VALID;                                     /*@G51DGVS*/ 00572000
         MVC   DVAL(10),VALID                                      0326 00573000
*      ELSE                                                        0327 00574000
*        DVAL = NVALID;                                    /*@G51DGVS*/ 00575000
         B     @RC00325                                            0327 00576000
@RF00325 MVC   DVAL(10),NVALID                                     0327 00577000
*      IF (LRBCECSW(2) & HEX01) = HEX01 THEN                       0328 00578000
@RC00325 MVC   @TS00001(1),LRBCECSW+1(R7)                          0328 00579000
         NI    @TS00001,X'01'                                      0328 00580000
         CLI   @TS00001,X'01'                                      0328 00581000
         BNE   @RF00328                                            0328 00582000
*        LVAL = STORED;                                    /*@G51DGVS*/ 00583000
         MVC   LVAL(10),STORED                                     0329 00584000
*      ELSE                                                        0330 00585000
*        LVAL = NSTORED;                                   /*@G51DGVS*/ 00586000
         B     @RC00328                                            0330 00587000
@RF00328 MVC   LVAL(10),NSTORED                                    0330 00588000
*      CALL PRINTER(LINE51A);                              /*@G51DGVS*/ 00589000
@RC00328 LA    @01,@AL00331                                        0331 00590000
         BAL   @14,PRINTER                                         0331 00591000
*      CALL PRINTER(LINE51);                               /*@G51DGVS*/ 00592000
         LA    @01,@AL00332                                        0332 00593000
         BAL   @14,PRINTER                                         0332 00594000
*      IF LRBCECSW(2) = HEX80 THEN                                 0333 00595000
         CLI   LRBCECSW+1(R7),X'80'                                0333 00596000
         BNE   @RF00333                                            0333 00597000
*        PERROR = ERRCPU;                                  /*@G51DGVS*/ 00598000
         MVC   PERROR(22),ERRCPU                                   0334 00599000
*      ELSE                                                        0335 00600000
*        IF LRBCECSW(2) = HEX40 THEN                               0335 00601000
         B     @RC00333                                            0335 00602000
@RF00333 CLI   LRBCECSW+1(R7),X'40'                                0335 00603000
         BNE   @RF00335                                            0335 00604000
*          PERROR = ERRCHN;                                /*@G51DGVS*/ 00605000
         MVC   PERROR(22),ERRCHN                                   0336 00606000
*        ELSE                                                      0337 00607000
*          IF LRBCECSW(2) = HEX20 THEN                             0337 00608000
         B     @RC00335                                            0337 00609000
@RF00335 CLI   LRBCECSW+1(R7),X'20'                                0337 00610000
         BNE   @RF00337                                            0337 00611000
*            PERROR = ERRSCU;                              /*@G51DGVS*/ 00612000
         MVC   PERROR(22),ERRSCU                                   0338 00613000
*          ELSE                                                    0339 00614000
*            IF LRBCECSW(2) = HEX10 THEN                           0339 00615000
         B     @RC00337                                            0339 00616000
@RF00337 CLI   LRBCECSW+1(R7),X'10'                                0339 00617000
         BNE   @RF00339                                            0339 00618000
*              PERROR = ERRSTO;                            /*@G51DGVS*/ 00619000
         MVC   PERROR(22),ERRSTO                                   0340 00620000
*            ELSE                                                  0341 00621000
*              IF LRBCECSW(2) = HEX08 THEN                         0341 00622000
         B     @RC00339                                            0341 00623000
@RF00339 CLI   LRBCECSW+1(R7),X'08'                                0341 00624000
         BNE   @RF00341                                            0341 00625000
*                PERROR = ERRCU;                           /*@G51DGVS*/ 00626000
         MVC   PERROR(22),ERRCU                                    0342 00627000
*              ELSE                                                0343 00628000
*                PERROR = NOASSD;                          /*@G51DGVS*/ 00629000
         B     @RC00341                                            0343 00630000
@RF00341 MVC   PERROR(22),NOASSD                                   0343 00631000
*      CALL PRINTER(LINE52);                               /*@G51DGVS*/ 00632000
@RC00341 DS    0H                                                  0344 00633000
@RC00339 DS    0H                                                  0344 00634000
@RC00337 DS    0H                                                  0344 00635000
@RC00335 DS    0H                                                  0344 00636000
@RC00333 LA    @01,@AL00344                                        0344 00637000
         BAL   @14,PRINTER                                         0344 00638000
*    END;                                                  /*@G51DGVS*/ 00639000
*  ELSE                                                            0346 00640000
*    CALL PRINTER(LINE44);                                 /*@G51DGVS*/ 00641000
         B     @RC00302                                            0346 00642000
@RF00302 LA    @01,@AL00346                                        0346 00643000
         BAL   @14,PRINTER                                         0346 00644000
*  END;                                                    /*@G51DGVS*/ 00645000
@EL00007 DS    0H                                                  0347 00646000
@EF00007 DS    0H                                                  0347 00647000
@ER00007 LM    @14,@12,@SA00007                                    0347 00648000
         BR    @14                                                 0347 00649000
*/*                                                          @G51DGVS*/ 00650000
*/* OUTPUT THE CCH FOOTPRINTS                                @G51DGVS*/ 00651000
*/*                                                          @G51DGVS*/ 00652000
*OUTPUT: PROC;                                             /*@G51DGVS*/ 00653000
OUTPUT   STM   @14,@12,@SA00008                                    0348 00654000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 00655000
         LA    @01,@AL00349                                        0349 00656000
         BAL   @14,PRINTER                                         0349 00657000
*CALL CONVERT(LRBCFT,FOOTS,2);                             /*@G51DGVS*/ 00658000
         MVC   @AL00001+4(8),@AL00350                              0350 00659000
         LA    @04,80                                              0350 00660000
         ALR   @04,R7                                              0350 00661000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0350 00662000
         AL    @04,@ZT00002                                        0350 00663000
         ST    @04,@AL00001                                        0350 00664000
         LA    @01,@AL00001                                        0350 00665000
         BAL   @14,CONVERT                                         0350 00666000
*CALL PRINTER(DLINE1);                                     /*@G51DGVS*/ 00667000
         LA    @01,@AL00351                                        0351 00668000
         BAL   @14,PRINTER                                         0351 00669000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 00670000
         LA    @01,@AL00352                                        0352 00671000
         BAL   @14,PRINTER                                         0352 00672000
*IF LRBIOS = ON THEN                                               0353 00673000
         LA    @04,80                                              0353 00674000
         ALR   @04,R7                                              0353 00675000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0353 00676000
         AL    @04,@ZT00002                                        0353 00677000
         TM    LRBIOS(@04),B'10000000'                             0353 00678000
         BNO   @RF00353                                            0353 00679000
*  IOS = FOXONE;                                           /*@G51DGVS*/ 00680000
         MVI   IOS,C'1'                                            0354 00681000
*ELSE                                                              0355 00682000
*  IOS = FOXZERO;                                          /*@G51DGVS*/ 00683000
         B     @RC00353                                            0355 00684000
@RF00353 MVI   IOS,C'0'                                            0355 00685000
*CALL PRINTER(DLINE2);                                     /*@G51DGVS*/ 00686000
@RC00353 LA    @01,@AL00356                                        0356 00687000
         BAL   @14,PRINTER                                         0356 00688000
*IF LRBUCB = ON THEN                                               0357 00689000
         LA    @04,80                                              0357 00690000
         ALR   @04,R7                                              0357 00691000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0357 00692000
         AL    @04,@ZT00002                                        0357 00693000
         TM    LRBUCB(@04),B'01000000'                             0357 00694000
         BNO   @RF00357                                            0357 00695000
*  UCB = FOXONE;                                           /*@G51DGVS*/ 00696000
         MVI   UCB,C'1'                                            0358 00697000
*ELSE                                                              0359 00698000
*  UCB = FOXZERO;                                          /*@G51DGVS*/ 00699000
         B     @RC00357                                            0359 00700000
@RF00357 MVI   UCB,C'0'                                            0359 00701000
*CALL PRINTER(DLINE3);                                     /*@G51DGVS*/ 00702000
@RC00357 LA    @01,@AL00360                                        0360 00703000
         BAL   @14,PRINTER                                         0360 00704000
*IF LRBERPIB = ON THEN                                             0361 00705000
         LA    @04,80                                              0361 00706000
         ALR   @04,R7                                              0361 00707000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0361 00708000
         AL    @04,@ZT00002                                        0361 00709000
         TM    LRBERPIB(@04),B'00100000'                           0361 00710000
         BNO   @RF00361                                            0361 00711000
*  ERPIB = FOXONE;                                         /*@G51DGVS*/ 00712000
         MVI   ERPIB,C'1'                                          0362 00713000
*ELSE                                                              0363 00714000
*  ERPIB = FOXZERO;                                        /*@G51DGVS*/ 00715000
         B     @RC00361                                            0363 00716000
@RF00361 MVI   ERPIB,C'0'                                          0363 00717000
*CALL PRINTER(DLINE4);                                     /*@G51DGVS*/ 00718000
@RC00361 LA    @01,@AL00364                                        0364 00719000
         BAL   @14,PRINTER                                         0364 00720000
*IF LRBCCHSI = ON THEN                                             0365 00721000
         LA    @04,80                                              0365 00722000
         ALR   @04,R7                                              0365 00723000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0365 00724000
         AL    @04,@ZT00002                                        0365 00725000
         TM    LRBCCHSI(@04),B'00010000'                           0365 00726000
         BNO   @RF00365                                            0365 00727000
*  IGFCCHSI = FOXONE;                                      /*@G51DGVS*/ 00728000
         MVI   IGFCCHSI,C'1'                                       0366 00729000
*ELSE                                                              0367 00730000
*  IGFCCHSI = FOXZERO;                                     /*@G51DGVS*/ 00731000
         B     @RC00365                                            0367 00732000
@RF00365 MVI   IGFCCHSI,C'0'                                       0367 00733000
*CALL PRINTER(DLINE5);                                     /*@G51DGVS*/ 00734000
@RC00365 LA    @01,@AL00368                                        0368 00735000
         BAL   @14,PRINTER                                         0368 00736000
*IF LRBCCHII = ON THEN                                             0369 00737000
         LA    @04,80                                              0369 00738000
         ALR   @04,R7                                              0369 00739000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0369 00740000
         AL    @04,@ZT00002                                        0369 00741000
         TM    LRBCCHII(@04),B'00001000'                           0369 00742000
         BNO   @RF00369                                            0369 00743000
*  IGFCCHII = FOXONE;                                      /*@G51DGVS*/ 00744000
         MVI   IGFCCHII,C'1'                                       0370 00745000
*ELSE                                                              0371 00746000
*  IGFCCHII = FOXZERO;                                     /*@G51DGVS*/ 00747000
         B     @RC00369                                            0371 00748000
@RF00369 MVI   IGFCCHII,C'0'                                       0371 00749000
*CALL PRINTER(DLINE6);                                     /*@G51DGVS*/ 00750000
@RC00369 LA    @01,@AL00372                                        0372 00751000
         BAL   @14,PRINTER                                         0372 00752000
*IF LRBCCHFE = ON THEN                                             0373 00753000
         LA    @04,80                                              0373 00754000
         ALR   @04,R7                                              0373 00755000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0373 00756000
         AL    @04,@ZT00002                                        0373 00757000
         TM    LRBCCHFE(@04),B'00000100'                           0373 00758000
         BNO   @RF00373                                            0373 00759000
*  IGFCCHFE = FOXONE;                                      /*@G51DGVS*/ 00760000
         MVI   IGFCCHFE,C'1'                                       0374 00761000
*ELSE                                                              0375 00762000
*  IGFCCHFE = FOXZERO;                                     /*@G51DGVS*/ 00763000
         B     @RC00373                                            0375 00764000
@RF00373 MVI   IGFCCHFE,C'0'                                       0375 00765000
*CALL PRINTER(DLINE7);                                     /*@G51DGVS*/ 00766000
@RC00373 LA    @01,@AL00376                                        0376 00767000
         BAL   @14,PRINTER                                         0376 00768000
*IF LRBC60 = ON THEN                                               0377 00769000
         LA    @04,80                                              0377 00770000
         ALR   @04,R7                                              0377 00771000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0377 00772000
         AL    @04,@ZT00002                                        0377 00773000
         TM    LRBC60(@04),B'00000010'                             0377 00774000
         BNO   @RF00377                                            0377 00775000
*  IGFC60 = FOXONE;                                        /*@G51DGVS*/ 00776000
         MVI   IGFC60,C'1'                                         0378 00777000
*ELSE                                                              0379 00778000
*  IGFC60 = FOXZERO;                                       /*@G51DGVS*/ 00779000
         B     @RC00377                                            0379 00780000
@RF00377 MVI   IGFC60,C'0'                                         0379 00781000
*CALL PRINTER(DLINE8);                                     /*@G51DGVS*/ 00782000
@RC00377 LA    @01,@AL00380                                        0380 00783000
         BAL   @14,PRINTER                                         0380 00784000
*IF LRBC70 = ON THEN                                               0381 00785000
         LA    @04,80                                              0381 00786000
         ALR   @04,R7                                              0381 00787000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0381 00788000
         AL    @04,@ZT00002                                        0381 00789000
         TM    LRBC70(@04),B'00000001'                             0381 00790000
         BNO   @RF00381                                            0381 00791000
*  IGFC70 = FOXONE;                                        /*@G51DGVS*/ 00792000
         MVI   IGFC70,C'1'                                         0382 00793000
*ELSE                                                              0383 00794000
*  IGFC70 = FOXZERO;                                       /*@G51DGVS*/ 00795000
         B     @RC00381                                            0383 00796000
@RF00381 MVI   IGFC70,C'0'                                         0383 00797000
*CALL PRINTER(DLINE9);                                     /*@G51DGVS*/ 00798000
@RC00381 LA    @01,@AL00384                                        0384 00799000
         BAL   @14,PRINTER                                         0384 00800000
*IF LRBC80 = ON THEN                                               0385 00801000
         LA    @04,80                                              0385 00802000
         ALR   @04,R7                                              0385 00803000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0385 00804000
         AL    @04,@ZT00002                                        0385 00805000
         TM    LRBC80(@04),B'10000000'                             0385 00806000
         BNO   @RF00385                                            0385 00807000
*  IGFC80 = FOXONE;                                        /*@G51DGVS*/ 00808000
         MVI   IGFC80,C'1'                                         0386 00809000
*ELSE                                                              0387 00810000
*  IGFC80 = FOXZERO;                                       /*@G51DGVS*/ 00811000
         B     @RC00385                                            0387 00812000
@RF00385 MVI   IGFC80,C'0'                                         0387 00813000
*CALL PRINTER(DLINE10);                                    /*@G51DGVS*/ 00814000
@RC00385 LA    @01,@AL00388                                        0388 00815000
         BAL   @14,PRINTER                                         0388 00816000
*IF LRBCIC = ON THEN                                               0389 00817000
         LA    @04,80                                              0389 00818000
         ALR   @04,R7                                              0389 00819000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0389 00820000
         AL    @04,@ZT00002                                        0389 00821000
         TM    LRBCIC(@04),B'01000000'                             0389 00822000
         BNO   @RF00389                                            0389 00823000
*  IGFCIC = FOXONE;                                        /*@G51DGVS*/ 00824000
         MVI   IGFCIC,C'1'                                         0390 00825000
*ELSE                                                              0391 00826000
*  IGFCIC = FOXZERO;                                       /*@G51DGVS*/ 00827000
         B     @RC00389                                            0391 00828000
@RF00389 MVI   IGFCIC,C'0'                                         0391 00829000
*CALL PRINTER(DLINE11);                                    /*@G51DGVS*/ 00830000
@RC00389 LA    @01,@AL00392                                        0392 00831000
         BAL   @14,PRINTER                                         0392 00832000
*IF LRBCCHRD = ON THEN                                             0393 00833000
         LA    @04,80                                              0393 00834000
         ALR   @04,R7                                              0393 00835000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0393 00836000
         AL    @04,@ZT00002                                        0393 00837000
         TM    LRBCCHRD(@04),B'00100000'                           0393 00838000
         BNO   @RF00393                                            0393 00839000
*  IGFCCHRD = FOXONE;                                      /*@G51DGVS*/ 00840000
         MVI   IGFCCHRD,C'1'                                       0394 00841000
*ELSE                                                              0395 00842000
*  IGFCCHRD = FOXZERO;                                     /*@G51DGVS*/ 00843000
         B     @RC00393                                            0395 00844000
@RF00393 MVI   IGFCCHRD,C'0'                                       0395 00845000
*CALL PRINTER(DLINE12);                                    /*@G51DGVS*/ 00846000
@RC00393 LA    @01,@AL00396                                        0396 00847000
         BAL   @14,PRINTER                                         0396 00848000
*IF LRBCCHMP = ON THEN                                             0397 00849000
         LA    @04,80                                              0397 00850000
         ALR   @04,R7                                              0397 00851000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0397 00852000
         AL    @04,@ZT00002                                        0397 00853000
         TM    LRBCCHMP(@04),B'00010000'                           0397 00854000
         BNO   @RF00397                                            0397 00855000
*  IGFCCHMP = FOXONE;                                      /*@G51DGVS*/ 00856000
         MVI   IGFCCHMP,C'1'                                       0398 00857000
*ELSE                                                              0399 00858000
*  IGFCCHMP = FOXZERO;                                     /*@G51DGVS*/ 00859000
         B     @RC00397                                            0399 00860000
@RF00397 MVI   IGFCCHMP,C'0'                                       0399 00861000
*CALL PRINTER(DLINE13);                                    /*@G51DGVS*/ 00862000
@RC00397 LA    @01,@AL00400                                        0400 00863000
         BAL   @14,PRINTER                                         0400 00864000
*IF LRBCCHUC = ON THEN                                             0401 00865000
         LA    @04,80                                              0401 00866000
         ALR   @04,R7                                              0401 00867000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0401 00868000
         AL    @04,@ZT00002                                        0401 00869000
         TM    LRBCCHUC(@04),B'00001000'                           0401 00870000
         BNO   @RF00401                                            0401 00871000
*  IGFCCHUC = FOXONE;                                      /*@G51DGVS*/ 00872000
         MVI   IGFCCHUC,C'1'                                       0402 00873000
*ELSE                                                              0403 00874000
*  IGFCCHUC = FOXZERO;                                     /*@G51DGVS*/ 00875000
         B     @RC00401                                            0403 00876000
@RF00401 MVI   IGFCCHUC,C'0'                                       0403 00877000
*CALL PRINTER(DLINE14);                                    /*@G51DGVS*/ 00878000
@RC00401 LA    @01,@AL00404                                        0404 00879000
         BAL   @14,PRINTER                                         0404 00880000
*IF LRBCCHAS = ON THEN                                             0405 00881000
         LA    @04,80                                              0405 00882000
         ALR   @04,R7                                              0405 00883000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0405 00884000
         AL    @04,@ZT00002                                        0405 00885000
         TM    LRBCCHAS(@04),B'00000100'                           0405 00886000
         BNO   @RF00405                                            0405 00887000
*  IGFCCHAS = FOXONE;                                      /*@G51DGVS*/ 00888000
         MVI   IGFCCHAS,C'1'                                       0406 00889000
*ELSE                                                              0407 00890000
*  IGFCCHAS = FOXZERO;                                     /*@G51DGVS*/ 00891000
         B     @RC00405                                            0407 00892000
@RF00405 MVI   IGFCCHAS,C'0'                                       0407 00893000
*CALL PRINTER(DLINE15);                                    /*@G51DGVS*/ 00894000
@RC00405 LA    @01,@AL00408                                        0408 00895000
         BAL   @14,PRINTER                                         0408 00896000
*IF LRBCCHIO = ON THEN                                             0409 00897000
         LA    @04,80                                              0409 00898000
         ALR   @04,R7                                              0409 00899000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0409 00900000
         AL    @04,@ZT00002                                        0409 00901000
         TM    LRBCCHIO(@04),B'00000010'                           0409 00902000
         BNO   @RF00409                                            0409 00903000
*  IGFCCHIO = FOXONE;                                      /*@G51DGVS*/ 00904000
         MVI   IGFCCHIO,C'1'                                       0410 00905000
*ELSE                                                              0411 00906000
*  IGFCCHIO = FOXZERO;                                     /*@G51DGVS*/ 00907000
         B     @RC00409                                            0411 00908000
@RF00409 MVI   IGFCCHIO,C'0'                                       0411 00909000
*CALL PRINTER(DLINE16);                                    /*@G51DGVS*/ 00910000
@RC00409 LA    @01,@AL00412                                        0412 00911000
         BAL   @14,PRINTER                                         0412 00912000
*IF LRBCCHEX = ON THEN                                             0413 00913000
         LA    @04,80                                              0413 00914000
         ALR   @04,R7                                              0413 00915000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0413 00916000
         AL    @04,@ZT00002                                        0413 00917000
         TM    LRBCCHEX(@04),B'00000001'                           0413 00918000
         BNO   @RF00413                                            0413 00919000
*  IGFCCHEX = FOXONE;                                      /*@G51DGVS*/ 00920000
         MVI   IGFCCHEX,C'1'                                       0414 00921000
*ELSE                                                              0415 00922000
*  IGFCCHEX = FOXZERO;                                     /*@G51DGVS*/ 00923000
         B     @RC00413                                            0415 00924000
@RF00413 MVI   IGFCCHEX,C'0'                                       0415 00925000
*CALL PRINTER(DLINE17);                                    /*@G51DGVS*/ 00926000
@RC00413 LA    @01,@AL00416                                        0416 00927000
         BAL   @14,PRINTER                                         0416 00928000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 00929000
         LA    @01,@AL00417                                        0417 00930000
         BAL   @14,PRINTER                                         0417 00931000
*CALL PRINTER(DLINE18);                                    /*@G51DGVS*/ 00932000
         LA    @01,@AL00418                                        0418 00933000
         BAL   @14,PRINTER                                         0418 00934000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 00935000
         LA    @01,@AL00419                                        0419 00936000
         BAL   @14,PRINTER                                         0419 00937000
*IF LRBCRHA = ON THEN                                              0420 00938000
         TM    LRBCRHA(R7),B'00000100'                             0420 00939000
         BNO   @RF00420                                            0420 00940000
*  DO;                                                     /*@G51DGVS*/ 00941000
*    CALL PRINTER(DLINE19);                                /*@G51DGVS*/ 00942000
         LA    @01,@AL00422                                        0422 00943000
         BAL   @14,PRINTER                                         0422 00944000
*    CALL PRINTER(BLINE);                                  /*@G51DGVS*/ 00945000
         LA    @01,@AL00423                                        0423 00946000
         BAL   @14,PRINTER                                         0423 00947000
*  END;                                                    /*@G51DGVS*/ 00948000
*IF LRBCMPNO ^= ZERO THEN                                          0425 00949000
@RF00420 LA    @04,80                                              0425 00950000
         ALR   @04,R7                                              0425 00951000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0425 00952000
         AL    @04,@ZT00002                                        0425 00953000
         MVC   @ZT00002+2(2),LRBCMPNO(@04)                         0425 00954000
         L     @04,@ZT00002                                        0425 00955000
         LTR   @04,@04                                             0425 00956000
         BZ    @RF00425                                            0425 00957000
*  DO;                                                     /*@G51DGVS*/ 00958000
*    CALL PRINTER(DLINE20);                                /*@G51DGVS*/ 00959000
         LA    @01,@AL00427                                        0427 00960000
         BAL   @14,PRINTER                                         0427 00961000
*    CALL PRINTER(BLINE);                                  /*@G51DGVS*/ 00962000
         LA    @01,@AL00428                                        0428 00963000
         BAL   @14,PRINTER                                         0428 00964000
*    DO I = 1 TO LRBCMPNO BY 1;                            /*@G51DGVS*/ 00965000
         LA    @04,1                                               0429 00966000
         ST    @04,I                                               0429 00967000
         B     @DE00429                                            0429 00968000
@DL00429 DS    0H                                                  0430 00969000
*      CALL CONVERT(LRBCMPPA(I),PROCADDR,2);               /*@G51DGVS*/ 00970000
         MVC   @AL00001+4(8),@AL00430                              0430 00971000
         SLA   @04,2                                               0430 00972000
         LA    @03,80                                              0430 00973000
         ALR   @03,R7                                              0430 00974000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0430 00975000
         AL    @03,@ZT00002                                        0430 00976000
         LA    @04,LRBCMPPA-4(@04,@03)                             0430 00977000
         ST    @04,@AL00001                                        0430 00978000
         LA    @01,@AL00001                                        0430 00979000
         BAL   @14,CONVERT                                         0430 00980000
*      L = LRBCMPCS(I);                                    /*@G51DGVS*/ 00981000
         L     @04,I                                               0431 00982000
         SLA   @04,2                                               0431 00983000
         LA    @15,80                                              0431 00984000
         ALR   @15,R7                                              0431 00985000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0431 00986000
         AL    @15,@ZT00002                                        0431 00987000
         ALR   @15,@04                                             0431 00988000
         MVC   @ZT00002+2(2),LRBCMPCS-4(@15)                       0431 00989000
         L     L,@ZT00002                                          0431 00990000
*      SLL(L,15);                                          /*@G51DGVS*/ 00991000
         SLL   L,15                                                0432 00992000
*      DO J = 1 TO 16;                                     /*@G51DGVS*/ 00993000
         LA    @04,1                                               0433 00994000
         ST    @04,J                                               0433 00995000
@DL00433 DS    0H                                                  0434 00996000
*        SLL (L,1);                                        /*@G51DGVS*/ 00997000
         SLL   L,1                                                 0434 00998000
*        IF L >= ZERO THEN                                         0435 00999000
         LTR   L,L                                                 0435 01000000
         BM    @RF00435                                            0435 01001000
*          CHANON(J) = 'X';                                /*@G51DGVS*/ 01002000
         MH    @04,@CH00077                                        0436 01003000
         LA    @01,CHANON-3(@04)                                   0436 01004000
         MVI   0(@01),C'X'                                         0436 01005000
*        ELSE                                                      0437 01006000
*          CHANON(J) = BLANK;                              /*@G51DGVS*/ 01007000
         B     @RC00435                                            0437 01008000
@RF00435 L     @04,J                                               0437 01009000
         MH    @04,@CH00077                                        0437 01010000
         LA    @01,CHANON-3(@04)                                   0437 01011000
         MVI   0(@01),C' '                                         0437 01012000
*      END;                                                /*@G51DGVS*/ 01013000
@RC00435 LA    @04,1                                               0438 01014000
         AL    @04,J                                               0438 01015000
         ST    @04,J                                               0438 01016000
         CH    @04,@CH00088                                        0438 01017000
         BNH   @DL00433                                            0438 01018000
*      CALL PRINTER(DLINE21);                              /*@G51DGVS*/ 01019000
         LA    @01,@AL00439                                        0439 01020000
         BAL   @14,PRINTER                                         0439 01021000
*    END;                                                  /*@G51DGVS*/ 01022000
         LA    @04,1                                               0440 01023000
         AL    @04,I                                               0440 01024000
         ST    @04,I                                               0440 01025000
@DE00429 LA    @03,80                                              0440 01026000
         ALR   @03,R7                                              0440 01027000
         MVC   @ZT00002+2(2),LRBCLOGL(R7)                          0440 01028000
         AL    @03,@ZT00002                                        0440 01029000
         MVC   @ZT00002+2(2),LRBCMPNO(@03)                         0440 01030000
         C     @04,@ZT00002                                        0440 01031000
         BNH   @DL00429                                            0440 01032000
*  END;                                                    /*@G51DGVS*/ 01033000
*RETURN;                                                   /*@G51DGVS*/ 01034000
@EL00008 DS    0H                                                  0442 01035000
@EF00008 DS    0H                                                  0442 01036000
@ER00008 LM    @14,@12,@SA00008                                    0442 01037000
         BR    @14                                                 0442 01038000
*END;                                                      /*@G51DGVS*/ 01039000
         B     @EL00008                                            0443 01040000
@PB00008 DS    0H                                                  0444 01041000
*/*                                                          @G51DGVS*/ 01042000
*/* MAIN LINE                                                @G51DGVS*/ 01043000
*/*                                                          @G51DGVS*/ 01044000
*MYLINCT = ZERO;                                           /*@G51DGVS*/ 01045000
         SLR   @04,@04                                             0444 01046000
         ST    @04,MYLINCT                                         0444 01047000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01048000
         LA    @01,@AL00445                                        0445 01049000
         BAL   @14,PRINTER                                         0445 01050000
*CALL CONVERT(LRBHMDL,LMODEL,2);                           /*@G51DGVS*/ 01051000
         MVC   @AL00001+4(8),@AL00446                              0446 01052000
         LA    @04,LRBHMDL(,R7)                                    0446 01053000
         ST    @04,@AL00001                                        0446 01054000
         LA    @01,@AL00001                                        0446 01055000
         BAL   @14,CONVERT                                         0446 01056000
*CALL CONVERT (LRBHCSER,SERIAL,3);                         /*@G51DGVS*/ 01057000
         MVC   @AL00001+4(8),@AL00447                              0447 01058000
         LA    @04,LRBHCSER(,R7)                                   0447 01059000
         ST    @04,@AL00001                                        0447 01060000
         LA    @01,@AL00001                                        0447 01061000
         BAL   @14,CONVERT                                         0447 01062000
*CALL PRINTER(LINE1);                                      /*@G51DGVS*/ 01063000
         LA    @01,@AL00448                                        0448 01064000
         BAL   @14,PRINTER                                         0448 01065000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01066000
         LA    @01,@AL00449                                        0449 01067000
         BAL   @14,PRINTER                                         0449 01068000
*I = LRBHSYS & '1F'X;                                      /*@G51DGVS*/ 01069000
         LA    @04,31                                              0450 01070000
         MVC   @ZT00003+3(1),LRBHSYS(R7)                           0450 01071000
         N     @04,@ZT00003                                        0450 01072000
         ST    @04,I                                               0450 01073000
*IF LRBHSYS1 = ON THEN                                             0451 01074000
         TM    LRBHSYS1(R7),B'10000000'                            0451 01075000
         BNO   @RF00451                                            0451 01076000
*  SYS(1:4) = 'VS 2';                                      /*@G51DGVS*/ 01077000
         MVC   SYS(4),@CC01478                                     0452 01078000
*ELSE                                                              0453 01079000
*  IF LRBHSYS2 = ON & LRBHSYS3 = ON THEN                           0453 01080000
         B     @RC00451                                            0453 01081000
@RF00451 TM    LRBHSYS2(R7),B'01100000'                            0453 01082000
         BNO   @RF00453                                            0453 01083000
*    SYS(1:4) = 'VM  ';                                    /*@G51DGVS*/ 01084000
         MVC   SYS(4),@CC01479                                     0454 01085000
*  ELSE                                                            0455 01086000
*    IF LRBHSYS2 = ON THEN                                         0455 01087000
         B     @RC00453                                            0455 01088000
@RF00453 TM    LRBHSYS2(R7),B'01000000'                            0455 01089000
         BNO   @RF00455                                            0455 01090000
*      SYS(1:4) = 'VS 1';                                  /*@G51DGVS*/ 01091000
         MVC   SYS(4),@CC01480                                     0456 01092000
*    ELSE                                                          0457 01093000
*      IF LRBHSYS3 = ON THEN                                       0457 01094000
         B     @RC00455                                            0457 01095000
@RF00455 TM    LRBHSYS3(R7),B'00100000'                            0457 01096000
         BNO   @RF00457                                            0457 01097000
*        DO;                                               /*@G51DGVS*/ 01098000
*          SYS(1:4) = 'DOS ';                              /*@G51DGVS*/ 01099000
         MVC   SYS(4),@CC01481                                     0459 01100000
*          I = I + 28;                                     /*@G51DGVS*/ 01101000
         LA    @04,28                                              0460 01102000
         AL    @04,I                                               0460 01103000
         ST    @04,I                                               0460 01104000
*        END;                                              /*@G51DGVS*/ 01105000
*      ELSE                                                        0462 01106000
*        SYS(1:4) = 'OS  ';                                /*@G51DGVS*/ 01107000
         B     @RC00457                                            0462 01108000
@RF00457 MVC   SYS(4),@CC01482                                     0462 01109000
*CALL CONVBIN2(I,REL);                                     /*@G51DGVS*/ 01110000
@RC00457 DS    0H                                                  0463 01111000
@RC00455 DS    0H                                                  0463 01112000
@RC00453 DS    0H                                                  0463 01113000
@RC00451 LA    @01,@AL00463                                        0463 01114000
         BAL   @14,CONVBIN2                                        0463 01115000
*CALL PRINTER(LINE2);                                      /*@G51DGVS*/ 01116000
         LA    @01,@AL00464                                        0464 01117000
         BAL   @14,PRINTER                                         0464 01118000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01119000
         LA    @01,@AL00465                                        0465 01120000
         BAL   @14,PRINTER                                         0465 01121000
*CALL PRINTER(LINE3);                                      /*@G51DGVS*/ 01122000
         LA    @01,@AL00466                                        0466 01123000
         BAL   @14,PRINTER                                         0466 01124000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01125000
         LA    @01,@AL00467                                        0467 01126000
         BAL   @14,PRINTER                                         0467 01127000
*JOBNAME = LRBJOBID;                                       /*@G51DGVS*/ 01128000
         MVC   JOBNAME(8),LRBJOBID(R7)                             0468 01129000
*CALL PRINTER(LINE6B1);                                    /*@G51DGVS*/ 01130000
         LA    @01,@AL00469                                        0469 01131000
         BAL   @14,PRINTER                                         0469 01132000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01133000
         LA    @01,@AL00470                                        0470 01134000
         BAL   @14,PRINTER                                         0470 01135000
*CALL PRINTER(LINE7);                                      /*@G51DGVS*/ 01136000
         LA    @01,@AL00471                                        0471 01137000
         BAL   @14,PRINTER                                         0471 01138000
*CALL CONVERT (LRBHDATE,WORK,4);                           /*@G51DGVS*/ 01139000
         MVC   @AL00001+4(8),@AL00472                              0472 01140000
         LA    @04,LRBHDATE(,R7)                                   0472 01141000
         ST    @04,@AL00001                                        0472 01142000
         LA    @01,@AL00001                                        0472 01143000
         BAL   @14,CONVERT                                         0472 01144000
*DAY(1:3) = WORK(5:7);                                     /*@G51DGVS*/ 01145000
         MVC   DAY(3),WORK+4                                       0473 01146000
*YEAR(1:2) = WORK(3:4);                                    /*@G51DGVS*/ 01147000
         MVC   YEAR(2),WORK+2                                      0474 01148000
*CALL CONVERT(LRBHTIME,WORK,4);                            /*@G51DGVS*/ 01149000
         MVC   @AL00001+4(8),@AL00475                              0475 01150000
         LA    @04,LRBHTIME(,R7)                                   0475 01151000
         ST    @04,@AL00001                                        0475 01152000
         LA    @01,@AL00001                                        0475 01153000
         BAL   @14,CONVERT                                         0475 01154000
*TIMEHH = WORK(1:2);                                       /*@G51DGVS*/ 01155000
         MVI   TIMEHH+2,C' '                                       0476 01156000
         MVC   TIMEHH(2),WORK                                      0476 01157000
*TIMEMM = WORK(3:4);                                       /*@G51DGVS*/ 01158000
         MVI   TIMEMM+2,C' '                                       0477 01159000
         MVC   TIMEMM(2),WORK+2                                    0477 01160000
*TIMESS = WORK(5:6);                                       /*@G51DGVS*/ 01161000
         MVI   TIMESS+2,C' '                                       0478 01162000
         MVC   TIMESS(2),WORK+4                                    0478 01163000
*TIMETH = WORK(7:8);                                       /*@G51DGVS*/ 01164000
         MVC   TIMETH(2),WORK+6                                    0479 01165000
*CALL PRINTER(LINE8);                                      /*@G51DGVS*/ 01166000
         LA    @01,@AL00480                                        0480 01167000
         BAL   @14,PRINTER                                         0480 01168000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01169000
         LA    @01,@AL00481                                        0481 01170000
         BAL   @14,PRINTER                                         0481 01171000
*CALL CONVERT(LRBCCUA,CCHCUA,3);                           /*@G51DGVS*/ 01172000
         MVC   @AL00001+4(8),@AL00482                              0482 01173000
         LA    @04,LRBCCUA(,R7)                                    0482 01174000
         ST    @04,@AL00001                                        0482 01175000
         LA    @01,@AL00001                                        0482 01176000
         BAL   @14,CONVERT                                         0482 01177000
*CALL PRINTER(LINE9);                                      /*@G51DGVS*/ 01178000
         LA    @01,@AL00483                                        0483 01179000
         BAL   @14,PRINTER                                         0483 01180000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01181000
         LA    @01,@AL00484                                        0484 01182000
         BAL   @14,PRINTER                                         0484 01183000
*CALL CONVERT(LRBCHCUA,CUA184,2);                          /*@G51DGVS*/ 01184000
         MVC   @AL00001+4(8),@AL00485                              0485 01185000
         LA    @04,LRBCHCUA(,R7)                                   0485 01186000
         ST    @04,@AL00001                                        0485 01187000
         LA    @01,@AL00001                                        0485 01188000
         BAL   @14,CONVERT                                         0485 01189000
*CALL PRINTER(LINE10);                                     /*@G51DGVS*/ 01190000
         LA    @01,@AL00486                                        0486 01191000
         BAL   @14,PRINTER                                         0486 01192000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01193000
         LA    @01,@AL00487                                        0487 01194000
         BAL   @14,PRINTER                                         0487 01195000
*CALL PRINTER(LINE11A);                                    /*@G51DGVS*/ 01196000
         LA    @01,@AL00488                                        0488 01197000
         BAL   @14,PRINTER                                         0488 01198000
*CALL CONVERT(LRBCRCCW,WORK,8);                            /*@G51DGVS*/ 01199000
         MVC   @AL00001+4(8),@AL00489                              0489 01200000
         LA    @04,LRBCRCCW(,R7)                                   0489 01201000
         ST    @04,@AL00001                                        0489 01202000
         LA    @01,@AL00001                                        0489 01203000
         BAL   @14,CONVERT                                         0489 01204000
*CCWCC = WORK(1:2);                                        /*@G51DGVS*/ 01205000
         MVC   CCWCC(2),WORK                                       0490 01206000
*CCWDA = WORK(3:8);                                        /*@G51DGVS*/ 01207000
         MVC   CCWDA(6),WORK+2                                     0491 01208000
*CCWFL = WORK(9:10);                                       /*@G51DGVS*/ 01209000
         MVC   CCWFL(2),WORK+8                                     0492 01210000
*CCWXX = WORK(11:12);                                      /*@G51DGVS*/ 01211000
         MVC   CCWXX(2),WORK+10                                    0493 01212000
*CCWCT = WORK(13:16);                                      /*@G51DGVS*/ 01213000
         MVC   CCWCT(4),WORK+12                                    0494 01214000
*CALL PRINTER(LINE11);                                     /*@G51DGVS*/ 01215000
         LA    @01,@AL00495                                        0495 01216000
         BAL   @14,PRINTER                                         0495 01217000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01218000
         LA    @01,@AL00496                                        0496 01219000
         BAL   @14,PRINTER                                         0496 01220000
*CALL PRINTER(LINE12A);                                    /*@G51DGVS*/ 01221000
         LA    @01,@AL00497                                        0497 01222000
         BAL   @14,PRINTER                                         0497 01223000
*CALL CONVERT(LRBCRCSW,WORK,8);                            /*@G51DGVS*/ 01224000
         MVC   @AL00001+4(8),@AL00498                              0498 01225000
         LA    @04,LRBCRCSW(,R7)                                   0498 01226000
         ST    @04,@AL00001                                        0498 01227000
         LA    @01,@AL00001                                        0498 01228000
         BAL   @14,CONVERT                                         0498 01229000
*CSWCC = WORK(1:2);                                        /*@G51DGVS*/ 01230000
         MVC   CSWCC(2),WORK                                       0499 01231000
*CSWDA = WORK(3:8);                                        /*@G51DGVS*/ 01232000
         MVC   CSWDA(6),WORK+2                                     0500 01233000
*CSWFL = WORK(9:10);                                       /*@G51DGVS*/ 01234000
         MVC   CSWFL(2),WORK+8                                     0501 01235000
*CSWXX = WORK(11:12);                                      /*@G51DGVS*/ 01236000
         MVC   CSWXX(2),WORK+10                                    0502 01237000
*CSWCT = WORK(13:16);                                      /*@G51DGVS*/ 01238000
         MVC   CSWCT(4),WORK+12                                    0503 01239000
*CALL PRINTER(LINE12);                                     /*@G51DGVS*/ 01240000
         LA    @01,@AL00504                                        0504 01241000
         BAL   @14,PRINTER                                         0504 01242000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01243000
         LA    @01,@AL00505                                        0505 01244000
         BAL   @14,PRINTER                                         0505 01245000
*CALL PRINTER(LINE13);                                     /*@G51DGVS*/ 01246000
         LA    @01,@AL00506                                        0506 01247000
         BAL   @14,PRINTER                                         0506 01248000
*WORK(1:2) = LRBCRCSW(5:6);                                /*@G51DGVS*/ 01249000
         MVC   WORK(2),LRBCRCSW+4(R7)                              0507 01250000
*IF (WORK(1) & HEX80) = HEX80 THEN                                 0508 01251000
         MVC   @TS00001(1),WORK                                    0508 01252000
         NI    @TS00001,X'80'                                      0508 01253000
         CLI   @TS00001,X'80'                                      0508 01254000
         BNE   @RF00508                                            0508 01255000
*  ATTEN = FOXONE;                                         /*@G51DGVS*/ 01256000
         MVI   ATTEN,C'1'                                          0509 01257000
*ELSE                                                              0510 01258000
*  ATTEN = FOXZERO;                                        /*@G51DGVS*/ 01259000
         B     @RC00508                                            0510 01260000
@RF00508 MVI   ATTEN,C'0'                                          0510 01261000
*IF (WORK(2) & HEX80) = HEX80 THEN                                 0511 01262000
@RC00508 MVC   @TS00001(1),WORK+1                                  0511 01263000
         NI    @TS00001,X'80'                                      0511 01264000
         CLI   @TS00001,X'80'                                      0511 01265000
         BNE   @RF00511                                            0511 01266000
*  PGMIRPT = FOXONE;                                       /*@G51DGVS*/ 01267000
         MVI   PGMIRPT,C'1'                                        0512 01268000
*ELSE                                                              0513 01269000
*  PGMIRPT = FOXZERO;                                      /*@G51DGVS*/ 01270000
         B     @RC00511                                            0513 01271000
@RF00511 MVI   PGMIRPT,C'0'                                        0513 01272000
*CALL PRINTER(LINE14);                                     /*@G51DGVS*/ 01273000
@RC00511 LA    @01,@AL00514                                        0514 01274000
         BAL   @14,PRINTER                                         0514 01275000
*IF (WORK(1) & HEX40) = HEX40 THEN                                 0515 01276000
         MVC   @TS00001(1),WORK                                    0515 01277000
         NI    @TS00001,X'40'                                      0515 01278000
         CLI   @TS00001,X'40'                                      0515 01279000
         BNE   @RF00515                                            0515 01280000
*  STATM = FOXONE;                                         /*@G51DGVS*/ 01281000
         MVI   STATM,C'1'                                          0516 01282000
*ELSE                                                              0517 01283000
*  STATM = FOXZERO;                                        /*@G51DGVS*/ 01284000
         B     @RC00515                                            0517 01285000
@RF00515 MVI   STATM,C'0'                                          0517 01286000
*IF (WORK(2) & HEX40) = HEX40 THEN                                 0518 01287000
@RC00515 MVC   @TS00001(1),WORK+1                                  0518 01288000
         NI    @TS00001,X'40'                                      0518 01289000
         CLI   @TS00001,X'40'                                      0518 01290000
         BNE   @RF00518                                            0518 01291000
*  INCLEN = FOXONE;                                        /*@G51DGVS*/ 01292000
         MVI   INCLEN,C'1'                                         0519 01293000
*ELSE                                                              0520 01294000
*  INCLEN = FOXZERO;                                       /*@G51DGVS*/ 01295000
         B     @RC00518                                            0520 01296000
@RF00518 MVI   INCLEN,C'0'                                         0520 01297000
*CALL PRINTER(LINE15);                                     /*@G51DGVS*/ 01298000
@RC00518 LA    @01,@AL00521                                        0521 01299000
         BAL   @14,PRINTER                                         0521 01300000
*IF (WORK(1) & HEX20) = HEX20 THEN                                 0522 01301000
         MVC   @TS00001(1),WORK                                    0522 01302000
         NI    @TS00001,X'20'                                      0522 01303000
         CLI   @TS00001,X'20'                                      0522 01304000
         BNE   @RF00522                                            0522 01305000
*  CONUE = FOXONE;                                         /*@G51DGVS*/ 01306000
         MVI   CONUE,C'1'                                          0523 01307000
*ELSE                                                              0524 01308000
*  CONUE = FOXZERO;                                        /*@G51DGVS*/ 01309000
         B     @RC00522                                            0524 01310000
@RF00522 MVI   CONUE,C'0'                                          0524 01311000
*IF (WORK(2) & HEX20) = HEX20 THEN                                 0525 01312000
@RC00522 MVC   @TS00001(1),WORK+1                                  0525 01313000
         NI    @TS00001,X'20'                                      0525 01314000
         CLI   @TS00001,X'20'                                      0525 01315000
         BNE   @RF00525                                            0525 01316000
*  PGMCHK = FOXONE;                                        /*@G51DGVS*/ 01317000
         MVI   PGMCHK,C'1'                                         0526 01318000
*ELSE                                                              0527 01319000
*  PGMCHK = FOXZERO;                                       /*@G51DGVS*/ 01320000
         B     @RC00525                                            0527 01321000
@RF00525 MVI   PGMCHK,C'0'                                         0527 01322000
*CALL PRINTER(LINE16);                                     /*@G51DGVS*/ 01323000
@RC00525 LA    @01,@AL00528                                        0528 01324000
         BAL   @14,PRINTER                                         0528 01325000
*IF (WORK(1) & HEX10) = HEX10 THEN                                 0529 01326000
         MVC   @TS00001(1),WORK                                    0529 01327000
         NI    @TS00001,X'10'                                      0529 01328000
         CLI   @TS00001,X'10'                                      0529 01329000
         BNE   @RF00529                                            0529 01330000
*  BUSY = FOXONE;                                          /*@G51DGVS*/ 01331000
         MVI   BUSY,C'1'                                           0530 01332000
*ELSE                                                              0531 01333000
*  BUSY = FOXZERO;                                         /*@G51DGVS*/ 01334000
         B     @RC00529                                            0531 01335000
@RF00529 MVI   BUSY,C'0'                                           0531 01336000
*IF (WORK(2) & HEX10) = HEX10 THEN                                 0532 01337000
@RC00529 MVC   @TS00001(1),WORK+1                                  0532 01338000
         NI    @TS00001,X'10'                                      0532 01339000
         CLI   @TS00001,X'10'                                      0532 01340000
         BNE   @RF00532                                            0532 01341000
*  PROCHK = FOXONE;                                        /*@G51DGVS*/ 01342000
         MVI   PROCHK,C'1'                                         0533 01343000
*ELSE                                                              0534 01344000
*  PROCHK = FOXZERO;                                       /*@G51DGVS*/ 01345000
         B     @RC00532                                            0534 01346000
@RF00532 MVI   PROCHK,C'0'                                         0534 01347000
*CALL PRINTER(LINE17);                                     /*@G51DGVS*/ 01348000
@RC00532 LA    @01,@AL00535                                        0535 01349000
         BAL   @14,PRINTER                                         0535 01350000
*IF (WORK(1) & HEX08) = HEX08 THEN                                 0536 01351000
         MVC   @TS00001(1),WORK                                    0536 01352000
         NI    @TS00001,X'08'                                      0536 01353000
         CLI   @TS00001,X'08'                                      0536 01354000
         BNE   @RF00536                                            0536 01355000
*  CHANE = FOXONE;                                         /*@G51DGVS*/ 01356000
         MVI   CHANE,C'1'                                          0537 01357000
*ELSE                                                              0538 01358000
*  CHANE = FOXZERO;                                        /*@G51DGVS*/ 01359000
         B     @RC00536                                            0538 01360000
@RF00536 MVI   CHANE,C'0'                                          0538 01361000
*IF (WORK(2) & HEX08) = HEX08 THEN                                 0539 01362000
@RC00536 MVC   @TS00001(1),WORK+1                                  0539 01363000
         NI    @TS00001,X'08'                                      0539 01364000
         CLI   @TS00001,X'08'                                      0539 01365000
         BNE   @RF00539                                            0539 01366000
*  CHDCHK = FOXONE;                                        /*@G51DGVS*/ 01367000
         MVI   CHDCHK,C'1'                                         0540 01368000
*ELSE                                                              0541 01369000
*  CHDCHK = FOXZERO;                                       /*@G51DGVS*/ 01370000
         B     @RC00539                                            0541 01371000
@RF00539 MVI   CHDCHK,C'0'                                         0541 01372000
*CALL PRINTER(LINE18);                                     /*@G51DGVS*/ 01373000
@RC00539 LA    @01,@AL00542                                        0542 01374000
         BAL   @14,PRINTER                                         0542 01375000
*IF (WORK(1) & HEX04) = HEX04 THEN                                 0543 01376000
         MVC   @TS00001(1),WORK                                    0543 01377000
         NI    @TS00001,X'04'                                      0543 01378000
         CLI   @TS00001,X'04'                                      0543 01379000
         BNE   @RF00543                                            0543 01380000
*  DEVE = FOXONE;                                          /*@G51DGVS*/ 01381000
         MVI   DEVE,C'1'                                           0544 01382000
*ELSE                                                              0545 01383000
*  DEVE = FOXZERO;                                         /*@G51DGVS*/ 01384000
         B     @RC00543                                            0545 01385000
@RF00543 MVI   DEVE,C'0'                                           0545 01386000
*IF (WORK(2) & HEX04) = HEX04 THEN                                 0546 01387000
@RC00543 MVC   @TS00001(1),WORK+1                                  0546 01388000
         NI    @TS00001,X'04'                                      0546 01389000
         CLI   @TS00001,X'04'                                      0546 01390000
         BNE   @RF00546                                            0546 01391000
*  CHCCHK = FOXONE;                                        /*@G51DGVS*/ 01392000
         MVI   CHCCHK,C'1'                                         0547 01393000
*ELSE                                                              0548 01394000
*  CHCCHK = FOXZERO;                                       /*@G51DGVS*/ 01395000
         B     @RC00546                                            0548 01396000
@RF00546 MVI   CHCCHK,C'0'                                         0548 01397000
*CALL PRINTER(LINE19);                                     /*@G51DGVS*/ 01398000
@RC00546 LA    @01,@AL00549                                        0549 01399000
         BAL   @14,PRINTER                                         0549 01400000
*IF (WORK(1) & HEX02) = HEX02 THEN                                 0550 01401000
         MVC   @TS00001(1),WORK                                    0550 01402000
         NI    @TS00001,X'02'                                      0550 01403000
         CLI   @TS00001,X'02'                                      0550 01404000
         BNE   @RF00550                                            0550 01405000
*  UNCHK = FOXONE;                                         /*@G51DGVS*/ 01406000
         MVI   UNCHK,C'1'                                          0551 01407000
*ELSE                                                              0552 01408000
*  UNCHK = FOXZERO;                                        /*@G51DGVS*/ 01409000
         B     @RC00550                                            0552 01410000
@RF00550 MVI   UNCHK,C'0'                                          0552 01411000
*IF (WORK(2) & HEX02) = HEX02 THEN                                 0553 01412000
@RC00550 MVC   @TS00001(1),WORK+1                                  0553 01413000
         NI    @TS00001,X'02'                                      0553 01414000
         CLI   @TS00001,X'02'                                      0553 01415000
         BNE   @RF00553                                            0553 01416000
*  IFCCHK = FOXONE;                                        /*@G51DGVS*/ 01417000
         MVI   IFCCHK,C'1'                                         0554 01418000
*ELSE                                                              0555 01419000
*  IFCCHK = FOXZERO;                                       /*@G51DGVS*/ 01420000
         B     @RC00553                                            0555 01421000
@RF00553 MVI   IFCCHK,C'0'                                         0555 01422000
*CALL PRINTER(LINE20);                                     /*@G51DGVS*/ 01423000
@RC00553 LA    @01,@AL00556                                        0556 01424000
         BAL   @14,PRINTER                                         0556 01425000
*IF (WORK(1) & HEX01) = HEX01 THEN                                 0557 01426000
         MVC   @TS00001(1),WORK                                    0557 01427000
         NI    @TS00001,X'01'                                      0557 01428000
         CLI   @TS00001,X'01'                                      0557 01429000
         BNE   @RF00557                                            0557 01430000
*  UNEXC = FOXONE;                                         /*@G51DGVS*/ 01431000
         MVI   UNEXC,C'1'                                          0558 01432000
*ELSE                                                              0559 01433000
*  UNEXC = FOXZERO;                                        /*@G51DGVS*/ 01434000
         B     @RC00557                                            0559 01435000
@RF00557 MVI   UNEXC,C'0'                                          0559 01436000
*IF (WORK(2) & HEX01) = HEX01 THEN                                 0560 01437000
@RC00557 MVC   @TS00001(1),WORK+1                                  0560 01438000
         NI    @TS00001,X'01'                                      0560 01439000
         CLI   @TS00001,X'01'                                      0560 01440000
         BNE   @RF00560                                            0560 01441000
*  CHCHK = FOXONE;                                         /*@G51DGVS*/ 01442000
         MVI   CHCHK,C'1'                                          0561 01443000
*ELSE                                                              0562 01444000
*  CHCHK = FOXZERO;                                        /*@G51DGVS*/ 01445000
         B     @RC00560                                            0562 01446000
@RF00560 MVI   CHCHK,C'0'                                          0562 01447000
*CALL PRINTER(LINE21);                                     /*@G51DGVS*/ 01448000
@RC00560 LA    @01,@AL00563                                        0563 01449000
         BAL   @14,PRINTER                                         0563 01450000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01451000
         LA    @01,@AL00564                                        0564 01452000
         BAL   @14,PRINTER                                         0564 01453000
*CALL PRINTER(LINE22);                                     /*@G51DGVS*/ 01454000
         LA    @01,@AL00565                                        0565 01455000
         BAL   @14,PRINTER                                         0565 01456000
*CALL CONVERT(LRBCAIO,WORK,16);                            /*@G51DGVS*/ 01457000
         MVC   @AL00001+4(8),@AL00566                              0566 01458000
         LA    @04,LRBCAIO(,R7)                                    0566 01459000
         ST    @04,@AL00001                                        0566 01460000
         LA    @01,@AL00001                                        0566 01461000
         BAL   @14,CONVERT                                         0566 01462000
*SWITCH1 = OFF;                                            /*@G51DGVS*/ 01463000
         NI    SWITCH1,B'01111111'                                 0567 01464000
*DO I = 1 TO 8;       /* BLANK OUT OLD BUSY UNIT ADDRS IN    @XA22602*/ 01465000
         LA    @04,1                                               0568 01466000
         ST    @04,I                                               0568 01467000
@DL00568 DS    0H                                                  0569 01468000
*  IOUNITS(I) = IOUNITS0(I); /* PRINT LINE 23                @XA22602*/ 01469000
         LR    @03,@04                                             0569 01470000
         MH    @03,@CH00036                                        0569 01471000
         LA    @01,IOUNITS-5(@03)                                  0569 01472000
         LA    @15,IOUNITS0-5(@03)                                 0569 01473000
         MVC   0(5,@01),0(@15)                                     0569 01474000
*END;                        /*                              @XA22602*/ 01475000
         AL    @04,@CF00056                                        0570 01476000
         ST    @04,I                                               0570 01477000
         CH    @04,@CH00067                                        0570 01478000
         BNH   @DL00568                                            0570 01479000
*DO I = 1 TO 8 WHILE(SWITCH1 = OFF);  /* MOVE IN NEW BUSY    @G51DGVS*/ 01480000
         LA    @04,1                                               0571 01481000
         ST    @04,I                                               0571 01482000
@DL00571 TM    SWITCH1,B'10000000'                                 0571 01483000
         BNZ   @DC00571                                            0571 01484000
*  IF LRBCAIO(2*I-1:2*I) = HEXZERO(1:2) THEN /* UNIT ADDRS   @G51DGVS*/ 01485000
         ALR   @04,@04                                             0572 01486000
         ALR   @04,R7                                              0572 01487000
         CLC   LRBCAIO-2(2,@04),HEXZERO                            0572 01488000
         BNE   @RF00572                                            0572 01489000
*    SWITCH1 = ON;           /* TO PRINT LINE 23 OR ZEROS IF @G51DGVS*/ 01490000
         OI    SWITCH1,B'10000000'                                 0573 01491000
*  ELSE                      /* NO ADDRESS                   @G51DGVS*/ 01492000
*    IOUNIT(I) = WORK(4*I-3:4*I);                          /*@G51DGVS*/ 01493000
         B     @RC00572                                            0574 01494000
@RF00572 L     @04,I                                               0574 01495000
         LR    @03,@04                                             0574 01496000
         MH    @03,@CH00036                                        0574 01497000
         LA    @01,IOUNIT-5(@03)                                   0574 01498000
         SLA   @04,2                                               0574 01499000
         LA    @03,WORK-4(@04)                                     0574 01500000
         MVC   0(4,@01),0(@03)                                     0574 01501000
*END;                                                      /*@G51DGVS*/ 01502000
@RC00572 LA    @04,1                                               0575 01503000
         AL    @04,I                                               0575 01504000
         ST    @04,I                                               0575 01505000
         CH    @04,@CH00067                                        0575 01506000
         BNH   @DL00571                                            0575 01507000
@DC00571 DS    0H                                                  0576 01508000
*CALL PRINTER(LINE23);                                     /*@G51DGVS*/ 01509000
         LA    @01,@AL00576                                        0576 01510000
         BAL   @14,PRINTER                                         0576 01511000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01512000
         LA    @01,@AL00577                                        0577 01513000
         BAL   @14,PRINTER                                         0577 01514000
*CALL PRINTER(LINE24);                                     /*@G51DGVS*/ 01515000
         LA    @01,@AL00578                                        0578 01516000
         BAL   @14,PRINTER                                         0578 01517000
*IF LRBRINC = ON THEN                                              0579 01518000
         TM    LRBRINC(R7),B'01000000'                             0579 01519000
         BNO   @RF00579                                            0579 01520000
*  CALL PRINTER(LINE25);                                   /*@G51DGVS*/ 01521000
         LA    @01,@AL00580                                        0580 01522000
         BAL   @14,PRINTER                                         0580 01523000
*IF LRBSTERM = ON THEN                                             0581 01524000
@RF00579 TM    LRBSTERM(R7),B'00100000'                            0581 01525000
         BNO   @RF00581                                            0581 01526000
*  CALL PRINTER(LINE26);                                   /*@G51DGVS*/ 01527000
         LA    @01,@AL00582                                        0582 01528000
         BAL   @14,PRINTER                                         0582 01529000
*IF LRBUNSUP = ON THEN                                             0583 01530000
@RF00581 TM    LRBUNSUP(R7),B'00010000'                            0583 01531000
         BNO   @RF00583                                            0583 01532000
*  CALL PRINTER(LINE27);                                   /*@G51DGVS*/ 01533000
         LA    @01,@AL00584                                        0584 01534000
         BAL   @14,PRINTER                                         0584 01535000
*IF LRBNOCUA = ON THEN                                             0585 01536000
@RF00583 TM    LRBNOCUA(R7),B'00001000'                            0585 01537000
         BNO   @RF00585                                            0585 01538000
*  CALL PRINTER(LINE28);                                   /*@G51DGVS*/ 01539000
         LA    @01,@AL00586                                        0586 01540000
         BAL   @14,PRINTER                                         0586 01541000
*IF LRBOVER = ON THEN                                              0587 01542000
@RF00585 TM    LRBOVER(R7),B'00000100'                             0587 01543000
         BNO   @RF00587                                            0587 01544000
*  CALL PRINTER(LINE29);                                   /*@G51DGVS*/ 01545000
         LA    @01,@AL00588                                        0588 01546000
         BAL   @14,PRINTER                                         0588 01547000
*IF LRBERPIP = ON THEN                                             0589 01548000
@RF00587 TM    LRBERPIP(R7),B'00000010'                            0589 01549000
         BNO   @RF00589                                            0589 01550000
*  CALL PRINTER(LINE30);                                   /*@G51DGVS*/ 01551000
         LA    @01,@AL00590                                        0590 01552000
         BAL   @14,PRINTER                                         0590 01553000
*CALL PRINTER(BLINE);                                      /*@G51DGVS*/ 01554000
@RF00589 LA    @01,@AL00591                                        0591 01555000
         BAL   @14,PRINTER                                         0591 01556000
*CALL PRINTER(LINE31);                                     /*@G51DGVS*/ 01557000
         LA    @01,@AL00592                                        0592 01558000
         BAL   @14,PRINTER                                         0592 01559000
*IF LRBHTYPE ^= '21'X & (LRBCHCUA(1) & HEX10) = HEX10 THEN         0593 01560000
         CLI   LRBHTYPE(R7),X'21'                                  0593 01561000
         BE    @RF00593                                            0593 01562000
         MVC   @TS00001(1),LRBCHCUA(R7)                            0593 01563000
         NI    @TS00001,X'10'                                      0593 01564000
         CLI   @TS00001,X'10'                                      0593 01565000
         BNE   @RF00593                                            0593 01566000
*  DO;                                                     /*@G51DGVS*/ 01567000
*    CALL PRINTER(LINE32);                                 /*@G51DGVS*/ 01568000
         LA    @01,@AL00595                                        0595 01569000
         BAL   @14,PRINTER                                         0595 01570000
*    CALL PRINTER(LINE33A);                                /*@G51DGVS*/ 01571000
         LA    @01,@AL00596                                        0596 01572000
         BAL   @14,PRINTER                                         0596 01573000
*    IF (LRBCHCUA(1) & HEX08) = HEX08 THEN                         0597 01574000
         MVC   @TS00001(1),LRBCHCUA(R7)                            0597 01575000
         NI    @TS00001,X'08'                                      0597 01576000
         CLI   @TS00001,X'08'                                      0597 01577000
         BNE   @RF00597                                            0597 01578000
*      DO;                        /* ASSIGN THE CPU NUMBER   @G51DGVS*/ 01579000
*        CPUNO = '2';                                      /*@G51DGVS*/ 01580000
         MVI   CPUNO,C'2'                                          0599 01581000
*        CPUNO1 = '2';                                     /*@G51DGVS*/ 01582000
         MVI   CPUNO1,C'2'                                         0600 01583000
*      END;                                                /*@G51DGVS*/ 01584000
*    ELSE                                                          0602 01585000
*      DO;                                                 /*@G51DGVS*/ 01586000
         B     @RC00597                                            0602 01587000
@RF00597 DS    0H                                                  0603 01588000
*        CPUNO = FOXONE;                                   /*@G51DGVS*/ 01589000
         MVI   CPUNO,C'1'                                          0603 01590000
*        CPUNO1 = FOXONE;                                  /*@G51DGVS*/ 01591000
         MVI   CPUNO1,C'1'                                         0604 01592000
*      END;                                                /*@G51DGVS*/ 01593000
*    IF (LRBCHCUA(1) & HEX02) = HEX02 THEN                         0606 01594000
@RC00597 MVC   @TS00001(1),LRBCHCUA(R7)                            0606 01595000
         NI    @TS00001,X'02'                                      0606 01596000
         CLI   @TS00001,X'02'                                      0606 01597000
         BNE   @RF00606                                            0606 01598000
*      CPUSTAT = RECON;                                    /*@G51DGVS*/ 01599000
         MVI   CPUSTAT+20,C' '                                     0607 01600000
         MVC   CPUSTAT+21(15),CPUSTAT+20                           0607 01601000
         MVC   CPUSTAT(20),RECON                                   0607 01602000
*    ELSE                                                          0608 01603000
*      IF (LRBCHCUA(1) & HEX01) = HEX01 THEN                       0608 01604000
         B     @RC00606                                            0608 01605000
@RF00606 MVC   @TS00001(1),LRBCHCUA(R7)                            0608 01606000
         NI    @TS00001,X'01'                                      0608 01607000
         CLI   @TS00001,X'01'                                      0608 01608000
         BNE   @RF00608                                            0608 01609000
*        CPUSTAT = PART;                                   /*@G51DGVS*/ 01610000
         MVI   CPUSTAT+15,C' '                                     0609 01611000
         MVC   CPUSTAT+16(20),CPUSTAT+15                           0609 01612000
         MVC   CPUSTAT(15),PART                                    0609 01613000
*      ELSE                                                        0610 01614000
*        CPUSTAT = SHAR;                                   /*@G51DGVS*/ 01615000
         B     @RC00608                                            0610 01616000
@RF00608 MVI   CPUSTAT+15,C' '                                     0610 01617000
         MVC   CPUSTAT+16(20),CPUSTAT+15                           0610 01618000
         MVC   CPUSTAT(15),SHAR                                    0610 01619000
*    CALL PRINTER(LINE33);                                 /*@G51DGVS*/ 01620000
@RC00608 DS    0H                                                  0611 01621000
@RC00606 LA    @01,@AL00611                                        0611 01622000
         BAL   @14,PRINTER                                         0611 01623000
*    CALL PRINTER(LINE34);                                 /*@G51DGVS*/ 01624000
         LA    @01,@AL00612                                        0612 01625000
         BAL   @14,PRINTER                                         0612 01626000
*    CALL CHONOFF(3);                                      /*@G51DGVS*/ 01627000
         LA    @01,@AL00613                                        0613 01628000
         BAL   @14,CHONOFF                                         0613 01629000
*    CALL PRINTER(LINE35);                                 /*@G51DGVS*/ 01630000
         LA    @01,@AL00614                                        0614 01631000
         BAL   @14,PRINTER                                         0614 01632000
*    IF (LRBCHCUA(1) & HEX08) = HEX08 THEN                         0615 01633000
         MVC   @TS00001(1),LRBCHCUA(R7)                            0615 01634000
         NI    @TS00001,X'08'                                      0615 01635000
         CLI   @TS00001,X'08'                                      0615 01636000
         BNE   @RF00615                                            0615 01637000
*      CPUNO1 = FOXONE;                                    /*@G51DGVS*/ 01638000
         MVI   CPUNO1,C'1'                                         0616 01639000
*    ELSE                                                          0617 01640000
*      CPUNO1 = '2';                                       /*@G51DGVS*/ 01641000
         B     @RC00615                                            0617 01642000
@RF00615 MVI   CPUNO1,C'2'                                         0617 01643000
*    CALL CHONOFF(4);                                      /*@G51DGVS*/ 01644000
@RC00615 LA    @01,@AL00618                                        0618 01645000
         BAL   @14,CHONOFF                                         0618 01646000
*    CALL PRINTER(LINE31);                                 /*@G51DGVS*/ 01647000
         LA    @01,@AL00619                                        0619 01648000
         BAL   @14,PRINTER                                         0619 01649000
*  END;                                                    /*@G51DGVS*/ 01650000
*IF LRBCECSW = HEXZERO THEN                                        0621 01651000
@RF00593 CLC   LRBCECSW(4,R7),HEXZERO                              0621 01652000
         BNE   @RF00621                                            0621 01653000
*  CALL PRINTER(LINE36);                                   /*@G51DGVS*/ 01654000
         LA    @01,@AL00622                                        0622 01655000
         BAL   @14,PRINTER                                         0622 01656000
*ELSE                                                              0623 01657000
*  CALL VALERPIB;                                          /*@G51DGVS*/ 01658000
         B     @RC00621                                            0623 01659000
@RF00621 BAL   @14,VALERPIB                                        0623 01660000
*CALL PRINTER(LINE31);                                     /*@G51DGVS*/ 01661000
@RC00621 LA    @01,@AL00624                                        0624 01662000
         BAL   @14,PRINTER                                         0624 01663000
*IF (LRBCRCSW(6) & HEX0E) = HEXZERO(1) THEN                        0625 01664000
         MVC   @TS00001(1),LRBCRCSW+5(R7)                          0625 01665000
         NI    @TS00001,X'0E'                                      0625 01666000
         CLC   @TS00001(1),HEXZERO                                 0625 01667000
         BNE   @RF00625                                            0625 01668000
*  CALL PRINTER(LINE53);                                   /*@G51DGVS*/ 01669000
         LA    @01,@AL00626                                        0626 01670000
         BAL   @14,PRINTER                                         0626 01671000
*IF LRBHTYPE = '21'X THEN                                          0627 01672000
@RF00625 CLI   LRBHTYPE(R7),X'21'                                  0627 01673000
         BNE   @RF00627                                            0627 01674000
*  CALL OUTPUT;                                            /*@G51DGVS*/ 01675000
         BAL   @14,OUTPUT                                          0628 01676000
*RESPECIFY (R15) RESTRICTED;                               /*@G51DGVS*/ 01677000
@RF00627 DS    0H                                                  0630 01678000
*R15 = ZERO;                                               /*@G51DGVS*/ 01679000
         SLR   R15,R15                                             0630 01680000
*RETURN;                                                   /*@G51DGVS*/ 01681000
@EL00001 L     @13,4(,@13)                                         0631 01682000
@EF00001 DS    0H                                                  0631 01683000
@ER00001 L     @14,12(,@13)                                        0631 01684000
         LM    @00,@12,20(@13)                                     0631 01685000
         BR    @14                                                 0631 01686000
*RESPECIFY (R15) UNRESTRICTED;                             /*@G51DGVS*/ 01687000
*END                                                       /*@G51DGVS*/ 01688000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 01689000
*/*%INCLUDE SYSLIB  (COMTABLE)                                        * 01690000
*;                                                                 0633 01691000
@DATA    DS    0H                                                       01692000
         DS    0F                                                       01693000
@AL00216 EQU   *                       LIST WITH   1 ARGUMENT(S)        01694000
@AL00225 DC    A(@CF00075+2)           LIST WITH   1 ARGUMENT(S)        01695000
@AL00256 DC    A(LINE37)               LIST WITH   1 ARGUMENT(S)        01696000
@AL00257 EQU   *                       LIST WITH   1 ARGUMENT(S)        01697000
@AL00349 EQU   *                       LIST WITH   1 ARGUMENT(S)        01698000
@AL00352 EQU   *                       LIST WITH   1 ARGUMENT(S)        01699000
@AL00417 EQU   *                       LIST WITH   1 ARGUMENT(S)        01700000
@AL00419 EQU   *                       LIST WITH   1 ARGUMENT(S)        01701000
@AL00423 EQU   *                       LIST WITH   1 ARGUMENT(S)        01702000
@AL00428 EQU   *                       LIST WITH   1 ARGUMENT(S)        01703000
@AL00445 EQU   *                       LIST WITH   1 ARGUMENT(S)        01704000
@AL00449 EQU   *                       LIST WITH   1 ARGUMENT(S)        01705000
@AL00465 EQU   *                       LIST WITH   1 ARGUMENT(S)        01706000
@AL00467 EQU   *                       LIST WITH   1 ARGUMENT(S)        01707000
@AL00470 EQU   *                       LIST WITH   1 ARGUMENT(S)        01708000
@AL00481 EQU   *                       LIST WITH   1 ARGUMENT(S)        01709000
@AL00484 EQU   *                       LIST WITH   1 ARGUMENT(S)        01710000
@AL00487 EQU   *                       LIST WITH   1 ARGUMENT(S)        01711000
@AL00496 EQU   *                       LIST WITH   1 ARGUMENT(S)        01712000
@AL00505 EQU   *                       LIST WITH   1 ARGUMENT(S)        01713000
@AL00564 EQU   *                       LIST WITH   1 ARGUMENT(S)        01714000
@AL00577 EQU   *                       LIST WITH   1 ARGUMENT(S)        01715000
@AL00591 DC    A(BLINE)                LIST WITH   1 ARGUMENT(S)        01716000
@AL00265 DC    A(LINE38)               LIST WITH   1 ARGUMENT(S)        01717000
@AL00267 DC    A(LINE40)               LIST WITH   1 ARGUMENT(S)        01718000
@AL00278 DC    A(LINE39)               LIST WITH   1 ARGUMENT(S)        01719000
@AL00280 DC    A(LINE39A)              LIST WITH   1 ARGUMENT(S)        01720000
@AL00282 EQU   *                       LIST WITH   1 ARGUMENT(S)        01721000
@AL00296 DC    A(LINE41G)              LIST WITH   1 ARGUMENT(S)        01722000
@AL00285 DC    A(LINE41A)              LIST WITH   1 ARGUMENT(S)        01723000
@AL00287 DC    A(LINE41B)              LIST WITH   1 ARGUMENT(S)        01724000
@AL00289 DC    A(LINE41C)              LIST WITH   1 ARGUMENT(S)        01725000
@AL00291 DC    A(LINE41D)              LIST WITH   1 ARGUMENT(S)        01726000
@AL00293 DC    A(LINE41E)              LIST WITH   1 ARGUMENT(S)        01727000
@AL00295 DC    A(LINE41F)              LIST WITH   1 ARGUMENT(S)        01728000
@AL00298 DC    A(LINE42)               LIST WITH   1 ARGUMENT(S)        01729000
@AL00301 DC    A(LINE43)               LIST WITH   1 ARGUMENT(S)        01730000
@AL00304 DC    A(LINE45)               LIST WITH   1 ARGUMENT(S)        01731000
@AL00308 DC    A(LINE46)               LIST WITH   1 ARGUMENT(S)        01732000
@AL00312 DC    A(LINE47)               LIST WITH   1 ARGUMENT(S)        01733000
@AL00316 DC    A(LINE48)               LIST WITH   1 ARGUMENT(S)        01734000
@AL00320 DC    A(LINE49)               LIST WITH   1 ARGUMENT(S)        01735000
@AL00324 DC    A(LINE50)               LIST WITH   1 ARGUMENT(S)        01736000
@AL00331 DC    A(LINE51A)              LIST WITH   1 ARGUMENT(S)        01737000
@AL00332 DC    A(LINE51)               LIST WITH   1 ARGUMENT(S)        01738000
@AL00344 DC    A(LINE52)               LIST WITH   1 ARGUMENT(S)        01739000
@AL00346 DC    A(LINE44)               LIST WITH   1 ARGUMENT(S)        01740000
@AL00350 DC    A(FOOTS)                LIST WITH   2 ARGUMENT(S)        01741000
         DC    A(@CF00075)                                              01742000
@AL00351 DC    A(DLINE1)               LIST WITH   1 ARGUMENT(S)        01743000
@AL00356 DC    A(DLINE2)               LIST WITH   1 ARGUMENT(S)        01744000
@AL00360 DC    A(DLINE3)               LIST WITH   1 ARGUMENT(S)        01745000
@AL00364 DC    A(DLINE4)               LIST WITH   1 ARGUMENT(S)        01746000
@AL00368 DC    A(DLINE5)               LIST WITH   1 ARGUMENT(S)        01747000
@AL00372 DC    A(DLINE6)               LIST WITH   1 ARGUMENT(S)        01748000
@AL00376 DC    A(DLINE7)               LIST WITH   1 ARGUMENT(S)        01749000
@AL00380 DC    A(DLINE8)               LIST WITH   1 ARGUMENT(S)        01750000
@AL00384 DC    A(DLINE9)               LIST WITH   1 ARGUMENT(S)        01751000
@AL00388 DC    A(DLINE10)              LIST WITH   1 ARGUMENT(S)        01752000
@AL00392 DC    A(DLINE11)              LIST WITH   1 ARGUMENT(S)        01753000
@AL00396 DC    A(DLINE12)              LIST WITH   1 ARGUMENT(S)        01754000
@AL00400 DC    A(DLINE13)              LIST WITH   1 ARGUMENT(S)        01755000
@AL00404 DC    A(DLINE14)              LIST WITH   1 ARGUMENT(S)        01756000
@AL00408 DC    A(DLINE15)              LIST WITH   1 ARGUMENT(S)        01757000
@AL00412 DC    A(DLINE16)              LIST WITH   1 ARGUMENT(S)        01758000
@AL00416 DC    A(DLINE17)              LIST WITH   1 ARGUMENT(S)        01759000
@AL00418 DC    A(DLINE18)              LIST WITH   1 ARGUMENT(S)        01760000
@AL00422 DC    A(DLINE19)              LIST WITH   1 ARGUMENT(S)        01761000
@AL00427 DC    A(DLINE20)              LIST WITH   1 ARGUMENT(S)        01762000
@AL00430 DC    A(PROCADDR)             LIST WITH   2 ARGUMENT(S)        01763000
         DC    A(@CF00075)                                              01764000
@AL00439 DC    A(DLINE21)              LIST WITH   1 ARGUMENT(S)        01765000
@AL00446 DC    A(LMODEL)               LIST WITH   2 ARGUMENT(S)        01766000
         DC    A(@CF00075)                                              01767000
@AL00447 DC    A(SERIAL)               LIST WITH   2 ARGUMENT(S)        01768000
         DC    A(@CF00077)                                              01769000
@AL00448 DC    A(LINE1)                LIST WITH   1 ARGUMENT(S)        01770000
@AL00463 DC    A(I)                    LIST WITH   2 ARGUMENT(S)        01771000
         DC    A(REL)                                                   01772000
@AL00464 DC    A(LINE2)                LIST WITH   1 ARGUMENT(S)        01773000
@AL00466 DC    A(LINE3)                LIST WITH   1 ARGUMENT(S)        01774000
@AL00469 DC    A(LINE6B1)              LIST WITH   1 ARGUMENT(S)        01775000
@AL00471 DC    A(LINE7)                LIST WITH   1 ARGUMENT(S)        01776000
@AL00472 EQU   *                       LIST WITH   2 ARGUMENT(S)        01777000
@AL00475 DC    A(WORK)                 LIST WITH   2 ARGUMENT(S)        01778000
@AL00618 DC    A(@CF00065)             LIST WITH   1 ARGUMENT(S)        01779000
@AL00480 DC    A(LINE8)                LIST WITH   1 ARGUMENT(S)        01780000
@AL00482 DC    A(CCHCUA)               LIST WITH   2 ARGUMENT(S)        01781000
@AL00613 DC    A(@CF00077)             LIST WITH   1 ARGUMENT(S)        01782000
@AL00483 DC    A(LINE9)                LIST WITH   1 ARGUMENT(S)        01783000
@AL00485 DC    A(CUA184)               LIST WITH   2 ARGUMENT(S)        01784000
         DC    A(@CF00075)                                              01785000
@AL00486 DC    A(LINE10)               LIST WITH   1 ARGUMENT(S)        01786000
@AL00488 DC    A(LINE11A)              LIST WITH   1 ARGUMENT(S)        01787000
@AL00489 EQU   *                       LIST WITH   2 ARGUMENT(S)        01788000
@AL00498 DC    A(WORK)                 LIST WITH   2 ARGUMENT(S)        01789000
         DC    A(@CF00067)                                              01790000
@AL00495 DC    A(LINE11)               LIST WITH   1 ARGUMENT(S)        01791000
@AL00497 DC    A(LINE12A)              LIST WITH   1 ARGUMENT(S)        01792000
@AL00504 DC    A(LINE12)               LIST WITH   1 ARGUMENT(S)        01793000
@AL00506 DC    A(LINE13)               LIST WITH   1 ARGUMENT(S)        01794000
@AL00514 DC    A(LINE14)               LIST WITH   1 ARGUMENT(S)        01795000
@AL00521 DC    A(LINE15)               LIST WITH   1 ARGUMENT(S)        01796000
@AL00528 DC    A(LINE16)               LIST WITH   1 ARGUMENT(S)        01797000
@AL00535 DC    A(LINE17)               LIST WITH   1 ARGUMENT(S)        01798000
@AL00542 DC    A(LINE18)               LIST WITH   1 ARGUMENT(S)        01799000
@AL00549 DC    A(LINE19)               LIST WITH   1 ARGUMENT(S)        01800000
@AL00556 DC    A(LINE20)               LIST WITH   1 ARGUMENT(S)        01801000
@AL00563 DC    A(LINE21)               LIST WITH   1 ARGUMENT(S)        01802000
@AL00565 DC    A(LINE22)               LIST WITH   1 ARGUMENT(S)        01803000
@AL00566 DC    A(WORK)                 LIST WITH   2 ARGUMENT(S)        01804000
         DC    A(@CF00088)                                              01805000
@AL00576 DC    A(LINE23)               LIST WITH   1 ARGUMENT(S)        01806000
@AL00578 DC    A(LINE24)               LIST WITH   1 ARGUMENT(S)        01807000
@AL00580 DC    A(LINE25)               LIST WITH   1 ARGUMENT(S)        01808000
@AL00582 DC    A(LINE26)               LIST WITH   1 ARGUMENT(S)        01809000
@AL00584 DC    A(LINE27)               LIST WITH   1 ARGUMENT(S)        01810000
@AL00586 DC    A(LINE28)               LIST WITH   1 ARGUMENT(S)        01811000
@AL00588 DC    A(LINE29)               LIST WITH   1 ARGUMENT(S)        01812000
@AL00590 DC    A(LINE30)               LIST WITH   1 ARGUMENT(S)        01813000
@AL00592 EQU   *                       LIST WITH   1 ARGUMENT(S)        01814000
@AL00619 EQU   *                       LIST WITH   1 ARGUMENT(S)        01815000
@AL00624 DC    A(LINE31)               LIST WITH   1 ARGUMENT(S)        01816000
@AL00595 DC    A(LINE32)               LIST WITH   1 ARGUMENT(S)        01817000
@AL00596 DC    A(LINE33A)              LIST WITH   1 ARGUMENT(S)        01818000
@AL00611 DC    A(LINE33)               LIST WITH   1 ARGUMENT(S)        01819000
@AL00612 DC    A(LINE34)               LIST WITH   1 ARGUMENT(S)        01820000
@AL00614 DC    A(LINE35)               LIST WITH   1 ARGUMENT(S)        01821000
@AL00622 DC    A(LINE36)               LIST WITH   1 ARGUMENT(S)        01822000
@AL00626 DC    A(LINE53)               LIST WITH   1 ARGUMENT(S)        01823000
         DS    0F                                                       01824000
@SA00001 DS    18F                                                      01825000
@PC00002 DS    2F                                                       01826000
@PC00003 DS    3F                                                       01827000
@SA00004 DS    15F                                                      01828000
@PC00004 DS    1F                                                       01829000
@PC00005 DS    1F                                                       01830000
@SA00006 DS    15F                                                      01831000
@SA00007 DS    15F                                                      01832000
@SA00008 DS    15F                                                      01833000
@AL00001 DS    3A                                                       01834000
@ZTEMPS  DS    0F                                                       01835000
@ZT00002 DC    F'0'                                                     01836000
@ZT00003 DC    F'0'                                                     01837000
@ZTEMPND EQU   *                                                        01838000
@ZLEN    EQU   @ZTEMPND-@ZTEMPS                                         01839000
         DS    0F                                                       01840000
@CF00056 DC    F'1'                                                     01841000
@CF00075 DC    F'2'                                                     01842000
@CH00075 EQU   @CF00075+2                                               01843000
@CF00077 DC    F'3'                                                     01844000
@CH00077 EQU   @CF00077+2                                               01845000
@CF00065 DC    F'4'                                                     01846000
@CF00036 DC    F'5'                                                     01847000
@CH00036 EQU   @CF00036+2                                               01848000
@CF00067 DC    F'8'                                                     01849000
@CH00067 EQU   @CF00067+2                                               01850000
@CF00088 DC    F'16'                                                    01851000
@CH00088 EQU   @CF00088+2                                               01852000
         DS    0D                                                       01853000
MYLINCT  DS    F                                                        01854000
I        DS    F                                                        01855000
J        DS    F                                                        01856000
@TS00001 DS    CL1                                                      01857000
@CC01478 DC    C'VS 2'                                                  01858000
@CC01479 DC    C'VM  '                                                  01859000
@CC01480 DC    C'VS 1'                                                  01860000
@CC01481 DC    C'DOS '                                                  01861000
@CC01482 DC    C'OS  '                                                  01862000
EJECT    DC    CL134'0'                                                 01863000
         ORG   EJECT                                                    01864000
@NM00012 DS    CL1                                                      01865000
@NM00013 DC    X'89'                                                    01866000
         ORG   EJECT+134                                                01867000
BLINE    DC    CL134'0'                                                 01868000
         ORG   BLINE                                                    01869000
@NM00014 DS    CL1                                                      01870000
@NM00015 DC    X'09'                                                    01871000
         ORG   BLINE+134                                                01872000
LINE1    DC    CL134'0'                                                 01873000
         ORG   LINE1                                                    01874000
@NM00016 DS    CL1                                                      01875000
@NM00017 DC    X'09'                                                    01876000
@NM00018 DC    CL6'MODEL'                                               01877000
LMODEL   DS    CL4                                                      01878000
@NM00019 DS    CL24                                                     01879000
@NM00020 DC    CL12'SERIAL NO.'                                         01880000
SERIAL   DS    CL6                                                      01881000
         ORG   LINE1+134                                                01882000
LINE2    DC    CL134'0'                                                 01883000
         ORG   LINE2                                                    01884000
@NM00021 DS    CL1                                                      01885000
@NM00022 DC    X'09'                                                    01886000
SYS      DS    CL5                                                      01887000
@NM00023 DC    CL4'REL.'                                                01888000
REL      DS    CL2                                                      01889000
         ORG   LINE2+134                                                01890000
LINE3    DC    CL134'0'                                                 01891000
         ORG   LINE3                                                    01892000
@NM00024 DS    CL1                                                      01893000
@NM00025 DC    X'09'                                                    01894000
@NM00026 DC    CL36'--- RECORD SOURCE - CCH ---'                        01895000
@NM00027 DC    CL20'TYPE - INBOARD'                                     01896000
         ORG   LINE3+134                                                01897000
LINE6B1  DC    CL134'0'                                                 01898000
         ORG   LINE6B1                                                  01899000
@NM00028 DS    CL1                                                      01900000
@NM00029 DC    X'09'                                                    01901000
@NM00030 DC    CL20'JOB NAME'                                           01902000
JOBNAME  DS    CL8                                                      01903000
         ORG   LINE6B1+134                                              01904000
LINE7    DC    CL134'0'                                                 01905000
         ORG   LINE7                                                    01906000
@NM00031 DS    CL1                                                      01907000
@NM00032 DC    X'09'                                                    01908000
@NM00033 DC    CL7' '                                                   01909000
@NM00034 DC    CL40'DAY  YEAR'                                          01910000
@NM00035 DC    CL40'HH MM SS.TH'                                        01911000
         ORG   LINE7+134                                                01912000
LINE8    DC    CL134'0'                                                 01913000
         ORG   LINE8                                                    01914000
@NM00036 DS    CL1                                                      01915000
@NM00037 DC    X'09'                                                    01916000
@NM00038 DC    CL7'DATE _'                                              01917000
DAY      DS    CL6                                                      01918000
YEAR     DS    CL27                                                     01919000
@NM00039 DC    CL7'TIME _'                                              01920000
TIMEHH   DS    CL3                                                      01921000
TIMEMM   DS    CL3                                                      01922000
TIMESS   DS    CL3                                                      01923000
TIMETH   DS    CL2                                                      01924000
         ORG   LINE8+134                                                01925000
LINE9    DC    CL134'0'                                                 01926000
         ORG   LINE9                                                    01927000
@NM00040 DS    CL1                                                      01928000
@NM00041 DC    X'09'                                                    01929000
@NM00042 DC    CL22'CHANNEL/UNIT ADDRESS'                               01930000
CCHCUA   DS    CL6                                                      01931000
         ORG   LINE9+134                                                01932000
LINE10   DC    CL134'0'                                                 01933000
         ORG   LINE10                                                   01934000
@NM00043 DS    CL1                                                      01935000
@NM00044 DC    X'09'                                                    01936000
@NM00045 DC    CL27'ADDR.STORED IN LOC 184'                             01937000
CUA184   DS    CL4                                                      01938000
         ORG   LINE10+134                                               01939000
LINE11A  DC    CL134'0'                                                 01940000
         ORG   LINE11A                                                  01941000
@NM00046 DS    CL1                                                      01942000
@NM00047 DC    X'09'                                                    01943000
@NM00048 DS    CL13                                                     01944000
@NM00049 DC    CL30'CC   DA    FL     CT'                               01945000
         ORG   LINE11A+134                                              01946000
LINE11   DC    CL134'0'                                                 01947000
         ORG   LINE11                                                   01948000
@NM00050 DS    CL1                                                      01949000
@NM00051 DC    X'09'                                                    01950000
@NM00052 DC    CL13'FAILING CCW'                                        01951000
CCWCC    DS    CL2                                                      01952000
@NM00053 DS    CL1                                                      01953000
CCWDA    DS    CL6                                                      01954000
@NM00054 DS    CL2                                                      01955000
CCWFL    DS    CL2                                                      01956000
@NM00055 DS    CL1                                                      01957000
CCWXX    DS    CL2                                                      01958000
@NM00056 DS    CL1                                                      01959000
CCWCT    DS    CL4                                                      01960000
         ORG   LINE11+134                                               01961000
LINE12A  DC    CL134'0'                                                 01962000
         ORG   LINE12A                                                  01963000
@NM00057 DS    CL1                                                      01964000
@NM00058 DC    X'09'                                                    01965000
@NM00059 DS    CL13                                                     01966000
@NM00060 DC    CL30'K    CA    US CS  CT'                               01967000
         ORG   LINE12A+134                                              01968000
LINE12   DC    CL134'0'                                                 01969000
         ORG   LINE12                                                   01970000
@NM00061 DS    CL1                                                      01971000
@NM00062 DC    X'09'                                                    01972000
@NM00063 DC    CL13'CSW'                                                01973000
CSWCC    DS    CL2                                                      01974000
@NM00064 DS    CL1                                                      01975000
CSWDA    DS    CL6                                                      01976000
@NM00065 DS    CL2                                                      01977000
CSWFL    DS    CL2                                                      01978000
@NM00066 DS    CL1                                                      01979000
CSWXX    DS    CL2                                                      01980000
@NM00067 DS    CL1                                                      01981000
CSWCT    DS    CL4                                                      01982000
         ORG   LINE12+134                                               01983000
LINE13   DC    CL134'0'                                                 01984000
         ORG   LINE13                                                   01985000
@NM00068 DS    CL1                                                      01986000
@NM00069 DC    X'09'                                                    01987000
@NM00070 DC    CL39' UNIT STATUS'                                       01988000
@NM00071 DC    CL30'CHANNEL STATUS'                                     01989000
         ORG   LINE13+134                                               01990000
LINE14   DC    CL134'0'                                                 01991000
         ORG   LINE14                                                   01992000
@NM00072 DS    CL1                                                      01993000
@NM00073 DC    X'09'                                                    01994000
@NM00074 DC    CL20'  ATTENTION'                                        01995000
ATTEN    DS    CL1                                                      01996000
@NM00075 DS    CL19                                                     01997000
@NM00076 DC    CL18'PGM-CTLD IRPT'                                      01998000
PGMIRPT  DS    CL1                                                      01999000
         ORG   LINE14+134                                               02000000
LINE15   DC    CL134'0'                                                 02001000
         ORG   LINE15                                                   02002000
@NM00077 DS    CL1                                                      02003000
@NM00078 DC    X'09'                                                    02004000
@NM00079 DC    CL20'  STATUS MODIFIER'                                  02005000
STATM    DS    CL1                                                      02006000
@NM00080 DS    CL19                                                     02007000
@NM00081 DC    CL18'INCORRECT LENGTH'                                   02008000
INCLEN   DS    CL1                                                      02009000
         ORG   LINE15+134                                               02010000
LINE16   DC    CL134'0'                                                 02011000
         ORG   LINE16                                                   02012000
@NM00082 DS    CL1                                                      02013000
@NM00083 DC    X'09'                                                    02014000
@NM00084 DC    CL20'  CONTROL UNIT END'                                 02015000
CONUE    DS    CL1                                                      02016000
@NM00085 DS    CL19                                                     02017000
@NM00086 DC    CL18'PROGRAM CHECK'                                      02018000
PGMCHK   DS    CL1                                                      02019000
         ORG   LINE16+134                                               02020000
LINE17   DC    CL134'0'                                                 02021000
         ORG   LINE17                                                   02022000
@NM00087 DS    CL1                                                      02023000
@NM00088 DC    X'09'                                                    02024000
@NM00089 DC    CL20'  BUSY'                                             02025000
BUSY     DS    CL1                                                      02026000
@NM00090 DS    CL19                                                     02027000
@NM00091 DC    CL18'PROTECTION CHECK'                                   02028000
PROCHK   DS    CL1                                                      02029000
         ORG   LINE17+134                                               02030000
LINE18   DC    CL134'0'                                                 02031000
         ORG   LINE18                                                   02032000
@NM00092 DS    CL1                                                      02033000
@NM00093 DC    X'09'                                                    02034000
@NM00094 DC    CL20'  CHANNEL END'                                      02035000
CHANE    DS    CL1                                                      02036000
@NM00095 DS    CL19                                                     02037000
@NM00096 DC    CL18'CHAN DATA CHECK'                                    02038000
CHDCHK   DS    CL1                                                      02039000
         ORG   LINE18+134                                               02040000
LINE19   DC    CL134'0'                                                 02041000
         ORG   LINE19                                                   02042000
@NM00097 DS    CL1                                                      02043000
@NM00098 DC    X'09'                                                    02044000
@NM00099 DC    CL20'  DEVICE END'                                       02045000
DEVE     DS    CL1                                                      02046000
@NM00100 DS    CL19                                                     02047000
@NM00101 DC    CL18'CHAN CTRL CHECK'                                    02048000
CHCCHK   DS    CL1                                                      02049000
         ORG   LINE19+134                                               02050000
LINE20   DC    CL134'0'                                                 02051000
         ORG   LINE20                                                   02052000
@NM00102 DS    CL1                                                      02053000
@NM00103 DC    X'09'                                                    02054000
@NM00104 DC    CL20'  UNIT CHECK'                                       02055000
UNCHK    DS    CL1                                                      02056000
@NM00105 DS    CL19                                                     02057000
@NM00106 DC    CL18'I/F CTRL CHECK'                                     02058000
IFCCHK   DS    CL1                                                      02059000
         ORG   LINE20+134                                               02060000
LINE21   DC    CL134'0'                                                 02061000
         ORG   LINE21                                                   02062000
@NM00107 DS    CL1                                                      02063000
@NM00108 DC    X'09'                                                    02064000
@NM00109 DC    CL20'  UNIT EXCEPTION'                                   02065000
UNEXC    DS    CL1                                                      02066000
@NM00110 DS    CL19                                                     02067000
@NM00111 DC    CL18'CHAINING CHECK'                                     02068000
CHCHK    DS    CL1                                                      02069000
         ORG   LINE21+134                                               02070000
LINE22   DC    CL134'0'                                                 02071000
         ORG   LINE22                                                   02072000
@NM00112 DS    CL1                                                      02073000
@NM00113 DC    X'09'                                                    02074000
@NM00114 DC    CL40'I/O UNIT FOUND BUSY'                                02075000
         ORG   LINE22+134                                               02076000
LINE23   DC    CL134'0'                                                 02077000
         ORG   LINE23                                                   02078000
@NM00115 DS    CL1                                                      02079000
@NM00116 DC    X'09'                                                    02080000
@NM00117 DC    CL24' CHANNEL/UNIT ADDR'                                 02081000
IOUNITS  DS    CL5                                                      02082000
         ORG   IOUNITS+0                                                02083000
IOUNIT   DS    CL4                                                      02084000
@NM00118 DS    CL1                                                      02085000
         ORG   LINE23+66                                                02086000
IOUNITS0 DC    CL5'     '                                               02087000
         DS    7XL5                                                     02088000
         ORG   LINE23+134                                               02089000
LINE24   DC    CL134'0'                                                 02090000
         ORG   LINE24                                                   02091000
@NM00119 DS    CL1                                                      02092000
@NM00120 DC    X'09'                                                    02093000
@NM00121 DC    CL40'HEADER SENSE SWITCHES FOUND ON'                     02094000
         ORG   LINE24+134                                               02095000
LINE25   DC    CL134'0'                                                 02096000
         ORG   LINE25                                                   02097000
@NM00122 DS    CL1                                                      02098000
@NM00123 DC    X'09'                                                    02099000
@NM00124 DC    CL40' RECORD INCOMPLETE'                                 02100000
         ORG   LINE25+134                                               02101000
LINE26   DC    CL134'0'                                                 02102000
         ORG   LINE26                                                   02103000
@NM00125 DS    CL1                                                      02104000
@NM00126 DC    X'09'                                                    02105000
@NM00127 DC    CL40' SYSTEM TERMINATED'                                 02106000
         ORG   LINE26+134                                               02107000
LINE27   DC    CL134'0'                                                 02108000
         ORG   LINE27                                                   02109000
@NM00128 DS    CL1                                                      02110000
@NM00129 DC    X'09'                                                    02111000
@NM00130 DC    CL40' UNSUPPORTED CHANNEL'                               02112000
         ORG   LINE27+134                                               02113000
LINE28   DC    CL134'0'                                                 02114000
         ORG   LINE28                                                   02115000
@NM00131 DS    CL1                                                      02116000
@NM00132 DC    X'09'                                                    02117000
@NM00133 DC    CL40' CUA ILLEGAL'                                       02118000
         ORG   LINE28+134                                               02119000
LINE29   DC    CL134'0'                                                 02120000
         ORG   LINE29                                                   02121000
@NM00134 DS    CL1                                                      02122000
@NM00135 DC    X'09'                                                    02123000
@NM00136 DC    CL50' PORTION OF RECORD HAS BEEN DESTROYED'              02124000
         ORG   LINE29+134                                               02125000
LINE30   DC    CL134'0'                                                 02126000
         ORG   LINE30                                                   02127000
@NM00137 DS    CL1                                                      02128000
@NM00138 DC    X'09'                                                    02129000
@NM00139 DC    CL40' ERP WERE IN PROGRESS'                              02130000
         ORG   LINE30+134                                               02131000
LINE31   DC    CL134'0'                                                 02132000
         ORG   LINE31                                                   02133000
@NM00140 DS    CL1                                                      02134000
@NM00141 DC    X'09'                                                    02135000
@NM00142 DC    80CL1'*'                                                 02136000
         ORG   LINE31+134                                               02137000
LINE32   DC    CL134'0'                                                 02138000
         ORG   LINE32                                                   02139000
@NM00143 DS    CL1                                                      02140000
@NM00144 DC    X'09'                                                    02141000
@NM00145 DS    CL23                                                     02142000
@NM00146 DC    CL40'MULTI-SYSTEM INFORMATION'                           02143000
         ORG   LINE32+134                                               02144000
LINE33A  DC    CL134'0'                                                 02145000
         ORG   LINE33A                                                  02146000
@NM00147 DS    CL1                                                      02147000
@NM00148 DC    X'09'                                                    02148000
@NM00149 DC    CL79'*'                                                  02149000
@NM00150 DC    CL1'*'                                                   02150000
         ORG   LINE33A+134                                              02151000
LINE33   DC    CL134'0'                                                 02152000
         ORG   LINE33                                                   02153000
@NM00151 DS    CL1                                                      02154000
@NM00152 DC    X'09'                                                    02155000
@NM00153 DS    CL9                                                      02156000
@NM00154 DC    CL4'CPU'                                                 02157000
CPUNO    DS    CL1                                                      02158000
@NM00155 DC    CL15' FAILED'                                            02159000
@NM00156 DC    CL15'CPU STATUS WAS'                                     02160000
CPUSTAT  DS    CL36                                                     02161000
         ORG   LINE33+134                                               02162000
LINE34   DC    CL134'0'                                                 02163000
         ORG   LINE34                                                   02164000
@NM00157 DS    CL1                                                      02165000
@NM00158 DC    X'09'                                                    02166000
@NM00159 DS    CL9                                                      02167000
@NM00160 DC    CL4'CPU'                                                 02168000
CPUNO1   DS    CL1                                                      02169000
@NM00161 DC    CL65' CHANNEL CONFIGURATION'                             02170000
         ORG   LINE34+134                                               02171000
LINE35   DC    CL134'0'                                                 02172000
         ORG   LINE35                                                   02173000
@NM00162 DS    CL1                                                      02174000
@NM00163 DC    X'09'                                                    02175000
@NM00164 DS    CL9                                                      02176000
@NM00165 DC    CL4'CH0-'                                                02177000
CHAN0    DS    CL3                                                      02178000
@NM00166 DS    CL1                                                      02179000
@NM00167 DC    CL4'CH1-'                                                02180000
CHAN1    DS    CL3                                                      02181000
@NM00168 DS    CL1                                                      02182000
@NM00169 DC    CL4'CH2-'                                                02183000
CHAN2    DS    CL3                                                      02184000
@NM00170 DS    CL1                                                      02185000
@NM00171 DC    CL4'CH3-'                                                02186000
CHAN3    DS    CL3                                                      02187000
@NM00172 DS    CL1                                                      02188000
@NM00173 DC    CL4'CH4-'                                                02189000
CHAN4    DS    CL3                                                      02190000
@NM00174 DS    CL1                                                      02191000
@NM00175 DC    CL4'CH5-'                                                02192000
CHAN5    DS    CL3                                                      02193000
@NM00176 DS    CL1                                                      02194000
@NM00177 DC    CL4'CH6-'                                                02195000
CHAN6    DS    CL3                                                      02196000
         ORG   LINE35+134                                               02197000
LINE36   DC    CL134'0'                                                 02198000
         ORG   LINE36                                                   02199000
@NM00178 DS    CL1                                                      02200000
@NM00179 DC    X'09'                                                    02201000
@NM00180 DC    CL9' '                                                   02202000
@NM00181 DC    CL30'ERPIB NOT CREATED'                                  02203000
         ORG   LINE36+134                                               02204000
LINE37   DC    CL134'0'                                                 02205000
         ORG   LINE37                                                   02206000
@NM00182 DS    CL1                                                      02207000
@NM00183 DC    X'09'                                                    02208000
@NM00184 DS    CL27                                                     02209000
@NM00185 DC    CL40'CHANNEL  ERROR  ANALYSIS'                           02210000
         ORG   LINE37+134                                               02211000
LINE38   DC    CL134'0'                                                 02212000
         ORG   LINE38                                                   02213000
@NM00186 DS    CL1                                                      02214000
@NM00187 DC    X'09'                                                    02215000
@NM00188 DC    CL2' '                                                   02216000
@NM00189 DC    CL15'CSW STORED BY'                                      02217000
CSWSTO   DS    CL10                                                     02218000
         ORG   LINE38+134                                               02219000
LINE39   DC    CL134'0'                                                 02220000
         ORG   LINE39                                                   02221000
@NM00190 DS    CL1                                                      02222000
@NM00191 DC    X'09'                                                    02223000
@NM00192 DC    CL2' '                                                   02224000
@NM00193 DC    CL19'TERMINATION BY --'                                  02225000
TERMBY   DS    CL30                                                     02226000
         ORG   LINE39+134                                               02227000
LINE39A  DC    CL134'0'                                                 02228000
         ORG   LINE39A                                                  02229000
@NM00194 DS    CL1                                                      02230000
@NM00195 DC    X'09'                                                    02231000
@NM00196 DC    CL2' '                                                   02232000
@NM00197 DC    CL40'I/O INTERFACE INOPERATIVE'                          02233000
         ORG   LINE39A+134                                              02234000
LINE40   DC    CL134'0'                                                 02235000
         ORG   LINE40                                                   02236000
@NM00198 DS    CL1                                                      02237000
@NM00199 DC    X'09'                                                    02238000
@NM00200 DC    CL2' '                                                   02239000
@NM00201 DC    CL50'NO ADDITIONAL ERROR INFORMATION AVAILABLE.'         02240000
         ORG   LINE40+134                                               02241000
LINE41A  DC    CL134'0'                                                 02242000
         ORG   LINE41A                                                  02243000
@NM00202 DS    CL1                                                      02244000
@NM00203 DC    X'09'                                                    02245000
@NM00204 DC    CL2' '                                                   02246000
@NM00205 DC    CL30'TIME CHANNEL DETECTED ERROR -'                      02247000
@NM00206 DC    CL30'WHILE EXECUTING TIO'                                02248000
         ORG   LINE41A+134                                              02249000
LINE41B  DC    CL134'0'                                                 02250000
         ORG   LINE41B                                                  02251000
@NM00207 DS    CL1                                                      02252000
@NM00208 DC    X'09'                                                    02253000
@NM00209 DC    CL2' '                                                   02254000
@NM00210 DC    CL30'TIME CHANNEL DETECTED ERROR -'                      02255000
@NM00211 DC    CL50'BETWEEN COMMAND OUT AND UNIT STATUS RETURN'         02256000
         ORG   LINE41B+134                                              02257000
LINE41C  DC    CL134'0'                                                 02258000
         ORG   LINE41C                                                  02259000
@NM00212 DS    CL1                                                      02260000
@NM00213 DC    X'09'                                                    02261000
@NM00214 DC    CL2' '                                                   02262000
@NM00215 DC    CL30'TIME CHANNEL DETECTED ERROR -'                      02263000
@NM00216 DC    CL50'COMMAND ACCEPTED BUT BEFORE DATA TRANSFER'          02264000
         ORG   LINE41C+134                                              02265000
LINE41D  DC    CL134'0'                                                 02266000
         ORG   LINE41D                                                  02267000
@NM00217 DS    CL1                                                      02268000
@NM00218 DC    X'09'                                                    02269000
@NM00219 DC    CL2' '                                                   02270000
@NM00220 DC    CL30'TIME CHANNEL DETECTED ERROR -'                      02271000
@NM00221 DC    CL50'SOME DATA TRANSFER - CSW COMMAND ADR UPDATED'       02272000
         ORG   LINE41D+134                                              02273000
LINE41E  DC    CL134'0'                                                 02274000
         ORG   LINE41E                                                  02275000
@NM00222 DS    CL1                                                      02276000
@NM00223 DC    X'09'                                                    02277000
@NM00224 DC    CL2' '                                                   02278000
@NM00225 DC    CL30'TIME CHANNEL DETECTED ERROR -'                      02279000
@NM00226 DC    CL50'COMMAND REJECTED OR COMMAND OUT NOT SENT'           02280000
         ORG   LINE41E+134                                              02281000
LINE41F  DC    CL134'0'                                                 02282000
         ORG   LINE41F                                                  02283000
@NM00227 DS    CL1                                                      02284000
@NM00228 DC    X'09'                                                    02285000
@NM00229 DC    CL2' '                                                   02286000
@NM00230 DC    CL30'TIME CHANNEL DETECTED ERROR -'                      02287000
@NM00231 DC    CL50'COMMAND ACCEPTED - DATA TRANSFER UNDETERMINED'      02288000
         ORG   LINE41F+134                                              02289000
LINE41G  DC    CL134'0'                                                 02290000
         ORG   LINE41G                                                  02291000
@NM00232 DS    CL1                                                      02292000
@NM00233 DC    X'09'                                                    02293000
@NM00234 DC    CL2' '                                                   02294000
@NM00235 DC    CL30'TIME CHANNEL DETECTED ERROR -'                      02295000
@NM00236 DC    CL50'COULD NOT BE ASSESSED'                              02296000
         ORG   LINE41G+134                                              02297000
LINE42   DC    CL134'0'                                                 02298000
         ORG   LINE42                                                   02299000
@NM00237 DS    CL1                                                      02300000
@NM00238 DC    X'09'                                                    02301000
@NM00239 DS    CL33                                                     02302000
@NM00240 DC    CL11'RETRY CODE'                                         02303000
RCODE    DS    CL1                                                      02304000
         ORG   LINE42+134                                               02305000
LINE43   DC    CL134'0'                                                 02306000
         ORG   LINE43                                                   02307000
@NM00241 DS    CL1                                                      02308000
@NM00242 DC    X'09'                                                    02309000
@NM00243 DS    CL2                                                      02310000
@NM00244 DC    CL40'DISCONNECT IN ISSUED'                               02311000
         ORG   LINE43+134                                               02312000
LINE44   DC    CL134'0'                                                 02313000
         ORG   LINE44                                                   02314000
@NM00245 DS    CL1                                                      02315000
@NM00246 DC    X'09'                                                    02316000
@NM00247 DS    CL2                                                      02317000
@NM00248 DC    CL40'PROGRAM ASSESSED NO RETRY'                          02318000
         ORG   LINE44+134                                               02319000
LINE45   DC    CL134'0'                                                 02320000
         ORG   LINE45                                                   02321000
@NM00249 DS    CL1                                                      02322000
@NM00250 DC    X'09'                                                    02323000
@NM00251 DS    CL2                                                      02324000
@NM00252 DC    CL40'VALIDITY OF RECORDED DATA'                          02325000
         ORG   LINE45+134                                               02326000
LINE46   DC    CL134'0'                                                 02327000
         ORG   LINE46                                                   02328000
@NM00253 DS    CL1                                                      02329000
@NM00254 DC    X'09'                                                    02330000
@NM00255 DS    CL9                                                      02331000
@NM00256 DC    CL30'COUNT'                                              02332000
@NM00257 DC    CL2'='                                                   02333000
CVAL     DS    CL10                                                     02334000
         ORG   LINE46+134                                               02335000
LINE47   DC    CL134'0'                                                 02336000
         ORG   LINE47                                                   02337000
@NM00258 DS    CL1                                                      02338000
@NM00259 DC    X'09'                                                    02339000
@NM00260 DS    CL9                                                      02340000
@NM00261 DC    CL30'SENSE DATA'                                         02341000
@NM00262 DC    CL2'='                                                   02342000
SVAL     DS    CL10                                                     02343000
         ORG   LINE47+134                                               02344000
LINE48   DC    CL134'0'                                                 02345000
         ORG   LINE48                                                   02346000
@NM00263 DS    CL1                                                      02347000
@NM00264 DC    X'09'                                                    02348000
@NM00265 DS    CL9                                                      02349000
@NM00266 DC    CL30'UNIT STATUS'                                        02350000
@NM00267 DC    CL2'='                                                   02351000
UVAL     DS    CL10                                                     02352000
         ORG   LINE48+134                                               02353000
LINE49   DC    CL134'0'                                                 02354000
         ORG   LINE49                                                   02355000
@NM00268 DS    CL1                                                      02356000
@NM00269 DC    X'09'                                                    02357000
@NM00270 DS    CL9                                                      02358000
@NM00271 DC    CL30'COMMAND DATA'                                       02359000
@NM00272 DC    CL2'='                                                   02360000
CAVAL    DS    CL10                                                     02361000
         ORG   LINE49+134                                               02362000
LINE50   DC    CL134'0'                                                 02363000
         ORG   LINE50                                                   02364000
@NM00273 DS    CL1                                                      02365000
@NM00274 DC    X'09'                                                    02366000
@NM00275 DS    CL9                                                      02367000
@NM00276 DC    CL30'CHANNEL ADDRESS'                                    02368000
@NM00277 DC    CL2'='                                                   02369000
CHVAL    DS    CL10                                                     02370000
         ORG   LINE50+134                                               02371000
LINE51   DC    CL134'0'                                                 02372000
         ORG   LINE51                                                   02373000
@NM00278 DS    CL1                                                      02374000
@NM00279 DC    X'09'                                                    02375000
@NM00280 DS    CL9                                                      02376000
@NM00281 DC    CL30'DEVICE ADDRESS'                                     02377000
@NM00282 DC    CL2'='                                                   02378000
DVAL     DS    CL10                                                     02379000
         ORG   LINE51+134                                               02380000
LINE51A  DC    CL134'0'                                                 02381000
         ORG   LINE51A                                                  02382000
@NM00283 DS    CL1                                                      02383000
@NM00284 DC    X'09'                                                    02384000
@NM00285 DS    CL9                                                      02385000
@NM00286 DC    CL30'LOGOUT'                                             02386000
@NM00287 DC    CL2'='                                                   02387000
LVAL     DS    CL10                                                     02388000
         ORG   LINE51A+134                                              02389000
LINE52   DC    CL134'0'                                                 02390000
         ORG   LINE52                                                   02391000
@NM00288 DS    CL1                                                      02392000
@NM00289 DC    X'09'                                                    02393000
@NM00290 DS    CL2                                                      02394000
@NM00291 DC    CL27'PROBABLE SOURCE OF ERROR -'                         02395000
PERROR   DS    CL22                                                     02396000
         ORG   LINE52+134                                               02397000
LINE53   DC    CL134'0'                                                 02398000
         ORG   LINE53                                                   02399000
@NM00292 DS    CL1                                                      02400000
@NM00293 DC    X'09'                                                    02401000
@NM00294 DS    CL2                                                      02402000
@NM00295 DC    CL30'CHANNEL CTRL OR I/F CTRL CHECK'                     02403000
@NM00296 DC    CL30' NOT INDICATED IN CSW - NO LOG'                     02404000
@NM00297 DC    CL30'OUT WITH THIS RECORD.'                              02405000
         ORG   LINE53+134                                               02406000
DLINE1   DC    CL134'0'                                                 02407000
         ORG   DLINE1                                                   02408000
@NM00298 DS    CL1                                                      02409000
@NM00299 DC    X'09'                                                    02410000
@NM00300 DC    CL27'CCH FOOTPRINTS'                                     02411000
FOOTS    DS    CL4                                                      02412000
         ORG   DLINE1+134                                               02413000
DLINE2   DC    CL134'0'                                                 02414000
         ORG   DLINE2                                                   02415000
@NM00301 DS    CL1                                                      02416000
@NM00302 DC    X'09'                                                    02417000
@NM00303 DS    CL19                                                     02418000
@NM00304 DC    CL30'IOS GPRS SAVED'                                     02419000
IOS      DS    CL1                                                      02420000
         ORG   DLINE2+134                                               02421000
DLINE3   DC    CL134'0'                                                 02422000
         ORG   DLINE3                                                   02423000
@NM00305 DS    CL1                                                      02424000
@NM00306 DC    X'09'                                                    02425000
@NM00307 DS    CL19                                                     02426000
@NM00308 DC    CL30'UCB ADDRESS ZERO'                                   02427000
UCB      DS    CL1                                                      02428000
         ORG   DLINE3+134                                               02429000
DLINE4   DC    CL134'0'                                                 02430000
         ORG   DLINE4                                                   02431000
@NM00309 DS    CL1                                                      02432000
@NM00310 DC    X'09'                                                    02433000
@NM00311 DS    CL19                                                     02434000
@NM00312 DC    CL30'ERPIB EXISTS'                                       02435000
ERPIB    DS    CL1                                                      02436000
         ORG   DLINE4+134                                               02437000
DLINE5   DC    CL134'0'                                                 02438000
         ORG   DLINE5                                                   02439000
@NM00313 DS    CL1                                                      02440000
@NM00314 DC    X'09'                                                    02441000
@NM00315 DS    CL19                                                     02442000
@NM00316 DC    CL30'IGFCCHSI ENTERED'                                   02443000
IGFCCHSI DS    CL1                                                      02444000
         ORG   DLINE5+134                                               02445000
DLINE6   DC    CL134'0'                                                 02446000
         ORG   DLINE6                                                   02447000
@NM00317 DS    CL1                                                      02448000
@NM00318 DC    X'09'                                                    02449000
@NM00319 DS    CL19                                                     02450000
@NM00320 DC    CL30'IGFCCHII ENTERED'                                   02451000
IGFCCHII DS    CL1                                                      02452000
         ORG   DLINE6+134                                               02453000
DLINE7   DC    CL134'0'                                                 02454000
         ORG   DLINE7                                                   02455000
@NM00321 DS    CL1                                                      02456000
@NM00322 DC    X'09'                                                    02457000
@NM00323 DS    CL19                                                     02458000
@NM00324 DC    CL30'IGFCCHFE ENTERED'                                   02459000
IGFCCHFE DS    CL1                                                      02460000
         ORG   DLINE7+134                                               02461000
DLINE8   DC    CL134'0'                                                 02462000
         ORG   DLINE8                                                   02463000
@NM00325 DS    CL1                                                      02464000
@NM00326 DC    X'09'                                                    02465000
@NM00327 DS    CL19                                                     02466000
@NM00328 DC    CL30'IGFC60 ENTERED'                                     02467000
IGFC60   DS    CL1                                                      02468000
         ORG   DLINE8+134                                               02469000
DLINE9   DC    CL134'0'                                                 02470000
         ORG   DLINE9                                                   02471000
@NM00329 DS    CL1                                                      02472000
@NM00330 DC    X'09'                                                    02473000
@NM00331 DS    CL19                                                     02474000
@NM00332 DC    CL30'IGFC70 ENTERED'                                     02475000
IGFC70   DS    CL1                                                      02476000
         ORG   DLINE9+134                                               02477000
DLINE10  DC    CL134'0'                                                 02478000
         ORG   DLINE10                                                  02479000
@NM00333 DS    CL1                                                      02480000
@NM00334 DC    X'09'                                                    02481000
@NM00335 DS    CL19                                                     02482000
@NM00336 DC    CL30'IGFC80 ENTERED'                                     02483000
IGFC80   DS    CL1                                                      02484000
         ORG   DLINE10+134                                              02485000
DLINE11  DC    CL134'0'                                                 02486000
         ORG   DLINE11                                                  02487000
@NM00337 DS    CL1                                                      02488000
@NM00338 DC    X'09'                                                    02489000
@NM00339 DS    CL19                                                     02490000
@NM00340 DC    CL30'IGFCIC ENTERED'                                     02491000
IGFCIC   DS    CL1                                                      02492000
         ORG   DLINE11+134                                              02493000
DLINE12  DC    CL134'0'                                                 02494000
         ORG   DLINE12                                                  02495000
@NM00341 DS    CL1                                                      02496000
@NM00342 DC    X'09'                                                    02497000
@NM00343 DS    CL19                                                     02498000
@NM00344 DC    CL30'IGFCCHRD ENTERED'                                   02499000
IGFCCHRD DS    CL1                                                      02500000
         ORG   DLINE12+134                                              02501000
DLINE13  DC    CL134'0'                                                 02502000
         ORG   DLINE13                                                  02503000
@NM00345 DS    CL1                                                      02504000
@NM00346 DC    X'09'                                                    02505000
@NM00347 DS    CL19                                                     02506000
@NM00348 DC    CL30'IGFCCHMP ENTERED'                                   02507000
IGFCCHMP DS    CL1                                                      02508000
         ORG   DLINE13+134                                              02509000
DLINE14  DC    CL134'0'                                                 02510000
         ORG   DLINE14                                                  02511000
@NM00349 DS    CL1                                                      02512000
@NM00350 DC    X'09'                                                    02513000
@NM00351 DS    CL19                                                     02514000
@NM00352 DC    CL30'IGFCCHUC ENTERED'                                   02515000
IGFCCHUC DS    CL1                                                      02516000
         ORG   DLINE14+134                                              02517000
DLINE15  DC    CL134'0'                                                 02518000
         ORG   DLINE15                                                  02519000
@NM00353 DS    CL1                                                      02520000
@NM00354 DC    X'09'                                                    02521000
@NM00355 DS    CL19                                                     02522000
@NM00356 DC    CL30'IGFCCHAS ENTERED'                                   02523000
IGFCCHAS DS    CL1                                                      02524000
         ORG   DLINE15+134                                              02525000
DLINE16  DC    CL134'0'                                                 02526000
         ORG   DLINE16                                                  02527000
@NM00357 DS    CL1                                                      02528000
@NM00358 DC    X'09'                                                    02529000
@NM00359 DS    CL19                                                     02530000
@NM00360 DC    CL30'IGFCCHIO ENTERED'                                   02531000
IGFCCHIO DS    CL1                                                      02532000
         ORG   DLINE16+134                                              02533000
DLINE17  DC    CL134'0'                                                 02534000
         ORG   DLINE17                                                  02535000
@NM00361 DS    CL1                                                      02536000
@NM00362 DC    X'09'                                                    02537000
@NM00363 DS    CL19                                                     02538000
@NM00364 DC    CL30'IGFCCHEX ENTERED'                                   02539000
IGFCCHEX DS    CL1                                                      02540000
         ORG   DLINE17+134                                              02541000
DLINE18  DC    CL134'0'                                                 02542000
         ORG   DLINE18                                                  02543000
@NM00365 DS    CL1                                                      02544000
@NM00366 DC    X'09'                                                    02545000
@NM00367 DS    CL29                                                     02546000
@NM00368 DC    CL30'MULTIPROCESSING INFORMATION'                        02547000
         ORG   DLINE18+134                                              02548000
DLINE19  DC    CL134'0'                                                 02549000
         ORG   DLINE19                                                  02550000
@NM00369 DS    CL1                                                      02551000
@NM00370 DC    X'09'                                                    02552000
@NM00371 DS    CL31                                                     02553000
@NM00372 DC    CL50'CHANNEL RECONFIGURATION HARDWARE IS ACTIVE'         02554000
         ORG   DLINE19+134                                              02555000
DLINE20  DC    CL134'0'                                                 02556000
         ORG   DLINE20                                                  02557000
@NM00373 DS    CL1                                                      02558000
@NM00374 DC    X'09'                                                    02559000
@NM00375 DS    CL48                                                     02560000
@NM00376 DC    CL60'0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15'     02561000
         ORG   DLINE20+134                                              02562000
DLINE21  DC    CL134'0'                                                 02563000
         ORG   DLINE21                                                  02564000
@NM00377 DS    CL1                                                      02565000
@NM00378 DC    X'09'                                                    02566000
@NM00379 DS    CL2                                                      02567000
@NM00380 DC    CL21'PROCESSOR ADDRESS'                                  02568000
PROCADDR DS    CL4                                                      02569000
@NM00381 DS    CL1                                                      02570000
@NM00382 DC    CL18'CHANNELS ON LINE'                                   02571000
@NM00383 DS    CL3                                                      02572000
         ORG   @NM00383+0                                               02573000
@NM00384 DS    CL2                                                      02574000
CHANON   DS    CL1                                                      02575000
         ORG   DLINE21+134                                              02576000
WORK     DS    CL50                                                     02577000
         DS    CL7                                                      02578000
DBLWORD  DS    CL8                                                      02579000
SWITCH1  DS    BL1                                                      02580000
PART     DC    CL15'PARTITIONED'                                        02581000
SHAR     DC    CL15'SHARED'                                             02582000
RECON    DC    CL20'BUT RECONFIGURED OUT'                               02583000
CHON     DC    CL3'-ON'                                                 02584000
CHOFF    DC    CL3'OFF'                                                 02585000
CSWINT   DC    CL10'INTERRUPT'                                          02586000
CSWHIO   DC    CL10'--HIO'                                              02587000
CSWTIO   DC    CL10'--TIO'                                              02588000
CSWSIO   DC    CL10'--SIO'                                              02589000
TERM0    DC    CL30'INTERFACE DISCONNECT- CODE 0'                       02590000
TERM1    DC    CL30'FORCED ENDING SEQUENCE- CODE 1'                     02591000
TERM2    DC    CL30'SELECTIVE RESET- CODE 2'                            02592000
TERM3    DC    CL30'SYSTEM RESET- CODE 3'                               02593000
VALID    DC    CL10'VALID'                                              02594000
NVALID   DC    CL10'NOT VALID'                                          02595000
STORED   DC    CL10'STORED'                                             02596000
NSTORED  DC    CL10'NOT STORED'                                         02597000
NOASSD   DC    CL27'COULD NOT BE ASSESSED'                              02598000
ERRCPU   DC    CL27'CPU'                                                02599000
ERRCHN   DC    CL27'CHANNEL'                                            02600000
ERRSCU   DC    CL27'STORAGE CONTROL UNIT'                               02601000
ERRSTO   DC    CL27'STORAGE'                                            02602000
ERRCU    DC    CL27'CONTROL UNIT'                                       02603000
HEXZERO  DC    X'00000000'                                              02604000
SUPERZAP DC    3CL10'SUPERZAP'                                          02605000
CHARS    DC    CL1'0'                                                   02606000
         DC    CL1'1'                                                   02607000
         DC    CL1'2'                                                   02608000
         DC    CL1'3'                                                   02609000
         DC    CL1'4'                                                   02610000
         DC    CL1'5'                                                   02611000
         DC    CL1'6'                                                   02612000
         DC    CL1'7'                                                   02613000
         DC    CL1'8'                                                   02614000
         DC    CL1'9'                                                   02615000
         DC    CL1'A'                                                   02616000
         DC    CL1'B'                                                   02617000
         DC    CL1'C'                                                   02618000
         DC    CL1'D'                                                   02619000
         DC    CL1'E'                                                   02620000
         DC    CL1'F'                                                   02621000
IFCFRAMC CSECT                                                          02622000
        DC    S(SUPERZAP)                                               02623000
IFCFRAMC CSECT                                                          02624000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02625000
@01      EQU   01                                                       02626000
@02      EQU   02                                                       02627000
@03      EQU   03                                                       02628000
@04      EQU   04                                                       02629000
@05      EQU   05                                                       02630000
@06      EQU   06                                                       02631000
@07      EQU   07                                                       02632000
@08      EQU   08                                                       02633000
@09      EQU   09                                                       02634000
@10      EQU   10                                                       02635000
@11      EQU   11                                                       02636000
@12      EQU   12                                                       02637000
@13      EQU   13                                                       02638000
@14      EQU   14                                                       02639000
@15      EQU   15                                                       02640000
L        EQU   @03                                                      02641000
R2       EQU   @02                                                      02642000
R7       EQU   @07                                                      02643000
R8       EQU   @08                                                      02644000
R9       EQU   @09                                                      02645000
R15      EQU   @15                                                      02646000
R0       EQU   @00                                                      02647000
R1       EQU   @01                                                      02648000
R10      EQU   @10                                                      02649000
R11      EQU   @11                                                      02650000
R12      EQU   @12                                                      02651000
R13      EQU   @13                                                      02652000
R14      EQU   @14                                                      02653000
R3       EQU   @03                                                      02654000
R4       EQU   @04                                                      02655000
R5       EQU   @05                                                      02656000
R6       EQU   @06                                                      02657000
IOHND    EQU   0                                                        02658000
PARM     EQU   0                                                        02659000
RECTYPE  EQU   PARM                                                     02660000
SWITCHES EQU   PARM+2                                                   02661000
DEBUG    EQU   PARM+4                                                   02662000
DEBUGA   EQU   PARM+8                                                   02663000
MISC     EQU   PARM+12                                                  02664000
PRINTES  EQU   MISC                                                     02665000
OPENCLSE EQU   PARM+13                                                  02666000
OPENIO   EQU   OPENCLSE                                                 02667000
CLOSEIO  EQU   OPENCLSE+2                                               02668000
DATENOW  EQU   PARM+17                                                  02669000
STDT     EQU   PARM+23                                                  02670000
STDATE   EQU   STDT                                                     02671000
PSTD     EQU   STDATE+1                                                 02672000
ENDDT    EQU   PARM+31                                                  02673000
ENDDATE  EQU   ENDDT                                                    02674000
PEND     EQU   ENDDATE+1                                                02675000
STTIME1  EQU   PARM+39                                                  02676000
ENDTIME1 EQU   PARM+43                                                  02677000
STTIME2  EQU   PARM+47                                                  02678000
ENDTIME2 EQU   PARM+51                                                  02679000
STRTDATE EQU   PARM+55                                                  02680000
@NM00007 EQU   PARM+75                                                  02681000
ERRID    EQU   PARM+92                                                  02682000
IDTIMEA  EQU   ERRID+6                                                  02683000
IDTIME   EQU   IDTIMEA                                                  02684000
CCHHRLNG EQU   PARM+112                                                 02685000
LINECT   EQU   PARM+120                                                 02686000
ADIOHND  EQU   PARM+124                                                 02687000
ADIFCMSG EQU   PARM+128                                                 02688000
ADEDITB  EQU   PARM+132                                                 02689000
EVPTR    EQU   PARM+136                                                 02690000
SORTADR  EQU   PARM+140                                                 02691000
PRINTADR EQU   PARM+148                                                 02692000
CUAPTR   EQU   PARM+152                                                 02693000
DEVPTR   EQU   PARM+156                                                 02694000
MODPTR   EQU   PARM+160                                                 02695000
SERPTR   EQU   PARM+164                                                 02696000
VOLPTR   EQU   PARM+168                                                 02697000
CPUPTR   EQU   PARM+172                                                 02698000
CPCUAPTR EQU   PARM+176                                                 02699000
LIBADPTR EQU   PARM+180                                                 02700000
SYMCDPTR EQU   PARM+184                                                 02701000
SYSUMPTR EQU   PARM+188                                                 02702000
TRENPTR  EQU   PARM+192                                                 02703000
SHAREPTR EQU   PARM+196                                                 02704000
MERDCPTR EQU   PARM+208                                                 02705000
DUMPTABL EQU   PARM+228                                                 02706000
DUMPINFO EQU   DUMPTABL+4                                               02707000
TRENDONE EQU   0                                                        02708000
TREGEN   EQU   TRENDONE+8                                               02709000
TRECCH0  EQU   TREGEN+8                                                 02710000
TREND2   EQU   0                                                        02711000
TRENDKEY EQU   TREND2                                                   02712000
TRENDRT  EQU   TRENDKEY+1                                               02713000
TRENCPUS EQU   TRENDKEY+3                                               02714000
TRENDITM EQU   TRENDKEY+4                                               02715000
EVTABLE  EQU   0                                                        02716000
EVSTOP   EQU   EVTABLE                                                  02717000
EVKEY    EQU   EVTABLE+6                                                02718000
SORTABLE EQU   0                                                        02719000
SORTKEY  EQU   SORTABLE                                                 02720000
SORTCCHR EQU   SORTABLE+5                                               02721000
SYSUMONE EQU   0                                                        02722000
SYSUM2   EQU   0                                                        02723000
SYSUMKEY EQU   SYSUM2                                                   02724000
SYSRT    EQU   SYSUMKEY+1                                               02725000
SYSCPUS  EQU   SYSUMKEY+3                                               02726000
SYSITEM  EQU   SYSUMKEY+4                                               02727000
SHARE    EQU   0                                                        02728000
SHAREIO  EQU   SHARE+2                                                  02729000
SHRCUCPU EQU   SHAREIO                                                  02730000
SHARECUA EQU   SHRCUCPU                                                 02731000
EDITLOAD EQU   0                                                        02732000
EDITABLE EQU   EDITLOAD+4                                               02733000
CUA      EQU   0                                                        02734000
CUAVAL   EQU   CUA+2                                                    02735000
DEVICE   EQU   0                                                        02736000
MODELS   EQU   0                                                        02737000
DEVSERAL EQU   0                                                        02738000
VOLUME   EQU   0                                                        02739000
CPUS     EQU   0                                                        02740000
CPUCUAS  EQU   0                                                        02741000
CPUCUAV  EQU   CPUCUAS+2                                                02742000
LIBADR   EQU   0                                                        02743000
SYMCODE  EQU   0                                                        02744000
SYMVAL   EQU   SYMCODE+2                                                02745000
MERIDIAN EQU   0                                                        02746000
CCHREC   EQU   0                                                        02747000
LRBHTYPE EQU   CCHREC                                                   02748000
LRBHSYS  EQU   CCHREC+1                                                 02749000
LRBHSYS1 EQU   LRBHSYS                                                  02750000
LRBHSYS2 EQU   LRBHSYS                                                  02751000
LRBHSYS3 EQU   LRBHSYS                                                  02752000
LRBHSW1  EQU   CCHREC+3                                                 02753000
LRBRINC  EQU   LRBHSW1                                                  02754000
LRBSTERM EQU   LRBHSW1                                                  02755000
LRBUNSUP EQU   LRBHSW1                                                  02756000
LRBNOCUA EQU   LRBHSW1                                                  02757000
LRBOVER  EQU   LRBHSW1                                                  02758000
LRBERPIP EQU   LRBHSW1                                                  02759000
LRBHSW2  EQU   CCHREC+4                                                 02760000
LRBHSW3  EQU   CCHREC+5                                                 02761000
LRBCRHA  EQU   LRBHSW3                                                  02762000
LRBHDATE EQU   CCHREC+8                                                 02763000
LRBHTIME EQU   CCHREC+12                                                02764000
LRBHCSER EQU   CCHREC+17                                                02765000
LRBHMDL  EQU   CCHREC+20                                                02766000
LRBJOBID EQU   CCHREC+24                                                02767000
LRBCAIO  EQU   CCHREC+32                                                02768000
LRBCRCCW EQU   CCHREC+48                                                02769000
LRBCRCSW EQU   CCHREC+56                                                02770000
LRBCECSW EQU   CCHREC+64                                                02771000
LRBCCUA  EQU   CCHREC+73                                                02772000
LRBCHCUA EQU   CCHREC+76                                                02773000
LRBCLOGL EQU   CCHREC+78                                                02774000
CCHFOOTS EQU   0                                                        02775000
LRBCFT   EQU   CCHFOOTS                                                 02776000
LRBIOS   EQU   LRBCFT                                                   02777000
LRBUCB   EQU   LRBCFT                                                   02778000
LRBERPIB EQU   LRBCFT                                                   02779000
LRBCCHSI EQU   LRBCFT                                                   02780000
LRBCCHII EQU   LRBCFT                                                   02781000
LRBCCHFE EQU   LRBCFT                                                   02782000
LRBC60   EQU   LRBCFT                                                   02783000
LRBC70   EQU   LRBCFT                                                   02784000
LRBC80   EQU   LRBCFT+1                                                 02785000
LRBCIC   EQU   LRBCFT+1                                                 02786000
LRBCCHRD EQU   LRBCFT+1                                                 02787000
LRBCCHMP EQU   LRBCFT+1                                                 02788000
LRBCCHUC EQU   LRBCFT+1                                                 02789000
LRBCCHAS EQU   LRBCFT+1                                                 02790000
LRBCCHIO EQU   LRBCFT+1                                                 02791000
LRBCCHEX EQU   LRBCFT+1                                                 02792000
LRBCMPNO EQU   CCHFOOTS+6                                               02793000
LRBCMP   EQU   CCHFOOTS+8                                               02794000
LRBCMPPA EQU   LRBCMP                                                   02795000
LRBCMPCS EQU   LRBCMP+2                                                 02796000
IFCMSG   EQU   0                                                        02797000
BWORD2   EQU   0                                                        02798000
DADDR2   EQU   0                                                        02799000
NEXTBYTE EQU   0                                                        02800000
ADDNUM   EQU   0                                                        02801000
LENNUM   EQU   0                                                        02802000
LINENO   EQU   0                                                        02803000
INDEX    EQU   0                                                        02804000
TRECCH   EQU   TRECCH0                                                  02805000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02806000
@NM00387 EQU   CCHFOOTS+2                                               02807000
CHNLOG   EQU   CCHREC+84                                                02808000
TIOADDR  EQU   CCHREC+80                                                02809000
LRBCCUA2 EQU   CCHREC+74                                                02810000
LRBCCHID EQU   CCHREC+72                                                02811000
LRBCDEVT EQU   CCHREC+68                                                02812000
LRBHMCEL EQU   CCHREC+22                                                02813000
@NM00386 EQU   CCHREC+16                                                02814000
@NM00385 EQU   CCHREC+7                                                 02815000
LRBHCNT  EQU   CCHREC+6                                                 02816000
LRBNOCT  EQU   LRBHSW3                                                  02817000
LRBNOLOG EQU   LRBHSW3                                                  02818000
LRBNANAL EQU   LRBHSW3                                                  02819000
LRBNORET EQU   LRBHSW3                                                  02820000
LRBIORES EQU   LRBHSW3                                                  02821000
LRBUCBNO EQU   LRBHSW2                                                  02822000
LRBEEX   EQU   LRBHSW2                                                  02823000
LRBATTN  EQU   LRBHSW2                                                  02824000
LRBSYS1L EQU   LRBHSW2                                                  02825000
LRBCCHFR EQU   LRBHSW2                                                  02826000
LRBCCHNO EQU   LRBHSW2                                                  02827000
LRBCRPV  EQU   LRBHSW2                                                  02828000
LRBOPMSG EQU   LRBHSW1                                                  02829000
LRBHSW0  EQU   CCHREC+2                                                 02830000
MODEL    EQU   MERIDIAN+2                                               02831000
MRDNUMBR EQU   MERIDIAN                                                 02832000
SYMVAL2  EQU   SYMVAL+2                                                 02833000
SYMVAL1  EQU   SYMVAL                                                   02834000
SYMCDNUM EQU   SYMCODE                                                  02835000
LIBVAL   EQU   LIBADR+2                                                 02836000
LIBADNUM EQU   LIBADR                                                   02837000
CPUCUX3  EQU   CPUCUAV+5                                                02838000
CPUCUX2  EQU   CPUCUAV+3                                                02839000
CPUCUX1  EQU   CPUCUAV                                                  02840000
CPCUANUM EQU   CPUCUAS                                                  02841000
CPUVAL   EQU   CPUS+2                                                   02842000
CPUNUM   EQU   CPUS                                                     02843000
VOLVAL   EQU   VOLUME+2                                                 02844000
VOLNUM   EQU   VOLUME                                                   02845000
SERVAL   EQU   DEVSERAL+2                                               02846000
SERNUM   EQU   DEVSERAL                                                 02847000
MODVAL   EQU   MODELS+2                                                 02848000
MODNUM   EQU   MODELS                                                   02849000
MDRVAL   EQU   DEVICE+204                                               02850000
MDRNUM   EQU   DEVICE+202                                               02851000
DEVVAL   EQU   DEVICE+2                                                 02852000
DEVNUM   EQU   DEVICE                                                   02853000
CUA2     EQU   CUAVAL+2                                                 02854000
CUA1     EQU   CUAVAL                                                   02855000
CUANUM   EQU   CUA                                                      02856000
LOADPTR  EQU   EDITABLE+8                                               02857000
LOADNAME EQU   EDITABLE                                                 02858000
EDITNUM  EQU   EDITLOAD                                                 02859000
SHARLET  EQU   SHAREIO+10                                               02860000
SHARSERB EQU   SHAREIO+7                                                02861000
SHARECUB EQU   SHAREIO+5                                                02862000
SHARSERA EQU   SHRCUCPU+2                                               02863000
SHAREDX  EQU   SHARECUA                                                 02864000
SHARENUM EQU   SHARE                                                    02865000
SYSTEMP  EQU   SYSUM2+9                                                 02866000
SYSPERM  EQU   SYSUM2+7                                                 02867000
SYSDEV   EQU   SYSUM2+5                                                 02868000
SYSOLDA  EQU   SYSITEM                                                  02869000
SYS3705  EQU   SYSITEM                                                  02870000
SYSOLD   EQU   SYSCPUS                                                  02871000
SYSCPU   EQU   SYSCPUS                                                  02872000
SYSCUA   EQU   SYSRT                                                    02873000
SYSGROUP EQU   SYSUMKEY                                                 02874000
SYSUMEOD EQU   SYSUMONE+96                                              02875000
SYSUMPER EQU   SYSUMONE+92                                              02876000
SYSUMPEA EQU   SYSUMONE+88                                              02877000
SYSUMPEI EQU   SYSUMONE+84                                              02878000
SYSUMCH  EQU   SYSUMONE+20                                              02879000
SYSUMMCN EQU   SYSUMONE+16                                              02880000
SYSUMMCR EQU   SYSUMONE+12                                              02881000
SYSUMNXT EQU   SYSUMONE+8                                               02882000
SYSUMIPL EQU   SYSUMONE+4                                               02883000
SYSUMNUM EQU   SYSUMONE                                                 02884000
SORTCORE EQU   SORTCCHR                                                 02885000
SORTTIME EQU   SORTKEY+1                                                02886000
SORTYEAR EQU   SORTKEY                                                  02887000
EVLETTER EQU   EVKEY+5                                                  02888000
EVSERIAL EQU   EVKEY+2                                                  02889000
EVMODEL  EQU   EVKEY                                                    02890000
EVNUM    EQU   EVTABLE+4                                                02891000
EVDAY    EQU   EVSTOP+1                                                 02892000
EVYEAR   EQU   EVSTOP                                                   02893000
TRETMP   EQU   TREND2+10                                                02894000
TREPRM   EQU   TREND2+8                                                 02895000
TRENDDEV EQU   TREND2+6                                                 02896000
TRENDDAT EQU   TRENDKEY+5                                               02897000
TRENDOD  EQU   TRENDITM                                                 02898000
TREND037 EQU   TRENDITM                                                 02899000
TRENDOLD EQU   TRENCPUS                                                 02900000
TRENDCPU EQU   TRENCPUS                                                 02901000
@NM00011 EQU   TRENDRT+1                                                02902000
TRENDCUA EQU   TRENDRT                                                  02903000
TRENDGRP EQU   TRENDKEY                                                 02904000
TREPRE   EQU   TREGEN+72                                                02905000
TRECCHF  EQU   TREGEN+68                                                02906000
TRECCHE  EQU   TREGEN+64                                                02907000
TRECCHD  EQU   TREGEN+60                                                02908000
TRECCHC  EQU   TREGEN+56                                                02909000
TRECCHB  EQU   TREGEN+52                                                02910000
TRECCHA  EQU   TREGEN+48                                                02911000
TRECCH9  EQU   TREGEN+44                                                02912000
TRECCH8  EQU   TREGEN+40                                                02913000
TRECCH7  EQU   TREGEN+36                                                02914000
TRECCH6  EQU   TREGEN+32                                                02915000
TRECCH5  EQU   TREGEN+28                                                02916000
TRECCH4  EQU   TREGEN+24                                                02917000
TRECCH3  EQU   TREGEN+20                                                02918000
TRECCH2  EQU   TREGEN+16                                                02919000
TRECCH1  EQU   TREGEN+12                                                02920000
TREMCH   EQU   TREGEN+4                                                 02921000
TREIPL   EQU   TREGEN                                                   02922000
TRENUM   EQU   TRENDONE+4                                               02923000
TRENEXT  EQU   TRENDONE                                                 02924000
DUMPSIZE EQU   DUMPINFO+4                                               02925000
DUMPADR  EQU   DUMPINFO                                                 02926000
DUMPNUM  EQU   DUMPTABL                                                 02927000
@NM00010 EQU   PARM+212                                                 02928000
RECLNGT1 EQU   PARM+204                                                 02929000
FRAMEPTR EQU   PARM+200                                                 02930000
ADCPUT   EQU   PARM+144                                                 02931000
RECLNGTH EQU   CCHHRLNG+6                                               02932000
@NM00009 EQU   CCHHRLNG+5                                               02933000
RECCCHHR EQU   CCHHRLNG                                                 02934000
USERPGM  EQU   PARM+102                                                 02935000
IDTSEC   EQU   IDTIME+3                                                 02936000
IDSEC    EQU   IDTIME+2                                                 02937000
IDMIN    EQU   IDTIME+1                                                 02938000
IDHOUR   EQU   IDTIME                                                   02939000
IDASID   EQU   ERRID+4                                                  02940000
IDCPU    EQU   ERRID+3                                                  02941000
@NM00008 EQU   ERRID+2                                                  02942000
IDVALUE  EQU   ERRID                                                    02943000
NUMDAYS  EQU   PARM+88                                                  02944000
SORTNUM  EQU   PARM+84                                                  02945000
TABSIZE  EQU   PARM+80                                                  02946000
SYSRETRN EQU   @NM00007                                                 02947000
@NM00006 EQU   PARM+72                                                  02948000
WRTHRSH  EQU   PARM+69                                                  02949000
RDTHRSH  EQU   PARM+66                                                  02950000
TERM     EQU   PARM+58                                                  02951000
EVSDAY   EQU   STRTDATE+1                                               02952000
EVSYEAR  EQU   STRTDATE                                                 02953000
PENSEC2  EQU   ENDTIME2+2                                               02954000
PENMIN2  EQU   ENDTIME2+1                                               02955000
PENHOUR2 EQU   ENDTIME2                                                 02956000
PSTSEC2  EQU   STTIME2+2                                                02957000
PSTMIN2  EQU   STTIME2+1                                                02958000
PSTHOUR2 EQU   STTIME2                                                  02959000
PENSEC1  EQU   ENDTIME1+2                                               02960000
PENMIN1  EQU   ENDTIME1+1                                               02961000
PENHOUR1 EQU   ENDTIME1                                                 02962000
PSTSEC1  EQU   STTIME1+2                                                02963000
PSTMIN1  EQU   STTIME1+1                                                02964000
PSTHOUR1 EQU   STTIME1                                                  02965000
@NM00005 EQU   ENDDT+4                                                  02966000
PENDY    EQU   PEND+1                                                   02967000
PENYR    EQU   PEND                                                     02968000
@NM00004 EQU   ENDDATE                                                  02969000
@NM00003 EQU   STDT+4                                                   02970000
PSTDY    EQU   PSTD+1                                                   02971000
PSTYR    EQU   PSTD                                                     02972000
@NM00002 EQU   STDATE                                                   02973000
YEARNOW  EQU   DATENOW+4                                                02974000
@NM00001 EQU   DATENOW+3                                                02975000
DAYNOW   EQU   DATENOW                                                  02976000
CSNAP    EQU   CLOSEIO                                                  02977000
CDRCTWRK EQU   CLOSEIO                                                  02978000
CSYSIN   EQU   CLOSEIO                                                  02979000
CACCDEV  EQU   CLOSEIO                                                  02980000
CACCIN   EQU   CLOSEIO                                                  02981000
CSERLOG  EQU   CLOSEIO                                                  02982000
CEREPPT  EQU   CLOSEIO                                                  02983000
CTOURIST EQU   CLOSEIO                                                  02984000
OSNAP    EQU   OPENIO                                                   02985000
ODRCTWRK EQU   OPENIO                                                   02986000
OSYSIN   EQU   OPENIO                                                   02987000
OACCDEV  EQU   OPENIO                                                   02988000
OACCIN   EQU   OPENIO                                                   02989000
OSERLOG  EQU   OPENIO                                                   02990000
OEREPPT  EQU   OPENIO                                                   02991000
OTOURIST EQU   OPENIO                                                   02992000
PASSFLAG EQU   MISC                                                     02993000
PLOGREC  EQU   MISC                                                     02994000
ERRORID  EQU   MISC                                                     02995000
PSUM     EQU   PRINTES                                                  02996000
PEDIT    EQU   PRINTES                                                  02997000
PHIST    EQU   MISC                                                     02998000
PACC     EQU   MISC                                                     02999000
PZERO    EQU   MISC                                                     03000000
DEBUG63  EQU   DEBUGA+3                                                 03001000
DEBUG62  EQU   DEBUGA+3                                                 03002000
DEBUG61  EQU   DEBUGA+3                                                 03003000
DEBUG60  EQU   DEBUGA+3                                                 03004000
DEBUG59  EQU   DEBUGA+3                                                 03005000
DEBUG58  EQU   DEBUGA+3                                                 03006000
DEBUG57  EQU   DEBUGA+3                                                 03007000
DEBUG56  EQU   DEBUGA+3                                                 03008000
DEBUG55  EQU   DEBUGA+2                                                 03009000
DEBUG54  EQU   DEBUGA+2                                                 03010000
DEBUG53  EQU   DEBUGA+2                                                 03011000
DEBUG52  EQU   DEBUGA+2                                                 03012000
DEBUG51  EQU   DEBUGA+2                                                 03013000
DEBUG50  EQU   DEBUGA+2                                                 03014000
DEBUG49  EQU   DEBUGA+2                                                 03015000
DEBUG48  EQU   DEBUGA+2                                                 03016000
DEBUG47  EQU   DEBUGA+1                                                 03017000
DEBUG46  EQU   DEBUGA+1                                                 03018000
DEBUG45  EQU   DEBUGA+1                                                 03019000
DEBUG44  EQU   DEBUGA+1                                                 03020000
DEBUG43  EQU   DEBUGA+1                                                 03021000
DEBUG42  EQU   DEBUGA+1                                                 03022000
DEBUG41  EQU   DEBUGA+1                                                 03023000
DEBUG40  EQU   DEBUGA+1                                                 03024000
DEBUG39  EQU   DEBUGA                                                   03025000
DEBUG38  EQU   DEBUGA                                                   03026000
DEBUG37  EQU   DEBUGA                                                   03027000
DEBUG36  EQU   DEBUGA                                                   03028000
DEBUG35  EQU   DEBUGA                                                   03029000
DEBUG34  EQU   DEBUGA                                                   03030000
DEBUG33  EQU   DEBUGA                                                   03031000
DEBUG32  EQU   DEBUGA                                                   03032000
DEBUG31  EQU   DEBUG+3                                                  03033000
DEBUG30  EQU   DEBUG+3                                                  03034000
DEBUG29  EQU   DEBUG+3                                                  03035000
DEBUG28  EQU   DEBUG+3                                                  03036000
DEBUG27  EQU   DEBUG+3                                                  03037000
DEBUG26  EQU   DEBUG+3                                                  03038000
DEBUG25  EQU   DEBUG+3                                                  03039000
DEBUG24  EQU   DEBUG+3                                                  03040000
DEBUG23  EQU   DEBUG+2                                                  03041000
DEBUG22  EQU   DEBUG+2                                                  03042000
DEBUG21  EQU   DEBUG+2                                                  03043000
DEBUG20  EQU   DEBUG+2                                                  03044000
DEBUG19  EQU   DEBUG+2                                                  03045000
DEBUG18  EQU   DEBUG+2                                                  03046000
DEBUG17  EQU   DEBUG+2                                                  03047000
DEBUG16  EQU   DEBUG+2                                                  03048000
DEBUG15  EQU   DEBUG+1                                                  03049000
DEBUG14  EQU   DEBUG+1                                                  03050000
DEBUG13  EQU   DEBUG+1                                                  03051000
DEBUG12  EQU   DEBUG+1                                                  03052000
DEBUG11  EQU   DEBUG+1                                                  03053000
DEBUG10  EQU   DEBUG+1                                                  03054000
DEBUG9   EQU   DEBUG+1                                                  03055000
DEBUG8   EQU   DEBUG+1                                                  03056000
DEBUG7   EQU   DEBUG                                                    03057000
DEBUG6   EQU   DEBUG                                                    03058000
DEBUG5   EQU   DEBUG                                                    03059000
DEBUG4   EQU   DEBUG                                                    03060000
DEBUG3   EQU   DEBUG                                                    03061000
DEBUG2   EQU   DEBUG                                                    03062000
DEBUG1   EQU   DEBUG                                                    03063000
DEBUG0   EQU   DEBUG                                                    03064000
SORTBRK  EQU   SWITCHES+1                                               03065000
COREFAIL EQU   SWITCHES+1                                               03066000
ANALYSIS EQU   SWITCHES+1                                               03067000
SHIFT3RD EQU   SWITCHES+1                                               03068000
DEVEXCL  EQU   SWITCHES+1                                               03069000
ZEROALL  EQU   SWITCHES+1                                               03070000
NOTALL   EQU   SWITCHES+1                                               03071000
NOSDR    EQU   SWITCHES                                                 03072000
TIMESEQ  EQU   SWITCHES                                                 03073000
SYSUM    EQU   SWITCHES                                                 03074000
PARMTHR  EQU   SWITCHES                                                 03075000
TREND    EQU   SWITCHES                                                 03076000
SHORTOBR EQU   SWITCHES                                                 03077000
PARMMES  EQU   SWITCHES                                                 03078000
RDESUM   EQU   SWITCHES                                                 03079000
PCCHFRAM EQU   RECTYPE+1                                                03080000
PMCHFRAM EQU   RECTYPE+1                                                03081000
PTTYP    EQU   RECTYPE+1                                                03082000
PEOD     EQU   RECTYPE                                                  03083000
PMIH     EQU   RECTYPE                                                  03084000
PDDR     EQU   RECTYPE                                                  03085000
PIPL     EQU   RECTYPE                                                  03086000
PSOFT    EQU   RECTYPE                                                  03087000
POBR     EQU   RECTYPE                                                  03088000
PCHAN    EQU   RECTYPE                                                  03089000
PMCH     EQU   RECTYPE                                                  03090000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03091000
@RC00251 EQU   @EL00005                                                 03092000
@RC00266 EQU   @EL00006                                                 03093000
@RC00302 EQU   @EL00007                                                 03094000
@PB00007 EQU   @PB00008                                                 03095000
@RF00425 EQU   @EL00008                                                 03096000
@PB00006 EQU   @PB00007                                                 03097000
@PB00005 EQU   @PB00006                                                 03098000
@PB00004 EQU   @PB00005                                                 03099000
@PB00003 EQU   @PB00004                                                 03100000
@PB00002 EQU   @PB00003                                                 03101000
@ENDDATA EQU   *                                                        03102000
         END   IFCFRAMC,(C'PLS2211',0701,78226)                         03103000
