         TITLE 'IFCMSG01-EREP MESSAGE MODULE                           *00001000
                        '                                               00002000
IFCMSG01 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IFCMSG01  78.012'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @10,0                                               0001 00012000
@PSTART  LA    @11,4095(,@10)                                      0001 00013000
         USING @PSTART,@10                                         0001 00014000
         USING @PSTART+4095,@11                                    0001 00015000
         ST    @13,@SA00001+4                                      0001 00016000
         LA    @14,@SA00001                                        0001 00017000
         ST    @14,8(,@13)                                         0001 00018000
         LR    @13,@14                                             0001 00019000
         MVC   @PC00001(8),0(@01)                                  0001 00020000
*/********************************************************************/ 00021000
*/*                                                          @0001VLS*/ 00022000
*/* THE MESSAGE NUMBER IS PLACED IN THE FIRST 7 CHARACTERS OF THE    */ 00023000
*/* INPUT BUFFER.  A BLANK IS SKIPPED.  THE NEXT 50 CHARACTERS WILL  */ 00024000
*/* CONTAIN THE MESSAGE TEXT.                                @0001VLS*/ 00025000
*/*                                                          @0001VLS*/ 00026000
*/********************************************************************/ 00027000
* IF (DEBUG & '00000008'X) = '00000008'X & FIRSTTME = 0 THEN       0055 00028000
         MVC   @TS00001(4),DEBUG(SAVER2)                           0055 00029000
         NC    @TS00001(4),@CB00830                                0055 00030000
         CLC   @TS00001(4),@CB00830                                0055 00031000
         BNE   @RF00055                                            0055 00032000
         LH    @12,FIRSTTME                                        0055 00033000
         LTR   @12,@12                                             0055 00034000
         BNZ   @RF00055                                            0055 00035000
*  DO;                                                     /*@ZA25584*/ 00036000
* SAVE = PRINTADR;                                         /*@ZA25584*/ 00037000
         L     @12,PRINTADR(,SAVER2)                               0057 00038000
         ST    @12,SAVE                                            0057 00039000
*   FIRSTTME = 1;                                          /*@ZA25584*/ 00040000
         LA    @12,1                                               0058 00041000
         STH   @12,FIRSTTME                                        0058 00042000
*   PRINT1   = PRINT1   && PRINT1  ;                       /*@ZA25584*/ 00043000
         XC    PRINT1(72),PRINT1                                   0059 00044000
*   DO I = 1 BY 1 TO 99;                                   /*@ZA25584*/ 00045000
         STH   @12,I                                               0060 00046000
@DL00060 DS    0H                                                  0061 00047000
*    PRINTLNE(1:7) = NUMBER(I);                            /*@ZA25584*/ 00048000
         LA    @15,58                                              0061 00049000
         LR    @01,@12                                             0061 00050000
         MR    @00,@15                                             0061 00051000
         LA    @12,NUMBER-58(@01)                                  0061 00052000
         MVC   PRINTLNE(7),0(@12)                                  0061 00053000
*    PRINTLNE(9:58) = MESSAGE(I);                          /*@ZA25584*/ 00054000
         LA    @12,MESSAGE-58(@01)                                 0062 00055000
         MVC   PRINTLNE+8(50),0(@12)                               0062 00056000
*     IF RETURNED(MSGNO) = 0  THEN                                 0063 00057000
         L     @12,@PC00001                                        0063 00058000
         M     @14,MSGNO(,@12)                                     0063 00059000
         SLR   @12,@12                                             0063 00060000
         IC    @12,RETURNED-58(@15)                                0063 00061000
         C     @12,@CF00064                                        0063 00062000
         BNE   @RF00063                                            0063 00063000
*     RETURNC = 'F0'X;                                     /*@ZA25584*/ 00064000
         MVI   RETURNC+1,X'00'                                     0064 00065000
         MVI   RETURNC,X'F0'                                       0064 00066000
*    ELSE                                                          0065 00067000
*     IF RETURNED(MSGNO) = 12  THEN                                0065 00068000
         B     @RC00063                                            0065 00069000
@RF00063 L     @12,@PC00001                                        0065 00070000
         L     @12,MSGNO(,@12)                                     0065 00071000
         MH    @12,@CH00832                                        0065 00072000
         SLR   @15,@15                                             0065 00073000
         IC    @15,RETURNED-58(@12)                                0065 00074000
         C     @15,@CF00070                                        0065 00075000
         BNE   @RF00065                                            0065 00076000
*      RETURNC1= 'F1F2'X ;                                 /*@ZA25584*/ 00077000
         MVC   RETURNC1(2),@CB00834                                0066 00078000
*     ELSE                                                         0067 00079000
*     IF RETURNED(MSGNO) = 8  THEN                                 0067 00080000
         B     @RC00065                                            0067 00081000
@RF00065 L     @12,@PC00001                                        0067 00082000
         L     @12,MSGNO(,@12)                                     0067 00083000
         MH    @12,@CH00832                                        0067 00084000
         SLR   @15,@15                                             0067 00085000
         IC    @15,RETURNED-58(@12)                                0067 00086000
         C     @15,@CF00068                                        0067 00087000
         BNE   @RF00067                                            0067 00088000
*       RETURNC = 'F8'X ;                                  /*@ZA25584*/ 00089000
         MVI   RETURNC+1,X'00'                                     0068 00090000
         MVI   RETURNC,X'F8'                                       0068 00091000
*      ELSE                                                        0069 00092000
*       RETURNC1 = 'F1F6'X;                                /*@ZA25584*/ 00093000
         B     @RC00067                                            0069 00094000
@RF00067 MVC   RETURNC1(2),@CB00836                                0069 00095000
*    PRINTADR = ADDR(PRTLINE1);                            /*@ZA25584*/ 00096000
@RC00067 DS    0H                                                  0070 00097000
@RC00065 DS    0H                                                  0070 00098000
@RC00063 LA    @12,PRTLINE1                                        0070 00099000
         ST    @12,PRINTADR(,SAVER2)                               0070 00100000
*    CALL IOHND(RITEPRTR);                                 /*@ZA25584*/ 00101000
         L     @15,ADIOHND(,SAVER2)                                0071 00102000
         LA    @01,@AL00071                                        0071 00103000
         BALR  @14,@15                                             0071 00104000
*    CALL IOHND(RITEPRTR);                                 /*@ZA25584*/ 00105000
         L     @15,ADIOHND(,SAVER2)                                0072 00106000
         LA    @01,@AL00072                                        0072 00107000
         BALR  @14,@15                                             0072 00108000
*   END;                                                   /*@ZA25584*/ 00109000
         LA    @12,1                                               0073 00110000
         AH    @12,I                                               0073 00111000
         STH   @12,I                                               0073 00112000
         C     @12,@CF00831                                        0073 00113000
         BNH   @DL00060                                            0073 00114000
*PRINTADR = SAVE;                                          /*@ZA25584*/ 00115000
         L     @12,SAVE                                            0074 00116000
         ST    @12,PRINTADR(,SAVER2)                               0074 00117000
*END;                                                      /*@ZA25584*/ 00118000
*IF MSGNO > 199 & SYSRETRN < '0C'X THEN                            0076 00119000
@RF00055 L     @12,@PC00001                                        0076 00120000
         L     @12,MSGNO(,@12)                                     0076 00121000
         C     @12,@CF00838                                        0076 00122000
         BNH   @RF00076                                            0076 00123000
         CLI   SYSRETRN(SAVER2),X'0C'                              0076 00124000
         BNL   @RF00076                                            0076 00125000
* SYSRETRN = '0C'X;                                        /*@ZA25584*/ 00126000
         MVI   SYSRETRN(SAVER2),X'0C'                              0077 00127000
*ELSE                                                              0078 00128000
* IF RETURNED(MSGNO) > SYSRETRN  THEN                              0078 00129000
         B     @RC00076                                            0078 00130000
@RF00076 L     @12,@PC00001                                        0078 00131000
         L     @12,MSGNO(,@12)                                     0078 00132000
         MH    @12,@CH00832                                        0078 00133000
         LA    @03,RETURNED-58(@12)                                0078 00134000
         CLC   0(1,@03),SYSRETRN(SAVER2)                           0078 00135000
         BNH   @RF00078                                            0078 00136000
*   SYSRETRN = RETURNED(MSGNO);                            /*@ZA25584*/ 00137000
         LA    @03,RETURNED-58(@12)                                0079 00138000
         MVC   SYSRETRN(1,SAVER2),0(@03)                           0079 00139000
* IF (DEBUGA & '80000000'X) = '80000000'X &((MSGNO < 200 &         0080 00140000
*     RETURNED(MSGNO) = 12) | MSGNO > 199)  THEN                   0080 00141000
@RF00078 DS    0H                                                  0080 00142000
@RC00076 MVC   @TS00001(4),DEBUGA(SAVER2)                          0080 00143000
         NC    @TS00001(4),@CB00839                                0080 00144000
         CLC   @TS00001(4),@CB00839                                0080 00145000
         BNE   @RF00080                                            0080 00146000
         L     @12,@PC00001                                        0080 00147000
         L     @12,MSGNO(,@12)                                     0080 00148000
         C     @12,@CF00840                                        0080 00149000
         BNL   @GL00004                                            0080 00150000
         MH    @12,@CH00832                                        0080 00151000
         SLR   @03,@03                                             0080 00152000
         IC    @03,RETURNED-58(@12)                                0080 00153000
         C     @03,@CF00070                                        0080 00154000
         BE    @RT00080                                            0080 00155000
@GL00004 L     @12,@PC00001                                        0080 00156000
         L     @12,MSGNO(,@12)                                     0080 00157000
         C     @12,@CF00838                                        0080 00158000
         BNH   @RF00080                                            0080 00159000
@RT00080 DS    0H                                                  0081 00160000
*  GEN(ABEND  620,DUMP);                                   /*@ZA25584*/ 00161000
         ABEND  620,DUMP                                                00162000
*IF MSGNO <= 200 THEN                                              0082 00163000
@RF00080 L     @12,@PC00001                                        0082 00164000
         L     @12,MSGNO(,@12)                                     0082 00165000
         C     @12,@CF00840                                        0082 00166000
         BH    @RF00082                                            0082 00167000
*  DO;                                                     /*@0001VLS*/ 00168000
*    PRTLINE (1:7) = NUMBER(MSGNO);                        /*@0001VLS*/ 00169000
         L     @15,@PC00001+4                                      0084 00170000
         L     @15,MSGADDR(,@15)                                   0084 00171000
         MH    @12,@CH00832                                        0084 00172000
         LA    @14,NUMBER-58(@12)                                  0084 00173000
         MVC   PRTLINE(7,@15),0(@14)                               0084 00174000
*    PRTLINE (9:58) = MESSAGE(MSGNO);                      /*@0001VLS*/ 00175000
         LA    @14,MESSAGE-58(@12)                                 0085 00176000
         MVC   PRTLINE+8(50,@15),0(@14)                            0085 00177000
*  END;                                                    /*@0001VLS*/ 00178000
*IF MSGNO = 201 THEN                                               0087 00179000
@RF00082 L     @12,@PC00001                                        0087 00180000
         CLC   MSGNO(4,@12),@CF00841                               0087 00181000
         BNE   @RF00087                                            0087 00182000
*    GENERATE;                                             /*@0001VLS*/ 00183000
         WTO   'IFC116I SYS1.LOGREC DATA SET HEADER CANNOT BE RESET. USC00184000
               E IFCDIP00',ROUTCDE=11,DESC=7                   @0001VLS 00185000
*IF MSGNO = 202 THEN                                               0089 00186000
@RF00087 L     @12,@PC00001                                        0089 00187000
         CLC   MSGNO(4,@12),@CF00842                               0089 00188000
         BNE   @RF00089                                            0089 00189000
*    GENERATE;                                             /*@0001VLS*/ 00190000
 WTO 'IFC135I PROCESSING TERMINATED TOURIST WRITE ERROR',              X00191000
               ROUTCDE=11,DESC=7                                        00192000
*IF MSGNO = 203 THEN                                               0091 00193000
@RF00089 L     @12,@PC00001                                        0091 00194000
         CLC   MSGNO(4,@12),@CF00843                               0091 00195000
         BNE   @RF00091                                            0091 00196000
*    GENERATE;                                             /*@0001VLS*/ 00197000
         WTO   'IFC104I TOURIST NOT OPEN WHEN WRITE REQUESTED',        C00198000
               ROUTCDE=11,DESC=7                               @0001VLS 00199000
*IF MSGNO = 204 THEN                                               0093 00200000
@RF00091 L     @12,@PC00001                                        0093 00201000
         CLC   MSGNO(4,@12),@CF00844                               0093 00202000
         BNE   @RF00093                                            0093 00203000
*    GENERATE;                                             /*@0001VLS*/ 00204000
         WTO   'IFC106I TOURIST CLOSE REQUESTED, TOURIST NOT OPEN',    C00205000
               ROUTCDE=11,DESC=7                               @0001VLS 00206000
*IF MSGNO = 205 THEN                                               0095 00207000
@RF00093 L     @12,@PC00001                                        0095 00208000
         CLC   MSGNO(4,@12),@CF00845                               0095 00209000
         BNE   @RF00095                                            0095 00210000
*    GENERATE;                                             /*@0001VLS*/ 00211000
 WTO 'IFC103I TOURIST DD STATEMENT MISSING OR INCORRECTLY CODED',      X00212000
               ROUTCDE=11,DESC=7                                        00213000
*RESPECIFY (R15) RESTRICTED;                               /*@0001VLS*/ 00214000
@RF00095 DS    0H                                                  0098 00215000
*R15 = 0;                                                  /*@0001VLS*/ 00216000
         SLR   R15,R15                                             0098 00217000
*RETURN;                                                   /*@0001VLS*/ 00218000
@EL00001 L     @13,4(,@13)                                         0099 00219000
@EF00001 DS    0H                                                  0099 00220000
@ER00001 L     @14,12(,@13)                                        0099 00221000
         LM    @00,@12,20(@13)                                     0099 00222000
         BR    @14                                                 0099 00223000
*RESPECIFY (R15) UNRESTRICTED;                             /*@0001VLS*/ 00224000
*END   IFCMSG01                                            /*@0001VLS*/ 00225000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00226000
*/*%INCLUDE SYSLIB  (COMTABLE)                                        * 00227000
*;                                                                 0101 00228000
@DATA    DS    0H                                                       00229000
@CH00077 DC    H'2'                                                     00230000
@CH00832 DC    H'58'                                                    00231000
         DS    0F                                                       00232000
@AL00071 EQU   *                       LIST WITH   1 ARGUMENT(S)        00233000
@AL00072 DC    A(@CH00077)             LIST WITH   1 ARGUMENT(S)        00234000
         DS    0F                                                       00235000
@SA00001 DS    18F                                                      00236000
@PC00001 DS    2F                                                       00237000
         DS    0F                                                       00238000
@CF00064 DC    F'0'                                                     00239000
@CF00068 DC    F'8'                                                     00240000
@CF00070 DC    F'12'                                                    00241000
@CF00831 DC    F'99'                                                    00242000
@CF00838 DC    F'199'                                                   00243000
@CF00840 DC    F'200'                                                   00244000
@CF00841 DC    F'201'                                                   00245000
@CF00842 DC    F'202'                                                   00246000
@CF00843 DC    F'203'                                                   00247000
@CF00844 DC    F'204'                                                   00248000
@CF00845 DC    F'205'                                                   00249000
         DS    0D                                                       00250000
SAVE     DC    F'0'                                                     00251000
I        DC    H'0'                                                     00252000
FIRSTTME DC    H'0'                                                     00253000
@TS00001 DS    CL4                                                      00254000
@CB00830 DC    X'00000008'                                              00255000
@CB00839 DC    X'80000000'                                              00256000
@CB00834 DC    X'F1F2'                                                  00257000
@CB00836 DC    X'F1F6'                                                  00258000
PRTLINE1 DC    CL134' '                                                 00259000
         ORG   PRTLINE1                                                 00260000
PRINTDD  DC    X'F2'                                                    00261000
PRINTCC  DC    X'09'                                                    00262000
PRINTLNE DS    CL60                                                     00263000
PRINT1   DS    CL72                                                     00264000
         ORG   PRTLINE1+134                                             00265000
SUPERZAP DC    3CL10'SUPERZAP'                                          00266000
@NM00012 DS    CL58                                                     00267000
         ORG   @NM00012+0                                               00268000
RETURNED DC    X'10'                                                    00269000
NUMBER   DC    CL7'IFC101I'                                             00270000
MESSAGE  DC    CL50'REQUEST FOR NON-EXISTENT IO SERVICE'                00271000
         ORG   @NM00012+58                                              00272000
         ORG   @NM00012+58                                              00273000
         DC    X'10'                                                    00274000
         DC    CL7'IFC102I'                                             00275000
         DC    CL50'ACCDEV OPEN REQUESTED, ALREADY OPEN'                00276000
         ORG   @NM00012+116                                             00277000
         ORG   @NM00012+116                                             00278000
         DC    X'0C'                                                    00279000
         DC    CL7'IFC103I'                                             00280000
         DC    CL50'ACCDEV DD STATEMENT MISSING OR INCORRECTLY CODED'   00281000
         ORG   @NM00012+174                                             00282000
         ORG   @NM00012+174                                             00283000
         DC    X'10'                                                    00284000
         DC    CL7'IFC104I'                                             00285000
         DC    CL50'ACCDEV NOT OPEN WHEN WRITE REQUESTED'               00286000
         ORG   @NM00012+232                                             00287000
         ORG   @NM00012+232                                             00288000
         DC    X'0C'                                                    00289000
         DC    CL7'IFC138I'                                             00290000
         DC    CL50'FRAME LOST WHILE WRITING TO ACCDEV                ' 00291000
         ORG   @NM00012+290                                             00292000
         ORG   @NM00012+290                                             00293000
         DC    X'0C'                                                    00294000
         DC    CL7'IFC135I'                                             00295000
         DC    CL50'PROCESSING TERMINATED ACCDEV   WRITE ERROR'         00296000
         ORG   @NM00012+348                                             00297000
         ORG   @NM00012+348                                             00298000
         DC    X'0C'                                                    00299000
         DC    CL7'IFC135I'                                             00300000
         DC    CL50'PROCESSING TERMINATED ACCIN    READ  ERROR'         00301000
         ORG   @NM00012+406                                             00302000
         ORG   @NM00012+406                                             00303000
         DC    X'10'                                                    00304000
         DC    CL7'IFC106I'                                             00305000
         DC    CL50'ACCDEV CLOSE REQUESTED, ACCDEV NOT OPEN '           00306000
         ORG   @NM00012+464                                             00307000
         ORG   @NM00012+464                                             00308000
         DC    X'0C'                                                    00309000
         DC    CL7'IFC103I'                                             00310000
         DC    CL50'ACCIN  DD STATEMENT MISSING OR INCORRECTLY CODED'   00311000
         ORG   @NM00012+522                                             00312000
         ORG   @NM00012+522                                             00313000
         DC    X'0C'                                                    00314000
         DC    CL7'IFC107I'                                             00315000
         DC    CL50'ACCIN RECORD FORMAT NOT V OR VB'                    00316000
         ORG   @NM00012+580                                             00317000
         ORG   @NM00012+580                                             00318000
         DC    X'10'                                                    00319000
         DC    CL7'IFC102I'                                             00320000
         DC    CL50'ACCIN  OPEN REQUESTED, ALREADY OPEN'                00321000
         ORG   @NM00012+638                                             00322000
         ORG   @NM00012+638                                             00323000
         DC    X'10'                                                    00324000
         DC    CL7'IFC106I'                                             00325000
         DC    CL50'ACCIN  CLOSE REQUESTED, ACCIN  NOT OPEN '           00326000
         ORG   @NM00012+696                                             00327000
         ORG   @NM00012+696                                             00328000
         DC    X'0C'                                                    00329000
         DC    CL7'IFC103I'                                             00330000
         DC    CL50'SERLOG DD STATEMENT MISSING OR INCORRECTLY CODED'   00331000
         ORG   @NM00012+754                                             00332000
         ORG   @NM00012+754                                             00333000
         DC    X'0C'                                                    00334000
         DC    CL7'IFC108I'                                             00335000
         DC    CL50'ATTEMPTED TO READ OUTSIDE SERLOG EXTENT'            00336000
         ORG   @NM00012+812                                             00337000
         ORG   @NM00012+812                                             00338000
         DC    X'0C'                                                    00339000
         DC    CL7'IFC109I'                                             00340000
         DC    CL50'SERLOG HEADER CANNOT BE READ'                       00341000
         ORG   @NM00012+870                                             00342000
         ORG   @NM00012+870                                             00343000
         DC    X'0C'                                                    00344000
         DC    CL7'IFC110I'                                             00345000
         DC    CL50'SERLOG HEADER CHECK BYTE INCORRECT'                 00346000
         ORG   @NM00012+928                                             00347000
         ORG   @NM00012+928                                             00348000
         DC    X'10'                                                    00349000
         DC    CL7'IFC111I'                                             00350000
         DC    CL50'OPEN REQUESTED, DATA SET NOT SPECIFIED'             00351000
         ORG   @NM00012+986                                             00352000
         ORG   @NM00012+986                                             00353000
         DC    X'0C'                                                    00354000
         DC    CL7'IFC135I'                                             00355000
         DC    CL50'PROCESSING TERMINATED EREPPT   WRITE ERROR'         00356000
         ORG   @NM00012+1044                                            00357000
         ORG   @NM00012+1044                                            00358000
         DC    X'10'                                                    00359000
         DC    CL7'IFC104I'                                             00360000
         DC    CL50'EREPPT NOT OPEN WHEN WRITE REQUESTED'               00361000
         ORG   @NM00012+1102                                            00362000
         ORG   @NM00012+1102                                            00363000
         DC    X'00'                                                    00364000
         DC    CL7'IFC139I'                                             00365000
         DC    CL50'XXX FRAME NN MISSING- MOD NNNN SER NNNNNN         ' 00366000
         ORG   @NM00012+1160                                            00367000
         ORG   @NM00012+1160                                            00368000
         DC    X'10'                                                    00369000
         DC    CL7'IFC112I'                                             00370000
         DC    CL50'READ REQUESTED, NO DATA SET OPEN'                   00371000
         ORG   @NM00012+1218                                            00372000
         ORG   @NM00012+1218                                            00373000
         DC    X'10'                                                    00374000
         DC    CL7'IFC106I'                                             00375000
         DC    CL50'EREPPT CLOSE REQUESTED, EREPPT NOT OPEN '           00376000
         ORG   @NM00012+1276                                            00377000
         ORG   @NM00012+1276                                            00378000
         DC    X'10'                                                    00379000
         DC    CL7'IFC102I'                                             00380000
         DC    CL50'TOURIST OPEN REQUESTED, ALREADY OPEN'               00381000
         ORG   @NM00012+1334                                            00382000
         ORG   @NM00012+1334                                            00383000
         DC    X'10'                                                    00384000
         DC    CL7'IFC140I'                                             00385000
         DC    CL50'FRAME CPU-SERIAL-NUMBER TABLE OVERFLOWED          ' 00386000
         ORG   @NM00012+1392                                            00387000
         ORG   @NM00012+1392                                            00388000
         DC    X'0C'                                                    00389000
         DC    CL7'IFC105I'                                             00390000
         DC    CL50'RECORD IGNORED, SERLOG READ DIRECT ERROR'           00391000
         ORG   @NM00012+1450                                            00392000
         ORG   @NM00012+1450                                            00393000
         DC    X'0C'                                                    00394000
         DC    CL7'IFC135I'                                             00395000
         DC    CL50'PROCESSING TERMINATED DIRECTWK WRITE ERROR'         00396000
         ORG   @NM00012+1508                                            00397000
         ORG   @NM00012+1508                                            00398000
         DC    X'0C'                                                    00399000
         DC    CL7'IFC103I'                                             00400000
         DC    CL50'DIRECTWK DD STATEMENT MISSING OR INCORRECTLY CODED' 00401000
         ORG   @NM00012+1566                                            00402000
         ORG   @NM00012+1566                                            00403000
         DC    X'10'                                                    00404000
         DC    CL7'IFC104I'                                             00405000
         DC    CL50'DIRECTWK NOT OPEN WHEN WRITE REQUESTED'             00406000
         ORG   @NM00012+1624                                            00407000
         ORG   @NM00012+1624                                            00408000
         DC    X'10'                                                    00409000
         DC    CL7'IFC106I'                                             00410000
         DC    CL50'DIRECTWK CLOSE REQUESTED, DIRECTWK NOT OPEN'        00411000
         ORG   @NM00012+1682                                            00412000
         ORG   @NM00012+1682                                            00413000
         DC    X'0C'                                                    00414000
         DC    CL7'IFC103I'                                             00415000
         DC    CL50'DIRECTWK DD STATEMENT MISSING OR INCORRECTLY CODED' 00416000
         ORG   @NM00012+1740                                            00417000
         ORG   @NM00012+1740                                            00418000
         DC    X'10'                                                    00419000
         DC    CL7'IFC102I'                                             00420000
         DC    CL50'DIRECTWK OPEN REQUESTED, ALREADY OPEN'              00421000
         ORG   @NM00012+1798                                            00422000
         ORG   @NM00012+1798                                            00423000
         DC    X'10'                                                    00424000
         DC    CL7'IFC136I'                                             00425000
         DC    CL50'CLOSE REQUESTED, NO DATA SET OPEN'                  00426000
         ORG   @NM00012+1856                                            00427000
         ORG   @NM00012+1856                                            00428000
         DC    X'10'                                                    00429000
         DC    CL7'IFC102I'                                             00430000
         DC    CL50'SYSIN OPEN REQUESTED, ALREADY OPEN'                 00431000
         ORG   @NM00012+1914                                            00432000
         ORG   @NM00012+1914                                            00433000
         DC    X'10'                                                    00434000
         DC    CL7'IFC106I'                                             00435000
         DC    CL50'SYSIN  CLOSE REQUESTED, SYSIN  NOT OPEN '           00436000
         ORG   @NM00012+1972                                            00437000
         ORG   @NM00012+1972                                            00438000
         DC    X'10'                                                    00439000
         DC    CL7'IFC104I'                                             00440000
         DC    CL50'SYSIN NOT OPEN WHEN READ REQUESTED'                 00441000
         ORG   @NM00012+2030                                            00442000
         ORG   @NM00012+2030                                            00443000
         DC    X'0C'                                                    00444000
         DC    CL7'IFC135I'                                             00445000
         DC    CL50'PROCESSING TERMINATED SYSIN READ  ERROR'            00446000
         ORG   @NM00012+2088                                            00447000
         ORG   @NM00012+2088                                            00448000
         DC    X'04'                                                    00449000
         DC    CL7'IFC113I'                                             00450000
         DC    CL50'RECORDS IGNORED, INSUFFICIENT SPACE ON DIRECTWK'    00451000
         ORG   @NM00012+2146                                            00452000
         ORG   @NM00012+2146                                            00453000
         DC    X'00'                                                    00454000
         DC    CL7'IFC114I'                                             00455000
         DC    CL50'LAST RECORD PROCESSED WAS'                          00456000
         ORG   @NM00012+2204                                            00457000
         ORG   @NM00012+2204                                            00458000
         DC    X'0C'                                                    00459000
         DC    CL7'IFC135I'                                             00460000
         DC    CL50'PROCESSING TERMINATED SERLOG READ ERROR           ' 00461000
         ORG   @NM00012+2262                                            00462000
         ORG   @NM00012+2262                                            00463000
         DC    X'08'                                                    00464000
         DC    CL7'IFC141I'                                             00465000
         DC    CL50'CORE NOT AVAILABLE FOR FRAME PROCESSING           ' 00466000
         ORG   @NM00012+2320                                            00467000
         ORG   @NM00012+2320                                            00468000
         DC    X'10'                                                    00469000
         DC    CL7'IFC102I'                                             00470000
         DC    CL50'SERLOG OPEN REQUESTED, ALREADY OPEN'                00471000
         ORG   @NM00012+2378                                            00472000
         ORG   @NM00012+2378                                            00473000
         DC    X'0C'                                                    00474000
         DC    CL7'IFC105I'                                             00475000
         DC    CL50'RECORD IGNORED, DIRECTWK READ ERROR'                00476000
         ORG   @NM00012+2436                                            00477000
         ORG   @NM00012+2436                                            00478000
         DC    X'00'                                                    00479000
         DC    CL7'IFC142I'                                             00480000
         DC    CL50'NNNNNN RECORDS FOUND WITH INVALID DATE FIELD      ' 00481000
         ORG   @NM00012+2494                                            00482000
         ORG   @NM00012+2494                                            00483000
         DC    X'0C'                                                    00484000
         DC    CL7'IFC103I'                                             00485000
         DC    CL50'EREPPT DD STATEMENT MISSING OR INCORRECTLY CODED'   00486000
         ORG   @NM00012+2552                                            00487000
         ORG   @NM00012+2552                                            00488000
         DC    X'10'                                                    00489000
         DC    CL7'IFC102I'                                             00490000
         DC    CL50'EREPPT OPEN REQUESTED, ALREADY OPEN'                00491000
         ORG   @NM00012+2610                                            00492000
         ORG   @NM00012+2610                                            00493000
         DC    X'10'                                                    00494000
         DC    CL7'IFC104I'                                             00495000
         DC    CL50'DIRECTWK NOT OPEN WHEN READ REQUESTED'              00496000
         ORG   @NM00012+2668                                            00497000
         ORG   @NM00012+2668                                            00498000
         DC    X'10'                                                    00499000
         DC    CL7'IFC104I'                                             00500000
         DC    CL50'SERLOG NOT OPEN WHEN READ REQUESTED'                00501000
         ORG   @NM00012+2726                                            00502000
         ORG   @NM00012+2726                                            00503000
         DC    X'0C'                                                    00504000
         DC    CL7'IFC116I'                                             00505000
         DC    CL50'SYS1.LOGREC HEADER CANNOT BE RESET USE IFCDIP00'    00506000
         ORG   @NM00012+2784                                            00507000
         ORG   @NM00012+2784                                            00508000
         DC    X'0C'                                                    00509000
         DC    CL7'IFC117I'                                             00510000
         DC    CL50'SERLOG CLOSED PREMATURELY'                          00511000
         ORG   @NM00012+2842                                            00512000
         ORG   @NM00012+2842                                            00513000
         DC    X'0C'                                                    00514000
         DC    CL7'IFC118I'                                             00515000
         DC    CL50'GETMAIN FAILURE WHILE CLEARING SYS1.LOGREC'         00516000
         ORG   @NM00012+2900                                            00517000
         ORG   @NM00012+2900                                            00518000
         DC    X'10'                                                    00519000
         DC    CL7'IFC106I'                                             00520000
         DC    CL50'SERLOG CLOSE REQUESTED, SERLOG NOT OPEN'            00521000
         ORG   @NM00012+2958                                            00522000
         ORG   @NM00012+2958                                            00523000
         DC    X'00'                                                    00524000
         DC    CL7'IFC143I'                                             00525000
         DC    CL50'NUMBER OF XXX TYPE RECORDS READ WAS               ' 00526000
         ORG   @NM00012+3016                                            00527000
         ORG   @NM00012+3016                                            00528000
         DC    X'04'                                                    00529000
         DC    CL7'IFC119I'                                             00530000
         DC    CL50'RECORDS IGNORED, TABSIZE ALLOCATION TOO SMALL'      00531000
         ORG   @NM00012+3074                                            00532000
         ORG   @NM00012+3074                                            00533000
         DC    X'00'                                                    00534000
         DC    CL7'IFC120I'                                             00535000
         DC    CL50'           RECORDS THAT PASSED FILTERING'           00536000
         ORG   @NM00012+3132                                            00537000
         ORG   @NM00012+3132                                            00538000
         DC    X'08'                                                    00539000
         DC    CL7'IFC121I'                                             00540000
         DC    CL50'GETMAIN FAILED FOR SORT TABLE'                      00541000
         ORG   @NM00012+3190                                            00542000
         ORG   @NM00012+3190                                            00543000
         DC    X'00'                                                    00544000
         DC    CL7'IFC122I'                                             00545000
         DC    CL50'        RECORDS IGNORED BECAUSE TRUNCATED BIT ON'   00546000
         ORG   @NM00012+3248                                            00547000
         ORG   @NM00012+3248                                            00548000
         DC    X'00'                                                    00549000
         DC    CL7'IFC123I'                                             00550000
         DC    CL50'        RECORDS IGNORED BECAUSE OF UNKNOWN TYPE'    00551000
         ORG   @NM00012+3306                                            00552000
         ORG   @NM00012+3306                                            00553000
         DC    X'08'                                                    00554000
         DC    CL7'IFC124I'                                             00555000
         DC    CL50'INVALID RDE CTL CARD - CORRECT AND RERUN JOB'       00556000
         ORG   @NM00012+3364                                            00557000
         ORG   @NM00012+3364                                            00558000
         DC    X'08'                                                    00559000
         DC    CL7'IFC125I'                                             00560000
         DC    CL50'INVALID START DATE - CORRECT AND RERUN JOB'         00561000
         ORG   @NM00012+3422                                            00562000
         ORG   @NM00012+3422                                            00563000
         DC    X'08'                                                    00564000
         DC    CL7'IFC126I'                                             00565000
         DC    CL50'INVALID END DATE - CORRECT AND RERUN JOB'           00566000
         ORG   @NM00012+3480                                            00567000
         ORG   @NM00012+3480                                            00568000
         DC    X'08'                                                    00569000
         DC    CL7'IFC127I'                                             00570000
         DC    CL50'INVALID CLUSTER VALUE - CORRECT AND RERUN JOB'      00571000
         ORG   @NM00012+3538                                            00572000
         ORG   @NM00012+3538                                            00573000
         DC    X'00'                                                    00574000
         DC    CL7'IFC128I'                                             00575000
         DC    CL50'NO IPL RECORDS PROCESSED.'                          00576000
         ORG   @NM00012+3596                                            00577000
         ORG   @NM00012+3596                                            00578000
         DC    X'0C'                                                    00579000
         DC    CL7'IFC129I'                                             00580000
         DC    CL50'       RCDS IGNORED BECAUSE DIRECTWK READ ERRORS'   00581000
         ORG   @NM00012+3654                                            00582000
         ORG   @NM00012+3654                                            00583000
         DC    X'0C'                                                    00584000
         DC    CL7'IFC130I'                                             00585000
         DC    CL50'UNABLE TO FIND MODULE SPECIFIED BY USERPGM'         00586000
         ORG   @NM00012+3712                                            00587000
         ORG   @NM00012+3712                                            00588000
         DC    X'08'                                                    00589000
         DC    CL7'IFC131I'                                             00590000
         DC    CL50'SYNTAX ERROR AT'                                    00591000
         ORG   @NM00012+3770                                            00592000
         ORG   @NM00012+3770                                            00593000
         DC    X'08'                                                    00594000
         DC    CL7'IFC132I'                                             00595000
         DC    CL50'DUPLICATION AT'                                     00596000
         ORG   @NM00012+3828                                            00597000
         ORG   @NM00012+3828                                            00598000
         DC    X'08'                                                    00599000
         DC    CL7'IFC133I'                                             00600000
         DC    CL50'PARAMETER CONFLICTS -'                              00601000
         ORG   @NM00012+3886                                            00602000
         ORG   @NM00012+3886                                            00603000
         DC    X'08'                                                    00604000
         DC    CL7'IFC134I'                                             00605000
         DC    CL50'MORE THAN 16 CPUS SPECIFIED WITH SHARE CARDS'       00606000
         ORG   @NM00012+3944                                            00607000
         ORG   @NM00012+3944                                            00608000
         DC    X'08'                                                    00609000
         DC    CL7'IFC121I'                                             00610000
         DC    CL50'GETMAIN FAILED FOR SHARE TABLE     '                00611000
         ORG   @NM00012+4002                                            00612000
         ORG   @NM00012+4002                                            00613000
         DC    X'00'                                                    00614000
         DC    CL7'IFC120I'                                             00615000
         DC    CL50'           RECORDS SAVED FOR TREND PART1'           00616000
         ORG   @NM00012+4060                                            00617000
         ORG   @NM00012+4060                                            00618000
         DC    X'00'                                                    00619000
         DC    CL7'IFC120I'                                             00620000
         DC    CL50'           RECORDS SAVED FOR TREND PART2'           00621000
         ORG   @NM00012+4118                                            00622000
         ORG   @NM00012+4118                                            00623000
         DC    X'00'                                                    00624000
         DC    CL7'IFC137I'                                             00625000
         DC    CL50'RECORD WITHOUT CPU SERIAL NUMBER ENCOUNTERED'       00626000
         ORG   @NM00012+4176                                            00627000
         ORG   @NM00012+4176                                            00628000
         DC    X'00'                                                    00629000
         DC    CL7'IFC134I'                                             00630000
         DC    CL50'MORE THAN 16 CPUS ENCOUNTERED -'                    00631000
         ORG   @NM00012+4234                                            00632000
         ORG   @NM00012+4234                                            00633000
         DC    X'00'                                                    00634000
         DC    CL7'IFC134I'                                             00635000
         DC    CL50'MORE THAN 11 CPUS ENCOUNTERED -'                    00636000
         ORG   @NM00012+4292                                            00637000
         ORG   @NM00012+4292                                            00638000
         DC    X'00'                                                    00639000
         DC    CL7'IFC120I'                                             00640000
         DC    CL50'           RECORDS SAVED FOR SYSUM PART1'           00641000
         ORG   @NM00012+4350                                            00642000
         ORG   @NM00012+4350                                            00643000
         DC    X'00'                                                    00644000
         DC    CL7'IFC120I'                                             00645000
         DC    CL50'           RECORDS SAVED FOR SYSUM PART2'           00646000
         ORG   @NM00012+4408                                            00647000
         ORG   @NM00012+4408                                            00648000
         DC    X'00'                                                    00649000
         DC    CL7'IFC144I'                                             00650000
         DC    CL50'SCAN CODE ERROR AT ***                            ' 00651000
         ORG   @NM00012+4466                                            00652000
         ORG   @NM00012+4466                                            00653000
         DC    X'00'                                                    00654000
         DC    CL7'IFC145I'                                             00655000
         DC    CL50'FRAME SET MISSING  XXXX YYYYYY                    ' 00656000
         ORG   @NM00012+4524                                            00657000
         ORG   @NM00012+4524                                            00658000
         DC    X'00'                                                    00659000
         DC    CL7'IFC146I'                                             00660000
         DC    CL50'NO FRAMES AVAIL. XXX MOD NNNN SER NNNNNN          ' 00661000
         ORG   @NM00012+4582                                            00662000
         ORG   @NM00012+4582                                            00663000
         DC    X'00'                                                    00664000
         DC    CL7'IFC147I'                                             00665000
         DC    CL50'LOG ERR- XXX FRAME NN MOD NNNN SER NNNNNN         ' 00666000
         ORG   @NM00012+4640                                            00667000
         ORG   @NM00012+4640                                            00668000
         DC    X'00'                                                    00669000
         DC    CL7'IFC148I'                                             00670000
         DC    CL50'    RECORDS REQUESTED BUT NOT FOUND               ' 00671000
         ORG   @NM00012+4698                                            00672000
         ORG   @NM00012+4698                                            00673000
         DC    X'00'                                                    00674000
         DC    CL7'IFC149I'                                             00675000
         DC    CL50'        DIRECT READ FAILURES                      ' 00676000
         ORG   @NM00012+4756                                            00677000
         ORG   @NM00012+4756                                            00678000
         DC    X'00'                                                    00679000
         DC    CL7'IFC150I'                                             00680000
         DC    CL50'        RECORDS READ FROM INPUT SOURCE            ' 00681000
         ORG   @NM00012+4814                                            00682000
         ORG   @NM00012+4814                                            00683000
         DC    X'00'                                                    00684000
         DC    CL7'IFC151I'                                             00685000
         DC    CL50'QQQ'                                                00686000
         ORG   @NM00012+4872                                            00687000
         ORG   @NM00012+4872                                            00688000
         DC    X'10'                                                    00689000
         DC    CL7'IFC152I'                                             00690000
         DC    CL50'QQQ'                                                00691000
         ORG   @NM00012+4930                                            00692000
         ORG   @NM00012+4930                                            00693000
         DC    X'10'                                                    00694000
         DC    CL7'IFC153I'                                             00695000
         DC    CL50'QQQ'                                                00696000
         ORG   @NM00012+4988                                            00697000
         ORG   @NM00012+4988                                            00698000
         DC    X'10'                                                    00699000
         DC    CL7'IFC154I'                                             00700000
         DC    CL50'QQQ'                                                00701000
         ORG   @NM00012+5046                                            00702000
         ORG   @NM00012+5046                                            00703000
         DC    X'10'                                                    00704000
         DC    CL7'IFC155I'                                             00705000
         DC    CL50'QQQ'                                                00706000
         ORG   @NM00012+5104                                            00707000
         ORG   @NM00012+5104                                            00708000
         DC    X'10'                                                    00709000
         DC    CL7'IFC156I'                                             00710000
         DC    CL50'QQQ'                                                00711000
         ORG   @NM00012+5162                                            00712000
         ORG   @NM00012+5162                                            00713000
         DC    X'10'                                                    00714000
         DC    CL7'IFC157I'                                             00715000
         DC    CL50'QQQ'                                                00716000
         ORG   @NM00012+5220                                            00717000
         ORG   @NM00012+5220                                            00718000
         DC    X'10'                                                    00719000
         DC    CL7'IFC158I'                                             00720000
         DC    CL50'QQQ'                                                00721000
         ORG   @NM00012+5278                                            00722000
         ORG   @NM00012+5278                                            00723000
         DC    X'10'                                                    00724000
         DC    CL7'IFC159I'                                             00725000
         DC    CL50'QQQ'                                                00726000
         ORG   @NM00012+5336                                            00727000
         ORG   @NM00012+5336                                            00728000
         DC    X'10'                                                    00729000
         DC    CL7'IFCNNNI'                                             00730000
         DC    CL50'QQQ'                                                00731000
         ORG   @NM00012+5394                                            00732000
         ORG   @NM00012+5394                                            00733000
         DC    X'10'                                                    00734000
         DC    CL7'IFCNNNI'                                             00735000
         DC    CL50'QQQ'                                                00736000
         ORG   @NM00012+5452                                            00737000
         ORG   @NM00012+5452                                            00738000
         DC    X'10'                                                    00739000
         DC    CL7'IFCNNNI'                                             00740000
         DC    CL50'QQQ'                                                00741000
         ORG   @NM00012+5510                                            00742000
         ORG   @NM00012+5510                                            00743000
         DC    X'10'                                                    00744000
         DC    CL7'IFCNNNI'                                             00745000
         DC    CL50'QQQ'                                                00746000
         ORG   @NM00012+5568                                            00747000
         ORG   @NM00012+5568                                            00748000
         DC    X'10'                                                    00749000
         DC    CL7'IFCNNNI'                                             00750000
         DC    CL50'QQQ'                                                00751000
         ORG   @NM00012+5626                                            00752000
         ORG   @NM00012+5626                                            00753000
         DC    X'10'                                                    00754000
         DC    CL7'IFCNNNI'                                             00755000
         DC    CL50'QQQ'                                                00756000
         ORG   @NM00012+5684                                            00757000
         ORG   @NM00012+5684                                            00758000
         DC    X'10'                                                    00759000
         DC    CL7'IFCNNNI'                                             00760000
         DC    CL50'QQQ'                                                00761000
         ORG   @NM00012+5742                                            00762000
         ORG   @NM00012+5742                                            00763000
         DS    CL1                                                      00764000
         DC    CL7'IFCNNNI'                                             00765000
         DC    CL50'QQQ'                                                00766000
         ORG   @NM00012+5800                                            00767000
IFCMSG01 CSECT                                                          00768000
         DC    S(SUPERZAP)                                              00769000
IFCMSG01 CSECT                                                          00770000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00771000
@01      EQU   01                                                       00772000
@02      EQU   02                                                       00773000
@03      EQU   03                                                       00774000
@04      EQU   04                                                       00775000
@05      EQU   05                                                       00776000
@06      EQU   06                                                       00777000
@07      EQU   07                                                       00778000
@08      EQU   08                                                       00779000
@09      EQU   09                                                       00780000
@10      EQU   10                                                       00781000
@11      EQU   11                                                       00782000
@12      EQU   12                                                       00783000
@13      EQU   13                                                       00784000
@14      EQU   14                                                       00785000
@15      EQU   15                                                       00786000
R15      EQU   @15                                                      00787000
SAVER2   EQU   @02                                                      00788000
R0       EQU   @00                                                      00789000
R1       EQU   @01                                                      00790000
R10      EQU   @10                                                      00791000
R11      EQU   @11                                                      00792000
R12      EQU   @12                                                      00793000
R13      EQU   @13                                                      00794000
R14      EQU   @14                                                      00795000
R2       EQU   @02                                                      00796000
R3       EQU   @03                                                      00797000
R4       EQU   @04                                                      00798000
R5       EQU   @05                                                      00799000
R6       EQU   @06                                                      00800000
R7       EQU   @07                                                      00801000
R8       EQU   @08                                                      00802000
R9       EQU   @09                                                      00803000
IOHND    EQU   0                                                        00804000
PARM     EQU   0                                                        00805000
RECTYPE  EQU   PARM                                                     00806000
SWITCHES EQU   PARM+2                                                   00807000
DEBUG    EQU   PARM+4                                                   00808000
DEBUGA   EQU   PARM+8                                                   00809000
MISC     EQU   PARM+12                                                  00810000
PRINTES  EQU   MISC                                                     00811000
OPENCLSE EQU   PARM+13                                                  00812000
OPENIO   EQU   OPENCLSE                                                 00813000
CLOSEIO  EQU   OPENCLSE+2                                               00814000
DATENOW  EQU   PARM+17                                                  00815000
STDT     EQU   PARM+23                                                  00816000
STDATE   EQU   STDT                                                     00817000
PSTD     EQU   STDATE+1                                                 00818000
ENDDT    EQU   PARM+31                                                  00819000
ENDDATE  EQU   ENDDT                                                    00820000
PEND     EQU   ENDDATE+1                                                00821000
STTIME1  EQU   PARM+39                                                  00822000
ENDTIME1 EQU   PARM+43                                                  00823000
STTIME2  EQU   PARM+47                                                  00824000
ENDTIME2 EQU   PARM+51                                                  00825000
STRTDATE EQU   PARM+55                                                  00826000
@NM00007 EQU   PARM+75                                                  00827000
SYSRETRN EQU   @NM00007                                                 00828000
ERRID    EQU   PARM+92                                                  00829000
IDTIMEA  EQU   ERRID+6                                                  00830000
IDTIME   EQU   IDTIMEA                                                  00831000
CCHHRLNG EQU   PARM+112                                                 00832000
ADIOHND  EQU   PARM+124                                                 00833000
ADIFCMSG EQU   PARM+128                                                 00834000
ADEDITB  EQU   PARM+132                                                 00835000
EVPTR    EQU   PARM+136                                                 00836000
SORTADR  EQU   PARM+140                                                 00837000
PRINTADR EQU   PARM+148                                                 00838000
CUAPTR   EQU   PARM+152                                                 00839000
DEVPTR   EQU   PARM+156                                                 00840000
MODPTR   EQU   PARM+160                                                 00841000
SERPTR   EQU   PARM+164                                                 00842000
VOLPTR   EQU   PARM+168                                                 00843000
CPUPTR   EQU   PARM+172                                                 00844000
CPCUAPTR EQU   PARM+176                                                 00845000
LIBADPTR EQU   PARM+180                                                 00846000
SYMCDPTR EQU   PARM+184                                                 00847000
SYSUMPTR EQU   PARM+188                                                 00848000
TRENPTR  EQU   PARM+192                                                 00849000
SHAREPTR EQU   PARM+196                                                 00850000
MERDCPTR EQU   PARM+208                                                 00851000
DUMPTABL EQU   PARM+228                                                 00852000
DUMPINFO EQU   DUMPTABL+4                                               00853000
TRENDONE EQU   0                                                        00854000
TREGEN   EQU   TRENDONE+8                                               00855000
TRECCH0  EQU   TREGEN+8                                                 00856000
TREND2   EQU   0                                                        00857000
TRENDKEY EQU   TREND2                                                   00858000
TRENDRT  EQU   TRENDKEY+1                                               00859000
TRENCPUS EQU   TRENDKEY+3                                               00860000
TRENDITM EQU   TRENDKEY+4                                               00861000
EVTABLE  EQU   0                                                        00862000
EVSTOP   EQU   EVTABLE                                                  00863000
EVKEY    EQU   EVTABLE+6                                                00864000
SORTABLE EQU   0                                                        00865000
SORTKEY  EQU   SORTABLE                                                 00866000
SORTCCHR EQU   SORTABLE+5                                               00867000
SYSUMONE EQU   0                                                        00868000
SYSUM2   EQU   0                                                        00869000
SYSUMKEY EQU   SYSUM2                                                   00870000
SYSRT    EQU   SYSUMKEY+1                                               00871000
SYSCPUS  EQU   SYSUMKEY+3                                               00872000
SYSITEM  EQU   SYSUMKEY+4                                               00873000
SHARE    EQU   0                                                        00874000
SHAREIO  EQU   SHARE+2                                                  00875000
SHRCUCPU EQU   SHAREIO                                                  00876000
SHARECUA EQU   SHRCUCPU                                                 00877000
EDITLOAD EQU   0                                                        00878000
EDITABLE EQU   EDITLOAD+4                                               00879000
CUA      EQU   0                                                        00880000
CUAVAL   EQU   CUA+2                                                    00881000
DEVICE   EQU   0                                                        00882000
MODELS   EQU   0                                                        00883000
DEVSERAL EQU   0                                                        00884000
VOLUME   EQU   0                                                        00885000
CPUS     EQU   0                                                        00886000
CPUCUAS  EQU   0                                                        00887000
CPUCUAV  EQU   CPUCUAS+2                                                00888000
LIBADR   EQU   0                                                        00889000
SYMCODE  EQU   0                                                        00890000
SYMVAL   EQU   SYMCODE+2                                                00891000
MERIDIAN EQU   0                                                        00892000
PRTLINE  EQU   0                                                        00893000
IFCMSG   EQU   0                                                        00894000
MSGNO    EQU   0                                                        00895000
MSGADDR  EQU   0                                                        00896000
RETURNC  EQU   PRINTLNE+64                                              00897000
RETURNC1 EQU   PRINTLNE+63                                              00898000
TRECCH   EQU   TRECCH0                                                  00899000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00900000
MODEL    EQU   MERIDIAN+2                                               00901000
MRDNUMBR EQU   MERIDIAN                                                 00902000
SYMVAL2  EQU   SYMVAL+2                                                 00903000
SYMVAL1  EQU   SYMVAL                                                   00904000
SYMCDNUM EQU   SYMCODE                                                  00905000
LIBVAL   EQU   LIBADR+2                                                 00906000
LIBADNUM EQU   LIBADR                                                   00907000
CPUCUX3  EQU   CPUCUAV+5                                                00908000
CPUCUX2  EQU   CPUCUAV+3                                                00909000
CPUCUX1  EQU   CPUCUAV                                                  00910000
CPCUANUM EQU   CPUCUAS                                                  00911000
CPUVAL   EQU   CPUS+2                                                   00912000
CPUNUM   EQU   CPUS                                                     00913000
VOLVAL   EQU   VOLUME+2                                                 00914000
VOLNUM   EQU   VOLUME                                                   00915000
SERVAL   EQU   DEVSERAL+2                                               00916000
SERNUM   EQU   DEVSERAL                                                 00917000
MODVAL   EQU   MODELS+2                                                 00918000
MODNUM   EQU   MODELS                                                   00919000
MDRVAL   EQU   DEVICE+204                                               00920000
MDRNUM   EQU   DEVICE+202                                               00921000
DEVVAL   EQU   DEVICE+2                                                 00922000
DEVNUM   EQU   DEVICE                                                   00923000
CUA2     EQU   CUAVAL+2                                                 00924000
CUA1     EQU   CUAVAL                                                   00925000
CUANUM   EQU   CUA                                                      00926000
LOADPTR  EQU   EDITABLE+8                                               00927000
LOADNAME EQU   EDITABLE                                                 00928000
EDITNUM  EQU   EDITLOAD                                                 00929000
SHARLET  EQU   SHAREIO+10                                               00930000
SHARSERB EQU   SHAREIO+7                                                00931000
SHARECUB EQU   SHAREIO+5                                                00932000
SHARSERA EQU   SHRCUCPU+2                                               00933000
SHAREDX  EQU   SHARECUA                                                 00934000
SHARENUM EQU   SHARE                                                    00935000
SYSTEMP  EQU   SYSUM2+9                                                 00936000
SYSPERM  EQU   SYSUM2+7                                                 00937000
SYSDEV   EQU   SYSUM2+5                                                 00938000
SYSOLDA  EQU   SYSITEM                                                  00939000
SYS3705  EQU   SYSITEM                                                  00940000
SYSOLD   EQU   SYSCPUS                                                  00941000
SYSCPU   EQU   SYSCPUS                                                  00942000
SYSCUA   EQU   SYSRT                                                    00943000
SYSGROUP EQU   SYSUMKEY                                                 00944000
SYSUMEOD EQU   SYSUMONE+96                                              00945000
SYSUMPER EQU   SYSUMONE+92                                              00946000
SYSUMPEA EQU   SYSUMONE+88                                              00947000
SYSUMPEI EQU   SYSUMONE+84                                              00948000
SYSUMCH  EQU   SYSUMONE+20                                              00949000
SYSUMMCN EQU   SYSUMONE+16                                              00950000
SYSUMMCR EQU   SYSUMONE+12                                              00951000
SYSUMNXT EQU   SYSUMONE+8                                               00952000
SYSUMIPL EQU   SYSUMONE+4                                               00953000
SYSUMNUM EQU   SYSUMONE                                                 00954000
SORTCORE EQU   SORTCCHR                                                 00955000
SORTTIME EQU   SORTKEY+1                                                00956000
SORTYEAR EQU   SORTKEY                                                  00957000
EVLETTER EQU   EVKEY+5                                                  00958000
EVSERIAL EQU   EVKEY+2                                                  00959000
EVMODEL  EQU   EVKEY                                                    00960000
EVNUM    EQU   EVTABLE+4                                                00961000
EVDAY    EQU   EVSTOP+1                                                 00962000
EVYEAR   EQU   EVSTOP                                                   00963000
TRETMP   EQU   TREND2+10                                                00964000
TREPRM   EQU   TREND2+8                                                 00965000
TRENDDEV EQU   TREND2+6                                                 00966000
TRENDDAT EQU   TRENDKEY+5                                               00967000
TRENDOD  EQU   TRENDITM                                                 00968000
TREND037 EQU   TRENDITM                                                 00969000
TRENDOLD EQU   TRENCPUS                                                 00970000
TRENDCPU EQU   TRENCPUS                                                 00971000
@NM00011 EQU   TRENDRT+1                                                00972000
TRENDCUA EQU   TRENDRT                                                  00973000
TRENDGRP EQU   TRENDKEY                                                 00974000
TREPRE   EQU   TREGEN+72                                                00975000
TRECCHF  EQU   TREGEN+68                                                00976000
TRECCHE  EQU   TREGEN+64                                                00977000
TRECCHD  EQU   TREGEN+60                                                00978000
TRECCHC  EQU   TREGEN+56                                                00979000
TRECCHB  EQU   TREGEN+52                                                00980000
TRECCHA  EQU   TREGEN+48                                                00981000
TRECCH9  EQU   TREGEN+44                                                00982000
TRECCH8  EQU   TREGEN+40                                                00983000
TRECCH7  EQU   TREGEN+36                                                00984000
TRECCH6  EQU   TREGEN+32                                                00985000
TRECCH5  EQU   TREGEN+28                                                00986000
TRECCH4  EQU   TREGEN+24                                                00987000
TRECCH3  EQU   TREGEN+20                                                00988000
TRECCH2  EQU   TREGEN+16                                                00989000
TRECCH1  EQU   TREGEN+12                                                00990000
TREMCH   EQU   TREGEN+4                                                 00991000
TREIPL   EQU   TREGEN                                                   00992000
TRENUM   EQU   TRENDONE+4                                               00993000
TRENEXT  EQU   TRENDONE                                                 00994000
DUMPSIZE EQU   DUMPINFO+4                                               00995000
DUMPADR  EQU   DUMPINFO                                                 00996000
DUMPNUM  EQU   DUMPTABL                                                 00997000
@NM00010 EQU   PARM+212                                                 00998000
RECLNGT1 EQU   PARM+204                                                 00999000
FRAMEPTR EQU   PARM+200                                                 01000000
ADCPUT   EQU   PARM+144                                                 01001000
LINECT   EQU   PARM+120                                                 01002000
RECLNGTH EQU   CCHHRLNG+6                                               01003000
@NM00009 EQU   CCHHRLNG+5                                               01004000
RECCCHHR EQU   CCHHRLNG                                                 01005000
USERPGM  EQU   PARM+102                                                 01006000
IDTSEC   EQU   IDTIME+3                                                 01007000
IDSEC    EQU   IDTIME+2                                                 01008000
IDMIN    EQU   IDTIME+1                                                 01009000
IDHOUR   EQU   IDTIME                                                   01010000
IDASID   EQU   ERRID+4                                                  01011000
IDCPU    EQU   ERRID+3                                                  01012000
@NM00008 EQU   ERRID+2                                                  01013000
IDVALUE  EQU   ERRID                                                    01014000
NUMDAYS  EQU   PARM+88                                                  01015000
SORTNUM  EQU   PARM+84                                                  01016000
TABSIZE  EQU   PARM+80                                                  01017000
@NM00006 EQU   PARM+72                                                  01018000
WRTHRSH  EQU   PARM+69                                                  01019000
RDTHRSH  EQU   PARM+66                                                  01020000
TERM     EQU   PARM+58                                                  01021000
EVSDAY   EQU   STRTDATE+1                                               01022000
EVSYEAR  EQU   STRTDATE                                                 01023000
PENSEC2  EQU   ENDTIME2+2                                               01024000
PENMIN2  EQU   ENDTIME2+1                                               01025000
PENHOUR2 EQU   ENDTIME2                                                 01026000
PSTSEC2  EQU   STTIME2+2                                                01027000
PSTMIN2  EQU   STTIME2+1                                                01028000
PSTHOUR2 EQU   STTIME2                                                  01029000
PENSEC1  EQU   ENDTIME1+2                                               01030000
PENMIN1  EQU   ENDTIME1+1                                               01031000
PENHOUR1 EQU   ENDTIME1                                                 01032000
PSTSEC1  EQU   STTIME1+2                                                01033000
PSTMIN1  EQU   STTIME1+1                                                01034000
PSTHOUR1 EQU   STTIME1                                                  01035000
@NM00005 EQU   ENDDT+4                                                  01036000
PENDY    EQU   PEND+1                                                   01037000
PENYR    EQU   PEND                                                     01038000
@NM00004 EQU   ENDDATE                                                  01039000
@NM00003 EQU   STDT+4                                                   01040000
PSTDY    EQU   PSTD+1                                                   01041000
PSTYR    EQU   PSTD                                                     01042000
@NM00002 EQU   STDATE                                                   01043000
YEARNOW  EQU   DATENOW+4                                                01044000
@NM00001 EQU   DATENOW+3                                                01045000
DAYNOW   EQU   DATENOW                                                  01046000
CSNAP    EQU   CLOSEIO                                                  01047000
CDRCTWRK EQU   CLOSEIO                                                  01048000
CSYSIN   EQU   CLOSEIO                                                  01049000
CACCDEV  EQU   CLOSEIO                                                  01050000
CACCIN   EQU   CLOSEIO                                                  01051000
CSERLOG  EQU   CLOSEIO                                                  01052000
CEREPPT  EQU   CLOSEIO                                                  01053000
CTOURIST EQU   CLOSEIO                                                  01054000
OSNAP    EQU   OPENIO                                                   01055000
ODRCTWRK EQU   OPENIO                                                   01056000
OSYSIN   EQU   OPENIO                                                   01057000
OACCDEV  EQU   OPENIO                                                   01058000
OACCIN   EQU   OPENIO                                                   01059000
OSERLOG  EQU   OPENIO                                                   01060000
OEREPPT  EQU   OPENIO                                                   01061000
OTOURIST EQU   OPENIO                                                   01062000
PASSFLAG EQU   MISC                                                     01063000
PLOGREC  EQU   MISC                                                     01064000
ERRORID  EQU   MISC                                                     01065000
PSUM     EQU   PRINTES                                                  01066000
PEDIT    EQU   PRINTES                                                  01067000
PHIST    EQU   MISC                                                     01068000
PACC     EQU   MISC                                                     01069000
PZERO    EQU   MISC                                                     01070000
DEBUG63  EQU   DEBUGA+3                                                 01071000
DEBUG62  EQU   DEBUGA+3                                                 01072000
DEBUG61  EQU   DEBUGA+3                                                 01073000
DEBUG60  EQU   DEBUGA+3                                                 01074000
DEBUG59  EQU   DEBUGA+3                                                 01075000
DEBUG58  EQU   DEBUGA+3                                                 01076000
DEBUG57  EQU   DEBUGA+3                                                 01077000
DEBUG56  EQU   DEBUGA+3                                                 01078000
DEBUG55  EQU   DEBUGA+2                                                 01079000
DEBUG54  EQU   DEBUGA+2                                                 01080000
DEBUG53  EQU   DEBUGA+2                                                 01081000
DEBUG52  EQU   DEBUGA+2                                                 01082000
DEBUG51  EQU   DEBUGA+2                                                 01083000
DEBUG50  EQU   DEBUGA+2                                                 01084000
DEBUG49  EQU   DEBUGA+2                                                 01085000
DEBUG48  EQU   DEBUGA+2                                                 01086000
DEBUG47  EQU   DEBUGA+1                                                 01087000
DEBUG46  EQU   DEBUGA+1                                                 01088000
DEBUG45  EQU   DEBUGA+1                                                 01089000
DEBUG44  EQU   DEBUGA+1                                                 01090000
DEBUG43  EQU   DEBUGA+1                                                 01091000
DEBUG42  EQU   DEBUGA+1                                                 01092000
DEBUG41  EQU   DEBUGA+1                                                 01093000
DEBUG40  EQU   DEBUGA+1                                                 01094000
DEBUG39  EQU   DEBUGA                                                   01095000
DEBUG38  EQU   DEBUGA                                                   01096000
DEBUG37  EQU   DEBUGA                                                   01097000
DEBUG36  EQU   DEBUGA                                                   01098000
DEBUG35  EQU   DEBUGA                                                   01099000
DEBUG34  EQU   DEBUGA                                                   01100000
DEBUG33  EQU   DEBUGA                                                   01101000
DEBUG32  EQU   DEBUGA                                                   01102000
DEBUG31  EQU   DEBUG+3                                                  01103000
DEBUG30  EQU   DEBUG+3                                                  01104000
DEBUG29  EQU   DEBUG+3                                                  01105000
DEBUG28  EQU   DEBUG+3                                                  01106000
DEBUG27  EQU   DEBUG+3                                                  01107000
DEBUG26  EQU   DEBUG+3                                                  01108000
DEBUG25  EQU   DEBUG+3                                                  01109000
DEBUG24  EQU   DEBUG+3                                                  01110000
DEBUG23  EQU   DEBUG+2                                                  01111000
DEBUG22  EQU   DEBUG+2                                                  01112000
DEBUG21  EQU   DEBUG+2                                                  01113000
DEBUG20  EQU   DEBUG+2                                                  01114000
DEBUG19  EQU   DEBUG+2                                                  01115000
DEBUG18  EQU   DEBUG+2                                                  01116000
DEBUG17  EQU   DEBUG+2                                                  01117000
DEBUG16  EQU   DEBUG+2                                                  01118000
DEBUG15  EQU   DEBUG+1                                                  01119000
DEBUG14  EQU   DEBUG+1                                                  01120000
DEBUG13  EQU   DEBUG+1                                                  01121000
DEBUG12  EQU   DEBUG+1                                                  01122000
DEBUG11  EQU   DEBUG+1                                                  01123000
DEBUG10  EQU   DEBUG+1                                                  01124000
DEBUG9   EQU   DEBUG+1                                                  01125000
DEBUG8   EQU   DEBUG+1                                                  01126000
DEBUG7   EQU   DEBUG                                                    01127000
DEBUG6   EQU   DEBUG                                                    01128000
DEBUG5   EQU   DEBUG                                                    01129000
DEBUG4   EQU   DEBUG                                                    01130000
DEBUG3   EQU   DEBUG                                                    01131000
DEBUG2   EQU   DEBUG                                                    01132000
DEBUG1   EQU   DEBUG                                                    01133000
DEBUG0   EQU   DEBUG                                                    01134000
SORTBRK  EQU   SWITCHES+1                                               01135000
COREFAIL EQU   SWITCHES+1                                               01136000
ANALYSIS EQU   SWITCHES+1                                               01137000
SHIFT3RD EQU   SWITCHES+1                                               01138000
DEVEXCL  EQU   SWITCHES+1                                               01139000
ZEROALL  EQU   SWITCHES+1                                               01140000
NOTALL   EQU   SWITCHES+1                                               01141000
NOSDR    EQU   SWITCHES                                                 01142000
TIMESEQ  EQU   SWITCHES                                                 01143000
SYSUM    EQU   SWITCHES                                                 01144000
PARMTHR  EQU   SWITCHES                                                 01145000
TREND    EQU   SWITCHES                                                 01146000
SHORTOBR EQU   SWITCHES                                                 01147000
PARMMES  EQU   SWITCHES                                                 01148000
RDESUM   EQU   SWITCHES                                                 01149000
PCCHFRAM EQU   RECTYPE+1                                                01150000
PMCHFRAM EQU   RECTYPE+1                                                01151000
PTTYP    EQU   RECTYPE+1                                                01152000
PEOD     EQU   RECTYPE                                                  01153000
PMIH     EQU   RECTYPE                                                  01154000
PDDR     EQU   RECTYPE                                                  01155000
PIPL     EQU   RECTYPE                                                  01156000
PSOFT    EQU   RECTYPE                                                  01157000
POBR     EQU   RECTYPE                                                  01158000
PCHAN    EQU   RECTYPE                                                  01159000
PMCH     EQU   RECTYPE                                                  01160000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01161000
@ENDDATA EQU   *                                                        01162000
         END   IFCMSG01,(C'PLS2230',0701,78012)                         01163000
