         TITLE 'IFCPARM2-PARAMETER MODULE FOR EREP                     *00001000
                        '                                               00002000
IFCPARM2 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IFCPARM2  78.054'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @09,0                                               0001 00012000
@PSTART  LA    @10,4095(,@09)                                      0001 00013000
         LA    @11,4095(,@10)                                      0001 00014000
         LA    @12,4095(,@11)                                      0001 00015000
         USING @PSTART,@09                                         0001 00016000
         USING @PSTART+4095,@10                                    0001 00017000
         USING @PSTART+8190,@11                                    0001 00018000
         USING @PSTART+12285,@12                                   0001 00019000
         ST    @13,@SA00001+4                                      0001 00020000
         LA    @14,@SA00001                                        0001 00021000
         ST    @14,8(,@13)                                         0001 00022000
         LR    @13,@14                                             0001 00023000
         MVC   @PC00001(4),0(@01)                                  0001 00024000
         B     @PB00002                                            0108 00025000
CONFLICT STM   @14,@12,@SA00002                                    0108 00026000
         MVC   @PC00002(8),0(@01)                                  0108 00027000
*      CALL IFCMSG(67,ADDR(MSGNO));                        /*@Z427VLS*/ 00028000
         LA    @08,MSGNO                                           0111 00029000
         ST    @08,@AFTEMPS                                        0111 00030000
         L     @15,ADIFCMSG(,R2)                                   0111 00031000
         LA    @01,@AL00111                                        0111 00032000
         BALR  @14,@15                                             0111 00033000
*      PARMPRT(1:LPARM) = CONPARM(1:LPARM);  /* CONFLICT MESSAGE     */ 00034000
         L     @08,@PC00002                                        0112 00035000
         L     @08,LPARM(,@08)                                     0112 00036000
         BCTR  @08,0                                               0112 00037000
         L     @04,@PC00002+4                                      0112 00038000
         EX    @08,@SM01182                                        0112 00039000
*      PRINTADR = ADDR(PARMPT);                            /*@Z427VLS*/ 00040000
         LA    @08,PARMPT                                          0113 00041000
         ST    @08,PRINTADR(,R2)                                   0113 00042000
*      CALL IOHND(RITEPRTR);                               /*@Z427VLS*/ 00043000
         L     @15,ADIOHND(,R2)                                    0114 00044000
         LA    @01,@AL00114                                        0114 00045000
         BALR  @14,@15                                             0114 00046000
*      IF DEBUG13 = OFF THEN                                       0115 00047000
         TM    DEBUG13(R2),B'00000100'                             0115 00048000
         BNZ   @RF00115                                            0115 00049000
*        RETCODE = TWELVE;                                 /*@Z427VLS*/ 00050000
         MVC   RETCODE(4),@CF00037                                 0116 00051000
*   END;                                                   /*@Z427VLS*/ 00052000
@EL00002 DS    0H                                                  0117 00053000
@EF00002 DS    0H                                                  0117 00054000
@ER00002 LM    @14,@12,@SA00002                                    0117 00055000
         BR    @14                                                 0117 00056000
*/********************************************************************/ 00057000
*/*                                                          @Z427VLS*/ 00058000
*/*  OUTPUT AN ERROR MESSAGE.  THE FLAG BEING PASSED AS A PARAMETER  */ 00059000
*/*  INDICATES THE TYPE OF ERROR.  IF THE INPUT PARAMETER STRING HAS */ 00060000
*/*  NOT BEEN OUTPUT, A HEADING IS WRITTEN OUT AND THE PARAMETER     */ 00061000
*/*  STRING IS WRITTEN OUT.  THEN THE ERROR MESSAGE IS WRITTEN OUT   */ 00062000
*/*  WITH AN ASTERISK IN THE PLACE WHERE THE SCAN ROUTINE IS LOCATED.*/ 00063000
*/*  THIS SHOULD INDICATE THE LOCATION OF THE ERROR.         @Z427VLS*/ 00064000
*/********************************************************************/ 00065000
*OUTMSG:   PROC (ERROR) OPTIONS(SAVE(1,14));               /*@Z427VLS*/ 00066000
OUTMSG   ST    @14,@SA00003                                        0118 00067000
         ST    @01,@SA00003+4                                      0118 00068000
         MVC   @PC00003(4),0(@01)                                  0118 00069000
*   DCL ERROR  FIXED(31);                                  /*@Z427VLS*/ 00070000
*   IF INDEX1 <= 80 THEN                                           0120 00071000
         C     INDEX1,@CF00652                                     0120 00072000
         BH    @RF00120                                            0120 00073000
*     DO INDEX1 = INDEX1 - PLACE;                          /*@Z427VLS*/ 00074000
         LR    @08,INDEX1                                          0121 00075000
         SL    @08,PLACE                                           0121 00076000
         LR    INDEX1,@08                                          0121 00077000
*      CALL IFCMSG(65,ADDR(MSGNO));                        /*@Z427VLS*/ 00078000
         LA    @08,MSGNO                                           0122 00079000
         ST    @08,@AFTEMPS+4                                      0122 00080000
         L     @15,ADIFCMSG(,R2)                                   0122 00081000
         LA    @01,@AL00122                                        0122 00082000
         BALR  @14,@15                                             0122 00083000
*      PARMPRT(INDEX1) = STAR;           /* INSERT ASTERISK  @Z427VLS*/ 00084000
         LA    @08,PARMPRT-1(INDEX1)                               0123 00085000
         MVI   0(@08),C'*'                                         0123 00086000
*      PRINTADR = ADDR(PARMPT);                            /*@Z427VLS*/ 00087000
         LA    @08,PARMPT                                          0124 00088000
         ST    @08,PRINTADR(,R2)                                   0124 00089000
*      CALL IOHND(RITEPRTR);                               /*@Z427VLS*/ 00090000
         L     @15,ADIOHND(,R2)                                    0125 00091000
         LA    @01,@AL00125                                        0125 00092000
         BALR  @14,@15                                             0125 00093000
*      RETCODE = TWELVE;                 /* SET RETURN CODE  @Z427VLS*/ 00094000
         MVC   RETCODE(4),@CF00037                                 0126 00095000
*      INDEX1 = INDEX1 + PLACE;                            /*@Z427VLS*/ 00096000
         AL    INDEX1,PLACE                                        0127 00097000
*     END;                                                 /*@Z427VLS*/ 00098000
*   PLACE = ZERO;                                          /*@Z427VLS*/ 00099000
@RF00120 SLR   @08,@08                                             0129 00100000
         ST    @08,PLACE                                           0129 00101000
*   END;                                                   /*@Z427VLS*/ 00102000
@EL00003 DS    0H                                                  0130 00103000
@EF00003 DS    0H                                                  0130 00104000
@ER00003 L     @14,@SA00003                                        0130 00105000
         L     @01,@SA00003+4                                      0130 00106000
         BR    @14                                                 0130 00107000
*/********************************************************************/ 00108000
*/*                                                          @Z427VLS*/ 00109000
*/*  OUTPUT THE TABLE NAME, CONVERT THE ENTRIES IN THE TABLE TO      */ 00110000
*/*  PRINTABLE CHARACTERS, AND OUTPUT THOSE VALUES.          @Z427VLS*/ 00111000
*/********************************************************************/ 00112000
*TABLEOUT: PROC (TABNAME,TABNLEN,TABLEN) OPTIONS(SAVE(1,14));      0131 00113000
TABLEOUT ST    @14,@SA00004                                        0131 00114000
         ST    @01,@SA00004+4                                      0131 00115000
         MVC   @PC00004(12),0(@01)                                 0131 00116000
*      DCL TABNAME CHAR(*);              /* TABLE NAME       @Z427VLS*/ 00117000
*      DCL TABNLEN FIXED(31);            /* TABLE NAME LENGTH        */ 00118000
*      DCL TABLEN  FIXED(31);            /* TABLE LENGTH     @Z427VLS*/ 00119000
*      PRINTADR = ADDR(PARMPT);                            /*@Z427VLS*/ 00120000
         LA    @08,PARMPT                                          0135 00121000
         ST    @08,PRINTADR(,R2)                                   0135 00122000
*      CALL IOHND(RITEPRTR);                               /*@Z427VLS*/ 00123000
         L     @15,ADIOHND(,R2)                                    0136 00124000
         LA    @01,@AL00136                                        0136 00125000
         BALR  @14,@15                                             0136 00126000
*      MSGNO(1:TABNLEN) = TABNAME(1:TABNLEN);              /*@Z427VLS*/ 00127000
         L     @08,@PC00004+4                                      0137 00128000
         L     @08,TABNLEN(,@08)                                   0137 00129000
         BCTR  @08,0                                               0137 00130000
         L     @04,@PC00004                                        0137 00131000
         EX    @08,@SM01184                                        0137 00132000
*      PRINTADR = ADDR(PARMPT);                            /*@Z427VLS*/ 00133000
         LA    @08,PARMPT                                          0138 00134000
         ST    @08,PRINTADR(,R2)                                   0138 00135000
*      CALL IOHND(RITEPRTR);                               /*@Z427VLS*/ 00136000
         L     @15,ADIOHND(,R2)                                    0139 00137000
         LA    @01,@AL00139                                        0139 00138000
         BALR  @14,@15                                             0139 00139000
*      CALL UNPACK(TABLEN);                                /*@Z427VLS*/ 00140000
         L     @08,@PC00004+8                                      0140 00141000
         ST    @08,@AL00001                                        0140 00142000
         LA    @01,@AL00001                                        0140 00143000
         BAL   @14,UNPACK                                          0140 00144000
*      PRINTADR = ADDR(PARMPT);                            /*@Z427VLS*/ 00145000
         LA    @08,PARMPT                                          0141 00146000
         ST    @08,PRINTADR(,R2)                                   0141 00147000
*      CALL IOHND(RITEPRTR);                               /*@Z427VLS*/ 00148000
         L     @15,ADIOHND(,R2)                                    0142 00149000
         LA    @01,@AL00142                                        0142 00150000
         BALR  @14,@15                                             0142 00151000
*    END;                                                  /*@Z427VLS*/ 00152000
@EL00004 DS    0H                                                  0143 00153000
@EF00004 DS    0H                                                  0143 00154000
@ER00004 L     @14,@SA00004                                        0143 00155000
         L     @01,@SA00004+4                                      0143 00156000
         BR    @14                                                 0143 00157000
*/********************************************************************/ 00158000
*/*                                                          @Z427VLS*/ 00159000
*/*  CONVERT THE HEXADECIMAL VALUES IN THE BYTES STRAIGHT TO @Z427VLS*/ 00160000
*/*  CHARACTER REPRESENTATION.                               @Z427VLS*/ 00161000
*/********************************************************************/ 00162000
*UNPACK: PROC (OPLEN) OPTIONS(SAVE(1,14));                 /*@Z427VLS*/ 00163000
UNPACK   ST    @14,@SA00005                                        0144 00164000
         ST    @01,@SA00005+4                                      0144 00165000
         MVC   @PC00005(4),0(@01)                                  0144 00166000
*      DCL OPLEN   FIXED(31);            /* NUMBER OF CHAR TO CONVERT*/ 00167000
*      DO J = 1 TO OPLEN BY 1;                             /*@Z427VLS*/ 00168000
         LA    J,1                                                 0146 00169000
         B     @DE00146                                            0146 00170000
@DL00146 DS    0H                                                  0147 00171000
*        HOLDAREA = HOLDAREA && HOLDAREA;  /* CHEAR HOLD AREA        */ 00172000
         XC    HOLDAREA(5),HOLDAREA                                0147 00173000
*        HOLDAREA(2) = PARMFLD(J);       /* CHARACTERS ARE IN PARMFLD*/ 00174000
         LA    @08,PARMFLD-1(J)                                    0148 00175000
         MVC   HOLDAREA+1(1),0(@08)                                0148 00176000
*        SLL (HOLDAREA(1:2),FOUR);       /* SHIFT FIRST TO FIRST BYTE*/ 00177000
         SLR   @08,@08                                             0149 00178000
         ICM   @08,3,HOLDAREA                                      0149 00179000
         SLL   @08,4                                               0149 00180000
         STCM  @08,3,HOLDAREA                                      0149 00181000
*        SRL (HOLDAREA(2:2),FOUR);       /* SECOND TO SECOND BYTE    */ 00182000
         SLR   @08,@08                                             0150 00183000
         IC    @08,HOLDAREA+1                                      0150 00184000
         SRL   @08,4                                               0150 00185000
         STC   @08,HOLDAREA+1                                      0150 00186000
*        INDEX3 = HOLDAREA(1) + 1;       /* GET VALUE AS INDEX       */ 00187000
         LA    @08,1                                               0151 00188000
         SLR   INDEX3,INDEX3                                       0151 00189000
         IC    INDEX3,HOLDAREA                                     0151 00190000
         ALR   INDEX3,@08                                          0151 00191000
*        PARMPT(2*J+1) = NUMTAB(INDEX3);  /* STORE CHARACTER @Z427VLS*/ 00192000
         LR    @07,J                                               0152 00193000
         ALR   @07,@07                                             0152 00194000
         LA    @03,PARMPT(@07)                                     0152 00195000
         LA    @01,NUMTAB-1(INDEX3)                                0152 00196000
         MVC   0(1,@03),0(@01)                                     0152 00197000
*        INDEX3 = HOLDAREA(2) + 1;       /* GET VALUE AS INDEX       */ 00198000
         SLR   INDEX3,INDEX3                                       0153 00199000
         IC    INDEX3,HOLDAREA+1                                   0153 00200000
         ALR   @08,INDEX3                                          0153 00201000
         LR    INDEX3,@08                                          0153 00202000
*        PARMPT(2*J+2) = NUMTAB(INDEX3);  /* STORE CHARACTER @Z427VLS*/ 00203000
         LA    @08,PARMPT+1(@07)                                   0154 00204000
         LA    @07,NUMTAB-1(INDEX3)                                0154 00205000
         MVC   0(1,@08),0(@07)                                     0154 00206000
*      END;                                                /*@Z427VLS*/ 00207000
         AL    J,@CF00058                                          0155 00208000
@DE00146 L     @08,@PC00005                                        0155 00209000
         C     J,OPLEN(,@08)                                       0155 00210000
         BNH   @DL00146                                            0155 00211000
*      PRINTADR = ADDR(PARMPT);                            /*@Z427VLS*/ 00212000
         LA    @08,PARMPT                                          0156 00213000
         ST    @08,PRINTADR(,R2)                                   0156 00214000
*      CALL IOHND(RITEPRTR);                               /*@Z427VLS*/ 00215000
         L     @15,ADIOHND(,R2)                                    0157 00216000
         LA    @01,@AL00157                                        0157 00217000
         BALR  @14,@15                                             0157 00218000
*   END;                                                   /*@Z427VLS*/ 00219000
@EL00005 DS    0H                                                  0158 00220000
@EF00005 DS    0H                                                  0158 00221000
@ER00005 L     @14,@SA00005                                        0158 00222000
         L     @01,@SA00005+4                                      0158 00223000
         BR    @14                                                 0158 00224000
*/********************************************************************/ 00225000
*/*                                                          @Z427VLS*/ 00226000
*/*  FIND THE SPECIFIED ENTRY IN THE PARAMETER FIELD IN THE DEVICE   */ 00227000
*/*  TABLE. THE DEVICE TABLE ENTRY IS THEN PLACED IN THE DEVICE      */ 00228000
*/*  SELECTION TABLE.                                        @Z427VLS*/ 00229000
*/*  THE DEVICE SPECIFICATION IS EITHER NNXX OR NNNN.        @Z427VLS*/ 00230000
*/*                                                          @Z427VLS*/ 00231000
*/********************************************************************/ 00232000
* FINDDEV: PROC OPTIONS(SAVE(1,14));                       /*@Z427VLS*/ 00233000
FINDDEV  ST    @14,@SA00006                                        0159 00234000
         ST    @01,@SA00006+4                                      0159 00235000
*    IF PARMFLD(INDEX1+2:INDEX1+3) = 'XX' THEN                     0160 00236000
         LA    @08,PARMFLD+1(INDEX1)                               0160 00237000
         CLC   0(2,@08),@CC00759                                   0160 00238000
         BNE   @RF00160                                            0160 00239000
*      DO;                                                 /*@Z427VLS*/ 00240000
*        /*                                                  @Z427VLS*/ 00241000
*        /* CHECK FOR THE DEVICE LEADING TWO CHARACTERS IN THE OBR   */ 00242000
*        /* DEVICE TABLE.  IF IT IS FOUND, THEN CHECK TO SEE IF THE  */ 00243000
*        /* DEVICE WAS SPECIFIED PREVIOUSLY.  IF YES, IT IS AN ERROR.*/ 00244000
*        /* IF NOT, ENTER THE DEVICE CLASS/TYPE INTO DEVICE  @Z427VLS*/ 00245000
*        /* SELECTION TABLE.  CLEAR THE DEVICE CLASS/TYPE FROM       */ 00246000
*        /* DEVTABLE.                                        @Z427VLS*/ 00247000
*        /*                                                  @Z427VLS*/ 00248000
*        J = ZERO;                                         /*@G51DGVS*/ 00249000
         SLR   J,J                                                 0162 00250000
*        DO WHILE (J < EIGHT);                             /*@G51DGVS*/ 00251000
         B     @DE00163                                            0163 00252000
@DL00163 DS    0H                                                  0164 00253000
*          RESPECIFY (R15) RESTRICTED;                     /*@G51DGVS*/ 00254000
*          CALL IFCDEVIC(5,PARMFLD(INDEX1),HOLDAREA);      /*@G51DGVS*/ 00255000
         MVC   @AL00001(12),@AL00165                               0165 00256000
         LA    @14,PARMFLD-1(INDEX1)                               0165 00257000
         ST    @14,@AL00001+4                                      0165 00258000
         L     @15,@CV00760                                        0165 00259000
         LA    @01,@AL00001                                        0165 00260000
         BALR  @14,@15                                             0165 00261000
*          J = R15;                                        /*@G51DGVS*/ 00262000
         LR    J,R15                                               0166 00263000
*          RESPECIFY (R15) UNRESTRICTED;                   /*@G51DGVS*/ 00264000
*          IF J = ZERO THEN                                        0168 00265000
         LTR   J,J                                                 0168 00266000
         BNZ   @RF00168                                            0168 00267000
*            DO INDEX2 = INDEX2 + 1;                       /*@G51DGVS*/ 00268000
         LA    @08,1                                               0169 00269000
         AL    @08,INDEX2                                          0169 00270000
         ST    @08,INDEX2                                          0169 00271000
*              DEVVAL(INDEX2) = HOLDAREA(1:2);             /*@G51DGVS*/ 00272000
         ALR   @08,@08                                             0170 00273000
         L     @07,DEVPTR(,R2)                                     0170 00274000
         ALR   @07,@08                                             0170 00275000
         MVC   DEVVAL-2(2,@07),HOLDAREA                            0170 00276000
*            END;                                          /*@G51DGVS*/ 00277000
*        END;                                              /*@G51DGVS*/ 00278000
@RF00168 DS    0H                                                  0172 00279000
@DE00163 C     J,@CF00068                                          0172 00280000
         BL    @DL00163                                            0172 00281000
*        /*                                                  @Z427VLS*/ 00282000
*        /* CHECK FOR THE DEVICE LEADING TWO CHARACTERS IN THE MDR   */ 00283000
*        /* DEVICE TABLE.  IF IT IS FOUND, THEN CHECK TO SEE IF THE  */ 00284000
*        /* DEVICE WAS SPECIFIED PREVIOUSLY.  IF YES, IT IS AN ERROR.*/ 00285000
*        /* IF NOT, ENTER THE DEVICE CLASS/TYPE INTO DEVICE  @Z427VLS*/ 00286000
*        /* SELECTION TABLE.  CLEAR THE DEVICE CLASS/TYPE FROM       */ 00287000
*        /* DEVTABLE.                                        @Z427VLS*/ 00288000
*        /*                                                  @Z427VLS*/ 00289000
*        J = ZERO;                                         /*@G51DGVS*/ 00290000
         SLR   J,J                                                 0173 00291000
*        DO WHILE (J < EIGHT);                             /*@G51DGVS*/ 00292000
         B     @DE00174                                            0174 00293000
@DL00174 DS    0H                                                  0175 00294000
*          RESPECIFY (R15) RESTRICTED;                     /*@G51DGVS*/ 00295000
*          CALL IFCDEVIC(15,PARMFLD(INDEX1),HOLDAREA);     /*@G51DGVS*/ 00296000
         MVC   @AL00001(12),@AL00176                               0176 00297000
         LA    @14,PARMFLD-1(INDEX1)                               0176 00298000
         ST    @14,@AL00001+4                                      0176 00299000
         L     @15,@CV00760                                        0176 00300000
         LA    @01,@AL00001                                        0176 00301000
         BALR  @14,@15                                             0176 00302000
*          J = R15;                                        /*@G51DGVS*/ 00303000
         LR    J,R15                                               0177 00304000
*          RESPECIFY (R15) UNRESTRICTED;                   /*@G51DGVS*/ 00305000
*          IF J = ZERO THEN                                        0179 00306000
         LTR   J,J                                                 0179 00307000
         BNZ   @RF00179                                            0179 00308000
*            DO INDEX3 = INDEX3 + 1;                       /*@G51DGVS*/ 00309000
         LA    @08,1                                               0180 00310000
         ALR   @08,INDEX3                                          0180 00311000
         LR    INDEX3,@08                                          0180 00312000
*              MDRVAL(INDEX3) = HOLDAREA(1);               /*@G51DGVS*/ 00313000
         L     @08,DEVPTR(,R2)                                     0181 00314000
         ALR   @08,INDEX3                                          0181 00315000
         MVC   MDRVAL-1(1,@08),HOLDAREA                            0181 00316000
*            END;                                          /*@G51DGVS*/ 00317000
*        END;                                              /*@G51DGVS*/ 00318000
@RF00179 DS    0H                                                  0183 00319000
@DE00174 C     J,@CF00068                                          0183 00320000
         BL    @DL00174                                            0183 00321000
*      END;                                                /*@Z427VLS*/ 00322000
*    ELSE                                                          0185 00323000
*      DO;                                                 /*@Z427VLS*/ 00324000
         B     @RC00160                                            0185 00325000
@RF00160 DS    0H                                                  0186 00326000
*        /*                                                  @Z427VLS*/ 00327000
*        /* CHECK FOR THE FOUR DEVICE CHARACTERS IN THE OBR  @Z427VLS*/ 00328000
*        /* DEVICE TABLE.  IF IT IS FOUND, THEN CHECK TO SEE IF THE  */ 00329000
*        /* DEVICE WAS SPECIFIED PREVIOUSLY.  IF YES, IT IS AN ERROR.*/ 00330000
*        /* IF NOT, ENTER THE DEVICE CLASS/TYPE INTO DEVICE  @Z427VLS*/ 00331000
*        /* SELECTION TABLE.  CLEAR THE DEVICE CLASS/TYPE FROM       */ 00332000
*        /* DEVTABLE.                                        @Z427VLS*/ 00333000
*        /*                                                  @Z427VLS*/ 00334000
*        J = ZERO;                                         /*@G51DGVS*/ 00335000
         SLR   J,J                                                 0186 00336000
*        DO WHILE (J < EIGHT);                             /*@G51DGVS*/ 00337000
         B     @DE00187                                            0187 00338000
@DL00187 DS    0H                                                  0188 00339000
*          RESPECIFY (R15) RESTRICTED;                     /*@G51DGVS*/ 00340000
*          CALL IFCDEVIC(1,PARMFLD(INDEX1),HOLDAREA);      /*@G51DGVS*/ 00341000
         MVC   @AL00001(12),@AL00189                               0189 00342000
         LA    @14,PARMFLD-1(INDEX1)                               0189 00343000
         ST    @14,@AL00001+4                                      0189 00344000
         L     @15,@CV00760                                        0189 00345000
         LA    @01,@AL00001                                        0189 00346000
         BALR  @14,@15                                             0189 00347000
*          J = R15;                                        /*@G51DGVS*/ 00348000
         LR    J,R15                                               0190 00349000
*          RESPECIFY (R15) UNRESTRICTED;                   /*@G51DGVS*/ 00350000
*          IF J = ZERO THEN                                        0192 00351000
         LTR   J,J                                                 0192 00352000
         BNZ   @RF00192                                            0192 00353000
*            DO INDEX2 = INDEX2 + 1;                       /*@G51DGVS*/ 00354000
         LA    @08,1                                               0193 00355000
         AL    @08,INDEX2                                          0193 00356000
         ST    @08,INDEX2                                          0193 00357000
*              DEVVAL(INDEX2) = HOLDAREA(1:2);             /*@G51DGVS*/ 00358000
         ALR   @08,@08                                             0194 00359000
         L     @07,DEVPTR(,R2)                                     0194 00360000
         ALR   @07,@08                                             0194 00361000
         MVC   DEVVAL-2(2,@07),HOLDAREA                            0194 00362000
*            END;                                          /*@G51DGVS*/ 00363000
*        END;                                              /*@G51DGVS*/ 00364000
@RF00192 DS    0H                                                  0196 00365000
@DE00187 C     J,@CF00068                                          0196 00366000
         BL    @DL00187                                            0196 00367000
*        /*                                                  @Z427VLS*/ 00368000
*        /* CHECK FOR THE FOUR DEVICE CHARACTERS IN THE MDR  @Z427VLS*/ 00369000
*        /* DEVICE TABLE.  IF IT IS FOUND, THEN CHECK TO SEE IF THE  */ 00370000
*        /* DEVICE WAS SPECIFIED PREVIOUSLY.  IF YES, IT IS AN ERROR.*/ 00371000
*        /* IF NOT, ENTER THE DEVICE CLASS/TYPE INTO DEVICE  @Z427VLS*/ 00372000
*        /* SELECTION TABLE.  CLEAR THE DEVICE CLASS/TYPE FROM       */ 00373000
*        /* DEVTABLE.                                        @Z427VLS*/ 00374000
*        /*                                                  @Z427VLS*/ 00375000
*        J = ZERO;                                         /*@G51DGVS*/ 00376000
         SLR   J,J                                                 0197 00377000
*        DO WHILE (J < EIGHT);                             /*@G51DGVS*/ 00378000
         B     @DE00198                                            0198 00379000
@DL00198 DS    0H                                                  0199 00380000
*          RESPECIFY (R15) RESTRICTED;                     /*@G51DGVS*/ 00381000
*          CALL IFCDEVIC(11,PARMFLD(INDEX1),HOLDAREA);     /*@G51DGVS*/ 00382000
         MVC   @AL00001(12),@AL00200                               0200 00383000
         LA    @14,PARMFLD-1(INDEX1)                               0200 00384000
         ST    @14,@AL00001+4                                      0200 00385000
         L     @15,@CV00760                                        0200 00386000
         LA    @01,@AL00001                                        0200 00387000
         BALR  @14,@15                                             0200 00388000
*          J = R15;                                        /*@G51DGVS*/ 00389000
         LR    J,R15                                               0201 00390000
*          RESPECIFY (R15) UNRESTRICTED;                   /*@G51DGVS*/ 00391000
*          IF J = ZERO THEN                                        0203 00392000
         LTR   J,J                                                 0203 00393000
         BNZ   @RF00203                                            0203 00394000
*            DO INDEX3 = INDEX3 + 1;                       /*@G51DGVS*/ 00395000
         LA    @08,1                                               0204 00396000
         ALR   @08,INDEX3                                          0204 00397000
         LR    INDEX3,@08                                          0204 00398000
*              MDRVAL(INDEX3) = HOLDAREA(1);               /*@G51DGVS*/ 00399000
         L     @08,DEVPTR(,R2)                                     0205 00400000
         ALR   @08,INDEX3                                          0205 00401000
         MVC   MDRVAL-1(1,@08),HOLDAREA                            0205 00402000
*            END;                                          /*@G51DGVS*/ 00403000
*        END;                                              /*@G51DGVS*/ 00404000
@RF00203 DS    0H                                                  0207 00405000
@DE00198 C     J,@CF00068                                          0207 00406000
         BL    @DL00198                                            0207 00407000
*      END;                                                /*@Z427VLS*/ 00408000
*    INDEX1 = INDEX1 + 5;                 /* INCR TO NEXT OPERAND    */ 00409000
@RC00160 AL    INDEX1,@CF00081                                     0209 00410000
* END;                                                     /*@Z427VLS*/ 00411000
@EL00006 DS    0H                                                  0210 00412000
@EF00006 DS    0H                                                  0210 00413000
@ER00006 L     @14,@SA00006                                        0210 00414000
         L     @01,@SA00006+4                                      0210 00415000
         BR    @14                                                 0210 00416000
*/********************************************************************/ 00417000
*/*                                                          @Z427VLS*/ 00418000
*/*  VALID THE FIELD STARTING AT PARMFLD(INDEX1) FOR A LENGTH AS     */ 00419000
*/*  GIVEN AS THE INPUT PARAMETER.  IF A CHARACTER IS NOT FOUND TO   */ 00420000
*/*  BE A VALID NUMERIC, THE FIELD IS INDICATED AS HAVING A SYNTAX   */ 00421000
*/*  ERROR.  THE CONTENTS OF THE ORIGINAL FIELD ARE CHANGED TO THE   */ 00422000
*/*  HEXADECIMAL EQUIVALENT FOR THE CHARACTER.  THOSE VALUES CAN THEN*/ 00423000
*/*  BE EASILY CONVERTED FOR THE NECESSARY FIELD.            @Z427VLS*/ 00424000
*/*                                                          @Z427VLS*/ 00425000
*/********************************************************************/ 00426000
* VALIDNUM: PROC (LENGTHV) OPTIONS(SAVE(1,14));            /*@Z427VLS*/ 00427000
VALIDNUM ST    @14,@SA00007                                        0211 00428000
         ST    @01,@SA00007+4                                      0211 00429000
         MVC   @PC00007(4),0(@01)                                  0211 00430000
*    DCL LENGTHV FIXED(31);               /* LENGTH OF THE INPUT FLD */ 00431000
*    I = INDEX1 + LENGTHV - 1;            /* LAST CHARACTER POSITION */ 00432000
         L     @08,@PC00007                                        0213 00433000
         LR    @04,INDEX1                                          0213 00434000
         AL    @04,LENGTHV(,@08)                                   0213 00435000
         BCTR  @04,0                                               0213 00436000
         ST    @04,I                                               0213 00437000
*    DO INDEX3 = INDEX1 TO I BY 1;                         /*@Z427VLS*/ 00438000
         LR    INDEX3,INDEX1                                       0214 00439000
         B     @DE00214                                            0214 00440000
@DL00214 DS    0H                                                  0215 00441000
*      VALID = OFF;                                        /*@Z427VLS*/ 00442000
         NI    VALID,B'01111111'                                   0215 00443000
*      /*                                                    @Z427VLS*/ 00444000
*      /* CHECK TO SEE IF THE FIELD IS A VALID DECIMAL NUMBER.  IF   */ 00445000
*      /* YES, TERMINATE THE SEARCH AND REPLACE THE CHARACTER WITH   */ 00446000
*      /* HEXADECIMAL EQUIVALENT.  IF NO, PRINT AN ERROR MESSAGE FOR */ 00447000
*      /* THIS OPERAND.                                      @Z427VLS*/ 00448000
*      /*                                                    @Z427VLS*/ 00449000
*      DO J = 10 TO 1 BY -1 WHILE (VALID = OFF);           /*@Z427VLS*/ 00450000
         LA    J,10                                                0216 00451000
@DL00216 TM    VALID,B'10000000'                                   0216 00452000
         BNZ   @DC00216                                            0216 00453000
*        IF PARMFLD(INDEX3) = NUMTAB(J) THEN                       0217 00454000
         LA    @08,PARMFLD-1(INDEX3)                               0217 00455000
         LA    @07,NUMTAB-1(J)                                     0217 00456000
         CLC   0(1,@08),0(@07)                                     0217 00457000
         BNE   @RF00217                                            0217 00458000
*          DO;                                             /*@Z427VLS*/ 00459000
*            VALID = ON;                                   /*@Z427VLS*/ 00460000
         OI    VALID,B'10000000'                                   0219 00461000
*            PARMFLD(INDEX3) = HEXTAB(J);                  /*@Z427VLS*/ 00462000
         LA    @08,PARMFLD-1(INDEX3)                               0220 00463000
         LA    @07,HEXTAB-1(J)                                     0220 00464000
         MVC   0(1,@08),0(@07)                                     0220 00465000
*          END;                                            /*@Z427VLS*/ 00466000
*      END;                                                /*@Z427VLS*/ 00467000
@RF00217 BCTR  J,0                                                 0222 00468000
         LTR   J,J                                                 0222 00469000
         BP    @DL00216                                            0222 00470000
@DC00216 DS    0H                                                  0223 00471000
*      IF VALID = OFF THEN                                         0223 00472000
         TM    VALID,B'10000000'                                   0223 00473000
         BNZ   @RF00223                                            0223 00474000
*        DO PLACE = INDEX1 - INDEX3;                       /*@Z427VLS*/ 00475000
         LR    @08,INDEX1                                          0224 00476000
         SLR   @08,INDEX3                                          0224 00477000
         ST    @08,PLACE                                           0224 00478000
*          CALL OUTMSG(SYNTAX);                            /*@Z427VLS*/ 00479000
         LA    @01,@AL00225                                        0225 00480000
         BAL   @14,OUTMSG                                          0225 00481000
*        END;                                              /*@Z427VLS*/ 00482000
*    END;                                                  /*@Z427VLS*/ 00483000
@RF00223 AL    INDEX3,@CF00058                                     0227 00484000
@DE00214 C     INDEX3,I                                            0227 00485000
         BNH   @DL00214                                            0227 00486000
* END;                                                     /*@Z427VLS*/ 00487000
@EL00007 DS    0H                                                  0228 00488000
@EF00007 DS    0H                                                  0228 00489000
@ER00007 L     @14,@SA00007                                        0228 00490000
         L     @01,@SA00007+4                                      0228 00491000
         BR    @14                                                 0228 00492000
*/********************************************************************/ 00493000
*/*                                                          @Z427VLS*/ 00494000
*/*  PACK A FIELD OF A GIVEN LENGTH INTO THE VARIABLE HOLD.  THE     */ 00495000
*/*  INPUT IS ASSUMED TO BE HEX CHARACTERS, WITH A LEADING ZERO FOR  */ 00496000
*/*  EACH TWO DIGITS.                                        @Z427VLS*/ 00497000
*/********************************************************************/ 00498000
*HEXPACK: PROC (HEXLEN) OPTIONS(SAVE(1,14));               /*@Z427VLS*/ 00499000
HEXPACK  ST    @14,12(,@13)                                        0229 00500000
         ST    @01,24(,@13)                                        0229 00501000
         MVC   @PC00008(4),0(@01)                                  0229 00502000
*   DCL HEXLEN FIXED(31);                                  /*@Z427VLS*/ 00503000
*   INDEX3 = HEXLEN / 2;                                   /*@Z427VLS*/ 00504000
         L     @08,@PC00008                                        0231 00505000
         L     @00,HEXLEN(,@08)                                    0231 00506000
         SRDA  @00,32                                              0231 00507000
         D     @00,@CF00076                                        0231 00508000
         LR    INDEX3,@01                                          0231 00509000
*   DO I = 1 TO INDEX3 BY 1;                               /*@Z427VLS*/ 00510000
         LA    @08,1                                               0232 00511000
         ST    @08,I                                               0232 00512000
         B     @DE00232                                            0232 00513000
@DL00232 DS    0H                                                  0233 00514000
*     /*                                                     @Z427VLS*/ 00515000
*     /* THE DATA IN PARMFLD IS ACCESSED TWO CHARACTERS AT A TIME.   */ 00516000
*     /* THE FIRST CHARACTER IS SHIFTED LEFT FOUR BITS AND THEN ORED */ 00517000
*     /* WITH THE SECOND CHARACTER.  THE SECOND CHARACTER IS ASSUMED */ 00518000
*     /* TO HAVE THE FIRST FOUR BITS AS ZEROES.              @Z427VLS*/ 00519000
*     /*                                                     @Z427VLS*/ 00520000
*     HOLD(I) = PARMFLD(INDEX1);                           /*@Z427VLS*/ 00521000
         LA    @07,HOLD-1(@08)                                     0233 00522000
         LA    @04,PARMFLD-1(INDEX1)                               0233 00523000
         MVC   0(1,@07),0(@04)                                     0233 00524000
*     SLL (HOLD(I),FOUR);                                  /*@Z427VLS*/ 00525000
         SLR   @07,@07                                             0234 00526000
         IC    @07,HOLD-1(@08)                                     0234 00527000
         SLL   @07,4                                               0234 00528000
         STC   @07,HOLD-1(@08)                                     0234 00529000
*     HOLD(I) = HOLD(I) | PARMFLD(INDEX1 + 1);             /*@Z427VLS*/ 00530000
         LA    @07,HOLD-1(@08)                                     0235 00531000
         LA    @04,PARMFLD(INDEX1)                                 0235 00532000
         OC    0(1,@07),0(@04)                                     0235 00533000
*     INDEX1 = INDEX1 + 2;                                 /*@Z427VLS*/ 00534000
         AL    INDEX1,@CF00076                                     0236 00535000
*   END;                                                   /*@Z427VLS*/ 00536000
         AL    @08,@CF00058                                        0237 00537000
         ST    @08,I                                               0237 00538000
@DE00232 CR    @08,INDEX3                                          0237 00539000
         BNH   @DL00232                                            0237 00540000
*END;                                                      /*@Z427VLS*/ 00541000
@EL00008 DS    0H                                                  0238 00542000
@EF00008 DS    0H                                                  0238 00543000
@ER00008 L     @14,12(,@13)                                        0238 00544000
         L     @01,24(,@13)                                        0238 00545000
         BR    @14                                                 0238 00546000
*/********************************************************************/ 00547000
*/*                                                          @Z427VLS*/ 00548000
*/*  OUTPUT THE LINE IN  PARMPT TO THE TOURIST DATA SET. RESET THE   */ 00549000
*/*  STARTING VALUE FOR PACKING THE CHARACTERS AND INDICATE NO       */ 00550000
*/*  LEADING COMMA.                                          @Z427VLS*/ 00551000
*/*                                                          @Z427VLS*/ 00552000
*/********************************************************************/ 00553000
*OUTLINE: PROC OPTIONS(SAVE(1,14));                        /*@Z427VLS*/ 00554000
OUTLINE  ST    @14,@SA00009                                        0239 00555000
         ST    @01,@SA00009+4                                      0239 00556000
*  PRINTADR = ADDR(PARMPT);                                /*@Z427VLS*/ 00557000
         LA    @08,PARMPT                                          0240 00558000
         ST    @08,PRINTADR(,R2)                                   0240 00559000
*  CALL IOHND(RITEPRTR);                                   /*@Z427VLS*/ 00560000
         L     @15,ADIOHND(,R2)                                    0241 00561000
         LA    @01,@AL00241                                        0241 00562000
         BALR  @14,@15                                             0241 00563000
*  INDEX3 = 6;                                             /*@Z427VLS*/ 00564000
         LA    INDEX3,6                                            0242 00565000
*  NOCOMMA = ON;                                           /*@Z427VLS*/ 00566000
         OI    NOCOMMA,B'00001000'                                 0243 00567000
*END;                                                      /*@Z427VLS*/ 00568000
@EL00009 DS    0H                                                  0244 00569000
@EF00009 DS    0H                                                  0244 00570000
@ER00009 L     @14,@SA00009                                        0244 00571000
         L     @01,@SA00009+4                                      0244 00572000
         BR    @14                                                 0244 00573000
*/********************************************************************/ 00574000
*/*                                                          @Z427VLS*/ 00575000
*/*  TAKE THE CHARACTER STRING FOR THE LENGTH OF WORDLEN AND PLACE   */ 00576000
*/*  IT IN THE OUTPUT LINE.  A COMMA IS FIRST INSERTED, IF NOCOMMA   */ 00577000
*/*  IS TURNED OFF.  IF THE CHARACTER STRING WILL NOT FIT, THEN THE  */ 00578000
*/*  OUTPUT LINE IS WRITTEN OUT, AND A NEW LINE IS STARTED.  @Z427VLS*/ 00579000
*/*                                                          @Z427VLS*/ 00580000
*/********************************************************************/ 00581000
*WORDPAK2: PROC (WORDLEN,WORDSTR) OPTIONS(SAVE(1,14));     /*@Z427VLS*/ 00582000
WORDPAK2 ST    @14,@SA00010                                        0245 00583000
         ST    @01,@SA00010+4                                      0245 00584000
         MVC   @PC00010(8),0(@01)                                  0245 00585000
*  DCL WORDLEN FIXED(31);                                  /*@Z427VLS*/ 00586000
*  DCL WORDSTR CHAR(*);                                    /*@Z427VLS*/ 00587000
*  IF (INDEX3+WORDLEN+1) > 130 THEN                                0248 00588000
         L     @08,@PC00010                                        0248 00589000
         LR    @07,INDEX3                                          0248 00590000
         AL    @07,WORDLEN(,@08)                                   0248 00591000
         AL    @07,@CF00058                                        0248 00592000
         C     @07,@CF00786                                        0248 00593000
         BNH   @RF00248                                            0248 00594000
*    DO;                                                   /*@Z427VLS*/ 00595000
*      IF NOCOMMA = OFF THEN                                       0250 00596000
         TM    NOCOMMA,B'00001000'                                 0250 00597000
         BNZ   @RF00250                                            0250 00598000
*        PARMPT(INDEX3) = COMMA;                           /*@Z427VLS*/ 00599000
         LA    @08,PARMPT-1(INDEX3)                                0251 00600000
         MVI   0(@08),C','                                         0251 00601000
*      CALL OUTLINE;                                       /*@Z427VLS*/ 00602000
@RF00250 BAL   @14,OUTLINE                                         0252 00603000
*    END;                                                  /*@Z427VLS*/ 00604000
*  IF NOCOMMA = OFF THEN                                           0254 00605000
@RF00248 TM    NOCOMMA,B'00001000'                                 0254 00606000
         BNZ   @RF00254                                            0254 00607000
*    DO;                                                   /*@Z427VLS*/ 00608000
*      PARMPT(INDEX3) = COMMA;                             /*@Z427VLS*/ 00609000
         LA    @08,PARMPT-1(INDEX3)                                0256 00610000
         MVI   0(@08),C','                                         0256 00611000
*      INDEX3 = INDEX3 + 1;                                /*@Z427VLS*/ 00612000
         AL    INDEX3,@CF00058                                     0257 00613000
*    END;                                                  /*@Z427VLS*/ 00614000
*  PARMPT(INDEX3:INDEX3+WORDLEN-1) = WORDSTR(1:WORDLEN);   /*@Z427VLS*/ 00615000
@RF00254 LA    @08,PARMPT-1(INDEX3)                                0259 00616000
         L     @07,@PC00010                                        0259 00617000
         L     @07,WORDLEN(,@07)                                   0259 00618000
         LR    @03,@07                                             0259 00619000
         BCTR  @03,0                                               0259 00620000
         L     @15,@PC00010+4                                      0259 00621000
         EX    @03,@SM01189                                        0259 00622000
*  INDEX3 = INDEX3 + WORDLEN;                              /*@Z427VLS*/ 00623000
         ALR   INDEX3,@07                                          0260 00624000
*  NOCOMMA = OFF;                                          /*@Z427VLS*/ 00625000
         NI    NOCOMMA,B'11110111'                                 0261 00626000
*END;                                                      /*@Z427VLS*/ 00627000
@EL00010 DS    0H                                                  0262 00628000
@EF00010 DS    0H                                                  0262 00629000
@ER00010 L     @14,@SA00010                                        0262 00630000
         L     @01,@SA00010+4                                      0262 00631000
         BR    @14                                                 0262 00632000
*/********************************************************************/ 00633000
*/*                                                          @Z427VLS*/ 00634000
*/*  TAKE THE CHARACTER STRING FOR THE LENGTH OF WORDLEN AND PLACE   */ 00635000
*/*  IT IN THE OUTPUT LINE.  IF THE CHARACTER STRING WILL NOT FIT,   */ 00636000
*/*  THEN THE OUTPUT LINE IS WRITTEN OUT, AND A NEW LINE IS STARTED. */ 00637000
*/*                                                          @Z427VLS*/ 00638000
*/********************************************************************/ 00639000
*WORDPAK1: PROC (WORDLEN1,WORDSTR1) OPTIONS(SAVE(1,14));   /*@Z427VLS*/ 00640000
WORDPAK1 ST    @14,@SA00011                                        0263 00641000
         ST    @01,@SA00011+4                                      0263 00642000
         MVC   @PC00011(8),0(@01)                                  0263 00643000
*  DCL WORDLEN1 FIXED(31);                                 /*@Z427VLS*/ 00644000
*  DCL WORDSTR1 CHAR(*);                                   /*@Z427VLS*/ 00645000
*  IF (INDEX3+WORDLEN1+1) > 130 THEN                               0266 00646000
         L     @08,@PC00011                                        0266 00647000
         LR    @07,INDEX3                                          0266 00648000
         AL    @07,WORDLEN1(,@08)                                  0266 00649000
         AL    @07,@CF00058                                        0266 00650000
         C     @07,@CF00786                                        0266 00651000
         BNH   @RF00266                                            0266 00652000
*    CALL OUTLINE;                                         /*@Z427VLS*/ 00653000
         BAL   @14,OUTLINE                                         0267 00654000
*  PARMPT(INDEX3:INDEX3+WORDLEN1-1) = WORDSTR1(1:WORDLEN1);/*@Z427VLS*/ 00655000
@RF00266 LA    @08,PARMPT-1(INDEX3)                                0268 00656000
         L     @07,@PC00011                                        0268 00657000
         L     @07,WORDLEN1(,@07)                                  0268 00658000
         LR    @03,@07                                             0268 00659000
         BCTR  @03,0                                               0268 00660000
         L     @15,@PC00011+4                                      0268 00661000
         EX    @03,@SM01192                                        0268 00662000
*  INDEX3 = INDEX3 + WORDLEN1;                             /*@Z427VLS*/ 00663000
         ALR   INDEX3,@07                                          0269 00664000
*END;                                                      /*@Z427VLS*/ 00665000
@EL00011 DS    0H                                                  0270 00666000
@EF00011 DS    0H                                                  0270 00667000
@ER00011 L     @14,@SA00011                                        0270 00668000
         L     @01,@SA00011+4                                      0270 00669000
         BR    @14                                                 0270 00670000
*/********************************************************************/ 00671000
*/*                                                          @Z427VLS*/ 00672000
*/*  PACK THE HEXADECIMAL CHARACTER INTO TWO PRINTABLE CHARACTERS.   */ 00673000
*/*  THE HEX CHARACTER IS IN HOLDAREA(2), THE RESULT IS PLACED IN    */ 00674000
*/*  KEYWORD, INDEXED BY THE VARIABLE J.                     @Z427VLS*/ 00675000
*/*                                                          @Z427VLS*/ 00676000
*/********************************************************************/ 00677000
*CHARPACK: PROC OPTIONS(SAVE(1,14));                       /*@Z427VLS*/ 00678000
CHARPACK ST    @14,12(,@13)                                        0271 00679000
         ST    @01,24(,@13)                                        0271 00680000
*  SLL (HOLDAREA(1:2),FOUR);                               /*@Z427VLS*/ 00681000
         SLR   @08,@08                                             0272 00682000
         ICM   @08,3,HOLDAREA                                      0272 00683000
         SLL   @08,4                                               0272 00684000
         STCM  @08,3,HOLDAREA                                      0272 00685000
*  SRL (HOLDAREA(2:2),FOUR);                               /*@Z427VLS*/ 00686000
         SLR   @08,@08                                             0273 00687000
         IC    @08,HOLDAREA+1                                      0273 00688000
         SRL   @08,4                                               0273 00689000
         STC   @08,HOLDAREA+1                                      0273 00690000
*  INDEX2 = HOLDAREA(1) + 1;                               /*@Z427VLS*/ 00691000
         LA    @08,1                                               0274 00692000
         SLR   @07,@07                                             0274 00693000
         IC    @07,HOLDAREA                                        0274 00694000
         ALR   @07,@08                                             0274 00695000
         ST    @07,INDEX2                                          0274 00696000
*  KEYWORD(2*J-1) = NUMTAB(INDEX2);                        /*@Z427VLS*/ 00697000
         LR    @03,J                                               0275 00698000
         ALR   @03,@03                                             0275 00699000
         LA    @01,KEYWORD-2(@03)                                  0275 00700000
         LA    @15,NUMTAB-1(@07)                                   0275 00701000
         MVC   0(1,@01),0(@15)                                     0275 00702000
*  INDEX2 = HOLDAREA(2) + 1;                               /*@Z427VLS*/ 00703000
         SLR   @07,@07                                             0276 00704000
         IC    @07,HOLDAREA+1                                      0276 00705000
         ALR   @08,@07                                             0276 00706000
         ST    @08,INDEX2                                          0276 00707000
*  KEYWORD(2*J) = NUMTAB(INDEX2);                          /*@Z427VLS*/ 00708000
         LA    @07,KEYWORD-1(@03)                                  0277 00709000
         LA    @03,NUMTAB-1(@08)                                   0277 00710000
         MVC   0(1,@07),0(@03)                                     0277 00711000
*END;                                                      /*@Z427VLS*/ 00712000
@EL00012 DS    0H                                                  0278 00713000
@EF00012 DS    0H                                                  0278 00714000
@ER00012 L     @14,12(,@13)                                        0278 00715000
         L     @01,24(,@13)                                        0278 00716000
         BR    @14                                                 0278 00717000
*/********************************************************************/ 00718000
*/*                                                          @Z427VLS*/ 00719000
*/*  CONVERT THE HEXADECIMAL CHARACTERS TO PRINT ABLE  CHARACTERS.   */ 00720000
*/*  THE VALUE TO CONVERT IS PLACED IN HOLDAREA(2).  THE ROUTINE     */ 00721000
*/*  CHARPACK IS CALLED TO CONVERT IT, FOLLOWED BY WORDPAK1 TO       */ 00722000
*/*  OUTPUT TO THE PRINT LINE WITH NO LEADING COMMA.         @Z427VLS*/ 00723000
*/*                                                          @Z427VLS*/ 00724000
*/********************************************************************/ 00725000
*WORDCON1: PROC (WORDLEN2,WORDSTR2) OPTIONS(SAVE(1,14));   /*@Z427VLS*/ 00726000
WORDCON1 ST    @14,@SA00013                                        0279 00727000
         ST    @01,@SA00013+4                                      0279 00728000
         MVC   @PC00013(8),0(@01)                                  0279 00729000
*    DCL WORDLEN2 FIXED(31);                               /*@Z427VLS*/ 00730000
*    DCL WORDSTR2 CHAR(*);                                 /*@Z427VLS*/ 00731000
*    DO I = 1 TO WORDLEN2 BY 1;                            /*@Z427VLS*/ 00732000
         LA    @08,1                                               0282 00733000
         ST    @08,I                                               0282 00734000
         B     @DE00282                                            0282 00735000
@DL00282 DS    0H                                                  0283 00736000
*      HOLDAREA(1) = HEXZERO;                              /*@Z427VLS*/ 00737000
         MVI   HOLDAREA,X'00'                                      0283 00738000
*      HOLDAREA(2) = WORDSTR2(I);                          /*@Z427VLS*/ 00739000
         L     @07,@PC00013+4                                      0284 00740000
         ALR   @07,@08                                             0284 00741000
         BCTR  @07,0                                               0284 00742000
         MVC   HOLDAREA+1(1),WORDSTR2(@07)                         0284 00743000
*      SLL (HOLDAREA(1:2),FOUR);                           /*@Z427VLS*/ 00744000
         SLR   @07,@07                                             0285 00745000
         ICM   @07,3,HOLDAREA                                      0285 00746000
         SLL   @07,4                                               0285 00747000
         STCM  @07,3,HOLDAREA                                      0285 00748000
*      SRL (HOLDAREA(2:2),FOUR);                           /*@Z427VLS*/ 00749000
         SLR   @07,@07                                             0286 00750000
         IC    @07,HOLDAREA+1                                      0286 00751000
         SRL   @07,4                                               0286 00752000
         STC   @07,HOLDAREA+1                                      0286 00753000
*      INDEX2 = HOLDAREA(1) + 1;                           /*@Z427VLS*/ 00754000
         LA    @07,1                                               0287 00755000
         SLR   @03,@03                                             0287 00756000
         IC    @03,HOLDAREA                                        0287 00757000
         ALR   @03,@07                                             0287 00758000
         ST    @03,INDEX2                                          0287 00759000
*      KEYWORD(2*I-1) = NUMTAB(INDEX2);                    /*@Z427VLS*/ 00760000
         LR    @15,@08                                             0288 00761000
         ALR   @15,@15                                             0288 00762000
         LA    @14,KEYWORD-2(@15)                                  0288 00763000
         LA    @01,NUMTAB-1(@03)                                   0288 00764000
         MVC   0(1,@14),0(@01)                                     0288 00765000
*      INDEX2 = HOLDAREA(2) + 1;                           /*@Z427VLS*/ 00766000
         SLR   @03,@03                                             0289 00767000
         IC    @03,HOLDAREA+1                                      0289 00768000
         ALR   @07,@03                                             0289 00769000
         ST    @07,INDEX2                                          0289 00770000
*      KEYWORD(2*I) = NUMTAB(INDEX2);                      /*@Z427VLS*/ 00771000
         LA    @03,KEYWORD-1(@15)                                  0290 00772000
         LA    @01,NUMTAB-1(@07)                                   0290 00773000
         MVC   0(1,@03),0(@01)                                     0290 00774000
*    END;                                                  /*@Z427VLS*/ 00775000
         AL    @08,@CF00058                                        0291 00776000
         ST    @08,I                                               0291 00777000
@DE00282 L     @07,@PC00013                                        0291 00778000
         C     @08,WORDLEN2(,@07)                                  0291 00779000
         BNH   @DL00282                                            0291 00780000
*    INDEX2 = 2*WORDLEN2;                                  /*@Z427VLS*/ 00781000
         L     @08,@PC00013                                        0292 00782000
         L     @08,WORDLEN2(,@08)                                  0292 00783000
         ALR   @08,@08                                             0292 00784000
         ST    @08,INDEX2                                          0292 00785000
*    CALL WORDPAK1(INDEX2,KEYWORD);                        /*@Z427VLS*/ 00786000
         LA    @01,@AL00293                                        0293 00787000
         BAL   @14,WORDPAK1                                        0293 00788000
*END;                                                      /*@Z427VLS*/ 00789000
@EL00013 DS    0H                                                  0294 00790000
@EF00013 DS    0H                                                  0294 00791000
@ER00013 L     @14,@SA00013                                        0294 00792000
         L     @01,@SA00013+4                                      0294 00793000
         BR    @14                                                 0294 00794000
*/********************************************************************/ 00795000
*/*                                                          @Z427VLS*/ 00796000
*/*  CONVERT THE HEXADECIMAL CHARACTERS TO PRINT ABLE  CHARACTERS.   */ 00797000
*/*  THE VALUE TO CONVERT IS PLACED IN HOLDAREA(2).  THE ROUTINE     */ 00798000
*/*  CHARPACK IS CALLED TO CONVERT IT, FOLLOWED BY WORDPAK1 TO       */ 00799000
*/*  OUTPUT TO THE PRINT LINE WITH NO LEADING COMMA.         @Z427VLS*/ 00800000
*/*                                                          @Z427VLS*/ 00801000
*/********************************************************************/ 00802000
*WORDCON2: PROC (WORDLEN3,WORDSTR3) OPTIONS(SAVE(1,14));   /*@Z427VLS*/ 00803000
WORDCON2 ST    @14,@SA00014                                        0295 00804000
         ST    @01,@SA00014+4                                      0295 00805000
         MVC   @PC00014(8),0(@01)                                  0295 00806000
*    DCL WORDLEN3 FIXED(31);                               /*@Z427VLS*/ 00807000
*    DCL WORDSTR3 CHAR(*);                                 /*@Z427VLS*/ 00808000
*    DO I = 1 TO WORDLEN3 BY 1;                            /*@Z427VLS*/ 00809000
         LA    @08,1                                               0298 00810000
         ST    @08,I                                               0298 00811000
         B     @DE00298                                            0298 00812000
@DL00298 DS    0H                                                  0299 00813000
*      HOLDAREA(1) = HEXZERO;                              /*@Z427VLS*/ 00814000
         MVI   HOLDAREA,X'00'                                      0299 00815000
*      HOLDAREA(2) = WORDSTR3(I);                          /*@Z427VLS*/ 00816000
         L     @07,@PC00014+4                                      0300 00817000
         ALR   @07,@08                                             0300 00818000
         BCTR  @07,0                                               0300 00819000
         MVC   HOLDAREA+1(1),WORDSTR3(@07)                         0300 00820000
*      SLL (HOLDAREA(1:2),FOUR);                           /*@Z427VLS*/ 00821000
         SLR   @07,@07                                             0301 00822000
         ICM   @07,3,HOLDAREA                                      0301 00823000
         SLL   @07,4                                               0301 00824000
         STCM  @07,3,HOLDAREA                                      0301 00825000
*      SRL (HOLDAREA(2:2),FOUR);                           /*@Z427VLS*/ 00826000
         SLR   @07,@07                                             0302 00827000
         IC    @07,HOLDAREA+1                                      0302 00828000
         SRL   @07,4                                               0302 00829000
         STC   @07,HOLDAREA+1                                      0302 00830000
*      INDEX2 = HOLDAREA(1) + 1;                           /*@Z427VLS*/ 00831000
         LA    @07,1                                               0303 00832000
         SLR   @03,@03                                             0303 00833000
         IC    @03,HOLDAREA                                        0303 00834000
         ALR   @03,@07                                             0303 00835000
         ST    @03,INDEX2                                          0303 00836000
*      KEYWORD(2*I-1) = NUMTAB(INDEX2);                    /*@Z427VLS*/ 00837000
         LR    @15,@08                                             0304 00838000
         ALR   @15,@15                                             0304 00839000
         LA    @14,KEYWORD-2(@15)                                  0304 00840000
         LA    @01,NUMTAB-1(@03)                                   0304 00841000
         MVC   0(1,@14),0(@01)                                     0304 00842000
*      INDEX2 = HOLDAREA(2) + 1;                           /*@Z427VLS*/ 00843000
         SLR   @03,@03                                             0305 00844000
         IC    @03,HOLDAREA+1                                      0305 00845000
         ALR   @07,@03                                             0305 00846000
         ST    @07,INDEX2                                          0305 00847000
*      KEYWORD(2*I) = NUMTAB(INDEX2);                      /*@Z427VLS*/ 00848000
         LA    @03,KEYWORD-1(@15)                                  0306 00849000
         LA    @01,NUMTAB-1(@07)                                   0306 00850000
         MVC   0(1,@03),0(@01)                                     0306 00851000
*    END;                                                  /*@Z427VLS*/ 00852000
         AL    @08,@CF00058                                        0307 00853000
         ST    @08,I                                               0307 00854000
@DE00298 L     @07,@PC00014                                        0307 00855000
         C     @08,WORDLEN3(,@07)                                  0307 00856000
         BNH   @DL00298                                            0307 00857000
*    INDEX2 = 2*WORDLEN3;                                  /*@Z427VLS*/ 00858000
         L     @08,@PC00014                                        0308 00859000
         L     @08,WORDLEN3(,@08)                                  0308 00860000
         ALR   @08,@08                                             0308 00861000
         ST    @08,INDEX2                                          0308 00862000
*    CALL WORDPAK2(INDEX2,KEYWORD);                        /*@Z427VLS*/ 00863000
         LA    @01,@AL00309                                        0309 00864000
         BAL   @14,WORDPAK2                                        0309 00865000
*END;                                                      /*@Z427VLS*/ 00866000
@EL00014 DS    0H                                                  0310 00867000
@EF00014 DS    0H                                                  0310 00868000
@ER00014 L     @14,@SA00014                                        0310 00869000
         L     @01,@SA00014+4                                      0310 00870000
         BR    @14                                                 0310 00871000
*/********************************************************************/ 00872000
*/*                                                          @Z427VLS*/ 00873000
*/*  INTERPRET THE SHARE I/O CARDS.  THE CPU SERIAL NUMBER MUST BE   */ 00874000
*/*  FIRST, FOLLOWED BY EITHER THE CUA FOR CUX.  THE RESULTS OF THE  */ 00875000
*/*  ROUTINE ARE PLACED IN KEYWORD(1:5).                     @Z427VLS*/ 00876000
*/*                                                          @Z427VLS*/ 00877000
*/********************************************************************/ 00878000
*SHARECRD: PROC OPTIONS(SAVE(1,14));                       /*@Z427VLS*/ 00879000
SHARECRD ST    @14,@SA00015                                        0311 00880000
         ST    @01,@SA00015+4                                      0311 00881000
*   CALL VALIDNUM(6);                     /* VALIDATE CPU SERIAL NO. */ 00882000
         LA    @01,@AL00312                                        0312 00883000
         BAL   @14,VALIDNUM                                        0312 00884000
*   CALL HEXPACK(6);                                       /*@Z427VLS*/ 00885000
         LA    @01,@AL00313                                        0313 00886000
         BAL   @14,HEXPACK                                         0313 00887000
*   KEYWORD(3:5) = HOLDAREA(1:3);         /* SAVE CONVERTED SERIAL NO*/ 00888000
         MVC   KEYWORD+2(3),HOLDAREA                               0314 00889000
*   IF PARMFLD(INDEX1) = PERIOD THEN                               0315 00890000
         LA    @08,PARMFLD-1(INDEX1)                               0315 00891000
         CLI   0(@08),C'.'                                         0315 00892000
         BNE   @RF00315                                            0315 00893000
*     DO I = INDEX1 + 3;                                   /*@Z427VLS*/ 00894000
         LA    @08,3                                               0316 00895000
         ALR   @08,INDEX1                                          0316 00896000
         ST    @08,I                                               0316 00897000
*       PARMFLD(INDEX1) = '0';                             /*@Z427VLS*/ 00898000
         LA    @08,PARMFLD-1(INDEX1)                               0317 00899000
         MVI   0(@08),C'0'                                         0317 00900000
*       CUAHOLD(1:3) = PARMFLD(INDEX1+1:INDEX1+3);  /* SAVE CUA      */ 00901000
         LA    @08,PARMFLD(INDEX1)                                 0318 00902000
         MVC   CUAHOLD(3),0(@08)                                   0318 00903000
*       DO INDEX3 = INDEX1 TO I BY 1;                      /*@Z427VLS*/ 00904000
         LR    INDEX3,INDEX1                                       0319 00905000
         B     @DE00319                                            0319 00906000
@DL00319 DS    0H                                                  0320 00907000
*         VALID = OFF;                                     /*@Z427VLS*/ 00908000
         NI    VALID,B'01111111'                                   0320 00909000
*         DO J= 17 TO 1 BY -1 WHILE (VALID = OFF);  /* VALID CUA?    */ 00910000
         LA    J,17                                                0321 00911000
@DL00321 TM    VALID,B'10000000'                                   0321 00912000
         BNZ   @DC00321                                            0321 00913000
*           IF PARMFLD(INDEX3) = NUMTAB(J) THEN                    0322 00914000
         LA    @08,PARMFLD-1(INDEX3)                               0322 00915000
         LA    @07,NUMTAB-1(J)                                     0322 00916000
         CLC   0(1,@08),0(@07)                                     0322 00917000
         BNE   @RF00322                                            0322 00918000
*             DO;                                          /*@Z427VLS*/ 00919000
*               VALID = ON;                                /*@Z427VLS*/ 00920000
         OI    VALID,B'10000000'                                   0324 00921000
*               PARMFLD(INDEX3) = HEXTAB(J);    /* CONVERTED VALUE   */ 00922000
         LA    @08,PARMFLD-1(INDEX3)                               0325 00923000
         LA    @07,HEXTAB-1(J)                                     0325 00924000
         MVC   0(1,@08),0(@07)                                     0325 00925000
*             END;                                         /*@Z427VLS*/ 00926000
*         END;                                             /*@Z427VLS*/ 00927000
@RF00322 BCTR  J,0                                                 0327 00928000
         LTR   J,J                                                 0327 00929000
         BP    @DL00321                                            0327 00930000
@DC00321 DS    0H                                                  0328 00931000
*         IF VALID = OFF THEN                                      0328 00932000
         TM    VALID,B'10000000'                                   0328 00933000
         BNZ   @RF00328                                            0328 00934000
*           DO PLACE = INDEX1 - INDEX3;                    /*@Z427VLS*/ 00935000
         LR    @08,INDEX1                                          0329 00936000
         SLR   @08,INDEX3                                          0329 00937000
         ST    @08,PLACE                                           0329 00938000
*             CALL OUTMSG(SYNTAX);                         /*@Z427VLS*/ 00939000
         LA    @01,@AL00330                                        0330 00940000
         BAL   @14,OUTMSG                                          0330 00941000
*           END;                                           /*@Z427VLS*/ 00942000
*       END;                                               /*@Z427VLS*/ 00943000
@RF00328 AL    INDEX3,@CF00058                                     0332 00944000
@DE00319 C     INDEX3,I                                            0332 00945000
         BNH   @DL00319                                            0332 00946000
*       CALL HEXPACK(4);                        /* PACK THE CUA      */ 00947000
         LA    @01,@AL00333                                        0333 00948000
         BAL   @14,HEXPACK                                         0333 00949000
*       IF INDEX2 < LENGPARM THEN               /* ROOM IN TABLE?    */ 00950000
         L     @08,INDEX2                                          0334 00951000
         C     @08,LENGPARM                                        0334 00952000
         BNL   @RF00334                                            0334 00953000
*         INDEX2 = INDEX2 + 1;                             /*@Z427VLS*/ 00954000
         AL    @08,@CF00058                                        0335 00955000
         ST    @08,INDEX2                                          0335 00956000
*       ELSE                                                       0336 00957000
*         CALL OUTMSG(SYNTAX);                             /*@Z427VLS*/ 00958000
         B     @RC00334                                            0336 00959000
@RF00334 LA    @01,@AL00336                                        0336 00960000
         BAL   @14,OUTMSG                                          0336 00961000
*       KEYWORD(1:2) = HOLDAREA(1:2);           /* STORE CUA @Z427VLS*/ 00962000
@RC00334 MVC   KEYWORD(2),HOLDAREA                                 0337 00963000
*       IF CUAHOLD(1) = 'X' THEN                                   0338 00964000
         CLI   CUAHOLD,C'X'                                        0338 00965000
         BNE   @RF00338                                            0338 00966000
*         DO PLACE = 3;                                    /*@Z427VLS*/ 00967000
         LA    @08,3                                               0339 00968000
         ST    @08,PLACE                                           0339 00969000
*           CALL OUTMSG(SYNTAX);                           /*@Z427VLS*/ 00970000
         LA    @01,@AL00340                                        0340 00971000
         BAL   @14,OUTMSG                                          0340 00972000
*         END;                                             /*@Z427VLS*/ 00973000
*       IF CUAHOLD(2) = 'X' THEN                                   0342 00974000
@RF00338 CLI   CUAHOLD+1,C'X'                                      0342 00975000
         BNE   @RF00342                                            0342 00976000
*         DO PLACE = 2;                                    /*@Z427VLS*/ 00977000
         LA    @08,2                                               0343 00978000
         ST    @08,PLACE                                           0343 00979000
*           CALL OUTMSG(SYNTAX);                           /*@Z427VLS*/ 00980000
         LA    @01,@AL00344                                        0344 00981000
         BAL   @14,OUTMSG                                          0344 00982000
*         END;                                             /*@Z427VLS*/ 00983000
*     END;                                                 /*@Z427VLS*/ 00984000
@RF00342 DS    0H                                                  0347 00985000
*   ELSE                                                           0347 00986000
*     DO;                                                  /*@Z427VLS*/ 00987000
         B     @RC00315                                            0347 00988000
@RF00315 DS    0H                                                  0348 00989000
*       CALL OUTMSG(SYNTAX);              /* INVALID SPECIFICATION   */ 00990000
         LA    @01,@AL00348                                        0348 00991000
         BAL   @14,OUTMSG                                          0348 00992000
*       INDEX1 = INDEX1 + 4;                               /*@Z427VLS*/ 00993000
         AL    INDEX1,@CF00039                                     0349 00994000
*       IF INDEX2 < LENGPARM THEN                                  0350 00995000
         L     @08,INDEX2                                          0350 00996000
         C     @08,LENGPARM                                        0350 00997000
         BNL   @RF00350                                            0350 00998000
*         INDEX2 = INDEX2 + 1;                             /*@Z427VLS*/ 00999000
         AL    @08,@CF00058                                        0351 01000000
         ST    @08,INDEX2                                          0351 01001000
*       ELSE                                                       0352 01002000
*         CALL OUTMSG(SYNTAX);                             /*@Z427VLS*/ 01003000
         B     @RC00350                                            0352 01004000
@RF00350 LA    @01,@AL00352                                        0352 01005000
         BAL   @14,OUTMSG                                          0352 01006000
*     END;                                                 /*@Z427VLS*/ 01007000
* END;                                                     /*@Z427VLS*/ 01008000
@EL00015 DS    0H                                                  0354 01009000
@EF00015 DS    0H                                                  0354 01010000
@ER00015 L     @14,@SA00015                                        0354 01011000
         L     @01,@SA00015+4                                      0354 01012000
         BR    @14                                                 0354 01013000
@PB00015 DS    0H                                                  0355 01014000
*/********************************************************************/ 01015000
*/*                                                          @Z427VLS*/ 01016000
*/* A CHECK IS MADE FOR VARIOUS CONFLICTING POSSIBILITIES BETWEEN THE*/ 01017000
*/* PARAMETERS.  AN ERROR MESSAGE IS ISSUED FOR EACH ONE ENCOUNTERED.*/ 01018000
*/*                                                          @Z427VLS*/ 01019000
*/********************************************************************/ 01020000
* IPSWES1 = IPSWES;                       /* SET FLAGS FROM IFCPARM1 */ 01021000
         L     @08,@PC00001                                        0355 01022000
         MVC   IPSWES1(4),IPSWES(@08)                              0355 01023000
* IF PARMTHR = ON THEN                                             0356 01024000
         TM    PARMTHR(R2),B'00001000'                             0356 01025000
         BNO   @RF00356                                            0356 01026000
*   PARMMES = ON;                                          /*@G51DGVS*/ 01027000
         OI    PARMMES(R2),B'01000000'                             0357 01028000
* IF DEBUG47 = ON & TIMESEQ = ON THEN                              0358 01029000
@RF00356 TM    DEBUG47(R2),B'00000001'                             0358 01030000
         BNO   @RF00358                                            0358 01031000
         TM    TIMESEQ(R2),B'00000010'                             0358 01032000
         BNO   @RF00358                                            0358 01033000
*   DO;                          /* IFCEVENT NEEDS SWITCHES OFF     */  01034000
*     PMCH = OFF;                                          /*@G51DGVS*/ 01035000
*     PCHAN = OFF;                                         /*@G51DGVS*/ 01036000
*     POBR = OFF;                                          /*@G51DGVS*/ 01037000
*     PSOFT = OFF;                                         /*@G51DGVS*/ 01038000
*     PIPL = OFF;                                          /*@G51DGVS*/ 01039000
*     PDDR = OFF;                                          /*@G51DGVS*/ 01040000
*     PMIH = OFF;                                          /*@G51DGVS*/ 01041000
*     PEOD = OFF;                                          /*@G51DGVS*/ 01042000
         NI    PMCH(R2),B'00000000'                                0367 01043000
*     PTTYP = OFF;                                         /*@G51DGVS*/ 01044000
*     PMCHFRAM = ON;                                       /*@G51DGVS*/ 01045000
*     PCCHFRAM = ON;                                       /*@G51DGVS*/ 01046000
         OI    PMCHFRAM(R2),B'01100000'                            0370 01047000
         NI    PTTYP(R2),B'01111111'                               0370 01048000
*     PACC = OFF;                                          /*@G51DGVS*/ 01049000
         NI    PACC(R2),B'10111111'                                0371 01050000
*     OACCDEV = OFF;                                       /*@G51DGVS*/ 01051000
         NI    OACCDEV(R2),B'11110111'                             0372 01052000
*   END;                                                   /*@G51DGVS*/ 01053000
* ELSE                                                             0374 01054000
*   IF DEBUG46 = ON & TIMESEQ = ON THEN                            0374 01055000
         B     @RC00358                                            0374 01056000
@RF00358 TM    DEBUG46(R2),B'00000010'                             0374 01057000
         BNO   @RF00374                                            0374 01058000
         TM    TIMESEQ(R2),B'00000010'                             0374 01059000
         BNO   @RF00374                                            0374 01060000
*     DO;                                                  /*@G51DGVS*/ 01061000
*       PMCH = ON;                                         /*@G51DGVS*/ 01062000
*       PCHAN = ON;                                        /*@G51DGVS*/ 01063000
*       POBR = OFF;                                        /*@G51DGVS*/ 01064000
*       PSOFT = OFF;                                       /*@G51DGVS*/ 01065000
*       PIPL = OFF;                                        /*@G51DGVS*/ 01066000
*       PDDR = OFF;                                        /*@G51DGVS*/ 01067000
*       PMIH = OFF;                                        /*@G51DGVS*/ 01068000
*       PEOD = OFF;                                        /*@G51DGVS*/ 01069000
         OI    PMCH(R2),B'11000000'                                0383 01070000
         NI    POBR(R2),B'11000000'                                0383 01071000
*       PTTYP = OFF;                                       /*@G51DGVS*/ 01072000
*       PMCHFRAM = ON;                                     /*@G51DGVS*/ 01073000
*       PCCHFRAM = ON;                                     /*@G51DGVS*/ 01074000
         OI    PMCHFRAM(R2),B'01100000'                            0386 01075000
         NI    PTTYP(R2),B'01111111'                               0386 01076000
*       PACC = OFF;                                        /*@G51DGVS*/ 01077000
         NI    PACC(R2),B'10111111'                                0387 01078000
*       OACCDEV = OFF;                                     /*@G51DGVS*/ 01079000
         NI    OACCDEV(R2),B'11110111'                             0388 01080000
*     END;                                                 /*@G51DGVS*/ 01081000
* IF USERFLG = ON & DEBUG26 = OFF THEN                             0390 01082000
@RF00374 DS    0H                                                  0390 01083000
@RC00358 TM    USERFLG,B'00000010'                                 0390 01084000
         BNO   @RF00390                                            0390 01085000
         TM    DEBUG26(R2),B'00100000'                             0390 01086000
         BNZ   @RF00390                                            0390 01087000
*   CALL CONFLICT(19,'USERPGM NOT ALLOWED');               /*@G51DGVS*/ 01088000
         LA    @01,@AL00391                                        0391 01089000
         BAL   @14,CONFLICT                                        0391 01090000
*/*                                                          @G51DGVS*/ 01091000
*/* EACH FUNCTION IS EXAMINED FOR THOSE VALUES WHICH ARE ALLOWED.    */ 01092000
* /* SHOULD ONE BE SPECIFIED THAT IS NOT ALLOWED, A CONFLICT ERROR   */ 01093000
* /* MESSAGE IS OUTPUT.  PROCESSING WILL BE TERMINATED.      @Z427VLS*/ 01094000
* /*                                                         @Z427VLS*/ 01095000
* IF SYSUM = ON THEN                                               0392 01096000
@RF00390 TM    SYSUM(R2),B'00000100'                               0392 01097000
         BNO   @RF00392                                            0392 01098000
*   DO;                                                    /*@Z427VLS*/ 01099000
*     IF TYPEFLG = ON THEN                                         0394 01100000
         TM    TYPEFLG,B'10000000'                                 0394 01101000
         BNO   @RF00394                                            0394 01102000
*       CALL CONFLICT (10,'SYSUM,TYPE');                   /*@Z427VLS*/ 01103000
         LA    @01,@AL00395                                        0395 01104000
         BAL   @14,CONFLICT                                        0395 01105000
*     IF PRINTFLG = ON THEN                                        0396 01106000
@RF00394 TM    PRINTFLG,B'00001000'                                0396 01107000
         BNO   @RF00396                                            0396 01108000
*       CALL CONFLICT (11,'SYSUM,PRINT');                  /*@Z427VLS*/ 01109000
         LA    @01,@AL00397                                        0397 01110000
         BAL   @14,CONFLICT                                        0397 01111000
*     IF SYMFLG = ON THEN                                          0398 01112000
@RF00396 TM    SYMFLG,B'00000100'                                  0398 01113000
         BNO   @RF00398                                            0398 01114000
*       CALL CONFLICT (12,'SYSUM,SYMCDE');                 /*@Z427VLS*/ 01115000
         LA    @01,@AL00399                                        0399 01116000
         BAL   @14,CONFLICT                                        0399 01117000
*     IF ERRORFLG = ON THEN                                        0400 01118000
@RF00398 TM    ERRORFLG,B'00000001'                                0400 01119000
         BNO   @RF00400                                            0400 01120000
*       CALL CONFLICT (13,'SYSUM,ERRORID');                /*@Z427VLS*/ 01121000
         LA    @01,@AL00401                                        0401 01122000
         BAL   @14,CONFLICT                                        0401 01123000
*     IF CPUFLG = ON THEN                                          0402 01124000
@RF00400 TM    CPUFLG,B'10000000'                                  0402 01125000
         BNO   @RF00402                                            0402 01126000
*       CALL CONFLICT (9,'SYSUM,CPU');                     /*@Z427VLS*/ 01127000
         LA    @01,@AL00403                                        0403 01128000
         BAL   @14,CONFLICT                                        0403 01129000
*     IF CPUCUFLG = ON THEN                                        0404 01130000
@RF00402 TM    CPUCUFLG,B'01000000'                                0404 01131000
         BNO   @RF00404                                            0404 01132000
*       CALL CONFLICT (12,'SYSUM,CPUCUA');                 /*@Z427VLS*/ 01133000
         LA    @01,@AL00405                                        0405 01134000
         BAL   @14,CONFLICT                                        0405 01135000
*     IF VOLFLG = ON THEN                                          0406 01136000
@RF00404 TM    VOLFLG,B'00100000'                                  0406 01137000
         BNO   @RF00406                                            0406 01138000
*       CALL CONFLICT (11,'SYSUM,VOLID');                  /*@Z427VLS*/ 01139000
         LA    @01,@AL00407                                        0407 01140000
         BAL   @14,CONFLICT                                        0407 01141000
*     IF TERMFLG = ON THEN                                         0408 01142000
@RF00406 TM    TERMFLG,B'00001000'                                 0408 01143000
         BNO   @RF00408                                            0408 01144000
*       CALL CONFLICT (11,'SYSUM,TERMN');                  /*@Z427VLS*/ 01145000
         LA    @01,@AL00409                                        0409 01146000
         BAL   @14,CONFLICT                                        0409 01147000
*     IF MODFLG = ON THEN                                          0410 01148000
@RF00408 TM    MODFLG,B'00000100'                                  0410 01149000
         BNO   @RF00410                                            0410 01150000
*       CALL CONFLICT (9,'SYSUM,MOD');                     /*@Z427VLS*/ 01151000
         LA    @01,@AL00411                                        0411 01152000
         BAL   @14,CONFLICT                                        0411 01153000
*     IF LIBFLG = ON THEN                                          0412 01154000
@RF00410 TM    LIBFLG,B'00000010'                                  0412 01155000
         BNO   @RF00412                                            0412 01156000
*       CALL CONFLICT (12,'SYSUM,LIBADR');                 /*@Z427VLS*/ 01157000
         LA    @01,@AL00413                                        0413 01158000
         BAL   @14,CONFLICT                                        0413 01159000
*     IF SERFLG = ON THEN                                          0414 01160000
@RF00412 TM    SERFLG,B'00000001'                                  0414 01161000
         BNO   @RF00414                                            0414 01162000
*       CALL CONFLICT (12,'SYSUM,DEVSER');                 /*@Z427VLS*/ 01163000
         LA    @01,@AL00415                                        0415 01164000
         BAL   @14,CONFLICT                                        0415 01165000
*     IF DEVFLG = ON THEN                                          0416 01166000
@RF00414 TM    DEVFLG,B'00001000'                                  0416 01167000
         BNO   @RF00416                                            0416 01168000
*       CALL CONFLICT (9,'SYSUM,DEV');                     /*@Z427VLS*/ 01169000
         LA    @01,@AL00417                                        0417 01170000
         BAL   @14,CONFLICT                                        0417 01171000
*     IF CUAFLG = ON THEN                                          0418 01172000
@RF00416 TM    CUAFLG,B'00000100'                                  0418 01173000
         BNO   @RF00418                                            0418 01174000
*       CALL CONFLICT (9,'SYSUM,CUA');                     /*@Z427VLS*/ 01175000
         LA    @01,@AL00419                                        0419 01176000
         BAL   @14,CONFLICT                                        0419 01177000
*     IF SHORTOBR = ON THEN                                        0420 01178000
@RF00418 TM    SHORTOBR(R2),B'00100000'                            0420 01179000
         BNO   @RF00420                                            0420 01180000
*       CALL CONFLICT (11,'SYSUM,SHORT');                  /*@Z427VLS*/ 01181000
         LA    @01,@AL00421                                        0421 01182000
         BAL   @14,CONFLICT                                        0421 01183000
*     IF PARMMES = ON THEN                                         0422 01184000
@RF00420 TM    PARMMES(R2),B'01000000'                             0422 01185000
         BNO   @RF00422                                            0422 01186000
*       CALL CONFLICT (19,'SYSUM,MES/THRESHOLD');          /*@Z427VLS*/ 01187000
         LA    @01,@AL00423                                        0423 01188000
         BAL   @14,CONFLICT                                        0423 01189000
*     IF TREND = ON THEN                                           0424 01190000
@RF00422 TM    TREND(R2),B'00010000'                               0424 01191000
         BNO   @RF00424                                            0424 01192000
*       CALL CONFLICT (12,'SYSUM,TRENDS');                 /*@Z427VLS*/ 01193000
         LA    @01,@AL00425                                        0425 01194000
         BAL   @14,CONFLICT                                        0425 01195000
*     IF TIMESEQ = ON THEN                                         0426 01196000
@RF00424 TM    TIMESEQ(R2),B'00000010'                             0426 01197000
         BNO   @RF00426                                            0426 01198000
*       CALL CONFLICT (11,'SYSUM,EVENT');                  /*@Z427VLS*/ 01199000
         LA    @01,@AL00427                                        0427 01200000
         BAL   @14,CONFLICT                                        0427 01201000
*     IF RDESUM = ON THEN                                          0428 01202000
@RF00426 TM    RDESUM(R2),B'10000000'                              0428 01203000
         BNO   @RF00428                                            0428 01204000
*       CALL CONFLICT (12,'SYSUM,RDESUM');                 /*@Z427VLS*/ 01205000
         LA    @01,@AL00429                                        0429 01206000
         BAL   @14,CONFLICT                                        0429 01207000
*   END;                                                   /*@Z427VLS*/ 01208000
* ELSE                                                             0431 01209000
*   IF TREND = ON THEN                                             0431 01210000
         B     @RC00392                                            0431 01211000
@RF00392 TM    TREND(R2),B'00010000'                               0431 01212000
         BNO   @RF00431                                            0431 01213000
*     DO;                                                  /*@Z427VLS*/ 01214000
*       IF PRINTFLG = ON THEN                                      0433 01215000
         TM    PRINTFLG,B'00001000'                                0433 01216000
         BNO   @RF00433                                            0433 01217000
*         CALL CONFLICT (12,'TRENDS,PRINT');               /*@Z427VLS*/ 01218000
         LA    @01,@AL00434                                        0434 01219000
         BAL   @14,CONFLICT                                        0434 01220000
*       IF SYMFLG = ON THEN                                        0435 01221000
@RF00433 TM    SYMFLG,B'00000100'                                  0435 01222000
         BNO   @RF00435                                            0435 01223000
*         CALL CONFLICT (13,'TRENDS,SYMCDE');              /*@Z427VLS*/ 01224000
         LA    @01,@AL00436                                        0436 01225000
         BAL   @14,CONFLICT                                        0436 01226000
*       IF ERRORFLG = ON THEN                                      0437 01227000
@RF00435 TM    ERRORFLG,B'00000001'                                0437 01228000
         BNO   @RF00437                                            0437 01229000
*         CALL CONFLICT (14,'TRENDS,ERRORID');             /*@Z427VLS*/ 01230000
         LA    @01,@AL00438                                        0438 01231000
         BAL   @14,CONFLICT                                        0438 01232000
*       IF CPUFLG = ON THEN                                        0439 01233000
@RF00437 TM    CPUFLG,B'10000000'                                  0439 01234000
         BNO   @RF00439                                            0439 01235000
*         CALL CONFLICT (10,'TRENDS,CPU');                 /*@Z427VLS*/ 01236000
         LA    @01,@AL00440                                        0440 01237000
         BAL   @14,CONFLICT                                        0440 01238000
*       IF CPUCUFLG = ON THEN                                      0441 01239000
@RF00439 TM    CPUCUFLG,B'01000000'                                0441 01240000
         BNO   @RF00441                                            0441 01241000
*         CALL CONFLICT (13,'TRENDS,CPUCUA');              /*@Z427VLS*/ 01242000
         LA    @01,@AL00442                                        0442 01243000
         BAL   @14,CONFLICT                                        0442 01244000
*       IF VOLFLG = ON THEN                                        0443 01245000
@RF00441 TM    VOLFLG,B'00100000'                                  0443 01246000
         BNO   @RF00443                                            0443 01247000
*         CALL CONFLICT (12,'TRENDS,VOLID');               /*@Z427VLS*/ 01248000
         LA    @01,@AL00444                                        0444 01249000
         BAL   @14,CONFLICT                                        0444 01250000
*       IF TERMFLG = ON THEN                                       0445 01251000
@RF00443 TM    TERMFLG,B'00001000'                                 0445 01252000
         BNO   @RF00445                                            0445 01253000
*         CALL CONFLICT (12,'TRENDS,TERMN');               /*@Z427VLS*/ 01254000
         LA    @01,@AL00446                                        0446 01255000
         BAL   @14,CONFLICT                                        0446 01256000
*       IF MODFLG = ON THEN                                        0447 01257000
@RF00445 TM    MODFLG,B'00000100'                                  0447 01258000
         BNO   @RF00447                                            0447 01259000
*         CALL CONFLICT (10,'TRENDS,MOD');                 /*@Z427VLS*/ 01260000
         LA    @01,@AL00448                                        0448 01261000
         BAL   @14,CONFLICT                                        0448 01262000
*       IF LIBFLG = ON THEN                                        0449 01263000
@RF00447 TM    LIBFLG,B'00000010'                                  0449 01264000
         BNO   @RF00449                                            0449 01265000
*         CALL CONFLICT (13,'TRENDS,LIBADR');              /*@Z427VLS*/ 01266000
         LA    @01,@AL00450                                        0450 01267000
         BAL   @14,CONFLICT                                        0450 01268000
*       IF SERFLG = ON THEN                                        0451 01269000
@RF00449 TM    SERFLG,B'00000001'                                  0451 01270000
         BNO   @RF00451                                            0451 01271000
*         CALL CONFLICT (13,'TRENDS,DEVSER');              /*@Z427VLS*/ 01272000
         LA    @01,@AL00452                                        0452 01273000
         BAL   @14,CONFLICT                                        0452 01274000
*       IF SHORTOBR = ON THEN                                      0453 01275000
@RF00451 TM    SHORTOBR(R2),B'00100000'                            0453 01276000
         BNO   @RF00453                                            0453 01277000
*         CALL CONFLICT (12,'TRENDS,SHORT');               /*@Z427VLS*/ 01278000
         LA    @01,@AL00454                                        0454 01279000
         BAL   @14,CONFLICT                                        0454 01280000
*       IF PARMMES = ON THEN                                       0455 01281000
@RF00453 TM    PARMMES(R2),B'01000000'                             0455 01282000
         BNO   @RF00455                                            0455 01283000
*         CALL CONFLICT (20,'TRENDS,MES/THRESHOLD');       /*@Z427VLS*/ 01284000
         LA    @01,@AL00456                                        0456 01285000
         BAL   @14,CONFLICT                                        0456 01286000
*       IF TIMESEQ = ON THEN                                       0457 01287000
@RF00455 TM    TIMESEQ(R2),B'00000010'                             0457 01288000
         BNO   @RF00457                                            0457 01289000
*         CALL CONFLICT (12,'TRENDS,EVENT');               /*@Z427VLS*/ 01290000
         LA    @01,@AL00458                                        0458 01291000
         BAL   @14,CONFLICT                                        0458 01292000
*       IF RDESUM = ON THEN                                        0459 01293000
@RF00457 TM    RDESUM(R2),B'10000000'                              0459 01294000
         BNO   @RF00459                                            0459 01295000
*         CALL CONFLICT (13,'TRENDS,RDESUM');              /*@Z427VLS*/ 01296000
         LA    @01,@AL00460                                        0460 01297000
         BAL   @14,CONFLICT                                        0460 01298000
*     END;                                                 /*@Z427VLS*/ 01299000
*   ELSE                                                           0462 01300000
*     IF TIMESEQ = ON THEN                                         0462 01301000
         B     @RC00431                                            0462 01302000
@RF00431 TM    TIMESEQ(R2),B'00000010'                             0462 01303000
         BNO   @RF00462                                            0462 01304000
*       DO;                                                /*@Z427VLS*/ 01305000
*         IF PRINTFLG = ON THEN                                    0464 01306000
         TM    PRINTFLG,B'00001000'                                0464 01307000
         BNO   @RF00464                                            0464 01308000
*           CALL CONFLICT (11,'EVENT,PRINT');              /*@Z427VLS*/ 01309000
         LA    @01,@AL00465                                        0465 01310000
         BAL   @14,CONFLICT                                        0465 01311000
*         IF SYMFLG = ON THEN                                      0466 01312000
@RF00464 TM    SYMFLG,B'00000100'                                  0466 01313000
         BNO   @RF00466                                            0466 01314000
*           CALL CONFLICT (12,'EVENT,SYMCDE');             /*@Z427VLS*/ 01315000
         LA    @01,@AL00467                                        0467 01316000
         BAL   @14,CONFLICT                                        0467 01317000
*         IF ERRORFLG = ON THEN                                    0468 01318000
@RF00466 TM    ERRORFLG,B'00000001'                                0468 01319000
         BNO   @RF00468                                            0468 01320000
*           CALL CONFLICT (13,'EVENT,ERRORID');            /*@Z427VLS*/ 01321000
         LA    @01,@AL00469                                        0469 01322000
         BAL   @14,CONFLICT                                        0469 01323000
*         IF CPUCUFLG = ON THEN                                    0470 01324000
@RF00468 TM    CPUCUFLG,B'01000000'                                0470 01325000
         BNO   @RF00470                                            0470 01326000
*           CALL CONFLICT (12,'EVENT,CPUCUA');             /*@Z427VLS*/ 01327000
         LA    @01,@AL00471                                        0471 01328000
         BAL   @14,CONFLICT                                        0471 01329000
*         IF MODFLG = ON THEN                                      0472 01330000
@RF00470 TM    MODFLG,B'00000100'                                  0472 01331000
         BNO   @RF00472                                            0472 01332000
*           CALL CONFLICT (9,'EVENT,MOD');                 /*@Z427VLS*/ 01333000
         LA    @01,@AL00473                                        0473 01334000
         BAL   @14,CONFLICT                                        0473 01335000
*         IF LIBFLG = ON THEN                                      0474 01336000
@RF00472 TM    LIBFLG,B'00000010'                                  0474 01337000
         BNO   @RF00474                                            0474 01338000
*           CALL CONFLICT (12,'EVENT,LIBADR');             /*@Z427VLS*/ 01339000
         LA    @01,@AL00475                                        0475 01340000
         BAL   @14,CONFLICT                                        0475 01341000
*         IF SERFLG = ON THEN                                      0476 01342000
@RF00474 TM    SERFLG,B'00000001'                                  0476 01343000
         BNO   @RF00476                                            0476 01344000
*           CALL CONFLICT (12,'EVENT,DEVSER');             /*@Z427VLS*/ 01345000
         LA    @01,@AL00477                                        0477 01346000
         BAL   @14,CONFLICT                                        0477 01347000
*         IF SHORTOBR = ON THEN                                    0478 01348000
@RF00476 TM    SHORTOBR(R2),B'00100000'                            0478 01349000
         BNO   @RF00478                                            0478 01350000
*           CALL CONFLICT (11,'EVENT,SHORT');              /*@Z427VLS*/ 01351000
         LA    @01,@AL00479                                        0479 01352000
         BAL   @14,CONFLICT                                        0479 01353000
*         IF ZEROALL = ON THEN                                     0480 01354000
@RF00478 TM    ZEROALL(R2),B'01000000'                             0480 01355000
         BNO   @RF00480                                            0480 01356000
*           CALL CONFLICT (10,'EVENT,ZERO');               /*@Z427VLS*/ 01357000
         LA    @01,@AL00481                                        0481 01358000
         BAL   @14,CONFLICT                                        0481 01359000
*         IF PARMMES = ON THEN                                     0482 01360000
@RF00480 TM    PARMMES(R2),B'01000000'                             0482 01361000
         BNO   @RF00482                                            0482 01362000
*           CALL CONFLICT (19,'EVENT,MES/THRESHOLD');      /*@Z427VLS*/ 01363000
         LA    @01,@AL00483                                        0483 01364000
         BAL   @14,CONFLICT                                        0483 01365000
*         IF RDESUM = ON THEN                                      0484 01366000
@RF00482 TM    RDESUM(R2),B'10000000'                              0484 01367000
         BNO   @RF00484                                            0484 01368000
*           CALL CONFLICT (12,'EVENT,RDESUM');             /*@Z427VLS*/ 01369000
         LA    @01,@AL00485                                        0485 01370000
         BAL   @14,CONFLICT                                        0485 01371000
*       END;                                               /*@Z427VLS*/ 01372000
*     ELSE                                                         0487 01373000
*       IF PARMMES = ON THEN                                       0487 01374000
         B     @RC00462                                            0487 01375000
@RF00462 TM    PARMMES(R2),B'01000000'                             0487 01376000
         BNO   @RF00487                                            0487 01377000
*         DO;                                              /*@Z427VLS*/ 01378000
*           IF TYPEFLG = ON & POBR = OFF THEN                      0489 01379000
         TM    TYPEFLG,B'10000000'                                 0489 01380000
         BNO   @RF00489                                            0489 01381000
         TM    POBR(R2),B'00100000'                                0489 01382000
         BNZ   @RF00489                                            0489 01383000
*             CALL CONFLICT (18,'MES/THRESHOLD,TYPE');     /*@Z427VLS*/ 01384000
         LA    @01,@AL00490                                        0490 01385000
         BAL   @14,CONFLICT                                        0490 01386000
*           IF SYMFLG = ON THEN                                    0491 01387000
@RF00489 TM    SYMFLG,B'00000100'                                  0491 01388000
         BNO   @RF00491                                            0491 01389000
*             CALL CONFLICT (20,'MES/THRESHOLD,SYMCDE');   /*@Z427VLS*/ 01390000
         LA    @01,@AL00492                                        0492 01391000
         BAL   @14,CONFLICT                                        0492 01392000
*           IF ERRORFLG = ON THEN                                  0493 01393000
@RF00491 TM    ERRORFLG,B'00000001'                                0493 01394000
         BNO   @RF00493                                            0493 01395000
*             CALL CONFLICT (21,'MES/THRESHOLD,ERRORID');  /*@Z427VLS*/ 01396000
         LA    @01,@AL00494                                        0494 01397000
         BAL   @14,CONFLICT                                        0494 01398000
*           IF CPUCUFLG = ON THEN                                  0495 01399000
@RF00493 TM    CPUCUFLG,B'01000000'                                0495 01400000
         BNO   @RF00495                                            0495 01401000
*             CALL CONFLICT (20,'MES/THRESHOLD,CPUCUA');   /*@Z427VLS*/ 01402000
         LA    @01,@AL00496                                        0496 01403000
         BAL   @14,CONFLICT                                        0496 01404000
*           IF PACC = ON & ACCFLG = ON THEN                        0497 01405000
@RF00495 TM    PACC(R2),B'01000000'                                0497 01406000
         BNO   @RF00497                                            0497 01407000
         TM    ACCFLG,B'00010000'                                  0497 01408000
         BNO   @RF00497                                            0497 01409000
*             CALL CONFLICT (17,'MES/THRESHOLD,ACC');      /*@Z427VLS*/ 01410000
         LA    @01,@AL00498                                        0498 01411000
         BAL   @14,CONFLICT                                        0498 01412000
*           ELSE                                                   0499 01413000
*             DO;                                          /*@Z427VLS*/ 01414000
         B     @RC00497                                            0499 01415000
@RF00497 DS    0H                                                  0500 01416000
*               PACC = OFF;                                /*@Z427VLS*/ 01417000
         NI    PACC(R2),B'10111111'                                0500 01418000
*               OACCDEV = OFF;                             /*@Z427VLS*/ 01419000
         NI    OACCDEV(R2),B'11110111'                             0501 01420000
*             END;                                         /*@Z427VLS*/ 01421000
*           IF TERMFLG = ON THEN                                   0503 01422000
@RC00497 TM    TERMFLG,B'00001000'                                 0503 01423000
         BNO   @RF00503                                            0503 01424000
*             CALL CONFLICT (19,'MES/THRESHOLD,TERMN');    /*@Z427VLS*/ 01425000
         LA    @01,@AL00504                                        0504 01426000
         BAL   @14,CONFLICT                                        0504 01427000
*           IF MODFLG = ON THEN                                    0505 01428000
@RF00503 TM    MODFLG,B'00000100'                                  0505 01429000
         BNO   @RF00505                                            0505 01430000
*             CALL CONFLICT (17,'MES/THRESHOLD,MOD');      /*@Z427VLS*/ 01431000
         LA    @01,@AL00506                                        0506 01432000
         BAL   @14,CONFLICT                                        0506 01433000
*           IF LIBFLG = ON THEN                                    0507 01434000
@RF00505 TM    LIBFLG,B'00000010'                                  0507 01435000
         BNO   @RF00507                                            0507 01436000
*             CALL CONFLICT (20,'MES/THRESHOLD,LIBADR');   /*@Z427VLS*/ 01437000
         LA    @01,@AL00508                                        0508 01438000
         BAL   @14,CONFLICT                                        0508 01439000
*           IF SHORTOBR = ON THEN                                  0509 01440000
@RF00507 TM    SHORTOBR(R2),B'00100000'                            0509 01441000
         BNO   @RF00509                                            0509 01442000
*             CALL CONFLICT (19,'MES/THRESHOLD,SHORT');    /*@Z427VLS*/ 01443000
         LA    @01,@AL00510                                        0510 01444000
         BAL   @14,CONFLICT                                        0510 01445000
*           IF THRSHFLG = ON & PRINTFLG = ON THEN                  0511 01446000
@RF00509 TM    THRSHFLG,B'01001000'                                0511 01447000
         BNO   @RF00511                                            0511 01448000
*             CALL CONFLICT (15,'THRESHOLD,PRINT');        /*@Z427VLS*/ 01449000
         LA    @01,@AL00512                                        0512 01450000
         BAL   @14,CONFLICT                                        0512 01451000
*           IF ZEROALL = ON THEN                                   0513 01452000
@RF00511 TM    ZEROALL(R2),B'01000000'                             0513 01453000
         BNO   @RF00513                                            0513 01454000
*             CALL CONFLICT (18,'MES/THRESHOLD,ZERO');     /*@Z427VLS*/ 01455000
         LA    @01,@AL00514                                        0514 01456000
         BAL   @14,CONFLICT                                        0514 01457000
*           IF RDESUM = ON THEN                                    0515 01458000
@RF00513 TM    RDESUM(R2),B'10000000'                              0515 01459000
         BNO   @RF00515                                            0515 01460000
*             CALL CONFLICT (20,'MES/THRESHOLD,RDESUM');   /*@Z427VLS*/ 01461000
         LA    @01,@AL00516                                        0516 01462000
         BAL   @14,CONFLICT                                        0516 01463000
*         END;                                             /*@Z427VLS*/ 01464000
*       ELSE                                                       0518 01465000
*         IF RDESUM = ON THEN                                      0518 01466000
         B     @RC00487                                            0518 01467000
@RF00487 TM    RDESUM(R2),B'10000000'                              0518 01468000
         BNO   @RF00518                                            0518 01469000
*           DO;                                            /*@Z427VLS*/ 01470000
*             IF TYPEFLG = ON THEN                                 0520 01471000
         TM    TYPEFLG,B'10000000'                                 0520 01472000
         BNO   @RF00520                                            0520 01473000
*               CALL CONFLICT (11,'RDESUM,TYPE');          /*@Z427VLS*/ 01474000
         LA    @01,@AL00521                                        0521 01475000
         BAL   @14,CONFLICT                                        0521 01476000
*             IF TIMEFLG = ON THEN                                 0522 01477000
@RF00520 TM    TIMEFLG,B'00100000'                                 0522 01478000
         BNO   @RF00522                                            0522 01479000
*               CALL CONFLICT (11,'RDESUM,TIME');          /*@Z427VLS*/ 01480000
         LA    @01,@AL00523                                        0523 01481000
         BAL   @14,CONFLICT                                        0523 01482000
*             IF TABFLG = ON THEN                                  0524 01483000
@RF00522 TM    TABFLG,B'00010000'                                  0524 01484000
         BNO   @RF00524                                            0524 01485000
*               CALL CONFLICT (14,'RDESUM,TABSIZE');       /*@Z427VLS*/ 01486000
         LA    @01,@AL00525                                        0525 01487000
         BAL   @14,CONFLICT                                        0525 01488000
*             IF PRINTFLG = ON THEN                                0526 01489000
@RF00524 TM    PRINTFLG,B'00001000'                                0526 01490000
         BNO   @RF00526                                            0526 01491000
*               CALL CONFLICT (12,'RDESUM,PRINT');         /*@Z427VLS*/ 01492000
         LA    @01,@AL00527                                        0527 01493000
         BAL   @14,CONFLICT                                        0527 01494000
*             IF SYMFLG = ON THEN                                  0528 01495000
@RF00526 TM    SYMFLG,B'00000100'                                  0528 01496000
         BNO   @RF00528                                            0528 01497000
*               CALL CONFLICT (13,'RDESUM,SYMCDE');        /*@Z427VLS*/ 01498000
         LA    @01,@AL00529                                        0529 01499000
         BAL   @14,CONFLICT                                        0529 01500000
*             IF ERRORFLG = ON THEN                                0530 01501000
@RF00528 TM    ERRORFLG,B'00000001'                                0530 01502000
         BNO   @RF00530                                            0530 01503000
*               CALL CONFLICT (14,'RDESUM,ERRORID');       /*@Z427VLS*/ 01504000
         LA    @01,@AL00531                                        0531 01505000
         BAL   @14,CONFLICT                                        0531 01506000
*             IF CPUFLG = ON THEN                                  0532 01507000
@RF00530 TM    CPUFLG,B'10000000'                                  0532 01508000
         BNO   @RF00532                                            0532 01509000
*               CALL CONFLICT (10,'RDESUM,CPU');           /*@Z427VLS*/ 01510000
         LA    @01,@AL00533                                        0533 01511000
         BAL   @14,CONFLICT                                        0533 01512000
*             IF CPUCUFLG = ON THEN                                0534 01513000
@RF00532 TM    CPUCUFLG,B'01000000'                                0534 01514000
         BNO   @RF00534                                            0534 01515000
*               CALL CONFLICT (13,'RDESUM,CPUCUA');        /*@Z427VLS*/ 01516000
         LA    @01,@AL00535                                        0535 01517000
         BAL   @14,CONFLICT                                        0535 01518000
*             IF VOLFLG = ON THEN                                  0536 01519000
@RF00534 TM    VOLFLG,B'00100000'                                  0536 01520000
         BNO   @RF00536                                            0536 01521000
*               CALL CONFLICT (12,'RDESUM,VOLID');         /*@Z427VLS*/ 01522000
         LA    @01,@AL00537                                        0537 01523000
         BAL   @14,CONFLICT                                        0537 01524000
*             IF PACC = ON & ACCFLG = ON THEN                      0538 01525000
@RF00536 TM    PACC(R2),B'01000000'                                0538 01526000
         BNO   @RF00538                                            0538 01527000
         TM    ACCFLG,B'00010000'                                  0538 01528000
         BNO   @RF00538                                            0538 01529000
*               CALL CONFLICT (10,'RDESUM,ACC');           /*@Z427VLS*/ 01530000
         LA    @01,@AL00539                                        0539 01531000
         BAL   @14,CONFLICT                                        0539 01532000
*             ELSE                                                 0540 01533000
*               DO;                                        /*@Z427VLS*/ 01534000
         B     @RC00538                                            0540 01535000
@RF00538 DS    0H                                                  0541 01536000
*                 PACC = OFF;                              /*@Z427VLS*/ 01537000
         NI    PACC(R2),B'10111111'                                0541 01538000
*                 OACCDEV = OFF;                           /*@Z427VLS*/ 01539000
         NI    OACCDEV(R2),B'11110111'                             0542 01540000
*               END;                                       /*@Z427VLS*/ 01541000
*             IF TERMFLG = ON THEN                                 0544 01542000
@RC00538 TM    TERMFLG,B'00001000'                                 0544 01543000
         BNO   @RF00544                                            0544 01544000
*               CALL CONFLICT (12,'RDESUM,TERMN');         /*@Z427VLS*/ 01545000
         LA    @01,@AL00545                                        0545 01546000
         BAL   @14,CONFLICT                                        0545 01547000
*             IF MODFLG = ON THEN                                  0546 01548000
@RF00544 TM    MODFLG,B'00000100'                                  0546 01549000
         BNO   @RF00546                                            0546 01550000
*               CALL CONFLICT (10,'RDESUM,MOD');           /*@Z427VLS*/ 01551000
         LA    @01,@AL00547                                        0547 01552000
         BAL   @14,CONFLICT                                        0547 01553000
*             IF LIBFLG = ON THEN                                  0548 01554000
@RF00546 TM    LIBFLG,B'00000010'                                  0548 01555000
         BNO   @RF00548                                            0548 01556000
*               CALL CONFLICT (13,'RDESUM,LIBADR');        /*@Z427VLS*/ 01557000
         LA    @01,@AL00549                                        0549 01558000
         BAL   @14,CONFLICT                                        0549 01559000
*             IF SERFLG = ON THEN                                  0550 01560000
@RF00548 TM    SERFLG,B'00000001'                                  0550 01561000
         BNO   @RF00550                                            0550 01562000
*               CALL CONFLICT (13,'RDESUM,DEVSER');        /*@Z427VLS*/ 01563000
         LA    @01,@AL00551                                        0551 01564000
         BAL   @14,CONFLICT                                        0551 01565000
*             IF DEVFLG = ON THEN                                  0552 01566000
@RF00550 TM    DEVFLG,B'00001000'                                  0552 01567000
         BNO   @RF00552                                            0552 01568000
*               CALL CONFLICT (10,'RDESUM,DEV');           /*@Z427VLS*/ 01569000
         LA    @01,@AL00553                                        0553 01570000
         BAL   @14,CONFLICT                                        0553 01571000
*             IF CUAFLG = ON THEN                                  0554 01572000
@RF00552 TM    CUAFLG,B'00000100'                                  0554 01573000
         BNO   @RF00554                                            0554 01574000
*               CALL CONFLICT (10,'RDESUM,CUA');           /*@Z427VLS*/ 01575000
         LA    @01,@AL00555                                        0555 01576000
         BAL   @14,CONFLICT                                        0555 01577000
*             IF SHORTOBR = ON THEN                                0556 01578000
@RF00554 TM    SHORTOBR(R2),B'00100000'                            0556 01579000
         BNO   @RF00556                                            0556 01580000
*               CALL CONFLICT (12,'RDESUM,SHORT');         /*@Z427VLS*/ 01581000
         LA    @01,@AL00557                                        0557 01582000
         BAL   @14,CONFLICT                                        0557 01583000
*             IF ZEROALL = ON THEN                                 0558 01584000
@RF00556 TM    ZEROALL(R2),B'01000000'                             0558 01585000
         BNO   @RF00558                                            0558 01586000
*               CALL CONFLICT (11,'RDESUM,ZERO');          /*@Z427VLS*/ 01587000
         LA    @01,@AL00559                                        0559 01588000
         BAL   @14,CONFLICT                                        0559 01589000
*             IF DATEFLG = ON THEN                                 0560 01590000
@RF00558 TM    DATEFLG,B'00000100'                                 0560 01591000
         BNO   @RF00560                                            0560 01592000
*               CALL CONFLICT (11,'RDESUM,DATE');          /*@Z427VLS*/ 01593000
         LA    @01,@AL00561                                        0561 01594000
         BAL   @14,CONFLICT                                        0561 01595000
*             IF HISTFLG = ON & PHIST = OFF THEN                   0562 01596000
@RF00560 TM    HISTFLG,B'10000000'                                 0562 01597000
         BNO   @RF00562                                            0562 01598000
         TM    PHIST(R2),B'00100000'                               0562 01599000
         BNZ   @RF00562                                            0562 01600000
*               CALL CONFLICT (11,'RDESUM,HIST');          /*@Z427VLS*/ 01601000
         LA    @01,@AL00563                                        0563 01602000
         BAL   @14,CONFLICT                                        0563 01603000
*           END;                                           /*@Z427VLS*/ 01604000
@RF00562 DS    0H                                                  0565 01605000
* IF ZEROALL = ON &                                                0565 01606000
*    ((RECTYPE & ALLRECS) ^= ALLRECS | DATEFLG = ON |              0565 01607000
*     SERFLG = ON | MODFLG = ON | TERMFLG = ON |                   0565 01608000
*     VOLFLG = ON | SYMFLG = ON | DEVFLG = ON  |                   0565 01609000
*     LIBFLG = ON | CPUFLG = ON | ERRORFLG = ON |                  0565 01610000
*     TIMEFLG = ON | CUAFLG = ON | CPUCUFLG = ON) THEN             0565 01611000
@RF00518 DS    0H                                                  0565 01612000
@RC00487 DS    0H                                                  0565 01613000
@RC00462 DS    0H                                                  0565 01614000
@RC00431 DS    0H                                                  0565 01615000
@RC00392 TM    ZEROALL(R2),B'01000000'                             0565 01616000
         BNO   @RF00565                                            0565 01617000
         MVC   @TS00001(2),RECTYPE(R2)                             0565 01618000
         NC    @TS00001(2),@CB00685                                0565 01619000
         CLC   @TS00001(2),@CB00685                                0565 01620000
         BNE   @RT00565                                            0565 01621000
         TM    DATEFLG,B'00000100'                                 0565 01622000
         BO    @RT00565                                            0565 01623000
         TM    SERFLG,B'00101101'                                  0565 01624000
         BNZ   @RT00565                                            0565 01625000
         TM    SYMFLG,B'00000100'                                  0565 01626000
         BO    @RT00565                                            0565 01627000
         TM    DEVFLG,B'00001000'                                  0565 01628000
         BO    @RT00565                                            0565 01629000
         TM    LIBFLG,B'10000010'                                  0565 01630000
         BNZ   @RT00565                                            0565 01631000
         TM    ERRORFLG,B'00100001'                                0565 01632000
         BNZ   @RT00565                                            0565 01633000
         TM    CUAFLG,B'00000100'                                  0565 01634000
         BO    @RT00565                                            0565 01635000
         TM    CPUCUFLG,B'01000000'                                0565 01636000
         BNO   @RF00565                                            0565 01637000
@RT00565 DS    0H                                                  0566 01638000
*   CALL CONFLICT(46,'ZERO USED WITH PARAMETER RESTRICTING RETRIEVAL'); 01639000
         LA    @01,@AL00566                                        0566 01640000
         BAL   @14,CONFLICT                                        0566 01641000
* IF PLOGREC = OFF & ZEROALL = ON THEN                             0567 01642000
@RF00565 TM    PLOGREC(R2),B'00000010'                             0567 01643000
         BNZ   @RF00567                                            0567 01644000
         TM    ZEROALL(R2),B'01000000'                             0567 01645000
         BNO   @RF00567                                            0567 01646000
*   CALL CONFLICT (9,'HIST,ZERO');                         /*@Z427VLS*/ 01647000
         LA    @01,@AL00568                                        0568 01648000
         BAL   @14,CONFLICT                                        0568 01649000
* IF MODPTR ^= ZERO & (CPUPTR ^= ZERO | CPCUAPTR ^= ZERO) THEN     0569 01650000
@RF00567 SLR   @08,@08                                             0569 01651000
         C     @08,MODPTR(,R2)                                     0569 01652000
         BE    @RF00569                                            0569 01653000
         C     @08,CPUPTR(,R2)                                     0569 01654000
         BNE   @RT00569                                            0569 01655000
         C     @08,CPCUAPTR(,R2)                                   0569 01656000
         BE    @RF00569                                            0569 01657000
@RT00569 DS    0H                                                  0570 01658000
*   CALL CONFLICT (14,'MOD,CPU/CPUCUA');                   /*@Z427VLS*/ 01659000
         LA    @01,@AL00570                                        0570 01660000
         BAL   @14,CONFLICT                                        0570 01661000
* IF CPCUAPTR ^= ZERO & (CUAPTR ^= ZERO | CPUPTR ^= ZERO) THEN     0571 01662000
@RF00569 SLR   @08,@08                                             0571 01663000
         C     @08,CPCUAPTR(,R2)                                   0571 01664000
         BE    @RF00571                                            0571 01665000
         C     @08,CUAPTR(,R2)                                     0571 01666000
         BNE   @RT00571                                            0571 01667000
         C     @08,CPUPTR(,R2)                                     0571 01668000
         BE    @RF00571                                            0571 01669000
@RT00571 DS    0H                                                  0572 01670000
*   CALL CONFLICT (14,'CPUCUA,CUA/CPU');                   /*@Z427VLS*/ 01671000
         LA    @01,@AL00572                                        0572 01672000
         BAL   @14,CONFLICT                                        0572 01673000
* IF LIBADPTR ^= ZERO & (SYMCDPTR ^= ZERO | VOLPTR ^= ZERO) THEN   0573 01674000
@RF00571 SLR   @08,@08                                             0573 01675000
         C     @08,LIBADPTR(,R2)                                   0573 01676000
         BE    @RF00573                                            0573 01677000
         C     @08,SYMCDPTR(,R2)                                   0573 01678000
         BNE   @RT00573                                            0573 01679000
         C     @08,VOLPTR(,R2)                                     0573 01680000
         BE    @RF00573                                            0573 01681000
@RT00573 DS    0H                                                  0574 01682000
*   CALL CONFLICT (19,'LIBADR,SYMCDE/VOLID');              /*@Z427VLS*/ 01683000
         LA    @01,@AL00574                                        0574 01684000
         BAL   @14,CONFLICT                                        0574 01685000
* IF ERRORFLG =ON & DATEFLG = OFF THEN                             0575 01686000
@RF00573 TM    ERRORFLG,B'00000001'                                0575 01687000
         BNO   @RF00575                                            0575 01688000
         TM    DATEFLG,B'00000100'                                 0575 01689000
         BNZ   @RF00575                                            0575 01690000
*   CALL CONFLICT (12,'ERRORID,DATE');                     /*@Z427VLS*/ 01691000
         LA    @01,@AL00576                                        0576 01692000
         BAL   @14,CONFLICT                                        0576 01693000
* /*                                                         @Z427VLS*/ 01694000
* /* IF TREND HAS BEEN SPECIFIED, A MAXIMUM OF 30 DAYS CAN BE SPECIFD*/ 01695000
* /*                                                         @Z427VLS*/ 01696000
* IF TREND = ON & DATEFLG = ON THEN                                0577 01697000
@RF00575 TM    TREND(R2),B'00010000'                               0577 01698000
         BNO   @RF00577                                            0577 01699000
         TM    DATEFLG,B'00000100'                                 0577 01700000
         BNO   @RF00577                                            0577 01701000
*   DO;                                                    /*@Z427VLS*/ 01702000
*     CVB (INDEX2,STDATE);               /* CONVERT TO BINARY FOR CHK*/ 01703000
         XC    @TS00001(8),@TS00001                                0579 01704000
         MVC   @TS00001+4(4),STDATE(R2)                            0579 01705000
         CVB   @08,@TS00001                                        0579 01706000
         ST    @08,INDEX2                                          0579 01707000
*     INDEX3 = INDEX2 / 1000;            /* GET THE YEAR     @Z427VLS*/ 01708000
         LA    @04,1000                                            0580 01709000
         LR    @00,@08                                             0580 01710000
         SRDA  @00,32                                              0580 01711000
         DR    @00,@04                                             0580 01712000
         LR    INDEX3,@01                                          0580 01713000
*     INDEX2 = INDEX2 - INDEX3*1000 + 29;  /* GET THE MAX DAY        */ 01714000
         LR    @01,@04                                             0581 01715000
         MR    @00,INDEX3                                          0581 01716000
         SLR   @08,@01                                             0581 01717000
         AL    @08,@CF00990                                        0581 01718000
         ST    @08,INDEX2                                          0581 01719000
*     IF ((INDEX3/4)*4) = INDEX3 THEN    /* LEAP YEAR        @Z427VLS*/ 01720000
         LR    @00,INDEX3                                          0582 01721000
         SRDA  @00,32                                              0582 01722000
         D     @00,@CF00039                                        0582 01723000
         SLA   @01,2                                               0582 01724000
         CR    @01,INDEX3                                          0582 01725000
         BNE   @RF00582                                            0582 01726000
*       INDEX1 = 366;                    /* YES, DET # OF DAYS/YEAR  */ 01727000
         LA    INDEX1,366                                          0583 01728000
*     ELSE                                                         0584 01729000
*       INDEX1 = 365;                    /* NO, SET FOR NON-LEAP YEAR*/ 01730000
         B     @RC00582                                            0584 01731000
@RF00582 LA    INDEX1,365                                          0584 01732000
*     IF INDEX2 > INDEX1 THEN            /* OVER THE YEAR BOUNDARY   */ 01733000
@RC00582 L     @08,INDEX2                                          0585 01734000
         CR    @08,INDEX1                                          0585 01735000
         BNH   @RF00585                                            0585 01736000
*       DO;                                                /*@Z427VLS*/ 01737000
*         INDEX3 = INDEX3 + 1;           /* STEP TO NEXT YEAR        */ 01738000
         AL    INDEX3,@CF00058                                     0587 01739000
*         INDEX2 = INDEX2 - INDEX1;      /* DECRE NUMBER OF DAYS     */ 01740000
         SLR   @08,INDEX1                                          0588 01741000
         ST    @08,INDEX2                                          0588 01742000
*       END;                                               /*@Z427VLS*/ 01743000
*     INDEX2 = INDEX2 + INDEX3*1000;     /* DETERMINE NEW YEAR/DAY   */ 01744000
@RF00585 LR    @08,INDEX3                                          0590 01745000
         MH    @08,@CH00989                                        0590 01746000
         AL    @08,INDEX2                                          0590 01747000
         ST    @08,INDEX2                                          0590 01748000
*     CVB (INDEX3,ENDDATE);              /* CONVERT TO BINARY 4 COMP */ 01749000
         XC    @TS00001(8),@TS00001                                0591 01750000
         MVC   @TS00001+4(4),ENDDATE(R2)                           0591 01751000
         CVB   INDEX3,@TS00001                                     0591 01752000
*     IF INDEX2 < INDEX3 THEN                                      0592 01753000
         CR    @08,INDEX3                                          0592 01754000
         BNL   @RF00592                                            0592 01755000
*         CALL CONFLICT (24,'TRENDS,DATE(RANGE > 30) ');   /*@0001VLS*/ 01756000
         LA    @01,@AL00593                                        0593 01757000
         BAL   @14,CONFLICT                                        0593 01758000
*   END;                                                   /*@Z427VLS*/ 01759000
@RF00592 DS    0H                                                  0595 01760000
* IF TERMFLG = ON & POBR = OFF THEN                                0595 01761000
@RF00577 TM    TERMFLG,B'00001000'                                 0595 01762000
         BNO   @RF00595                                            0595 01763000
         TM    POBR(R2),B'00100000'                                0595 01764000
         BNZ   @RF00595                                            0595 01765000
*   CALL CONFLICT (15,'TERMN,TYPE(OBR)');                  /*@Z427VLS*/ 01766000
         LA    @01,@AL00596                                        0596 01767000
         BAL   @14,CONFLICT                                        0596 01768000
* IF LIBADPTR ^= ZERO & PTTYP = OFF THEN                           0597 01769000
@RF00595 L     @08,LIBADPTR(,R2)                                   0597 01770000
         LTR   @08,@08                                             0597 01771000
         BZ    @RF00597                                            0597 01772000
         TM    PTTYP(R2),B'10000000'                               0597 01773000
         BNZ   @RF00597                                            0597 01774000
*   CALL CONFLICT (16,'LIBADR,TYPE(MDR)');                 /*@Z427VLS*/ 01775000
         LA    @01,@AL00598                                        0598 01776000
         BAL   @14,CONFLICT                                        0598 01777000
* IF (CUAPTR ^= ZERO | CPCUAPTR ^= ZERO) &                         0599 01778000
*    (PCHAN = OFF & POBR = OFF & PDDR = OFF & PTTYP = OFF) THEN    0599 01779000
@RF00597 SLR   @08,@08                                             0599 01780000
         C     @08,CUAPTR(,R2)                                     0599 01781000
         BNE   @GL00028                                            0599 01782000
         C     @08,CPCUAPTR(,R2)                                   0599 01783000
         BE    @RF00599                                            0599 01784000
@GL00028 TM    PCHAN(R2),B'01100100'                               0599 01785000
         BNZ   @RF00599                                            0599 01786000
         TM    PTTYP(R2),B'10000000'                               0599 01787000
         BNZ   @RF00599                                            0599 01788000
*   CALL CONFLICT (32,'TYPE(CCH,OBR,DDR,MDR),CUA/CPUCUA'); /*@Z427VLS*/ 01789000
         LA    @01,@AL00600                                        0600 01790000
         BAL   @14,CONFLICT                                        0600 01791000
* IF DEVPTR ^= ZERO &                                              0601 01792000
*   (POBR = OFF & PMIH = OFF & PDDR = OFF & PTTYP = OFF) THEN      0601 01793000
@RF00599 L     @08,DEVPTR(,R2)                                     0601 01794000
         LTR   @08,@08                                             0601 01795000
         BZ    @RF00601                                            0601 01796000
         TM    POBR(R2),B'00100110'                                0601 01797000
         BNZ   @RF00601                                            0601 01798000
         TM    PTTYP(R2),B'10000000'                               0601 01799000
         BNZ   @RF00601                                            0601 01800000
*   CALL CONFLICT (25,'DEV,TYPE(OBR,MIH,DDR,MDR)');        /*@Z427VLS*/ 01801000
         LA    @01,@AL00602                                        0602 01802000
         BAL   @14,CONFLICT                                        0602 01803000
* IF TERMFLG = ON &                                                0603 01804000
*    (LIBADPTR ^= ZERO | SYMCDPTR ^= ZERO | VOLPTR ^= ZERO) THEN   0603 01805000
@RF00601 TM    TERMFLG,B'00001000'                                 0603 01806000
         BNO   @RF00603                                            0603 01807000
         SLR   @08,@08                                             0603 01808000
         C     @08,LIBADPTR(,R2)                                   0603 01809000
         BNE   @RT00603                                            0603 01810000
         C     @08,SYMCDPTR(,R2)                                   0603 01811000
         BNE   @RT00603                                            0603 01812000
         C     @08,VOLPTR(,R2)                                     0603 01813000
         BE    @RF00603                                            0603 01814000
@RT00603 DS    0H                                                  0604 01815000
*   CALL CONFLICT (25,'TERMN,LIBADR/SYMCDE/VOLID');        /*@Z427VLS*/ 01816000
         LA    @01,@AL00604                                        0604 01817000
         BAL   @14,CONFLICT                                        0604 01818000
* IF SHORTOBR = ON & POBR = OFF THEN                               0605 01819000
@RF00603 TM    SHORTOBR(R2),B'00100000'                            0605 01820000
         BNO   @RF00605                                            0605 01821000
         TM    POBR(R2),B'00100000'                                0605 01822000
         BNZ   @RF00605                                            0605 01823000
*   CALL CONFLICT (15,'SHORT,TYPE(OBR)');                  /*@Z427VLS*/ 01824000
         LA    @01,@AL00606                                        0606 01825000
         BAL   @14,CONFLICT                                        0606 01826000
* IF SHORTOBR = ON & PEDIT = OFF THEN                              0607 01827000
@RF00605 TM    SHORTOBR(R2),B'00100000'                            0607 01828000
         BNO   @RF00607                                            0607 01829000
         TM    PEDIT(R2),B'00010000'                               0607 01830000
         BNZ   @RF00607                                            0607 01831000
*   CALL CONFLICT (11,'SHORT,PRINT');                      /*@Z427VLS*/ 01832000
         LA    @01,@AL00608                                        0608 01833000
         BAL   @14,CONFLICT                                        0608 01834000
* IF ERRORID = ON & PMCH = OFF & PSOFT = OFF THEN                  0609 01835000
@RF00607 TM    ERRORID(R2),B'00000100'                             0609 01836000
         BNO   @RF00609                                            0609 01837000
         TM    PMCH(R2),B'10010000'                                0609 01838000
         BNZ   @RF00609                                            0609 01839000
*   CALL CONFLICT (22,'ERRORID,TYPE(MCH,SOFT)');           /*@Z427VLS*/ 01840000
         LA    @01,@AL00610                                        0610 01841000
         BAL   @14,CONFLICT                                        0610 01842000
* /*                                                         @Z427VLS*/ 01843000
* /* FOR VOLID (NOT MES) & FAULT SYMPTOM CODE, ONLY 33XX DEVICES CAN */ 01844000
* /* HAVE BEEN SPECIFIED.                                    @Z427VLS*/ 01845000
* /*                                                         @Z427VLS*/ 01846000
* IF DEVPTR ^= ZERO &                                              0611 01847000
*   TIMESEQ = OFF &                                                0611 01848000
*   (SYMCDPTR ^= ZERO | (PARMMES = OFF & VOLPTR ^= ZERO)) THEN     0611 01849000
@RF00609 SLR   @08,@08                                             0611 01850000
         C     @08,DEVPTR(,R2)                                     0611 01851000
         BE    @RF00611                                            0611 01852000
         TM    TIMESEQ(R2),B'00000010'                             0611 01853000
         BNZ   @RF00611                                            0611 01854000
         C     @08,SYMCDPTR(,R2)                                   0611 01855000
         BNE   @RT00611                                            0611 01856000
         TM    PARMMES(R2),B'01000000'                             0611 01857000
         BNZ   @RF00611                                            0611 01858000
         C     @08,VOLPTR(,R2)                                     0611 01859000
         BE    @RF00611                                            0611 01860000
@RT00611 DS    0H                                                  0612 01861000
*   DO INDEX2 = ZERO;                                      /*@Z427VLS*/ 01862000
         SLR   @08,@08                                             0612 01863000
         ST    @08,INDEX2                                          0612 01864000
*     DO J = 1 TO DEVNUM BY 1;          /* CHECK EACH ENTRY  @Z427VLS*/ 01865000
         LA    J,1                                                 0613 01866000
         B     @DE00613                                            0613 01867000
@DL00613 DS    0H                                                  0614 01868000
*       HOLDAREA = HOLDAREA && HOLDAREA;                   /*@G51DGVS*/ 01869000
         XC    HOLDAREA(5),HOLDAREA                                0614 01870000
*       CALL IFCDEVIC(22,DEVVAL(J),HOLDAREA);              /*@G51DGVS*/ 01871000
         MVC   @AL00001(12),@AL00615                               0615 01872000
         LR    @08,J                                               0615 01873000
         ALR   @08,@08                                             0615 01874000
         L     @03,DEVPTR(,R2)                                     0615 01875000
         LA    @08,DEVVAL-2(@08,@03)                               0615 01876000
         ST    @08,@AL00001+4                                      0615 01877000
         L     @15,@CV00760                                        0615 01878000
         LA    @01,@AL00001                                        0615 01879000
         BALR  @14,@15                                             0615 01880000
*       IF HOLDAREA(1:2) = '33' THEN                               0616 01881000
         CLC   HOLDAREA(2),@CC01016                                0616 01882000
         BNE   @RF00616                                            0616 01883000
*           INDEX2 = INDEX2 + 1;                           /*@Z427VLS*/ 01884000
         LA    @08,1                                               0617 01885000
         AL    @08,INDEX2                                          0617 01886000
         ST    @08,INDEX2                                          0617 01887000
*     END;                                                 /*@Z427VLS*/ 01888000
@RF00616 AL    J,@CF00058                                          0618 01889000
@DE00613 L     @08,DEVPTR(,R2)                                     0618 01890000
         CH    J,DEVNUM(,@08)                                      0618 01891000
         BNH   @DL00613                                            0618 01892000
*     IF INDEX2 ^= DEVNUM THEN                                     0619 01893000
         L     @08,DEVPTR(,R2)                                     0619 01894000
         L     @04,INDEX2                                          0619 01895000
         CH    @04,DEVNUM(,@08)                                    0619 01896000
         BE    @RF00619                                            0619 01897000
*       DEVSW = ON;                                        /*@Z427VLS*/ 01898000
         OI    DEVSW,B'01000000'                                   0620 01899000
*     INDEX2 = ZERO;                                       /*@Z427VLS*/ 01900000
@RF00619 SLR   @08,@08                                             0621 01901000
         ST    @08,INDEX2                                          0621 01902000
*     DO J = 1 TO MDRNUM BY 1;          /* CHECK EACH ENTRY  @Z427VLS*/ 01903000
         LA    J,1                                                 0622 01904000
         B     @DE00622                                            0622 01905000
@DL00622 DS    0H                                                  0623 01906000
*       HOLDAREA = HOLDAREA && HOLDAREA;                   /*@G51DGVS*/ 01907000
         XC    HOLDAREA(5),HOLDAREA                                0623 01908000
*       CALL IFCDEVIC(32,MDRVAL(J),HOLDAREA);              /*@G51DGVS*/ 01909000
         MVC   @AL00001(12),@AL00624                               0624 01910000
         L     @08,DEVPTR(,R2)                                     0624 01911000
         LA    @08,MDRVAL-1(J,@08)                                 0624 01912000
         ST    @08,@AL00001+4                                      0624 01913000
         L     @15,@CV00760                                        0624 01914000
         LA    @01,@AL00001                                        0624 01915000
         BALR  @14,@15                                             0624 01916000
*       IF HOLDAREA(1:2) = '33' THEN                               0625 01917000
         CLC   HOLDAREA(2),@CC01016                                0625 01918000
         BNE   @RF00625                                            0625 01919000
*           INDEX2 = INDEX2 + 1;                           /*@Z427VLS*/ 01920000
         LA    @08,1                                               0626 01921000
         AL    @08,INDEX2                                          0626 01922000
         ST    @08,INDEX2                                          0626 01923000
*     END;                                                 /*@Z427VLS*/ 01924000
@RF00625 AL    J,@CF00058                                          0627 01925000
@DE00622 L     @08,DEVPTR(,R2)                                     0627 01926000
         CH    J,MDRNUM(,@08)                                      0627 01927000
         BNH   @DL00622                                            0627 01928000
*     IF INDEX2 ^= MDRNUM | DEVEXCL = ON | DEVSW = ON THEN         0628 01929000
         L     @08,DEVPTR(,R2)                                     0628 01930000
         L     @04,INDEX2                                          0628 01931000
         CH    @04,MDRNUM(,@08)                                    0628 01932000
         BNE   @RT00628                                            0628 01933000
         TM    DEVEXCL(R2),B'00100000'                             0628 01934000
         BO    @RT00628                                            0628 01935000
         TM    DEVSW,B'01000000'                                   0628 01936000
         BNO   @RF00628                                            0628 01937000
@RT00628 DS    0H                                                  0629 01938000
*       CALL CONFLICT (25,'DEVICE(33XX),SYMCDE/VOLID');    /*@Z427VLS*/ 01939000
         LA    @01,@AL00629                                        0629 01940000
         BAL   @14,CONFLICT                                        0629 01941000
*   END;                                                   /*@Z427VLS*/ 01942000
@RF00628 DS    0H                                                  0631 01943000
* /*                                                         @Z427VLS*/ 01944000
* /* FOR VOLID AND MES, ONLY 34XX DEVICE CAN HAVE BEEN SPECIFIED.    */ 01945000
* /*                                                         @Z427VLS*/ 01946000
* IF DEVPTR ^= ZERO & PARMMES = ON THEN                            0631 01947000
@RF00611 SLR   @08,@08                                             0631 01948000
         C     @08,DEVPTR(,R2)                                     0631 01949000
         BE    @RF00631                                            0631 01950000
         TM    PARMMES(R2),B'01000000'                             0631 01951000
         BNO   @RF00631                                            0631 01952000
*   DO INDEX2 = ZERO;                                      /*@Z427VLS*/ 01953000
         ST    @08,INDEX2                                          0632 01954000
*     DO J = 1 TO DEVNUM BY 1;          /* CHECK EACH ENTRY  @Z427VLS*/ 01955000
         LA    J,1                                                 0633 01956000
         B     @DE00633                                            0633 01957000
@DL00633 DS    0H                                                  0634 01958000
*       HOLDAREA = HOLDAREA && HOLDAREA;                   /*@G51DGVS*/ 01959000
         XC    HOLDAREA(5),HOLDAREA                                0634 01960000
*       CALL IFCDEVIC(22,DEVVAL(J),HOLDAREA);              /*@G51DGVS*/ 01961000
         MVC   @AL00001(12),@AL00635                               0635 01962000
         LR    @08,J                                               0635 01963000
         ALR   @08,@08                                             0635 01964000
         L     @03,DEVPTR(,R2)                                     0635 01965000
         LA    @08,DEVVAL-2(@08,@03)                               0635 01966000
         ST    @08,@AL00001+4                                      0635 01967000
         L     @15,@CV00760                                        0635 01968000
         LA    @01,@AL00001                                        0635 01969000
         BALR  @14,@15                                             0635 01970000
*       IF HOLDAREA(1:2) = '34' THEN                               0636 01971000
         CLC   HOLDAREA(2),@CC01020                                0636 01972000
         BNE   @RF00636                                            0636 01973000
*         INDEX2 = INDEX2 + 1;                             /*@Z427VLS*/ 01974000
         LA    @08,1                                               0637 01975000
         AL    @08,INDEX2                                          0637 01976000
         ST    @08,INDEX2                                          0637 01977000
*     END;                                                 /*@Z427VLS*/ 01978000
@RF00636 AL    J,@CF00058                                          0638 01979000
@DE00633 L     @08,DEVPTR(,R2)                                     0638 01980000
         CH    J,DEVNUM(,@08)                                      0638 01981000
         BNH   @DL00633                                            0638 01982000
*     IF MDRNUM ^= ZERO | DEVEXCL = ON | INDEX2 ^= DEVNUM THEN     0639 01983000
         L     @08,DEVPTR(,R2)                                     0639 01984000
         LH    @04,MDRNUM(,@08)                                    0639 01985000
         LTR   @04,@04                                             0639 01986000
         BNZ   @RT00639                                            0639 01987000
         TM    DEVEXCL(R2),B'00100000'                             0639 01988000
         BO    @RT00639                                            0639 01989000
         L     @04,INDEX2                                          0639 01990000
         CH    @04,DEVNUM(,@08)                                    0639 01991000
         BE    @RF00639                                            0639 01992000
@RT00639 DS    0H                                                  0640 01993000
*       CALL CONFLICT (26,'DEVICE(34XX),MES/THRESHOLD');   /*@Z427VLS*/ 01994000
         LA    @01,@AL00640                                        0640 01995000
         BAL   @14,CONFLICT                                        0640 01996000
*   END;                                                   /*@Z427VLS*/ 01997000
@RF00639 DS    0H                                                  0642 01998000
* /*                                                         @Z427VLS*/ 01999000
* /* FOR LIBADR, ONLY 3705 DEVICE CAN HAVE BEEN SPECIFIED.   @Z427VLS*/ 02000000
* /*                                                         @Z427VLS*/ 02001000
* IF DEVPTR ^= ZERO & LIBADPTR ^= ZERO THEN                        0642 02002000
@RF00631 SLR   @08,@08                                             0642 02003000
         C     @08,DEVPTR(,R2)                                     0642 02004000
         BE    @RF00642                                            0642 02005000
         C     @08,LIBADPTR(,R2)                                   0642 02006000
         BE    @RF00642                                            0642 02007000
*   DO INDEX2 = ZERO;                                      /*@Z427VLS*/ 02008000
         ST    @08,INDEX2                                          0643 02009000
*     DO J = 1 TO DEVNUM BY 1;          /* CHECK EACH ENTRY  @Z427VLS*/ 02010000
         LA    J,1                                                 0644 02011000
         B     @DE00644                                            0644 02012000
@DL00644 DS    0H                                                  0645 02013000
*       HOLDAREA = HOLDAREA && HOLDAREA;                   /*@G51DGVS*/ 02014000
         XC    HOLDAREA(5),HOLDAREA                                0645 02015000
*       CALL IFCDEVIC(22,DEVVAL(J),HOLDAREA);              /*@G51DGVS*/ 02016000
         MVC   @AL00001(12),@AL00646                               0646 02017000
         LR    @08,J                                               0646 02018000
         ALR   @08,@08                                             0646 02019000
         L     @03,DEVPTR(,R2)                                     0646 02020000
         LA    @08,DEVVAL-2(@08,@03)                               0646 02021000
         ST    @08,@AL00001+4                                      0646 02022000
         L     @15,@CV00760                                        0646 02023000
         LA    @01,@AL00001                                        0646 02024000
         BALR  @14,@15                                             0646 02025000
*       IF HOLDAREA(1:4) = '3705' THEN                             0647 02026000
         CLC   HOLDAREA(4),@CC01025                                0647 02027000
         BNE   @RF00647                                            0647 02028000
*           INDEX2 = INDEX2 + 1;                           /*@Z427VLS*/ 02029000
         LA    @08,1                                               0648 02030000
         AL    @08,INDEX2                                          0648 02031000
         ST    @08,INDEX2                                          0648 02032000
*     END;                                                 /*@Z427VLS*/ 02033000
@RF00647 AL    J,@CF00058                                          0649 02034000
@DE00644 L     @08,DEVPTR(,R2)                                     0649 02035000
         CH    J,DEVNUM(,@08)                                      0649 02036000
         BNH   @DL00644                                            0649 02037000
*     IF INDEX2 ^= DEVNUM THEN                                     0650 02038000
         L     @08,DEVPTR(,R2)                                     0650 02039000
         L     @04,INDEX2                                          0650 02040000
         CH    @04,DEVNUM(,@08)                                    0650 02041000
         BE    @RF00650                                            0650 02042000
*       DEVSW = ON;                                        /*@Z427VLS*/ 02043000
         OI    DEVSW,B'01000000'                                   0651 02044000
*     INDEX2 = ZERO;                                       /*@Z427VLS*/ 02045000
@RF00650 SLR   @08,@08                                             0652 02046000
         ST    @08,INDEX2                                          0652 02047000
*     DO J = 1 TO MDRNUM BY 1;          /* CHECK EACH ENTRY  @Z427VLS*/ 02048000
         LA    J,1                                                 0653 02049000
         B     @DE00653                                            0653 02050000
@DL00653 DS    0H                                                  0654 02051000
*       HOLDAREA = HOLDAREA && HOLDAREA;                   /*@G51DGVS*/ 02052000
         XC    HOLDAREA(5),HOLDAREA                                0654 02053000
*       CALL IFCDEVIC(32,MDRVAL(J),HOLDAREA);              /*@G51DGVS*/ 02054000
         MVC   @AL00001(12),@AL00655                               0655 02055000
         L     @08,DEVPTR(,R2)                                     0655 02056000
         LA    @08,MDRVAL-1(J,@08)                                 0655 02057000
         ST    @08,@AL00001+4                                      0655 02058000
         L     @15,@CV00760                                        0655 02059000
         LA    @01,@AL00001                                        0655 02060000
         BALR  @14,@15                                             0655 02061000
*       IF HOLDAREA(1:4) = '3705' THEN                             0656 02062000
         CLC   HOLDAREA(4),@CC01025                                0656 02063000
         BNE   @RF00656                                            0656 02064000
*           INDEX2 = INDEX2 + 1;                           /*@Z427VLS*/ 02065000
         LA    @08,1                                               0657 02066000
         AL    @08,INDEX2                                          0657 02067000
         ST    @08,INDEX2                                          0657 02068000
*     END;                                                 /*@Z427VLS*/ 02069000
@RF00656 AL    J,@CF00058                                          0658 02070000
@DE00653 L     @08,DEVPTR(,R2)                                     0658 02071000
         CH    J,MDRNUM(,@08)                                      0658 02072000
         BNH   @DL00653                                            0658 02073000
*     IF INDEX2 ^= MDRNUM | DEVEXCL = ON | DEVSW = ON THEN         0659 02074000
         L     @08,DEVPTR(,R2)                                     0659 02075000
         L     @04,INDEX2                                          0659 02076000
         CH    @04,MDRNUM(,@08)                                    0659 02077000
         BNE   @RT00659                                            0659 02078000
         TM    DEVEXCL(R2),B'00100000'                             0659 02079000
         BO    @RT00659                                            0659 02080000
         TM    DEVSW,B'01000000'                                   0659 02081000
         BNO   @RF00659                                            0659 02082000
@RT00659 DS    0H                                                  0660 02083000
*       CALL CONFLICT (19,'DEVICE(3705),LIBADR');          /*@Z427VLS*/ 02084000
         LA    @01,@AL00660                                        0660 02085000
         BAL   @14,CONFLICT                                        0660 02086000
*   END;                                                   /*@Z427VLS*/ 02087000
@RF00659 DS    0H                                                  0662 02088000
* IF TIMEFLG = ON & DATEFLG = OFF THEN                             0662 02089000
@RF00642 TM    TIMEFLG,B'00100000'                                 0662 02090000
         BNO   @RF00662                                            0662 02091000
         TM    DATEFLG,B'00000100'                                 0662 02092000
         BNZ   @RF00662                                            0662 02093000
*   CALL CONFLICT (9,'TIME,DATE');                         /*@Z427VLS*/ 02094000
         LA    @01,@AL00663                                        0663 02095000
         BAL   @14,CONFLICT                                        0663 02096000
* IF HISTFLG = ON & MERGEFLG = ON THEN                             0664 02097000
@RF00662 TM    HISTFLG,B'10100000'                                 0664 02098000
         BNO   @RF00664                                            0664 02099000
*   CALL CONFLICT (10,'HIST,MERGE');                       /*@Z427VLS*/ 02100000
         LA    @01,@AL00665                                        0665 02101000
         BAL   @14,CONFLICT                                        0665 02102000
* IF ZEROALL=ON  THEN                                              0666 02103000
@RF00664 TM    ZEROALL(R2),B'01000000'                             0666 02104000
         BNO   @RF00666                                            0666 02105000
*   DO;                                                    /*@ZA24155*/ 02106000
*     IF (PACC=ON | PEDIT=ON) |                                    0668 02107000
*        (PACC=ON | (PEDIT=ON & PSUM=ON)) |                        0668 02108000
*        (PACC=ON & (TREND=ON |SYSUM=ON))                          0668 02109000
*       THEN;                        /* SEE FIG 3 NOTE 1 SRL @XA21195*/ 02110000
         TM    PACC(R2),B'01010000'                                0668 02111000
         BNZ   @RT00668                                            0668 02112000
         TM    PACC(R2),B'01000000'                                0668 02113000
         BO    @RT00668                                            0668 02114000
         TM    PEDIT(R2),B'00011000'                               0668 02115000
         BO    @RT00668                                            0668 02116000
         TM    PACC(R2),B'01000000'                                0668 02117000
         BNO   @RF00668                                            0668 02118000
         TM    TREND(R2),B'00010100'                               0668 02119000
         BNZ   @RT00668                                            0668 02120000
*        ELSE                                                      0670 02121000
*          CALL CONFLICT (31,'CLEARING LOGREC IS NOT ALLOWED.');   0670 02122000
@RF00668 LA    @01,@AL00670                                        0670 02123000
         BAL   @14,CONFLICT                                        0670 02124000
*   END;                                                   /*@ZA24155*/ 02125000
@RT00668 DS    0H                                                  0672 02126000
*/********************************************************************/ 02127000
*/*                                                          @Z427VLS*/ 02128000
*/* CERTAIN VALUES FOR CERTAIN PARAMETERS WILL BE FORCED IF THEY ARE */ 02129000
*/* NOT PRESENT.  THE NECESSARY VALUES ARE FORCED PER SRL.   @Z427VLS*/ 02130000
*/*                                                          @Z427VLS*/ 02131000
*/********************************************************************/ 02132000
* IF RETCODE = ZERO THEN                                           0672 02133000
@RF00666 L     @08,RETCODE                                         0672 02134000
         LTR   @08,@08                                             0672 02135000
         BNZ   @RF00672                                            0672 02136000
*   DO;                                                    /*@Z427VLS*/ 02137000
*     IF SYSUM = ON & PACC = ON & PLOGREC = ON &                   0674 02138000
*        DATEFLG = OFF & TIMEFLG = OFF THEN                        0674 02139000
         TM    SYSUM(R2),B'00000100'                               0674 02140000
         BNO   @RF00674                                            0674 02141000
         TM    PACC(R2),B'01000010'                                0674 02142000
         BNO   @RF00674                                            0674 02143000
         TM    DATEFLG,B'00000100'                                 0674 02144000
         BNZ   @RF00674                                            0674 02145000
         TM    TIMEFLG,B'00100000'                                 0674 02146000
         BNZ   @RF00674                                            0674 02147000
*       ZEROALL = ON;                                      /*@Z427VLS*/ 02148000
         OI    ZEROALL(R2),B'01000000'                             0675 02149000
*     IF PARMTHR = ON THEN                                         0676 02150000
@RF00674 TM    PARMTHR(R2),B'00001000'                             0676 02151000
         BNO   @RF00676                                            0676 02152000
*       DO;                                                /*@Z427VLS*/ 02153000
*         PEDIT = ON;                                      /*@Z427VLS*/ 02154000
*         PSUM = ON;                                       /*@Z427VLS*/ 02155000
         OI    PEDIT(R2),B'00011000'                               0679 02156000
*       END;                                               /*@Z427VLS*/ 02157000
*     IF PARMMES = ON THEN                                         0681 02158000
@RF00676 TM    PARMMES(R2),B'01000000'                             0681 02159000
         BNO   @RF00681                                            0681 02160000
*       DO;                                                /*@Z427VLS*/ 02161000
*         PMCH = OFF;                                      /*@Z427VLS*/ 02162000
*         PCHAN = OFF;                                     /*@Z427VLS*/ 02163000
*         PSOFT = OFF;                                     /*@Z427VLS*/ 02164000
*         PIPL = OFF;                                      /*@Z427VLS*/ 02165000
*         PDDR = OFF;                                      /*@Z427VLS*/ 02166000
*         PMIH = OFF;                                      /*@Z427VLS*/ 02167000
*         PEOD = OFF;                                      /*@Z427VLS*/ 02168000
         NI    PMCH(R2),B'00100000'                                0689 02169000
*         PTTYP = OFF;                                     /*@Z427VLS*/ 02170000
         NI    PTTYP(R2),B'01111111'                               0690 02171000
*       END;                                               /*@Z427VLS*/ 02172000
*     IF PEDIT = ON | PSUM = ON | SYSUM = ON |                     0692 02173000
*        TREND = ON | TIMESEQ = ON THEN                            0692 02174000
@RF00681 TM    PEDIT(R2),B'00011000'                               0692 02175000
         BNZ   @RT00692                                            0692 02176000
         TM    SYSUM(R2),B'00010110'                               0692 02177000
         BZ    @RF00692                                            0692 02178000
@RT00692 DS    0H                                                  0693 02179000
*       OEREPPT = ON;                                      /*@Z427VLS*/ 02180000
         OI    OEREPPT(R2),B'01000000'                             0693 02181000
*     IF RDESUM = ON THEN                                          0694 02182000
@RF00692 TM    RDESUM(R2),B'10000000'                              0694 02183000
         BNO   @RF00694                                            0694 02184000
*       DO;                                                /*@Z427VLS*/ 02185000
*         OEREPPT = ON;                                    /*@Z427VLS*/ 02186000
*         ODRCTWRK = OFF;                                  /*@Z427VLS*/ 02187000
         OI    OEREPPT(R2),B'01000000'                             0697 02188000
         NI    ODRCTWRK(R2),B'11111101'                            0697 02189000
*         PHIST = ON;                                      /*@Z427VLS*/ 02190000
         OI    PHIST(R2),B'00100000'                               0698 02191000
*         IF MERGEFLG = OFF THEN                                   0699 02192000
         TM    MERGEFLG,B'00100000'                                0699 02193000
         BNZ   @RF00699                                            0699 02194000
*           PLOGREC = OFF;                                 /*@Z427VLS*/ 02195000
         NI    PLOGREC(R2),B'11111101'                             0700 02196000
*         OSERLOG = OFF;                                   /*@Z427VLS*/ 02197000
@RF00699 DS    0H                                                  0702 02198000
*         OACCIN = ON;                                     /*@Z427VLS*/ 02199000
         OI    OACCIN(R2),B'00010000'                              0702 02200000
         NI    OSERLOG(R2),B'11011111'                             0702 02201000
*       END;                                               /*@Z427VLS*/ 02202000
*       OSYSIN = ON;                                       /*@Z427VLS*/ 02203000
@RF00694 OI    OSYSIN(R2),B'00000100'                              0704 02204000
*     IF SYSUM = OFF & TREND = OFF & PARMMES = OFF &               0705 02205000
*            RDESUM = OFF & TIMESEQ = OFF & PEDIT = ON THEN        0705 02206000
         TM    SYSUM(R2),B'11010110'                               0705 02207000
         BNZ   @RF00705                                            0705 02208000
         TM    PEDIT(R2),B'00010000'                               0705 02209000
         BNO   @RF00705                                            0705 02210000
*           DO;                                            /*@Z427VLS*/ 02211000
*              /*                                            @Z427VLS*/ 02212000
*              /* GET SPACE FOR THE STORAGE MANAGEMENT TABLE @Z427VLS*/ 02213000
*              /*                                            @Z427VLS*/ 02214000
*              RESPECIFY (R1) RESTRICTED;                  /*@Z427VLS*/ 02215000
*              R1 = 152;                                   /*@Z427VLS*/ 02216000
         LA    R1,152                                              0708 02217000
*              GEN (GETMAIN R,LV=(R1),SP=40);              /*@Z427VLS*/ 02218000
         GETMAIN R,LV=(R1),SP=40                                        02219000
*              ADEDITB = (R1);          /* ESTABLISH BASE POINTER    */ 02220000
         ST    R1,ADEDITB(,R2)                                     0710 02221000
*              RESPECIFY (R1) UNRESTRICTED;                /*@Z427VLS*/ 02222000
*              EDITLOAD = EDITLOAD && EDITLOAD;  /* CLEAR    @Z427VLS*/ 02223000
         L     @08,ADEDITB(,R2)                                    0712 02224000
         XC    EDITLOAD(148,@08),EDITLOAD(@08)                     0712 02225000
*              DO I = 1 TO 12 BY 1;                        /*@Z427VLS*/ 02226000
         LA    @08,1                                               0713 02227000
         ST    @08,I                                               0713 02228000
@DL00713 DS    0H                                                  0714 02229000
*                LOADNAME(I) = BLANKS8;  /* STORE BLANKS FOR NAMES   */ 02230000
         LR    @04,@08                                             0714 02231000
         MH    @04,@CH00037                                        0714 02232000
         L     @03,ADEDITB(,R2)                                    0714 02233000
         ALR   @03,@04                                             0714 02234000
         AL    @03,@CF01199                                        0714 02235000
         MVC   LOADNAME-4(8,@03),@CC00705                          0714 02236000
*              END;                                        /*@Z427VLS*/ 02237000
         AL    @08,@CF00058                                        0715 02238000
         ST    @08,I                                               0715 02239000
         C     @08,@CF00037                                        0715 02240000
         BNH   @DL00713                                            0715 02241000
*           END;                                           /*@Z427VLS*/ 02242000
*         IF DEVPTR = ZERO & PARMMES = ON THEN                     0717 02243000
@RF00705 L     @08,DEVPTR(,R2)                                     0717 02244000
         LTR   @08,@08                                             0717 02245000
         BNZ   @RF00717                                            0717 02246000
         TM    PARMMES(R2),B'01000000'                             0717 02247000
         BNO   @RF00717                                            0717 02248000
*           DO;                                            /*@Z427VLS*/ 02249000
*              /*                                            @Z427VLS*/ 02250000
*              /* GET SPACE FOR THE DEVICE TABLE.  ESTABLISH THE BASE*/ 02251000
*              /* POINTER.  CLEAR THE TABLE.  SET THE VALUES IN THE  */ 02252000
*              /* TABLE FOR 34XX DEVICES.                    @Z427VLS*/ 02253000
*              /*                                            @Z427VLS*/ 02254000
*             RESPECIFY (R1) RESTRICTED;                   /*@Z427VLS*/ 02255000
*                 R1 = 256;                               /*@0001VLS*/  02256000
         LA    R1,256                                              0720 02257000
*             GEN (GETMAIN R,LV=(R1),SP=20);               /*@Z427VLS*/ 02258000
         GETMAIN R,LV=(R1),SP=20                                        02259000
*             DEVPTR = R1;                                 /*@Z427VLS*/ 02260000
         ST    R1,DEVPTR(,R2)                                      0722 02261000
*             RESPECIFY (R1) UNRESTRICTED;                 /*@Z427VLS*/ 02262000
*             DEVICE = DEVICE && DEVICE;                   /*@Z427VLS*/ 02263000
         L     @08,DEVPTR(,R2)                                     0724 02264000
         XC    DEVICE(254,@08),DEVICE(@08)                         0724 02265000
*             INDEX2 = ZERO;                               /*@Z427VLS*/ 02266000
         SLR   @08,@08                                             0725 02267000
         ST    @08,INDEX2                                          0725 02268000
*             INDEX3 = ZERO;                               /*@Z427VLS*/ 02269000
         SLR   INDEX3,INDEX3                                       0726 02270000
*             INDEX1 = ONE;                                /*@Z427VLS*/ 02271000
         LA    INDEX1,1                                            0727 02272000
*             PARMFLD(1:4) = '34XX';                       /*@Z427VLS*/ 02273000
         MVC   PARMFLD(4),@CC01036                                 0728 02274000
*             CALL FINDDEV;                                /*@Z427VLS*/ 02275000
         BAL   @14,FINDDEV                                         0729 02276000
*             DEVNUM = INDEX2;          /* NUMBER OF OBR DEVICE CODES*/ 02277000
         L     @08,DEVPTR(,R2)                                     0730 02278000
         L     @07,INDEX2                                          0730 02279000
         STH   @07,DEVNUM(,@08)                                    0730 02280000
*             MDRNUM = INDEX3;          /* NUMBER OF MDR DEVICE CODES*/ 02281000
         STH   INDEX3,MDRNUM(,@08)                                 0731 02282000
*           END;                                           /*@Z427VLS*/ 02283000
*         IF (VOLPTR ^= ZERO | SYMCDPTR ^= ZERO) & PARMMES = OFF & 0733 02284000
*             DEVPTR = ZERO & TIMESEQ = OFF THEN                   0733 02285000
@RF00717 SLR   @08,@08                                             0733 02286000
         C     @08,VOLPTR(,R2)                                     0733 02287000
         BNE   @GL00064                                            0733 02288000
         C     @08,SYMCDPTR(,R2)                                   0733 02289000
         BE    @RF00733                                            0733 02290000
@GL00064 TM    PARMMES(R2),B'01000000'                             0733 02291000
         BNZ   @RF00733                                            0733 02292000
         L     @08,DEVPTR(,R2)                                     0733 02293000
         LTR   @08,@08                                             0733 02294000
         BNZ   @RF00733                                            0733 02295000
         TM    TIMESEQ(R2),B'00000010'                             0733 02296000
         BNZ   @RF00733                                            0733 02297000
*           DO;                                            /*@Z427VLS*/ 02298000
*              /*                                            @Z427VLS*/ 02299000
*              /* GET SPACE FOR THE DEVICE TABLE.  ESTABLISH THE BASE*/ 02300000
*              /* POINTER.  CLEAR THE TABLE.  SET THE VALUES IN THE  */ 02301000
*              /* TABLE FOR 33XX DEVICES.                    @Z427VLS*/ 02302000
*              /*                                            @Z427VLS*/ 02303000
*             RESPECIFY (R1) RESTRICTED;                   /*@Z427VLS*/ 02304000
*                 R1 = 256;                               /*@0001VLS*/  02305000
         LA    R1,256                                              0736 02306000
*             GEN (GETMAIN R,LV=(R1),SP=20);               /*@Z427VLS*/ 02307000
         GETMAIN R,LV=(R1),SP=20                                        02308000
*             DEVPTR = R1;                                 /*@Z427VLS*/ 02309000
         ST    R1,DEVPTR(,R2)                                      0738 02310000
*             RESPECIFY (R1) UNRESTRICTED;                 /*@Z427VLS*/ 02311000
*             DEVICE = DEVICE && DEVICE;                   /*@Z427VLS*/ 02312000
         L     @08,DEVPTR(,R2)                                     0740 02313000
         XC    DEVICE(254,@08),DEVICE(@08)                         0740 02314000
*             INDEX2 = ZERO;                               /*@Z427VLS*/ 02315000
         SLR   @08,@08                                             0741 02316000
         ST    @08,INDEX2                                          0741 02317000
*             INDEX3 = ZERO;                               /*@Z427VLS*/ 02318000
         SLR   INDEX3,INDEX3                                       0742 02319000
*             INDEX1 = ONE;                                /*@Z427VLS*/ 02320000
         LA    INDEX1,1                                            0743 02321000
*             PARMFLD(1:4) = '33XX';                       /*@Z427VLS*/ 02322000
         MVC   PARMFLD(4),@CC01037                                 0744 02323000
*             CALL FINDDEV;                                /*@Z427VLS*/ 02324000
         BAL   @14,FINDDEV                                         0745 02325000
*             DEVNUM = INDEX2;          /* NUMBER OF OBR DEVICE CODES*/ 02326000
         L     @08,DEVPTR(,R2)                                     0746 02327000
         L     @07,INDEX2                                          0746 02328000
         STH   @07,DEVNUM(,@08)                                    0746 02329000
*             MDRNUM = INDEX3;          /* NUMBER OF MDR DEVICE CODES*/ 02330000
         STH   INDEX3,MDRNUM(,@08)                                 0747 02331000
*           END;                                           /*@Z427VLS*/ 02332000
*         IF LIBADPTR ^= ZERO & DEVPTR = ZERO THEN                 0749 02333000
@RF00733 SLR   @08,@08                                             0749 02334000
         C     @08,LIBADPTR(,R2)                                   0749 02335000
         BE    @RF00749                                            0749 02336000
         C     @08,DEVPTR(,R2)                                     0749 02337000
         BNE   @RF00749                                            0749 02338000
*           DO;                                            /*@Z427VLS*/ 02339000
*              /*                                            @Z427VLS*/ 02340000
*              /* GET SPACE FOR THE DEVICE TABLE.  ESTABLISH THE BASE*/ 02341000
*              /* POINTER.  CLEAR THE TABLE.  SET THE VALUES IN THE  */ 02342000
*              /* TABLE FOR 3705 DEVICE.                     @Z427VLS*/ 02343000
*              /*                                            @Z427VLS*/ 02344000
*             RESPECIFY (R1) RESTRICTED;                   /*@Z427VLS*/ 02345000
*                 R1 = 256;                               /*@0001VLS*/  02346000
         LA    R1,256                                              0752 02347000
*             GEN (GETMAIN R,LV=(R1),SP=20);               /*@Z427VLS*/ 02348000
         GETMAIN R,LV=(R1),SP=20                                        02349000
*             DEVPTR = R1;                                 /*@Z427VLS*/ 02350000
         ST    R1,DEVPTR(,R2)                                      0754 02351000
*             RESPECIFY (R1) UNRESTRICTED;                 /*@Z427VLS*/ 02352000
*             DEVICE = DEVICE && DEVICE;                   /*@Z427VLS*/ 02353000
         L     @08,DEVPTR(,R2)                                     0756 02354000
         XC    DEVICE(254,@08),DEVICE(@08)                         0756 02355000
*             INDEX2 = ZERO;                               /*@Z427VLS*/ 02356000
         SLR   @08,@08                                             0757 02357000
         ST    @08,INDEX2                                          0757 02358000
*             INDEX3 = ZERO;                               /*@Z427VLS*/ 02359000
         SLR   INDEX3,INDEX3                                       0758 02360000
*             INDEX1 = ONE;                                /*@Z427VLS*/ 02361000
         LA    INDEX1,1                                            0759 02362000
*             PARMFLD(1:4) = '3705';                       /*@Z427VLS*/ 02363000
         MVC   PARMFLD(4),@CC01025                                 0760 02364000
*             CALL FINDDEV;                                /*@Z427VLS*/ 02365000
         BAL   @14,FINDDEV                                         0761 02366000
*             DEVNUM = INDEX2;          /* NUMBER OF OBR DEVICE CODES*/ 02367000
         L     @08,DEVPTR(,R2)                                     0762 02368000
         L     @07,INDEX2                                          0762 02369000
         STH   @07,DEVNUM(,@08)                                    0762 02370000
*             MDRNUM = INDEX3;          /* NUMBER OF MDR DEVICE CODES*/ 02371000
         STH   INDEX3,MDRNUM(,@08)                                 0763 02372000
*           END;                                           /*@Z427VLS*/ 02373000
*         IF TREND = ON & DATEFLG = OFF THEN                       0765 02374000
@RF00749 TM    TREND(R2),B'00010000'                               0765 02375000
         BNO   @RF00765                                            0765 02376000
         TM    DATEFLG,B'00000100'                                 0765 02377000
         BNZ   @RF00765                                            0765 02378000
*           DO;                                            /*@Z427VLS*/ 02379000
*              /*                                            @Z427VLS*/ 02380000
*              /* TREND HAS BEEN REQUESTED, BUT NO DATE SPAN GIVEN.  */ 02381000
*              /* SET UP A DATE RANGE WHICH GOES FROM (TODAY-6) THRU */ 02382000
*              /* TODAY.                                     @Z427VLS*/ 02383000
*              /*                                            @Z427VLS*/ 02384000
*             HOLDAREA(1:2) = YEARNOW;       /* TODAY'S YEAR @Z427VLS*/ 02385000
         MVC   HOLDAREA(2),YEARNOW(R2)                             0767 02386000
*             HOLDAREA(3:5) = DAYNOW;        /* TODAY'S DAY  @Z427VLS*/ 02387000
         MVC   HOLDAREA+2(3),DAYNOW(R2)                            0768 02388000
*             PACK (YYDDD,HOLDAREA(1:5));                  /*@Z427VLS*/ 02389000
         PACK  YYDDD(3),HOLDAREA(5)                                0769 02390000
*             ENDDATE(1) = HEXZERO;                        /*@Z427VLS*/ 02391000
         MVI   ENDDATE(R2),X'00'                                   0770 02392000
*             PEND = YYDDD;                  /* ENDING DATE  @Z427VLS*/ 02393000
         MVC   PEND(3,R2),YYDDD                                    0771 02394000
*             CVB (INDEX2,YYDDD);                          /*@Z427VLS*/ 02395000
         XC    @TS00001(8),@TS00001                                0772 02396000
         MVC   @TS00001+5(3),YYDDD                                 0772 02397000
         CVB   @08,@TS00001                                        0772 02398000
         ST    @08,INDEX2                                          0772 02399000
*             INDEX3 = INDEX2/1000;          /* YEAR ALONE   @Z427VLS*/ 02400000
         LA    @04,1000                                            0773 02401000
         LR    @00,@08                                             0773 02402000
         SRDA  @00,32                                              0773 02403000
         DR    @00,@04                                             0773 02404000
         LR    INDEX3,@01                                          0773 02405000
*             INDEX2 = INDEX2 - INDEX3*1000 - 29;  /* BEGINNING DAY */  02406000
         LR    @01,@04                                             0774 02407000
         MR    @00,INDEX3                                          0774 02408000
         SLR   @08,@01                                             0774 02409000
         SL    @08,@CF00990                                        0774 02410000
         ST    @08,INDEX2                                          0774 02411000
*             IF INDEX2 <= ZERO THEN         /* CROSSED A YEAR BDY   */ 02412000
         LTR   @08,@08                                             0775 02413000
         BP    @RF00775                                            0775 02414000
*               DO;                                        /*@Z427VLS*/ 02415000
*                 INDEX3 = INDEX3 - ONE;     /* PREVIOUS YEAR        */ 02416000
         BCTR  INDEX3,0                                            0777 02417000
*                 IF ((INDEX3/4)*4) = INDEX3 THEN                  0778 02418000
         LR    @00,INDEX3                                          0778 02419000
         SRDA  @00,32                                              0778 02420000
         D     @00,@CF00039                                        0778 02421000
         SLA   @01,2                                               0778 02422000
         CR    @01,INDEX3                                          0778 02423000
         BNE   @RF00778                                            0778 02424000
*                   INDEX1 = 366;            /* LEAP YEAR    @Z427VLS*/ 02425000
         LA    INDEX1,366                                          0779 02426000
*                 ELSE                                             0780 02427000
*                   INDEX1 = 365;            /* NOT LEAP YEAR        */ 02428000
         B     @RC00778                                            0780 02429000
@RF00778 LA    INDEX1,365                                          0780 02430000
*                 INDEX2 = INDEX1 + INDEX2;  /* NEW DAY      @Z427VLS*/ 02431000
@RC00778 LR    @08,INDEX1                                          0781 02432000
         AL    @08,INDEX2                                          0781 02433000
         ST    @08,INDEX2                                          0781 02434000
*               END;                                       /*@Z427VLS*/ 02435000
*             INDEX2 = INDEX2 + INDEX3*1000;  /* STARTING DATE       */ 02436000
@RF00775 LR    @08,INDEX3                                          0783 02437000
         MH    @08,@CH00989                                        0783 02438000
         AL    @08,INDEX2                                          0783 02439000
         ST    @08,INDEX2                                          0783 02440000
*             CVD (INDEX2,STDATE);                         /*@Z427VLS*/ 02441000
         CVD   @08,@TS00001                                        0784 02442000
         MVC   STDATE(4,R2),@TS00001+4                             0784 02443000
*             STDATE(4) = STDATE(4) | SIGNFLAG;            /*@Z427VLS*/ 02444000
         OI    STDATE+3(R2),X'0F'                                  0785 02445000
*             DATEFLG = ON;                                /*@Z427VLS*/ 02446000
         OI    DATEFLG,B'00000100'                                 0786 02447000
*           END;                                           /*@Z427VLS*/ 02448000
*         /*                                                 @Z427VLS*/ 02449000
*         /* ONLY UNDER THE CONDITIONS OF SYSUM, TREND, OR A REPORT  */ 02450000
*         /* THAT IS CONCERNED WITH STATISTICAL DEVICE RECORDS ARE   */ 02451000
*         /* THE SDR COUNTERS TO BE OFFLOADED.  NOSDR = OFF MEANS TO */ 02452000
*         /* OFFLOAD THE COUNTERS -- NOSDR = ON MEANS DO NOT OFFLOAD */ 02453000
*         /* THE COUNTERS.                                   @Z427VLS*/ 02454000
*         /*                                                 @Z427VLS*/ 02455000
*         IF PLOGREC = ON THEN                                     0788 02456000
@RF00765 TM    PLOGREC(R2),B'00000010'                             0788 02457000
         BNO   @RF00788                                            0788 02458000
*           DO;                                            /*@Z427VLS*/ 02459000
*             IF SYSUM = ON | TREND = ON | PARMMES = ON |          0790 02460000
*                DEVPTR ^= ZERO |                                  0790 02461000
*                (ZEROALL = ON & PACC = ON & PEDIT = ON) THEN      0790 02462000
         TM    SYSUM(R2),B'01010100'                               0790 02463000
         BNZ   @RT00790                                            0790 02464000
         L     @08,DEVPTR(,R2)                                     0790 02465000
         LTR   @08,@08                                             0790 02466000
         BNZ   @RT00790                                            0790 02467000
         TM    ZEROALL(R2),B'01000000'                             0790 02468000
         BNO   @RF00790                                            0790 02469000
         TM    PACC(R2),B'01010000'                                0790 02470000
         BNO   @RF00790                                            0790 02471000
@RT00790 DS    0H                                                  0791 02472000
*               NOSDR = OFF;                               /*@Z427VLS*/ 02473000
         NI    NOSDR(R2),B'11111110'                               0791 02474000
*             ELSE                                                 0792 02475000
*               NOSDR = ON;                                /*@Z427VLS*/ 02476000
         B     @RC00790                                            0792 02477000
@RF00790 OI    NOSDR(R2),B'00000001'                               0792 02478000
*             IF POBR = OFF & PTTYP = OFF THEN                     0793 02479000
@RC00790 TM    POBR(R2),B'00100000'                                0793 02480000
         BNZ   @RF00793                                            0793 02481000
         TM    PTTYP(R2),B'10000000'                               0793 02482000
         BNZ   @RF00793                                            0793 02483000
*               NOSDR = ON;                                /*@Z427VLS*/ 02484000
         OI    NOSDR(R2),B'00000001'                               0794 02485000
*           END;                                           /*@Z427VLS*/ 02486000
*         ELSE                                                     0796 02487000
*           NOSDR = ON;                                    /*@Z427VLS*/ 02488000
         B     @RC00788                                            0796 02489000
@RF00788 OI    NOSDR(R2),B'00000001'                               0796 02490000
*/********************************************************************/ 02491000
*/*                                                          @Z427VLS*/ 02492000
*/* OPEN THE SYSIN DATA SET.  IF RDESUM HAS BEEN SPECIFIED, DO NOT   */ 02493000
*/* READ ANY CARDS.  OTHERWISE, READ FOR POSSIBLE SHARED I/O CONTROL */ 02494000
*/* CARDS.  INTERPRET THEM AND BUILD THE SHARE TABLE.        @Z427VLS*/ 02495000
*/*                                                          @Z427VLS*/ 02496000
*/********************************************************************/ 02497000
*    IF OSYSIN = ON & RDESUM = OFF THEN                            0797 02498000
@RC00788 TM    OSYSIN(R2),B'00000100'                              0797 02499000
         BNO   @RF00797                                            0797 02500000
         TM    RDESUM(R2),B'10000000'                              0797 02501000
         BNZ   @RF00797                                            0797 02502000
*      DO;                                                 /*@Z427VLS*/ 02503000
*        RESPECIFY (R15) RESTRICTED;                       /*@0099VLS*/ 02504000
*        IF CARDOPEN = OFF THEN             /* SYSIN NOT ALREADY OPEN*/ 02505000
         TM    CARDOPEN,B'00010000'                                0800 02506000
         BNZ   @RF00800                                            0800 02507000
*          DO;                                             /*@0099VLS*/ 02508000
*            HOLDAREA(1:2) = OPENIO;        /* SAVE THE OPEN FLAGS   */ 02509000
         MVC   HOLDAREA(2),OPENIO(R2)                              0802 02510000
*            OPENIO = OPENIO && OPENIO;                    /*@0099VLS*/ 02511000
         XC    OPENIO(2,R2),OPENIO(R2)                             0803 02512000
*            OSYSIN = ON;                   /* OPEN SYSIN ONLY       */ 02513000
         OI    OSYSIN(R2),B'00000100'                              0804 02514000
*            CALL IOHND(IOOPEN);                           /*@0099VLS*/ 02515000
         L     @15,ADIOHND(,R2)                                    0805 02516000
         LA    @01,@AL00805                                        0805 02517000
         BALR  @14,@15                                             0805 02518000
*            OPENIO = HOLDAREA(1:2);        /* RESET THE OPEN FLAGS  */ 02519000
         MVC   OPENIO(2,R2),HOLDAREA                               0806 02520000
*          END;                                            /*@0099VLS*/ 02521000
*        ELSE                                                      0808 02522000
*          R15 = ZERO;                                     /*@0099VLS*/ 02523000
         B     @RC00800                                            0808 02524000
@RF00800 SLR   R15,R15                                             0808 02525000
*        OSYSIN = OFF;                                     /*@0099VLS*/ 02526000
@RC00800 NI    OSYSIN(R2),B'11111011'                              0809 02527000
*        IF R15 = ZERO & CARDCLOS = OFF THEN                       0810 02528000
         LTR   R15,R15                                             0810 02529000
         BNZ   @RF00810                                            0810 02530000
         TM    CARDCLOS,B'00001000'                                0810 02531000
         BNZ   @RF00810                                            0810 02532000
*          DO;                                             /*@Z427VLS*/ 02533000
*             /*                                             @Z427VLS*/ 02534000
*             /* SPACE FOR THE SHARE TABLE.  IF SPACE IS THERE,      */ 02535000
*             /* GET SPACE FOR THE SHARE TABLE.  IF SPACE IS THERE,  */ 02536000
*             /* ESTABLISH THE BASE PONTER.  THEN CALCULATE THE      */ 02537000
*             /* MAXIMUM NUMBER OF ENTRIES POSSIBLE.         @Z427VLS*/ 02538000
*             /*                                             @Z427VLS*/ 02539000
*             RESPECIFY (R3) RESTRICTED;                   /*@Z427VLS*/ 02540000
*             R3 = TABSIZE;                                /*@Z427VLS*/ 02541000
         L     R3,TABSIZE(,R2)                                     0813 02542000
*             GEN (GETMAIN EC,LV=(R3),A=INDEX2,SP=30);     /*@Z427VLS*/ 02543000
         GETMAIN EC,LV=(R3),A=INDEX2,SP=30                              02544000
*             RESPECIFY (R3) UNRESTRICTED;                 /*@Z427VLS*/ 02545000
*             IF R15 = ZERO THEN                                   0816 02546000
         LTR   R15,R15                                             0816 02547000
         BNZ   @RF00816                                            0816 02548000
*               DO SHAREPTR = INDEX2;                      /*@Z427VLS*/ 02549000
         L     @14,INDEX2                                          0817 02550000
         ST    @14,SHAREPTR(,R2)                                   0817 02551000
*                 LENGPARM = (TABSIZE-2)/11;               /*@Z427VLS*/ 02552000
         L     @00,TABSIZE(,R2)                                    0818 02553000
         BCTR  @00,0                                               0818 02554000
         BCTR  @00,0                                               0818 02555000
         SRDA  @00,32                                              0818 02556000
         D     @00,@CF00036                                        0818 02557000
         ST    @01,LENGPARM                                        0818 02558000
*                 RESPECIFY (R7) RESTRICTED;               /*@Z427VLS*/ 02559000
*                 CALL IOHND(READCARD);                    /*@Z427VLS*/ 02560000
         L     @15,ADIOHND(,R2)                                    0820 02561000
         LA    @01,@AL00820                                        0820 02562000
         BALR  @14,@15                                             0820 02563000
*                 INDEX2 = ZERO;                           /*@Z427VLS*/ 02564000
         SLR   @14,@14                                             0821 02565000
         ST    @14,INDEX2                                          0821 02566000
*                 /*                                         @Z427VLS*/ 02567000
*                 /* IF THERE ARE ANY CARD INPUTS, PROCESS. ELSE     */ 02568000
*                 /* FREE THE SPACE.                         @Z427VLS*/ 02569000
*                 /*                                         @Z427VLS*/ 02570000
*                 IF R15 = ZERO THEN                               0822 02571000
         CR    R15,@14                                             0822 02572000
         BNE   @RF00822                                            0822 02573000
*                   DO UNTIL (R15 ^= ZERO);   /* UNTIL NO MORE I/P   */ 02574000
@DL00823 DS    0H                                                  0824 02575000
*                     PARMFLD(1:80) = CARD(1:80);          /*@Z427VLS*/ 02576000
         MVC   PARMFLD(80),CARD(R7)                                0824 02577000
*                     RESPECIFY (R7,R15) UNRESTRICTED;     /*@Z427VLS*/ 02578000
*                     /*                                     @Z427VLS*/ 02579000
*                     /* COPY THE CARD TO THE PARMFLD DATA AREA FOR  */ 02580000
*                     /* PROCESSING.  CLEAR THE REMAINDER OF THE AREA*/ 02581000
*                     /* SET SHARECUX TO OFF TO INDICATE CUA NOT CUX.*/ 02582000
*                     /* PROCESS THE CARD.                   @Z427VLS*/ 02583000
*                     /*                                     @Z427VLS*/ 02584000
*                     PARMFLD(81) = BLANK;                 /*@Z427VLS*/ 02585000
         MVI   PARMFLD+80,C' '                                     0826 02586000
*                     PARMFLD(82:100) = PARMFLD(81:99);    /*@Z427VLS*/ 02587000
         MVC   @TS00001(19),PARMFLD+80                             0827 02588000
         MVC   PARMFLD+81(19),@TS00001                             0827 02589000
*                     PARMPRT(1:80) = PARMFLD(1:80);       /*@Z427VLS*/ 02590000
         MVC   PARMPRT(80),PARMFLD                                 0828 02591000
*                     PRINTADR = ADDR(PARMPT);             /*@Z427VLS*/ 02592000
         LA    @08,PARMPT                                          0829 02593000
         ST    @08,PRINTADR(,R2)                                   0829 02594000
*                     CALL IOHND(RITEPRTR);                /*@Z427VLS*/ 02595000
         L     @15,ADIOHND(,R2)                                    0830 02596000
         LA    @01,@AL00830                                        0830 02597000
         BALR  @14,@15                                             0830 02598000
*                     SHARECUX = OFF;                      /*@Z427VLS*/ 02599000
         NI    SHARECUX,B'11011111'                                0831 02600000
*                       IF PARMFLD(1) ^= STAR THEN                 0832 02601000
         CLI   PARMFLD,C'*'                                        0832 02602000
         BE    @RF00832                                            0832 02603000
*                         DO;                              /*@G51DGVS*/ 02604000
*                       IF PARMFLD(1) ^= STAR THEN                 0834 02605000
         CLI   PARMFLD,C'*'                                        0834 02606000
         BE    @RF00834                                            0834 02607000
*                         DO;                              /*@0099VLS*/ 02608000
*                     DO INDEX1 = 1 BY 1 TO 81                     0836 02609000
*                              WHILE(PARMFLD(INDEX1) = BLANK);     0836 02610000
         LA    INDEX1,1                                            0836 02611000
@DL00836 LA    @08,PARMFLD-1(INDEX1)                               0836 02612000
         CLI   0(@08),C' '                                         0836 02613000
         BNE   @DC00836                                            0836 02614000
*                     END;                                 /*@Z427VLS*/ 02615000
         AL    INDEX1,@CF00058                                     0837 02616000
         C     INDEX1,@CF01040                                     0837 02617000
         BNH   @DL00836                                            0837 02618000
@DC00836 DS    0H                                                  0838 02619000
*                     IF PARMFLD(INDEX1:INDEX1+6) = 'SHARE=(' THEN 0838 02620000
         LA    @08,PARMFLD-1(INDEX1)                               0838 02621000
         CLC   0(7,@08),@CC01043                                   0838 02622000
         BNE   @RF00838                                            0838 02623000
*                       DO INDEX1 = INDEX1 + 7;            /*@Z427VLS*/ 02624000
         LA    @08,7                                               0839 02625000
         ALR   @08,INDEX1                                          0839 02626000
         LR    INDEX1,@08                                          0839 02627000
*                         /*                                 @Z427VLS*/ 02628000
*                         /* INTERPRET THE SERIAL NUMBER/CUA PART OF */ 02629000
*                         /* THE BASE.  IF CUX WAS SPECIFIED, TURN   */ 02630000
*                         /* SHARECUX ON.  PLACE VALUES IN TABLE.    */ 02631000
*                         /*                                 @Z427VLS*/ 02632000
*                         CALL SHARECRD;                   /*@Z427VLS*/ 02633000
         BAL   @14,SHARECRD                                        0840 02634000
*                         IF CUAHOLD(3) = 'X' THEN                 0841 02635000
         CLI   CUAHOLD+2,C'X'                                      0841 02636000
         BNE   @RF00841                                            0841 02637000
*                           SHARECUX = ON;                 /*@Z427VLS*/ 02638000
         OI    SHARECUX,B'00100000'                                0842 02639000
*                         KEYWORD(6:10) = KEYWORD(1:5);    /*@Z427VLS*/ 02640000
@RF00841 MVC   KEYWORD+5(5),KEYWORD                                0843 02641000
*                         SHAREIO(INDEX2) = KEYWORD;       /*@Z427VLS*/ 02642000
         L     @08,INDEX2                                          0844 02643000
         MH    @08,@CH00036                                        0844 02644000
         L     @04,SHAREPTR(,R2)                                   0844 02645000
         ST    @08,@TF00001                                        0844 02646000
         ALR   @08,@04                                             0844 02647000
         AL    @08,@CF01204                                        0844 02648000
         MVI   SHAREIO+8(@08),C' '                                 0844 02649000
         MVC   SHAREIO-2(10,@08),KEYWORD                           0844 02650000
*                         IF SHARECUX = ON THEN                    0845 02651000
         TM    SHARECUX,B'00100000'                                0845 02652000
         BNO   @RF00845                                            0845 02653000
*                           SHAREDX(INDEX2) = ON;          /*@Z427VLS*/ 02654000
         AL    @04,@TF00001                                        0846 02655000
         AL    @04,@CF01204                                        0846 02656000
         OI    SHAREDX-2(@04),B'10000000'                          0846 02657000
*                         SHARLET(INDEX2) = STAR;  /* SHOW BASE ENTRY*/ 02658000
@RF00845 L     @08,INDEX2                                          0847 02659000
         MH    @08,@CH00036                                        0847 02660000
         L     @04,SHAREPTR(,R2)                                   0847 02661000
         ALR   @04,@08                                             0847 02662000
         MVI   SHARLET-11(@04),C'*'                                0847 02663000
*                         IF PARMFLD(INDEX1) = COMMA THEN          0848 02664000
         LA    @08,PARMFLD-1(INDEX1)                               0848 02665000
         CLI   0(@08),C','                                         0848 02666000
         BNE   @RF00848                                            0848 02667000
*                           DO UNTIL (PARMFLD(INDEX1) ^= COMMA);   0849 02668000
@DL00849 DS    0H                                                  0850 02669000
*                             /*                             @Z427VLS*/ 02670000
*                             /* PROCESS THE ALTERNATES AS THE BASE  */ 02671000
*                             /* THE BASE WAS DONE.          @Z427VLS*/ 02672000
*                             /*                             @Z427VLS*/ 02673000
*                             INDEX1 = INDEX1 + 1;         /*@Z427VLS*/ 02674000
         AL    INDEX1,@CF00058                                     0850 02675000
*                             CALL SHARECRD;               /*@Z427VLS*/ 02676000
         BAL   @14,SHARECRD                                        0851 02677000
*                             SHAREIO(INDEX2) = KEYWORD;   /*@Z427VLS*/ 02678000
         L     @08,INDEX2                                          0852 02679000
         MH    @08,@CH00036                                        0852 02680000
         L     @04,SHAREPTR(,R2)                                   0852 02681000
         ST    @08,@TF00001                                        0852 02682000
         ALR   @08,@04                                             0852 02683000
         AL    @08,@CF01204                                        0852 02684000
         MVI   SHAREIO+8(@08),C' '                                 0852 02685000
         MVC   SHAREIO-2(10,@08),KEYWORD                           0852 02686000
*                             IF SHARECUX = ON & CUAHOLD(3) = 'X' THEN  02687000
         TM    SHARECUX,B'00100000'                                0853 02688000
         BNO   @RF00853                                            0853 02689000
         CLI   CUAHOLD+2,C'X'                                      0853 02690000
         BNE   @RF00853                                            0853 02691000
*                               SHAREDX(INDEX2) = ON;      /*@Z427VLS*/ 02692000
         AL    @04,@TF00001                                        0854 02693000
         AL    @04,@CF01204                                        0854 02694000
         OI    SHAREDX-2(@04),B'10000000'                          0854 02695000
*                             ELSE                                 0855 02696000
*                               IF ^(SHARECUX = OFF &              0855 02697000
*                                    CUAHOLD(3) ^= 'X') THEN       0855 02698000
         B     @RC00853                                            0855 02699000
@RF00853 TM    SHARECUX,B'00100000'                                0855 02700000
         BNZ   @RT00855                                            0855 02701000
         CLI   CUAHOLD+2,C'X'                                      0855 02702000
         BNE   @RF00855                                            0855 02703000
@RT00855 DS    0H                                                  0856 02704000
*                                 DO PLACE = 1;            /*@Z427VLS*/ 02705000
         LA    @08,1                                               0856 02706000
         ST    @08,PLACE                                           0856 02707000
*                                   CALL OUTMSG(SYNTAX);   /*@Z427VLS*/ 02708000
         LA    @01,@AL00857                                        0857 02709000
         BAL   @14,OUTMSG                                          0857 02710000
*                                 END;                     /*@Z427VLS*/ 02711000
*                             SHARLET(INDEX2) = BLANK;  /* ALTERNATE */ 02712000
@RF00855 DS    0H                                                  0859 02713000
@RC00853 L     @08,INDEX2                                          0859 02714000
         MH    @08,@CH00036                                        0859 02715000
         L     @04,SHAREPTR(,R2)                                   0859 02716000
         ALR   @04,@08                                             0859 02717000
         MVI   SHARLET-11(@04),C' '                                0859 02718000
*                           END;                           /*@Z427VLS*/ 02719000
@DE00849 LA    @08,PARMFLD-1(INDEX1)                               0860 02720000
         CLI   0(@08),C','                                         0860 02721000
         BE    @DL00849                                            0860 02722000
*                         ELSE                                     0861 02723000
*                           CALL OUTMSG(SYNTAX);           /*@Z427VLS*/ 02724000
         B     @RC00848                                            0861 02725000
@RF00848 LA    @01,@AL00861                                        0861 02726000
         BAL   @14,OUTMSG                                          0861 02727000
*                         IF PARMFLD(INDEX1) ^= RPAREN THEN        0862 02728000
@RC00848 LA    @08,PARMFLD-1(INDEX1)                               0862 02729000
         CLI   0(@08),C')'                                         0862 02730000
         BE    @RF00862                                            0862 02731000
*                           CALL OUTMSG(SYNTAX);           /*@Z427VLS*/ 02732000
         LA    @01,@AL00863                                        0863 02733000
         BAL   @14,OUTMSG                                          0863 02734000
*                       END;                               /*@Z427VLS*/ 02735000
@RF00862 DS    0H                                                  0865 02736000
*                     ELSE                                         0865 02737000
*                       CALL OUTMSG (SYNTAX);              /*@Z427VLS*/ 02738000
         B     @RC00838                                            0865 02739000
@RF00838 LA    @01,@AL00865                                        0865 02740000
         BAL   @14,OUTMSG                                          0865 02741000
*                         END;                             /*@G51DGVS*/ 02742000
@RC00838 DS    0H                                                  0867 02743000
*                         END;                             /*@0099VLS*/ 02744000
@RF00834 DS    0H                                                  0868 02745000
*                     RESPECIFY (R7,R15) RESTRICTED;       /*@Z427VLS*/ 02746000
@RF00832 DS    0H                                                  0869 02747000
*                     DO UNTIL (R15 ^= TWELVE);            /*@Z427VLS*/ 02748000
@DL00869 DS    0H                                                  0870 02749000
*                       CALL IOHND(READCARD);  /* GET NEXT CARD      */ 02750000
         L     @15,ADIOHND(,R2)                                    0870 02751000
         LA    @01,@AL00870                                        0870 02752000
         BALR  @14,@15                                             0870 02753000
*                     END;                                 /*@Z427VLS*/ 02754000
@DE00869 C     R15,@CF00037                                        0871 02755000
         BE    @DL00869                                            0871 02756000
*                   END;                                   /*@Z427VLS*/ 02757000
@DE00823 LTR   R15,R15                                             0872 02758000
         BZ    @DL00823                                            0872 02759000
*                 RESPECIFY (R7,R15) UNRESTRICTED;         /*@Z427VLS*/ 02760000
@RF00822 DS    0H                                                  0874 02761000
*                 /*                                         @Z427VLS*/ 02762000
*                 /* IF THERE IS AN ERROR OR NO ENTRIES, FREE SHARE  */ 02763000
*                 /* TABLE.  ELSE ASSIGN THE LETTERS TO THE CPU NOS. */ 02764000
*                 /*                                         @Z427VLS*/ 02765000
*                 IF INDEX2 = ZERO | RETCODE ^= ZERO THEN          0874 02766000
         SLR   @08,@08                                             0874 02767000
         C     @08,INDEX2                                          0874 02768000
         BE    @RT00874                                            0874 02769000
         C     @08,RETCODE                                         0874 02770000
         BE    @RF00874                                            0874 02771000
@RT00874 DS    0H                                                  0875 02772000
*                   DO;                                    /*@Z427VLS*/ 02773000
*                     RESPECIFY (R1) RESTRICTED;           /*@Z427VLS*/ 02774000
*                     GEN (FREEMAIN R,SP=30);              /*@Z427VLS*/ 02775000
         FREEMAIN R,SP=30                                               02776000
*                     RESPECIFY (R1) UNRESTRICTED;         /*@Z427VLS*/ 02777000
*                     SHAREPTR = ZERO;                     /*@Z427VLS*/ 02778000
         SLR   @08,@08                                             0879 02779000
         ST    @08,SHAREPTR(,R2)                                   0879 02780000
*                   END;                                   /*@Z427VLS*/ 02781000
*                 ELSE                                             0881 02782000
*                   DO SHARENUM = INDEX2;                  /*@Z427VLS*/ 02783000
         B     @RC00874                                            0881 02784000
@RF00874 L     @08,INDEX2                                          0881 02785000
         L     @04,SHAREPTR(,R2)                                   0881 02786000
         STH   @08,SHARENUM(,@04)                                  0881 02787000
*                     INDEX2 = INDEX2 + 1;     /* EXTRA ENTRY FOR O/P*/ 02788000
         LA    @08,1                                               0882 02789000
         AL    @08,INDEX2                                          0882 02790000
         ST    @08,INDEX2                                          0882 02791000
*                     SHAREIO(INDEX2) = SHAREIO(INDEX2) &&         0883 02792000
*                                     SHAREIO(INDEX2);     /*@Z427VLS*/ 02793000
         MH    @08,@CH00036                                        0883 02794000
         L     @04,SHAREPTR(,R2)                                   0883 02795000
         ST    @08,@TF00001                                        0883 02796000
         ALR   @08,@04                                             0883 02797000
         AL    @08,@CF01204                                        0883 02798000
         XC    SHAREIO-2(11,@08),SHAREIO-2(@08)                    0883 02799000
*                     INDEX2 = INDEX2*11 + 2;    /* TOTAL SIZE       */ 02800000
         LA    @08,2                                               0884 02801000
         AL    @08,@TF00001                                        0884 02802000
         ST    @08,INDEX2                                          0884 02803000
*                     RESPECIFY (R3,R1) RESTRICTED;        /*@Z427VLS*/ 02804000
*                     R3 = (TABSIZE-INDEX2) & 'FFFFFFF8'X; /*@Z427VLS*/ 02805000
         L     @15,TABSIZE(,R2)                                    0886 02806000
         LCR   @08,@08                                             0886 02807000
         ALR   @08,@15                                             0886 02808000
         N     @08,@CF01044                                        0886 02809000
         LR    R3,@08                                              0886 02810000
*                     R1 = SHAREPTR + TABSIZE - R3;        /*@Z427VLS*/ 02811000
         ALR   @04,@15                                             0887 02812000
         SLR   @04,R3                                              0887 02813000
         LR    R1,@04                                              0887 02814000
*                     GEN (FREEMAIN R,LV=(R3),A=(R1),SP=30);       0888 02815000
         FREEMAIN R,LV=(R3),A=(R1),SP=30                                02816000
*                     RESPECIFY (R3,R1) UNRESTRICTED;      /*@Z427VLS*/ 02817000
*                     I = ZERO;                /* INDEX FOR LETTERS  */ 02818000
         SLR   @08,@08                                             0890 02819000
         ST    @08,I                                               0890 02820000
*                     DO J = 1 TO SHARENUM BY 1;  /* LETTERS FOR BASE*/ 02821000
         LA    J,1                                                 0891 02822000
         B     @DE00891                                            0891 02823000
@DL00891 DS    0H                                                  0892 02824000
*                       IF SHARLET(J) = STAR THEN                  0892 02825000
         LR    @08,J                                               0892 02826000
         MH    @08,@CH00036                                        0892 02827000
         L     @03,SHAREPTR(,R2)                                   0892 02828000
         ALR   @03,@08                                             0892 02829000
         CLI   SHARLET-11(@03),C'*'                                0892 02830000
         BNE   @RF00892                                            0892 02831000
*                         DO I = I + 1;                    /*@Z427VLS*/ 02832000
         LA    @08,1                                               0893 02833000
         AL    @08,I                                               0893 02834000
         ST    @08,I                                               0893 02835000
*                           SHARLET(J) = LETTAB(I);        /*@Z427VLS*/ 02836000
         LR    @03,J                                               0894 02837000
         MH    @03,@CH00036                                        0894 02838000
         L     @01,SHAREPTR(,R2)                                   0894 02839000
         ALR   @01,@03                                             0894 02840000
         LA    @03,LETTAB-1(@08)                                   0894 02841000
         MVC   SHARLET-11(1,@01),0(@03)                            0894 02842000
*                           DO INDEX1 = 1 TO SHARENUM BY 1;/*@Z427VLS*/ 02843000
         LA    INDEX1,1                                            0895 02844000
         B     @DE00895                                            0895 02845000
@DL00895 DS    0H                                                  0896 02846000
*                             /*                             @Z427VLS*/ 02847000
*                             /* CHECK IF BASE CPU SPECIFIED ELSEWHER*/ 02848000
*                             /*                             @Z427VLS*/ 02849000
*                             IF SHARSERA(J) = SHARSERA(INDEX1) THEN    02850000
         LA    @08,11                                              0896 02851000
         LR    @01,J                                               0896 02852000
         MR    @00,@08                                             0896 02853000
         L     @03,SHAREPTR(,R2)                                   0896 02854000
         LR    @07,@08                                             0896 02855000
         MR    @06,INDEX1                                          0896 02856000
         ALR   @01,@03                                             0896 02857000
         AL    @01,@CF01205                                        0896 02858000
         ST    @07,@TF00001                                        0896 02859000
         ALR   @07,@03                                             0896 02860000
         AL    @07,@CF01205                                        0896 02861000
         CLC   SHARSERA-4(3,@01),SHARSERA-4(@07)                   0896 02862000
         BNE   @RF00896                                            0896 02863000
*                               SHARLET(INDEX1) = LETTAB(I);       0897 02864000
         AL    @03,@TF00001                                        0897 02865000
         L     @08,I                                               0897 02866000
         LA    @01,LETTAB-1(@08)                                   0897 02867000
         MVC   SHARLET-11(1,@03),0(@01)                            0897 02868000
*                           END;                           /*@Z427VLS*/ 02869000
@RF00896 AL    INDEX1,@CF00058                                     0898 02870000
@DE00895 L     @08,SHAREPTR(,R2)                                   0898 02871000
         CH    INDEX1,SHARENUM(,@08)                               0898 02872000
         BNH   @DL00895                                            0898 02873000
*                         END;                             /*@Z427VLS*/ 02874000
*                     END;                                 /*@Z427VLS*/ 02875000
@RF00892 AL    J,@CF00058                                          0900 02876000
@DE00891 L     @08,SHAREPTR(,R2)                                   0900 02877000
         CH    J,SHARENUM(,@08)                                    0900 02878000
         BNH   @DL00891                                            0900 02879000
*                     DO J = 1 TO SHARENUM BY 1;  /* LETTERS FOR ALT */ 02880000
         LA    J,1                                                 0901 02881000
         B     @DE00901                                            0901 02882000
@DL00901 DS    0H                                                  0902 02883000
*                       IF SHARLET(J) = BLANK THEN                 0902 02884000
         LR    @08,J                                               0902 02885000
         MH    @08,@CH00036                                        0902 02886000
         L     @03,SHAREPTR(,R2)                                   0902 02887000
         ALR   @03,@08                                             0902 02888000
         CLI   SHARLET-11(@03),C' '                                0902 02889000
         BNE   @RF00902                                            0902 02890000
*                         DO I = I + 1;                    /*@Z427VLS*/ 02891000
         LA    @08,1                                               0903 02892000
         AL    @08,I                                               0903 02893000
         ST    @08,I                                               0903 02894000
*                           SHARLET(J) = LETTAB(I);        /*@Z427VLS*/ 02895000
         LR    @03,J                                               0904 02896000
         MH    @03,@CH00036                                        0904 02897000
         L     @01,SHAREPTR(,R2)                                   0904 02898000
         ALR   @01,@03                                             0904 02899000
         LA    @03,LETTAB-1(@08)                                   0904 02900000
         MVC   SHARLET-11(1,@01),0(@03)                            0904 02901000
*                           DO INDEX1 = 1 TO SHARENUM BY 1;/*@Z427VLS*/ 02902000
         LA    INDEX1,1                                            0905 02903000
         B     @DE00905                                            0905 02904000
@DL00905 DS    0H                                                  0906 02905000
*                             /*                             @Z427VLS*/ 02906000
*                             /* CHECK IF ALT CPU SPECIFIED ELSEWHERE*/ 02907000
*                             /*                             @Z427VLS*/ 02908000
*                             IF SHARSERA(J) = SHARSERA(INDEX1) THEN    02909000
         LA    @08,11                                              0906 02910000
         LR    @01,J                                               0906 02911000
         MR    @00,@08                                             0906 02912000
         L     @03,SHAREPTR(,R2)                                   0906 02913000
         LR    @07,@08                                             0906 02914000
         MR    @06,INDEX1                                          0906 02915000
         ALR   @01,@03                                             0906 02916000
         AL    @01,@CF01205                                        0906 02917000
         ST    @07,@TF00001                                        0906 02918000
         ALR   @07,@03                                             0906 02919000
         AL    @07,@CF01205                                        0906 02920000
         CLC   SHARSERA-4(3,@01),SHARSERA-4(@07)                   0906 02921000
         BNE   @RF00906                                            0906 02922000
*                               SHARLET(INDEX1) = LETTAB(I);       0907 02923000
         AL    @03,@TF00001                                        0907 02924000
         L     @08,I                                               0907 02925000
         LA    @01,LETTAB-1(@08)                                   0907 02926000
         MVC   SHARLET-11(1,@03),0(@01)                            0907 02927000
*                           END;                           /*@Z427VLS*/ 02928000
@RF00906 AL    INDEX1,@CF00058                                     0908 02929000
@DE00905 L     @08,SHAREPTR(,R2)                                   0908 02930000
         CH    INDEX1,SHARENUM(,@08)                               0908 02931000
         BNH   @DL00905                                            0908 02932000
*                         END;                             /*@Z427VLS*/ 02933000
*                     END;                                 /*@Z427VLS*/ 02934000
@RF00902 AL    J,@CF00058                                          0910 02935000
@DE00901 L     @08,SHAREPTR(,R2)                                   0910 02936000
         CH    J,SHARENUM(,@08)                                    0910 02937000
         BNH   @DL00901                                            0910 02938000
*                     IF I > 16 THEN              /* MORE THAN 16 CPUS* 02939000
         L     @08,I                                               0911 02940000
         C     @08,@CF00090                                        0911 02941000
         BNH   @RF00911                                            0911 02942000
*                       DO;                                /*@Z427VLS*/ 02943000
*                         CALL IFCMSG(68,ADDR(MSGNO));     /*@Z427VLS*/ 02944000
         LA    @08,MSGNO                                           0913 02945000
         ST    @08,@AFTEMPS+8                                      0913 02946000
         L     @15,ADIFCMSG(,R2)                                   0913 02947000
         LA    @01,@AL00913                                        0913 02948000
         BALR  @14,@15                                             0913 02949000
*                         PRINTADR = ADDR(PARMPT);         /*@Z427VLS*/ 02950000
         LA    @08,PARMPT                                          0914 02951000
         ST    @08,PRINTADR(,R2)                                   0914 02952000
*                         CALL IOHND(RITEPRTR);            /*@Z427VLS*/ 02953000
         L     @15,ADIOHND(,R2)                                    0915 02954000
         LA    @01,@AL00915                                        0915 02955000
         BALR  @14,@15                                             0915 02956000
*                         RETCODE = TWELVE;                /*@Z427VLS*/ 02957000
         MVC   RETCODE(4),@CF00037                                 0916 02958000
*                         ZEROALL = OFF;                   /*@Z427VLS*/ 02959000
         NI    ZEROALL(R2),B'10111111'                             0917 02960000
*                       END;                               /*@Z427VLS*/ 02961000
*                   END;                                   /*@Z427VLS*/ 02962000
@RF00911 DS    0H                                                  0920 02963000
*               END;                                       /*@Z427VLS*/ 02964000
@RC00874 DS    0H                                                  0921 02965000
*             ELSE                                                 0921 02966000
*               DO;                    /* CAN'T ALLOCATE FOR SHARE TBL* 02967000
         B     @RC00816                                            0921 02968000
@RF00816 DS    0H                                                  0922 02969000
*                 CALL IFCMSG(69,ADDR(MSGNO));             /*@Z427VLS*/ 02970000
         LA    @08,MSGNO                                           0922 02971000
         ST    @08,@AFTEMPS+8                                      0922 02972000
         L     @15,ADIFCMSG(,R2)                                   0922 02973000
         LA    @01,@AL00922                                        0922 02974000
         BALR  @14,@15                                             0922 02975000
*                 PRINTADR = ADDR(PARMPT);                 /*@Z427VLS*/ 02976000
         LA    @08,PARMPT                                          0923 02977000
         ST    @08,PRINTADR(,R2)                                   0923 02978000
*                 CALL IOHND(RITEPRTR);                    /*@Z427VLS*/ 02979000
         L     @15,ADIOHND(,R2)                                    0924 02980000
         LA    @01,@AL00924                                        0924 02981000
         BALR  @14,@15                                             0924 02982000
*                 RETCODE = TWELVE;                        /*@Z427VLS*/ 02983000
         MVC   RETCODE(4),@CF00037                                 0925 02984000
*                 ZEROALL = OFF;                           /*@Z427VLS*/ 02985000
         NI    ZEROALL(R2),B'10111111'                             0926 02986000
*               END;                                       /*@Z427VLS*/ 02987000
*             CSYSIN = ON;                                 /*@Z427VLS*/ 02988000
@RC00816 OI    CSYSIN(R2),B'00000100'                              0928 02989000
*             CALL IOHND (IOCLOSE);                        /*@Z427VLS*/ 02990000
         L     @15,ADIOHND(,R2)                                    0929 02991000
         LA    @01,@AL00929                                        0929 02992000
         BALR  @14,@15                                             0929 02993000
*          END;                                            /*@Z427VLS*/ 02994000
*      END;                                                /*@Z427VLS*/ 02995000
@RF00810 DS    0H                                                  0932 02996000
*    IF RDESUM = ON THEN                                           0932 02997000
@RF00797 TM    RDESUM(R2),B'10000000'                              0932 02998000
         BNO   @RF00932                                            0932 02999000
*      DO;                                                 /*@Z427VLS*/ 03000000
*        RESPECIFY (R15) RESTRICTED;                       /*@0099VLS*/ 03001000
*        IF CARDOPEN = OFF THEN             /* SYSIN NOT ALREADY OPEN*/ 03002000
         TM    CARDOPEN,B'00010000'                                0935 03003000
         BNZ   @RF00935                                            0935 03004000
*          DO;                                             /*@0099VLS*/ 03005000
*            HOLDAREA(1:2) = OPENIO;        /* SAVE THE OPEN FLAGS   */ 03006000
         MVC   HOLDAREA(2),OPENIO(R2)                              0937 03007000
*            OPENIO = OPENIO && OPENIO;                    /*@0099VLS*/ 03008000
         XC    OPENIO(2,R2),OPENIO(R2)                             0938 03009000
*            OSYSIN = ON;                   /* OPEN SYSIN ONLY       */ 03010000
         OI    OSYSIN(R2),B'00000100'                              0939 03011000
*            CALL IOHND(IOOPEN);                           /*@0099VLS*/ 03012000
         L     @15,ADIOHND(,R2)                                    0940 03013000
         LA    @01,@AL00940                                        0940 03014000
         BALR  @14,@15                                             0940 03015000
*            OPENIO = HOLDAREA(1:2);        /* RESET THE OPEN FLAGS  */ 03016000
         MVC   OPENIO(2,R2),HOLDAREA                               0941 03017000
*          END;                                            /*@0099VLS*/ 03018000
*        ELSE                                                      0943 03019000
*          R15 = ZERO;                                     /*@0099VLS*/ 03020000
         B     @RC00935                                            0943 03021000
@RF00935 SLR   R15,R15                                             0943 03022000
*        OSYSIN = OFF;                                     /*@0099VLS*/ 03023000
@RC00935 NI    OSYSIN(R2),B'11111011'                              0944 03024000
*        IF R15 ^= ZERO THEN            /* SYSIN DATA IS THERE       */ 03025000
         LTR   R15,R15                                             0945 03026000
         BZ    @RF00945                                            0945 03027000
*          DO;                                             /*@Z427VLS*/ 03028000
*            CALL IFCMSG(58,ADDR(MSGNO));                  /*@Z427VLS*/ 03029000
         LA    @14,MSGNO                                           0947 03030000
         ST    @14,@AFTEMPS+8                                      0947 03031000
         L     @15,ADIFCMSG(,R2)                                   0947 03032000
         LA    @01,@AL00947                                        0947 03033000
         BALR  @14,@15                                             0947 03034000
*            PRINTADR = ADDR(PARMPT);                      /*@Z427VLS*/ 03035000
         LA    @14,PARMPT                                          0948 03036000
         ST    @14,PRINTADR(,R2)                                   0948 03037000
*            CALL IOHND(RITEPRTR);                         /*@Z427VLS*/ 03038000
         L     @15,ADIOHND(,R2)                                    0949 03039000
         LA    @01,@AL00949                                        0949 03040000
         BALR  @14,@15                                             0949 03041000
*            RETCODE = TWELVE;                             /*@Z427VLS*/ 03042000
         MVC   RETCODE(4),@CF00037                                 0950 03043000
*          END;                                            /*@Z427VLS*/ 03044000
*        RESPECIFY (R15) UNRESTRICTED;                     /*@Z427VLS*/ 03045000
@RF00945 DS    0H                                                  0953 03046000
*      END;                                                /*@Z427VLS*/ 03047000
*    IF RETCODE = ZERO & DEBUG31 = OFF THEN                        0954 03048000
@RF00932 L     @08,RETCODE                                         0954 03049000
         LTR   @08,@08                                             0954 03050000
         BNZ   @RF00954                                            0954 03051000
         TM    DEBUG31(R2),B'00000001'                             0954 03052000
         BNZ   @RF00954                                            0954 03053000
*      DO;                                                 /*@Z427VLS*/ 03054000
*        RESPECIFY (R15) RESTRICTED;                       /*@Z427VLS*/ 03055000
*        CALL IOHND(IOOPEN);                               /*@Z427VLS*/ 03056000
         L     @15,ADIOHND(,R2)                                    0957 03057000
         LA    @01,@AL00957                                        0957 03058000
         BALR  @14,@15                                             0957 03059000
*        IF R15 ^= ZERO THEN                                       0958 03060000
         LTR   R15,R15                                             0958 03061000
         BZ    @RF00958                                            0958 03062000
*          DO RETCODE = TWELVE;         /* A DATA SET DID NOT OPEN   */ 03063000
         LA    @14,12                                              0959 03064000
         ST    @14,RETCODE                                         0959 03065000
*            ZEROALL = OFF;                                /*@Z427VLS*/ 03066000
         NI    ZEROALL(R2),B'10111111'                             0960 03067000
*          END;                                            /*@Z427VLS*/ 03068000
*        RESPECIFY (R15) UNRESTRICTED;                     /*@Z427VLS*/ 03069000
@RF00958 DS    0H                                                  0963 03070000
*      END;                                                /*@Z427VLS*/ 03071000
*  END;                                                    /*@Z427VLS*/ 03072000
@RF00954 DS    0H                                                  0965 03073000
*/********************************************************************/ 03074000
*/*                                                          @Z427VLS*/ 03075000
*/* OUTPUT THE ENVIRONMENT FOR THIS EXECUTION OF EREP.  THIS GOES    */ 03076000
*/* TO THE TOURIST DATA SET, AND REFLECTS THE SETTINGS IN THE        */ 03077000
*/* COMMUNICATIONS TABLE.                                    @Z427VLS*/ 03078000
*/*                                                          @Z427VLS*/ 03079000
*/********************************************************************/ 03080000
*    PRINTADR = ADDR(PARMPT);                              /*@Z427VLS*/ 03081000
@RF00672 LA    @08,PARMPT                                          0965 03082000
         ST    @08,PRINTADR(,R2)                                   0965 03083000
*    CALL IOHND(RITEPRTR);                                 /*@Z427VLS*/ 03084000
         L     @15,ADIOHND(,R2)                                    0966 03085000
         LA    @01,@AL00966                                        0966 03086000
         BALR  @14,@15                                             0966 03087000
*    IF RETCODE = ZERO THEN                                        0967 03088000
         L     @08,RETCODE                                         0967 03089000
         LTR   @08,@08                                             0967 03090000
         BNZ   @RF00967                                            0967 03091000
*      PARMPT(3:LENGTH(PARMHED1)+3) = PARMHED1;   /* HEADING LINE    */ 03092000
         MVI   PARMPT+45,C' '                                      0968 03093000
         MVC   PARMPT+2(43),PARMHED1                               0968 03094000
*    ELSE                                                          0969 03095000
*      PARMPT(3:LENGTH(PARMHED2)+3) = PARMHED2;   /* HEADING LINE    */ 03096000
         B     @RC00967                                            0969 03097000
@RF00967 MVI   PARMPT+49,C' '                                      0969 03098000
         MVC   PARMPT+2(47),PARMHED2                               0969 03099000
*    CALL OUTLINE;                                         /*@Z427VLS*/ 03100000
@RC00967 BAL   @14,OUTLINE                                         0970 03101000
*    /*                                                      @Z427VLS*/ 03102000
*    /* OUTPUT THE VALID RECORD TYPES.                       @Z427VLS*/ 03103000
*    /*                                                      @Z427VLS*/ 03104000
*    CALL WORDPAK1(LENGTH(RECORDS),RECORDS);               /*@Z427VLS*/ 03105000
         LA    @01,@AL00971                                        0971 03106000
         BAL   @14,WORDPAK1                                        0971 03107000
*    IF PMCH = ON THEN                                             0972 03108000
         TM    PMCH(R2),B'10000000'                                0972 03109000
         BNO   @RF00972                                            0972 03110000
*      CALL WORDPAK2(3,'MCH');                             /*@Z427VLS*/ 03111000
         LA    @01,@AL00973                                        0973 03112000
         BAL   @14,WORDPAK2                                        0973 03113000
*    IF PCHAN = ON THEN                                            0974 03114000
@RF00972 TM    PCHAN(R2),B'01000000'                               0974 03115000
         BNO   @RF00974                                            0974 03116000
*      CALL WORDPAK2(3,'CCH');                             /*@Z427VLS*/ 03117000
         LA    @01,@AL00975                                        0975 03118000
         BAL   @14,WORDPAK2                                        0975 03119000
*    IF POBR = ON THEN                                             0976 03120000
@RF00974 TM    POBR(R2),B'00100000'                                0976 03121000
         BNO   @RF00976                                            0976 03122000
*      CALL WORDPAK2(3,'OBR');                             /*@Z427VLS*/ 03123000
         LA    @01,@AL00977                                        0977 03124000
         BAL   @14,WORDPAK2                                        0977 03125000
*    IF PSOFT = ON THEN                                            0978 03126000
@RF00976 TM    PSOFT(R2),B'00010000'                               0978 03127000
         BNO   @RF00978                                            0978 03128000
*      CALL WORDPAK2(4,'SOFT');                            /*@Z427VLS*/ 03129000
         LA    @01,@AL00979                                        0979 03130000
         BAL   @14,WORDPAK2                                        0979 03131000
*    IF PIPL = ON THEN                                             0980 03132000
@RF00978 TM    PIPL(R2),B'00001000'                                0980 03133000
         BNO   @RF00980                                            0980 03134000
*      CALL WORDPAK2(3,'IPL');                             /*@Z427VLS*/ 03135000
         LA    @01,@AL00981                                        0981 03136000
         BAL   @14,WORDPAK2                                        0981 03137000
*    IF PDDR = ON THEN                                             0982 03138000
@RF00980 TM    PDDR(R2),B'00000100'                                0982 03139000
         BNO   @RF00982                                            0982 03140000
*      CALL WORDPAK2(3,'DDR');                             /*@Z427VLS*/ 03141000
         LA    @01,@AL00983                                        0983 03142000
         BAL   @14,WORDPAK2                                        0983 03143000
*    IF PMIH = ON THEN                                             0984 03144000
@RF00982 TM    PMIH(R2),B'00000010'                                0984 03145000
         BNO   @RF00984                                            0984 03146000
*      CALL WORDPAK2(3,'MIH');                             /*@Z427VLS*/ 03147000
         LA    @01,@AL00985                                        0985 03148000
         BAL   @14,WORDPAK2                                        0985 03149000
*    IF PEOD = ON THEN                                             0986 03150000
@RF00984 TM    PEOD(R2),B'00000001'                                0986 03151000
         BNO   @RF00986                                            0986 03152000
*      CALL WORDPAK2(3,'EOD');                             /*@Z427VLS*/ 03153000
         LA    @01,@AL00987                                        0987 03154000
         BAL   @14,WORDPAK2                                        0987 03155000
*    IF PTTYP = ON THEN                                            0988 03156000
@RF00986 TM    PTTYP(R2),B'10000000'                               0988 03157000
         BNO   @RF00988                                            0988 03158000
*      CALL WORDPAK2(3,'MDR');                             /*@Z427VLS*/ 03159000
         LA    @01,@AL00989                                        0989 03160000
         BAL   @14,WORDPAK2                                        0989 03161000
*    IF PMCH = OFF & PCHAN = OFF & POBR = OFF & PSOFT = OFF &      0990 03162000
*       PIPL = OFF & PDDR = OFF & PMIH = OFF & PEOD = OFF &        0990 03163000
*       PTTYP = OFF & PMCHFRAM = ON & PCCHFRAM = ON THEN           0990 03164000
@RF00988 TM    PMCH(R2),B'11111111'                                0990 03165000
         BNZ   @RF00990                                            0990 03166000
         TM    PMCHFRAM(R2),B'01100000'                            0990 03167000
         BNO   @RF00990                                            0990 03168000
         TM    PTTYP(R2),B'10000000'                               0990 03169000
         BNZ   @RF00990                                            0990 03170000
*      CALL WORDPAK2(10,'ALL FRAMES');                     /*@G51DGVS*/ 03171000
         LA    @01,@AL00991                                        0991 03172000
         BAL   @14,WORDPAK2                                        0991 03173000
*    CALL WORDPAK1(1,')');                                 /*@Z427VLS*/ 03174000
@RF00990 LA    @01,@AL00992                                        0992 03175000
         BAL   @14,WORDPAK1                                        0992 03176000
*    /*                                                      @Z427VLS*/ 03177000
*    /* OUTPUT THE APPROPRIATE FUNCTION.                     @Z427VLS*/ 03178000
*    /*                                                      @Z427VLS*/ 03179000
*    IF SYSUM = ON THEN                                            0993 03180000
         TM    SYSUM(R2),B'00000100'                               0993 03181000
         BNO   @RF00993                                            0993 03182000
*      CALL WORDPAK2(14,'SYSTEM SUMMARY');                 /*@Z427VLS*/ 03183000
         LA    @01,@AL00994                                        0994 03184000
         BAL   @14,WORDPAK2                                        0994 03185000
*    ELSE                                                          0995 03186000
*      IF TREND = ON THEN                                          0995 03187000
         B     @RC00993                                            0995 03188000
@RF00993 TM    TREND(R2),B'00010000'                               0995 03189000
         BNO   @RF00995                                            0995 03190000
*        CALL WORDPAK2(12,'TREND REPORT');                 /*@Z427VLS*/ 03191000
         LA    @01,@AL00996                                        0996 03192000
         BAL   @14,WORDPAK2                                        0996 03193000
*      ELSE                                                        0997 03194000
*        IF TIMESEQ = ON THEN                                      0997 03195000
         B     @RC00995                                            0997 03196000
@RF00995 TM    TIMESEQ(R2),B'00000010'                             0997 03197000
         BNO   @RF00997                                            0997 03198000
*          CALL WORDPAK2(13,'EVENT HISTORY');              /*@Z427VLS*/ 03199000
         LA    @01,@AL00998                                        0998 03200000
         BAL   @14,WORDPAK2                                        0998 03201000
*        ELSE                                                      0999 03202000
*          IF RDESUM = ON THEN                                     0999 03203000
         B     @RC00997                                            0999 03204000
@RF00997 TM    RDESUM(R2),B'10000000'                              0999 03205000
         BNO   @RF00999                                            0999 03206000
*            CALL WORDPAK2(11,'RDE SUMMARY');              /*@Z427VLS*/ 03207000
         LA    @01,@AL01000                                        1000 03208000
         BAL   @14,WORDPAK2                                        1000 03209000
*          ELSE                                                    1001 03210000
*            IF PARMTHR = ON THEN                                  1001 03211000
         B     @RC00999                                            1001 03212000
@RF00999 TM    PARMTHR(R2),B'00001000'                             1001 03213000
         BNO   @RF01001                                            1001 03214000
*              DO;                                         /*@Z427VLS*/ 03215000
*                CALL WORDPAK2(17,'THRESHOLD REPORT(');    /*@Z427VLS*/ 03216000
         LA    @01,@AL01003                                        1003 03217000
         BAL   @14,WORDPAK2                                        1003 03218000
*                CALL WORDPAK1(3,RDTHRSH);                 /*@Z427VLS*/ 03219000
         LA    @08,@CF00078                                        1004 03220000
         ST    @08,@AL00001                                        1004 03221000
         LA    @08,RDTHRSH(,R2)                                    1004 03222000
         ST    @08,@AL00001+4                                      1004 03223000
         LA    @01,@AL00001                                        1004 03224000
         BAL   @14,WORDPAK1                                        1004 03225000
*                CALL WORDPAK2(3,WRTHRSH);                 /*@Z427VLS*/ 03226000
         LA    @08,@CF00078                                        1005 03227000
         ST    @08,@AL00001                                        1005 03228000
         LA    @08,WRTHRSH(,R2)                                    1005 03229000
         ST    @08,@AL00001+4                                      1005 03230000
         LA    @01,@AL00001                                        1005 03231000
         BAL   @14,WORDPAK2                                        1005 03232000
*                CALL WORDPAK1(1,')');                     /*@Z427VLS*/ 03233000
         LA    @01,@AL01006                                        1006 03234000
         BAL   @14,WORDPAK1                                        1006 03235000
*              END;                                        /*@Z427VLS*/ 03236000
*            ELSE                                                  1008 03237000
*              DO;                                         /*@Z427VLS*/ 03238000
         B     @RC01001                                            1008 03239000
@RF01001 DS    0H                                                  1009 03240000
*                IF PARMMES = ON THEN                              1009 03241000
         TM    PARMMES(R2),B'01000000'                             1009 03242000
         BNO   @RF01009                                            1009 03243000
*                  CALL WORDPAK2(22,'MEDIA ERROR STATISTICS');     1010 03244000
         LA    @01,@AL01010                                        1010 03245000
         BAL   @14,WORDPAK2                                        1010 03246000
*                CALL WORDPAK2(6,'PRINT(');                /*@Z427VLS*/ 03247000
@RF01009 LA    @01,@AL01011                                        1011 03248000
         BAL   @14,WORDPAK2                                        1011 03249000
*                NOCOMMA = ON;                             /*@Z427VLS*/ 03250000
         OI    NOCOMMA,B'00001000'                                 1012 03251000
*                IF PEDIT = ON THEN                                1013 03252000
         TM    PEDIT(R2),B'00010000'                               1013 03253000
         BNO   @RF01013                                            1013 03254000
*                  CALL WORDPAK2(4,'EDIT');                /*@Z427VLS*/ 03255000
         LA    @01,@AL01014                                        1014 03256000
         BAL   @14,WORDPAK2                                        1014 03257000
*                IF PSUM = ON THEN                                 1015 03258000
@RF01013 TM    PSUM(R2),B'00001000'                                1015 03259000
         BNO   @RF01015                                            1015 03260000
*                  CALL WORDPAK2(7,'SUMMARY');             /*@Z427VLS*/ 03261000
         LA    @01,@AL01016                                        1016 03262000
         BAL   @14,WORDPAK2                                        1016 03263000
*                IF PEDIT = OFF & PSUM = OFF THEN                  1017 03264000
@RF01015 TM    PEDIT(R2),B'00011000'                               1017 03265000
         BNZ   @RF01017                                            1017 03266000
*                  CALL WORDPAK2(2,'NO');                  /*@Z427VLS*/ 03267000
         LA    @01,@AL01018                                        1018 03268000
         BAL   @14,WORDPAK2                                        1018 03269000
*                CALL WORDPAK1(1,')');                     /*@Z427VLS*/ 03270000
@RF01017 LA    @01,@AL01019                                        1019 03271000
         BAL   @14,WORDPAK1                                        1019 03272000
*              END;                                        /*@Z427VLS*/ 03273000
*    /*                                                      @Z427VLS*/ 03274000
*    /* OTHER OPTIONS.                                       @Z427VLS*/ 03275000
*    /*                                                      @Z427VLS*/ 03276000
*    IF PACC = ON THEN                                             1021 03277000
@RC01001 DS    0H                                                  1021 03278000
@RC00999 DS    0H                                                  1021 03279000
@RC00997 DS    0H                                                  1021 03280000
@RC00995 DS    0H                                                  1021 03281000
@RC00993 TM    PACC(R2),B'01000000'                                1021 03282000
         BNO   @RF01021                                            1021 03283000
*      CALL WORDPAK2(10,'ACCUMULATE');                     /*@Z427VLS*/ 03284000
         LA    @01,@AL01022                                        1022 03285000
         BAL   @14,WORDPAK2                                        1022 03286000
*    IF PLOGREC = ON THEN                                          1023 03287000
@RF01021 TM    PLOGREC(R2),B'00000010'                             1023 03288000
         BNO   @RF01023                                            1023 03289000
*      CALL WORDPAK2(12,'LOGREC INPUT');                   /*@Z427VLS*/ 03290000
         LA    @01,@AL01024                                        1024 03291000
         BAL   @14,WORDPAK2                                        1024 03292000
*    IF PHIST = ON THEN                                            1025 03293000
@RF01023 TM    PHIST(R2),B'00100000'                               1025 03294000
         BNO   @RF01025                                            1025 03295000
*      CALL WORDPAK2(13,'HISTORY INPUT');                  /*@Z427VLS*/ 03296000
         LA    @01,@AL01026                                        1026 03297000
         BAL   @14,WORDPAK2                                        1026 03298000
*    IF ZEROALL = ON THEN                                          1027 03299000
@RF01025 TM    ZEROALL(R2),B'01000000'                             1027 03300000
         BNO   @RF01027                                            1027 03301000
*      CALL WORDPAK2(12,'CLEAR LOGREC');                   /*@Z427VLS*/ 03302000
         LA    @01,@AL01028                                        1028 03303000
         BAL   @14,WORDPAK2                                        1028 03304000
*    IF NOSDR = OFF THEN                                           1029 03305000
@RF01027 TM    NOSDR(R2),B'00000001'                               1029 03306000
         BNZ   @RF01029                                            1029 03307000
*      CALL WORDPAK2(17,'DUMP SDR COUNTERS');              /*@Z427VLS*/ 03308000
         LA    @01,@AL01030                                        1030 03309000
         BAL   @14,WORDPAK2                                        1030 03310000
*    IF SHORTOBR = ON THEN                                         1031 03311000
@RF01029 TM    SHORTOBR(R2),B'00100000'                            1031 03312000
         BNO   @RF01031                                            1031 03313000
*      CALL WORDPAK2(21,'EDIT-PRINT SHORT OBRS');          /*@Z427VLS*/ 03314000
         LA    @01,@AL01032                                        1032 03315000
         BAL   @14,WORDPAK2                                        1032 03316000
*    CALL OUTLINE;                                         /*@Z427VLS*/ 03317000
@RF01031 BAL   @14,OUTLINE                                         1033 03318000
*    /*                                                      @Z427VLS*/ 03319000
*    /* DATE AND TIME RANGES.                                @Z427VLS*/ 03320000
*    /*                                                      @Z427VLS*/ 03321000
*    CALL WORDPAK1(18,'DATE/TIME RANGE - ');               /*@Z427VLS*/ 03322000
         LA    @01,@AL01034                                        1034 03323000
         BAL   @14,WORDPAK1                                        1034 03324000
*    IF DATEFLG = ON THEN                                          1035 03325000
         TM    DATEFLG,B'00000100'                                 1035 03326000
         BNO   @RF01035                                            1035 03327000
*      DO;                                                 /*@Z427VLS*/ 03328000
*        UNPK (HOLDAREA,PSTD);          /* STARTING DATE     @Z427VLS*/ 03329000
         UNPK  HOLDAREA(5),PSTD(3,R2)                              1037 03330000
*        CALL WORDPAK2(5,HOLDAREA);                        /*@Z427VLS*/ 03331000
         LA    @01,@AL01038                                        1038 03332000
         BAL   @14,WORDPAK2                                        1038 03333000
*        UNPK (HOLDAREA,PEND);          /* ENDING DATE       @Z427VLS*/ 03334000
         UNPK  HOLDAREA(5),PEND(3,R2)                              1039 03335000
*        CALL WORDPAK2(5,HOLDAREA);                        /*@Z427VLS*/ 03336000
         LA    @01,@AL01040                                        1040 03337000
         BAL   @14,WORDPAK2                                        1040 03338000
*        CALL WORDPAK1(1,'/');                             /*@Z427VLS*/ 03339000
         LA    @01,@AL01041                                        1041 03340000
         BAL   @14,WORDPAK1                                        1041 03341000
*        DO J = 1 TO 4 BY 1;                               /*@Z427VLS*/ 03342000
         LA    J,1                                                 1042 03343000
@DL01042 DS    0H                                                  1043 03344000
*          HOLDAREA(1) = HEXZERO;                          /*@Z427VLS*/ 03345000
         MVI   HOLDAREA,X'00'                                      1043 03346000
*          HOLDAREA(2) = STTIME1(J);                       /*@Z427VLS*/ 03347000
         LR    @08,R2                                              1044 03348000
         ALR   @08,J                                               1044 03349000
         MVC   HOLDAREA+1(1),STTIME1-1(@08)                        1044 03350000
*          CALL CHARPACK;                                  /*@Z427VLS*/ 03351000
         BAL   @14,CHARPACK                                        1045 03352000
*        END;                                              /*@Z427VLS*/ 03353000
         AL    J,@CF00058                                          1046 03354000
         C     J,@CF00039                                          1046 03355000
         BNH   @DL01042                                            1046 03356000
*        CALL WORDPAK1(8,KEYWORD);      /* STARTING TIME     @Z427VLS*/ 03357000
         LA    @01,@AL01047                                        1047 03358000
         BAL   @14,WORDPAK1                                        1047 03359000
*        CALL WORDPAK1(1,':');                             /*@Z427VLS*/ 03360000
         LA    @01,@AL01048                                        1048 03361000
         BAL   @14,WORDPAK1                                        1048 03362000
*        DO J = 1 TO 4 BY 1;                               /*@Z427VLS*/ 03363000
         LA    J,1                                                 1049 03364000
@DL01049 DS    0H                                                  1050 03365000
*          HOLDAREA(1) = HEXZERO;                          /*@Z427VLS*/ 03366000
         MVI   HOLDAREA,X'00'                                      1050 03367000
*          HOLDAREA(2) = ENDTIME2(J);                      /*@Z427VLS*/ 03368000
         LR    @08,R2                                              1051 03369000
         ALR   @08,J                                               1051 03370000
         MVC   HOLDAREA+1(1),ENDTIME2-1(@08)                       1051 03371000
*          CALL CHARPACK;                                  /*@Z427VLS*/ 03372000
         BAL   @14,CHARPACK                                        1052 03373000
*        END;                                              /*@Z427VLS*/ 03374000
         AL    J,@CF00058                                          1053 03375000
         C     J,@CF00039                                          1053 03376000
         BNH   @DL01049                                            1053 03377000
*        CALL WORDPAK1(8,KEYWORD);      /* ENDING TIME       @Z427VLS*/ 03378000
         LA    @01,@AL01054                                        1054 03379000
         BAL   @14,WORDPAK1                                        1054 03380000
*        IF SHIFT3RD = ON THEN          /* OVER MIDNIGHT ?   @Z427VLS*/ 03381000
         TM    SHIFT3RD(R2),B'00010000'                            1055 03382000
         BNO   @RF01055                                            1055 03383000
*          CALL WORDPAK2(21,'TIME CROSSES MIDNIGHT');      /*@Z427VLS*/ 03384000
         LA    @01,@AL01056                                        1056 03385000
         BAL   @14,WORDPAK2                                        1056 03386000
*      END;                                                /*@Z427VLS*/ 03387000
*    ELSE                                                          1058 03388000
*      CALL WORDPAK1(3,'ALL');                             /*@Z427VLS*/ 03389000
         B     @RC01035                                            1058 03390000
@RF01035 LA    @01,@AL01058                                        1058 03391000
         BAL   @14,WORDPAK1                                        1058 03392000
*    CALL OUTLINE;                                         /*@Z427VLS*/ 03393000
@RC01035 BAL   @14,OUTLINE                                         1059 03394000
*    /*                                                      @Z427VLS*/ 03395000
*    /* TERMINAL NAME.                                       @Z427VLS*/ 03396000
*    /*                                                      @Z427VLS*/ 03397000
*    IF TERMFLG = ON THEN                                          1060 03398000
         TM    TERMFLG,B'00001000'                                 1060 03399000
         BNO   @RF01060                                            1060 03400000
*      DO;                                                 /*@Z427VLS*/ 03401000
*        CALL WORDPAK1(16,'TERMINAL NAME - ');             /*@Z427VLS*/ 03402000
         LA    @01,@AL01062                                        1062 03403000
         BAL   @14,WORDPAK1                                        1062 03404000
*        CALL WORDPAK2(8,TERM);                            /*@Z427VLS*/ 03405000
         LA    @08,@CF00068                                        1063 03406000
         ST    @08,@AL00001                                        1063 03407000
         LA    @08,TERM(,R2)                                       1063 03408000
         ST    @08,@AL00001+4                                      1063 03409000
         LA    @01,@AL00001                                        1063 03410000
         BAL   @14,WORDPAK2                                        1063 03411000
*      END;                                                /*@Z427VLS*/ 03412000
*    /*                                                      @Z427VLS*/ 03413000
*    /* ERROR IDENTIFIER.                                    @Z427VLS*/ 03414000
*    /*                                                      @Z427VLS*/ 03415000
*    IF ERRORFLG = ON THEN                                         1065 03416000
@RF01060 TM    ERRORFLG,B'00000001'                                1065 03417000
         BNO   @RF01065                                            1065 03418000
*      DO;                                                 /*@Z427VLS*/ 03419000
*        CALL WORDPAK2(11,'ERROR ID - ');                  /*@Z427VLS*/ 03420000
         LA    @01,@AL01067                                        1067 03421000
         BAL   @14,WORDPAK2                                        1067 03422000
*        INDEX2 = IDVALUE;                                 /*@Z427VLS*/ 03423000
         LH    @08,IDVALUE(,R2)                                    1068 03424000
         N     @08,@CF01206                                        1068 03425000
         ST    @08,INDEX2                                          1068 03426000
*        CVD (INDEX2,KEYWORD(1:8));                        /*@Z427VLS*/ 03427000
         CVD   @08,KEYWORD                                         1069 03428000
*        KEYWORD(8) = KEYWORD(8) | SIGNFLAG;               /*@Z427VLS*/ 03429000
         OI    KEYWORD+7,X'0F'                                     1070 03430000
*        UNPK (HOLDAREA(1:5),KEYWORD(6:8));                /*@Z427VLS*/ 03431000
         UNPK  HOLDAREA(5),KEYWORD+5(3)                            1071 03432000
*        CALL WORDPAK1(5,HOLDAREA);                        /*@Z427VLS*/ 03433000
         LA    @01,@AL01072                                        1072 03434000
         BAL   @14,WORDPAK1                                        1072 03435000
*        IF IDCPU ^= 'FF'X THEN                                    1073 03436000
         CLI   IDCPU(R2),X'FF'                                     1073 03437000
         BE    @RF01073                                            1073 03438000
*          DO J = 1;                                       /*@Z427VLS*/ 03439000
         LA    J,1                                                 1074 03440000
*            HOLDAREA(1) = HEXZERO;                        /*@Z427VLS*/ 03441000
         MVI   HOLDAREA,X'00'                                      1075 03442000
*            HOLDAREA(2) = IDCPU;                          /*@Z427VLS*/ 03443000
         MVC   HOLDAREA+1(1),IDCPU(R2)                             1076 03444000
*            CALL CHARPACK;                                /*@Z427VLS*/ 03445000
         BAL   @14,CHARPACK                                        1077 03446000
*            CALL WORDPAK2(2,KEYWORD(1:2));                /*@Z427VLS*/ 03447000
         LA    @01,@AL01078                                        1078 03448000
         BAL   @14,WORDPAK2                                        1078 03449000
*            DO J = 1 TO 2 BY 1;                           /*@Z427VLS*/ 03450000
         LA    J,1                                                 1079 03451000
@DL01079 DS    0H                                                  1080 03452000
*              HOLDAREA(1) = HEXZERO;                      /*@Z427VLS*/ 03453000
         MVI   HOLDAREA,X'00'                                      1080 03454000
*              HOLDAREA(2) = IDASID(J);                    /*@Z427VLS*/ 03455000
         LR    @08,R2                                              1081 03456000
         ALR   @08,J                                               1081 03457000
         MVC   HOLDAREA+1(1),IDASID-1(@08)                         1081 03458000
*              CALL CHARPACK;                              /*@Z427VLS*/ 03459000
         BAL   @14,CHARPACK                                        1082 03460000
*            END;                                          /*@Z427VLS*/ 03461000
         AL    J,@CF00058                                          1083 03462000
         C     J,@CF00076                                          1083 03463000
         BNH   @DL01079                                            1083 03464000
*            CALL WORDPAK2(4,KEYWORD(1:4));                /*@Z427VLS*/ 03465000
         LA    @01,@AL01084                                        1084 03466000
         BAL   @14,WORDPAK2                                        1084 03467000
*            CALL WORDPAK1(1,'.');                         /*@Z427VLS*/ 03468000
         LA    @01,@AL01085                                        1085 03469000
         BAL   @14,WORDPAK1                                        1085 03470000
*            DO J = 1 TO 4 BY 1;                           /*@Z427VLS*/ 03471000
         LA    J,1                                                 1086 03472000
@DL01086 DS    0H                                                  1087 03473000
*              INDEX2 = IDTIMEA(J);                        /*@Z427VLS*/ 03474000
         SLR   @08,@08                                             1087 03475000
         IC    @08,IDTIMEA-1(J,R2)                                 1087 03476000
         ST    @08,INDEX2                                          1087 03477000
*              CVD (INDEX2,KEYWORD(1:8));                  /*@Z427VLS*/ 03478000
         CVD   @08,KEYWORD                                         1088 03479000
*              KEYWORD(8) = KEYWORD(8) | SIGNFLAG;         /*@Z427VLS*/ 03480000
         OI    KEYWORD+7,X'0F'                                     1089 03481000
*              UNPK (HOLDAREA(1:5),KEYWORD(6:8));          /*@Z427VLS*/ 03482000
         UNPK  HOLDAREA(5),KEYWORD+5(3)                            1090 03483000
*              CALL WORDPAK1(2,HOLDAREA(4:5));             /*@Z427VLS*/ 03484000
         LA    @01,@AL01091                                        1091 03485000
         BAL   @14,WORDPAK1                                        1091 03486000
*            END;                                          /*@Z427VLS*/ 03487000
         AL    J,@CF00058                                          1092 03488000
         C     J,@CF00039                                          1092 03489000
         BNH   @DL01086                                            1092 03490000
*        END;                                              /*@Z427VLS*/ 03491000
*      END;                                                /*@Z427VLS*/ 03492000
@RF01073 DS    0H                                                  1095 03493000
*    /*                                                      @Z427VLS*/ 03494000
*    /* TABLE SIZE.                                          @Z427VLS*/ 03495000
*    /*                                                      @Z427VLS*/ 03496000
*    CALL WORDPAK2(13,'TABLE SIZE - ');                    /*@Z427VLS*/ 03497000
@RF01065 LA    @01,@AL01095                                        1095 03498000
         BAL   @14,WORDPAK2                                        1095 03499000
*    INDEX2 = TABSIZE/1024;                                /*@Z427VLS*/ 03500000
         L     @00,TABSIZE(,R2)                                    1096 03501000
         SRDA  @00,32                                              1096 03502000
         D     @00,@CF01102                                        1096 03503000
         ST    @01,INDEX2                                          1096 03504000
*    CVD (INDEX2,KEYWORD(1:8));                            /*@Z427VLS*/ 03505000
         CVD   @01,KEYWORD                                         1097 03506000
*    KEYWORD(8) = KEYWORD(8) | SIGNFLAG;                   /*@Z427VLS*/ 03507000
         OI    KEYWORD+7,X'0F'                                     1098 03508000
*    UNPK (HOLDAREA(1:3),KEYWORD(7:8));                    /*@Z427VLS*/ 03509000
         UNPK  HOLDAREA(3),KEYWORD+6(2)                            1099 03510000
*    CALL WORDPAK1 (3,HOLDAREA(1:3));                      /*@Z427VLS*/ 03511000
         LA    @01,@AL01100                                        1100 03512000
         BAL   @14,WORDPAK1                                        1100 03513000
*    CALL WORDPAK1 (1,'K');                                /*@Z427VLS*/ 03514000
         LA    @01,@AL01101                                        1101 03515000
         BAL   @14,WORDPAK1                                        1101 03516000
*    /*                                                      @Z427VLS*/ 03517000
*    /* LINE COUNT.                                          @Z427VLS*/ 03518000
*    /*                                                      @Z427VLS*/ 03519000
*    CALL WORDPAK2(13,'LINE COUNT - ');                    /*@Z427VLS*/ 03520000
         LA    @01,@AL01102                                        1102 03521000
         BAL   @14,WORDPAK2                                        1102 03522000
*    CVD (LINECT,KEYWORD(1:8));                            /*@Z427VLS*/ 03523000
         LH    @08,LINECT(,R2)                                     1103 03524000
         CVD   @08,KEYWORD                                         1103 03525000
*    KEYWORD(8) = KEYWORD(8) | SIGNFLAG;                   /*@Z427VLS*/ 03526000
         OI    KEYWORD+7,X'0F'                                     1104 03527000
*    UNPK (HOLDAREA(1:3),KEYWORD(7:8));                    /*@Z427VLS*/ 03528000
         UNPK  HOLDAREA(3),KEYWORD+6(2)                            1105 03529000
*    CALL WORDPAK1(3,HOLDAREA(1:3));                       /*@Z427VLS*/ 03530000
         LA    @01,@AL01106                                        1106 03531000
         BAL   @14,WORDPAK1                                        1106 03532000
*    CALL OUTLINE;                                         /*@Z427VLS*/ 03533000
         BAL   @14,OUTLINE                                         1107 03534000
*    /*                                                      @Z427VLS*/ 03535000
*    /* CUA TABLE.                                           @Z427VLS*/ 03536000
*    /*                                                      @Z427VLS*/ 03537000
*    IF CUAPTR ^= ZERO THEN                                        1108 03538000
         L     @08,CUAPTR(,R2)                                     1108 03539000
         LTR   @08,@08                                             1108 03540000
         BZ    @RF01108                                            1108 03541000
*      DO;                                                 /*@Z427VLS*/ 03542000
*        MSGNO(1:LENGTH(CUATAB)) = CUATAB;                 /*@Z427VLS*/ 03543000
         MVC   MSGNO(11),CUATAB                                    1110 03544000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03545000
         BAL   @14,OUTLINE                                         1111 03546000
*        DO J = 1 TO CUANUM BY 1;                          /*@Z427VLS*/ 03547000
         LA    J,1                                                 1112 03548000
         B     @DE01112                                            1112 03549000
@DL01112 DS    0H                                                  1113 03550000
*          CALL WORDCON2(2,CUA1(J));                       /*@Z427VLS*/ 03551000
         LA    @08,@CF00076                                        1113 03552000
         ST    @08,@AL00001                                        1113 03553000
         LR    @08,J                                               1113 03554000
         SLA   @08,2                                               1113 03555000
         L     @07,CUAPTR(,R2)                                     1113 03556000
         BCTR  @07,0                                               1113 03557000
         BCTR  @07,0                                               1113 03558000
         LA    @08,CUA1-2(@08,@07)                                 1113 03559000
         ST    @08,@AL00001+4                                      1113 03560000
         LA    @01,@AL00001                                        1113 03561000
         BAL   @14,WORDCON2                                        1113 03562000
*          CALL WORDPAK1(1,DASH);                          /*@Z427VLS*/ 03563000
         LA    @01,@AL01114                                        1114 03564000
         BAL   @14,WORDPAK1                                        1114 03565000
*          CALL WORDCON1(2,CUA2(J));                       /*@Z427VLS*/ 03566000
         LA    @08,@CF00076                                        1115 03567000
         ST    @08,@AL00001                                        1115 03568000
         LR    @08,J                                               1115 03569000
         SLA   @08,2                                               1115 03570000
         L     @07,CUAPTR(,R2)                                     1115 03571000
         LA    @08,CUA2-4(@08,@07)                                 1115 03572000
         ST    @08,@AL00001+4                                      1115 03573000
         LA    @01,@AL00001                                        1115 03574000
         BAL   @14,WORDCON1                                        1115 03575000
*        END;                                              /*@Z427VLS*/ 03576000
         AL    J,@CF00058                                          1116 03577000
@DE01112 L     @08,CUAPTR(,R2)                                     1116 03578000
         CH    J,CUANUM(,@08)                                      1116 03579000
         BNH   @DL01112                                            1116 03580000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03581000
         BAL   @14,OUTLINE                                         1117 03582000
*      END;                                                /*@Z427VLS*/ 03583000
*    /*                                                      @Z427VLS*/ 03584000
*    /* MODEL TABLE.                                         @Z427VLS*/ 03585000
*    /*                                                      @Z427VLS*/ 03586000
*    IF MODPTR ^= ZERO THEN                                        1119 03587000
@RF01108 L     @08,MODPTR(,R2)                                     1119 03588000
         LTR   @08,@08                                             1119 03589000
         BZ    @RF01119                                            1119 03590000
*      DO;                                                 /*@Z427VLS*/ 03591000
*        MSGNO(1:LENGTH(MODTAB)) = MODTAB;                 /*@Z427VLS*/ 03592000
         MVC   MSGNO(13),MODTAB                                    1121 03593000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03594000
         BAL   @14,OUTLINE                                         1122 03595000
*        DO J = 1 TO MODNUM BY 1;                          /*@Z427VLS*/ 03596000
         LA    J,1                                                 1123 03597000
         B     @DE01123                                            1123 03598000
@DL01123 DS    0H                                                  1124 03599000
*          CALL WORDCON2(2,MODVAL(J));                     /*@Z427VLS*/ 03600000
         LA    @08,@CF00076                                        1124 03601000
         ST    @08,@AL00001                                        1124 03602000
         LR    @08,J                                               1124 03603000
         ALR   @08,@08                                             1124 03604000
         L     @07,MODPTR(,R2)                                     1124 03605000
         LA    @08,MODVAL-2(@08,@07)                               1124 03606000
         ST    @08,@AL00001+4                                      1124 03607000
         LA    @01,@AL00001                                        1124 03608000
         BAL   @14,WORDCON2                                        1124 03609000
*        END;                                              /*@Z427VLS*/ 03610000
         AL    J,@CF00058                                          1125 03611000
@DE01123 L     @08,MODPTR(,R2)                                     1125 03612000
         CH    J,MODNUM(,@08)                                      1125 03613000
         BNH   @DL01123                                            1125 03614000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03615000
         BAL   @14,OUTLINE                                         1126 03616000
*      END;                                                /*@Z427VLS*/ 03617000
*    /*                                                      @Z427VLS*/ 03618000
*    /* VOLUME ID TABLE.                                     @Z427VLS*/ 03619000
*    /*                                                      @Z427VLS*/ 03620000
*    IF VOLPTR ^= ZERO THEN                                        1128 03621000
@RF01119 L     @08,VOLPTR(,R2)                                     1128 03622000
         LTR   @08,@08                                             1128 03623000
         BZ    @RF01128                                            1128 03624000
*      DO;                                                 /*@Z427VLS*/ 03625000
*        MSGNO(1:LENGTH(VOLTAB)) = VOLTAB;                 /*@Z427VLS*/ 03626000
         MVC   MSGNO(17),VOLTAB                                    1130 03627000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03628000
         BAL   @14,OUTLINE                                         1131 03629000
*        DO J = 1 TO VOLNUM BY 1;                          /*@Z427VLS*/ 03630000
         LA    J,1                                                 1132 03631000
         B     @DE01132                                            1132 03632000
@DL01132 DS    0H                                                  1133 03633000
*          CALL WORDPAK2(6,VOLVAL(J));                     /*@Z427VLS*/ 03634000
         LA    @08,@CF00083                                        1133 03635000
         ST    @08,@AL00001                                        1133 03636000
         LR    @08,J                                               1133 03637000
         MH    @08,@CH00083                                        1133 03638000
         L     @07,VOLPTR(,R2)                                     1133 03639000
         AL    @07,@CF01207                                        1133 03640000
         LA    @08,VOLVAL-2(@08,@07)                               1133 03641000
         ST    @08,@AL00001+4                                      1133 03642000
         LA    @01,@AL00001                                        1133 03643000
         BAL   @14,WORDPAK2                                        1133 03644000
*        END;                                              /*@Z427VLS*/ 03645000
         AL    J,@CF00058                                          1134 03646000
@DE01132 L     @08,VOLPTR(,R2)                                     1134 03647000
         CH    J,VOLNUM(,@08)                                      1134 03648000
         BNH   @DL01132                                            1134 03649000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03650000
         BAL   @14,OUTLINE                                         1135 03651000
*      END;                                                /*@Z427VLS*/ 03652000
*    /*                                                      @Z427VLS*/ 03653000
*    /* CPU TABLE.                                           @Z427VLS*/ 03654000
*    /*                                                      @Z427VLS*/ 03655000
*    IF CPUPTR ^= ZERO THEN                                        1137 03656000
@RF01128 L     @08,CPUPTR(,R2)                                     1137 03657000
         LTR   @08,@08                                             1137 03658000
         BZ    @RF01137                                            1137 03659000
*      DO;                                                 /*@Z427VLS*/ 03660000
*        MSGNO(1:LENGTH(CPUTAB)) = CPUTAB;                 /*@Z427VLS*/ 03661000
         MVC   MSGNO(11),CPUTAB                                    1139 03662000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03663000
         BAL   @14,OUTLINE                                         1140 03664000
*        DO J = 1 TO CPUNUM BY 1;                          /*@Z427VLS*/ 03665000
         LA    J,1                                                 1141 03666000
         B     @DE01141                                            1141 03667000
@DL01141 DS    0H                                                  1142 03668000
*          CALL WORDCON2(3,CPUVAL(J,1:3));                 /*@Z427VLS*/ 03669000
         LA    @08,@CF00078                                        1142 03670000
         ST    @08,@AL00001                                        1142 03671000
         LR    @08,J                                               1142 03672000
         MH    @08,@CH00081                                        1142 03673000
         L     @07,CPUPTR(,R2)                                     1142 03674000
         AL    @07,@CF01208                                        1142 03675000
         LA    @08,CPUVAL-2(@08,@07)                               1142 03676000
         ST    @08,@AL00001+4                                      1142 03677000
         LA    @01,@AL00001                                        1142 03678000
         BAL   @14,WORDCON2                                        1142 03679000
*          CALL WORDPAK1(1,PERIOD);                        /*@Z427VLS*/ 03680000
         LA    @01,@AL01143                                        1143 03681000
         BAL   @14,WORDPAK1                                        1143 03682000
*          CALL WORDCON1(2,CPUVAL(J,4:5));                 /*@Z427VLS*/ 03683000
         LA    @08,@CF00076                                        1144 03684000
         ST    @08,@AL00001                                        1144 03685000
         LR    @08,J                                               1144 03686000
         MH    @08,@CH00081                                        1144 03687000
         L     @07,CPUPTR(,R2)                                     1144 03688000
         LA    @08,CPUVAL-2(@08,@07)                               1144 03689000
         ST    @08,@AL00001+4                                      1144 03690000
         LA    @01,@AL00001                                        1144 03691000
         BAL   @14,WORDCON1                                        1144 03692000
*        END;                                              /*@Z427VLS*/ 03693000
         AL    J,@CF00058                                          1145 03694000
@DE01141 L     @08,CPUPTR(,R2)                                     1145 03695000
         CH    J,CPUNUM(,@08)                                      1145 03696000
         BNH   @DL01141                                            1145 03697000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03698000
         BAL   @14,OUTLINE                                         1146 03699000
*      END;                                                /*@Z427VLS*/ 03700000
*    /*                                                      @Z427VLS*/ 03701000
*    /* CPU/CUA TABLE.                                       @Z427VLS*/ 03702000
*    /*                                                      @Z427VLS*/ 03703000
*    IF CPCUAPTR ^= ZERO THEN                                      1148 03704000
@RF01137 L     @08,CPCUAPTR(,R2)                                   1148 03705000
         LTR   @08,@08                                             1148 03706000
         BZ    @RF01148                                            1148 03707000
*      DO;                                                 /*@Z427VLS*/ 03708000
*        MSGNO(1:LENGTH(CPCUATAB)) = CPCUATAB;             /*@Z427VLS*/ 03709000
         MVC   MSGNO(15),CPCUATAB                                  1150 03710000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03711000
         BAL   @14,OUTLINE                                         1151 03712000
*        DO J = 1 TO CPCUANUM BY 1;                        /*@Z427VLS*/ 03713000
         LA    J,1                                                 1152 03714000
         B     @DE01152                                            1152 03715000
@DL01152 DS    0H                                                  1153 03716000
*          CALL WORDCON2(3,CPUCUAV(J,1:3));                /*@Z427VLS*/ 03717000
         LA    @08,@CF00078                                        1153 03718000
         ST    @08,@AL00001                                        1153 03719000
         LR    @08,J                                               1153 03720000
         MH    @08,@CH00085                                        1153 03721000
         L     @07,CPCUAPTR(,R2)                                   1153 03722000
         AL    @07,@CF01209                                        1153 03723000
         LA    @08,CPUCUAV-2(@08,@07)                              1153 03724000
         ST    @08,@AL00001+4                                      1153 03725000
         LA    @01,@AL00001                                        1153 03726000
         BAL   @14,WORDCON2                                        1153 03727000
*          CALL WORDPAK1(1,PERIOD);                        /*@Z427VLS*/ 03728000
         LA    @01,@AL01154                                        1154 03729000
         BAL   @14,WORDPAK1                                        1154 03730000
*          CALL WORDCON1(2,CPUCUAV(J,4:5));                /*@0099VLS*/ 03731000
         LA    @08,@CF00076                                        1155 03732000
         ST    @08,@AL00001                                        1155 03733000
         LR    @08,J                                               1155 03734000
         MH    @08,@CH00085                                        1155 03735000
         L     @07,CPCUAPTR(,R2)                                   1155 03736000
         BCTR  @07,0                                               1155 03737000
         BCTR  @07,0                                               1155 03738000
         LA    @08,CPUCUAV-2(@08,@07)                              1155 03739000
         ST    @08,@AL00001+4                                      1155 03740000
         LA    @01,@AL00001                                        1155 03741000
         BAL   @14,WORDCON1                                        1155 03742000
*          CALL WORDPAK1(1,DASH);                          /*@0099VLS*/ 03743000
         LA    @01,@AL01156                                        1156 03744000
         BAL   @14,WORDPAK1                                        1156 03745000
*          CALL WORDCON1(2,CPUCUAV(J,6:7));                /*@0099VLS*/ 03746000
         LA    @08,@CF00076                                        1157 03747000
         ST    @08,@AL00001                                        1157 03748000
         LR    @08,J                                               1157 03749000
         MH    @08,@CH00085                                        1157 03750000
         L     @07,CPCUAPTR(,R2)                                   1157 03751000
         LA    @08,CPUCUAV-2(@08,@07)                              1157 03752000
         ST    @08,@AL00001+4                                      1157 03753000
         LA    @01,@AL00001                                        1157 03754000
         BAL   @14,WORDCON1                                        1157 03755000
*        END;                                              /*@Z427VLS*/ 03756000
         AL    J,@CF00058                                          1158 03757000
@DE01152 L     @08,CPCUAPTR(,R2)                                   1158 03758000
         CH    J,CPCUANUM(,@08)                                    1158 03759000
         BNH   @DL01152                                            1158 03760000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03761000
         BAL   @14,OUTLINE                                         1159 03762000
*      END;                                                /*@Z427VLS*/ 03763000
*    /*                                                      @Z427VLS*/ 03764000
*    /* LINE INTERFACE BASE ADDRESS TABLE.                   @Z427VLS*/ 03765000
*    /*                                                      @Z427VLS*/ 03766000
*    IF LIBADPTR ^= ZERO THEN                                      1161 03767000
@RF01148 L     @08,LIBADPTR(,R2)                                   1161 03768000
         LTR   @08,@08                                             1161 03769000
         BZ    @RF01161                                            1161 03770000
*      DO;                                                 /*@Z427VLS*/ 03771000
*        MSGNO(1:LENGTH(LIBADTAB)) = LIBADTAB;             /*@Z427VLS*/ 03772000
         MVC   MSGNO(35),LIBADTAB                                  1163 03773000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03774000
         BAL   @14,OUTLINE                                         1164 03775000
*        DO J = 1 TO LIBADNUM BY 1;                        /*@Z427VLS*/ 03776000
         LA    J,1                                                 1165 03777000
         B     @DE01165                                            1165 03778000
@DL01165 DS    0H                                                  1166 03779000
*          CALL WORDCON2(2,LIBVAL(J));                     /*@Z427VLS*/ 03780000
         LA    @08,@CF00076                                        1166 03781000
         ST    @08,@AL00001                                        1166 03782000
         LR    @08,J                                               1166 03783000
         ALR   @08,@08                                             1166 03784000
         L     @07,LIBADPTR(,R2)                                   1166 03785000
         LA    @08,LIBVAL-2(@08,@07)                               1166 03786000
         ST    @08,@AL00001+4                                      1166 03787000
         LA    @01,@AL00001                                        1166 03788000
         BAL   @14,WORDCON2                                        1166 03789000
*        END;                                              /*@Z427VLS*/ 03790000
         AL    J,@CF00058                                          1167 03791000
@DE01165 L     @08,LIBADPTR(,R2)                                   1167 03792000
         CH    J,LIBADNUM(,@08)                                    1167 03793000
         BNH   @DL01165                                            1167 03794000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03795000
         BAL   @14,OUTLINE                                         1168 03796000
*      END;                                                /*@Z427VLS*/ 03797000
*    /*                                                      @Z427VLS*/ 03798000
*    /* FAULT SYMPTOM CODE TABLE.                            @Z427VLS*/ 03799000
*    /*                                                      @Z427VLS*/ 03800000
*    IF SYMCDPTR ^= ZERO THEN                                      1170 03801000
@RF01161 L     @08,SYMCDPTR(,R2)                                   1170 03802000
         LTR   @08,@08                                             1170 03803000
         BZ    @RF01170                                            1170 03804000
*      DO;                                                 /*@Z427VLS*/ 03805000
*        MSGNO(1:LENGTH(SYMCDTAB)) = SYMCDTAB;             /*@Z427VLS*/ 03806000
         MVC   MSGNO(15),SYMCDTAB                                  1172 03807000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03808000
         BAL   @14,OUTLINE                                         1173 03809000
*        DO J = 1 TO SYMCDNUM BY 1;                        /*@Z427VLS*/ 03810000
         LA    J,1                                                 1174 03811000
         B     @DE01174                                            1174 03812000
@DL01174 DS    0H                                                  1175 03813000
*          CALL WORDCON2(2,SYMVAL1(J));                    /*@Z427VLS*/ 03814000
         LA    @08,@CF00076                                        1175 03815000
         ST    @08,@AL00001                                        1175 03816000
         LR    @08,J                                               1175 03817000
         SLA   @08,2                                               1175 03818000
         L     @07,SYMCDPTR(,R2)                                   1175 03819000
         BCTR  @07,0                                               1175 03820000
         BCTR  @07,0                                               1175 03821000
         LA    @08,SYMVAL1-2(@08,@07)                              1175 03822000
         ST    @08,@AL00001+4                                      1175 03823000
         LA    @01,@AL00001                                        1175 03824000
         BAL   @14,WORDCON2                                        1175 03825000
*          CALL WORDPAK1(1,DASH);                          /*@Z427VLS*/ 03826000
         LA    @01,@AL01176                                        1176 03827000
         BAL   @14,WORDPAK1                                        1176 03828000
*          CALL WORDCON1(2,SYMVAL2(J));                    /*@Z427VLS*/ 03829000
         LA    @08,@CF00076                                        1177 03830000
         ST    @08,@AL00001                                        1177 03831000
         LR    @08,J                                               1177 03832000
         SLA   @08,2                                               1177 03833000
         L     @07,SYMCDPTR(,R2)                                   1177 03834000
         LA    @08,SYMVAL2-4(@08,@07)                              1177 03835000
         ST    @08,@AL00001+4                                      1177 03836000
         LA    @01,@AL00001                                        1177 03837000
         BAL   @14,WORDCON1                                        1177 03838000
*        END;                                              /*@Z427VLS*/ 03839000
         AL    J,@CF00058                                          1178 03840000
@DE01174 L     @08,SYMCDPTR(,R2)                                   1178 03841000
         CH    J,SYMCDNUM(,@08)                                    1178 03842000
         BNH   @DL01174                                            1178 03843000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03844000
         BAL   @14,OUTLINE                                         1179 03845000
*      END;                                                /*@Z427VLS*/ 03846000
*    /*                                                      @Z427VLS*/ 03847000
*    /* DEVICE TABLE.                                        @Z427VLS*/ 03848000
*    /*                                                      @Z427VLS*/ 03849000
*    IF DEVPTR ^= ZERO THEN                                        1181 03850000
@RF01170 L     @08,DEVPTR(,R2)                                     1181 03851000
         LTR   @08,@08                                             1181 03852000
         BZ    @RF01181                                            1181 03853000
*      DO;                                                 /*@Z427VLS*/ 03854000
*        MSGNO(1:LENGTH(DEVTAB)) = DEVTAB;                 /*@Z427VLS*/ 03855000
         MVC   MSGNO(14),DEVTAB                                    1183 03856000
*        IF DEVEXCL = ON THEN                                      1184 03857000
         TM    DEVEXCL(R2),B'00100000'                             1184 03858000
         BNO   @RF01184                                            1184 03859000
*          DO INDEX3 = LENGTH(DEVTAB) + 3;                 /*@Z427VLS*/ 03860000
         LA    INDEX3,17                                           1185 03861000
*            CALL WORDPAK1(9,' EXCLUDED');                 /*@Z427VLS*/ 03862000
         LA    @01,@AL01186                                        1186 03863000
         BAL   @14,WORDPAK1                                        1186 03864000
*          END;                                            /*@Z427VLS*/ 03865000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03866000
@RF01184 BAL   @14,OUTLINE                                         1188 03867000
*        CALL WORDPAK1(26,'DEVICE TYPES(OBR,MIH,DDR)-');   /*@Z427VLS*/ 03868000
         LA    @01,@AL01189                                        1189 03869000
         BAL   @14,WORDPAK1                                        1189 03870000
*        DO J = 1 TO DEVNUM BY 1;                          /*@Z427VLS*/ 03871000
         LA    J,1                                                 1190 03872000
         B     @DE01190                                            1190 03873000
@DL01190 DS    0H                                                  1191 03874000
*                 CALL IFCDEVIC(2,DEVVAL(J),KEYWORD);      /*@G51DGVS*/ 03875000
         MVC   @AL00001(12),@AL01191                               1191 03876000
         LR    @08,J                                               1191 03877000
         ALR   @08,@08                                             1191 03878000
         L     @07,DEVPTR(,R2)                                     1191 03879000
         LA    @08,DEVVAL-2(@08,@07)                               1191 03880000
         ST    @08,@AL00001+4                                      1191 03881000
         L     @15,@CV00760                                        1191 03882000
         LA    @01,@AL00001                                        1191 03883000
         BALR  @14,@15                                             1191 03884000
*                KEYWORD(5) = '(';                         /*@Z427VLS*/ 03885000
         MVI   KEYWORD+4,C'('                                      1192 03886000
*                HOLDAREA = HOLDAREA && HOLDAREA;      /* CLEAR      */ 03887000
         XC    HOLDAREA(5),HOLDAREA                                1193 03888000
*                HOLDAREA(2) = DEVVAL(J,1:1);          /* 1ST CHAR   */ 03889000
         LR    @08,J                                               1194 03890000
         ALR   @08,@08                                             1194 03891000
         L     @07,DEVPTR(,R2)                                     1194 03892000
         ST    @08,@TF00001                                        1194 03893000
         ALR   @08,@07                                             1194 03894000
         MVC   HOLDAREA+1(1),DEVVAL-2(@08)                         1194 03895000
*                HOLDAREA(4) = DEVVAL(J,2:2);          /* 2ND CHAR   */ 03896000
         AL    @07,@TF00001                                        1195 03897000
         MVC   HOLDAREA+3(1),DEVVAL-1(@07)                         1195 03898000
*                SLL (HOLDAREA(1:4),FOUR);             /* SPLIT CHARS*/ 03899000
         ICM   @08,15,HOLDAREA                                     1196 03900000
         SLL   @08,4                                               1196 03901000
         STCM  @08,15,HOLDAREA                                     1196 03902000
*                SRL (HOLDAREA(2:2),FOUR);             /* 2ND VALUE  */ 03903000
         SLR   @08,@08                                             1197 03904000
         IC    @08,HOLDAREA+1                                      1197 03905000
         SRL   @08,4                                               1197 03906000
         STC   @08,HOLDAREA+1                                      1197 03907000
*                SRL (HOLDAREA(4:4),FOUR);             /* 4TH VALUE  */ 03908000
         SLR   @08,@08                                             1198 03909000
         IC    @08,HOLDAREA+3                                      1198 03910000
         SRL   @08,4                                               1198 03911000
         STC   @08,HOLDAREA+3                                      1198 03912000
*                DO I = 1 TO 4 BY 1;                       /*@Z427VLS*/ 03913000
         LA    @08,1                                               1199 03914000
         ST    @08,I                                               1199 03915000
@DL01199 DS    0H                                                  1200 03916000
*                  INDEX1 = HOLDAREA(I) + 1;               /*@Z427VLS*/ 03917000
         LA    INDEX1,1                                            1200 03918000
         SLR   @07,@07                                             1200 03919000
         IC    @07,HOLDAREA-1(@08)                                 1200 03920000
         ALR   INDEX1,@07                                          1200 03921000
*                  KEYWORD(5+I) = NUMTAB(INDEX1);          /*@Z427VLS*/ 03922000
         LA    @07,KEYWORD+4(@08)                                  1201 03923000
         LA    @03,NUMTAB-1(INDEX1)                                1201 03924000
         MVC   0(1,@07),0(@03)                                     1201 03925000
*                END;                                      /*@Z427VLS*/ 03926000
         AL    @08,@CF00058                                        1202 03927000
         ST    @08,I                                               1202 03928000
         C     @08,@CF00039                                        1202 03929000
         BNH   @DL01199                                            1202 03930000
*                KEYWORD(10) = RPAREN;                     /*@Z427VLS*/ 03931000
         MVI   KEYWORD+9,C')'                                      1203 03932000
*                CALL WORDPAK2(10,KEYWORD);                /*@Z427VLS*/ 03933000
         LA    @01,@AL01204                                        1204 03934000
         BAL   @14,WORDPAK2                                        1204 03935000
*                   IF DEVVAL(J) = '8003'X THEN                    1205 03936000
         LR    @08,J                                               1205 03937000
         ALR   @08,@08                                             1205 03938000
         L     @07,DEVPTR(,R2)                                     1205 03939000
         ALR   @07,@08                                             1205 03940000
         CLC   DEVVAL-2(2,@07),@CB01111                            1205 03941000
         BNE   @RF01205                                            1205 03942000
*                  SW34XX = ON;                            /*@Z427VLS*/ 03943000
         OI    SW34XX,B'00000100'                                  1206 03944000
*        END;                                              /*@Z427VLS*/ 03945000
@RF01205 AL    J,@CF00058                                          1207 03946000
@DE01190 L     @08,DEVPTR(,R2)                                     1207 03947000
         CH    J,DEVNUM(,@08)                                      1207 03948000
         BNH   @DL01190                                            1207 03949000
*        IF DEVNUM = ZERO THEN                                     1208 03950000
         L     @08,DEVPTR(,R2)                                     1208 03951000
         LH    @08,DEVNUM(,@08)                                    1208 03952000
         LTR   @08,@08                                             1208 03953000
         BNZ   @RF01208                                            1208 03954000
*          CALL WORDPAK2(4,'NONE');                        /*@Z427VLS*/ 03955000
         LA    @01,@AL01209                                        1209 03956000
         BAL   @14,WORDPAK2                                        1209 03957000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 03958000
@RF01208 BAL   @14,OUTLINE                                         1210 03959000
*        CALL WORDPAK1(18,'DEVICE TYPES(MDR)-');           /*@Z427VLS*/ 03960000
         LA    @01,@AL01211                                        1211 03961000
         BAL   @14,WORDPAK1                                        1211 03962000
*        DO J = 1 TO MDRNUM BY 1;                          /*@Z427VLS*/ 03963000
         LA    J,1                                                 1212 03964000
         B     @DE01212                                            1212 03965000
@DL01212 DS    0H                                                  1213 03966000
*                 CALL IFCDEVIC(12,MDRVAL(J),KEYWORD);     /*@G51DGVS*/ 03967000
         MVC   @AL00001(12),@AL01213                               1213 03968000
         L     @08,DEVPTR(,R2)                                     1213 03969000
         LA    @08,MDRVAL-1(J,@08)                                 1213 03970000
         ST    @08,@AL00001+4                                      1213 03971000
         L     @15,@CV00760                                        1213 03972000
         LA    @01,@AL00001                                        1213 03973000
         BALR  @14,@15                                             1213 03974000
*                KEYWORD(5) = '(';                         /*@Z427VLS*/ 03975000
         MVI   KEYWORD+4,C'('                                      1214 03976000
*                HOLDAREA(1) = HEXZERO;               /* CLEAR       */ 03977000
         MVI   HOLDAREA,X'00'                                      1215 03978000
*                HOLDAREA(2) = MDRVAL(J);             /* ONLY CHAR   */ 03979000
         L     @08,DEVPTR(,R2)                                     1216 03980000
         ALR   @08,J                                               1216 03981000
         MVC   HOLDAREA+1(1),MDRVAL-1(@08)                         1216 03982000
*                SLL (HOLDAREA(1:2),FOUR);            /* SPLIT       */ 03983000
         SLR   @08,@08                                             1217 03984000
         ICM   @08,3,HOLDAREA                                      1217 03985000
         SLL   @08,4                                               1217 03986000
         STCM  @08,3,HOLDAREA                                      1217 03987000
*                SRL (HOLDAREA(2:2),FOUR);            /* 2ND CHAR    */ 03988000
         SLR   @08,@08                                             1218 03989000
         IC    @08,HOLDAREA+1                                      1218 03990000
         SRL   @08,4                                               1218 03991000
         STC   @08,HOLDAREA+1                                      1218 03992000
*                INDEX1 = HOLDAREA(1) + 1;                 /*@Z427VLS*/ 03993000
         LA    @08,1                                               1219 03994000
         SLR   INDEX1,INDEX1                                       1219 03995000
         IC    INDEX1,HOLDAREA                                     1219 03996000
         ALR   INDEX1,@08                                          1219 03997000
*                KEYWORD(6) = NUMTAB(INDEX1);              /*@Z427VLS*/ 03998000
         LA    @07,NUMTAB-1(INDEX1)                                1220 03999000
         MVC   KEYWORD+5(1),0(@07)                                 1220 04000000
*                INDEX1 = HOLDAREA(2) + 1;                 /*@Z427VLS*/ 04001000
         SLR   INDEX1,INDEX1                                       1221 04002000
         IC    INDEX1,HOLDAREA+1                                   1221 04003000
         ALR   @08,INDEX1                                          1221 04004000
         LR    INDEX1,@08                                          1221 04005000
*                KEYWORD(7) = NUMTAB(INDEX1);              /*@Z427VLS*/ 04006000
         LA    @08,NUMTAB-1(INDEX1)                                1222 04007000
         MVC   KEYWORD+6(1),0(@08)                                 1222 04008000
*                KEYWORD(8) = RPAREN;                      /*@Z427VLS*/ 04009000
         MVI   KEYWORD+7,C')'                                      1223 04010000
*                CALL WORDPAK2(8,KEYWORD);                 /*@Z427VLS*/ 04011000
         LA    @01,@AL01224                                        1224 04012000
         BAL   @14,WORDPAK2                                        1224 04013000
*                 IF MDRVAL(J) = '03'X THEN    /* 328X DEVICE?       */ 04014000
         L     @08,DEVPTR(,R2)                                     1225 04015000
         ALR   @08,J                                               1225 04016000
         CLI   MDRVAL-1(@08),X'03'                                 1225 04017000
         BNE   @RF01225                                            1225 04018000
*                  SW328X = ON;                            /*@Z427VLS*/ 04019000
         OI    SW328X,B'00000010'                                  1226 04020000
*                 IF MDRVAL(J) = '0B'X THEN    /* 3277 DEVICE?       */ 04021000
@RF01225 L     @08,DEVPTR(,R2)                                     1227 04022000
         ALR   @08,J                                               1227 04023000
         CLI   MDRVAL-1(@08),X'0B'                                 1227 04024000
         BNE   @RF01227                                            1227 04025000
*                  SW3277 = ON;                            /*@Z427VLS*/ 04026000
         OI    SW3277,B'00000001'                                  1228 04027000
*        END;                                              /*@Z427VLS*/ 04028000
@RF01227 AL    J,@CF00058                                          1229 04029000
@DE01212 L     @08,DEVPTR(,R2)                                     1229 04030000
         CH    J,MDRNUM(,@08)                                      1229 04031000
         BNH   @DL01212                                            1229 04032000
*        IF MDRNUM = ZERO THEN                                     1230 04033000
         L     @08,DEVPTR(,R2)                                     1230 04034000
         LH    @08,MDRNUM(,@08)                                    1230 04035000
         LTR   @08,@08                                             1230 04036000
         BNZ   @RF01230                                            1230 04037000
*          CALL WORDPAK2 (4,'NONE');                       /*@Z427VLS*/ 04038000
         LA    @01,@AL01231                                        1231 04039000
         BAL   @14,WORDPAK2                                        1231 04040000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 04041000
@RF01230 BAL   @14,OUTLINE                                         1232 04042000
*        IF SW34XX = ON THEN         /* OUTPUT THE NOTE MESSAGE      */ 04043000
         TM    SW34XX,B'00000100'                                  1233 04044000
         BNO   @RF01233                                            1233 04045000
*          DO INDEX3 = 10;                                 /*@Z427VLS*/ 04046000
         LA    INDEX3,10                                           1234 04047000
*            CALL WORDPAK2 (LENGTH(SW34XXM),SW34XXM);      /*@Z427VLS*/ 04048000
         LA    @01,@AL01235                                        1235 04049000
         BAL   @14,WORDPAK2                                        1235 04050000
*            CALL OUTLINE;                                 /*@Z427VLS*/ 04051000
         BAL   @14,OUTLINE                                         1236 04052000
*          END;                                            /*@Z427VLS*/ 04053000
*        IF SW328X = ON THEN         /* OUTPUT THE NOTE MESSAGE      */ 04054000
@RF01233 TM    SW328X,B'00000010'                                  1238 04055000
         BNO   @RF01238                                            1238 04056000
*          DO INDEX3 = 10;                                 /*@Z427VLS*/ 04057000
         LA    INDEX3,10                                           1239 04058000
*            CALL WORDPAK2 (LENGTH(SW328XM),SW328XM);      /*@Z427VLS*/ 04059000
         LA    @01,@AL01240                                        1240 04060000
         BAL   @14,WORDPAK2                                        1240 04061000
*            CALL OUTLINE;                                 /*@Z427VLS*/ 04062000
         BAL   @14,OUTLINE                                         1241 04063000
*          END;                                            /*@Z427VLS*/ 04064000
*        IF SW3277 = ON THEN         /* OUTPUT THE NOTE MESSAGE      */ 04065000
@RF01238 TM    SW3277,B'00000001'                                  1243 04066000
         BNO   @RF01243                                            1243 04067000
*          DO INDEX3 = 10;                                 /*@Z427VLS*/ 04068000
         LA    INDEX3,10                                           1244 04069000
*            CALL WORDPAK2 (LENGTH(SW3277M),SW3277M);      /*@Z427VLS*/ 04070000
         LA    @01,@AL01245                                        1245 04071000
         BAL   @14,WORDPAK2                                        1245 04072000
*            CALL OUTLINE;                                 /*@Z427VLS*/ 04073000
         BAL   @14,OUTLINE                                         1246 04074000
*          END;                                            /*@Z427VLS*/ 04075000
*      END;                                                /*@Z427VLS*/ 04076000
@RF01243 DS    0H                                                  1249 04077000
*    /*                                                      @Z427VLS*/ 04078000
*    /* DEVICE SERIAL TABLE.                                 @Z427VLS*/ 04079000
*    /*                                                      @Z427VLS*/ 04080000
*    IF SERPTR ^= ZERO THEN                                        1249 04081000
@RF01181 L     @08,SERPTR(,R2)                                     1249 04082000
         LTR   @08,@08                                             1249 04083000
         BZ    @RF01249                                            1249 04084000
*      DO;                                                 /*@Z427VLS*/ 04085000
*        MSGNO(1:LENGTH(SERTAB)) = SERTAB;                 /*@Z427VLS*/ 04086000
         MVC   MSGNO(21),SERTAB                                    1251 04087000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 04088000
         BAL   @14,OUTLINE                                         1252 04089000
*        DO J = 1 TO SERNUM BY 1;                          /*@Z427VLS*/ 04090000
         LA    J,1                                                 1253 04091000
         B     @DE01253                                            1253 04092000
@DL01253 DS    0H                                                  1254 04093000
*          INDEX1 = SERVAL(J);                             /*@Z427VLS*/ 04094000
         LR    @08,J                                               1254 04095000
         ALR   @08,@08                                             1254 04096000
         L     @07,SERPTR(,R2)                                     1254 04097000
         ALR   @07,@08                                             1254 04098000
         SLR   INDEX1,INDEX1                                       1254 04099000
         ICM   INDEX1,3,SERVAL-2(@07)                              1254 04100000
*          CVD(INDEX1,HOLDAREA(1:4));                      /*@Z427VLS*/ 04101000
         CVD   INDEX1,@TS00001                                     1255 04102000
         MVC   HOLDAREA(4),@TS00001+4                              1255 04103000
*          HOLDAREA(4) = HOLDAREA(4) | SIGNFLAG;           /*@Z427VLS*/ 04104000
         OI    HOLDAREA+3,X'0F'                                    1256 04105000
*          UNPK (KEYWORD(1:6),HOLDAREA(1:4));              /*@Z427VLS*/ 04106000
         UNPK  KEYWORD(6),HOLDAREA(4)                              1257 04107000
*          CALL WORDPAK2(6,KEYWORD(1:6));                  /*@Z427VLS*/ 04108000
         LA    @01,@AL01258                                        1258 04109000
         BAL   @14,WORDPAK2                                        1258 04110000
*        END;                                              /*@Z427VLS*/ 04111000
         AL    J,@CF00058                                          1259 04112000
@DE01253 L     @08,SERPTR(,R2)                                     1259 04113000
         CH    J,SERNUM(,@08)                                      1259 04114000
         BNH   @DL01253                                            1259 04115000
*        CALL OUTLINE;                                     /*@Z427VLS*/ 04116000
         BAL   @14,OUTLINE                                         1260 04117000
*      END;                                                /*@Z427VLS*/ 04118000
*    /*                                                      @Z427VLS*/ 04119000
*    /* SHARED I/O DEVICES TABLE.                            @Z427VLS*/ 04120000
*    /*                                                      @Z427VLS*/ 04121000
*    IF SHAREPTR ^= ZERO THEN                                      1262 04122000
@RF01249 L     @08,SHAREPTR(,R2)                                   1262 04123000
         LTR   @08,@08                                             1262 04124000
         BZ    @RF01262                                            1262 04125000
*      DO;                                                 /*@Z427VLS*/ 04126000
*        MSGNO(1:LENGTH(SHARETAB)) = SHARETAB;             /*@Z427VLS*/ 04127000
         MVC   MSGNO(13),SHARETAB                                  1264 04128000
*        CALL OUTLINE ;                                    /*@Z427VLS*/ 04129000
         BAL   @14,OUTLINE                                         1265 04130000
*        DO J = 1 TO SHARENUM BY 1;                        /*@Z427VLS*/ 04131000
         LA    J,1                                                 1266 04132000
         B     @DE01266                                            1266 04133000
@DL01266 DS    0H                                                  1267 04134000
*          CALL WORDCON1(2,SHARECUA(J));  /* CUA             @Z427VLS*/ 04135000
         LA    @08,@CF00076                                        1267 04136000
         ST    @08,@AL00001                                        1267 04137000
         LR    @08,J                                               1267 04138000
         MH    @08,@CH00036                                        1267 04139000
         L     @07,SHAREPTR(,R2)                                   1267 04140000
         AL    @07,@CF01204                                        1267 04141000
         LA    @08,SHARECUA-2(@08,@07)                             1267 04142000
         ST    @08,@AL00001+4                                      1267 04143000
         LA    @01,@AL00001                                        1267 04144000
         BAL   @14,WORDCON1                                        1267 04145000
*          IF SHAREDX(J) = ON THEN                                 1268 04146000
         LR    @08,J                                               1268 04147000
         MH    @08,@CH00036                                        1268 04148000
         L     @07,SHAREPTR(,R2)                                   1268 04149000
         ALR   @07,@08                                             1268 04150000
         AL    @07,@CF01204                                        1268 04151000
         TM    SHAREDX-2(@07),B'10000000'                          1268 04152000
         BNO   @RF01268                                            1268 04153000
*            DO;                                           /*@Z427VLS*/ 04154000
*              PARMPT(INDEX3-1) = 'X';  /* CUX WAS SPECIFIED, NOT CUA*/ 04155000
         LA    @08,PARMPT-2(INDEX3)                                1270 04156000
         MVI   0(@08),C'X'                                         1270 04157000
*              PARMPT(INDEX3-4) = '0';                     /*@Z427VLS*/ 04158000
         LA    @08,PARMPT-5(INDEX3)                                1271 04159000
         MVI   0(@08),C'0'                                         1271 04160000
*            END;                                          /*@Z427VLS*/ 04161000
*          CALL WORDPAK1(1,'/');                           /*@Z427VLS*/ 04162000
@RF01268 LA    @01,@AL01273                                        1273 04163000
         BAL   @14,WORDPAK1                                        1273 04164000
*          CALL WORDCON1(3,SHARSERA(J));  /* SERIAL NUMBER   @Z427VLS*/ 04165000
         LA    @08,@CF00078                                        1274 04166000
         ST    @08,@AL00001                                        1274 04167000
         LR    @08,J                                               1274 04168000
         MH    @08,@CH00036                                        1274 04169000
         L     @07,SHAREPTR(,R2)                                   1274 04170000
         AL    @07,@CF01205                                        1274 04171000
         LA    @08,SHARSERA-4(@08,@07)                             1274 04172000
         ST    @08,@AL00001+4                                      1274 04173000
         LA    @01,@AL00001                                        1274 04174000
         BAL   @14,WORDCON1                                        1274 04175000
*          CALL WORDPAK1(1,'/');                           /*@Z427VLS*/ 04176000
         LA    @01,@AL01275                                        1275 04177000
         BAL   @14,WORDPAK1                                        1275 04178000
*          CALL WORDPAK1(1,SHARLET(J));   /* LETTER ASSIGNMENT       */ 04179000
         LA    @08,@CF00058                                        1276 04180000
         ST    @08,@AL00001                                        1276 04181000
         LR    @08,J                                               1276 04182000
         MH    @08,@CH00036                                        1276 04183000
         L     @07,SHAREPTR(,R2)                                   1276 04184000
         LA    @08,SHARLET-11(@08,@07)                             1276 04185000
         ST    @08,@AL00001+4                                      1276 04186000
         LA    @01,@AL00001                                        1276 04187000
         BAL   @14,WORDPAK1                                        1276 04188000
*          INDEX3 = INDEX3 + 2;                            /*@Z427VLS*/ 04189000
         AL    INDEX3,@CF00076                                     1277 04190000
*          IF SHARSERA(J+1) = SHARSERB(J+1) THEN                   1278 04191000
         LR    @08,J                                               1278 04192000
         MH    @08,@CH00036                                        1278 04193000
         L     @07,SHAREPTR(,R2)                                   1278 04194000
         ST    @08,@TF00001                                        1278 04195000
         ALR   @08,@07                                             1278 04196000
         AL    @07,@TF00001                                        1278 04197000
         CLC   SHARSERA(3,@08),SHARSERB(@07)                       1278 04198000
         BNE   @RF01278                                            1278 04199000
*            CALL OUTLINE;                                 /*@Z427VLS*/ 04200000
         BAL   @14,OUTLINE                                         1279 04201000
*        END;                                              /*@Z427VLS*/ 04202000
@RF01278 AL    J,@CF00058                                          1280 04203000
@DE01266 L     @08,SHAREPTR(,R2)                                   1280 04204000
         CH    J,SHARENUM(,@08)                                    1280 04205000
         BNH   @DL01266                                            1280 04206000
*      END;                                                /*@Z427VLS*/ 04207000
*    IF DEBUG3 = ON THEN                /* HEX DUMP OF THE PARM TABLE*/ 04208000
@RF01262 TM    DEBUG3(R2),B'00010000'                              1282 04209000
         BNO   @RF01282                                            1282 04210000
*      DO;                                                 /*@Z427VLS*/ 04211000
*       PRINTADR = ADDR(PARMPT);        /* BLANK LINE        @Z427VLS*/ 04212000
         LA    @08,PARMPT                                          1284 04213000
         ST    @08,PRINTADR(,R2)                                   1284 04214000
*       CALL IOHND (RITEPRTR);                             /*@Z427VLS*/ 04215000
         L     @15,ADIOHND(,R2)                                    1285 04216000
         LA    @01,@AL01285                                        1285 04217000
         BALR  @14,@15                                             1285 04218000
*       PARMPT(3:47) = HEXHEAD;                            /*@0099VLS*/ 04219000
         MVC   PARMPT+2(45),HEXHEAD                                1286 04220000
*       PRINTADR = ADDR(PARMPT);                           /*@Z427VLS*/ 04221000
         LA    @08,PARMPT                                          1287 04222000
         ST    @08,PRINTADR(,R2)                                   1287 04223000
*       CALL IOHND (RITEPRTR);                             /*@Z427VLS*/ 04224000
         L     @15,ADIOHND(,R2)                                    1288 04225000
         LA    @01,@AL01288                                        1288 04226000
         BALR  @14,@15                                             1288 04227000
*       PRINTADR = ADDR(PARMPT);        /* BLANK LINE        @Z427VLS*/ 04228000
         LA    @08,PARMPT                                          1289 04229000
         ST    @08,PRINTADR(,R2)                                   1289 04230000
*       CALL IOHND (RITEPRTR);                             /*@Z427VLS*/ 04231000
         L     @15,ADIOHND(,R2)                                    1290 04232000
         LA    @01,@AL01290                                        1290 04233000
         BALR  @14,@15                                             1290 04234000
*       INDEX1 = ADDR(SHAREPTR) + FOUR - ADDR(PARM);       /*@Z427VLS*/ 04235000
         LA    INDEX1,SHAREPTR(,R2)                                1291 04236000
         AL    INDEX1,@CF00039                                     1291 04237000
         SLR   INDEX1,R2                                           1291 04238000
*       DO I = 66 TO INDEX1 BY 66;                         /*@Z427VLS*/ 04239000
         LA    @08,66                                              1292 04240000
         ST    @08,I                                               1292 04241000
         B     @DE01292                                            1292 04242000
@DL01292 DS    0H                                                  1293 04243000
*         PARMFLD(1:66) = PARM(I-65:I);  /* DATA TO BE CONVERTED     */ 04244000
         ALR   @08,R2                                              1293 04245000
         AL    @08,@CF01211                                        1293 04246000
         MVC   PARMFLD(66),PARM(@08)                               1293 04247000
*         CALL UNPACK(66);              /* CONVERT IT        @Z427VLS*/ 04248000
         LA    @01,@AL01294                                        1294 04249000
         BAL   @14,UNPACK                                          1294 04250000
*       END;                                               /*@Z427VLS*/ 04251000
         LA    @08,66                                              1295 04252000
         AL    @08,I                                               1295 04253000
         ST    @08,I                                               1295 04254000
@DE01292 CR    @08,INDEX1                                          1295 04255000
         BNH   @DL01292                                            1295 04256000
*       I = 66 - I + INDEX1;            /* RESIDUAL          @Z427VLS*/ 04257000
         LA    @08,66                                              1296 04258000
         SL    @08,I                                               1296 04259000
         ALR   @08,INDEX1                                          1296 04260000
         ST    @08,I                                               1296 04261000
*       IF I > ZERO THEN                                           1297 04262000
         LTR   @08,@08                                             1297 04263000
         BNP   @RF01297                                            1297 04264000
*         DO;                                              /*@Z427VLS*/ 04265000
*           PARMFLD(1:I) = PARM(INDEX1-I:INDEX1);          /*@Z427VLS*/ 04266000
         LR    @04,@08                                             1299 04267000
         BCTR  @04,0                                               1299 04268000
         LCR   @08,@08                                             1299 04269000
         ALR   @08,INDEX1                                          1299 04270000
         ALR   @08,R2                                              1299 04271000
         BCTR  @08,0                                               1299 04272000
         EX    @04,@SM01212                                        1299 04273000
*           CALL UNPACK (I);                               /*@Z427VLS*/ 04274000
         LA    @01,@AL01300                                        1300 04275000
         BAL   @14,UNPACK                                          1300 04276000
*         END;                                             /*@Z427VLS*/ 04277000
*       IF CUAPTR ^= ZERO THEN          /* CUA TABLE ?       @Z427VLS*/ 04278000
@RF01297 L     @08,CUAPTR(,R2)                                     1302 04279000
         LTR   @08,@08                                             1302 04280000
         BZ    @RF01302                                            1302 04281000
*         DO;                                              /*@Z427VLS*/ 04282000
*           PARMFLD(1:LENGTH(CUA)) = CUA;  /* TABLE          @Z427VLS*/ 04283000
         MVC   PARMFLD(34),CUA(@08)                                1304 04284000
*           CALL TABLEOUT(CUATAB,LENGTH(CUATAB),LENGTH(CUA));      1305 04285000
         LA    @01,@AL01305                                        1305 04286000
         BAL   @14,TABLEOUT                                        1305 04287000
*         END;                                             /*@Z427VLS*/ 04288000
*       IF DEVPTR ^= ZERO THEN          /* DEVICE TABLE?     @Z427VLS*/ 04289000
@RF01302 L     @08,DEVPTR(,R2)                                     1307 04290000
         LTR   @08,@08                                             1307 04291000
         BZ    @RF01307                                            1307 04292000
*         DO;                                              /*@Z427VLS*/ 04293000
*           PARMFLD(1:LENGTH(DEVICE)) = DEVICE;  /* TABLE    @Z427VLS*/ 04294000
         MVC   PARMFLD(254),DEVICE(@08)                            1309 04295000
*          PRINTADR = ADDR(PARMPT);                        /*@G51DGVS*/ 04296000
         LA    @08,PARMPT                                          1310 04297000
         ST    @08,PRINTADR(,R2)                                   1310 04298000
*          CALL IOHND(RITEPRTR);                           /*@G51DGVS*/ 04299000
         L     @15,ADIOHND(,R2)                                    1311 04300000
         LA    @01,@AL01311                                        1311 04301000
         BALR  @14,@15                                             1311 04302000
*          MSGNO(1:LENGTH(DEVTAB)) = DEVTAB;     /* HEADING  @G51DGVS*/ 04303000
         MVC   MSGNO(14),DEVTAB                                    1312 04304000
*          PRINTADR = ADDR(PARMPT);                        /*@G51DGVS*/ 04305000
         LA    @08,PARMPT                                          1313 04306000
         ST    @08,PRINTADR(,R2)                                   1313 04307000
*          CALL IOHND(RITEPRTR);                           /*@G51DGVS*/ 04308000
         L     @15,ADIOHND(,R2)                                    1314 04309000
         LA    @01,@AL01314                                        1314 04310000
         BALR  @14,@15                                             1314 04311000
*          CALL UNPACK(66);                      /* UNPACK 1ST 66    */ 04312000
         LA    @01,@AL01315                                        1315 04313000
         BAL   @14,UNPACK                                          1315 04314000
*          PARMFLD(1:66) = PARMFLD(67:132);      /* MOVE NEXT 66     */ 04315000
         MVC   PARMFLD(66),PARMFLD+66                              1316 04316000
*          CALL UNPACK(66);                      /* UNPACK NEXT 66   */ 04317000
         LA    @01,@AL01317                                        1317 04318000
         BAL   @14,UNPACK                                          1317 04319000
*          PARMFLD(1:66) = PARMFLD(133:198);     /* MOVE NEXT 66     */ 04320000
         MVC   PARMFLD(66),PARMFLD+132                             1318 04321000
*          CALL UNPACK(66);                      /* UNPACK NEXT 66   */ 04322000
         LA    @01,@AL01319                                        1319 04323000
         BAL   @14,UNPACK                                          1319 04324000
*          PARMFLD(1:58) = PARMFLD(199:256);     /* MOVE LAST 58     */ 04325000
         MVC   PARMFLD(58),PARMFLD+198                             1320 04326000
*          CALL UNPACK(58);                      /* UNPACK LAST 58   */ 04327000
         LA    @01,@AL01321                                        1321 04328000
         BAL   @14,UNPACK                                          1321 04329000
*          CALL IOHND(RITEPRTR);                           /*@0099VLS*/ 04330000
         L     @15,ADIOHND(,R2)                                    1322 04331000
         LA    @01,@AL01322                                        1322 04332000
         BALR  @14,@15                                             1322 04333000
*          MSGNO(1:LENGTH(DEVTAB)) = DEVTAB;     /* HEADING  @0099VLS*/ 04334000
         MVC   MSGNO(14),DEVTAB                                    1323 04335000
*          PRINTADR = ADDR(PARMPT);                        /*@0099VLS*/ 04336000
         LA    @08,PARMPT                                          1324 04337000
         ST    @08,PRINTADR(,R2)                                   1324 04338000
*          CALL IOHND(RITEPRTR);                           /*@0099VLS*/ 04339000
         L     @15,ADIOHND(,R2)                                    1325 04340000
         LA    @01,@AL01325                                        1325 04341000
         BALR  @14,@15                                             1325 04342000
*          CALL UNPACK(66);                      /* UNPACK 1ST 66    */ 04343000
         LA    @01,@AL01326                                        1326 04344000
         BAL   @14,UNPACK                                          1326 04345000
*          PARMFLD(1:66) = PARMFLD(67:132);      /* MOVE NEXT 66     */ 04346000
         MVC   PARMFLD(66),PARMFLD+66                              1327 04347000
*          CALL UNPACK(66);                      /* UNPACK NEXT 66   */ 04348000
         LA    @01,@AL01328                                        1328 04349000
         BAL   @14,UNPACK                                          1328 04350000
*          PARMFLD(1:66) = PARMFLD(133:198);     /* MOVE NEXT 66     */ 04351000
         MVC   PARMFLD(66),PARMFLD+132                             1329 04352000
*          CALL UNPACK(66);                      /* UNPACK NEXT 66   */ 04353000
         LA    @01,@AL01330                                        1330 04354000
         BAL   @14,UNPACK                                          1330 04355000
*          PARMFLD(1:58) = PARMFLD(199:256);     /* MOVE LAST 58     */ 04356000
         MVC   PARMFLD(58),PARMFLD+198                             1331 04357000
*          CALL UNPACK(58);                      /* UNPACK LAST 58   */ 04358000
         LA    @01,@AL01332                                        1332 04359000
         BAL   @14,UNPACK                                          1332 04360000
*         END;                                             /*@Z427VLS*/ 04361000
*       IF MODPTR ^= ZERO THEN          /* MODEL TABLE?      @Z427VLS*/ 04362000
@RF01307 L     @08,MODPTR(,R2)                                     1334 04363000
         LTR   @08,@08                                             1334 04364000
         BZ    @RF01334                                            1334 04365000
*         DO;                                              /*@Z427VLS*/ 04366000
*           PARMFLD(1:LENGTH(MODELS)) = MODELS;  /* TABLE    @Z427VLS*/ 04367000
         MVC   PARMFLD(10),MODELS(@08)                             1336 04368000
*           CALL TABLEOUT(MODTAB,LENGTH(MODTAB),LENGTH(MODELS));   1337 04369000
         LA    @01,@AL01337                                        1337 04370000
         BAL   @14,TABLEOUT                                        1337 04371000
*         END;                                             /*@Z427VLS*/ 04372000
*       IF SERPTR ^= ZERO THEN          /* DEVICE SERIAL TABLE?      */ 04373000
@RF01334 L     @08,SERPTR(,R2)                                     1339 04374000
         LTR   @08,@08                                             1339 04375000
         BZ    @RF01339                                            1339 04376000
*         DO;                                              /*@Z427VLS*/ 04377000
*           PARMFLD(1:LENGTH(DEVSERAL)) = DEVSERAL;  /* TABLE        */ 04378000
         MVC   PARMFLD(18),DEVSERAL(@08)                           1341 04379000
*           CALL TABLEOUT(SERTAB,LENGTH(SERTAB),LENGTH(DEVSERAL)); 1342 04380000
         LA    @01,@AL01342                                        1342 04381000
         BAL   @14,TABLEOUT                                        1342 04382000
*         END;                                             /*@Z427VLS*/ 04383000
*       IF VOLPTR ^= ZERO THEN          /* VOLUME TABLE?     @Z427VLS*/ 04384000
@RF01339 L     @08,VOLPTR(,R2)                                     1344 04385000
         LTR   @08,@08                                             1344 04386000
         BZ    @RF01344                                            1344 04387000
*         DO;                                              /*@Z427VLS*/ 04388000
*           PARMFLD(1:LENGTH(VOLUME)) = VOLUME; /* TABLE     @Z427VLS*/ 04389000
         MVC   PARMFLD(26),VOLUME(@08)                             1346 04390000
*           CALL TABLEOUT(VOLTAB,LENGTH(VOLTAB),LENGTH(VOLUME));   1347 04391000
         LA    @01,@AL01347                                        1347 04392000
         BAL   @14,TABLEOUT                                        1347 04393000
*         END;                                             /*@Z427VLS*/ 04394000
*       IF CPUPTR ^= ZERO THEN          /* CPU TABLE ?       @Z427VLS*/ 04395000
@RF01344 L     @08,CPUPTR(,R2)                                     1349 04396000
         LTR   @08,@08                                             1349 04397000
         BZ    @RF01349                                            1349 04398000
*         DO;                                              /*@Z427VLS*/ 04399000
*           PARMFLD(1:LENGTH(CPUS)) = CPUS;  /* TABLE        @Z427VLS*/ 04400000
         MVC   PARMFLD(42),CPUS(@08)                               1351 04401000
*           CALL TABLEOUT(CPUTAB,LENGTH(CPUTAB),LENGTH(CPUS));     1352 04402000
         LA    @01,@AL01352                                        1352 04403000
         BAL   @14,TABLEOUT                                        1352 04404000
*         END;                                             /*@Z427VLS*/ 04405000
*       IF CPCUAPTR ^= ZERO THEN        /* CPU/CUA TABLE?    @Z427VLS*/ 04406000
@RF01349 L     @08,CPCUAPTR(,R2)                                   1354 04407000
         LTR   @08,@08                                             1354 04408000
         BZ    @RF01354                                            1354 04409000
*         DO;                                              /*@Z427VLS*/ 04410000
*           PARMFLD(1:LENGTH(CPUCUAS)) = CPUCUAS;  /* TABLE  @Z427VLS*/ 04411000
         MVC   PARMFLD(30),CPUCUAS(@08)                            1356 04412000
*           CALL TABLEOUT(CPCUATAB,LENGTH(CPCUATAB),LENGTH(CPUCUAS));   04413000
         LA    @01,@AL01357                                        1357 04414000
         BAL   @14,TABLEOUT                                        1357 04415000
*         END;                                             /*@Z427VLS*/ 04416000
*       IF LIBADPTR ^= ZERO THEN        /* LIB ADDR TABLE?   @Z427VLS*/ 04417000
@RF01354 L     @08,LIBADPTR(,R2)                                   1359 04418000
         LTR   @08,@08                                             1359 04419000
         BZ    @RF01359                                            1359 04420000
*         DO;                                              /*@Z427VLS*/ 04421000
*           PARMFLD(1:LENGTH(LIBADR)) = LIBADR;  /* TABLE    @Z427VLS*/ 04422000
         MVC   PARMFLD(10),LIBADR(@08)                             1361 04423000
*           CALL TABLEOUT(LIBADTAB,LENGTH(LIBADTAB),LENGTH(LIBADR));    04424000
         LA    @01,@AL01362                                        1362 04425000
         BAL   @14,TABLEOUT                                        1362 04426000
*         END;                                             /*@Z427VLS*/ 04427000
*       IF SYMCDPTR ^= ZERO THEN        /* SYMCODE TABLE?    @Z427VLS*/ 04428000
@RF01359 L     @08,SYMCDPTR(,R2)                                   1364 04429000
         LTR   @08,@08                                             1364 04430000
         BZ    @RF01364                                            1364 04431000
*         DO;                                              /*@Z427VLS*/ 04432000
*           PARMFLD(1:LENGTH(SYMCODE)) = SYMCODE;   /* TABLE @Z427VLS*/ 04433000
         MVC   PARMFLD(18),SYMCODE(@08)                            1366 04434000
*           CALL TABLEOUT(SYMCDTAB,LENGTH(SYMCDTAB),LENGTH(SYMCODE));   04435000
         LA    @01,@AL01367                                        1367 04436000
         BAL   @14,TABLEOUT                                        1367 04437000
*         END;                                             /*@Z427VLS*/ 04438000
*       IF SHAREPTR ^= ZERO THEN        /* SHARE TABLE?      @Z427VLS*/ 04439000
@RF01364 L     @08,SHAREPTR(,R2)                                   1369 04440000
         LTR   @08,@08                                             1369 04441000
         BZ    @RF01369                                            1369 04442000
*         DO;                                              /*@Z427VLS*/ 04443000
*           MSGNO(1:LENGTH(SHARETAB)) = SHARETAB;          /*@Z427VLS*/ 04444000
         MVC   MSGNO(13),SHARETAB                                  1371 04445000
*           PRINTADR = ADDR(PARMPT);                       /*@Z427VLS*/ 04446000
         LA    @08,PARMPT                                          1372 04447000
         ST    @08,PRINTADR(,R2)                                   1372 04448000
*           CALL IOHND(RITEPRTR);                          /*@Z427VLS*/ 04449000
         L     @15,ADIOHND(,R2)                                    1373 04450000
         LA    @01,@AL01373                                        1373 04451000
         BALR  @14,@15                                             1373 04452000
*           INDEX1 = SHARENUM * 11 + 2;                    /*@Z427VLS*/ 04453000
         L     @08,SHAREPTR(,R2)                                   1374 04454000
         LH    INDEX1,SHARENUM(,@08)                               1374 04455000
         MH    INDEX1,@CH00036                                     1374 04456000
         AL    INDEX1,@CF00076                                     1374 04457000
*           DO I = 66 TO INDEX1 BY 66;                     /*@Z427VLS*/ 04458000
         LA    @08,66                                              1375 04459000
         ST    @08,I                                               1375 04460000
         B     @DE01375                                            1375 04461000
@DL01375 DS    0H                                                  1376 04462000
*             PARMFLD(1:66) = SHARE(I-65:I);               /*@Z427VLS*/ 04463000
         L     @04,SHAREPTR(,R2)                                   1376 04464000
         ALR   @04,@08                                             1376 04465000
         AL    @04,@CF01211                                        1376 04466000
         MVC   PARMFLD(66),SHARE(@04)                              1376 04467000
*             CALL UNPACK(66);                             /*@Z427VLS*/ 04468000
         LA    @01,@AL01377                                        1377 04469000
         BAL   @14,UNPACK                                          1377 04470000
*           END;                                           /*@Z427VLS*/ 04471000
         LA    @08,66                                              1378 04472000
         AL    @08,I                                               1378 04473000
         ST    @08,I                                               1378 04474000
@DE01375 CR    @08,INDEX1                                          1378 04475000
         BNH   @DL01375                                            1378 04476000
*           I = 66 - I + INDEX1;                           /*@Z427VLS*/ 04477000
         LA    @08,66                                              1379 04478000
         SL    @08,I                                               1379 04479000
         ALR   @08,INDEX1                                          1379 04480000
         ST    @08,I                                               1379 04481000
*           IF I > ZERO THEN                                       1380 04482000
         LTR   @08,@08                                             1380 04483000
         BNP   @RF01380                                            1380 04484000
*             DO;                                          /*@Z427VLS*/ 04485000
*               PARMFLD(1:I) = SHARE(INDEX1-I+1:INDEX1);   /*@Z427VLS*/ 04486000
         LR    @04,@08                                             1382 04487000
         BCTR  @04,0                                               1382 04488000
         LCR   @08,@08                                             1382 04489000
         ALR   @08,INDEX1                                          1382 04490000
         L     @03,SHAREPTR(,R2)                                   1382 04491000
         ALR   @03,@08                                             1382 04492000
         EX    @04,@SM01214                                        1382 04493000
*               CALL UNPACK(I);                            /*@Z427VLS*/ 04494000
         LA    @01,@AL01383                                        1383 04495000
         BAL   @14,UNPACK                                          1383 04496000
*             END;                                         /*@Z427VLS*/ 04497000
*         END;                                             /*@Z427VLS*/ 04498000
@RF01380 DS    0H                                                  1386 04499000
*      END;                                                /*@Z427VLS*/ 04500000
@RF01369 DS    0H                                                  1387 04501000
*    RESPECIFY (R15) RESTRICTED;                           /*@Z427VLS*/ 04502000
@RF01282 DS    0H                                                  1388 04503000
*    IF DEBUG13 = ON THEN                                          1388 04504000
         TM    DEBUG13(R2),B'00000100'                             1388 04505000
         BNO   @RF01388                                            1388 04506000
*      DO;                                                 /*@Z427VLS*/ 04507000
*        ZEROALL = OFF;                                    /*@Z427VLS*/ 04508000
         NI    ZEROALL(R2),B'10111111'                             1390 04509000
*        PRINTADR = ADDR(BUG13LNE);                        /*@Z427VLS*/ 04510000
         LA    @14,BUG13LNE                                        1391 04511000
         ST    @14,PRINTADR(,R2)                                   1391 04512000
*        CALL IOHND(RITEPRTR);                             /*@Z427VLS*/ 04513000
         L     @15,ADIOHND(,R2)                                    1392 04514000
         LA    @01,@AL01392                                        1392 04515000
         BALR  @14,@15                                             1392 04516000
*      END;                                                /*@Z427VLS*/ 04517000
*    R15 = RETCODE;                     /* SET RETURN CODE   @Z427VLS*/ 04518000
@RF01388 L     R15,RETCODE                                         1394 04519000
*    RETURN;                            /* EXIT TO CALLER    @Z427VLS*/ 04520000
@EL00001 L     @13,4(,@13)                                         1395 04521000
@EF00001 DS    0H                                                  1395 04522000
@ER00001 L     @14,12(,@13)                                        1395 04523000
         LM    @00,@12,20(@13)                                     1395 04524000
         BR    @14                                                 1395 04525000
*    RESPECIFY (R15) UNRESTRICTED;                         /*@Z427VLS*/ 04526000
*END   IFCPARM2                                            /*@Z427VLS*/ 04527000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 04528000
*/*%INCLUDE SYSLIB  (COMTABLE)                                        * 04529000
*;                                                                 1397 04530000
@DATA    DS    0H                                                       04531000
@CH00989 DC    H'1000'                                                  04532000
@SM01182 MVC   PARMPRT(0),CONPARM(@04)                                  04533000
@SM01184 MVC   MSGNO(0),TABNAME(@04)                                    04534000
@SM01189 MVC   0(0,@08),WORDSTR(@15)                                    04535000
@SM01192 MVC   0(0,@08),WORDSTR1(@15)                                   04536000
@SM01212 MVC   PARMFLD(0),PARM(@08)                                     04537000
@SM01214 MVC   PARMFLD(0),SHARE(@03)                                    04538000
         DS    0F                                                       04539000
@AL00111 DC    A(@CF00728)             LIST WITH   2 ARGUMENT(S)        04540000
         DC    A(@AFTEMPS)                                              04541000
@AL00114 EQU   *                       LIST WITH   1 ARGUMENT(S)        04542000
@AL00125 EQU   *                       LIST WITH   1 ARGUMENT(S)        04543000
@AL00136 EQU   *                       LIST WITH   1 ARGUMENT(S)        04544000
@AL00139 EQU   *                       LIST WITH   1 ARGUMENT(S)        04545000
@AL00142 EQU   *                       LIST WITH   1 ARGUMENT(S)        04546000
@AL00157 EQU   *                       LIST WITH   1 ARGUMENT(S)        04547000
@AL00241 EQU   *                       LIST WITH   1 ARGUMENT(S)        04548000
@AL00830 EQU   *                       LIST WITH   1 ARGUMENT(S)        04549000
@AL00915 EQU   *                       LIST WITH   1 ARGUMENT(S)        04550000
@AL00924 EQU   *                       LIST WITH   1 ARGUMENT(S)        04551000
@AL00949 EQU   *                       LIST WITH   1 ARGUMENT(S)        04552000
@AL00966 EQU   *                       LIST WITH   1 ARGUMENT(S)        04553000
@AL01285 EQU   *                       LIST WITH   1 ARGUMENT(S)        04554000
@AL01288 EQU   *                       LIST WITH   1 ARGUMENT(S)        04555000
@AL01290 EQU   *                       LIST WITH   1 ARGUMENT(S)        04556000
@AL01311 EQU   *                       LIST WITH   1 ARGUMENT(S)        04557000
@AL01314 EQU   *                       LIST WITH   1 ARGUMENT(S)        04558000
@AL01322 EQU   *                       LIST WITH   1 ARGUMENT(S)        04559000
@AL01325 EQU   *                       LIST WITH   1 ARGUMENT(S)        04560000
@AL01373 EQU   *                       LIST WITH   1 ARGUMENT(S)        04561000
@AL01392 DC    A(@CF00076+2)           LIST WITH   1 ARGUMENT(S)        04562000
@AL00122 DC    A(@CF00736)             LIST WITH   2 ARGUMENT(S)        04563000
         DC    A(@AFTEMPS+4)                                            04564000
@AL00165 DC    A(@CF00081)             LIST WITH   3 ARGUMENT(S)        04565000
         DC    A(@CF00058)                                              04566000
         DC    A(HOLDAREA)                                              04567000
@AL00176 DC    A(@CF00033)             LIST WITH   3 ARGUMENT(S)        04568000
         DC    A(@CF00083)                                              04569000
         DC    A(HOLDAREA)                                              04570000
@AL00189 DC    A(@CF00058)             LIST WITH   3 ARGUMENT(S)        04571000
         DC    A(@CF00039)                                              04572000
         DC    A(HOLDAREA)                                              04573000
@AL00200 EQU   *                       LIST WITH   3 ARGUMENT(S)        04574000
@AL00397 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04575000
         DC    A(@CC00824)                                              04576000
         DC    A(HOLDAREA)                                              04577000
@AL00293 EQU   *                       LIST WITH   2 ARGUMENT(S)        04578000
@AL00309 DC    A(INDEX2)               LIST WITH   2 ARGUMENT(S)        04579000
         DC    A(KEYWORD)                                               04580000
@AL00391 DC    A(@CF00819)             LIST WITH   2 ARGUMENT(S)        04581000
         DC    A(@CC00820)                                              04582000
@AL00395 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04583000
         DC    A(@CC00822)                                              04584000
@AL00399 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04585000
         DC    A(@CC00826)                                              04586000
@AL00401 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04587000
         DC    A(@CC00828)                                              04588000
@AL00403 DC    A(@CF00034)             LIST WITH   2 ARGUMENT(S)        04589000
         DC    A(@CC00830)                                              04590000
@AL00405 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04591000
         DC    A(@CC00832)                                              04592000
@AL00407 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04593000
         DC    A(@CC00834)                                              04594000
@AL00409 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04595000
         DC    A(@CC00836)                                              04596000
@AL00411 DC    A(@CF00034)             LIST WITH   2 ARGUMENT(S)        04597000
         DC    A(@CC00838)                                              04598000
@AL00413 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04599000
         DC    A(@CC00840)                                              04600000
@AL00415 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04601000
         DC    A(@CC00842)                                              04602000
@AL00417 DC    A(@CF00034)             LIST WITH   2 ARGUMENT(S)        04603000
         DC    A(@CC00844)                                              04604000
@AL00419 DC    A(@CF00034)             LIST WITH   2 ARGUMENT(S)        04605000
         DC    A(@CC00846)                                              04606000
@AL00421 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04607000
         DC    A(@CC00848)                                              04608000
@AL00423 DC    A(@CF00819)             LIST WITH   2 ARGUMENT(S)        04609000
         DC    A(@CC00850)                                              04610000
@AL00425 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04611000
         DC    A(@CC00852)                                              04612000
@AL00427 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04613000
         DC    A(@CC00854)                                              04614000
@AL00429 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04615000
         DC    A(@CC00856)                                              04616000
@AL00434 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04617000
         DC    A(@CC00858)                                              04618000
@AL00436 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04619000
         DC    A(@CC00860)                                              04620000
@AL00438 DC    A(@CF00615)             LIST WITH   2 ARGUMENT(S)        04621000
         DC    A(@CC00862)                                              04622000
@AL00440 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04623000
         DC    A(@CC00864)                                              04624000
@AL00442 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04625000
         DC    A(@CC00866)                                              04626000
@AL00444 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04627000
         DC    A(@CC00868)                                              04628000
@AL00446 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04629000
         DC    A(@CC00870)                                              04630000
@AL00448 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04631000
         DC    A(@CC00872)                                              04632000
@AL00450 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04633000
         DC    A(@CC00874)                                              04634000
@AL00452 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04635000
         DC    A(@CC00876)                                              04636000
@AL00454 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04637000
         DC    A(@CC00878)                                              04638000
@AL00456 DC    A(@CF00604)             LIST WITH   2 ARGUMENT(S)        04639000
         DC    A(@CC00880)                                              04640000
@AL00458 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04641000
         DC    A(@CC00882)                                              04642000
@AL00460 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04643000
         DC    A(@CC00884)                                              04644000
@AL00465 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04645000
         DC    A(@CC00886)                                              04646000
@AL00467 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04647000
         DC    A(@CC00888)                                              04648000
@AL00469 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04649000
         DC    A(@CC00890)                                              04650000
@AL00471 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04651000
         DC    A(@CC00892)                                              04652000
@AL00473 DC    A(@CF00034)             LIST WITH   2 ARGUMENT(S)        04653000
         DC    A(@CC00894)                                              04654000
@AL00475 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04655000
         DC    A(@CC00896)                                              04656000
@AL00477 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04657000
         DC    A(@CC00898)                                              04658000
@AL00479 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04659000
         DC    A(@CC00900)                                              04660000
@AL00481 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04661000
         DC    A(@CC00902)                                              04662000
@AL00483 DC    A(@CF00819)             LIST WITH   2 ARGUMENT(S)        04663000
         DC    A(@CC00904)                                              04664000
@AL00485 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04665000
         DC    A(@CC00906)                                              04666000
@AL00490 DC    A(@CF00908)             LIST WITH   2 ARGUMENT(S)        04667000
         DC    A(@CC00909)                                              04668000
@AL00492 DC    A(@CF00604)             LIST WITH   2 ARGUMENT(S)        04669000
         DC    A(@CC00911)                                              04670000
@AL00494 DC    A(@CF00546)             LIST WITH   2 ARGUMENT(S)        04671000
         DC    A(@CC00913)                                              04672000
@AL00496 DC    A(@CF00604)             LIST WITH   2 ARGUMENT(S)        04673000
         DC    A(@CC00915)                                              04674000
@AL00498 DC    A(@CF00460)             LIST WITH   2 ARGUMENT(S)        04675000
         DC    A(@CC00917)                                              04676000
@AL00504 DC    A(@CF00819)             LIST WITH   2 ARGUMENT(S)        04677000
         DC    A(@CC00919)                                              04678000
@AL00506 DC    A(@CF00460)             LIST WITH   2 ARGUMENT(S)        04679000
         DC    A(@CC00921)                                              04680000
@AL00508 DC    A(@CF00604)             LIST WITH   2 ARGUMENT(S)        04681000
         DC    A(@CC00923)                                              04682000
@AL00510 DC    A(@CF00819)             LIST WITH   2 ARGUMENT(S)        04683000
         DC    A(@CC00925)                                              04684000
@AL00512 DC    A(@CF00033)             LIST WITH   2 ARGUMENT(S)        04685000
         DC    A(@CC00927)                                              04686000
@AL00514 DC    A(@CF00908)             LIST WITH   2 ARGUMENT(S)        04687000
         DC    A(@CC00929)                                              04688000
@AL00516 DC    A(@CF00604)             LIST WITH   2 ARGUMENT(S)        04689000
         DC    A(@CC00931)                                              04690000
@AL00521 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04691000
         DC    A(@CC00933)                                              04692000
@AL00523 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04693000
         DC    A(@CC00935)                                              04694000
@AL00525 DC    A(@CF00615)             LIST WITH   2 ARGUMENT(S)        04695000
         DC    A(@CC00937)                                              04696000
@AL00527 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04697000
         DC    A(@CC00939)                                              04698000
@AL00529 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04699000
         DC    A(@CC00941)                                              04700000
@AL00531 DC    A(@CF00615)             LIST WITH   2 ARGUMENT(S)        04701000
         DC    A(@CC00943)                                              04702000
@AL00533 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04703000
         DC    A(@CC00945)                                              04704000
@AL00535 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04705000
         DC    A(@CC00947)                                              04706000
@AL00537 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04707000
         DC    A(@CC00949)                                              04708000
@AL00539 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04709000
         DC    A(@CC00951)                                              04710000
@AL00545 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04711000
         DC    A(@CC00953)                                              04712000
@AL00547 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04713000
         DC    A(@CC00955)                                              04714000
@AL00549 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04715000
         DC    A(@CC00957)                                              04716000
@AL00551 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04717000
         DC    A(@CC00959)                                              04718000
@AL00553 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04719000
         DC    A(@CC00961)                                              04720000
@AL00555 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04721000
         DC    A(@CC00963)                                              04722000
@AL00557 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04723000
         DC    A(@CC00965)                                              04724000
@AL00559 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04725000
         DC    A(@CC00967)                                              04726000
@AL00561 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04727000
         DC    A(@CC00969)                                              04728000
@AL00563 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04729000
         DC    A(@CC00971)                                              04730000
@AL00566 DC    A(@CF00973)             LIST WITH   2 ARGUMENT(S)        04731000
         DC    A(@CC00974)                                              04732000
@AL00568 DC    A(@CF00034)             LIST WITH   2 ARGUMENT(S)        04733000
         DC    A(@CC00978)                                              04734000
@AL00570 DC    A(@CF00615)             LIST WITH   2 ARGUMENT(S)        04735000
         DC    A(@CC00980)                                              04736000
@AL00572 DC    A(@CF00615)             LIST WITH   2 ARGUMENT(S)        04737000
         DC    A(@CC00982)                                              04738000
@AL00574 DC    A(@CF00819)             LIST WITH   2 ARGUMENT(S)        04739000
         DC    A(@CC00984)                                              04740000
@AL00576 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04741000
         DC    A(@CC00986)                                              04742000
@AL00593 DC    A(@CF00229)             LIST WITH   2 ARGUMENT(S)        04743000
         DC    A(@CC00993)                                              04744000
@AL00596 DC    A(@CF00033)             LIST WITH   2 ARGUMENT(S)        04745000
         DC    A(@CC00995)                                              04746000
@AL00598 DC    A(@CF00090)             LIST WITH   2 ARGUMENT(S)        04747000
         DC    A(@CC00997)                                              04748000
@AL00600 DC    A(@CF00530)             LIST WITH   2 ARGUMENT(S)        04749000
         DC    A(@CC00999)                                              04750000
@AL00602 DC    A(@CF01002)             LIST WITH   2 ARGUMENT(S)        04751000
         DC    A(@CC01003)                                              04752000
@AL00604 DC    A(@CF01002)             LIST WITH   2 ARGUMENT(S)        04753000
         DC    A(@CC01006)                                              04754000
@AL00606 DC    A(@CF00033)             LIST WITH   2 ARGUMENT(S)        04755000
         DC    A(@CC01009)                                              04756000
@AL00608 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04757000
         DC    A(@CC01011)                                              04758000
@AL00610 DC    A(@CF01013)             LIST WITH   2 ARGUMENT(S)        04759000
         DC    A(@CC01014)                                              04760000
@AL00615 EQU   *                       LIST WITH   3 ARGUMENT(S)        04761000
@AL00635 EQU   *                       LIST WITH   3 ARGUMENT(S)        04762000
@AL00646 DC    A(@CF01013)             LIST WITH   3 ARGUMENT(S)        04763000
@AL00805 EQU   *                       LIST WITH   1 ARGUMENT(S)        04764000
@AL00940 EQU   *                       LIST WITH   1 ARGUMENT(S)        04765000
@AL00957 DC    A(@CF00058+2)           LIST WITH   1 ARGUMENT(S)        04766000
         DC    A(HOLDAREA)                                              04767000
@AL00624 EQU   *                       LIST WITH   3 ARGUMENT(S)        04768000
@AL00655 DC    A(@CF00530)             LIST WITH   3 ARGUMENT(S)        04769000
@AL00820 EQU   *                       LIST WITH   1 ARGUMENT(S)        04770000
@AL00870 DC    A(@CF00034+2)           LIST WITH   1 ARGUMENT(S)        04771000
         DC    A(HOLDAREA)                                              04772000
@AL00629 DC    A(@CF01002)             LIST WITH   2 ARGUMENT(S)        04773000
         DC    A(@CC01017)                                              04774000
@AL00640 DC    A(@CF01021)             LIST WITH   2 ARGUMENT(S)        04775000
         DC    A(@CC01022)                                              04776000
@AL00660 DC    A(@CF00819)             LIST WITH   2 ARGUMENT(S)        04777000
         DC    A(@CC01026)                                              04778000
@AL00663 DC    A(@CF00034)             LIST WITH   2 ARGUMENT(S)        04779000
         DC    A(@CC01028)                                              04780000
@AL00665 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04781000
         DC    A(@CC01030)                                              04782000
@AL00670 DC    A(@CF00041)             LIST WITH   2 ARGUMENT(S)        04783000
         DC    A(@CC01032)                                              04784000
@AL00913 DC    A(@CF01045)             LIST WITH   2 ARGUMENT(S)        04785000
         DC    A(@AFTEMPS+8)                                            04786000
@AL00922 DC    A(@CF01046)             LIST WITH   2 ARGUMENT(S)        04787000
         DC    A(@AFTEMPS+8)                                            04788000
@AL00929 DC    A(@CF00085+2)           LIST WITH   1 ARGUMENT(S)        04789000
@AL00947 EQU   *                       LIST WITH   2 ARGUMENT(S)        04790000
@AL01321 EQU   *                       LIST WITH   1 ARGUMENT(S)        04791000
@AL01332 DC    A(@CF01047)             LIST WITH   1 ARGUMENT(S)        04792000
         DC    A(@AFTEMPS+8)                                            04793000
@AL00971 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04794000
         DC    A(RECORDS)                                               04795000
@AL00973 DC    A(@CF00078)             LIST WITH   2 ARGUMENT(S)        04796000
         DC    A(@CC01049)                                              04797000
@AL00975 DC    A(@CF00078)             LIST WITH   2 ARGUMENT(S)        04798000
         DC    A(@CC01050)                                              04799000
@AL00977 DC    A(@CF00078)             LIST WITH   2 ARGUMENT(S)        04800000
         DC    A(@CC01051)                                              04801000
@AL00979 DC    A(@CF00039)             LIST WITH   2 ARGUMENT(S)        04802000
         DC    A(@CC01052)                                              04803000
@AL00981 DC    A(@CF00078)             LIST WITH   2 ARGUMENT(S)        04804000
         DC    A(@CC01053)                                              04805000
@AL00983 DC    A(@CF00078)             LIST WITH   2 ARGUMENT(S)        04806000
         DC    A(@CC01054)                                              04807000
@AL00985 DC    A(@CF00078)             LIST WITH   2 ARGUMENT(S)        04808000
         DC    A(@CC01055)                                              04809000
@AL00987 DC    A(@CF00078)             LIST WITH   2 ARGUMENT(S)        04810000
         DC    A(@CC01056)                                              04811000
@AL00989 DC    A(@CF00078)             LIST WITH   2 ARGUMENT(S)        04812000
         DC    A(@CC01057)                                              04813000
@AL00991 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04814000
         DC    A(@CC01058)                                              04815000
@AL00992 EQU   *                       LIST WITH   2 ARGUMENT(S)        04816000
@AL01006 EQU   *                       LIST WITH   2 ARGUMENT(S)        04817000
@AL01019 DC    A(@CF00058)             LIST WITH   2 ARGUMENT(S)        04818000
         DC    A(@CC00697)                                              04819000
@AL00994 DC    A(@CF00615)             LIST WITH   2 ARGUMENT(S)        04820000
         DC    A(@CC01060)                                              04821000
@AL00996 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04822000
         DC    A(@CC01062)                                              04823000
@AL00998 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04824000
         DC    A(@CC01064)                                              04825000
@AL01000 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04826000
         DC    A(@CC01066)                                              04827000
@AL01003 DC    A(@CF00460)             LIST WITH   2 ARGUMENT(S)        04828000
         DC    A(@CC01068)                                              04829000
@AL01010 DC    A(@CF01013)             LIST WITH   2 ARGUMENT(S)        04830000
         DC    A(@CC01070)                                              04831000
@AL01011 DC    A(@CF00083)             LIST WITH   2 ARGUMENT(S)        04832000
         DC    A(@CC01072)                                              04833000
@AL01014 DC    A(@CF00039)             LIST WITH   2 ARGUMENT(S)        04834000
         DC    A(@CC01073)                                              04835000
@AL01016 DC    A(@CF00085)             LIST WITH   2 ARGUMENT(S)        04836000
         DC    A(@CC01074)                                              04837000
@AL01018 DC    A(@CF00076)             LIST WITH   2 ARGUMENT(S)        04838000
         DC    A(@CC01075)                                              04839000
@AL01022 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04840000
         DC    A(@CC01076)                                              04841000
@AL01024 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04842000
         DC    A(@CC01078)                                              04843000
@AL01026 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04844000
         DC    A(@CC01080)                                              04845000
@AL01028 DC    A(@CF00037)             LIST WITH   2 ARGUMENT(S)        04846000
         DC    A(@CC01082)                                              04847000
@AL01030 DC    A(@CF00460)             LIST WITH   2 ARGUMENT(S)        04848000
         DC    A(@CC01084)                                              04849000
@AL01032 DC    A(@CF00546)             LIST WITH   2 ARGUMENT(S)        04850000
         DC    A(@CC01086)                                              04851000
@AL01034 DC    A(@CF00908)             LIST WITH   2 ARGUMENT(S)        04852000
         DC    A(@CC01088)                                              04853000
@AL01038 EQU   *                       LIST WITH   2 ARGUMENT(S)        04854000
@AL01040 EQU   *                       LIST WITH   2 ARGUMENT(S)        04855000
@AL01072 DC    A(@CF00081)             LIST WITH   2 ARGUMENT(S)        04856000
         DC    A(HOLDAREA)                                              04857000
@AL01041 EQU   *                       LIST WITH   2 ARGUMENT(S)        04858000
@AL01273 EQU   *                       LIST WITH   2 ARGUMENT(S)        04859000
@AL01275 DC    A(@CF00058)             LIST WITH   2 ARGUMENT(S)        04860000
         DC    A(@CC01091)                                              04861000
@AL01047 EQU   *                       LIST WITH   2 ARGUMENT(S)        04862000
@AL01054 EQU   *                       LIST WITH   2 ARGUMENT(S)        04863000
@AL01224 DC    A(@CF00068)             LIST WITH   2 ARGUMENT(S)        04864000
         DC    A(KEYWORD)                                               04865000
@AL01048 DC    A(@CF00058)             LIST WITH   2 ARGUMENT(S)        04866000
         DC    A(@CC01092)                                              04867000
@AL01056 DC    A(@CF00546)             LIST WITH   2 ARGUMENT(S)        04868000
         DC    A(@CC01093)                                              04869000
@AL01058 DC    A(@CF00078)             LIST WITH   2 ARGUMENT(S)        04870000
         DC    A(@CC01095)                                              04871000
@AL01062 DC    A(@CF00090)             LIST WITH   2 ARGUMENT(S)        04872000
         DC    A(@CC01096)                                              04873000
@AL01067 DC    A(@CF00036)             LIST WITH   2 ARGUMENT(S)        04874000
         DC    A(@CC01098)                                              04875000
@AL01078 DC    A(@CF00076)             LIST WITH   2 ARGUMENT(S)        04876000
         DC    A(KEYWORD)                                               04877000
@AL01084 DC    A(@CF00039)             LIST WITH   2 ARGUMENT(S)        04878000
         DC    A(KEYWORD)                                               04879000
@AL01085 EQU   *                       LIST WITH   2 ARGUMENT(S)        04880000
@AL01143 EQU   *                       LIST WITH   2 ARGUMENT(S)        04881000
@AL01154 DC    A(@CF00058)             LIST WITH   2 ARGUMENT(S)        04882000
         DC    A(@CC00699)                                              04883000
@AL01091 DC    A(@CF00076)             LIST WITH   2 ARGUMENT(S)        04884000
         DC    A(HOLDAREA+3)                                            04885000
@AL01095 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04886000
         DC    A(@CC01100)                                              04887000
@AL01100 EQU   *                       LIST WITH   2 ARGUMENT(S)        04888000
@AL01106 DC    A(@CF00078)             LIST WITH   2 ARGUMENT(S)        04889000
         DC    A(HOLDAREA)                                              04890000
@AL01101 DC    A(@CF00058)             LIST WITH   2 ARGUMENT(S)        04891000
         DC    A(@CC00658)                                              04892000
@AL01102 DC    A(@CF00608)             LIST WITH   2 ARGUMENT(S)        04893000
         DC    A(@CC01103)                                              04894000
@AL01114 EQU   *                       LIST WITH   2 ARGUMENT(S)        04895000
@AL01156 EQU   *                       LIST WITH   2 ARGUMENT(S)        04896000
@AL01176 EQU   *                       LIST WITH   2 ARGUMENT(S)        04897000
@AL00225 EQU   *                       LIST WITH   1 ARGUMENT(S)        04898000
@AL00330 EQU   *                       LIST WITH   1 ARGUMENT(S)        04899000
@AL00336 EQU   *                       LIST WITH   1 ARGUMENT(S)        04900000
@AL00340 EQU   *                       LIST WITH   1 ARGUMENT(S)        04901000
@AL00344 EQU   *                       LIST WITH   1 ARGUMENT(S)        04902000
@AL00348 EQU   *                       LIST WITH   1 ARGUMENT(S)        04903000
@AL00352 EQU   *                       LIST WITH   1 ARGUMENT(S)        04904000
@AL00857 EQU   *                       LIST WITH   1 ARGUMENT(S)        04905000
@AL00861 EQU   *                       LIST WITH   1 ARGUMENT(S)        04906000
@AL00863 EQU   *                       LIST WITH   1 ARGUMENT(S)        04907000
@AL00865 DC    A(@CF00058)             LIST WITH   1 ARGUMENT(S)        04908000
         DC    A(@CC00703)                                              04909000
@AL01186 DC    A(@CF00034)             LIST WITH   2 ARGUMENT(S)        04910000
         DC    A(@CC01105)                                              04911000
@AL01189 DC    A(@CF01021)             LIST WITH   2 ARGUMENT(S)        04912000
         DC    A(@CC01107)                                              04913000
@AL01191 DC    A(@CF00076)             LIST WITH   3 ARGUMENT(S)        04914000
@AL01204 DC    A(@CF00035)             LIST WITH   2 ARGUMENT(S)        04915000
         DC    A(KEYWORD)                                               04916000
@AL01209 EQU   *                       LIST WITH   2 ARGUMENT(S)        04917000
@AL01231 EQU   *                       LIST WITH   2 ARGUMENT(S)        04918000
@AL00333 DC    A(@CF00039)             LIST WITH   1 ARGUMENT(S)        04919000
         DC    A(@CC01112)                                              04920000
@AL01211 DC    A(@CF00908)             LIST WITH   2 ARGUMENT(S)        04921000
         DC    A(@CC01113)                                              04922000
@AL01213 DC    A(@CF00037)             LIST WITH   3 ARGUMENT(S)        04923000
@AL01258 EQU   *                       LIST WITH   2 ARGUMENT(S)        04924000
@AL00312 EQU   *                       LIST WITH   1 ARGUMENT(S)        04925000
@AL00313 DC    A(@CF00083)             LIST WITH   1 ARGUMENT(S)        04926000
         DC    A(KEYWORD)                                               04927000
@AL01235 DC    A(@CF00564)             LIST WITH   2 ARGUMENT(S)        04928000
         DC    A(SW34XXM)                                               04929000
@AL01240 DC    A(@CF00579)             LIST WITH   2 ARGUMENT(S)        04930000
         DC    A(SW328XM)                                               04931000
@AL01245 DC    A(@CF00593)             LIST WITH   2 ARGUMENT(S)        04932000
         DC    A(SW3277M)                                               04933000
@AL01294 EQU   *                       LIST WITH   1 ARGUMENT(S)        04934000
@AL01315 EQU   *                       LIST WITH   1 ARGUMENT(S)        04935000
@AL01317 EQU   *                       LIST WITH   1 ARGUMENT(S)        04936000
@AL01319 EQU   *                       LIST WITH   1 ARGUMENT(S)        04937000
@AL01326 EQU   *                       LIST WITH   1 ARGUMENT(S)        04938000
@AL01328 EQU   *                       LIST WITH   1 ARGUMENT(S)        04939000
@AL01330 EQU   *                       LIST WITH   1 ARGUMENT(S)        04940000
@AL01377 DC    A(@CF01115)             LIST WITH   1 ARGUMENT(S)        04941000
@AL01300 EQU   *                       LIST WITH   1 ARGUMENT(S)        04942000
@AL01383 DC    A(I)                    LIST WITH   1 ARGUMENT(S)        04943000
@AL01305 DC    A(CUATAB)               LIST WITH   3 ARGUMENT(S)        04944000
         DC    A(@CF00036)                                              04945000
         DC    A(@CF01122)                                              04946000
@AL01337 DC    A(MODTAB)               LIST WITH   3 ARGUMENT(S)        04947000
         DC    A(@CF00608)                                              04948000
         DC    A(@CF00035)                                              04949000
@AL01342 DC    A(SERTAB)               LIST WITH   3 ARGUMENT(S)        04950000
         DC    A(@CF00546)                                              04951000
         DC    A(@CF00908)                                              04952000
@AL01347 DC    A(VOLTAB)               LIST WITH   3 ARGUMENT(S)        04953000
         DC    A(@CF00460)                                              04954000
         DC    A(@CF01021)                                              04955000
@AL01352 DC    A(CPUTAB)               LIST WITH   3 ARGUMENT(S)        04956000
         DC    A(@CF00036)                                              04957000
         DC    A(@CF01124)                                              04958000
@AL01357 DC    A(CPCUATAB)             LIST WITH   3 ARGUMENT(S)        04959000
         DC    A(@CF00033)                                              04960000
         DC    A(@CF01125)                                              04961000
@AL01362 DC    A(LIBADTAB)             LIST WITH   3 ARGUMENT(S)        04962000
         DC    A(@CF00634)                                              04963000
         DC    A(@CF00035)                                              04964000
@AL01367 DC    A(SYMCDTAB)             LIST WITH   3 ARGUMENT(S)        04965000
         DC    A(@CF00033)                                              04966000
         DC    A(@CF00908)                                              04967000
         DS    0F                                                       04968000
@SA00001 DS    18F                                                      04969000
@PC00001 DS    1F                                                       04970000
@SA00002 DS    15F                                                      04971000
@PC00002 DS    2F                                                       04972000
@SA00003 DS    2F                                                       04973000
@PC00003 DS    1F                                                       04974000
@SA00004 DS    2F                                                       04975000
@PC00004 DS    3F                                                       04976000
@SA00005 DS    2F                                                       04977000
@PC00005 DS    1F                                                       04978000
@SA00007 DS    2F                                                       04979000
@PC00007 DS    1F                                                       04980000
@PC00008 DS    1F                                                       04981000
@SA00009 DS    2F                                                       04982000
@SA00010 DS    2F                                                       04983000
@PC00010 DS    2F                                                       04984000
@SA00011 DS    2F                                                       04985000
@PC00011 DS    2F                                                       04986000
@SA00013 DS    2F                                                       04987000
@PC00013 DS    2F                                                       04988000
@SA00014 DS    2F                                                       04989000
@PC00014 DS    2F                                                       04990000
@SA00015 DS    2F                                                       04991000
@SA00006 DS    0F                                                       04992000
         DS    2F                                                       04993000
@AL00001 DS    3A                                                       04994000
@TF00001 DS    F                                                        04995000
@AFTEMPS DS    3F                                                       04996000
         DS    0F                                                       04997000
@CF00058 DC    F'1'                                                     04998000
@CF00076 DC    F'2'                                                     04999000
@CH00076 EQU   @CF00076+2                                               05000000
@CF00078 DC    F'3'                                                     05001000
@CF00039 DC    F'4'                                                     05002000
@CF00081 DC    F'5'                                                     05003000
@CH00081 EQU   @CF00081+2                                               05004000
@CF00083 DC    F'6'                                                     05005000
@CH00083 EQU   @CF00083+2                                               05006000
@CF00085 DC    F'7'                                                     05007000
@CH00085 EQU   @CF00085+2                                               05008000
@CF00068 DC    F'8'                                                     05009000
@CF00034 DC    F'9'                                                     05010000
@CF00035 DC    F'10'                                                    05011000
@CF00036 DC    F'11'                                                    05012000
@CH00036 EQU   @CF00036+2                                               05013000
@CF00037 DC    F'12'                                                    05014000
@CH00037 EQU   @CF00037+2                                               05015000
@CF00608 DC    F'13'                                                    05016000
@CF00615 DC    F'14'                                                    05017000
@CF00033 DC    F'15'                                                    05018000
@CF00090 DC    F'16'                                                    05019000
@CF00460 DC    F'17'                                                    05020000
@CF00908 DC    F'18'                                                    05021000
@CF00819 DC    F'19'                                                    05022000
@CF00604 DC    F'20'                                                    05023000
@CF00546 DC    F'21'                                                    05024000
@CF01013 DC    F'22'                                                    05025000
@CF00229 DC    F'24'                                                    05026000
@CF01002 DC    F'25'                                                    05027000
@CF01021 DC    F'26'                                                    05028000
@CF00990 DC    F'29'                                                    05029000
@CF01125 DC    F'30'                                                    05030000
@CF00041 DC    F'31'                                                    05031000
@CF00530 DC    F'32'                                                    05032000
@CF01122 DC    F'34'                                                    05033000
@CF00634 DC    F'35'                                                    05034000
@CF01124 DC    F'42'                                                    05035000
@CF00973 DC    F'46'                                                    05036000
@CF01047 DC    F'58'                                                    05037000
@CF00736 DC    F'65'                                                    05038000
@CF01115 DC    F'66'                                                    05039000
@CF00728 DC    F'67'                                                    05040000
@CF01045 DC    F'68'                                                    05041000
@CF01046 DC    F'69'                                                    05042000
@CF00652 DC    F'80'                                                    05043000
@CF01040 DC    F'81'                                                    05044000
@CF00564 DC    F'95'                                                    05045000
@CF00579 DC    F'110'                                                   05046000
@CF00593 DC    F'113'                                                   05047000
@CF00786 DC    F'130'                                                   05048000
@CF01102 DC    F'1024'                                                  05049000
@CF01211 DC    F'-66'                                                   05050000
@CF01204 DC    F'-9'                                                    05051000
@CF01199 DC    F'-8'                                                    05052000
@CF01205 DC    F'-7'                                                    05053000
@CF01209 DC    F'-5'                                                    05054000
@CF01207 DC    F'-4'                                                    05055000
@CF01208 DC    F'-3'                                                    05056000
@CF01044 DC    XL4'FFFFFFF8'                                            05057000
@CF01206 DC    XL4'0000FFFF'                                            05058000
@CV00760 DC    V(IFCDEVIC)                                              05059000
         DS    0D                                                       05060000
LENGPARM DC    F'0'                                                     05061000
I        DS    F                                                        05062000
RETCODE  DC    F'0'                                                     05063000
PLACE    DC    F'0'                                                     05064000
INDEX2   DS    F                                                        05065000
NEXTC    DS    F                                                        05066000
         DS    0D                                                       05067000
@TS00001 DS    CL19                                                     05068000
@CC00974 DC    C'ZERO USED WITH PARAMETER RESTRICTING RETRIEVAL'        05069000
@CC00999 DC    C'TYPE(CCH,OBR,DDR,MDR),CUA/CPUCUA'                      05070000
@CC01032 DC    C'CLEARING LOGREC IS NOT ALLOWED.'                       05071000
@CC01022 DC    C'DEVICE(34XX),MES/THRESHOLD'                            05072000
@CC01107 DC    C'DEVICE TYPES(OBR,MIH,DDR)-'                            05073000
@CC01003 DC    C'DEV,TYPE(OBR,MIH,DDR,MDR)'                             05074000
@CC01006 DC    C'TERMN,LIBADR/SYMCDE/VOLID'                             05075000
@CC01017 DC    C'DEVICE(33XX),SYMCDE/VOLID'                             05076000
@CC00993 DC    C'TRENDS,DATE(RANGE > 30) '                              05077000
@CC01014 DC    C'ERRORID,TYPE(MCH,SOFT)'                                05078000
@CC01070 DC    C'MEDIA ERROR STATISTICS'                                05079000
@CC00913 DC    C'MES/THRESHOLD,ERRORID'                                 05080000
@CC01086 DC    C'EDIT-PRINT SHORT OBRS'                                 05081000
@CC01093 DC    C'TIME CROSSES MIDNIGHT'                                 05082000
@CC00880 DC    C'TRENDS,MES/THRESHOLD'                                  05083000
@CC00911 DC    C'MES/THRESHOLD,SYMCDE'                                  05084000
@CC00915 DC    C'MES/THRESHOLD,CPUCUA'                                  05085000
@CC00923 DC    C'MES/THRESHOLD,LIBADR'                                  05086000
@CC00931 DC    C'MES/THRESHOLD,RDESUM'                                  05087000
@CC00820 DC    C'USERPGM NOT ALLOWED'                                   05088000
@CC00850 DC    C'SYSUM,MES/THRESHOLD'                                   05089000
@CC00904 DC    C'EVENT,MES/THRESHOLD'                                   05090000
@CC00919 DC    C'MES/THRESHOLD,TERMN'                                   05091000
@CC00925 DC    C'MES/THRESHOLD,SHORT'                                   05092000
@CC00984 DC    C'LIBADR,SYMCDE/VOLID'                                   05093000
@CC01026 DC    C'DEVICE(3705),LIBADR'                                   05094000
@CC00909 DC    C'MES/THRESHOLD,TYPE'                                    05095000
@CC00929 DC    C'MES/THRESHOLD,ZERO'                                    05096000
@CC01088 DC    C'DATE/TIME RANGE - '                                    05097000
@CC01113 DC    C'DEVICE TYPES(MDR)-'                                    05098000
@CC00917 DC    C'MES/THRESHOLD,ACC'                                     05099000
@CC00921 DC    C'MES/THRESHOLD,MOD'                                     05100000
@CC01068 DC    C'THRESHOLD REPORT('                                     05101000
@CC01084 DC    C'DUMP SDR COUNTERS'                                     05102000
@CC00997 DC    C'LIBADR,TYPE(MDR)'                                      05103000
@CC01096 DC    C'TERMINAL NAME - '                                      05104000
@CC00927 DC    C'THRESHOLD,PRINT'                                       05105000
@CC00995 DC    C'TERMN,TYPE(OBR)'                                       05106000
@CC01009 DC    C'SHORT,TYPE(OBR)'                                       05107000
@CC00862 DC    C'TRENDS,ERRORID'                                        05108000
@CC00937 DC    C'RDESUM,TABSIZE'                                        05109000
@CC00943 DC    C'RDESUM,ERRORID'                                        05110000
@CC00980 DC    C'MOD,CPU/CPUCUA'                                        05111000
@CC00982 DC    C'CPUCUA,CUA/CPU'                                        05112000
@CC01060 DC    C'SYSTEM SUMMARY'                                        05113000
@CC00828 DC    C'SYSUM,ERRORID'                                         05114000
@CC00860 DC    C'TRENDS,SYMCDE'                                         05115000
@CC00866 DC    C'TRENDS,CPUCUA'                                         05116000
@CC00874 DC    C'TRENDS,LIBADR'                                         05117000
@CC00876 DC    C'TRENDS,DEVSER'                                         05118000
@CC00884 DC    C'TRENDS,RDESUM'                                         05119000
@CC00890 DC    C'EVENT,ERRORID'                                         05120000
@CC00941 DC    C'RDESUM,SYMCDE'                                         05121000
@CC00947 DC    C'RDESUM,CPUCUA'                                         05122000
@CC00957 DC    C'RDESUM,LIBADR'                                         05123000
@CC00959 DC    C'RDESUM,DEVSER'                                         05124000
@CC01064 DC    C'EVENT HISTORY'                                         05125000
@CC01080 DC    C'HISTORY INPUT'                                         05126000
@CC01100 DC    C'TABLE SIZE - '                                         05127000
@CC01103 DC    C'LINE COUNT - '                                         05128000
@CC00826 DC    C'SYSUM,SYMCDE'                                          05129000
@CC00832 DC    C'SYSUM,CPUCUA'                                          05130000
@CC00840 DC    C'SYSUM,LIBADR'                                          05131000
@CC00842 DC    C'SYSUM,DEVSER'                                          05132000
@CC00852 DC    C'SYSUM,TRENDS'                                          05133000
@CC00856 DC    C'SYSUM,RDESUM'                                          05134000
@CC00858 DC    C'TRENDS,PRINT'                                          05135000
@CC00868 DC    C'TRENDS,VOLID'                                          05136000
@CC00870 DC    C'TRENDS,TERMN'                                          05137000
@CC00878 DC    C'TRENDS,SHORT'                                          05138000
@CC00882 DC    C'TRENDS,EVENT'                                          05139000
@CC00888 DC    C'EVENT,SYMCDE'                                          05140000
@CC00892 DC    C'EVENT,CPUCUA'                                          05141000
@CC00896 DC    C'EVENT,LIBADR'                                          05142000
@CC00898 DC    C'EVENT,DEVSER'                                          05143000
@CC00906 DC    C'EVENT,RDESUM'                                          05144000
@CC00939 DC    C'RDESUM,PRINT'                                          05145000
@CC00949 DC    C'RDESUM,VOLID'                                          05146000
@CC00953 DC    C'RDESUM,TERMN'                                          05147000
@CC00965 DC    C'RDESUM,SHORT'                                          05148000
@CC00986 DC    C'ERRORID,DATE'                                          05149000
@CC01062 DC    C'TREND REPORT'                                          05150000
@CC01078 DC    C'LOGREC INPUT'                                          05151000
@CC01082 DC    C'CLEAR LOGREC'                                          05152000
@CC00824 DC    C'SYSUM,PRINT'                                           05153000
@CC00834 DC    C'SYSUM,VOLID'                                           05154000
@CC00836 DC    C'SYSUM,TERMN'                                           05155000
@CC00848 DC    C'SYSUM,SHORT'                                           05156000
@CC00854 DC    C'SYSUM,EVENT'                                           05157000
@CC00886 DC    C'EVENT,PRINT'                                           05158000
@CC00900 DC    C'EVENT,SHORT'                                           05159000
@CC00933 DC    C'RDESUM,TYPE'                                           05160000
@CC00935 DC    C'RDESUM,TIME'                                           05161000
@CC00967 DC    C'RDESUM,ZERO'                                           05162000
@CC00969 DC    C'RDESUM,DATE'                                           05163000
@CC00971 DC    C'RDESUM,HIST'                                           05164000
@CC01011 DC    C'SHORT,PRINT'                                           05165000
@CC01066 DC    C'RDE SUMMARY'                                           05166000
@CC01098 DC    C'ERROR ID - '                                           05167000
@CC00822 DC    C'SYSUM,TYPE'                                            05168000
@CC00864 EQU   @CC00866                                                 05169000
@CC00872 DC    C'TRENDS,MOD'                                            05170000
@CC00902 DC    C'EVENT,ZERO'                                            05171000
@CC00945 EQU   @CC00947                                                 05172000
@CC00951 DC    C'RDESUM,ACC'                                            05173000
@CC00955 DC    C'RDESUM,MOD'                                            05174000
@CC00961 EQU   @CC00959                                                 05175000
@CC00963 DC    C'RDESUM,CUA'                                            05176000
@CC01030 DC    C'HIST,MERGE'                                            05177000
@CC01058 DC    C'ALL FRAMES'                                            05178000
@CC01076 DC    C'ACCUMULATE'                                            05179000
@CC00830 EQU   @CC00832                                                 05180000
@CC00838 DC    C'SYSUM,MOD'                                             05181000
@CC00844 EQU   @CC00842                                                 05182000
@CC00846 DC    C'SYSUM,CUA'                                             05183000
@CC00894 DC    C'EVENT,MOD'                                             05184000
@CC00978 DC    C'HIST,ZERO'                                             05185000
@CC01028 DC    C'TIME,DATE'                                             05186000
@CC01105 DC    C' EXCLUDED'                                             05187000
@CC00705 DC    C'        '                                              05188000
@CC01043 DC    C'SHARE=('                                               05189000
@CC01074 DC    C'SUMMARY'                                               05190000
@CC01072 DC    C'PRINT('                                                05191000
@CC01025 DC    C'3705'                                                  05192000
@CC01036 DC    C'34XX'                                                  05193000
@CC01037 DC    C'33XX'                                                  05194000
@CC01052 DC    C'SOFT'                                                  05195000
@CC01073 EQU   @CC01086                                                 05196000
@CC01112 DC    C'NONE'                                                  05197000
@CC01049 DC    C'MCH'                                                   05198000
@CC01050 DC    C'CCH'                                                   05199000
@CC01051 DC    C'OBR'                                                   05200000
@CC01053 DC    C'IPL'                                                   05201000
@CC01054 DC    C'DDR'                                                   05202000
@CC01055 DC    C'MIH'                                                   05203000
@CC01056 DC    C'EOD'                                                   05204000
@CC01057 DC    C'MDR'                                                   05205000
@CC01095 EQU   @CC01058                                                 05206000
@CC00759 DC    C'XX'                                                    05207000
@CC01016 EQU   @CC01037                                                 05208000
@CC01020 EQU   @CC01036                                                 05209000
@CC01075 EQU   @CC01112                                                 05210000
@CC00658 DC    C'K'                                                     05211000
@CC00697 DC    C')'                                                     05212000
@CC00699 DC    C'.'                                                     05213000
@CC00703 DC    C'-'                                                     05214000
@CC01091 DC    C'/'                                                     05215000
@CC01092 DC    C':'                                                     05216000
@CB00685 DC    X'FF80'                                                  05217000
@CB01111 DC    X'8003'                                                  05218000
IPSWES1  DC    X'00000000'                                              05219000
         ORG   IPSWES1                                                  05220000
TYPEFLG  DS    BL1                                                      05221000
THRSHFLG EQU   IPSWES1+0                                                05222000
TIMEFLG  EQU   IPSWES1+0                                                05223000
TABFLG   EQU   IPSWES1+0                                                05224000
PRINTFLG EQU   IPSWES1+0                                                05225000
SYMFLG   EQU   IPSWES1+0                                                05226000
LINEFLG  EQU   IPSWES1+0                                                05227000
ERRORFLG EQU   IPSWES1+0                                                05228000
CPUFLG   DS    BL1                                                      05229000
CPUCUFLG EQU   IPSWES1+1                                                05230000
VOLFLG   EQU   IPSWES1+1                                                05231000
ACCFLG   EQU   IPSWES1+1                                                05232000
TERMFLG  EQU   IPSWES1+1                                                05233000
MODFLG   EQU   IPSWES1+1                                                05234000
LIBFLG   EQU   IPSWES1+1                                                05235000
SERFLG   EQU   IPSWES1+1                                                05236000
HISTFLG  DS    BL1                                                      05237000
MESFLG   EQU   IPSWES1+2                                                05238000
MERGEFLG EQU   IPSWES1+2                                                05239000
RDEFLG   EQU   IPSWES1+2                                                05240000
DEVFLG   EQU   IPSWES1+2                                                05241000
CUAFLG   EQU   IPSWES1+2                                                05242000
EVENTFLG EQU   IPSWES1+2                                                05243000
SHORTFLG EQU   IPSWES1+2                                                05244000
SYSUMFLG DS    BL1                                                      05245000
TRENDFLG EQU   IPSWES1+3                                                05246000
ZEROFLG  EQU   IPSWES1+3                                                05247000
CARDOPEN EQU   IPSWES1+3                                                05248000
CARDCLOS EQU   IPSWES1+3                                                05249000
DATEFLG  EQU   IPSWES1+3                                                05250000
USERFLG  EQU   IPSWES1+3                                                05251000
         ORG   IPSWES1+4                                                05252000
PARMPT   DS    CL134                                                    05253000
         ORG   PARMPT                                                   05254000
@NM00012 DC    CL2'11'                                                  05255000
MSGNO    DC    CL32' '                                                  05256000
PARMPRT  DC    CL100' '                                                 05257000
         ORG   PARMPT+134                                               05258000
HEXHEAD  DC    CL45'DEBUG3 - HEX DUMP OF COMMUNICATIONS TABLE'          05259000
BUG13LNE DC    CL134' '                                                 05260000
         ORG   BUG13LNE                                                 05261000
@NM00013 DC    CL2'1 '                                                  05262000
@NM00014 DC    55CL1'*'                                                 05263000
@NM00015 DC    CL21'DEBUG 13 IS ACTIVATED'                              05264000
@NM00016 DC    56CL1'*'                                                 05265000
         ORG   BUG13LNE+134                                             05266000
PARMHED1 DC    CL43'PARAMETER OPTIONS VALID FOR THIS EXECUTION'         05267000
PARMHED2 DC    CL47'PARAMETER OPTIONS REQUESTED FOR THIS EXECUTION'     05268000
SW34XXM  DS    CL95                                                     05269000
         ORG   SW34XXM                                                  05270000
@NM00017 DC    CL31'NOTE:  SPECIFICATION OF DEVICE '                    05271000
@NM00018 DC    CL31'3410 OR 3420 IMPLIES RETRIEVAL '                    05272000
@NM00019 DC    CL33'OF RECORDS FOR 3410 AND 3420.  '                    05273000
         ORG   SW34XXM+95                                               05274000
SW328XM  DS    CL110                                                    05275000
         ORG   SW328XM                                                  05276000
@NM00020 DC    CL31'NOTE:  SPECIFICATION OF DEVICE '                    05277000
@NM00021 DC    CL31'3284 OR 3286 IMPLIES RETRIEVAL '                    05278000
@NM00022 DC    CL31'OF MDR RECORDS FOR 3284, 3286 A'                    05279000
@NM00023 DC    CL17'ND 3270 REMOTE.'                                    05280000
         ORG   SW328XM+110                                              05281000
SW3277M  DS    CL113                                                    05282000
         ORG   SW3277M                                                  05283000
@NM00024 DC    CL31'NOTE:  SPECIFICATION OF DEVICE '                    05284000
@NM00025 DC    CL31'3277 IMPLIES RETRIEVAL OF MDR R'                    05285000
@NM00026 DC    CL31'ECORDS FOR 3284, 3286, 3277 REM'                    05286000
@NM00027 DC    CL20'OTE, AND 3270 DIAL.'                                05287000
         ORG   SW3277M+113                                              05288000
RECORDS  DC    CL13'RECORD TYPES('                                      05289000
CUATAB   DC    CL11'CUA ENTRIES'                                        05290000
DEVTAB   DC    CL14'DEVICE ENTRIES'                                     05291000
MODTAB   DC    CL13'MODEL ENTRIES'                                      05292000
SERTAB   DC    CL21'DEVICE SERIAL ENTRIES'                              05293000
VOLTAB   DC    CL17'VOLUME ID ENTRIES'                                  05294000
CPUTAB   DC    CL11'CPU ENTRIES'                                        05295000
CPCUATAB DC    CL15'CPU/CUA ENTRIES'                                    05296000
LIBADTAB DC    CL35'LINE INTERFACE BASE ADDRESS ENTRIES'                05297000
SYMCDTAB DC    CL15'SYMCODE ENTRIES'                                    05298000
SHARETAB DC    CL13'SHARE ENTRIES'                                      05299000
PARMFLD  DC    CL256' '                                                 05300000
HOLDAREA DS    CL5                                                      05301000
KEYWORD  DS    CL10                                                     05302000
SWES     DC    X'0000'                                                  05303000
         ORG   SWES                                                     05304000
VALID    DS    BL1                                                      05305000
DEVSW    EQU   SWES+0                                                   05306000
SHARECUX EQU   SWES+0                                                   05307000
FOUND    EQU   SWES+0                                                   05308000
NOCOMMA  EQU   SWES+0                                                   05309000
SW34XX   EQU   SWES+0                                                   05310000
SW328X   EQU   SWES+0                                                   05311000
SW3277   EQU   SWES+0                                                   05312000
RPORC    DS    BL1                                                      05313000
         ORG   SWES+2                                                   05314000
SWITCHON DS    BL2                                                      05315000
YYDDD    DS    CL3                                                      05316000
         ORG   YYDDD                                                    05317000
YY       DS    CL1                                                      05318000
DDDS     DS    CL2                                                      05319000
         ORG   DDDS                                                     05320000
DD       DS    CL1                                                      05321000
DS       DS    CL1                                                      05322000
         ORG   YYDDD+3                                                  05323000
SUPERZAP DC    3CL10'SUPERZAP'                                          05324000
NUMTAB   DC    CL1'0'                                                   05325000
         DC    CL1'1'                                                   05326000
         DC    CL1'2'                                                   05327000
         DC    CL1'3'                                                   05328000
         DC    CL1'4'                                                   05329000
         DC    CL1'5'                                                   05330000
         DC    CL1'6'                                                   05331000
         DC    CL1'7'                                                   05332000
         DC    CL1'8'                                                   05333000
         DC    CL1'9'                                                   05334000
         DC    CL1'A'                                                   05335000
         DC    CL1'B'                                                   05336000
         DC    CL1'C'                                                   05337000
         DC    CL1'D'                                                   05338000
         DC    CL1'E'                                                   05339000
         DC    CL1'F'                                                   05340000
         DC    CL1'X'                                                   05341000
HEXTAB   DC    X'00'                                                    05342000
         DC    X'01'                                                    05343000
         DC    X'02'                                                    05344000
         DC    X'03'                                                    05345000
         DC    X'04'                                                    05346000
         DC    X'05'                                                    05347000
         DC    X'06'                                                    05348000
         DC    X'07'                                                    05349000
         DC    X'08'                                                    05350000
         DC    X'09'                                                    05351000
         DC    X'0A'                                                    05352000
         DC    X'0B'                                                    05353000
         DC    X'0C'                                                    05354000
         DC    X'0D'                                                    05355000
         DC    X'0E'                                                    05356000
         DC    X'0F'                                                    05357000
         DC    X'00'                                                    05358000
LETTAB   DC    CL1'A'                                                   05359000
         DC    CL1'B'                                                   05360000
         DC    CL1'C'                                                   05361000
         DC    CL1'D'                                                   05362000
         DC    CL1'E'                                                   05363000
         DC    CL1'F'                                                   05364000
         DC    CL1'G'                                                   05365000
         DC    CL1'H'                                                   05366000
         DC    CL1'I'                                                   05367000
         DC    CL1'J'                                                   05368000
         DC    CL1'K'                                                   05369000
         DC    CL1'L'                                                   05370000
         DC    CL1'M'                                                   05371000
         DC    CL1'N'                                                   05372000
         DC    CL1'O'                                                   05373000
         DC    CL1'P'                                                   05374000
         DS    CL3                                                      05375000
PATCH    DC    20F'0'                                                   05376000
IFCPARM2 CSECT                                                          05377000
         DC    S(SUPERZAP)                                              05378000
IFCPARM2 CSECT                                                          05379000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       05380000
@01      EQU   01                                                       05381000
@02      EQU   02                                                       05382000
@03      EQU   03                                                       05383000
@04      EQU   04                                                       05384000
@05      EQU   05                                                       05385000
@06      EQU   06                                                       05386000
@07      EQU   07                                                       05387000
@08      EQU   08                                                       05388000
@09      EQU   09                                                       05389000
@10      EQU   10                                                       05390000
@11      EQU   11                                                       05391000
@12      EQU   12                                                       05392000
@13      EQU   13                                                       05393000
@14      EQU   14                                                       05394000
@15      EQU   15                                                       05395000
J        EQU   @04                                                      05396000
INDEX3   EQU   @06                                                      05397000
R1       EQU   @01                                                      05398000
R2       EQU   @02                                                      05399000
R3       EQU   @03                                                      05400000
R7       EQU   @07                                                      05401000
R15      EQU   @15                                                      05402000
INDEX1   EQU   @05                                                      05403000
R0       EQU   @00                                                      05404000
R10      EQU   @10                                                      05405000
R11      EQU   @11                                                      05406000
R12      EQU   @12                                                      05407000
R13      EQU   @13                                                      05408000
R14      EQU   @14                                                      05409000
R4       EQU   @04                                                      05410000
R5       EQU   @05                                                      05411000
R6       EQU   @06                                                      05412000
R8       EQU   @08                                                      05413000
R9       EQU   @09                                                      05414000
IOHND    EQU   0                                                        05415000
IFCMSG   EQU   0                                                        05416000
PARM     EQU   0                                                        05417000
RECTYPE  EQU   PARM                                                     05418000
PMCH     EQU   RECTYPE                                                  05419000
PCHAN    EQU   RECTYPE                                                  05420000
POBR     EQU   RECTYPE                                                  05421000
PSOFT    EQU   RECTYPE                                                  05422000
PIPL     EQU   RECTYPE                                                  05423000
PDDR     EQU   RECTYPE                                                  05424000
PMIH     EQU   RECTYPE                                                  05425000
PEOD     EQU   RECTYPE                                                  05426000
PTTYP    EQU   RECTYPE+1                                                05427000
PMCHFRAM EQU   RECTYPE+1                                                05428000
PCCHFRAM EQU   RECTYPE+1                                                05429000
SWITCHES EQU   PARM+2                                                   05430000
RDESUM   EQU   SWITCHES                                                 05431000
PARMMES  EQU   SWITCHES                                                 05432000
SHORTOBR EQU   SWITCHES                                                 05433000
TREND    EQU   SWITCHES                                                 05434000
PARMTHR  EQU   SWITCHES                                                 05435000
SYSUM    EQU   SWITCHES                                                 05436000
TIMESEQ  EQU   SWITCHES                                                 05437000
NOSDR    EQU   SWITCHES                                                 05438000
ZEROALL  EQU   SWITCHES+1                                               05439000
DEVEXCL  EQU   SWITCHES+1                                               05440000
SHIFT3RD EQU   SWITCHES+1                                               05441000
DEBUG    EQU   PARM+4                                                   05442000
DEBUG3   EQU   DEBUG                                                    05443000
DEBUG13  EQU   DEBUG+1                                                  05444000
DEBUG26  EQU   DEBUG+3                                                  05445000
DEBUG31  EQU   DEBUG+3                                                  05446000
DEBUGA   EQU   PARM+8                                                   05447000
DEBUG46  EQU   DEBUGA+1                                                 05448000
DEBUG47  EQU   DEBUGA+1                                                 05449000
MISC     EQU   PARM+12                                                  05450000
PACC     EQU   MISC                                                     05451000
PHIST    EQU   MISC                                                     05452000
PRINTES  EQU   MISC                                                     05453000
PEDIT    EQU   PRINTES                                                  05454000
PSUM     EQU   PRINTES                                                  05455000
ERRORID  EQU   MISC                                                     05456000
PLOGREC  EQU   MISC                                                     05457000
OPENCLSE EQU   PARM+13                                                  05458000
OPENIO   EQU   OPENCLSE                                                 05459000
OEREPPT  EQU   OPENIO                                                   05460000
OSERLOG  EQU   OPENIO                                                   05461000
OACCIN   EQU   OPENIO                                                   05462000
OACCDEV  EQU   OPENIO                                                   05463000
OSYSIN   EQU   OPENIO                                                   05464000
ODRCTWRK EQU   OPENIO                                                   05465000
CLOSEIO  EQU   OPENCLSE+2                                               05466000
CSYSIN   EQU   CLOSEIO                                                  05467000
DATENOW  EQU   PARM+17                                                  05468000
DAYNOW   EQU   DATENOW                                                  05469000
YEARNOW  EQU   DATENOW+4                                                05470000
STDT     EQU   PARM+23                                                  05471000
STDATE   EQU   STDT                                                     05472000
PSTD     EQU   STDATE+1                                                 05473000
ENDDT    EQU   PARM+31                                                  05474000
ENDDATE  EQU   ENDDT                                                    05475000
PEND     EQU   ENDDATE+1                                                05476000
STTIME1  EQU   PARM+39                                                  05477000
ENDTIME1 EQU   PARM+43                                                  05478000
STTIME2  EQU   PARM+47                                                  05479000
ENDTIME2 EQU   PARM+51                                                  05480000
STRTDATE EQU   PARM+55                                                  05481000
TERM     EQU   PARM+58                                                  05482000
RDTHRSH  EQU   PARM+66                                                  05483000
WRTHRSH  EQU   PARM+69                                                  05484000
@NM00007 EQU   PARM+75                                                  05485000
TABSIZE  EQU   PARM+80                                                  05486000
ERRID    EQU   PARM+92                                                  05487000
IDVALUE  EQU   ERRID                                                    05488000
IDCPU    EQU   ERRID+3                                                  05489000
IDASID   EQU   ERRID+4                                                  05490000
IDTIMEA  EQU   ERRID+6                                                  05491000
IDTIME   EQU   IDTIMEA                                                  05492000
CCHHRLNG EQU   PARM+112                                                 05493000
LINECT   EQU   PARM+120                                                 05494000
ADIOHND  EQU   PARM+124                                                 05495000
ADIFCMSG EQU   PARM+128                                                 05496000
ADEDITB  EQU   PARM+132                                                 05497000
EVPTR    EQU   PARM+136                                                 05498000
SORTADR  EQU   PARM+140                                                 05499000
PRINTADR EQU   PARM+148                                                 05500000
CUAPTR   EQU   PARM+152                                                 05501000
DEVPTR   EQU   PARM+156                                                 05502000
MODPTR   EQU   PARM+160                                                 05503000
SERPTR   EQU   PARM+164                                                 05504000
VOLPTR   EQU   PARM+168                                                 05505000
CPUPTR   EQU   PARM+172                                                 05506000
CPCUAPTR EQU   PARM+176                                                 05507000
LIBADPTR EQU   PARM+180                                                 05508000
SYMCDPTR EQU   PARM+184                                                 05509000
SYSUMPTR EQU   PARM+188                                                 05510000
TRENPTR  EQU   PARM+192                                                 05511000
SHAREPTR EQU   PARM+196                                                 05512000
MERDCPTR EQU   PARM+208                                                 05513000
DUMPTABL EQU   PARM+228                                                 05514000
DUMPINFO EQU   DUMPTABL+4                                               05515000
TRENDONE EQU   0                                                        05516000
TREGEN   EQU   TRENDONE+8                                               05517000
TRECCH0  EQU   TREGEN+8                                                 05518000
TREND2   EQU   0                                                        05519000
TRENDKEY EQU   TREND2                                                   05520000
TRENDRT  EQU   TRENDKEY+1                                               05521000
TRENCPUS EQU   TRENDKEY+3                                               05522000
TRENDITM EQU   TRENDKEY+4                                               05523000
EVTABLE  EQU   0                                                        05524000
EVSTOP   EQU   EVTABLE                                                  05525000
EVKEY    EQU   EVTABLE+6                                                05526000
SORTABLE EQU   0                                                        05527000
SORTKEY  EQU   SORTABLE                                                 05528000
SORTCCHR EQU   SORTABLE+5                                               05529000
SYSUMONE EQU   0                                                        05530000
SYSUM2   EQU   0                                                        05531000
SYSUMKEY EQU   SYSUM2                                                   05532000
SYSRT    EQU   SYSUMKEY+1                                               05533000
SYSCPUS  EQU   SYSUMKEY+3                                               05534000
SYSITEM  EQU   SYSUMKEY+4                                               05535000
SHARE    EQU   0                                                        05536000
SHARENUM EQU   SHARE                                                    05537000
SHAREIO  EQU   SHARE+2                                                  05538000
SHRCUCPU EQU   SHAREIO                                                  05539000
SHARECUA EQU   SHRCUCPU                                                 05540000
SHAREDX  EQU   SHARECUA                                                 05541000
SHARSERA EQU   SHRCUCPU+2                                               05542000
SHARSERB EQU   SHAREIO+7                                                05543000
SHARLET  EQU   SHAREIO+10                                               05544000
EDITLOAD EQU   0                                                        05545000
EDITABLE EQU   EDITLOAD+4                                               05546000
LOADNAME EQU   EDITABLE                                                 05547000
CUA      EQU   0                                                        05548000
CUANUM   EQU   CUA                                                      05549000
CUAVAL   EQU   CUA+2                                                    05550000
CUA1     EQU   CUAVAL                                                   05551000
CUA2     EQU   CUAVAL+2                                                 05552000
DEVICE   EQU   0                                                        05553000
DEVNUM   EQU   DEVICE                                                   05554000
DEVVAL   EQU   DEVICE+2                                                 05555000
MDRNUM   EQU   DEVICE+202                                               05556000
MDRVAL   EQU   DEVICE+204                                               05557000
MODELS   EQU   0                                                        05558000
MODNUM   EQU   MODELS                                                   05559000
MODVAL   EQU   MODELS+2                                                 05560000
DEVSERAL EQU   0                                                        05561000
SERNUM   EQU   DEVSERAL                                                 05562000
SERVAL   EQU   DEVSERAL+2                                               05563000
VOLUME   EQU   0                                                        05564000
VOLNUM   EQU   VOLUME                                                   05565000
VOLVAL   EQU   VOLUME+2                                                 05566000
CPUS     EQU   0                                                        05567000
CPUNUM   EQU   CPUS                                                     05568000
CPUVAL   EQU   CPUS+2                                                   05569000
CPUCUAS  EQU   0                                                        05570000
CPCUANUM EQU   CPUCUAS                                                  05571000
CPUCUAV  EQU   CPUCUAS+2                                                05572000
LIBADR   EQU   0                                                        05573000
LIBADNUM EQU   LIBADR                                                   05574000
LIBVAL   EQU   LIBADR+2                                                 05575000
SYMCODE  EQU   0                                                        05576000
SYMCDNUM EQU   SYMCODE                                                  05577000
SYMVAL   EQU   SYMCODE+2                                                05578000
SYMVAL1  EQU   SYMVAL                                                   05579000
SYMVAL2  EQU   SYMVAL+2                                                 05580000
MERIDIAN EQU   0                                                        05581000
CARD     EQU   0                                                        05582000
IPSWES   EQU   0                                                        05583000
LPARM    EQU   0                                                        05584000
CONPARM  EQU   0                                                        05585000
ERROR    EQU   0                                                        05586000
TABNAME  EQU   0                                                        05587000
TABNLEN  EQU   0                                                        05588000
TABLEN   EQU   0                                                        05589000
OPLEN    EQU   0                                                        05590000
LENGTHV  EQU   0                                                        05591000
HEXLEN   EQU   0                                                        05592000
WORDLEN  EQU   0                                                        05593000
WORDSTR  EQU   0                                                        05594000
WORDLEN1 EQU   0                                                        05595000
WORDSTR1 EQU   0                                                        05596000
WORDLEN2 EQU   0                                                        05597000
WORDSTR2 EQU   0                                                        05598000
WORDLEN3 EQU   0                                                        05599000
WORDSTR3 EQU   0                                                        05600000
HOLD     EQU   HOLDAREA                                                 05601000
CUAHOLD  EQU   YYDDD                                                    05602000
CPUHOLD  EQU   YYDDD                                                    05603000
SWITCHC  EQU   SWITCHON                                                 05604000
TRECCH   EQU   TRECCH0                                                  05605000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    05606000
MODEL    EQU   MERIDIAN+2                                               05607000
MRDNUMBR EQU   MERIDIAN                                                 05608000
CPUCUX3  EQU   CPUCUAV+5                                                05609000
CPUCUX2  EQU   CPUCUAV+3                                                05610000
CPUCUX1  EQU   CPUCUAV                                                  05611000
LOADPTR  EQU   EDITABLE+8                                               05612000
EDITNUM  EQU   EDITLOAD                                                 05613000
SHARECUB EQU   SHAREIO+5                                                05614000
SYSTEMP  EQU   SYSUM2+9                                                 05615000
SYSPERM  EQU   SYSUM2+7                                                 05616000
SYSDEV   EQU   SYSUM2+5                                                 05617000
SYSOLDA  EQU   SYSITEM                                                  05618000
SYS3705  EQU   SYSITEM                                                  05619000
SYSOLD   EQU   SYSCPUS                                                  05620000
SYSCPU   EQU   SYSCPUS                                                  05621000
SYSCUA   EQU   SYSRT                                                    05622000
SYSGROUP EQU   SYSUMKEY                                                 05623000
SYSUMEOD EQU   SYSUMONE+96                                              05624000
SYSUMPER EQU   SYSUMONE+92                                              05625000
SYSUMPEA EQU   SYSUMONE+88                                              05626000
SYSUMPEI EQU   SYSUMONE+84                                              05627000
SYSUMCH  EQU   SYSUMONE+20                                              05628000
SYSUMMCN EQU   SYSUMONE+16                                              05629000
SYSUMMCR EQU   SYSUMONE+12                                              05630000
SYSUMNXT EQU   SYSUMONE+8                                               05631000
SYSUMIPL EQU   SYSUMONE+4                                               05632000
SYSUMNUM EQU   SYSUMONE                                                 05633000
SORTCORE EQU   SORTCCHR                                                 05634000
SORTTIME EQU   SORTKEY+1                                                05635000
SORTYEAR EQU   SORTKEY                                                  05636000
EVLETTER EQU   EVKEY+5                                                  05637000
EVSERIAL EQU   EVKEY+2                                                  05638000
EVMODEL  EQU   EVKEY                                                    05639000
EVNUM    EQU   EVTABLE+4                                                05640000
EVDAY    EQU   EVSTOP+1                                                 05641000
EVYEAR   EQU   EVSTOP                                                   05642000
TRETMP   EQU   TREND2+10                                                05643000
TREPRM   EQU   TREND2+8                                                 05644000
TRENDDEV EQU   TREND2+6                                                 05645000
TRENDDAT EQU   TRENDKEY+5                                               05646000
TRENDOD  EQU   TRENDITM                                                 05647000
TREND037 EQU   TRENDITM                                                 05648000
TRENDOLD EQU   TRENCPUS                                                 05649000
TRENDCPU EQU   TRENCPUS                                                 05650000
@NM00011 EQU   TRENDRT+1                                                05651000
TRENDCUA EQU   TRENDRT                                                  05652000
TRENDGRP EQU   TRENDKEY                                                 05653000
TREPRE   EQU   TREGEN+72                                                05654000
TRECCHF  EQU   TREGEN+68                                                05655000
TRECCHE  EQU   TREGEN+64                                                05656000
TRECCHD  EQU   TREGEN+60                                                05657000
TRECCHC  EQU   TREGEN+56                                                05658000
TRECCHB  EQU   TREGEN+52                                                05659000
TRECCHA  EQU   TREGEN+48                                                05660000
TRECCH9  EQU   TREGEN+44                                                05661000
TRECCH8  EQU   TREGEN+40                                                05662000
TRECCH7  EQU   TREGEN+36                                                05663000
TRECCH6  EQU   TREGEN+32                                                05664000
TRECCH5  EQU   TREGEN+28                                                05665000
TRECCH4  EQU   TREGEN+24                                                05666000
TRECCH3  EQU   TREGEN+20                                                05667000
TRECCH2  EQU   TREGEN+16                                                05668000
TRECCH1  EQU   TREGEN+12                                                05669000
TREMCH   EQU   TREGEN+4                                                 05670000
TREIPL   EQU   TREGEN                                                   05671000
TRENUM   EQU   TRENDONE+4                                               05672000
TRENEXT  EQU   TRENDONE                                                 05673000
DUMPSIZE EQU   DUMPINFO+4                                               05674000
DUMPADR  EQU   DUMPINFO                                                 05675000
DUMPNUM  EQU   DUMPTABL                                                 05676000
@NM00010 EQU   PARM+212                                                 05677000
RECLNGT1 EQU   PARM+204                                                 05678000
FRAMEPTR EQU   PARM+200                                                 05679000
ADCPUT   EQU   PARM+144                                                 05680000
RECLNGTH EQU   CCHHRLNG+6                                               05681000
@NM00009 EQU   CCHHRLNG+5                                               05682000
RECCCHHR EQU   CCHHRLNG                                                 05683000
USERPGM  EQU   PARM+102                                                 05684000
IDTSEC   EQU   IDTIME+3                                                 05685000
IDSEC    EQU   IDTIME+2                                                 05686000
IDMIN    EQU   IDTIME+1                                                 05687000
IDHOUR   EQU   IDTIME                                                   05688000
@NM00008 EQU   ERRID+2                                                  05689000
NUMDAYS  EQU   PARM+88                                                  05690000
SORTNUM  EQU   PARM+84                                                  05691000
SYSRETRN EQU   @NM00007                                                 05692000
@NM00006 EQU   PARM+72                                                  05693000
EVSDAY   EQU   STRTDATE+1                                               05694000
EVSYEAR  EQU   STRTDATE                                                 05695000
PENSEC2  EQU   ENDTIME2+2                                               05696000
PENMIN2  EQU   ENDTIME2+1                                               05697000
PENHOUR2 EQU   ENDTIME2                                                 05698000
PSTSEC2  EQU   STTIME2+2                                                05699000
PSTMIN2  EQU   STTIME2+1                                                05700000
PSTHOUR2 EQU   STTIME2                                                  05701000
PENSEC1  EQU   ENDTIME1+2                                               05702000
PENMIN1  EQU   ENDTIME1+1                                               05703000
PENHOUR1 EQU   ENDTIME1                                                 05704000
PSTSEC1  EQU   STTIME1+2                                                05705000
PSTMIN1  EQU   STTIME1+1                                                05706000
PSTHOUR1 EQU   STTIME1                                                  05707000
@NM00005 EQU   ENDDT+4                                                  05708000
PENDY    EQU   PEND+1                                                   05709000
PENYR    EQU   PEND                                                     05710000
@NM00004 EQU   ENDDATE                                                  05711000
@NM00003 EQU   STDT+4                                                   05712000
PSTDY    EQU   PSTD+1                                                   05713000
PSTYR    EQU   PSTD                                                     05714000
@NM00002 EQU   STDATE                                                   05715000
@NM00001 EQU   DATENOW+3                                                05716000
CSNAP    EQU   CLOSEIO                                                  05717000
CDRCTWRK EQU   CLOSEIO                                                  05718000
CACCDEV  EQU   CLOSEIO                                                  05719000
CACCIN   EQU   CLOSEIO                                                  05720000
CSERLOG  EQU   CLOSEIO                                                  05721000
CEREPPT  EQU   CLOSEIO                                                  05722000
CTOURIST EQU   CLOSEIO                                                  05723000
OSNAP    EQU   OPENIO                                                   05724000
OTOURIST EQU   OPENIO                                                   05725000
PASSFLAG EQU   MISC                                                     05726000
PZERO    EQU   MISC                                                     05727000
DEBUG63  EQU   DEBUGA+3                                                 05728000
DEBUG62  EQU   DEBUGA+3                                                 05729000
DEBUG61  EQU   DEBUGA+3                                                 05730000
DEBUG60  EQU   DEBUGA+3                                                 05731000
DEBUG59  EQU   DEBUGA+3                                                 05732000
DEBUG58  EQU   DEBUGA+3                                                 05733000
DEBUG57  EQU   DEBUGA+3                                                 05734000
DEBUG56  EQU   DEBUGA+3                                                 05735000
DEBUG55  EQU   DEBUGA+2                                                 05736000
DEBUG54  EQU   DEBUGA+2                                                 05737000
DEBUG53  EQU   DEBUGA+2                                                 05738000
DEBUG52  EQU   DEBUGA+2                                                 05739000
DEBUG51  EQU   DEBUGA+2                                                 05740000
DEBUG50  EQU   DEBUGA+2                                                 05741000
DEBUG49  EQU   DEBUGA+2                                                 05742000
DEBUG48  EQU   DEBUGA+2                                                 05743000
DEBUG45  EQU   DEBUGA+1                                                 05744000
DEBUG44  EQU   DEBUGA+1                                                 05745000
DEBUG43  EQU   DEBUGA+1                                                 05746000
DEBUG42  EQU   DEBUGA+1                                                 05747000
DEBUG41  EQU   DEBUGA+1                                                 05748000
DEBUG40  EQU   DEBUGA+1                                                 05749000
DEBUG39  EQU   DEBUGA                                                   05750000
DEBUG38  EQU   DEBUGA                                                   05751000
DEBUG37  EQU   DEBUGA                                                   05752000
DEBUG36  EQU   DEBUGA                                                   05753000
DEBUG35  EQU   DEBUGA                                                   05754000
DEBUG34  EQU   DEBUGA                                                   05755000
DEBUG33  EQU   DEBUGA                                                   05756000
DEBUG32  EQU   DEBUGA                                                   05757000
DEBUG30  EQU   DEBUG+3                                                  05758000
DEBUG29  EQU   DEBUG+3                                                  05759000
DEBUG28  EQU   DEBUG+3                                                  05760000
DEBUG27  EQU   DEBUG+3                                                  05761000
DEBUG25  EQU   DEBUG+3                                                  05762000
DEBUG24  EQU   DEBUG+3                                                  05763000
DEBUG23  EQU   DEBUG+2                                                  05764000
DEBUG22  EQU   DEBUG+2                                                  05765000
DEBUG21  EQU   DEBUG+2                                                  05766000
DEBUG20  EQU   DEBUG+2                                                  05767000
DEBUG19  EQU   DEBUG+2                                                  05768000
DEBUG18  EQU   DEBUG+2                                                  05769000
DEBUG17  EQU   DEBUG+2                                                  05770000
DEBUG16  EQU   DEBUG+2                                                  05771000
DEBUG15  EQU   DEBUG+1                                                  05772000
DEBUG14  EQU   DEBUG+1                                                  05773000
DEBUG12  EQU   DEBUG+1                                                  05774000
DEBUG11  EQU   DEBUG+1                                                  05775000
DEBUG10  EQU   DEBUG+1                                                  05776000
DEBUG9   EQU   DEBUG+1                                                  05777000
DEBUG8   EQU   DEBUG+1                                                  05778000
DEBUG7   EQU   DEBUG                                                    05779000
DEBUG6   EQU   DEBUG                                                    05780000
DEBUG5   EQU   DEBUG                                                    05781000
DEBUG4   EQU   DEBUG                                                    05782000
DEBUG2   EQU   DEBUG                                                    05783000
DEBUG1   EQU   DEBUG                                                    05784000
DEBUG0   EQU   DEBUG                                                    05785000
SORTBRK  EQU   SWITCHES+1                                               05786000
COREFAIL EQU   SWITCHES+1                                               05787000
ANALYSIS EQU   SWITCHES+1                                               05788000
NOTALL   EQU   SWITCHES+1                                               05789000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      05790000
@RF00115 EQU   @EL00002                                                 05791000
@PB00014 EQU   @PB00015                                                 05792000
@RC00315 EQU   @EL00015                                                 05793000
@RC00350 EQU   @EL00015                                                 05794000
@RF00428 EQU   @RC00392                                                 05795000
@RF00459 EQU   @RC00431                                                 05796000
@RF00484 EQU   @RC00462                                                 05797000
@RF00515 EQU   @RC00487                                                 05798000
@RF00793 EQU   @RC00788                                                 05799000
@RF01055 EQU   @RC01035                                                 05800000
@PB00013 EQU   @PB00014                                                 05801000
@PB00012 EQU   @PB00013                                                 05802000
@PB00011 EQU   @PB00012                                                 05803000
@PB00010 EQU   @PB00011                                                 05804000
@PB00009 EQU   @PB00010                                                 05805000
@PB00008 EQU   @PB00009                                                 05806000
@PB00007 EQU   @PB00008                                                 05807000
@PB00006 EQU   @PB00007                                                 05808000
@PB00005 EQU   @PB00006                                                 05809000
@PB00004 EQU   @PB00005                                                 05810000
@PB00003 EQU   @PB00004                                                 05811000
@PB00002 EQU   @PB00003                                                 05812000
@ENDDATA EQU   *                                                        05813000
         END   IFCPARM2,(C'PLS1905',0701,78054)                         05814000
