         TITLE 'IFCPARM1-PARAMETER MODULE FOR EREP                     *00001000
                        '                                               00002000
IFCPARM1 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IFCPARM1  77.315'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @09,0                                               0001 00012000
@PSTART  LA    @10,4095(,@09)                                      0001 00013000
         LA    @11,4095(,@10)                                      0001 00014000
         LA    @12,4095(,@11)                                      0001 00015000
         USING @PSTART,@09                                         0001 00016000
         USING @PSTART+4095,@10                                    0001 00017000
         USING @PSTART+8190,@11                                    0001 00018000
         USING @PSTART+12285,@12                                   0001 00019000
         ST    @13,@SA00001+4                                      0001 00020000
         LA    @14,@SA00001                                        0001 00021000
         ST    @14,8(,@13)                                         0001 00022000
         LR    @13,@14                                             0001 00023000
         B     @PB00002                                            0098 00024000
DUPLICAT ST    @14,@SA00002                                        0098 00025000
         ST    @01,@SA00002+4                                      0098 00026000
*      CALL OUTMSG(DUPE);                                  /*@Z427VLS*/ 00027000
         LA    @01,@AL00099                                        0099 00028000
         BAL   @14,OUTMSG                                          0099 00029000
*      IF NEXTRPC = OFF THEN                                       0100 00030000
         TM    NEXTRPC,B'00000100'                                 0100 00031000
         BNZ   @RF00100                                            0100 00032000
*        DO;                                               /*@Z427VLS*/ 00033000
*          CALL SCANRP;                                    /*@Z427VLS*/ 00034000
         BAL   @14,SCANRP                                          0102 00035000
*          INDEX1 = INDEX1 + NEXTC + 1;                    /*@Z427VLS*/ 00036000
         LR    @08,INDEX1                                          0103 00037000
         AL    @08,NEXTC                                           0103 00038000
         AL    @08,@CF00055                                        0103 00039000
         LR    INDEX1,@08                                          0103 00040000
*        END;                                              /*@Z427VLS*/ 00041000
*      CALL SCANC;                                         /*@Z427VLS*/ 00042000
@RF00100 BAL   @14,SCANC                                           0105 00043000
*      INDEX1 = INDEX1 + NEXTC;                            /*@Z427VLS*/ 00044000
         AL    INDEX1,NEXTC                                        0106 00045000
*   END;                                                   /*@Z427VLS*/ 00046000
@EL00002 DS    0H                                                  0107 00047000
@EF00002 DS    0H                                                  0107 00048000
@ER00002 L     @14,@SA00002                                        0107 00049000
         L     @01,@SA00002+4                                      0107 00050000
         BR    @14                                                 0107 00051000
*/********************************************************************/ 00052000
*/*                                                          @Z427VLS*/ 00053000
*/*  OUTPUT AN ERROR MESSAGE.  THE FLAG BEING PASSED AS A PARAMETER  */ 00054000
*/*  INDICATES THE TYPE OF ERROR.  IF THE INPUT PARAMETER STRING HAS */ 00055000
*/*  NOT BEEN OUTPUT, A HEADING IS WRITTEN OUT AND THE PARAMETER     */ 00056000
*/*  STRING IS WRITTEN OUT.  THEN THE ERROR MESSAGE IS WRITTEN OUT   */ 00057000
*/*  WITH AN ASTERISK IN THE PLACE WHERE THE SCAN ROUTINE IS LOCATED.*/ 00058000
*/*  THIS SHOULD INDICATE THE LOCATION OF THE ERROR.         @Z427VLS*/ 00059000
*/********************************************************************/ 00060000
*OUTMSG:   PROC (ERROR) ;                                  /*@Z427VLS*/ 00061000
OUTMSG   STM   @14,@12,@SA00003                                    0108 00062000
         MVC   @PC00003(4),0(@01)                                  0108 00063000
*   DCL ERROR  FIXED(31);                                  /*@Z427VLS*/ 00064000
*  IF INDEX1 <= 100 THEN                                           0110 00065000
         C     INDEX1,@CF00422                                     0110 00066000
         BH    @RF00110                                            0110 00067000
*    DO;                                                   /*@Z427VLS*/ 00068000
*      INDEX1 = INDEX1 - PLACE;          /* LOCATION FOR ASTERISK    */ 00069000
         SL    INDEX1,PLACE                                        0112 00070000
*      IF ERROR = SYNTAX THEN                                      0113 00071000
         L     @08,@PC00003                                        0113 00072000
         CLC   ERROR(4,@08),@CF00055                               0113 00073000
         BNE   @RF00113                                            0113 00074000
*        CALL IFCMSG(65,ADDR(MSGNO));    /* SYNTAX ERROR     @Z427VLS*/ 00075000
         LA    @08,MSGNO                                           0114 00076000
         ST    @08,@AFTEMPS                                        0114 00077000
         L     @15,ADIFCMSG(,R2)                                   0114 00078000
         LA    @01,@AL00114                                        0114 00079000
         BALR  @14,@15                                             0114 00080000
*      IF ERROR = DUPE THEN                                        0115 00081000
@RF00113 L     @08,@PC00003                                        0115 00082000
         CLC   ERROR(4,@08),@CF00074                               0115 00083000
         BNE   @RF00115                                            0115 00084000
*        CALL IFCMSG(66,ADDR(MSGNO));    /* DUPLICATE ERROR  @Z427VLS*/ 00085000
         LA    @08,MSGNO                                           0116 00086000
         ST    @08,@AFTEMPS                                        0116 00087000
         L     @15,ADIFCMSG(,R2)                                   0116 00088000
         LA    @01,@AL00116                                        0116 00089000
         BALR  @14,@15                                             0116 00090000
*      PARMPRT(INDEX1) = STAR;           /* INSERT ASTERISK  @Z427VLS*/ 00091000
@RF00115 LA    @08,PARMPRT-1(INDEX1)                               0117 00092000
         MVI   0(@08),C'*'                                         0117 00093000
*      PRINTADR = ADDR(PARMPT);                            /*@Z427VLS*/ 00094000
         LA    @08,PARMPT                                          0118 00095000
         ST    @08,PRINTADR(,R2)                                   0118 00096000
*      CALL IOHND(RITEPRTR);                               /*@Z427VLS*/ 00097000
         L     @15,ADIOHND(,R2)                                    0119 00098000
         LA    @01,@AL00119                                        0119 00099000
         BALR  @14,@15                                             0119 00100000
*      RETCODE = TWELVE;                 /* SET RETURN CODE  @Z427VLS*/ 00101000
         MVC   RETCODE(4),@CF00036                                 0120 00102000
*      INDEX1 = INDEX1 + PLACE;          /* RESET INDEX1     @Z427VLS*/ 00103000
         AL    INDEX1,PLACE                                        0121 00104000
*    END;                                                  /*@Z427VLS*/ 00105000
*  PLACE = ZERO;                                           /*@Z427VLS*/ 00106000
@RF00110 SLR   @08,@08                                             0123 00107000
         ST    @08,PLACE                                           0123 00108000
*   END;                                                   /*@Z427VLS*/ 00109000
@EL00003 DS    0H                                                  0124 00110000
@EF00003 DS    0H                                                  0124 00111000
@ER00003 LM    @14,@12,@SA00003                                    0124 00112000
         BR    @14                                                 0124 00113000
*/********************************************************************/ 00114000
*/*                                                          @Z427VLS*/ 00115000
*/*  FIND THE SPECIFIED ENTRY IN THE PARAMETER FIELD IN THE DEVICE   */ 00116000
*/*  TABLE. THE DEVICE TABLE ENTRY IS THEN PLACED IN THE DEVICE      */ 00117000
*/*  SELECTION TABLE.                                        @Z427VLS*/ 00118000
*/*  THE DEVICE SPECIFICATION IS EITHER NNXX OR NNNN.        @Z427VLS*/ 00119000
*/*  MAXIMUM NUMBER OF ENTRIES IS 16.  CHECK THE PLM.        @Z427VLS*/ 00120000
*/*                                                          @Z427VLS*/ 00121000
*/********************************************************************/ 00122000
* FINDDEV: PROC OPTIONS(SAVE(1,14));                       /*@Z427VLS*/ 00123000
FINDDEV  ST    @14,@SA00004                                        0125 00124000
         ST    @01,@SA00004+4                                      0125 00125000
*    IF PARMFLD(INDEX1+2:INDEX1+3) = 'XX' THEN                     0126 00126000
         LA    @08,PARMFLD+1(INDEX1)                               0126 00127000
         CLC   0(2,@08),@CC00706                                   0126 00128000
         BNE   @RF00126                                            0126 00129000
*      DO;                                                 /*@Z427VLS*/ 00130000
*        /*                                                  @Z427VLS*/ 00131000
*        /* CHECK FOR THE DEVICE LEADING TWO CHARACTERS IN THE OBR   */ 00132000
*        /* DEVICE TABLE.  IF IT IS FOUND, THEN CHECK TO SEE IF THE  */ 00133000
*        /* DEVICE WAS SPECIFIED PREVIOUSLY.  IF YES, IT IS AN ERROR.*/ 00134000
*        /* IF NOT, ENTER THE DEVICE CLASS/TYPE INTO DEVICE  @Z427VLS*/ 00135000
*        /* SELECTION TABLE.  CLEAR THE DEVICE CLASS/TYPE FROM       */ 00136000
*        /* DEVTABLE.                                        @Z427VLS*/ 00137000
*        /*                                                  @Z427VLS*/ 00138000
*      J = ZERO;                                           /*@G51DGVS*/ 00139000
         SLR   J,J                                                 0128 00140000
*      DO WHILE (J < EIGHT);                               /*@G51DGVS*/ 00141000
         B     @DE00129                                            0129 00142000
@DL00129 DS    0H                                                  0130 00143000
*        RESPECIFY (R15) RESTRICTED;                       /*@G51DGVS*/ 00144000
*        CALL IFCDEVIC(5,PARMFLD(INDEX1),HOLDAREA);        /*@G51DGVS*/ 00145000
         MVC   @AL00001(12),@AL00131                               0131 00146000
         LA    @14,PARMFLD-1(INDEX1)                               0131 00147000
         ST    @14,@AL00001+4                                      0131 00148000
         L     @15,@CV00621                                        0131 00149000
         LA    @01,@AL00001                                        0131 00150000
         BALR  @14,@15                                             0131 00151000
*        J = R15;                                          /*@G51DGVS*/ 00152000
         LR    J,R15                                               0132 00153000
*        RESPECIFY (R15) UNRESTRICTED;                     /*@G51DGVS*/ 00154000
*        IF J = ZERO THEN                                          0134 00155000
         LTR   J,J                                                 0134 00156000
         BNZ   @RF00134                                            0134 00157000
*          DO;                                             /*@G51DGVS*/ 00158000
*            IF INDEX2 < DIM(DEVVAL) THEN                          0136 00159000
         L     @08,INDEX2                                          0136 00160000
         C     @08,@CF00422                                        0136 00161000
         BNL   @RF00136                                            0136 00162000
*              INDEX2 = INDEX2 + ONE;                      /*@G51DGVS*/ 00163000
         AL    @08,@CF00055                                        0137 00164000
         ST    @08,INDEX2                                          0137 00165000
*            ELSE                                                  0138 00166000
*              CALL OUTMSG(SYNTAX);                        /*@G51DGVS*/ 00167000
         B     @RC00136                                            0138 00168000
@RF00136 LA    @01,@AL00138                                        0138 00169000
         BAL   @14,OUTMSG                                          0138 00170000
*            DEVVAL(INDEX2) = HOLDAREA(1:2);               /*@G51DGVS*/ 00171000
@RC00136 L     @08,INDEX2                                          0139 00172000
         ALR   @08,@08                                             0139 00173000
         L     @03,DEVPTR(,R2)                                     0139 00174000
         ALR   @03,@08                                             0139 00175000
         MVC   DEVVAL-2(2,@03),HOLDAREA                            0139 00176000
*            FOUND = ON;                                   /*@G51DGVS*/ 00177000
         OI    FOUND,B'00010000'                                   0140 00178000
*          END;                                            /*@G51DGVS*/ 00179000
*        ELSE                                                      0142 00180000
*          IF J = FOUR THEN                                        0142 00181000
         B     @RC00134                                            0142 00182000
@RF00134 C     J,@CF00064                                          0142 00183000
         BNE   @RF00142                                            0142 00184000
*            DO;                                           /*@G51DGVS*/ 00185000
*              CALL OUTMSG(DUPE);                          /*@G51DGVS*/ 00186000
         LA    @01,@AL00144                                        0144 00187000
         BAL   @14,OUTMSG                                          0144 00188000
*              FOUND = ON;                                 /*@G51DGVS*/ 00189000
         OI    FOUND,B'00010000'                                   0145 00190000
*            END;                                          /*@G51DGVS*/ 00191000
*      END;                                                /*@G51DGVS*/ 00192000
@RF00142 DS    0H                                                  0147 00193000
@RC00134 DS    0H                                                  0147 00194000
@DE00129 C     J,@CF00066                                          0147 00195000
         BL    @DL00129                                            0147 00196000
*        /*                                                  @Z427VLS*/ 00197000
*        /* CHECK FOR THE DEVICE LEADING TWO CHARACTERS IN THE MDR   */ 00198000
*        /* DEVICE TABLE.  IF IT IS FOUND, THEN CHECK TO SEE IF THE  */ 00199000
*        /* DEVICE WAS SPECIFIED PREVIOUSLY.  IF YES, IT IS AN ERROR.*/ 00200000
*        /* IF NOT, ENTER THE DEVICE CLASS/TYPE INTO DEVICE  @Z427VLS*/ 00201000
*        /* SELECTION TABLE.  CLEAR THE DEVICE CLASS/TYPE FROM       */ 00202000
*        /* DEVTABLE.                                        @Z427VLS*/ 00203000
*        /*                                                  @Z427VLS*/ 00204000
*      J = ZERO;                                           /*@G51DGVS*/ 00205000
         SLR   J,J                                                 0148 00206000
*      DO WHILE (J < EIGHT);                               /*@G51DGVS*/ 00207000
         B     @DE00149                                            0149 00208000
@DL00149 DS    0H                                                  0150 00209000
*        RESPECIFY (R15) RESTRICTED;                       /*@G51DGVS*/ 00210000
*        CALL IFCDEVIC(15,PARMFLD(INDEX1),HOLDAREA);       /*@G51DGVS*/ 00211000
         MVC   @AL00001(12),@AL00151                               0151 00212000
         LA    @14,PARMFLD-1(INDEX1)                               0151 00213000
         ST    @14,@AL00001+4                                      0151 00214000
         L     @15,@CV00621                                        0151 00215000
         LA    @01,@AL00001                                        0151 00216000
         BALR  @14,@15                                             0151 00217000
*        J = R15;                                          /*@G51DGVS*/ 00218000
         LR    J,R15                                               0152 00219000
*        RESPECIFY (R15) UNRESTRICTED;                     /*@G51DGVS*/ 00220000
*        IF J = ZERO THEN                                          0154 00221000
         LTR   J,J                                                 0154 00222000
         BNZ   @RF00154                                            0154 00223000
*          DO;                                             /*@G51DGVS*/ 00224000
*            IF INDEX3 < DIM(MDRVAL) THEN                          0156 00225000
         L     @08,INDEX3                                          0156 00226000
         C     @08,@CF00293                                        0156 00227000
         BNL   @RF00156                                            0156 00228000
*              INDEX3 = INDEX3 + ONE;                      /*@G51DGVS*/ 00229000
         AL    @08,@CF00055                                        0157 00230000
         ST    @08,INDEX3                                          0157 00231000
*            ELSE                                                  0158 00232000
*              CALL OUTMSG(SYNTAX);                        /*@G51DGVS*/ 00233000
         B     @RC00156                                            0158 00234000
@RF00156 LA    @01,@AL00158                                        0158 00235000
         BAL   @14,OUTMSG                                          0158 00236000
*            MDRVAL(INDEX3) = HOLDAREA(1:2);               /*@G51DGVS*/ 00237000
@RC00156 L     @08,DEVPTR(,R2)                                     0159 00238000
         AL    @08,INDEX3                                          0159 00239000
         MVC   MDRVAL-1(1,@08),HOLDAREA                            0159 00240000
*            FOUND = ON;                                   /*@G51DGVS*/ 00241000
         OI    FOUND,B'00010000'                                   0160 00242000
*          END;                                            /*@G51DGVS*/ 00243000
*        ELSE                                                      0162 00244000
*          IF J = FOUR THEN                                        0162 00245000
         B     @RC00154                                            0162 00246000
@RF00154 C     J,@CF00064                                          0162 00247000
         BNE   @RF00162                                            0162 00248000
*            DO;                                           /*@G51DGVS*/ 00249000
*              CALL OUTMSG(DUPE);                          /*@G51DGVS*/ 00250000
         LA    @01,@AL00164                                        0164 00251000
         BAL   @14,OUTMSG                                          0164 00252000
*              FOUND = ON;                                 /*@G51DGVS*/ 00253000
         OI    FOUND,B'00010000'                                   0165 00254000
*            END;                                          /*@G51DGVS*/ 00255000
*      END;                                                /*@G51DGVS*/ 00256000
@RF00162 DS    0H                                                  0167 00257000
@RC00154 DS    0H                                                  0167 00258000
@DE00149 C     J,@CF00066                                          0167 00259000
         BL    @DL00149                                            0167 00260000
*      END;                                                /*@Z427VLS*/ 00261000
*    ELSE                                                          0169 00262000
*      DO;                                                 /*@Z427VLS*/ 00263000
         B     @RC00126                                            0169 00264000
@RF00126 DS    0H                                                  0170 00265000
*        /*                                                  @Z427VLS*/ 00266000
*        /* CHECK FOR THE FOUR DEVICE CHARACTERS IN THE OBR  @Z427VLS*/ 00267000
*        /* DEVICE TABLE.  IF IT IS FOUND, THEN CHECK TO SEE IF THE  */ 00268000
*        /* DEVICE WAS SPECIFIED PREVIOUSLY.  IF YES, IT IS AN ERROR.*/ 00269000
*        /* IF NOT, ENTER THE DEVICE CLASS/TYPE INTO DEVICE  @Z427VLS*/ 00270000
*        /* SELECTION TABLE.  CLEAR THE DEVICE CLASS/TYPE FROM       */ 00271000
*        /* DEVTABLE.                                        @Z427VLS*/ 00272000
*        /*                                                  @Z427VLS*/ 00273000
*     J = ZERO;                                            /*@G51DGVS*/ 00274000
         SLR   J,J                                                 0170 00275000
*     AVALIDEV = OFF;                                      /*@G51DGVS*/ 00276000
         NI    AVALIDEV,B'11111101'                                0171 00277000
*     DO WHILE(J < FOUR);                                  /*@G51DGVS*/ 00278000
         B     @DE00172                                            0172 00279000
@DL00172 DS    0H                                                  0173 00280000
*      RESPECIFY (R15) RESTRICTED;                         /*@G51DGVS*/ 00281000
*      CALL IFCDEVIC (1,PARMFLD(INDEX1),HOLDAREA);         /*@G51DGVS*/ 00282000
         MVC   @AL00001(12),@AL00174                               0174 00283000
         LA    @14,PARMFLD-1(INDEX1)                               0174 00284000
         ST    @14,@AL00001+4                                      0174 00285000
         L     @15,@CV00621                                        0174 00286000
         LA    @01,@AL00001                                        0174 00287000
         BALR  @14,@15                                             0174 00288000
*      J = R15;                                            /*@G51DGVS*/ 00289000
         LR    J,R15                                               0175 00290000
*      RESPECIFY (R15) UNRESTRICTED;                       /*@G51DGVS*/ 00291000
*      IF J = ZERO THEN                                            0177 00292000
         LTR   J,J                                                 0177 00293000
         BNZ   @RF00177                                            0177 00294000
*        DO;                                               /*@G51DGVS*/ 00295000
*          IF INDEX2 < DIM(DEVVAL) THEN                            0179 00296000
         L     @08,INDEX2                                          0179 00297000
         C     @08,@CF00422                                        0179 00298000
         BNL   @RF00179                                            0179 00299000
*            INDEX2 = INDEX2 + 1;                          /*@G51DGVS*/ 00300000
         AL    @08,@CF00055                                        0180 00301000
         ST    @08,INDEX2                                          0180 00302000
*          ELSE                                                    0181 00303000
*            CALL OUTMSG(SYNTAX);                          /*@G51DGVS*/ 00304000
         B     @RC00179                                            0181 00305000
@RF00179 LA    @01,@AL00181                                        0181 00306000
         BAL   @14,OUTMSG                                          0181 00307000
*          DEVVAL(INDEX2) = HOLDAREA(1:2);                 /*@G51DGVS*/ 00308000
@RC00179 L     @08,INDEX2                                          0182 00309000
         ALR   @08,@08                                             0182 00310000
         L     @03,DEVPTR(,R2)                                     0182 00311000
         ALR   @03,@08                                             0182 00312000
         MVC   DEVVAL-2(2,@03),HOLDAREA                            0182 00313000
*          AVALIDEV = ON;                                  /*@G51DGVS*/ 00314000
*          FOUND = ON;                                     /*@G51DGVS*/ 00315000
         OI    AVALIDEV,B'00010010'                                0184 00316000
*        END;                                              /*@G51DGVS*/ 00317000
*      ELSE                                                        0186 00318000
*        IF J = FOUR & AVALIDEV = OFF THEN                         0186 00319000
         B     @RC00177                                            0186 00320000
@RF00177 C     J,@CF00064                                          0186 00321000
         BNE   @RF00186                                            0186 00322000
         TM    AVALIDEV,B'00000010'                                0186 00323000
         BNZ   @RF00186                                            0186 00324000
*          DO;                                             /*@G51DGVS*/ 00325000
*            CALL OUTMSG(DUPE);                            /*@G51DGVS*/ 00326000
         LA    @01,@AL00188                                        0188 00327000
         BAL   @14,OUTMSG                                          0188 00328000
*            FOUND = ON;                                   /*@G51DGVS*/ 00329000
         OI    FOUND,B'00010000'                                   0189 00330000
*          END;                                            /*@G51DGVS*/ 00331000
*     END;                                                 /*@G51DGVS*/ 00332000
@RF00186 DS    0H                                                  0191 00333000
@RC00177 DS    0H                                                  0191 00334000
@DE00172 C     J,@CF00064                                          0191 00335000
         BL    @DL00172                                            0191 00336000
*        /*                                                  @Z427VLS*/ 00337000
*        /* CHECK FOR THE FOUR DEVICE CHARACTERS IN THE MDR  @Z427VLS*/ 00338000
*        /* DEVICE TABLE.  IF IT IS FOUND, THEN CHECK TO SEE IF THE  */ 00339000
*        /* DEVICE WAS SPECIFIED PREVIOUSLY.  IF YES, IT IS AN ERROR.*/ 00340000
*     AVALIDEV = OFF;                                      /*@G51DGVS*/ 00341000
         NI    AVALIDEV,B'11111101'                                0192 00342000
*     J = ZERO;                                            /*@G51DGVS*/ 00343000
         SLR   J,J                                                 0193 00344000
*     DO WHILE(J < FOUR);                                  /*@G51DGVS*/ 00345000
         B     @DE00194                                            0194 00346000
@DL00194 DS    0H                                                  0195 00347000
*      RESPECIFY (R15) RESTRICTED;                         /*@G51DGVS*/ 00348000
*      CALL IFCDEVIC (11,PARMFLD(INDEX1),HOLDAREA);        /*@G51DGVS*/ 00349000
         MVC   @AL00001(12),@AL00196                               0196 00350000
         LA    @14,PARMFLD-1(INDEX1)                               0196 00351000
         ST    @14,@AL00001+4                                      0196 00352000
         L     @15,@CV00621                                        0196 00353000
         LA    @01,@AL00001                                        0196 00354000
         BALR  @14,@15                                             0196 00355000
*      J = R15;                                            /*@G51DGVS*/ 00356000
         LR    J,R15                                               0197 00357000
*      RESPECIFY (R15) UNRESTRICTED;                       /*@G51DGVS*/ 00358000
*      IF J = ZERO THEN                                            0199 00359000
         LTR   J,J                                                 0199 00360000
         BNZ   @RF00199                                            0199 00361000
*        DO;                                               /*@G51DGVS*/ 00362000
*          IF INDEX3 < DIM(MDRVAL) THEN                            0201 00363000
         L     @08,INDEX3                                          0201 00364000
         C     @08,@CF00293                                        0201 00365000
         BNL   @RF00201                                            0201 00366000
*            INDEX3 = INDEX3 + 1;                          /*@G51DGVS*/ 00367000
         AL    @08,@CF00055                                        0202 00368000
         ST    @08,INDEX3                                          0202 00369000
*          ELSE                                                    0203 00370000
*            CALL OUTMSG(SYNTAX);                          /*@G51DGVS*/ 00371000
         B     @RC00201                                            0203 00372000
@RF00201 LA    @01,@AL00203                                        0203 00373000
         BAL   @14,OUTMSG                                          0203 00374000
*          MDRVAL(INDEX3) = HOLDAREA(1);                   /*@G51DGVS*/ 00375000
@RC00201 L     @08,DEVPTR(,R2)                                     0204 00376000
         AL    @08,INDEX3                                          0204 00377000
         MVC   MDRVAL-1(1,@08),HOLDAREA                            0204 00378000
*          FOUND = ON;                                     /*@G51DGVS*/ 00379000
*          AVALIDEV = ON;                                  /*@G51DGVS*/ 00380000
         OI    FOUND,B'00010010'                                   0206 00381000
*        END;                                              /*@G51DGVS*/ 00382000
*      ELSE                                                        0208 00383000
*        IF J = FOUR & AVALIDEV = OFF THEN                         0208 00384000
         B     @RC00199                                            0208 00385000
@RF00199 C     J,@CF00064                                          0208 00386000
         BNE   @RF00208                                            0208 00387000
         TM    AVALIDEV,B'00000010'                                0208 00388000
         BNZ   @RF00208                                            0208 00389000
*          DO;                                             /*@G51DGVS*/ 00390000
*            CALL OUTMSG(DUPE);                            /*@G51DGVS*/ 00391000
         LA    @01,@AL00210                                        0210 00392000
         BAL   @14,OUTMSG                                          0210 00393000
*            FOUND = ON;                                   /*@G51DGVS*/ 00394000
         OI    FOUND,B'00010000'                                   0211 00395000
*          END;                                            /*@G51DGVS*/ 00396000
*     END;                                                 /*@G51DGVS*/ 00397000
@RF00208 DS    0H                                                  0213 00398000
@RC00199 DS    0H                                                  0213 00399000
@DE00194 C     J,@CF00064                                          0213 00400000
         BL    @DL00194                                            0213 00401000
*      END;                                                /*@Z427VLS*/ 00402000
*    IF FOUND = OFF THEN                                           0215 00403000
@RC00126 TM    FOUND,B'00010000'                                   0215 00404000
         BNZ   @RF00215                                            0215 00405000
*      CALL OUTMSG(SYNTAX);               /* DEVICE NOT VALID.       */ 00406000
         LA    @01,@AL00216                                        0216 00407000
         BAL   @14,OUTMSG                                          0216 00408000
*    INDEX1 = INDEX1 + 5;                 /* INCR TO NEXT OPERAND    */ 00409000
@RF00215 AL    INDEX1,@CF00079                                     0217 00410000
* END;                                                     /*@Z427VLS*/ 00411000
@EL00004 DS    0H                                                  0218 00412000
@EF00004 DS    0H                                                  0218 00413000
@ER00004 L     @14,@SA00004                                        0218 00414000
         L     @01,@SA00004+4                                      0218 00415000
         BR    @14                                                 0218 00416000
*/********************************************************************/ 00417000
*/*                                                          @Z427VLS*/ 00418000
*/*  VALID THE FIELD STARTING AT PARMFLD(INDEX1) FOR A LENGTH AS     */ 00419000
*/*  GIVEN AS THE INPUT PARAMETER.  IF A CHARACTER IS NOT FOUND TO   */ 00420000
*/*  BE A VALID HEX, THE FIELD IS INDICATED AS HAVING A SYNTAX       */ 00421000
*/*  ERROR.  THE CONTENTS OF THE ORIGINAL FIELD ARE CHANGED TO THE   */ 00422000
*/*  HEXADECIMAL EQUIVALENT FOR THE CHARACTER.  THOSE VALUES CAN THEN*/ 00423000
*/*  BE EASILY CONVERTED FOR THE NECESSARY FIELD.            @Z427VLS*/ 00424000
*/*                                                          @Z427VLS*/ 00425000
*/********************************************************************/ 00426000
* VALIDHEX: PROC (LENGTHH) ;                               /*@Z427VLS*/ 00427000
VALIDHEX STM   @14,@12,@SA00005                                    0219 00428000
         MVC   @PC00005(4),0(@01)                                  0219 00429000
*    DCL LENGTHH FIXED(31);               /* LENGTH OF THE INPUT FLD */ 00430000
*    I = INDEX1 + LENGTHH - 1;            /* LAST CHARACTER POSITION */ 00431000
         L     @08,@PC00005                                        0221 00432000
         LR    I,INDEX1                                            0221 00433000
         AL    I,LENGTHH(,@08)                                     0221 00434000
         BCTR  I,0                                                 0221 00435000
*    DO INDEX3 = INDEX1 TO I BY 1;        /* STEP THROUGH FIELD      */ 00436000
         LR    @08,INDEX1                                          0222 00437000
         ST    @08,INDEX3                                          0222 00438000
         B     @DE00222                                            0222 00439000
@DL00222 DS    0H                                                  0223 00440000
*      VALID = OFF;                                        /*@Z427VLS*/ 00441000
         NI    VALID,B'01111111'                                   0223 00442000
*      /*                                                    @Z427VLS*/ 00443000
*      /* CHECK TO SEE IF THE FIELD IS A VALID HEXADECIMAL NUMBER.   */ 00444000
*      /* IF YES, TERMINATE THE SEARCH, AND PLACE THE HEX EQUIVALENT */ 00445000
*      /* OF THE CHARACTER IN THE PARAMETER FIELD. IF NO, PRINT      */ 00446000
*      /* AN ERROR MESSAGE FOR THAT OPERAND.                 @Z427VLS*/ 00447000
*      /*                                                    @Z427VLS*/ 00448000
*      DO J = 16 TO 1 BY -1 WHILE (VALID = OFF);           /*@Z427VLS*/ 00449000
         LA    J,16                                                0224 00450000
@DL00224 TM    VALID,B'10000000'                                   0224 00451000
         BNZ   @DC00224                                            0224 00452000
*        IF PARMFLD(INDEX3) = NUMTAB(J) THEN                       0225 00453000
         L     @08,INDEX3                                          0225 00454000
         LA    @07,PARMFLD-1(@08)                                  0225 00455000
         LA    @03,NUMTAB-1(J)                                     0225 00456000
         CLC   0(1,@07),0(@03)                                     0225 00457000
         BNE   @RF00225                                            0225 00458000
*          DO;                                             /*@Z427VLS*/ 00459000
*            VALID = ON;                                   /*@Z427VLS*/ 00460000
         OI    VALID,B'10000000'                                   0227 00461000
*            PARMFLD(INDEX3) = HEXTAB(J);                  /*@Z427VLS*/ 00462000
         LA    @07,PARMFLD-1(@08)                                  0228 00463000
         LA    @08,HEXTAB-1(J)                                     0228 00464000
         MVC   0(1,@07),0(@08)                                     0228 00465000
*          END;                                            /*@Z427VLS*/ 00466000
*      END;                                                /*@Z427VLS*/ 00467000
@RF00225 BCTR  J,0                                                 0230 00468000
         LTR   J,J                                                 0230 00469000
         BP    @DL00224                                            0230 00470000
@DC00224 DS    0H                                                  0231 00471000
*      IF VALID = OFF THEN                                         0231 00472000
         TM    VALID,B'10000000'                                   0231 00473000
         BNZ   @RF00231                                            0231 00474000
*        DO PLACE = INDEX1 - INDEX3;                       /*@Z427VLS*/ 00475000
         LR    @08,INDEX1                                          0232 00476000
         SL    @08,INDEX3                                          0232 00477000
         ST    @08,PLACE                                           0232 00478000
*          CALL OUTMSG(SYNTAX);                            /*@Z427VLS*/ 00479000
         LA    @01,@AL00233                                        0233 00480000
         BAL   @14,OUTMSG                                          0233 00481000
*        END;                                              /*@Z427VLS*/ 00482000
*    END;                                                  /*@Z427VLS*/ 00483000
@RF00231 LA    @08,1                                               0235 00484000
         AL    @08,INDEX3                                          0235 00485000
         ST    @08,INDEX3                                          0235 00486000
@DE00222 CR    @08,I                                               0235 00487000
         BNH   @DL00222                                            0235 00488000
* END;                                                     /*@Z427VLS*/ 00489000
@EL00005 DS    0H                                                  0236 00490000
@EF00005 DS    0H                                                  0236 00491000
@ER00005 LM    @14,@12,@SA00005                                    0236 00492000
         BR    @14                                                 0236 00493000
*/********************************************************************/ 00494000
*/*                                                          @Z427VLS*/ 00495000
*/*  VALID THE FIELD STARTING AT PARMFLD(INDEX1) FOR A LENGTH AS     */ 00496000
*/*  GIVEN AS THE INPUT PARAMETER.  IF A CHARACTER IS NOT FOUND TO   */ 00497000
*/*  BE A VALID NUMERIC, THE FIELD IS INDICATED AS HAVING A SYNTAX   */ 00498000
*/*  ERROR.  THE CONTENTS OF THE ORIGINAL FIELD ARE CHANGED TO THE   */ 00499000
*/*  HEXADECIMAL EQUIVALENT FOR THE CHARACTER.  THOSE VALUES CAN THEN*/ 00500000
*/*  BE EASILY CONVERTED FOR THE NECESSARY FIELD.            @Z427VLS*/ 00501000
*/*                                                          @Z427VLS*/ 00502000
*/********************************************************************/ 00503000
* VALIDNUM: PROC (LENGTHV) ;                               /*@Z427VLS*/ 00504000
VALIDNUM STM   @14,@12,@SA00006                                    0237 00505000
         MVC   @PC00006(4),0(@01)                                  0237 00506000
*    DCL LENGTHV FIXED(31);               /* LENGTH OF THE INPUT FLD */ 00507000
*    I = INDEX1 + LENGTHV - 1;            /* LAST CHARACTER POSITION */ 00508000
         L     @08,@PC00006                                        0239 00509000
         LR    I,INDEX1                                            0239 00510000
         AL    I,LENGTHV(,@08)                                     0239 00511000
         BCTR  I,0                                                 0239 00512000
*    DO INDEX3 = INDEX1 TO I BY 1;                         /*@Z427VLS*/ 00513000
         LR    @08,INDEX1                                          0240 00514000
         ST    @08,INDEX3                                          0240 00515000
         B     @DE00240                                            0240 00516000
@DL00240 DS    0H                                                  0241 00517000
*      VALID = OFF;                                        /*@Z427VLS*/ 00518000
         NI    VALID,B'01111111'                                   0241 00519000
*      /*                                                    @Z427VLS*/ 00520000
*      /* CHECK TO SEE IF THE FIELD IS A VALID DECIMAL NUMBER.  IF   */ 00521000
*      /* YES, TERMINATE THE SEARCH AND REPLACE THE CHARACTER WITH   */ 00522000
*      /* HEXADECIMAL EQUIVALENT.  IF NO, PRINT AN ERROR MESSAGE FOR */ 00523000
*      /* THIS OPERAND.                                      @Z427VLS*/ 00524000
*      /*                                                    @Z427VLS*/ 00525000
*      DO J = 10 TO 1 BY -1 WHILE (VALID = OFF);           /*@Z427VLS*/ 00526000
         LA    J,10                                                0242 00527000
@DL00242 TM    VALID,B'10000000'                                   0242 00528000
         BNZ   @DC00242                                            0242 00529000
*        IF PARMFLD(INDEX3) = NUMTAB(J) THEN                       0243 00530000
         L     @08,INDEX3                                          0243 00531000
         LA    @07,PARMFLD-1(@08)                                  0243 00532000
         LA    @03,NUMTAB-1(J)                                     0243 00533000
         CLC   0(1,@07),0(@03)                                     0243 00534000
         BNE   @RF00243                                            0243 00535000
*          DO;                                             /*@Z427VLS*/ 00536000
*            VALID = ON;                                   /*@Z427VLS*/ 00537000
         OI    VALID,B'10000000'                                   0245 00538000
*            PARMFLD(INDEX3) = HEXTAB(J);                  /*@Z427VLS*/ 00539000
         LA    @07,PARMFLD-1(@08)                                  0246 00540000
         LA    @08,HEXTAB-1(J)                                     0246 00541000
         MVC   0(1,@07),0(@08)                                     0246 00542000
*          END;                                            /*@Z427VLS*/ 00543000
*      END;                                                /*@Z427VLS*/ 00544000
@RF00243 BCTR  J,0                                                 0248 00545000
         LTR   J,J                                                 0248 00546000
         BP    @DL00242                                            0248 00547000
@DC00242 DS    0H                                                  0249 00548000
*      IF VALID = OFF THEN                                         0249 00549000
         TM    VALID,B'10000000'                                   0249 00550000
         BNZ   @RF00249                                            0249 00551000
*        DO PLACE = INDEX1 - INDEX3;                       /*@Z427VLS*/ 00552000
         LR    @08,INDEX1                                          0250 00553000
         SL    @08,INDEX3                                          0250 00554000
         ST    @08,PLACE                                           0250 00555000
*          CALL OUTMSG(SYNTAX);                            /*@Z427VLS*/ 00556000
         LA    @01,@AL00251                                        0251 00557000
         BAL   @14,OUTMSG                                          0251 00558000
*        END;                                              /*@Z427VLS*/ 00559000
*    END;                                                  /*@Z427VLS*/ 00560000
@RF00249 LA    @08,1                                               0253 00561000
         AL    @08,INDEX3                                          0253 00562000
         ST    @08,INDEX3                                          0253 00563000
@DE00240 CR    @08,I                                               0253 00564000
         BNH   @DL00240                                            0253 00565000
* END;                                                     /*@Z427VLS*/ 00566000
@EL00006 DS    0H                                                  0254 00567000
@EF00006 DS    0H                                                  0254 00568000
@ER00006 LM    @14,@12,@SA00006                                    0254 00569000
         BR    @14                                                 0254 00570000
*/********************************************************************/ 00571000
*/*                                                          @Z427VLS*/ 00572000
*/*  SCAN THE PARAMETER FIELD FOR THE NEXT COMMA.  THE START OF THE  */ 00573000
*/*  SCAN IS INDICATED BY THE VALUE OF INDEX1.  THE NUMBER OF        */ 00574000
*/*  CHARACTERS FOUND IS PLACED IN NEXTC.                    @Z427VLS*/ 00575000
*/*                                                          @Z427VLS*/ 00576000
*/********************************************************************/ 00577000
*SCANC:   PROC OPTIONS(SAVE(1,14));                        /*@Z427VLS*/ 00578000
SCANC    ST    @14,12(,@13)                                        0255 00579000
         ST    @01,24(,@13)                                        0255 00580000
*    RPORC = ON;                                           /*@Z427VLS*/ 00581000
         OI    RPORC,B'10000000'                                   0256 00582000
*    DO NEXTC = INDEX1 BY 1 WHILE (PARMFLD(NEXTC) ^= COMMA);       0257 00583000
         LR    @08,INDEX1                                          0257 00584000
         ST    @08,NEXTC                                           0257 00585000
         B     @DE00257                                            0257 00586000
@DL00257 DS    0H                                                  0258 00587000
*    END;                                                  /*@Z427VLS*/ 00588000
         LA    @08,1                                               0258 00589000
         AL    @08,NEXTC                                           0258 00590000
         ST    @08,NEXTC                                           0258 00591000
@DE00257 L     @08,NEXTC                                           0258 00592000
         LA    @04,PARMFLD-1(@08)                                  0258 00593000
         CLI   0(@04),C','                                         0258 00594000
         BNE   @DL00257                                            0258 00595000
*    NEXTC = NEXTC - INDEX1;                               /*@Z427VLS*/ 00596000
         SLR   @08,INDEX1                                          0259 00597000
         ST    @08,NEXTC                                           0259 00598000
*END;                                                      /*@Z427VLS*/ 00599000
@EL00007 DS    0H                                                  0260 00600000
@EF00007 DS    0H                                                  0260 00601000
@ER00007 L     @14,12(,@13)                                        0260 00602000
         L     @01,24(,@13)                                        0260 00603000
         BR    @14                                                 0260 00604000
*/********************************************************************/ 00605000
*/*                                                          @Z427VLS*/ 00606000
*/*  SCAN THE PARAMETER FIELD FOR THE NEXT RIGHT PARENTHESIS.  THE   */ 00607000
*/*  START OF THE SCAN IS INDICATED BY THE VALUE OF INDEX1.  THE     */ 00608000
*/*  NUMBER OF CHARACTERS FOUND IS PLACED IN NEXTC.          @Z427VLS*/ 00609000
*/*                                                          @Z427VLS*/ 00610000
*/********************************************************************/ 00611000
*SCANRP:  PROC OPTIONS(SAVE(1,14));                        /*@Z427VLS*/ 00612000
SCANRP   ST    @14,12(,@13)                                        0261 00613000
         ST    @01,24(,@13)                                        0261 00614000
*    RPORC = OFF;                                          /*@Z427VLS*/ 00615000
         NI    RPORC,B'01111111'                                   0262 00616000
*    DO NEXTC = INDEX1 BY 1 WHILE (PARMFLD(NEXTC) ^= RPAREN);      0263 00617000
         LR    @08,INDEX1                                          0263 00618000
         ST    @08,NEXTC                                           0263 00619000
         B     @DE00263                                            0263 00620000
@DL00263 DS    0H                                                  0264 00621000
*    END;                                                  /*@Z427VLS*/ 00622000
         LA    @08,1                                               0264 00623000
         AL    @08,NEXTC                                           0264 00624000
         ST    @08,NEXTC                                           0264 00625000
@DE00263 L     @08,NEXTC                                           0264 00626000
         LA    @04,PARMFLD-1(@08)                                  0264 00627000
         CLI   0(@04),C')'                                         0264 00628000
         BNE   @DL00263                                            0264 00629000
*    NEXTC = NEXTC - INDEX1;                               /*@Z427VLS*/ 00630000
         SLR   @08,INDEX1                                          0265 00631000
         ST    @08,NEXTC                                           0265 00632000
*END;                                                      /*@Z427VLS*/ 00633000
@EL00008 DS    0H                                                  0266 00634000
@EF00008 DS    0H                                                  0266 00635000
@ER00008 L     @14,12(,@13)                                        0266 00636000
         L     @01,24(,@13)                                        0266 00637000
         BR    @14                                                 0266 00638000
*/********************************************************************/ 00639000
*/*                                                          @Z427VLS*/ 00640000
*/*  SCAN THE PARAMETER FIELD FOR THE NEXT RIGHT PARENTHESIS OR COMMA*/ 00641000
*/*  START OF THE SCAN IS INDICATED BY THE VALUE OF INDEX1.  THE     */ 00642000
*/*  NUMBER OF CHARACTERS FOUND IS PLACED IN NEXTC.          @Z427VLS*/ 00643000
*/*                                                          @Z427VLS*/ 00644000
*/********************************************************************/ 00645000
*SCANCRP: PROC OPTIONS(SAVE(1,14));                        /*@Z427VLS*/ 00646000
SCANCRP  ST    @14,12(,@13)                                        0267 00647000
         ST    @01,24(,@13)                                        0267 00648000
*    RPORC = ON;                                           /*@Z427VLS*/ 00649000
         OI    RPORC,B'10000000'                                   0268 00650000
*    DO NEXTC = INDEX1 BY 1 WHILE (PARMFLD(NEXTC) ^= RPAREN        0269 00651000
*                               & PARMFLD(NEXTC) ^= COMMA);/*@Z427VLS*/ 00652000
         LR    @08,INDEX1                                          0269 00653000
         ST    @08,NEXTC                                           0269 00654000
         B     @DE00269                                            0269 00655000
@DL00269 DS    0H                                                  0270 00656000
*    END;                                                  /*@Z427VLS*/ 00657000
         LA    @08,1                                               0270 00658000
         AL    @08,NEXTC                                           0270 00659000
         ST    @08,NEXTC                                           0270 00660000
@DE00269 L     @08,NEXTC                                           0270 00661000
         LA    @04,PARMFLD-1(@08)                                  0270 00662000
         CLI   0(@04),C')'                                         0270 00663000
         BE    @DC00269                                            0270 00664000
         LA    @04,PARMFLD-1(@08)                                  0270 00665000
         CLI   0(@04),C','                                         0270 00666000
         BNE   @DL00269                                            0270 00667000
@DC00269 DS    0H                                                  0271 00668000
*    IF PARMFLD(NEXTC) = RPAREN THEN                               0271 00669000
         L     @08,NEXTC                                           0271 00670000
         LA    @04,PARMFLD-1(@08)                                  0271 00671000
         CLI   0(@04),C')'                                         0271 00672000
         BNE   @RF00271                                            0271 00673000
*      RPORC = OFF;                                        /*@Z427VLS*/ 00674000
         NI    RPORC,B'01111111'                                   0272 00675000
*    NEXTC = NEXTC - INDEX1;                               /*@Z427VLS*/ 00676000
@RF00271 L     @08,NEXTC                                           0273 00677000
         SLR   @08,INDEX1                                          0273 00678000
         ST    @08,NEXTC                                           0273 00679000
*END;                                                      /*@Z427VLS*/ 00680000
@EL00009 DS    0H                                                  0274 00681000
@EF00009 DS    0H                                                  0274 00682000
@ER00009 L     @14,12(,@13)                                        0274 00683000
         L     @01,24(,@13)                                        0274 00684000
         BR    @14                                                 0274 00685000
*/********************************************************************/ 00686000
*/*                                                          @Z427VLS*/ 00687000
*/*  GENERATE A JULIAN YY/DDD FIELD FROM THE INPUT STREAM AND PLACE  */ 00688000
*/*  IT IN THE VARIABLE YYDDD.                               @Z427VLS*/ 00689000
*/*                                                          @Z427VLS*/ 00690000
*/********************************************************************/ 00691000
*YEARDAY: PROC OPTIONS(SAVE(1,14));                        /*@Z427VLS*/ 00692000
YEARDAY  ST    @14,@SA00010                                        0275 00693000
         ST    @01,@SA00010+4                                      0275 00694000
*    /*                                                      @Z427VLS*/ 00695000
*    /* THE FIELD IS FIRST CHECKED FOR VALID NUMERICS.  THE FIRST    */ 00696000
*    /* FOUR HEX VALUES ARE THEN PACKED INTO THE FIELD HOLD, AND THEN*/ 00697000
*    /* PLACED IN THE YEAR/DAY HOLD AREA (YYDDD).  THE REMAINING HEX */ 00698000
*    /* VALUE IS SHIFTED AND ORED WITH A SIGN FLAG.  THE FIELD IS    */ 00699000
*    /* THEN CHECKED AGAINST DAY 366.  IF GREATER, AN ERROR MESSAGE  */ 00700000
*    /* IS OUTPUT.                                           @Z427VLS*/ 00701000
*    /*                                                      @Z427VLS*/ 00702000
*    CALL VALIDNUM(5);                                     /*@Z427VLS*/ 00703000
         LA    @01,@AL00276                                        0276 00704000
         BAL   @14,VALIDNUM                                        0276 00705000
*    CALL HEXPACK(4);                                      /*@Z427VLS*/ 00706000
         LA    @01,@AL00277                                        0277 00707000
         BAL   @14,HEXPACK                                         0277 00708000
*    YY = HOLD(1);                                         /*@Z427VLS*/ 00709000
         MVC   YY(1),HOLD                                          0278 00710000
*    DD = HOLD(2);                                         /*@Z427VLS*/ 00711000
         MVC   DD(1),HOLD+1                                        0279 00712000
*    SLL(PARMFLD(INDEX1),FOUR);                            /*@Z427VLS*/ 00713000
         SLR   @08,@08                                             0280 00714000
         IC    @08,PARMFLD-1(INDEX1)                               0280 00715000
         SLL   @08,4                                               0280 00716000
         STC   @08,PARMFLD-1(INDEX1)                               0280 00717000
*    DS = PARMFLD(INDEX1) | SIGNFLAG;                      /*@Z427VLS*/ 00718000
         LA    @08,PARMFLD-1(INDEX1)                               0281 00719000
         MVC   DS(1),0(@08)                                        0281 00720000
         OI    DS,X'0F'                                            0281 00721000
*    IF DDDS > '366F'X | DDDS = '000F'X THEN                       0282 00722000
         CLC   DDDS(2),@CB00737                                    0282 00723000
         BH    @RT00282                                            0282 00724000
         CLC   DDDS(2),@CB00738                                    0282 00725000
         BNE   @RF00282                                            0282 00726000
@RT00282 DS    0H                                                  0283 00727000
*      DO PLACE = 2;                                       /*@Z427VLS*/ 00728000
         LA    @08,2                                               0283 00729000
         ST    @08,PLACE                                           0283 00730000
*        CALL OUTMSG(SYNTAX);                              /*@Z427VLS*/ 00731000
         LA    @01,@AL00284                                        0284 00732000
         BAL   @14,OUTMSG                                          0284 00733000
*      END;                                                /*@Z427VLS*/ 00734000
*    INDEX1 = INDEX1 + 1;                                  /*@Z427VLS*/ 00735000
@RF00282 AL    INDEX1,@CF00055                                     0286 00736000
*END;                                                      /*@Z427VLS*/ 00737000
@EL00010 DS    0H                                                  0287 00738000
@EF00010 DS    0H                                                  0287 00739000
@ER00010 L     @14,@SA00010                                        0287 00740000
         L     @01,@SA00010+4                                      0287 00741000
         BR    @14                                                 0287 00742000
*/********************************************************************/ 00743000
*/*                                                          @Z427VLS*/ 00744000
*/*  PACK A FIELD OF A GIVEN LENGTH INTO THE VARIABLE HOLD.  THE     */ 00745000
*/*  INPUT IS ASSUMED TO BE HEX CHARACTERS, WITH A LEADING ZERO FOR  */ 00746000
*/*  EACH TWO DIGITS.                                        @Z427VLS*/ 00747000
*/********************************************************************/ 00748000
*HEXPACK: PROC (HEXLEN) OPTIONS(SAVE(1,14));               /*@Z427VLS*/ 00749000
HEXPACK  ST    @14,12(,@13)                                        0288 00750000
         ST    @01,24(,@13)                                        0288 00751000
         MVC   @PC00011(4),0(@01)                                  0288 00752000
*   DCL HEXLEN FIXED(31);                                  /*@Z427VLS*/ 00753000
*   INDEX3 = HEXLEN / 2;                                   /*@Z427VLS*/ 00754000
         L     @08,@PC00011                                        0290 00755000
         L     @00,HEXLEN(,@08)                                    0290 00756000
         SRDA  @00,32                                              0290 00757000
         D     @00,@CF00074                                        0290 00758000
         ST    @01,INDEX3                                          0290 00759000
*   DO I = 1 TO INDEX3 BY 1;                               /*@Z427VLS*/ 00760000
         LA    I,1                                                 0291 00761000
         B     @DE00291                                            0291 00762000
@DL00291 DS    0H                                                  0292 00763000
*     /*                                                     @Z427VLS*/ 00764000
*     /* THE DATA IN PARMFLD IS ACCESSED TWO CHARACTERS AT A TIME.   */ 00765000
*     /* THE FIRST CHARACTER IS SHIFTED LEFT FOUR BITS AND THEN ORED */ 00766000
*     /* WITH THE SECOND CHARACTER.  THE SECOND CHARACTER IS ASSUMED */ 00767000
*     /* TO HAVE THE FIRST FOUR BITS AS ZEROES.              @Z427VLS*/ 00768000
*     /*                                                     @Z427VLS*/ 00769000
*     HOLD(I) = PARMFLD(INDEX1);                           /*@Z427VLS*/ 00770000
         LA    @08,HOLD-1(I)                                       0292 00771000
         LA    @07,PARMFLD-1(INDEX1)                               0292 00772000
         MVC   0(1,@08),0(@07)                                     0292 00773000
*     SLL (HOLD(I),FOUR);                                  /*@Z427VLS*/ 00774000
         SLR   @08,@08                                             0293 00775000
         IC    @08,HOLD-1(I)                                       0293 00776000
         SLL   @08,4                                               0293 00777000
         STC   @08,HOLD-1(I)                                       0293 00778000
*     HOLD(I) = HOLD(I) | PARMFLD(INDEX1 + 1);             /*@Z427VLS*/ 00779000
         LA    @08,HOLD-1(I)                                       0294 00780000
         LA    @07,PARMFLD(INDEX1)                                 0294 00781000
         OC    0(1,@08),0(@07)                                     0294 00782000
*     INDEX1 = INDEX1 + 2;                                 /*@Z427VLS*/ 00783000
         AL    INDEX1,@CF00074                                     0295 00784000
*   END;                                                   /*@Z427VLS*/ 00785000
         AL    I,@CF00055                                          0296 00786000
@DE00291 C     I,INDEX3                                            0296 00787000
         BNH   @DL00291                                            0296 00788000
*END;                                                      /*@Z427VLS*/ 00789000
@EL00011 DS    0H                                                  0297 00790000
@EF00011 DS    0H                                                  0297 00791000
@ER00011 L     @14,12(,@13)                                        0297 00792000
         L     @01,24(,@13)                                        0297 00793000
         BR    @14                                                 0297 00794000
*/********************************************************************/ 00795000
*/*                                                          @Z427VLS*/ 00796000
*/*  VALIDATE THE FIELD STARTING AT PARMFLD(INDEX1) FOR THE VALUES   */ 00797000
*/*  OF '=Y', '=N', OR NOTHING.  IF NOTHING IS THERE, THE VALUES OF  */ 00798000
*/*  '=Y' IS ASSUMED.  THE LENGTH OF THE KEYWORD IS PASSED, THE      */ 00799000
*/*  DUPLICATE SWITCH FIELD AND THE FLAG IN THE PARAMETER TABLE.     */ 00800000
*/*                                                          @Z427VLS*/ 00801000
*/********************************************************************/ 00802000
*VALIDYN: PROC(INCR) OPTIONS(SAVE(1,14));                  /*@Z427VLS*/ 00803000
VALIDYN  ST    @14,@SA00012                                        0298 00804000
         ST    @01,@SA00012+4                                      0298 00805000
         MVC   @PC00012(4),0(@01)                                  0298 00806000
*    DCL INCR FIXED(31);                 /* LENGTH OF THE PARAMETER  */ 00807000
*    INDEX1 = INDEX1 + INCR;             /* STEP OVER PARM   @Z427VLS*/ 00808000
         L     @08,@PC00012                                        0300 00809000
         AL    INDEX1,INCR(,@08)                                   0300 00810000
*    PARMFLG = OFF;                      /* ASSUME PARM=N VALUE      */ 00811000
         NI    PARMFLG,B'11011111'                                 0301 00812000
*    IF PARMFLD(INDEX1) = COMMA THEN                               0302 00813000
         LA    @08,PARMFLD-1(INDEX1)                               0302 00814000
         CLI   0(@08),C','                                         0302 00815000
         BNE   @RF00302                                            0302 00816000
*      PARMFLG = ON;                     /* NULL VALUE, ASSUME = Y   */ 00817000
         OI    PARMFLG,B'00100000'                                 0303 00818000
*    ELSE                                                          0304 00819000
*      IF PARMFLD(INDEX1:INDEX1+1) = EQUALY THEN                   0304 00820000
         B     @RC00302                                            0304 00821000
@RF00302 LA    @08,PARMFLD-1(INDEX1)                               0304 00822000
         CLC   0(2,@08),@CC00655                                   0304 00823000
         BNE   @RF00304                                            0304 00824000
*        DO;                                               /*@Z427VLS*/ 00825000
*          PARMFLG = ON;                 /* SPECIFIED = Y    @Z427VLS*/ 00826000
         OI    PARMFLG,B'00100000'                                 0306 00827000
*          INDEX1 = INDEX1 + 2;          /* STEP OVER =Y     @Z427VLS*/ 00828000
         AL    INDEX1,@CF00074                                     0307 00829000
*        END;                                              /*@Z427VLS*/ 00830000
*      ELSE                                                        0309 00831000
*        IF PARMFLD(INDEX1:INDEX1+1) = EQUALN THEN                 0309 00832000
         B     @RC00304                                            0309 00833000
@RF00304 LA    @08,PARMFLD-1(INDEX1)                               0309 00834000
         CLC   0(2,@08),@CC00657                                   0309 00835000
         BNE   @RF00309                                            0309 00836000
*            INDEX1 = INDEX1 + 2;        /* STEP OVER = N    @Z427VLS*/ 00837000
         AL    INDEX1,@CF00074                                     0310 00838000
*        ELSE                                                      0311 00839000
*          DO;                                             /*@Z427VLS*/ 00840000
         B     @RC00309                                            0311 00841000
@RF00309 DS    0H                                                  0312 00842000
*            CALL OUTMSG(SYNTAX);                          /*@Z427VLS*/ 00843000
         LA    @01,@AL00312                                        0312 00844000
         BAL   @14,OUTMSG                                          0312 00845000
*            CALL SCANC;                                   /*@Z427VLS*/ 00846000
         BAL   @14,SCANC                                           0313 00847000
*            INDEX1 = INDEX1 + NEXTC;                      /*@Z427VLS*/ 00848000
         AL    INDEX1,NEXTC                                        0314 00849000
*          END;                                            /*@Z427VLS*/ 00850000
*END;                                                      /*@Z427VLS*/ 00851000
@EL00012 DS    0H                                                  0316 00852000
@EF00012 DS    0H                                                  0316 00853000
@ER00012 L     @14,@SA00012                                        0316 00854000
         L     @01,@SA00012+4                                      0316 00855000
         BR    @14                                                 0316 00856000
*/********************************************************************/ 00857000
*/*                                                          @Z427VLS*/ 00858000
*/*  GENERATE A VALID CPU/CUA ENTRY.  THE ENTRY HAS A CPU SERIAL     */ 00859000
*/*  NUMBER FIRST, FOLLOWED BY A CUA.  THIS IS TRANSLATED INTO A     */ 00860000
*/*  HEX VALUE AND PLACED IN THE NEXT CPUCUAV ENTRY, INDEXED BY THE  */ 00861000
*/*  VARIABLE INDEX2.                                        @Z427VLS*/ 00862000
*/*                                                          @Z427VLS*/ 00863000
*/********************************************************************/ 00864000
*VALCPUCU: PROC OPTIONS(SAVE(1,14));                       /*@Z427VLS*/ 00865000
VALCPUCU ST    @14,@SA00013                                        0317 00866000
         ST    @01,@SA00013+4                                      0317 00867000
*  IF NEXTC = 10 & PARMFLD(INDEX1+6) = PERIOD THEN                 0318 00868000
         CLC   NEXTC(4),@CF00034                                   0318 00869000
         BNE   @RF00318                                            0318 00870000
         LA    @08,PARMFLD+5(INDEX1)                               0318 00871000
         CLI   0(@08),C'.'                                         0318 00872000
         BNE   @RF00318                                            0318 00873000
*    DO;                                                   /*@Z427VLS*/ 00874000
*      /*                                                    @Z427VLS*/ 00875000
*      /* CHECK THE CPU SERIAL NUMBER FOR VALID DECIMAL NUMBERS.     */ 00876000
*      /* A ZERO IS PLACED OVER THE COMMA, AND THE CUA FIELD IS      */ 00877000
*      /* VALIDATED FOR HEXADECIMAL CHARACTERS.  THE ENTIRE FIELD IS */ 00878000
*      /* PACKED FOR THE CPUCUA TABLE.                       @Z427VLS*/ 00879000
*      /*                                                    @Z427VLS*/ 00880000
*      CUAHOLD = PARMFLD(INDEX1+7:INDEX1+9);     /* SAVE THE CUA     */ 00881000
         LA    @08,PARMFLD+6(INDEX1)                               0320 00882000
         MVC   CUAHOLD(3),0(@08)                                   0320 00883000
*      IF CUAHOLD(3) = 'X' THEN                                    0321 00884000
         CLI   CUAHOLD+2,C'X'                                      0321 00885000
         BNE   @RF00321                                            0321 00886000
*        PARMFLD(INDEX1+9) = '0';         /* CHANGE X TO ZERO        */ 00887000
         LA    @08,PARMFLD+8(INDEX1)                               0322 00888000
         MVI   0(@08),C'0'                                         0322 00889000
*      CALL VALIDNUM(6);                                   /*@Z427VLS*/ 00890000
@RF00321 LA    @01,@AL00323                                        0323 00891000
         BAL   @14,VALIDNUM                                        0323 00892000
*      INDEX1 = INDEX1 + 6;                                /*@Z427VLS*/ 00893000
         AL    INDEX1,@CF00081                                     0324 00894000
*      PARMFLD(INDEX1) = '0';                              /*@Z427VLS*/ 00895000
         LA    @08,PARMFLD-1(INDEX1)                               0325 00896000
         MVI   0(@08),C'0'                                         0325 00897000
*      CALL VALIDHEX(4);                                   /*@Z427VLS*/ 00898000
         LA    @01,@AL00326                                        0326 00899000
         BAL   @14,VALIDHEX                                        0326 00900000
*      INDEX1 = INDEX1 - 6;                                /*@Z427VLS*/ 00901000
         SL    INDEX1,@CF00081                                     0327 00902000
*      CALL HEXPACK(10);                                   /*@Z427VLS*/ 00903000
         LA    @01,@AL00328                                        0328 00904000
         BAL   @14,HEXPACK                                         0328 00905000
*      INDEX1 = INDEX1 + 1;                 /* INCR OVER DELIMITER   */ 00906000
         AL    INDEX1,@CF00055                                     0329 00907000
*    END;                                                  /*@Z427VLS*/ 00908000
*  ELSE                                                            0331 00909000
*    DO;                                    /* BAD INPUT LENGTH      */ 00910000
         B     @RC00318                                            0331 00911000
@RF00318 DS    0H                                                  0332 00912000
*      CALL OUTMSG(SYNTAX);                                /*@Z427VLS*/ 00913000
         LA    @01,@AL00332                                        0332 00914000
         BAL   @14,OUTMSG                                          0332 00915000
*      INDEX1 = INDEX1 + NEXTC + 1;                        /*@Z427VLS*/ 00916000
         LR    @08,INDEX1                                          0333 00917000
         AL    @08,NEXTC                                           0333 00918000
         AL    @08,@CF00055                                        0333 00919000
         LR    INDEX1,@08                                          0333 00920000
*    END;                                                  /*@Z427VLS*/ 00921000
*      /*                                                    @Z427VLS*/ 00922000
*      /* INCREMENT THE INDEX TO THE TABLE OR PRINT AN ERROR MSG.    */ 00923000
*      /*                                                    @Z427VLS*/ 00924000
*  IF INDEX2 < DIM(CPUCUAV) THEN                                   0335 00925000
@RC00318 L     @08,INDEX2                                          0335 00926000
         C     @08,@CF00064                                        0335 00927000
         BNL   @RF00335                                            0335 00928000
*    INDEX2 = INDEX2 + 1;                   /* DETERMINE INDEX VALUE */ 00929000
         AL    @08,@CF00055                                        0336 00930000
         ST    @08,INDEX2                                          0336 00931000
*  ELSE                                                            0337 00932000
*    DO PLACE = NEXTC + 1;                                 /*@Z427VLS*/ 00933000
         B     @RC00335                                            0337 00934000
@RF00335 LA    @08,1                                               0337 00935000
         AL    @08,NEXTC                                           0337 00936000
         ST    @08,PLACE                                           0337 00937000
*      CALL OUTMSG(SYNTAX);                                /*@Z427VLS*/ 00938000
         LA    @01,@AL00338                                        0338 00939000
         BAL   @14,OUTMSG                                          0338 00940000
*    END;                                                  /*@Z427VLS*/ 00941000
*  CPUCUX1(INDEX2) = HOLDAREA(1:3);                        /*@0099VLS*/ 00942000
@RC00335 L     @08,INDEX2                                          0340 00943000
         MH    @08,@CH00083                                        0340 00944000
         L     @04,CPCUAPTR(,R2)                                   0340 00945000
         ST    @08,@TF00001                                        0340 00946000
         ALR   @08,@04                                             0340 00947000
         AL    @08,@CF01041                                        0340 00948000
         MVC   CPUCUX1-2(3,@08),HOLDAREA                           0340 00949000
*  CPUCUX2(INDEX2) = HOLDAREA(4:5);                        /*@0099VLS*/ 00950000
         AL    @04,@TF00001                                        0341 00951000
         BCTR  @04,0                                               0341 00952000
         BCTR  @04,0                                               0341 00953000
         MVC   CPUCUX2-5(2,@04),HOLDAREA+3                         0341 00954000
*  IF CUAHOLD(3) = 'X' THEN                                        0342 00955000
         CLI   CUAHOLD+2,C'X'                                      0342 00956000
         BNE   @RF00342                                            0342 00957000
*    HOLDAREA(5) = HOLDAREA(5) | SIGNFLAG;  /* CHANGE FOR HIGH CUA   */ 00958000
         OI    HOLDAREA+4,X'0F'                                    0343 00959000
*  CPUCUX3(INDEX2) = HOLDAREA(4:5);                        /*@0099VLS*/ 00960000
@RF00342 L     @08,INDEX2                                          0344 00961000
         MH    @08,@CH00083                                        0344 00962000
         L     @04,CPCUAPTR(,R2)                                   0344 00963000
         ALR   @04,@08                                             0344 00964000
         MVC   CPUCUX3-7(2,@04),HOLDAREA+3                         0344 00965000
*END;                                                      /*@Z427VLS*/ 00966000
@EL00013 DS    0H                                                  0345 00967000
@EF00013 DS    0H                                                  0345 00968000
@ER00013 L     @14,@SA00013                                        0345 00969000
         L     @01,@SA00013+4                                      0345 00970000
         BR    @14                                                 0345 00971000
*/********************************************************************/ 00972000
*/*                                                          @Z427VLS*/ 00973000
*/*      SYNTAX CHECK FOR ACC KEYWORD (=Y,=N,NULL)           @Z427VLS*/ 00974000
*/*      ASSUMED DEFAULT OF ACC=Y                            @Z427VLS*/ 00975000
*/*                                                          @Z427VLS*/ 00976000
*/********************************************************************/ 00977000
*PARMACC:   PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 00978000
PARMACC  ST    @14,@SA00014                                        0346 00979000
         ST    @01,@SA00014+4                                      0346 00980000
*             IF ACCFLG = ON THEN            /* ACC ALREADY SPECIFIED*/ 00981000
         TM    ACCFLG,B'00010000'                                  0347 00982000
         BNO   @RF00347                                            0347 00983000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 00984000
         BAL   @14,DUPLICAT                                        0348 00985000
*             ELSE                                                 0349 00986000
*               DO;                                        /*@Z427VLS*/ 00987000
         B     @RC00347                                            0349 00988000
@RF00347 DS    0H                                                  0350 00989000
*                 ACCFLG = ON;               /* NO, VALIDATE @Z427VLS*/ 00990000
         OI    ACCFLG,B'00010000'                                  0350 00991000
*                 CALL VALIDYN (3);                        /*@Z427VLS*/ 00992000
         LA    @01,@AL00351                                        0351 00993000
         BAL   @14,VALIDYN                                         0351 00994000
*                 IF PARMFLG = OFF THEN                            0352 00995000
         TM    PARMFLG,B'00100000'                                 0352 00996000
         BNZ   @RF00352                                            0352 00997000
*                   DO;                                    /*@Z427VLS*/ 00998000
*                     PACC = OFF;            /* DONT OPEN ACCDEV DS  */ 00999000
         NI    PACC(R2),B'10111111'                                0354 01000000
*                     OACCDEV = OFF;                       /*@Z427VLS*/ 01001000
         NI    OACCDEV(R2),B'11110111'                             0355 01002000
*                   END;                                   /*@Z427VLS*/ 01003000
*               END;                                       /*@Z427VLS*/ 01004000
*END;                                                      /*@Z427VLS*/ 01005000
@EL00014 DS    0H                                                  0358 01006000
@EF00014 DS    0H                                                  0358 01007000
@ER00014 L     @14,@SA00014                                        0358 01008000
         L     @01,@SA00014+4                                      0358 01009000
         BR    @14                                                 0358 01010000
*/********************************************************************/ 01011000
*/*                                                          @Z427VLS*/ 01012000
*/*      SYNTAX CHECK FOR HIST KEYWORD (=Y,=N,NULL)          @Z427VLS*/ 01013000
*/*      ASSUMED DEFAULT FO HIST=N                           @Z427VLS*/ 01014000
*/*                                                          @Z427VLS*/ 01015000
*/********************************************************************/ 01016000
*PARMHIST:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01017000
PARMHIST ST    @14,@SA00015                                        0359 01018000
         ST    @01,@SA00015+4                                      0359 01019000
*             IF HISTFLG = ON THEN             /* HIST ALREADY SPEC  */ 01020000
         TM    HISTFLG,B'10000000'                                 0360 01021000
         BNO   @RF00360                                            0360 01022000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01023000
         BAL   @14,DUPLICAT                                        0361 01024000
*             ELSE                                                 0362 01025000
*               DO;                                        /*@Z427VLS*/ 01026000
         B     @RC00360                                            0362 01027000
@RF00360 DS    0H                                                  0363 01028000
*                 HISTFLG = ON;                /* NO,VALIDATE        */ 01029000
         OI    HISTFLG,B'10000000'                                 0363 01030000
*                 CALL VALIDYN (4);                        /*@Z427VLS*/ 01031000
         LA    @01,@AL00364                                        0364 01032000
         BAL   @14,VALIDYN                                         0364 01033000
*                 IF PARMFLG = ON THEN         /* HIST=Y SPECIFIED   */ 01034000
         TM    PARMFLG,B'00100000'                                 0365 01035000
         BNO   @RF00365                                            0365 01036000
*                   DO;                                    /*@Z427VLS*/ 01037000
*                     PHIST = ON;                          /*@Z427VLS*/ 01038000
*                     PLOGREC = OFF;                       /*@Z427VLS*/ 01039000
         OI    PHIST(R2),B'00100000'                               0368 01040000
         NI    PLOGREC(R2),B'11111101'                             0368 01041000
*                     OSERLOG = OFF;                       /*@Z427VLS*/ 01042000
*                     OACCIN = ON;             /* OPEN ACCIN @Z427VLS*/ 01043000
*                     ODRCTWRK = ON;           /* OPEN TEMP DS       */ 01044000
         OI    OACCIN(R2),B'00010010'                              0371 01045000
         NI    OSERLOG(R2),B'11011111'                             0371 01046000
*                   END;                                   /*@Z427VLS*/ 01047000
*               END;                                       /*@Z427VLS*/ 01048000
*END;                                                      /*@Z427VLS*/ 01049000
@EL00015 DS    0H                                                  0374 01050000
@EF00015 DS    0H                                                  0374 01051000
@ER00015 L     @14,@SA00015                                        0374 01052000
         L     @01,@SA00015+4                                      0374 01053000
         BR    @14                                                 0374 01054000
*/********************************************************************/ 01055000
*/*                                                          @Z427VLS*/ 01056000
*/*      SYNTAX CHECK FOR MES KEYWORD (=Y,=N,NULL)           @Z427VLS*/ 01057000
*/*      ASSUMED MES=N DEFAULT                               @Z427VLS*/ 01058000
*/*                                                          @Z427VLS*/ 01059000
*/********************************************************************/ 01060000
*PARMES:    PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01061000
PARMES   ST    @14,@SA00016                                        0375 01062000
         ST    @01,@SA00016+4                                      0375 01063000
*             IF MESFLG = ON THEN                /* MES ALREADY SPEC */ 01064000
         TM    MESFLG,B'01000000'                                  0376 01065000
         BNO   @RF00376                                            0376 01066000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01067000
         BAL   @14,DUPLICAT                                        0377 01068000
*             ELSE                                                 0378 01069000
*               DO;                                        /*@Z427VLS*/ 01070000
         B     @RC00376                                            0378 01071000
@RF00376 DS    0H                                                  0379 01072000
*                 MESFLG = ON;                   /* NO, VALIDATE     */ 01073000
         OI    MESFLG,B'01000000'                                  0379 01074000
*                 CALL VALIDYN (3);                        /*@Z427VLS*/ 01075000
         LA    @01,@AL00380                                        0380 01076000
         BAL   @14,VALIDYN                                         0380 01077000
*                 IF PARMFLG = ON THEN           /* MES = Y SPECIFIED*/ 01078000
         TM    PARMFLG,B'00100000'                                 0381 01079000
         BNO   @RF00381                                            0381 01080000
*                   PARMMES = ON;                          /*@Z427VLS*/ 01081000
         OI    PARMMES(R2),B'01000000'                             0382 01082000
*               END;                                       /*@Z427VLS*/ 01083000
*END;                                                      /*@Z427VLS*/ 01084000
@EL00016 DS    0H                                                  0384 01085000
@EF00016 DS    0H                                                  0384 01086000
@ER00016 L     @14,@SA00016                                        0384 01087000
         L     @01,@SA00016+4                                      0384 01088000
         BR    @14                                                 0384 01089000
*/********************************************************************/ 01090000
*/*                                                          @Z427VLS*/ 01091000
*/*      SYNTAX CHECK FOR MERGE KEYWORD (=Y,=N,NULL)         @Z427VLS*/ 01092000
*/*      ASSUMED DEFAULT OF MERGE=N                          @Z427VLS*/ 01093000
*/*                                                          @Z427VLS*/ 01094000
*/********************************************************************/ 01095000
*PARMERGE:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01096000
PARMERGE ST    @14,@SA00017                                        0385 01097000
         ST    @01,@SA00017+4                                      0385 01098000
*             IF MERGEFLG = ON THEN          /* MERGE ALREADY SPEC   */ 01099000
         TM    MERGEFLG,B'00100000'                                0386 01100000
         BNO   @RF00386                                            0386 01101000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01102000
         BAL   @14,DUPLICAT                                        0387 01103000
*             ELSE                                                 0388 01104000
*               DO;                                        /*@Z427VLS*/ 01105000
         B     @RC00386                                            0388 01106000
@RF00386 DS    0H                                                  0389 01107000
*                 MERGEFLG = ON;             /* NO, VALIDATE @Z427VLS*/ 01108000
         OI    MERGEFLG,B'00100000'                                0389 01109000
*                 CALL VALIDYN (5);                        /*@Z427VLS*/ 01110000
         LA    @01,@AL00390                                        0390 01111000
         BAL   @14,VALIDYN                                         0390 01112000
*                 IF PARMFLG = ON THEN                             0391 01113000
         TM    PARMFLG,B'00100000'                                 0391 01114000
         BNO   @RF00391                                            0391 01115000
*                   DO;                                    /*@Z427VLS*/ 01116000
*                     /*                                     @Z427VLS*/ 01117000
*                     /* SERLOG AND HISTORY INPUT.  OPEN SERLOG,     */ 01118000
*                     /* ACCIN, AND TEMPORARY DATA SET.      @Z427VLS*/ 01119000
*                     /*                                     @Z427VLS*/ 01120000
*                     PLOGREC = ON;                        /*@Z427VLS*/ 01121000
*                     PHIST = ON;                          /*@Z427VLS*/ 01122000
         OI    PLOGREC(R2),B'00100010'                             0394 01123000
*                     MRGEFLG = ON;                        /*@Z427VLS*/ 01124000
         OI    MRGEFLG,B'01000000'                                 0395 01125000
*                     OSERLOG = ON;                        /*@Z427VLS*/ 01126000
*                     OACCIN = ON;                         /*@Z427VLS*/ 01127000
*                     ODRCTWRK = ON;                       /*@Z427VLS*/ 01128000
         OI    OSERLOG(R2),B'00110010'                             0398 01129000
*                   END;                                   /*@Z427VLS*/ 01130000
*               END;                                       /*@Z427VLS*/ 01131000
*END;                                                      /*@Z427VLS*/ 01132000
@EL00017 DS    0H                                                  0401 01133000
@EF00017 DS    0H                                                  0401 01134000
@ER00017 L     @14,@SA00017                                        0401 01135000
         L     @01,@SA00017+4                                      0401 01136000
         BR    @14                                                 0401 01137000
*/********************************************************************/ 01138000
*/*                                                          @Z427VLS*/ 01139000
*/*      SYNTAX CHECK FOR RDESUM KEYWORD (=Y,=N,NULL)        @Z427VLS*/ 01140000
*/*      ASSUMED DEFAULT OF RDESUM=N                         @Z427VLS*/ 01141000
*/*                                                          @Z427VLS*/ 01142000
*/********************************************************************/ 01143000
*PARMRDE:   PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01144000
PARMRDE  ST    @14,@SA00018                                        0402 01145000
         ST    @01,@SA00018+4                                      0402 01146000
*             IF RDEFLG = ON THEN          /* RDESUM ALREADY SPEC    */ 01147000
         TM    RDEFLG,B'00010000'                                  0403 01148000
         BNO   @RF00403                                            0403 01149000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01150000
         BAL   @14,DUPLICAT                                        0404 01151000
*             ELSE                                                 0405 01152000
*               DO;                                        /*@Z427VLS*/ 01153000
         B     @RC00403                                            0405 01154000
@RF00403 DS    0H                                                  0406 01155000
*                 RDEFLG = ON;             /* NO, VALIDATE   @Z427VLS*/ 01156000
         OI    RDEFLG,B'00010000'                                  0406 01157000
*                 CALL VALIDYN (6);                        /*@Z427VLS*/ 01158000
         LA    @01,@AL00407                                        0407 01159000
         BAL   @14,VALIDYN                                         0407 01160000
*                 IF PARMFLG = ON THEN     /* RDESUM=Y SPECIFIED     */ 01161000
         TM    PARMFLG,B'00100000'                                 0408 01162000
         BNO   @RF00408                                            0408 01163000
*                   DO;                                    /*@ZA19043*/ 01164000
*                     RDESUM = ON;                       /* @Z427VLS */ 01165000
         OI    RDESUM(R2),B'10000000'                              0410 01166000
*                     GEN(BLDL  0,BLDLIST);    /* IFCRDESM  @ZA19043 */ 01167000
         BLDL  0,BLDLIST                                                01168000
*                     IF R15 ^= ZERO THEN  /*IS MOD IN SYS  @ZA19043 */ 01169000
         LTR   R15,R15                                             0412 01170000
         BZ    @RF00412                                            0412 01171000
*                       CALL  OUTMSG(SYNTAX);       /* NO   @ZA19043 */ 01172000
         LA    @01,@AL00413                                        0413 01173000
         BAL   @14,OUTMSG                                          0413 01174000
*                   END;                                   /*@ZA19043*/ 01175000
*               END;                                       /*@Z427VLS*/ 01176000
*END;                                                      /*@Z427VLS*/ 01177000
@EL00018 DS    0H                                                  0416 01178000
@EF00018 DS    0H                                                  0416 01179000
@ER00018 L     @14,@SA00018                                        0416 01180000
         L     @01,@SA00018+4                                      0416 01181000
         BR    @14                                                 0416 01182000
*/********************************************************************/ 01183000
*/*                                                          @Z427VLS*/ 01184000
*/*      SYNTAX CHECK FOR EVENT KEYWORD (=Y,=N,NULL)         @Z427VLS*/ 01185000
*/*      ASSUMED DEFAULT OF EVENT=N                          @Z427VLS*/ 01186000
*/*                                                          @Z427VLS*/ 01187000
*/********************************************************************/ 01188000
*PARMEVEN:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01189000
PARMEVEN ST    @14,@SA00019                                        0417 01190000
         ST    @01,@SA00019+4                                      0417 01191000
*             IF EVENTFLG = ON THEN        /* TIMESEQ ALREADY SPEC   */ 01192000
         TM    EVENTFLG,B'00000010'                                0418 01193000
         BNO   @RF00418                                            0418 01194000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01195000
         BAL   @14,DUPLICAT                                        0419 01196000
*             ELSE                                                 0420 01197000
*               DO;                                        /*@Z427VLS*/ 01198000
         B     @RC00418                                            0420 01199000
@RF00418 DS    0H                                                  0421 01200000
*                 EVENTFLG = ON;           /* NO,VALIDATE    @Z427VLS*/ 01201000
         OI    EVENTFLG,B'00000010'                                0421 01202000
*                 CALL VALIDYN (5);                        /*@Z427VLS*/ 01203000
         LA    @01,@AL00422                                        0422 01204000
         BAL   @14,VALIDYN                                         0422 01205000
*                 IF PARMFLG = ON THEN        /* TIMESEQ=Y SPECIFIED */ 01206000
         TM    PARMFLG,B'00100000'                                 0423 01207000
         BNO   @RF00423                                            0423 01208000
*                   TIMESEQ = ON;                          /*@Z427VLS*/ 01209000
         OI    TIMESEQ(R2),B'00000010'                             0424 01210000
*               END;                                       /*@Z427VLS*/ 01211000
*END;                                                      /*@Z427VLS*/ 01212000
@EL00019 DS    0H                                                  0426 01213000
@EF00019 DS    0H                                                  0426 01214000
@ER00019 L     @14,@SA00019                                        0426 01215000
         L     @01,@SA00019+4                                      0426 01216000
         BR    @14                                                 0426 01217000
*/********************************************************************/ 01218000
*/*                                                          @Z427VLS*/ 01219000
*/*      SYNTAX CHECK FOR SHORT KEYWORD (=Y,=N,NULL)         @Z427VLS*/ 01220000
*/*      ASSUMED DEFAULT OF SHORT=N                          @Z427VLS*/ 01221000
*/*                                                          @Z427VLS*/ 01222000
*/********************************************************************/ 01223000
*PARMSHOR:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01224000
PARMSHOR ST    @14,@SA00020                                        0427 01225000
         ST    @01,@SA00020+4                                      0427 01226000
*             IF SHORTFLG = ON THEN       /* SHORT ALREADY SPECIFIED */ 01227000
         TM    SHORTFLG,B'00000001'                                0428 01228000
         BNO   @RF00428                                            0428 01229000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01230000
         BAL   @14,DUPLICAT                                        0429 01231000
*             ELSE                                                 0430 01232000
*               DO;                                        /*@Z427VLS*/ 01233000
         B     @RC00428                                            0430 01234000
@RF00428 DS    0H                                                  0431 01235000
*                 SHORTFLG = ON;          /* NO, VALIDATE    @Z427VLS*/ 01236000
         OI    SHORTFLG,B'00000001'                                0431 01237000
*                 CALL VALIDYN (5);                        /*@Z427VLS*/ 01238000
         LA    @01,@AL00432                                        0432 01239000
         BAL   @14,VALIDYN                                         0432 01240000
*                 IF PARMFLG = ON THEN    /* SHORT=Y SPECIFIED       */ 01241000
         TM    PARMFLG,B'00100000'                                 0433 01242000
         BNO   @RF00433                                            0433 01243000
*                   SHORTOBR = ON;                         /*@Z427VLS*/ 01244000
         OI    SHORTOBR(R2),B'00100000'                            0434 01245000
*               END;                                       /*@Z427VLS*/ 01246000
*END;                                                      /*@Z427VLS*/ 01247000
@EL00020 DS    0H                                                  0436 01248000
@EF00020 DS    0H                                                  0436 01249000
@ER00020 L     @14,@SA00020                                        0436 01250000
         L     @01,@SA00020+4                                      0436 01251000
         BR    @14                                                 0436 01252000
*/********************************************************************/ 01253000
*/*                                                          @Z427VLS*/ 01254000
*/*      SYNTAX CHECK FOR SYSUM KEYWORD (=Y,=N,NULL)         @Z427VLS*/ 01255000
*/*      ASSUMED DEFAULT OF SYSUM=N                          @Z427VLS*/ 01256000
*/*                                                          @Z427VLS*/ 01257000
*/********************************************************************/ 01258000
*PARMSYSU:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01259000
PARMSYSU ST    @14,@SA00021                                        0437 01260000
         ST    @01,@SA00021+4                                      0437 01261000
*             IF SYSUMFLG = ON THEN       /* SYSUM ALREADY SPECIFED  */ 01262000
         TM    SYSUMFLG,B'10000000'                                0438 01263000
         BNO   @RF00438                                            0438 01264000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01265000
         BAL   @14,DUPLICAT                                        0439 01266000
*             ELSE                                                 0440 01267000
*               DO;                                        /*@Z427VLS*/ 01268000
         B     @RC00438                                            0440 01269000
@RF00438 DS    0H                                                  0441 01270000
*                 SYSUMFLG = ON;          /* NO, VALIDATE    @Z427VLS*/ 01271000
         OI    SYSUMFLG,B'10000000'                                0441 01272000
*                 CALL VALIDYN (5);                        /*@Z427VLS*/ 01273000
         LA    @01,@AL00442                                        0442 01274000
         BAL   @14,VALIDYN                                         0442 01275000
*                 IF PARMFLG = ON THEN    /* SYSUM=Y SPECIFIED       */ 01276000
         TM    PARMFLG,B'00100000'                                 0443 01277000
         BNO   @RF00443                                            0443 01278000
*                   SYSUM = ON;                            /*@Z427VLS*/ 01279000
         OI    SYSUM(R2),B'00000100'                               0444 01280000
*               END;                                       /*@Z427VLS*/ 01281000
*END;                                                      /*@Z427VLS*/ 01282000
@EL00021 DS    0H                                                  0446 01283000
@EF00021 DS    0H                                                  0446 01284000
@ER00021 L     @14,@SA00021                                        0446 01285000
         L     @01,@SA00021+4                                      0446 01286000
         BR    @14                                                 0446 01287000
*/********************************************************************/ 01288000
*/*                                                          @Z427VLS*/ 01289000
*/*      SYNTAX CHECK FOR TRENDS KEYWORD (=Y,=N,NULL)        @Z427VLS*/ 01290000
*/*      ASSUMED DEFAULT OF TRENDS=N                         @Z427VLS*/ 01291000
*/*                                                          @Z427VLS*/ 01292000
*/********************************************************************/ 01293000
*PARMTREN:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01294000
PARMTREN ST    @14,@SA00022                                        0447 01295000
         ST    @01,@SA00022+4                                      0447 01296000
*             IF TRENDFLG = ON THEN         /* TRENDS ALREADY SPEDIF */ 01297000
         TM    TRENDFLG,B'01000000'                                0448 01298000
         BNO   @RF00448                                            0448 01299000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01300000
         BAL   @14,DUPLICAT                                        0449 01301000
*             ELSE                                                 0450 01302000
*               DO;                                        /*@Z427VLS*/ 01303000
         B     @RC00448                                            0450 01304000
@RF00448 DS    0H                                                  0451 01305000
*                 TRENDFLG = ON;            /* NO,VALIDATE   @Z427VLS*/ 01306000
         OI    TRENDFLG,B'01000000'                                0451 01307000
*                 CALL VALIDYN (6);                        /*@Z427VLS*/ 01308000
         LA    @01,@AL00452                                        0452 01309000
         BAL   @14,VALIDYN                                         0452 01310000
*                 IF PARMFLG = ON THEN      /* TRENDS=Y SPECIFIED    */ 01311000
         TM    PARMFLG,B'00100000'                                 0453 01312000
         BNO   @RF00453                                            0453 01313000
*                   TREND = ON;                            /*@Z427VLS*/ 01314000
         OI    TREND(R2),B'00010000'                               0454 01315000
*               END;                                       /*@Z427VLS*/ 01316000
*END;                                                      /*@Z427VLS*/ 01317000
@EL00022 DS    0H                                                  0456 01318000
@EF00022 DS    0H                                                  0456 01319000
@ER00022 L     @14,@SA00022                                        0456 01320000
         L     @01,@SA00022+4                                      0456 01321000
         BR    @14                                                 0456 01322000
*/********************************************************************/ 01323000
*/*                                                          @Z427VLS*/ 01324000
*/*      SYNTAX CHECK OF ZERO KEYWORD (=Y,=N,NULL)           @Z427VLS*/ 01325000
*/*      ASSUMED DEFAULT OF ZERO=N                           @Z427VLS*/ 01326000
*/*                                                          @Z427VLS*/ 01327000
*/********************************************************************/ 01328000
*PARMZERO:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01329000
PARMZERO ST    @14,@SA00023                                        0457 01330000
         ST    @01,@SA00023+4                                      0457 01331000
*             IF ZEROFLG = ON THEN          /* ZERO ALREADY SPECIFIED*/ 01332000
         TM    ZEROFLG,B'00100000'                                 0458 01333000
         BNO   @RF00458                                            0458 01334000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01335000
         BAL   @14,DUPLICAT                                        0459 01336000
*             ELSE                                                 0460 01337000
*               DO;                                        /*@Z427VLS*/ 01338000
         B     @RC00458                                            0460 01339000
@RF00458 DS    0H                                                  0461 01340000
*                 ZEROFLG = ON;             /* NO, VALIDATE  @Z427VLS*/ 01341000
         OI    ZEROFLG,B'00100000'                                 0461 01342000
*                 CALL VALIDYN (4);                        /*@Z427VLS*/ 01343000
         LA    @01,@AL00462                                        0462 01344000
         BAL   @14,VALIDYN                                         0462 01345000
*                 IF PARMFLG = ON THEN      /* ZERO=Y SPECIFIED      */ 01346000
         TM    PARMFLG,B'00100000'                                 0463 01347000
         BNO   @RF00463                                            0463 01348000
*                   ZEROALL = ON;                          /*@Z427VLS*/ 01349000
         OI    ZEROALL(R2),B'01000000'                             0464 01350000
*               END;                                       /*@Z427VLS*/ 01351000
*END;                                                      /*@Z427VLS*/ 01352000
@EL00023 DS    0H                                                  0466 01353000
@EF00023 DS    0H                                                  0466 01354000
@ER00023 L     @14,@SA00023                                        0466 01355000
         L     @01,@SA00023+4                                      0466 01356000
         BR    @14                                                 0466 01357000
*/********************************************************************/ 01358000
*/*                                                          @Z427VLS*/ 01359000
*/*      SYNTAX CHECK FOR DATE KEYWORD (YYDDD(,YYDDD))       @Z427VLS*/ 01360000
*/*                                                          @Z427VLS*/ 01361000
*/********************************************************************/ 01362000
*PARMDATE:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01363000
PARMDATE ST    @14,@SA00024                                        0467 01364000
         ST    @01,@SA00024+4                                      0467 01365000
*             NEXTRPC = OFF;                 /* LOOK FOR R PAREN     */ 01366000
         NI    NEXTRPC,B'11111011'                                 0468 01367000
*             IF DATEFLG = ON THEN           /* DATE ALREADY SPECIFED*/ 01368000
         TM    DATEFLG,B'00000100'                                 0469 01369000
         BNO   @RF00469                                            0469 01370000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01371000
         BAL   @14,DUPLICAT                                        0470 01372000
*             ELSE                                                 0471 01373000
*               DO INDEX1 = INDEX1+6;        /* NO, INCR OVER PARAM  */ 01374000
         B     @RC00469                                            0471 01375000
@RF00469 LA    @08,6                                               0471 01376000
         ALR   @08,INDEX1                                          0471 01377000
         LR    INDEX1,@08                                          0471 01378000
*                 DATEFLG = ON;                            /*@Z427VLS*/ 01379000
         OI    DATEFLG,B'00000100'                                 0472 01380000
*                IF PARMFLD(INDEX1+5) = DASH THEN                  0473 01381000
         LA    @08,PARMFLD+4(INDEX1)                               0473 01382000
         CLI   0(@08),C'-'                                         0473 01383000
         BNE   @RF00473                                            0473 01384000
*                  PARMFLD(INDEX1+5) = COMMA;              /*@0099VLS*/ 01385000
         LA    @08,PARMFLD+4(INDEX1)                               0474 01386000
         MVI   0(@08),C','                                         0474 01387000
*                 CALL SCANCRP;              /* FIND DELIMITER       */ 01388000
@RF00473 BAL   @14,SCANCRP                                         0475 01389000
*                 IF NEXTC = 5 THEN          /* VALID LENGTH @Z427VLS*/ 01390000
         CLC   NEXTC(4),@CF00079                                   0476 01391000
         BNE   @RF00476                                            0476 01392000
*                   DO;                                    /*@Z427VLS*/ 01393000
*                     CALL YEARDAY;          /* CONVERT      @Z427VLS*/ 01394000
         BAL   @14,YEARDAY                                         0478 01395000
*                     PSTD = YYDDD;          /* STORE START DATE     */ 01396000
         MVC   PSTD(3,R2),YYDDD                                    0479 01397000
*                     IF RPORC = ON THEN     /* SECOND OPERAND       */ 01398000
         TM    RPORC,B'10000000'                                   0480 01399000
         BNO   @RF00480                                            0480 01400000
*                       DO INDEX1 = INDEX1 + 1;            /*@Z427VLS*/ 01401000
         LA    @08,1                                               0481 01402000
         ALR   @08,INDEX1                                          0481 01403000
         LR    INDEX1,@08                                          0481 01404000
*                         CALL SCANRP;       /* FIND DELIMITER       */ 01405000
         BAL   @14,SCANRP                                          0482 01406000
*                         IF NEXTC = 5 THEN  /* RIGHT LENGTH @Z427VLS*/ 01407000
         CLC   NEXTC(4),@CF00079                                   0483 01408000
         BNE   @RF00483                                            0483 01409000
*                           DO;                            /*@Z427VLS*/ 01410000
*                             CALL YEARDAY;  /* CONVERT      @Z427VLS*/ 01411000
         BAL   @14,YEARDAY                                         0485 01412000
*                             ENDDATE(1) = HEXZERO;        /*@Z427VLS*/ 01413000
         MVI   ENDDATE(R2),X'00'                                   0486 01414000
*                             PEND = YYDDD;  /* STORE AS END DATE    */ 01415000
         MVC   PEND(3,R2),YYDDD                                    0487 01416000
*                             IF PEND < PSTD THEN                  0488 01417000
         CLC   PEND(3,R2),PSTD(R2)                                 0488 01418000
         BNL   @RF00488                                            0488 01419000
*                               DO PLACE = 5;              /*@Z427VLS*/ 01420000
         LA    @08,5                                               0489 01421000
         ST    @08,PLACE                                           0489 01422000
*                                 CALL OUTMSG (SYNTAX);    /*@Z427VLS*/ 01423000
         LA    @01,@AL00490                                        0490 01424000
         BAL   @14,OUTMSG                                          0490 01425000
*                               END;                       /*@Z427VLS*/ 01426000
*                           END;                           /*@Z427VLS*/ 01427000
*                         ELSE                                     0493 01428000
*                           DO;                            /*@Z427VLS*/ 01429000
         B     @RC00483                                            0493 01430000
@RF00483 DS    0H                                                  0494 01431000
*                             CALL OUTMSG(SYNTAX);  /* WRONG LENGTH  */ 01432000
         LA    @01,@AL00494                                        0494 01433000
         BAL   @14,OUTMSG                                          0494 01434000
*                             INDEX1 = INDEX1 + NEXTC;     /*@Z427VLS*/ 01435000
         AL    INDEX1,NEXTC                                        0495 01436000
*                           END;                           /*@Z427VLS*/ 01437000
*                       END;                               /*@Z427VLS*/ 01438000
@RC00483 DS    0H                                                  0498 01439000
*                     ELSE                   /* ONE OPERAND  @Z427VLS*/ 01440000
*                         ENDDATE = STDATE;  /* START DATE = END DATE*/ 01441000
         B     @RC00480                                            0498 01442000
@RF00480 MVC   ENDDATE(4,R2),STDATE(R2)                            0498 01443000
*                     INDEX1 = INDEX1 + 1;                 /*@Z427VLS*/ 01444000
@RC00480 AL    INDEX1,@CF00055                                     0499 01445000
*                   END;                                   /*@Z427VLS*/ 01446000
*                 ELSE                                             0501 01447000
*                    DO;                                   /*@Z427VLS*/ 01448000
         B     @RC00476                                            0501 01449000
@RF00476 DS    0H                                                  0502 01450000
*                      CALL OUTMSG(SYNTAX);  /* WRONG LENGTH @Z427VLS*/ 01451000
         LA    @01,@AL00502                                        0502 01452000
         BAL   @14,OUTMSG                                          0502 01453000
*                      CALL SCANRP;                        /*@Z427VLS*/ 01454000
         BAL   @14,SCANRP                                          0503 01455000
*                      INDEX1 = INDEX1 + NEXTC + 1;        /*@Z427VLS*/ 01456000
         LR    @08,INDEX1                                          0504 01457000
         AL    @08,NEXTC                                           0504 01458000
         AL    @08,@CF00055                                        0504 01459000
         LR    INDEX1,@08                                          0504 01460000
*                   END;                                   /*@Z427VLS*/ 01461000
*               END;                                       /*@Z427VLS*/ 01462000
@RC00476 DS    0H                                                  0507 01463000
*END;                                                      /*@Z427VLS*/ 01464000
@EL00024 DS    0H                                                  0507 01465000
@EF00024 DS    0H                                                  0507 01466000
@ER00024 L     @14,@SA00024                                        0507 01467000
         L     @01,@SA00024+4                                      0507 01468000
         BR    @14                                                 0507 01469000
*/********************************************************************/ 01470000
*/*                                                          @Z427VLS*/ 01471000
*/*      SYNTAX CHECK FOR DEVICE SER NO (NNNNNN(,NNNNNN,...,NNNNNN)  */ 01472000
*/*      PERTAINS ONLY TO 34XX DEVICES.                      @Z427VLS*/ 01473000
*/*      MAXIMUM OF 8 ENTRIES                                @Z427VLS*/ 01474000
*/*                                                          @Z427VLS*/ 01475000
*/********************************************************************/ 01476000
*PARMDEVS:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01477000
PARMDEVS ST    @14,@SA00025                                        0508 01478000
         ST    @01,@SA00025+4                                      0508 01479000
*             NEXTRPC = OFF;               /* LOOK FOR R PAREN       */ 01480000
         NI    NEXTRPC,B'11111011'                                 0509 01481000
*             IF SERFLG = ON THEN          /* DEVSER ALREADY SPECIFED*/ 01482000
         TM    SERFLG,B'00000001'                                  0510 01483000
         BNO   @RF00510                                            0510 01484000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01485000
         BAL   @14,DUPLICAT                                        0511 01486000
*             ELSE                                                 0512 01487000
*               DO INDEX1 = INDEX1 + 8;    /* NO, INCR OVER PARM     */ 01488000
         B     @RC00510                                            0512 01489000
@RF00510 LA    @08,8                                               0512 01490000
         ALR   @08,INDEX1                                          0512 01491000
         LR    INDEX1,@08                                          0512 01492000
*                 SERFLG = ON;                             /*@Z427VLS*/ 01493000
         OI    SERFLG,B'00000001'                                  0513 01494000
*                 /*                                         @Z427VLS*/ 01495000
*                 /* SPACE IS GOTTEN FOR THE TABLE.  THE BASE POINTER*/ 01496000
*                 /* IS ESTABLISHED AND THE TABLE IS CLEARED.        */ 01497000
*                 /*                                         @Z427VLS*/ 01498000
*                 RESPECIFY (R1) RESTRICTED;               /*@Z427VLS*/ 01499000
*                 R1 = 32;                                 /*@Z427VLS*/ 01500000
         LA    R1,32                                               0515 01501000
*                 GEN (GETMAIN R,LV=(1),SP=20);            /*@Z427VLS*/ 01502000
         GETMAIN R,LV=(1),SP=20                                         01503000
*                 SERPTR = R1;                             /*@Z427VLS*/ 01504000
         ST    R1,SERPTR(,R2)                                      0517 01505000
*                 RESPECIFY (R1) UNRESTRICTED;             /*@Z427VLS*/ 01506000
*                 INDEX2 = ZERO;                           /*@Z427VLS*/ 01507000
         SLR   @08,@08                                             0519 01508000
         ST    @08,INDEX2                                          0519 01509000
*                 DEVSERAL = DEVSERAL && DEVSERAL;         /*@Z427VLS*/ 01510000
         L     @08,SERPTR(,R2)                                     0520 01511000
         XC    DEVSERAL(18,@08),DEVSERAL(@08)                      0520 01512000
*                 DO UNTIL (RPORC = OFF);                  /*@Z427VLS*/ 01513000
@DL00521 DS    0H                                                  0522 01514000
*                   CALL SCANCRP;              /* FIND DELIMITER     */ 01515000
         BAL   @14,SCANCRP                                         0522 01516000
*                   IF NEXTC = 6 THEN          /* VALID LENGTH       */ 01517000
         CLC   NEXTC(4),@CF00081                                   0523 01518000
         BNE   @RF00523                                            0523 01519000
*                     DO;                                  /*@Z427VLS*/ 01520000
*                       CALL VALIDNUM(6);      /* VALIDATE FOR NUMBER*/ 01521000
         LA    @01,@AL00525                                        0525 01522000
         BAL   @14,VALIDNUM                                        0525 01523000
*                       /*                                   @Z427VLS*/ 01524000
*                       /* CONVERT TO BINARY                 @Z427VLS*/ 01525000
*                       /*                                   @Z427VLS*/ 01526000
*                       INDEX3 = PARMFLD(INDEX1) ;         /*@Z427VLS*/ 01527000
         SLR   @08,@08                                             0526 01528000
         IC    @08,PARMFLD-1(INDEX1)                               0526 01529000
         ST    @08,INDEX3                                          0526 01530000
*                       DO I=1 TO 5;                       /*@Z427VLS*/ 01531000
         LA    I,1                                                 0527 01532000
@DL00527 DS    0H                                                  0528 01533000
*                         INDEX3 = INDEX3*10 + PARMFLD(INDEX1+I);  0528 01534000
         L     @08,INDEX3                                          0528 01535000
         MH    @08,@CH00034                                        0528 01536000
         LR    @07,INDEX1                                          0528 01537000
         ALR   @07,I                                               0528 01538000
         SLR   @04,@04                                             0528 01539000
         IC    @04,PARMFLD-1(@07)                                  0528 01540000
         ALR   @08,@04                                             0528 01541000
         ST    @08,INDEX3                                          0528 01542000
*                       END;                               /*@Z427VLS*/ 01543000
         AL    I,@CF00055                                          0529 01544000
         C     I,@CF00079                                          0529 01545000
         BNH   @DL00527                                            0529 01546000
*                       IF INDEX2 < DIM(SERVAL) THEN               0530 01547000
         L     @08,INDEX2                                          0530 01548000
         C     @08,@CF00066                                        0530 01549000
         BNL   @RF00530                                            0530 01550000
*                         INDEX2 = INDEX2 + 1;  /* GET INDEX VALUE   */ 01551000
         AL    @08,@CF00055                                        0531 01552000
         ST    @08,INDEX2                                          0531 01553000
*                       ELSE                                       0532 01554000
*                         CALL OUTMSG(SYNTAX);             /*@Z427VLS*/ 01555000
         B     @RC00530                                            0532 01556000
@RF00530 LA    @01,@AL00532                                        0532 01557000
         BAL   @14,OUTMSG                                          0532 01558000
*                       IF INDEX3 > 65535 THEN                     0533 01559000
@RC00530 L     @08,INDEX3                                          0533 01560000
         C     @08,@CF00802                                        0533 01561000
         BNH   @RF00533                                            0533 01562000
*                         CALL OUTMSG(SYNTAX);             /*@Z427VLS*/ 01563000
         LA    @01,@AL00534                                        0534 01564000
         BAL   @14,OUTMSG                                          0534 01565000
*                       SERVAL(INDEX2) = INDEX3; /* STORE VALUE      */ 01566000
@RF00533 L     @08,INDEX2                                          0535 01567000
         ALR   @08,@08                                             0535 01568000
         L     @04,SERPTR(,R2)                                     0535 01569000
         L     @03,INDEX3                                          0535 01570000
         ALR   @04,@08                                             0535 01571000
         STCM  @03,3,SERVAL-2(@04)                                 0535 01572000
*                     END;                                 /*@Z427VLS*/ 01573000
*                   ELSE                                           0537 01574000
*                       CALL OUTMSG(SYNTAX);               /*@Z427VLS*/ 01575000
         B     @RC00523                                            0537 01576000
@RF00523 LA    @01,@AL00537                                        0537 01577000
         BAL   @14,OUTMSG                                          0537 01578000
*                   INDEX1 = INDEX1 + NEXTC + 1; /* NEXT OPERAND     */ 01579000
@RC00523 LR    @08,INDEX1                                          0538 01580000
         AL    @08,NEXTC                                           0538 01581000
         AL    @08,@CF00055                                        0538 01582000
         LR    INDEX1,@08                                          0538 01583000
*                 END;                                     /*@Z427VLS*/ 01584000
@DE00521 TM    RPORC,B'10000000'                                   0539 01585000
         BNZ   @DL00521                                            0539 01586000
*                 SERNUM = INDEX2;              /* STORE NUM OF ENTR */ 01587000
         L     @08,SERPTR(,R2)                                     0540 01588000
         L     @04,INDEX2                                          0540 01589000
         STH   @04,SERNUM(,@08)                                    0540 01590000
*                 /*                                         @Z427VLS*/ 01591000
*                 /* CHECK FOR DUPLICATE ENTRIES             @Z427VLS*/ 01592000
*                 /*                                         @Z427VLS*/ 01593000
*                 DO J = 1 TO SERNUM BY 1;                 /*@Z427VLS*/ 01594000
         LA    J,1                                                 0541 01595000
         B     @DE00541                                            0541 01596000
@DL00541 DS    0H                                                  0542 01597000
*                   DO I = J+1 TO SERNUM BY 1;             /*@Z427VLS*/ 01598000
         LA    I,1                                                 0542 01599000
         ALR   I,J                                                 0542 01600000
         B     @DE00542                                            0542 01601000
@DL00542 DS    0H                                                  0543 01602000
*                     IF SERVAL(J) = SERVAL(I) THEN                0543 01603000
         LR    @08,J                                               0543 01604000
         ALR   @08,@08                                             0543 01605000
         L     @07,SERPTR(,R2)                                     0543 01606000
         LR    @03,I                                               0543 01607000
         ALR   @03,@03                                             0543 01608000
         ALR   @08,@07                                             0543 01609000
         ALR   @03,@07                                             0543 01610000
         CLC   SERVAL-2(2,@08),SERVAL-2(@03)                       0543 01611000
         BNE   @RF00543                                            0543 01612000
*                       DO PLACE = (SERNUM - I) * 6 + 7;   /*@Z427VLS*/ 01613000
         LH    @08,SERNUM(,@07)                                    0544 01614000
         SLR   @08,I                                               0544 01615000
         MH    @08,@CH00081                                        0544 01616000
         AL    @08,@CF00083                                        0544 01617000
         ST    @08,PLACE                                           0544 01618000
*                         CALL OUTMSG(DUPE);               /*@Z427VLS*/ 01619000
         LA    @01,@AL00545                                        0545 01620000
         BAL   @14,OUTMSG                                          0545 01621000
*                       END;                               /*@Z427VLS*/ 01622000
*                   END;                                   /*@Z427VLS*/ 01623000
@RF00543 AL    I,@CF00055                                          0547 01624000
@DE00542 L     @08,SERPTR(,R2)                                     0547 01625000
         CH    I,SERNUM(,@08)                                      0547 01626000
         BNH   @DL00542                                            0547 01627000
*                 END;                                     /*@Z427VLS*/ 01628000
         AL    J,@CF00055                                          0548 01629000
@DE00541 L     @08,SERPTR(,R2)                                     0548 01630000
         CH    J,SERNUM(,@08)                                      0548 01631000
         BNH   @DL00541                                            0548 01632000
*                 PARMMES = ON;           /* ONLY FOR MES/THRESHOLD  */ 01633000
         OI    PARMMES(R2),B'01000000'                             0549 01634000
*               END;                                       /*@Z427VLS*/ 01635000
*END;                                                      /*@Z427VLS*/ 01636000
@EL00025 DS    0H                                                  0551 01637000
@EF00025 DS    0H                                                  0551 01638000
@ER00025 L     @14,@SA00025                                        0551 01639000
         L     @01,@SA00025+4                                      0551 01640000
         BR    @14                                                 0551 01641000
*/********************************************************************/ 01642000
*/*                                                          @Z427VLS*/ 01643000
*/*      SYNTAX CHECK FOR MOD   (NNN(,NNNN,...,NNN))         @Z427VLS*/ 01644000
*/*      MAXIMUM OF 8 ENTRIES                                @Z427VLS*/ 01645000
*/*                                                          @Z427VLS*/ 01646000
*/********************************************************************/ 01647000
*PARMMOD:  PROC OPTIONS(SAVE(1,14));                       /*@Z427VLS*/ 01648000
PARMMOD  ST    @14,@SA00026                                        0552 01649000
         ST    @01,@SA00026+4                                      0552 01650000
*             NEXTRPC = OFF;                 /* LOOK FOR R PAREN     */ 01651000
         NI    NEXTRPC,B'11111011'                                 0553 01652000
*             IF MODFLG = ON THEN            /* MODEL ALREADY SPEC   */ 01653000
         TM    MODFLG,B'00000100'                                  0554 01654000
         BNO   @RF00554                                            0554 01655000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01656000
         BAL   @14,DUPLICAT                                        0555 01657000
*             ELSE                                                 0556 01658000
*               DO INDEX1= INDEX1 + 5;       /* INCR OVER PARM       */ 01659000
         B     @RC00554                                            0556 01660000
@RF00554 LA    @08,5                                               0556 01661000
         ALR   @08,INDEX1                                          0556 01662000
         LR    INDEX1,@08                                          0556 01663000
*                 MODFLG = ON;                             /*@Z427VLS*/ 01664000
         OI    MODFLG,B'00000100'                                  0557 01665000
*                 /*                                         @Z427VLS*/ 01666000
*                 /* GET SPACE FOR TABLE.  ESTABLISH THE BASE POINTER*/ 01667000
*                 /* CLEAR THE TABLE.                        @Z427VLS*/ 01668000
*                 /*                                         @Z427VLS*/ 01669000
*                 RESPECIFY (R1) RESTRICTED;               /*@Z427VLS*/ 01670000
*                 R1 = 40;                                 /*@Z427VLS*/ 01671000
         LA    R1,40                                               0559 01672000
*                 GEN(GETMAIN R,LV=(1),SP=20);             /*@Z427VLS*/ 01673000
         GETMAIN R,LV=(1),SP=20                                         01674000
*                 MODPTR = R1;                             /*@Z427VLS*/ 01675000
         ST    R1,MODPTR(,R2)                                      0561 01676000
*                 RESPECIFY (R1) UNRESTRICTED;             /*@Z427VLS*/ 01677000
*                 INDEX2 = ZERO;                           /*@Z427VLS*/ 01678000
         SLR   @08,@08                                             0563 01679000
         ST    @08,INDEX2                                          0563 01680000
*                 MODELS = MODELS && MODELS;               /*@Z427VLS*/ 01681000
         L     @08,MODPTR(,R2)                                     0564 01682000
         XC    MODELS(10,@08),MODELS(@08)                          0564 01683000
*                 DO UNTIL (RPORC = OFF);                  /*@Z427VLS*/ 01684000
@DL00565 DS    0H                                                  0566 01685000
*                   CALL SCANCRP;              /* FIND TERMINATOR    */ 01686000
         BAL   @14,SCANCRP                                         0566 01687000
*                   FOUND = OFF;                           /*@Z427VLS*/ 01688000
         NI    FOUND,B'11101111'                                   0567 01689000
*                   /*                                       @Z427VLS*/ 01690000
*                   /* IF THE FIELD IS 3 CHARS LONG, INSERT A ZERO   */ 01691000
*                   /* IN FRONT OF THE FIELD AND CHANGE THE LENGTH   */ 01692000
*                   /* OF THE FIELD TO FOUR.                 @Z427VLS*/ 01693000
*                   /*                                       @Z427VLS*/ 01694000
*                   IF NEXTC = 3 THEN                              0568 01695000
         CLC   NEXTC(4),@CF00076                                   0568 01696000
         BNE   @RF00568                                            0568 01697000
*                     DO;                                  /*@Z427VLS*/ 01698000
*                       INDEX1 = INDEX1 - 1;               /*@Z427VLS*/ 01699000
         BCTR  INDEX1,0                                            0570 01700000
*                       PARMFLD(INDEX1) = '0';             /*@Z427VLS*/ 01701000
         LA    @08,PARMFLD-1(INDEX1)                               0571 01702000
         MVI   0(@08),C'0'                                         0571 01703000
*                       NEXTC = 4;                         /*@Z427VLS*/ 01704000
         MVC   NEXTC(4),@CF00064                                   0572 01705000
*                       PLACE = -1;                        /*@Z427VLS*/ 01706000
         MVC   PLACE(4),@CF00714                                   0573 01707000
*                     END;                                 /*@Z427VLS*/ 01708000
*                   /*                                       @Z427VLS*/ 01709000
*                   /* LOOK FOR THE MODEL IN THE CPUTABLE.  IF FOUND */ 01710000
*                   /* PLACE THE HEX CONVERSION IN THE LOOK UP TABLE */ 01711000
*                   /* FOR THE FILTER.                       @Z427VLS*/ 01712000
*                   /*                                       @Z427VLS*/ 01713000
*                   IF NEXTC = 4 THEN                              0575 01714000
@RF00568 CLC   NEXTC(4),@CF00064                                   0575 01715000
         BNE   @RF00575                                            0575 01716000
*                     DO I = DIM(CPUTABLE) TO 1 BY -1              0576 01717000
*                                    WHILE (FOUND = OFF);  /*@Z427VLS*/ 01718000
         LA    I,14                                                0576 01719000
@DL00576 TM    FOUND,B'00010000'                                   0576 01720000
         BNZ   @DC00576                                            0576 01721000
*                       IF PARMFLD(INDEX1:INDEX1+3) = CPUEBDIC(I) THEN  01722000
         LR    @08,I                                               0577 01723000
         MH    @08,@CH00081                                        0577 01724000
         LA    @07,PARMFLD-1(INDEX1)                               0577 01725000
         LA    @04,CPUEBDIC-6(@08)                                 0577 01726000
         CLC   0(4,@07),0(@04)                                     0577 01727000
         BNE   @RF00577                                            0577 01728000
*                         DO;                              /*@Z427VLS*/ 01729000
*                           FOUND = ON;                    /*@Z427VLS*/ 01730000
         OI    FOUND,B'00010000'                                   0579 01731000
*                           /*                               @Z427VLS*/ 01732000
*                           /* DETERMINE INDEX AND STORE VALUE.      */ 01733000
*                           /*                               @Z427VLS*/ 01734000
*                           IF INDEX2 < DIM(MODVAL) THEN           0580 01735000
         L     @08,INDEX2                                          0580 01736000
         C     @08,@CF00064                                        0580 01737000
         BNL   @RF00580                                            0580 01738000
*                             INDEX2 = INDEX2 + 1;         /*@Z427VLS*/ 01739000
         AL    @08,@CF00055                                        0581 01740000
         ST    @08,INDEX2                                          0581 01741000
*                           ELSE                                   0582 01742000
*                             CALL OUTMSG(SYNTAX);         /*@Z427VLS*/ 01743000
         B     @RC00580                                            0582 01744000
@RF00580 LA    @01,@AL00582                                        0582 01745000
         BAL   @14,OUTMSG                                          0582 01746000
*                           /*                               @Z427VLS*/ 01747000
*                           /* STORE VALUE.                  @Z427VLS*/ 01748000
*                           /*                               @Z427VLS*/ 01749000
*                           IF CPUNO(I) = HEXZEROS THEN            0583 01750000
@RC00580 LR    @08,I                                               0583 01751000
         MH    @08,@CH00081                                        0583 01752000
         LA    @07,CPUNO-6(@08)                                    0583 01753000
         CLC   0(2,@07),@CB00208                                   0583 01754000
         BNE   @RF00583                                            0583 01755000
*                             CALL OUTMSG(DUPE);           /*@Z427VLS*/ 01756000
         LA    @01,@AL00584                                        0584 01757000
         BAL   @14,OUTMSG                                          0584 01758000
*                           ELSE                                   0585 01759000
*                             DO;                          /*@Z427VLS*/ 01760000
         B     @RC00583                                            0585 01761000
@RF00583 DS    0H                                                  0586 01762000
*                               MODVAL(INDEX2) = CPUNO(I); /*@Z427VLS*/ 01763000
         L     @08,INDEX2                                          0586 01764000
         ALR   @08,@08                                             0586 01765000
         L     @07,MODPTR(,R2)                                     0586 01766000
         ALR   @07,@08                                             0586 01767000
         LR    @08,I                                               0586 01768000
         MH    @08,@CH00081                                        0586 01769000
         LA    @04,CPUNO-6(@08)                                    0586 01770000
         MVC   MODVAL-2(2,@07),0(@04)                              0586 01771000
*                               CPUNO(I) = HEXZEROS;       /*@Z427VLS*/ 01772000
         LA    @07,CPUNO-6(@08)                                    0587 01773000
         MVC   0(2,@07),@CB00208                                   0587 01774000
*                             END;                         /*@Z427VLS*/ 01775000
*                         END;                             /*@Z427VLS*/ 01776000
@RC00583 DS    0H                                                  0590 01777000
*                     END;                                 /*@Z427VLS*/ 01778000
@RF00577 BCTR  I,0                                                 0590 01779000
         LTR   I,I                                                 0590 01780000
         BP    @DL00576                                            0590 01781000
@DC00576 DS    0H                                                  0591 01782000
*                   IF FOUND = OFF THEN                            0591 01783000
@RF00575 TM    FOUND,B'00010000'                                   0591 01784000
         BNZ   @RF00591                                            0591 01785000
*                     CALL OUTMSG(SYNTAX);                 /*@Z427VLS*/ 01786000
         LA    @01,@AL00592                                        0592 01787000
         BAL   @14,OUTMSG                                          0592 01788000
*                   INDEX1 = INDEX1 + NEXTC + 1;           /*@Z427VLS*/ 01789000
@RF00591 LR    @08,INDEX1                                          0593 01790000
         AL    @08,NEXTC                                           0593 01791000
         AL    @08,@CF00055                                        0593 01792000
         LR    INDEX1,@08                                          0593 01793000
*                   PLACE = ZERO;                          /*@Z427VLS*/ 01794000
         SLR   @08,@08                                             0594 01795000
         ST    @08,PLACE                                           0594 01796000
*                 END;                                     /*@Z427VLS*/ 01797000
@DE00565 TM    RPORC,B'10000000'                                   0595 01798000
         BNZ   @DL00565                                            0595 01799000
*                 MODNUM = INDEX2;        /* STORE # OF ENTRIES     */  01800000
         L     @08,MODPTR(,R2)                                     0596 01801000
         L     @04,INDEX2                                          0596 01802000
         STH   @04,MODNUM(,@08)                                    0596 01803000
*               END;                                       /*@Z427VLS*/ 01804000
*END;                                                      /*@Z427VLS*/ 01805000
@EL00026 DS    0H                                                  0598 01806000
@EF00026 DS    0H                                                  0598 01807000
@ER00026 L     @14,@SA00026                                        0598 01808000
         L     @01,@SA00026+4                                      0598 01809000
         BR    @14                                                 0598 01810000
*/********************************************************************/ 01811000
*/*                                                          @Z427VLS*/ 01812000
*/*      SYNTAX CHECK FOR TERMN (1-8 ALPHANUMERIC CHARACTERS)        */ 01813000
*/*                                                          @Z427VLS*/ 01814000
*/********************************************************************/ 01815000
*PARMTERM:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01816000
PARMTERM ST    @14,@SA00027                                        0599 01817000
         ST    @01,@SA00027+4                                      0599 01818000
*             IF TERMFLG = ON THEN           /* TERMN ALREADY SPECIF */ 01819000
         TM    TERMFLG,B'00001000'                                 0600 01820000
         BNO   @RF00600                                            0600 01821000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 01822000
         BAL   @14,DUPLICAT                                        0601 01823000
*             ELSE                                                 0602 01824000
*               DO INDEX1 = INDEX1 + 6;      /* INCR OVER PARM       */ 01825000
         B     @RC00600                                            0602 01826000
@RF00600 LA    @08,6                                               0602 01827000
         ALR   @08,INDEX1                                          0602 01828000
         LR    INDEX1,@08                                          0602 01829000
*                 TERMFLG = ON;                            /*@Z427VLS*/ 01830000
         OI    TERMFLG,B'00001000'                                 0603 01831000
*                 /*                                         @Z427VLS*/ 01832000
*                 /* FIND THE TERMINATOR.  IF THE LENGTH IS BAD, O/P */ 01833000
*                 /* AN ERROR  MESSAGE.  ELSE MOVE IN THE CORRECT    */ 01834000
*                 /* FIELD.                                  @Z427VLS*/ 01835000
*                 /*                                         @Z427VLS*/ 01836000
*                 CALL SCANC;                              /*@Z427VLS*/ 01837000
         BAL   @14,SCANC                                           0604 01838000
*                 IF NEXTC = 0 | NEXTC > 8 THEN                    0605 01839000
         L     @08,NEXTC                                           0605 01840000
         LTR   @08,@08                                             0605 01841000
         BZ    @RT00605                                            0605 01842000
         C     @08,@CF00066                                        0605 01843000
         BNH   @RF00605                                            0605 01844000
@RT00605 DS    0H                                                  0606 01845000
*                   CALL OUTMSG(SYNTAX);                   /*@Z427VLS*/ 01846000
         LA    @01,@AL00606                                        0606 01847000
         BAL   @14,OUTMSG                                          0606 01848000
*                 ELSE                                             0607 01849000
*                   DO;                                    /*@Z427VLS*/ 01850000
         B     @RC00605                                            0607 01851000
@RF00605 DS    0H                                                  0608 01852000
*                     TERM (1:NEXTC) = PARMFLD(INDEX1:INDEX1+NEXTC-1);  01853000
         L     @08,NEXTC                                           0608 01854000
         BCTR  @08,0                                               0608 01855000
         LA    @04,PARMFLD-1(INDEX1)                               0608 01856000
         EX    @08,@SM01051                                        0608 01857000
*                     VALID = OFF;                         /*@Z427VLS*/ 01858000
         NI    VALID,B'01111111'                                   0609 01859000
*                     DO J = 11 TO 38 WHILE (VALID = OFF); /*@Z427VLS*/ 01860000
         LA    J,11                                                0610 01861000
@DL00610 TM    VALID,B'10000000'                                   0610 01862000
         BNZ   @DC00610                                            0610 01863000
*                       /*                                   @Z427VLS*/ 01864000
*                       /* FIRST CHARACTER MUST BE ALPHABETIC        */ 01865000
*                       /*                                   @Z427VLS*/ 01866000
*                       IF PARMFLD(INDEX1) = TABLE(J) THEN         0611 01867000
         LA    @08,PARMFLD-1(INDEX1)                               0611 01868000
         LA    @03,TABLE-1(J)                                      0611 01869000
         CLC   0(1,@08),0(@03)                                     0611 01870000
         BNE   @RF00611                                            0611 01871000
*                         VALID = ON;                      /*@Z427VLS*/ 01872000
         OI    VALID,B'10000000'                                   0612 01873000
*                     END;                                 /*@Z427VLS*/ 01874000
@RF00611 AL    J,@CF00055                                          0613 01875000
         C     J,@CF00812                                          0613 01876000
         BNH   @DL00610                                            0613 01877000
@DC00610 DS    0H                                                  0614 01878000
*                     IF VALID = OFF THEN                          0614 01879000
         TM    VALID,B'10000000'                                   0614 01880000
         BNZ   @RF00614                                            0614 01881000
*                         CALL OUTMSG(SYNTAX);             /*@Z427VLS*/ 01882000
         LA    @01,@AL00615                                        0615 01883000
         BAL   @14,OUTMSG                                          0615 01884000
*                     VALID = OFF;                         /*@Z427VLS*/ 01885000
@RF00614 NI    VALID,B'01111111'                                   0616 01886000
*                     INDEX3 = INDEX1 + NEXTC - 1;         /*@Z427VLS*/ 01887000
         LR    @08,INDEX1                                          0617 01888000
         AL    @08,NEXTC                                           0617 01889000
         BCTR  @08,0                                               0617 01890000
         ST    @08,INDEX3                                          0617 01891000
*                     DO J = INDEX1+1 TO INDEX3 WHILE (VALID = OFF);    01892000
         LA    J,1                                                 0618 01893000
         ALR   J,INDEX1                                            0618 01894000
         B     @DE00618                                            0618 01895000
@DL00618 TM    VALID,B'10000000'                                   0618 01896000
         BNZ   @DC00618                                            0618 01897000
*                       /*                                   @Z427VLS*/ 01898000
*                       /* CHECK FOR VALID CHARACTERS        @Z427VLS*/ 01899000
*                       /*                                   @Z427VLS*/ 01900000
*                       FOUND = OFF;                       /*@Z427VLS*/ 01901000
         NI    FOUND,B'11101111'                                   0619 01902000
*                       DO I = 1 TO 40 WHILE (FOUND = OFF);/*@Z427VLS*/ 01903000
         LA    I,1                                                 0620 01904000
@DL00620 TM    FOUND,B'00010000'                                   0620 01905000
         BNZ   @DC00620                                            0620 01906000
*                         IF PARMFLD(J) = TABLE(I) THEN            0621 01907000
         LA    @08,PARMFLD-1(J)                                    0621 01908000
         LA    @07,TABLE-1(I)                                      0621 01909000
         CLC   0(1,@08),0(@07)                                     0621 01910000
         BNE   @RF00621                                            0621 01911000
*                           DO;                            /*@Z427VLS*/ 01912000
*                             FOUND = ON;                  /*@Z427VLS*/ 01913000
         OI    FOUND,B'00010000'                                   0623 01914000
*                             IF I = 40 THEN   /* BLANKS     @Z427VLS*/ 01915000
         C     I,@CF00807                                          0624 01916000
         BNE   @RF00624                                            0624 01917000
*                               DO;                        /*@Z427VLS*/ 01918000
*                                 VALID = ON;              /*@Z427VLS*/ 01919000
         OI    VALID,B'10000000'                                   0626 01920000
*                                 PARMPTR = J + 1;         /*@Z427VLS*/ 01921000
         LA    @08,1                                               0627 01922000
         ALR   @08,J                                               0627 01923000
         ST    @08,PARMPTR(,R1)                                    0627 01924000
*                               END;                       /*@Z427VLS*/ 01925000
*                           END;                           /*@Z427VLS*/ 01926000
@RF00624 DS    0H                                                  0630 01927000
*                       END;                               /*@Z427VLS*/ 01928000
@RF00621 AL    I,@CF00055                                          0630 01929000
         C     I,@CF00807                                          0630 01930000
         BNH   @DL00620                                            0630 01931000
@DC00620 DS    0H                                                  0631 01932000
*                       IF FOUND = OFF THEN                        0631 01933000
         TM    FOUND,B'00010000'                                   0631 01934000
         BNZ   @RF00631                                            0631 01935000
*                         DO PLACE = INDEX1 - J;           /*@Z427VLS*/ 01936000
         LR    @08,INDEX1                                          0632 01937000
         SLR   @08,J                                               0632 01938000
         ST    @08,PLACE                                           0632 01939000
*                           CALL OUTMSG(SYNTAX);           /*@Z427VLS*/ 01940000
         LA    @01,@AL00633                                        0633 01941000
         BAL   @14,OUTMSG                                          0633 01942000
*                         END;                             /*@Z427VLS*/ 01943000
*                     END;                                 /*@Z427VLS*/ 01944000
@RF00631 AL    J,@CF00055                                          0635 01945000
@DE00618 C     J,INDEX3                                            0635 01946000
         BNH   @DL00618                                            0635 01947000
@DC00618 DS    0H                                                  0636 01948000
*                     IF VALID = ON THEN                           0636 01949000
         TM    VALID,B'10000000'                                   0636 01950000
         BNO   @RF00636                                            0636 01951000
*                       /*                                   @Z427VLS*/ 01952000
*                       /* CHECK FOR TRAILING BLANKS         @Z427VLS*/ 01953000
*                       /*                                   @Z427VLS*/ 01954000
*                       DO J = PARMPTR TO INDEX3;          /*@Z427VLS*/ 01955000
         L     J,PARMPTR(,R1)                                      0637 01956000
         B     @DE00637                                            0637 01957000
@DL00637 DS    0H                                                  0638 01958000
*                         IF PARMFLD(J) ^= TABLE(40) THEN          0638 01959000
         LA    @08,PARMFLD-1(J)                                    0638 01960000
         CLC   0(1,@08),TABLE+39                                   0638 01961000
         BE    @RF00638                                            0638 01962000
*                           DO PLACE = INDEX1 - J;         /*@Z427VLS*/ 01963000
         LR    @08,INDEX1                                          0639 01964000
         SLR   @08,J                                               0639 01965000
         ST    @08,PLACE                                           0639 01966000
*                             CALL OUTMSG(SYNTAX);         /*@Z427VLS*/ 01967000
         LA    @01,@AL00640                                        0640 01968000
         BAL   @14,OUTMSG                                          0640 01969000
*                           END;                           /*@Z427VLS*/ 01970000
*                       END;                               /*@Z427VLS*/ 01971000
@RF00638 AL    J,@CF00055                                          0642 01972000
@DE00637 C     J,INDEX3                                            0642 01973000
         BNH   @DL00637                                            0642 01974000
*                   END;                                   /*@Z427VLS*/ 01975000
@RF00636 DS    0H                                                  0644 01976000
*                 INDEX1 = INDEX1 + NEXTC;                 /*@Z427VLS*/ 01977000
@RC00605 AL    INDEX1,NEXTC                                        0644 01978000
*               END;                                       /*@Z427VLS*/ 01979000
*END;                                                      /*@Z427VLS*/ 01980000
@EL00027 DS    0H                                                  0646 01981000
@EF00027 DS    0H                                                  0646 01982000
@ER00027 L     @14,@SA00027                                        0646 01983000
         L     @01,@SA00027+4                                      0646 01984000
         BR    @14                                                 0646 01985000
*/********************************************************************/ 01986000
*/*                                                          @Z427VLS*/ 01987000
*/*      SYNTAX CHECK FOR VOLID (UP TO 4 1-6 ALPHANUMERIC CHARS)     */ 01988000
*/*      MAXIMUM OF 4 ENTRIES                                @Z427VLS*/ 01989000
*/*                                                          @Z427VLS*/ 01990000
*/********************************************************************/ 01991000
*PARMVOL:   PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 01992000
PARMVOL  ST    @14,@SA00028                                        0647 01993000
         ST    @01,@SA00028+4                                      0647 01994000
*             NEXTRPC = OFF;                  /* LOOK FOR R PAREN    */ 01995000
         NI    NEXTRPC,B'11111011'                                 0648 01996000
*             IF VOLFLG = ON THEN             /* VOLID ALREADY SPEC  */ 01997000
         TM    VOLFLG,B'00100000'                                  0649 01998000
         BNO   @RF00649                                            0649 01999000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 02000000
         BAL   @14,DUPLICAT                                        0650 02001000
*             ELSE                                                 0651 02002000
*               DO INDEX1 = INDEX1 + 7;       /* INCR OVER  PARM     */ 02003000
         B     @RC00649                                            0651 02004000
@RF00649 LA    @08,7                                               0651 02005000
         ALR   @08,INDEX1                                          0651 02006000
         LR    INDEX1,@08                                          0651 02007000
*                 VOLFLG = ON;                             /*@Z427VLS*/ 02008000
         OI    VOLFLG,B'00100000'                                  0652 02009000
*                 /*                                         @Z427VLS*/ 02010000
*                 /* GET CORE FOR THE TABLE.  CLEAR IT.  ESTABLISH   */ 02011000
*                 /* THE BASE POINTER.                       @Z427VLS*/ 02012000
*                 /*                                         @Z427VLS*/ 02013000
*                 RESPECIFY (R1) RESTRICTED;               /*@Z427VLS*/ 02014000
*                 R1 = 32;                                 /*@Z427VLS*/ 02015000
         LA    R1,32                                               0654 02016000
*                 GEN(GETMAIN R,LV=(1),SP=20);             /*@Z427VLS*/ 02017000
         GETMAIN R,LV=(1),SP=20                                         02018000
*                 VOLPTR = R1;                             /*@Z427VLS*/ 02019000
         ST    R1,VOLPTR(,R2)                                      0656 02020000
*                 RESPECIFY (R1) UNRESTRICTED;             /*@Z427VLS*/ 02021000
*                 VOLUME = VOLUME && VOLUME;               /*@Z427VLS*/ 02022000
         L     @08,VOLPTR(,R2)                                     0658 02023000
         XC    VOLUME(26,@08),VOLUME(@08)                          0658 02024000
*                 INDEX2 = ZERO;                           /*@Z427VLS*/ 02025000
         SLR   @08,@08                                             0659 02026000
         ST    @08,INDEX2                                          0659 02027000
*                 DO UNTIL (RPORC = OFF);                  /*@Z427VLS*/ 02028000
@DL00660 DS    0H                                                  0661 02029000
*                   /*                                       @Z427VLS*/ 02030000
*                   /* FIND THE DELIMITER.  IF THE LENGTH IS GREATER */ 02031000
*                   /* THAN 6, IT IS AN ERROR.               @Z427VLS*/ 02032000
*                   /*                                       @Z427VLS*/ 02033000
*                   CALL SCANCRP;                          /*@Z427VLS*/ 02034000
         BAL   @14,SCANCRP                                         0661 02035000
*                   IF NEXTC = 0 | NEXTC > 6 THEN                  0662 02036000
         L     @08,NEXTC                                           0662 02037000
         LTR   @08,@08                                             0662 02038000
         BZ    @RT00662                                            0662 02039000
         C     @08,@CF00081                                        0662 02040000
         BNH   @RF00662                                            0662 02041000
@RT00662 DS    0H                                                  0663 02042000
*                     CALL OUTMSG(SYNTAX);                 /*@Z427VLS*/ 02043000
         LA    @01,@AL00663                                        0663 02044000
         BAL   @14,OUTMSG                                          0663 02045000
*                   ELSE                                           0664 02046000
*                     DO;                                  /*@Z427VLS*/ 02047000
         B     @RC00662                                            0664 02048000
@RF00662 DS    0H                                                  0665 02049000
*                       /*                                   @Z427VLS*/ 02050000
*                       /* DETERMINE THE PROPER INDEX.  MOVE IN THE  */ 02051000
*                       /* DATA.                             @Z427VLS*/ 02052000
*                       /*                                   @Z427VLS*/ 02053000
*                       IF INDEX2 < DIM(VOLVAL) THEN               0665 02054000
         L     @08,INDEX2                                          0665 02055000
         C     @08,@CF00064                                        0665 02056000
         BNL   @RF00665                                            0665 02057000
*                         INDEX2 = INDEX2 + 1;             /*@Z427VLS*/ 02058000
         AL    @08,@CF00055                                        0666 02059000
         ST    @08,INDEX2                                          0666 02060000
*                       ELSE                                       0667 02061000
*                         CALL OUTMSG(SYNTAX);             /*@Z427VLS*/ 02062000
         B     @RC00665                                            0667 02063000
@RF00665 LA    @01,@AL00667                                        0667 02064000
         BAL   @14,OUTMSG                                          0667 02065000
*                       INDEX3 = INDEX1 + NEXTC - 1;       /*@Z427VLS*/ 02066000
@RC00665 LR    @08,INDEX1                                          0668 02067000
         AL    @08,NEXTC                                           0668 02068000
         BCTR  @08,0                                               0668 02069000
         ST    @08,INDEX3                                          0668 02070000
*                       VALID = OFF;                       /*@Z427VLS*/ 02071000
         NI    VALID,B'01111111'                                   0669 02072000
*                       DO J = INDEX1 TO INDEX3 WHILE(VALID=OFF);  0670 02073000
         LR    J,INDEX1                                            0670 02074000
         B     @DE00670                                            0670 02075000
@DL00670 TM    VALID,B'10000000'                                   0670 02076000
         BNZ   @DC00670                                            0670 02077000
*                       /*                                   @Z427VLS*/ 02078000
*                       /* VALIDATE FOR LEGAL CHARACTERS     @Z427VLS*/ 02079000
*                       /*                                   @Z427VLS*/ 02080000
*                         FOUND = OFF;                     /*@Z427VLS*/ 02081000
         NI    FOUND,B'11101111'                                   0671 02082000
*                         DO I = 1 TO 41 WHILE (FOUND = OFF);      0672 02083000
         LA    I,1                                                 0672 02084000
@DL00672 TM    FOUND,B'00010000'                                   0672 02085000
         BNZ   @DC00672                                            0672 02086000
*                           IF PARMFLD(J) = TABLE(I) THEN          0673 02087000
         LA    @08,PARMFLD-1(J)                                    0673 02088000
         LA    @07,TABLE-1(I)                                      0673 02089000
         CLC   0(1,@08),0(@07)                                     0673 02090000
         BNE   @RF00673                                            0673 02091000
*                             DO;                          /*@Z427VLS*/ 02092000
*                               FOUND = ON;       /* END SCAN        */ 02093000
         OI    FOUND,B'00010000'                                   0675 02094000
*                               IF I = 40 THEN    /* A BLANK @Z427VLS*/ 02095000
         C     I,@CF00807                                          0676 02096000
         BNE   @RF00676                                            0676 02097000
*                                 DO;                      /*@Z427VLS*/ 02098000
*                                   VALID = ON;            /*@Z427VLS*/ 02099000
         OI    VALID,B'10000000'                                   0678 02100000
*                                   PARMPTR = J + 1;  /*SAVE LOCATION*/ 02101000
         LA    @08,1                                               0679 02102000
         ALR   @08,J                                               0679 02103000
         ST    @08,PARMPTR(,R1)                                    0679 02104000
*                                 END;                     /*@Z427VLS*/ 02105000
*                             END;                         /*@Z427VLS*/ 02106000
@RF00676 DS    0H                                                  0682 02107000
*                         END;                             /*@Z427VLS*/ 02108000
@RF00673 AL    I,@CF00055                                          0682 02109000
         C     I,@CF00532                                          0682 02110000
         BNH   @DL00672                                            0682 02111000
@DC00672 DS    0H                                                  0683 02112000
*                         IF FOUND = OFF THEN                      0683 02113000
         TM    FOUND,B'00010000'                                   0683 02114000
         BNZ   @RF00683                                            0683 02115000
*                           DO PLACE = INDEX1 - J;         /*@Z427VLS*/ 02116000
         LR    @08,INDEX1                                          0684 02117000
         SLR   @08,J                                               0684 02118000
         ST    @08,PLACE                                           0684 02119000
*                             CALL OUTMSG(SYNTAX);         /*@Z427VLS*/ 02120000
         LA    @01,@AL00685                                        0685 02121000
         BAL   @14,OUTMSG                                          0685 02122000
*                           END;                           /*@Z427VLS*/ 02123000
*                       END;                               /*@Z427VLS*/ 02124000
@RF00683 AL    J,@CF00055                                          0687 02125000
@DE00670 C     J,INDEX3                                            0687 02126000
         BNH   @DL00670                                            0687 02127000
@DC00670 DS    0H                                                  0688 02128000
*                       IF VALID = ON THEN                         0688 02129000
         TM    VALID,B'10000000'                                   0688 02130000
         BNO   @RF00688                                            0688 02131000
*                         /*                                 @Z427VLS*/ 02132000
*                         /* CHECK FOR TRAILING BLANKS.      @Z427VLS*/ 02133000
*                         /*                                 @Z427VLS*/ 02134000
*                         DO J = PARMPTR TO INDEX3;        /*@Z427VLS*/ 02135000
         L     J,PARMPTR(,R1)                                      0689 02136000
         B     @DE00689                                            0689 02137000
@DL00689 DS    0H                                                  0690 02138000
*                           IF PARMFLD(J) ^= TABLE(40) THEN        0690 02139000
         LA    @08,PARMFLD-1(J)                                    0690 02140000
         CLC   0(1,@08),TABLE+39                                   0690 02141000
         BE    @RF00690                                            0690 02142000
*                             DO PLACE = INDEX1 - J;       /*@Z427VLS*/ 02143000
         LR    @08,INDEX1                                          0691 02144000
         SLR   @08,J                                               0691 02145000
         ST    @08,PLACE                                           0691 02146000
*                               CALL OUTMSG(SYNTAX);       /*@Z427VLS*/ 02147000
         LA    @01,@AL00692                                        0692 02148000
         BAL   @14,OUTMSG                                          0692 02149000
*                             END;                         /*@Z427VLS*/ 02150000
*                         END;                             /*@Z427VLS*/ 02151000
@RF00690 AL    J,@CF00055                                          0694 02152000
@DE00689 C     J,INDEX3                                            0694 02153000
         BNH   @DL00689                                            0694 02154000
*                       VOLVAL(INDEX2) =                           0695 02155000
*                                  PARMFLD(INDEX1:INDEX1+NEXTC-1); 0695 02156000
@RF00688 L     @08,INDEX2                                          0695 02157000
         MH    @08,@CH00081                                        0695 02158000
         L     @04,VOLPTR(,R2)                                     0695 02159000
         ALR   @04,@08                                             0695 02160000
         AL    @04,@CF01053                                        0695 02161000
         MVI   VOLVAL-1(@04),C' '                                  0695 02162000
         MVC   VOLVAL(4,@04),VOLVAL-1(@04)                         0695 02163000
         L     @08,NEXTC                                           0695 02164000
         BCTR  @08,0                                               0695 02165000
         LA    @03,PARMFLD-1(INDEX1)                               0695 02166000
         EX    @08,@SM01054                                        0695 02167000
*                     END;                                 /*@Z427VLS*/ 02168000
*                   INDEX1 = INDEX1 + NEXTC + 1;           /*@Z427VLS*/ 02169000
@RC00662 LR    @08,INDEX1                                          0697 02170000
         AL    @08,NEXTC                                           0697 02171000
         AL    @08,@CF00055                                        0697 02172000
         LR    INDEX1,@08                                          0697 02173000
*                 END;                                     /*@Z427VLS*/ 02174000
@DE00660 TM    RPORC,B'10000000'                                   0698 02175000
         BNZ   @DL00660                                            0698 02176000
*                 VOLNUM = INDEX2;                /* STORE # OF ENTR */ 02177000
         L     @08,VOLPTR(,R2)                                     0699 02178000
         L     @04,INDEX2                                          0699 02179000
         STH   @04,VOLNUM(,@08)                                    0699 02180000
*                 /*                                         @Z427VLS*/ 02181000
*                 /* CHECK FOR DUPLICATE ENTRIES             @Z427VLS*/ 02182000
*                 /*                                         @Z427VLS*/ 02183000
*                 DO J = 1 TO VOLNUM BY 1;                 /*@Z427VLS*/ 02184000
         LA    J,1                                                 0700 02185000
         B     @DE00700                                            0700 02186000
@DL00700 DS    0H                                                  0701 02187000
*                   DO I = J+1 TO VOLNUM BY 1;             /*@Z427VLS*/ 02188000
         LA    I,1                                                 0701 02189000
         ALR   I,J                                                 0701 02190000
         B     @DE00701                                            0701 02191000
@DL00701 DS    0H                                                  0702 02192000
*                     IF VOLVAL(J) = VOLVAL(I) THEN                0702 02193000
         LA    @08,6                                               0702 02194000
         LR    @01,J                                               0702 02195000
         MR    @00,@08                                             0702 02196000
         L     @07,VOLPTR(,R2)                                     0702 02197000
         LR    @15,I                                               0702 02198000
         MR    @14,@08                                             0702 02199000
         ALR   @01,@07                                             0702 02200000
         AL    @01,@CF01053                                        0702 02201000
         ALR   @15,@07                                             0702 02202000
         AL    @15,@CF01053                                        0702 02203000
         CLC   VOLVAL-2(6,@01),VOLVAL-2(@15)                       0702 02204000
         BNE   @RF00702                                            0702 02205000
*                       DO PLACE = (VOLNUM - I) * 6 + 7;   /*@Z427VLS*/ 02206000
         LH    @01,VOLNUM(,@07)                                    0703 02207000
         SLR   @01,I                                               0703 02208000
         MR    @00,@08                                             0703 02209000
         AL    @01,@CF00083                                        0703 02210000
         ST    @01,PLACE                                           0703 02211000
*                         CALL OUTMSG (DUPE);              /*@Z427VLS*/ 02212000
         LA    @01,@AL00704                                        0704 02213000
         BAL   @14,OUTMSG                                          0704 02214000
*                       END;                               /*@Z427VLS*/ 02215000
*                   END;                                   /*@Z427VLS*/ 02216000
@RF00702 AL    I,@CF00055                                          0706 02217000
@DE00701 L     @08,VOLPTR(,R2)                                     0706 02218000
         CH    I,VOLNUM(,@08)                                      0706 02219000
         BNH   @DL00701                                            0706 02220000
*                 END;                                     /*@Z427VLS*/ 02221000
         AL    J,@CF00055                                          0707 02222000
@DE00700 L     @08,VOLPTR(,R2)                                     0707 02223000
         CH    J,VOLNUM(,@08)                                      0707 02224000
         BNH   @DL00700                                            0707 02225000
*               END;                                       /*@Z427VLS*/ 02226000
*END;                                                      /*@Z427VLS*/ 02227000
@EL00028 DS    0H                                                  0709 02228000
@EF00028 DS    0H                                                  0709 02229000
@ER00028 L     @14,@SA00028                                        0709 02230000
         L     @01,@SA00028+4                                      0709 02231000
         BR    @14                                                 0709 02232000
*/********************************************************************/ 02233000
*/*                                                          @Z427VLS*/ 02234000
*/*      SYNTAX CHECK FOR TYPE (MCOSIHDET)                   @Z427VLS*/ 02235000
*/*                                                          @Z427VLS*/ 02236000
*/********************************************************************/ 02237000
*PARMTYPE:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 02238000
PARMTYPE ST    @14,@SA00029                                        0710 02239000
         ST    @01,@SA00029+4                                      0710 02240000
*             IF TYPEFLG = ON THEN            /* TYPE ALREADY SPECIF */ 02241000
         TM    TYPEFLG,B'10000000'                                 0711 02242000
         BNO   @RF00711                                            0711 02243000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 02244000
         BAL   @14,DUPLICAT                                        0712 02245000
*             ELSE                                                 0713 02246000
*               DO INDEX1 = INDEX1 + 5;       /* INCR OVER PARM      */ 02247000
         B     @RC00711                                            0713 02248000
@RF00711 LA    @08,5                                               0713 02249000
         ALR   @08,INDEX1                                          0713 02250000
         LR    INDEX1,@08                                          0713 02251000
*                 TYPEFLG = ON;                            /*@Z427VLS*/ 02252000
         OI    TYPEFLG,B'10000000'                                 0714 02253000
*                 RECTYPE = RECTYPE && RECTYPE;  /* CLEAR FIELD      */ 02254000
         XC    RECTYPE(2,R2),RECTYPE(R2)                           0715 02255000
*                 DO WHILE (PARMFLD(INDEX1) ^= COMMA);     /*@Z427VLS*/ 02256000
         B     @DE00716                                            0716 02257000
@DL00716 DS    0H                                                  0717 02258000
*                   FOUND = OFF;                           /*@Z427VLS*/ 02259000
         NI    FOUND,B'11101111'                                   0717 02260000
*                   /*                                       @Z427VLS*/ 02261000
*                   /* DETERMINE WHICH BIT THE REQUESTED RECORD TYPE */ 02262000
*                   /* CORRESPONDS TO IN THE FIELD.          @Z427VLS*/ 02263000
*                   /*                                       @Z427VLS*/ 02264000
*                   DO I = 9 TO 1 BY -1 WHILE(FOUND = OFF);/*@Z427VLS*/ 02265000
         LA    I,9                                                 0718 02266000
@DL00718 TM    FOUND,B'00010000'                                   0718 02267000
         BNZ   @DC00718                                            0718 02268000
*                     IF PARMFLD(INDEX1) = TYPETAB(I) THEN         0719 02269000
         LA    @08,PARMFLD-1(INDEX1)                               0719 02270000
         LA    @07,TYPETAB-1(I)                                    0719 02271000
         CLC   0(1,@08),0(@07)                                     0719 02272000
         BNE   @RF00719                                            0719 02273000
*                       FOUND = ON;                        /*@Z427VLS*/ 02274000
         OI    FOUND,B'00010000'                                   0720 02275000
*                   END;                                   /*@Z427VLS*/ 02276000
@RF00719 BCTR  I,0                                                 0721 02277000
         LTR   I,I                                                 0721 02278000
         BP    @DL00718                                            0721 02279000
@DC00718 DS    0H                                                  0722 02280000
*                   IF FOUND = OFF THEN                            0722 02281000
         TM    FOUND,B'00010000'                                   0722 02282000
         BNZ   @RF00722                                            0722 02283000
*                     CALL OUTMSG (SYNTAX);                /*@Z427VLS*/ 02284000
         LA    @01,@AL00723                                        0723 02285000
         BAL   @14,OUTMSG                                          0723 02286000
*                   ELSE                                           0724 02287000
*                    DO;                                   /*@Z427VLS*/ 02288000
         B     @RC00722                                            0724 02289000
@RF00722 DS    0H                                                  0725 02290000
*                   /*                                       @Z427VLS*/ 02291000
*                   /* SET UP A MASK TO DETERMINE IF THE RECORD TYPE */ 02292000
*                   /* HAS ALREADY BEEN SPECIFIED.           @Z427VLS*/ 02293000
*                      SWITCHON = EIGHTX;                  /*@Z427VLS*/ 02294000
         MVC   SWITCHON(2),@CB00198                                0725 02295000
*                      SRL (SWITCHON,I);                   /*@Z427VLS*/ 02296000
         SLR   @08,@08                                             0726 02297000
         ICM   @08,3,SWITCHON                                      0726 02298000
         SRL   @08,0(I)                                            0726 02299000
         STCM  @08,3,SWITCHON                                      0726 02300000
*                      IF (RECTYPE & SWITCHON) = SWITCHON THEN     0727 02301000
         MVC   @TS00001(2),RECTYPE(R2)                             0727 02302000
         NC    @TS00001(2),SWITCHON                                0727 02303000
         CLC   @TS00001(2),SWITCHON                                0727 02304000
         BNE   @RF00727                                            0727 02305000
*                        CALL OUTMSG(DUPE);                /*@Z427VLS*/ 02306000
         LA    @01,@AL00728                                        0728 02307000
         BAL   @14,OUTMSG                                          0728 02308000
*                      ELSE                                        0729 02309000
*                        RECTYPE =  RECTYPE | SWITCHON;    /*@Z427VLS*/ 02310000
         B     @RC00727                                            0729 02311000
@RF00727 OC    RECTYPE(2,R2),SWITCHON                              0729 02312000
*                    END;                                  /*@Z427VLS*/ 02313000
@RC00727 DS    0H                                                  0731 02314000
*                  INDEX1 = INDEX1 + 1;                    /*@Z427VLS*/ 02315000
@RC00722 AL    INDEX1,@CF00055                                     0731 02316000
*                 END;                                     /*@Z427VLS*/ 02317000
@DE00716 LA    @08,PARMFLD-1(INDEX1)                               0732 02318000
         CLI   0(@08),C','                                         0732 02319000
         BNE   @DL00716                                            0732 02320000
*                 IF RECTYPE = HEXZEROS THEN                       0733 02321000
         CLC   RECTYPE(2,R2),@CB00208                              0733 02322000
         BNE   @RF00733                                            0733 02323000
*                   CALL OUTMSG (SYNTAX);                  /*@Z427VLS*/ 02324000
         LA    @01,@AL00734                                        0734 02325000
         BAL   @14,OUTMSG                                          0734 02326000
*                 IF PMCH = ON | PCHAN = ON THEN                   0735 02327000
@RF00733 TM    PMCH(R2),B'11000000'                                0735 02328000
         BZ    @RF00735                                            0735 02329000
*                   DO;                                    /*@G51DGVS*/ 02330000
*                     PMCHFRAM = ON;                       /*@G51DGVS*/ 02331000
*                     PCCHFRAM = ON;                       /*@G51DGVS*/ 02332000
         OI    PMCHFRAM(R2),B'01100000'                            0738 02333000
*                   END;                                   /*@G51DGVS*/ 02334000
*               END;                                       /*@Z427VLS*/ 02335000
@RF00735 DS    0H                                                  0741 02336000
*END;                                                      /*@Z427VLS*/ 02337000
@EL00029 DS    0H                                                  0741 02338000
@EF00029 DS    0H                                                  0741 02339000
@ER00029 L     @14,@SA00029                                        0741 02340000
         L     @01,@SA00029+4                                      0741 02341000
         BR    @14                                                 0741 02342000
*/********************************************************************/ 02343000
*/*                                                          @Z427VLS*/ 02344000
*/*      SYNTAX CHECK FOR PRINT ( PS | PT | SU | NO )        @Z427VLS*/ 02345000
*/*      ASSUMED DEFAULT OF PRINT=SU                         @Z427VLS*/ 02346000
*/*                                                          @Z427VLS*/ 02347000
*/********************************************************************/ 02348000
*PARMPRIN:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 02349000
PARMPRIN ST    @14,@SA00030                                        0742 02350000
         ST    @01,@SA00030+4                                      0742 02351000
*             IF PRINTFLG = ON THEN         /* PRINT ALREADY SPECIFED*/ 02352000
         TM    PRINTFLG,B'00001000'                                0743 02353000
         BNO   @RF00743                                            0743 02354000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 02355000
         BAL   @14,DUPLICAT                                        0744 02356000
*             ELSE                                                 0745 02357000
*               DO INDEX1 = INDEX1 + 6;     /* INCR OVER PARM        */ 02358000
         B     @RC00743                                            0745 02359000
@RF00743 LA    @08,6                                               0745 02360000
         ALR   @08,INDEX1                                          0745 02361000
         LR    INDEX1,@08                                          0745 02362000
*                 PEDIT = OFF;              /* CLEAR EDIT FLAG       */ 02363000
*                 PSUM = OFF;               /* CLEAR SUM FLAG        */ 02364000
         NI    PEDIT(R2),B'11100111'                               0747 02365000
*                 PRINTFLG = ON;                           /*@Z427VLS*/ 02366000
         OI    PRINTFLG,B'00001000'                                0748 02367000
*                 CALL SCANC;               /* FIND DELIMITER        */ 02368000
         BAL   @14,SCANC                                           0749 02369000
*                 IF NEXTC = 2 THEN                                0750 02370000
         CLC   NEXTC(4),@CF00074                                   0750 02371000
         BNE   @RF00750                                            0750 02372000
*                   DO;                                    /*@Z427VLS*/ 02373000
*                     HOLDAREA(1:2) = PARMFLD(INDEX1:INDEX1+1);    0752 02374000
         LA    @08,PARMFLD-1(INDEX1)                               0752 02375000
         MVC   HOLDAREA(2),0(@08)                                  0752 02376000
*                     IF HOLDAREA(1:2) = 'PT' THEN                 0753 02377000
         CLC   HOLDAREA(2),@CC00826                                0753 02378000
         BNE   @RF00753                                            0753 02379000
*                       PEDIT = ON;              /* EDIT ONLY        */ 02380000
         OI    PEDIT(R2),B'00010000'                               0754 02381000
*                     ELSE                                         0755 02382000
*                       IF HOLDAREA(1:2) = 'PS' THEN               0755 02383000
         B     @RC00753                                            0755 02384000
@RF00753 CLC   HOLDAREA(2),@CC00827                                0755 02385000
         BNE   @RF00755                                            0755 02386000
*                         DO;                              /*@Z427VLS*/ 02387000
*                           PEDIT = ON;          /* EDIT AND SUMMARY */ 02388000
*                           PSUM = ON;                     /*@Z427VLS*/ 02389000
         OI    PEDIT(R2),B'00011000'                               0758 02390000
*                         END;                             /*@Z427VLS*/ 02391000
*                       ELSE                                       0760 02392000
*                         IF HOLDAREA(1:2) = 'SU' THEN             0760 02393000
         B     @RC00755                                            0760 02394000
@RF00755 CLC   HOLDAREA(2),@CC00828                                0760 02395000
         BNE   @RF00760                                            0760 02396000
*                           PSUM = ON;              /* SUMMARY ONLY  */ 02397000
         OI    PSUM(R2),B'00001000'                                0761 02398000
*                         ELSE                                     0762 02399000
*                           IF HOLDAREA(1:2) ^= 'NO' THEN          0762 02400000
         B     @RC00760                                            0762 02401000
@RF00760 CLC   HOLDAREA(2),@CC00829                                0762 02402000
         BE    @RF00762                                            0762 02403000
*                             CALL OUTMSG(SYNTAX);  /* ERROR @Z427VLS*/ 02404000
         LA    @01,@AL00763                                        0763 02405000
         BAL   @14,OUTMSG                                          0763 02406000
*                   END;                                   /*@Z427VLS*/ 02407000
*                 ELSE                                             0765 02408000
*                   CALL OUTMSG(SYNTAX);       /* WRONG LENGTH FIELD */ 02409000
         B     @RC00750                                            0765 02410000
@RF00750 LA    @01,@AL00765                                        0765 02411000
         BAL   @14,OUTMSG                                          0765 02412000
*                 INDEX1 = INDEX1 + NEXTC;                 /*@Z427VLS*/ 02413000
@RC00750 AL    INDEX1,NEXTC                                        0766 02414000
*               END;                                       /*@Z427VLS*/ 02415000
*END;                                                      /*@Z427VLS*/ 02416000
@EL00030 DS    0H                                                  0768 02417000
@EF00030 DS    0H                                                  0768 02418000
@ER00030 L     @14,@SA00030                                        0768 02419000
         L     @01,@SA00030+4                                      0768 02420000
         BR    @14                                                 0768 02421000
*/********************************************************************/ 02422000
*/*                                                          @Z427VLS*/ 02423000
*/*      SYNTAX CHECK FOR SYMCDE (NNNN | NNNX | NNXX | NXXX) @Z427VLS*/ 02424000
*/*      MAXIMUM OF ONE VALUE                                @Z427VLS*/ 02425000
*/*                                                          @Z427VLS*/ 02426000
*/********************************************************************/ 02427000
*PARMSYMC:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 02428000
PARMSYMC ST    @14,@SA00031                                        0769 02429000
         ST    @01,@SA00031+4                                      0769 02430000
*             IF SYMFLG = ON THEN          /* SYMCODE ALREADY SPECIF */ 02431000
         TM    SYMFLG,B'00000100'                                  0770 02432000
         BNO   @RF00770                                            0770 02433000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 02434000
         BAL   @14,DUPLICAT                                        0771 02435000
*             ELSE                                                 0772 02436000
*               DO INDEX1 = INDEX1 + 7;    /* INCR OVER PARM @Z427VLS*/ 02437000
         B     @RC00770                                            0772 02438000
@RF00770 LA    @08,7                                               0772 02439000
         ALR   @08,INDEX1                                          0772 02440000
         LR    INDEX1,@08                                          0772 02441000
*                 /*                                         @Z427VLS*/ 02442000
*                 /* GET SPACE FOR THE TABLE.  ESTABLISH THE BASE    */ 02443000
*                 /* POINTER.  CLEAR THE TABLE.              @Z427VLS*/ 02444000
*                 /*                                         @Z427VLS*/ 02445000
*                 SYMFLG = ON;                             /*@Z427VLS*/ 02446000
         OI    SYMFLG,B'00000100'                                  0773 02447000
*                 RESPECIFY (R1) RESTRICTED;               /*@Z427VLS*/ 02448000
*                 R1 = 24;                                 /*@Z427VLS*/ 02449000
         LA    R1,24                                               0775 02450000
*                 GEN (GETMAIN R,LV=(1),SP=20);            /*@Z427VLS*/ 02451000
         GETMAIN R,LV=(1),SP=20                                         02452000
*                 SYMCDPTR = R1;                           /*@Z427VLS*/ 02453000
         ST    R1,SYMCDPTR(,R2)                                    0777 02454000
*                 RESPECIFY (R1) UNRESTRICTED;             /*@Z427VLS*/ 02455000
*                 SYMCODE = SYMCODE && SYMCODE;            /*@Z427VLS*/ 02456000
         L     @08,SYMCDPTR(,R2)                                   0779 02457000
         XC    SYMCODE(18,@08),SYMCODE(@08)                        0779 02458000
*                 USERPGM = 'IFCSYMCD';                    /*@Z427VLS*/ 02459000
         MVC   USERPGM(8,R2),@CC00834                              0780 02460000
*                 CALL SCANC;                  /* FIND DELIMITER     */ 02461000
         BAL   @14,SCANC                                           0781 02462000
*                 IF NEXTC = 4 THEN                                0782 02463000
         CLC   NEXTC(4),@CF00064                                   0782 02464000
         BNE   @RF00782                                            0782 02465000
*                     DO I = INDEX1 + 3;                   /*@Z427VLS*/ 02466000
         LA    I,3                                                 0783 02467000
         ALR   I,INDEX1                                            0783 02468000
*                       /*                                   @Z427VLS*/ 02469000
*                       /* THE SYMCODE IS SAVE FOR CHECKING FOR AN   */ 02470000
*                       /* X.  THE FIELD IS THEN CHECKED FOR A VALID */ 02471000
*                       /* VALID HEX DIGIT OR AN X.  IF NEITHER IS   */ 02472000
*                       /* FOUND, IT IS AN ERROR.            @Z427VLS*/ 02473000
*                       /*                                   @Z427VLS*/ 02474000
*                       SYMHOLD = PARMFLD(INDEX1:INDEX1+3);/*@Z427VLS*/ 02475000
         LA    @08,PARMFLD-1(INDEX1)                               0784 02476000
         MVC   SYMHOLD(4),0(@08)                                   0784 02477000
*                       DO INDEX3 = INDEX1 TO I BY 1;      /*@Z427VLS*/ 02478000
         LR    @08,INDEX1                                          0785 02479000
         ST    @08,INDEX3                                          0785 02480000
         B     @DE00785                                            0785 02481000
@DL00785 DS    0H                                                  0786 02482000
*                         VALID = OFF;                     /*@Z427VLS*/ 02483000
         NI    VALID,B'01111111'                                   0786 02484000
*                         DO J = 17 TO 1 BY -1 WHILE(VALID = OFF); 0787 02485000
         LA    J,17                                                0787 02486000
@DL00787 TM    VALID,B'10000000'                                   0787 02487000
         BNZ   @DC00787                                            0787 02488000
*                           IF PARMFLD(INDEX3) = NUMTAB(J) THEN    0788 02489000
         L     @08,INDEX3                                          0788 02490000
         LA    @07,PARMFLD-1(@08)                                  0788 02491000
         LA    @03,NUMTAB-1(J)                                     0788 02492000
         CLC   0(1,@07),0(@03)                                     0788 02493000
         BNE   @RF00788                                            0788 02494000
*                             DO;                          /*@Z427VLS*/ 02495000
*                               VALID = ON;                /*@Z427VLS*/ 02496000
         OI    VALID,B'10000000'                                   0790 02497000
*                               PARMFLD(INDEX3) = HEXTAB(J);       0791 02498000
         LA    @07,PARMFLD-1(@08)                                  0791 02499000
         LA    @08,HEXTAB-1(J)                                     0791 02500000
         MVC   0(1,@07),0(@08)                                     0791 02501000
*                             END;                         /*@Z427VLS*/ 02502000
*                         END;                             /*@Z427VLS*/ 02503000
@RF00788 BCTR  J,0                                                 0793 02504000
         LTR   J,J                                                 0793 02505000
         BP    @DL00787                                            0793 02506000
@DC00787 DS    0H                                                  0794 02507000
*                         IF VALID = OFF THEN                      0794 02508000
         TM    VALID,B'10000000'                                   0794 02509000
         BNZ   @RF00794                                            0794 02510000
*                           CALL OUTMSG(SYNTAX);           /*@Z427VLS*/ 02511000
         LA    @01,@AL00795                                        0795 02512000
         BAL   @14,OUTMSG                                          0795 02513000
*                       END;                               /*@Z427VLS*/ 02514000
@RF00794 LA    @08,1                                               0796 02515000
         AL    @08,INDEX3                                          0796 02516000
         ST    @08,INDEX3                                          0796 02517000
@DE00785 CR    @08,I                                               0796 02518000
         BNH   @DL00785                                            0796 02519000
*                       /*                                   @Z427VLS*/ 02520000
*                       /* ONLY FOR NUMBERS OR TRAILING X'S IS VALID */ 02521000
*                       /*                                   @Z427VLS*/ 02522000
*                       IF SYMHOLD(1) = 'X' |                      0797 02523000
*                          (SYMHOLD(2) = 'X' & SYMHOLD(3:4) ^= 'XX') |  02524000
*                          (SYMHOLD(3) = 'X' & SYMHOLD(4) ^= 'X') THEN  02525000
         CLI   SYMHOLD,C'X'                                        0797 02526000
         BE    @RT00797                                            0797 02527000
         CLI   SYMHOLD+1,C'X'                                      0797 02528000
         BNE   @GL00008                                            0797 02529000
         CLC   SYMHOLD+2(2),@CC00706                               0797 02530000
         BNE   @RT00797                                            0797 02531000
@GL00008 CLI   SYMHOLD+2,C'X'                                      0797 02532000
         BNE   @RF00797                                            0797 02533000
         CLI   SYMHOLD+3,C'X'                                      0797 02534000
         BE    @RF00797                                            0797 02535000
@RT00797 DS    0H                                                  0798 02536000
*                         CALL OUTMSG(SYNTAX);             /*@Z427VLS*/ 02537000
         LA    @01,@AL00798                                        0798 02538000
         BAL   @14,OUTMSG                                          0798 02539000
*                       CALL HEXPACK(4);            /* PACK THE VALUE*/ 02540000
@RF00797 LA    @01,@AL00799                                        0799 02541000
         BAL   @14,HEXPACK                                         0799 02542000
*                       INDEX1 = INDEX1 - 4;        /* RTN FOR RANGE */ 02543000
         SL    INDEX1,@CF00064                                     0800 02544000
*                       SYMVAL1(1) = HOLDAREA(1:2); /* SAVE LOW VALUE*/ 02545000
         L     @08,SYMCDPTR(,R2)                                   0801 02546000
         MVC   SYMVAL1(2,@08),HOLDAREA                             0801 02547000
*                       /*                                   @Z427VLS*/ 02548000
*                       /* CHANGE THE LOW CONVERTED VALUE FOR X'S IN */ 02549000
*                       /* THE FIELD TO '0F'X FOR HIGH VALUE.  THEN  */ 02550000
*                       /* PACK THE VALUE AND STORE IT.      @Z427VLS*/ 02551000
*                       /*                                   @Z427VLS*/ 02552000
*                       IF SYMHOLD(2) = 'X' THEN                   0802 02553000
         CLI   SYMHOLD+1,C'X'                                      0802 02554000
         BNE   @RF00802                                            0802 02555000
*                         PARMFLD(INDEX1+1) = CUAFOX;      /*@Z427VLS*/ 02556000
         LA    @08,PARMFLD(INDEX1)                                 0803 02557000
         MVI   0(@08),X'0F'                                        0803 02558000
*                       IF SYMHOLD(3) = 'X' THEN                   0804 02559000
@RF00802 CLI   SYMHOLD+2,C'X'                                      0804 02560000
         BNE   @RF00804                                            0804 02561000
*                         PARMFLD(INDEX1+2) = CUAFOX;      /*@Z427VLS*/ 02562000
         LA    @08,PARMFLD+1(INDEX1)                               0805 02563000
         MVI   0(@08),X'0F'                                        0805 02564000
*                       IF SYMHOLD(4) = 'X' THEN                   0806 02565000
@RF00804 CLI   SYMHOLD+3,C'X'                                      0806 02566000
         BNE   @RF00806                                            0806 02567000
*                         PARMFLD(INDEX1+3) = CUAFOX;      /*@Z427VLS*/ 02568000
         LA    @08,PARMFLD+2(INDEX1)                               0807 02569000
         MVI   0(@08),X'0F'                                        0807 02570000
*                       CALL HEXPACK(4);                   /*@Z427VLS*/ 02571000
@RF00806 LA    @01,@AL00808                                        0808 02572000
         BAL   @14,HEXPACK                                         0808 02573000
*                       SYMVAL2(1) = HOLDAREA(1:2);        /*@Z427VLS*/ 02574000
         L     @08,SYMCDPTR(,R2)                                   0809 02575000
         MVC   SYMVAL2(2,@08),HOLDAREA                             0809 02576000
*                     END;                                 /*@Z427VLS*/ 02577000
*                   ELSE                                           0811 02578000
*                     DO;                   /* WRONG LENGTH FIELD    */ 02579000
         B     @RC00782                                            0811 02580000
@RF00782 DS    0H                                                  0812 02581000
*                       CALL OUTMSG(SYNTAX);               /*@Z427VLS*/ 02582000
         LA    @01,@AL00812                                        0812 02583000
         BAL   @14,OUTMSG                                          0812 02584000
*                       INDEX1 = INDEX1 + NEXTC;           /*@Z427VLS*/ 02585000
         AL    INDEX1,NEXTC                                        0813 02586000
*                     END;                                 /*@Z427VLS*/ 02587000
*                 SYMCDNUM = 1;             /* STORE # OF ENTRIES    */ 02588000
@RC00782 L     @08,SYMCDPTR(,R2)                                   0815 02589000
         MVC   SYMCDNUM(2,@08),@CH00055                            0815 02590000
*               END;                                       /*@Z427VLS*/ 02591000
*END;                                                      /*@Z427VLS*/ 02592000
@EL00031 DS    0H                                                  0817 02593000
@EF00031 DS    0H                                                  0817 02594000
@ER00031 L     @14,@SA00031                                        0817 02595000
         L     @01,@SA00031+4                                      0817 02596000
         BR    @14                                                 0817 02597000
*/********************************************************************/ 02598000
*/*                                                          @Z427VLS*/ 02599000
*/*      SYNTAX CHECK FOR THRESHOLD ((NNN,NNN))              @Z427VLS*/ 02600000
*/*      EACH FIELD IS A ONE-THREE NUMERIC ITEM.             @Z427VLS*/ 02601000
*/*                                                          @Z427VLS*/ 02602000
*/********************************************************************/ 02603000
*PARMTHRE:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 02604000
PARMTHRE ST    @14,@SA00032                                        0818 02605000
         ST    @01,@SA00032+4                                      0818 02606000
*             NEXTRPC = OFF;                  /* LOOK FOR R PAREN    */ 02607000
         NI    NEXTRPC,B'11111011'                                 0819 02608000
*             IF THRSHFLG = ON THEN           /* THRESHOLD ALREADY SP*/ 02609000
         TM    THRSHFLG,B'01000000'                                0820 02610000
         BNO   @RF00820                                            0820 02611000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 02612000
         BAL   @14,DUPLICAT                                        0821 02613000
*             ELSE                                                 0822 02614000
*               DO INDEX1 = INDEX1 + 11;      /* INCR OVER PARM      */ 02615000
         B     @RC00820                                            0822 02616000
@RF00820 LA    @08,11                                              0822 02617000
         ALR   @08,INDEX1                                          0822 02618000
         LR    INDEX1,@08                                          0822 02619000
*                 THRSHFLG = ON;                           /*@Z427VLS*/ 02620000
         OI    THRSHFLG,B'01000000'                                0823 02621000
*                 CALL SCANCRP;               /* FIND DELIMITER      */ 02622000
         BAL   @14,SCANCRP                                         0824 02623000
*                 IF NEXTC = 0 | NEXTC > 3 THEN                    0825 02624000
         L     @08,NEXTC                                           0825 02625000
         LTR   @08,@08                                             0825 02626000
         BZ    @RT00825                                            0825 02627000
         C     @08,@CF00076                                        0825 02628000
         BNH   @RF00825                                            0825 02629000
@RT00825 DS    0H                                                  0826 02630000
*                   CALL OUTMSG(SYNTAX);       /* WRONG LENGTH FIELD */ 02631000
         LA    @01,@AL00826                                        0826 02632000
         BAL   @14,OUTMSG                                          0826 02633000
*                 ELSE                                             0827 02634000
*                   DO;                                    /*@Z427VLS*/ 02635000
         B     @RC00825                                            0827 02636000
@RF00825 DS    0H                                                  0828 02637000
*                     /*                                     @Z427VLS*/ 02638000
*                     /* SAVE THE FIELD SINCE VALIDNUM DESTROYS THE  */ 02639000
*                     /* CHARACTER REPRESENTATION.  THEN VALIDATE    */ 02640000
*                     /* FOR NUMERICS AND STORE IN THE READ THRESH.  */ 02641000
*                     /*                                     @Z427VLS*/ 02642000
*                     HOLDAREA(1:NEXTC) =                          0828 02643000
*                             PARMFLD(INDEX1:INDEX1+NEXTC-1);      0828 02644000
         L     @08,NEXTC                                           0828 02645000
         BCTR  @08,0                                               0828 02646000
         LA    @04,PARMFLD-1(INDEX1)                               0828 02647000
         EX    @08,@SM01056                                        0828 02648000
*                     CALL VALIDNUM(NEXTC);                /*@Z427VLS*/ 02649000
         LA    @01,@AL00829                                        0829 02650000
         BAL   @14,VALIDNUM                                        0829 02651000
*                     RDTHRSH(4-NEXTC:3) = HOLDAREA(1:NEXTC);      0830 02652000
         LA    @08,4                                               0830 02653000
         SL    @08,NEXTC                                           0830 02654000
         ST    @08,@TF00001                                        0830 02655000
         ALR   @08,R2                                              0830 02656000
         LA    @04,3                                               0830 02657000
         SL    @04,@TF00001                                        0830 02658000
         EX    @04,@SM01058                                        0830 02659000
*                   END;                                   /*@Z427VLS*/ 02660000
*                 INDEX1 = INDEX1 + NEXTC;    /* INCR TO NXT FLD     */ 02661000
@RC00825 AL    INDEX1,NEXTC                                        0832 02662000
*                 IF RPORC = ON THEN                               0833 02663000
         TM    RPORC,B'10000000'                                   0833 02664000
         BNO   @RF00833                                            0833 02665000
*                   INDEX1 = INDEX1 + 1;                   /*@Z427VLS*/ 02666000
         AL    INDEX1,@CF00055                                     0834 02667000
*                 CALL SCANRP;                /* FIND DELIMITER      */ 02668000
@RF00833 BAL   @14,SCANRP                                          0835 02669000
*                 IF NEXTC = 0 | NEXTC > 3 THEN                    0836 02670000
         L     @08,NEXTC                                           0836 02671000
         LTR   @08,@08                                             0836 02672000
         BZ    @RT00836                                            0836 02673000
         C     @08,@CF00076                                        0836 02674000
         BNH   @RF00836                                            0836 02675000
@RT00836 DS    0H                                                  0837 02676000
*                   CALL OUTMSG(SYNTAX);      /* WRONG LENGTH FIELD  */ 02677000
         LA    @01,@AL00837                                        0837 02678000
         BAL   @14,OUTMSG                                          0837 02679000
*                 ELSE                                             0838 02680000
*                   DO;                                    /*@Z427VLS*/ 02681000
         B     @RC00836                                            0838 02682000
@RF00836 DS    0H                                                  0839 02683000
*                     /*                                     @Z427VLS*/ 02684000
*                     /* SAVE THE FIELD SINCE VALIDNUM DESTROYS THE  */ 02685000
*                     /* CHARACTER REPRESENTATION.  THEN VALIDATE    */ 02686000
*                     /* FOR NUMERICS AND STORE IN THE WRITE THRESH. */ 02687000
*                     /*                                     @Z427VLS*/ 02688000
*                     HOLDAREA(1:NEXTC) =                          0839 02689000
*                             PARMFLD(INDEX1:INDEX1+NEXTC-1);      0839 02690000
         L     @08,NEXTC                                           0839 02691000
         BCTR  @08,0                                               0839 02692000
         LA    @04,PARMFLD-1(INDEX1)                               0839 02693000
         EX    @08,@SM01056                                        0839 02694000
*                     CALL VALIDNUM(NEXTC);                /*@Z427VLS*/ 02695000
         LA    @01,@AL00840                                        0840 02696000
         BAL   @14,VALIDNUM                                        0840 02697000
*                     WRTHRSH(4-NEXTC:3) = HOLDAREA(1:NEXTC);      0841 02698000
         LA    @08,4                                               0841 02699000
         SL    @08,NEXTC                                           0841 02700000
         ST    @08,@TF00001                                        0841 02701000
         ALR   @08,R2                                              0841 02702000
         LA    @04,3                                               0841 02703000
         SL    @04,@TF00001                                        0841 02704000
         EX    @04,@SM01060                                        0841 02705000
*                   END;                                   /*@Z427VLS*/ 02706000
*                 INDEX1 = INDEX1 + NEXTC + 1;  /* INCR OVER FIELD   */ 02707000
@RC00836 LR    @08,INDEX1                                          0843 02708000
         AL    @08,NEXTC                                           0843 02709000
         AL    @08,@CF00055                                        0843 02710000
         LR    INDEX1,@08                                          0843 02711000
*                 PARMTHR = ON;                            /*@Z427VLS*/ 02712000
         OI    PARMTHR(R2),B'00001000'                             0844 02713000
*               END;                                       /*@Z427VLS*/ 02714000
*END;                                                      /*@Z427VLS*/ 02715000
@EL00032 DS    0H                                                  0846 02716000
@EF00032 DS    0H                                                  0846 02717000
@ER00032 L     @14,@SA00032                                        0846 02718000
         L     @01,@SA00032+4                                      0846 02719000
         BR    @14                                                 0846 02720000
*/********************************************************************/ 02721000
*/*                                                          @Z427VLS*/ 02722000
*/*      SYNTAX CHECK FOR TIME ((HHMM,HHMM))                 @Z427VLS*/ 02723000
*/*                                                          @Z427VLS*/ 02724000
*/********************************************************************/ 02725000
*PARMTIME:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 02726000
PARMTIME ST    @14,@SA00033                                        0847 02727000
         ST    @01,@SA00033+4                                      0847 02728000
*             NEXTRPC = OFF;                 /* LOOK UP FOR R PAREN  */ 02729000
         NI    NEXTRPC,B'11111011'                                 0848 02730000
*             IF TIMEFLG = ON THEN           /* TIME ALREADY SPECIF  */ 02731000
         TM    TIMEFLG,B'00100000'                                 0849 02732000
         BNO   @RF00849                                            0849 02733000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 02734000
         BAL   @14,DUPLICAT                                        0850 02735000
*             ELSE                                                 0851 02736000
*               DO INDEX1 = INDEX1 + 6;      /* INCR OVER PARM       */ 02737000
         B     @RC00849                                            0851 02738000
@RF00849 LA    @08,6                                               0851 02739000
         ALR   @08,INDEX1                                          0851 02740000
         LR    INDEX1,@08                                          0851 02741000
*                 TIMEFLG = ON;                            /*@Z427VLS*/ 02742000
         OI    TIMEFLG,B'00100000'                                 0852 02743000
*             IF PARMFLD(INDEX1+4) = DASH THEN                     0853 02744000
         LA    @08,PARMFLD+3(INDEX1)                               0853 02745000
         CLI   0(@08),C'-'                                         0853 02746000
         BNE   @RF00853                                            0853 02747000
*               PARMFLD(INDEX1+4) = COMMA;                 /*@0001VLS*/ 02748000
         LA    @08,PARMFLD+3(INDEX1)                               0854 02749000
         MVI   0(@08),C','                                         0854 02750000
*                 CALL SCANCRP;              /* FIND DELIMITER       */ 02751000
@RF00853 BAL   @14,SCANCRP                                         0855 02752000
*                 IF NEXTC = 4 THEN                                0856 02753000
         CLC   NEXTC(4),@CF00064                                   0856 02754000
         BNE   @RF00856                                            0856 02755000
*                   DO;                                    /*@Z427VLS*/ 02756000
*                     /*                                     @Z427VLS*/ 02757000
*                     /* VALIDATE FOR NUMERICS.  PACK THE FIELD.  IF */ 02758000
*                     /* THE MINUTE IS GREATER THAN 59 FOR THE TOTAL */ 02759000
*                     /* FIELD IS GREATER THAN 2400, IT IS AN ERROR. */ 02760000
*                     /* STORE THE VALUE IN BOTH OF THE START TIME   */ 02761000
*                     /* FIELDS.                             @Z427VLS*/ 02762000
*                     /*                                     @Z427VLS*/ 02763000
*                     CALL VALIDNUM(4);                    /*@Z427VLS*/ 02764000
         LA    @01,@AL00858                                        0858 02765000
         BAL   @14,VALIDNUM                                        0858 02766000
*                     CALL HEXPACK(4);                     /*@Z427VLS*/ 02767000
         LA    @01,@AL00859                                        0859 02768000
         BAL   @14,HEXPACK                                         0859 02769000
*                     IF HOLD(2) > '59'X THEN           /* MINUTES?  */ 02770000
         CLI   HOLD+1,X'59'                                        0860 02771000
         BNH   @RF00860                                            0860 02772000
*                       DO PLACE = 2;                      /*@Z427VLS*/ 02773000
         LA    @08,2                                               0861 02774000
         ST    @08,PLACE                                           0861 02775000
*                         CALL  OUTMSG(SYNTAX);            /*@Z427VLS*/ 02776000
         LA    @01,@AL00862                                        0862 02777000
         BAL   @14,OUTMSG                                          0862 02778000
*                       END;                               /*@Z427VLS*/ 02779000
*                     IF HOLDAREA(1:2) > '2400'X THEN   /* HOURS?    */ 02780000
@RF00860 CLC   HOLDAREA(2),@CB00844                                0864 02781000
         BNH   @RF00864                                            0864 02782000
*                       DO PLACE = 4;                      /*@Z427VLS*/ 02783000
         LA    @08,4                                               0865 02784000
         ST    @08,PLACE                                           0865 02785000
*                         CALL OUTMSG(SYNTAX);             /*@Z427VLS*/ 02786000
         LA    @01,@AL00866                                        0866 02787000
         BAL   @14,OUTMSG                                          0866 02788000
*                       END;                               /*@Z427VLS*/ 02789000
*                     STTIME1(1:2) = HOLDAREA(1:2);        /*@Z427VLS*/ 02790000
@RF00864 MVC   STTIME1(2,R2),HOLDAREA                              0868 02791000
*                     STTIME2(1:2) = HOLDAREA(1:2);        /*@Z427VLS*/ 02792000
         MVC   STTIME2(2,R2),HOLDAREA                              0869 02793000
*                   END;                                   /*@Z427VLS*/ 02794000
*                 ELSE                                             0871 02795000
*                   DO;                                    /*@Z427VLS*/ 02796000
         B     @RC00856                                            0871 02797000
@RF00856 DS    0H                                                  0872 02798000
*                     CALL OUTMSG(SYNTAX);      /* WRONG LENGTH FIELD*/ 02799000
         LA    @01,@AL00872                                        0872 02800000
         BAL   @14,OUTMSG                                          0872 02801000
*                     INDEX1 = INDEX1 + NEXTC;             /*@Z427VLS*/ 02802000
         AL    INDEX1,NEXTC                                        0873 02803000
*                   END;                                   /*@Z427VLS*/ 02804000
*                 IF RPORC = ON THEN                               0875 02805000
@RC00856 TM    RPORC,B'10000000'                                   0875 02806000
         BNO   @RF00875                                            0875 02807000
*                   INDEX1 = INDEX1 + 1;                   /*@Z427VLS*/ 02808000
         AL    INDEX1,@CF00055                                     0876 02809000
*                 CALL SCANRP;                  /* FIND DELIMITER    */ 02810000
@RF00875 BAL   @14,SCANRP                                          0877 02811000
*                 IF NEXTC = 4 THEN                                0878 02812000
         CLC   NEXTC(4),@CF00064                                   0878 02813000
         BNE   @RF00878                                            0878 02814000
*                   DO;                                    /*@Z427VLS*/ 02815000
*                     /*                                     @Z427VLS*/ 02816000
*                     /* VALIDATE FOR NUMERICS.  PACK THE FIELD.  IF */ 02817000
*                     /* THE MINUTE IS GREATER THAN 59 FOR THE TOTAL */ 02818000
*                     /* FIELD IS GREATER THAN 2400, IT IS AN ERROR. */ 02819000
*                     /* STORE THE VALUE IN BOTH OF THE END TIME FLDS*/ 02820000
*                     /*                                     @Z427VLS*/ 02821000
*                     CALL VALIDNUM(4);                    /*@Z427VLS*/ 02822000
         LA    @01,@AL00880                                        0880 02823000
         BAL   @14,VALIDNUM                                        0880 02824000
*                     CALL HEXPACK(4);                     /*@Z427VLS*/ 02825000
         LA    @01,@AL00881                                        0881 02826000
         BAL   @14,HEXPACK                                         0881 02827000
*                     IF HOLD(2) > '59'X THEN           /* MINUTES?  */ 02828000
         CLI   HOLD+1,X'59'                                        0882 02829000
         BNH   @RF00882                                            0882 02830000
*                       DO PLACE = 2;                      /*@Z427VLS*/ 02831000
         LA    @08,2                                               0883 02832000
         ST    @08,PLACE                                           0883 02833000
*                         CALL OUTMSG(SYNTAX);             /*@Z427VLS*/ 02834000
         LA    @01,@AL00884                                        0884 02835000
         BAL   @14,OUTMSG                                          0884 02836000
*                       END;                               /*@Z427VLS*/ 02837000
*                     IF HOLDAREA(1:2) > '2400'X THEN   /* HOURS?    */ 02838000
@RF00882 CLC   HOLDAREA(2),@CB00844                                0886 02839000
         BNH   @RF00886                                            0886 02840000
*                       DO PLACE = 4;                      /*@Z427VLS*/ 02841000
         LA    @08,4                                               0887 02842000
         ST    @08,PLACE                                           0887 02843000
*                         CALL OUTMSG(SYNTAX);             /*@Z427VLS*/ 02844000
         LA    @01,@AL00888                                        0888 02845000
         BAL   @14,OUTMSG                                          0888 02846000
*                       END;                               /*@Z427VLS*/ 02847000
*                     ENDTIME1(1:2) = HOLDAREA(1:2);       /*@Z427VLS*/ 02848000
@RF00886 MVC   ENDTIME1(2,R2),HOLDAREA                             0890 02849000
*                     ENDTIME2(1:2) = HOLDAREA(1:2);       /*@Z427VLS*/ 02850000
         MVC   ENDTIME2(2,R2),HOLDAREA                             0891 02851000
*                     INDEX1 = INDEX1 + 1;                 /*@Z427VLS*/ 02852000
         AL    INDEX1,@CF00055                                     0892 02853000
*                   END;                                   /*@Z427VLS*/ 02854000
*                 ELSE                                             0894 02855000
*                   DO;                                    /*@Z427VLS*/ 02856000
         B     @RC00878                                            0894 02857000
@RF00878 DS    0H                                                  0895 02858000
*                     CALL OUTMSG(SYNTAX);    /* WRONG LENGTH FIELD */  02859000
         LA    @01,@AL00895                                        0895 02860000
         BAL   @14,OUTMSG                                          0895 02861000
*                     INDEX1 = INDEX1 + NEXTC + 1;         /*@Z427VLS*/ 02862000
         LR    @08,INDEX1                                          0896 02863000
         AL    @08,NEXTC                                           0896 02864000
         AL    @08,@CF00055                                        0896 02865000
         LR    INDEX1,@08                                          0896 02866000
*                   END;                                   /*@Z427VLS*/ 02867000
*                 /*                                         @Z427VLS*/ 02868000
*                 /* IF THE END TIME IS LESS THAN THE START TIME, IT */ 02869000
*                 /* IS ASSUMED THAT A TIME PERIOD CROSSING MIDNIGHT */ 02870000
*                 /* IS DESIRED.  THE ENDING TIME OF THE FIRST TIME  */ 02871000
*                 /* INTERVAL IS SET TO 2400 AND THE START TIME OF   */ 02872000
*                 /* THE SECOND INTERVAL IS SET TO 0000.  THE FLAG IS*/ 02873000
*                 /* SET TO INDICATE THIS CONDTION.          @Z427VLS*/ 02874000
*                 /* OTHERWISE, BOTH TIME INTERVALS ARE EXACTLY THE  */ 02875000
*                 /* SAME VALUE.                             @Z427VLS*/ 02876000
*                 /*                                         @Z427VLS*/ 02877000
*                 IF ENDTIME1 < STTIME1 THEN                       0898 02878000
@RC00878 CLC   ENDTIME1(4,R2),STTIME1(R2)                          0898 02879000
         BNL   @RF00898                                            0898 02880000
*                   DO;                                    /*@Z427VLS*/ 02881000
*                      ENDTIME1(1:2) = '2400'X;            /*@Z427VLS*/ 02882000
         MVC   ENDTIME1(2,R2),@CB00844                             0900 02883000
*                      STTIME2(1:2)  = '0000'X;            /*@Z427VLS*/ 02884000
         MVC   STTIME2(2,R2),@CB00208                              0901 02885000
*                      SHIFT3RD = ON;                      /*@Z427VLS*/ 02886000
         OI    SHIFT3RD(R2),B'00010000'                            0902 02887000
*                   END;                                   /*@Z427VLS*/ 02888000
*               END;                                       /*@Z427VLS*/ 02889000
@RF00898 DS    0H                                                  0905 02890000
*END;                                                      /*@Z427VLS*/ 02891000
@EL00033 DS    0H                                                  0905 02892000
@EF00033 DS    0H                                                  0905 02893000
@ER00033 L     @14,@SA00033                                        0905 02894000
         L     @01,@SA00033+4                                      0905 02895000
         BR    @14                                                 0905 02896000
*/********************************************************************/ 02897000
*/*                                                          @Z427VLS*/ 02898000
*/*      SYNTAX CHECK FOR TABSIZE (NNNK)                     @Z427VLS*/ 02899000
*/*      ONE TO THREE NUMERIC FIELD PLUS LETTER K            @Z427VLS*/ 02900000
*/*                                                          @Z427VLS*/ 02901000
*/********************************************************************/ 02902000
*PARMTABS:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 02903000
PARMTABS ST    @14,@SA00034                                        0906 02904000
         ST    @01,@SA00034+4                                      0906 02905000
*             IF TABFLG = ON THEN           /* TABSIZE ALREADY SPEC  */ 02906000
         TM    TABFLG,B'00010000'                                  0907 02907000
         BNO   @RF00907                                            0907 02908000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 02909000
         BAL   @14,DUPLICAT                                        0908 02910000
*             ELSE                                                 0909 02911000
*               DO INDEX1 = INDEX1 + 8;     /* INCR OVER PARM        */ 02912000
         B     @RC00907                                            0909 02913000
@RF00907 LA    @08,8                                               0909 02914000
         ALR   @08,INDEX1                                          0909 02915000
         LR    INDEX1,@08                                          0909 02916000
*                 TABFLG = ON;                             /*@Z427VLS*/ 02917000
         OI    TABFLG,B'00010000'                                  0910 02918000
*                 CALL SCANC;               /* FIND DELIMITER        */ 02919000
         BAL   @14,SCANC                                           0911 02920000
*                 IF NEXTC >= 2 & NEXTC <= 4 &                     0912 02921000
*                    PARMFLD(INDEX1+NEXTC-1) = 'K' THEN            0912 02922000
         L     @08,NEXTC                                           0912 02923000
         C     @08,@CF00074                                        0912 02924000
         BL    @RF00912                                            0912 02925000
         C     @08,@CF00064                                        0912 02926000
         BH    @RF00912                                            0912 02927000
         LR    @04,INDEX1                                          0912 02928000
         ALR   @04,@08                                             0912 02929000
         LA    @03,PARMFLD-2(@04)                                  0912 02930000
         CLI   0(@03),C'K'                                         0912 02931000
         BNE   @RF00912                                            0912 02932000
*                     DO;                                  /*@Z427VLS*/ 02933000
*                       /*                                   @Z427VLS*/ 02934000
*                       /* VALIDATE ALL CHARACTERS EXCEPT THE LAST   */ 02935000
*                       /* FOR NUMERICS.  FOR A ONE DIGIT OPERAND,   */ 02936000
*                       /* PLACE THE VALUE IN THE HOLD AREA. @Z427VLS*/ 02937000
*                       /* FOR A TWO DIGIT OPERAND, PLACE THE FIRST  */ 02938000
*                       /* DIGIT IN HOLD(1) AND THE SECOND DIGIT IN  */ 02939000
*                       /* THE SECOND SLOT OF THE HOLD AREA. @Z427VLS*/ 02940000
*                       /* FOR A THREE DIGIT OPERAND, PACK THE FIRST */ 02941000
*                       /* TWO DIGITS AND MOVE THE THIRD AS THOUGH IT*/ 02942000
*                       /* WERE A ONE DIGIT OPERAND.         @Z427VLS*/ 02943000
*                       /* THE SECOND SLOT OF THE HOLD AREA IS THEN  */ 02944000
*                       /* SHIFTED LEFT 4 BITS, AND THE SIGN FLAG IS */ 02945000
*                       /* OR'ED IN. CONVERT IT TO BINARY AND THEN   */ 02946000
*                       /* MULTIPLY BY 1024.                 @Z427VLS*/ 02947000
*                       /*                                   @Z427VLS*/ 02948000
*                       CALL VALIDNUM(NEXTC-1);            /*@Z427VLS*/ 02949000
         BCTR  @08,0                                               0914 02950000
         ST    @08,@AFTEMPS+4                                      0914 02951000
         LA    @01,@AL00914                                        0914 02952000
         BAL   @14,VALIDNUM                                        0914 02953000
*                       IF NEXTC >= 2 THEN                         0915 02954000
         L     @08,NEXTC                                           0915 02955000
         C     @08,@CF00074                                        0915 02956000
         BL    @RF00915                                            0915 02957000
*                         INDEX2 = PARMFLD(INDEX1);        /*@Z427VLS*/ 02958000
         SLR   @08,@08                                             0916 02959000
         IC    @08,PARMFLD-1(INDEX1)                               0916 02960000
         ST    @08,INDEX2                                          0916 02961000
*                       IF NEXTC >= 3 THEN                         0917 02962000
@RF00915 L     @08,NEXTC                                           0917 02963000
         C     @08,@CF00076                                        0917 02964000
         BL    @RF00917                                            0917 02965000
*                         INDEX2 = INDEX2*10 + PARMFLD(INDEX1+1);  0918 02966000
         L     @08,INDEX2                                          0918 02967000
         MH    @08,@CH00034                                        0918 02968000
         SLR   @04,@04                                             0918 02969000
         IC    @04,PARMFLD(INDEX1)                                 0918 02970000
         ALR   @08,@04                                             0918 02971000
         ST    @08,INDEX2                                          0918 02972000
*                       IF NEXTC = 4 THEN                          0919 02973000
@RF00917 CLC   NEXTC(4),@CF00064                                   0919 02974000
         BNE   @RF00919                                            0919 02975000
*                         INDEX2 = INDEX2*10 + PARMFLD(INDEX1+2);  0920 02976000
         L     @08,INDEX2                                          0920 02977000
         MH    @08,@CH00034                                        0920 02978000
         SLR   @04,@04                                             0920 02979000
         IC    @04,PARMFLD+1(INDEX1)                               0920 02980000
         ALR   @08,@04                                             0920 02981000
         ST    @08,INDEX2                                          0920 02982000
*                       TABSIZE = INDEX2 * 1024;           /*@Z427VLS*/ 02983000
@RF00919 L     @08,INDEX2                                          0921 02984000
         SLA   @08,10                                              0921 02985000
         ST    @08,TABSIZE(,R2)                                    0921 02986000
*                       IF TABSIZE = 0 THEN                        0922 02987000
         LTR   @08,@08                                             0922 02988000
         BNZ   @RF00922                                            0922 02989000
*                         CALL OUTMSG(SYNTAX);             /*@Z427VLS*/ 02990000
         LA    @01,@AL00923                                        0923 02991000
         BAL   @14,OUTMSG                                          0923 02992000
*                     END;                                 /*@Z427VLS*/ 02993000
*                 ELSE                                             0925 02994000
*                   CALL OUTMSG(SYNTAX);        /* WRONG LENGTH FIELD*/ 02995000
         B     @RC00912                                            0925 02996000
@RF00912 LA    @01,@AL00925                                        0925 02997000
         BAL   @14,OUTMSG                                          0925 02998000
*                 INDEX1 = INDEX1 + NEXTC;                 /*@Z427VLS*/ 02999000
@RC00912 AL    INDEX1,NEXTC                                        0926 03000000
*               END;                                       /*@Z427VLS*/ 03001000
*END;                                                      /*@Z427VLS*/ 03002000
@EL00034 DS    0H                                                  0928 03003000
@EF00034 DS    0H                                                  0928 03004000
@ER00034 L     @14,@SA00034                                        0928 03005000
         L     @01,@SA00034+4                                      0928 03006000
         BR    @14                                                 0928 03007000
*/********************************************************************/ 03008000
*/*                                                          @Z427VLS*/ 03009000
*/*      SYNTAX CHECK FOR DEVICE (UP TO 8 OF 'N'NNXX         @Z427VLS*/ 03010000
*/*                                          'N'NNNN         @Z427VLS*/ 03011000
*/*                                          NNXX            @Z427VLS*/ 03012000
*/*                                          NNNN)           @Z427VLS*/ 03013000
*/*             BOTH INCLUSION AND EXCLUSION ('N') CANNOT BE GIVEN   */ 03014000
*/*                                                          @Z427VLS*/ 03015000
*/********************************************************************/ 03016000
*PARMDEV:   PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 03017000
PARMDEV  ST    @14,@SA00035                                        0929 03018000
         ST    @01,@SA00035+4                                      0929 03019000
*             NEXTRPC = OFF;                /* LOOK FOR R PAREN      */ 03020000
         NI    NEXTRPC,B'11111011'                                 0930 03021000
*             IF DEVFLG = ON THEN           /* DEVICE ALREADY SPEC   */ 03022000
         TM    DEVFLG,B'00001000'                                  0931 03023000
         BNO   @RF00931                                            0931 03024000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 03025000
         BAL   @14,DUPLICAT                                        0932 03026000
*             ELSE                                                 0933 03027000
*               DO INDEX1 = INDEX1 + 5;     /* INCR OVER PARM        */ 03028000
         B     @RC00931                                            0933 03029000
@RF00931 LA    @08,5                                               0933 03030000
         ALR   @08,INDEX1                                          0933 03031000
         LR    INDEX1,@08                                          0933 03032000
*                 DEVFLG = ON;                             /*@Z427VLS*/ 03033000
         OI    DEVFLG,B'00001000'                                  0934 03034000
*                 /*                                         @Z427VLS*/ 03035000
*                 /* GET SPACE FOR THE TABLE.  ESTABLISH THE BASE    */ 03036000
*                 /* POINTER. CLEAR THE TABLE.               @Z427VLS*/ 03037000
*                 /*                                         @Z427VLS*/ 03038000
*                 RESPECIFY (R1) RESTRICTED;               /*@Z427VLS*/ 03039000
*                 R1 = 256;                                /*@0001VLS*/ 03040000
         LA    R1,256                                              0936 03041000
*                 GEN(GETMAIN R,LV=(1),SP=20);             /*@Z427VLS*/ 03042000
         GETMAIN R,LV=(1),SP=20                                         03043000
*                 DEVPTR = R1;                             /*@Z427VLS*/ 03044000
         ST    R1,DEVPTR(,R2)                                      0938 03045000
*                 RESPECIFY (R1) UNRESTRICTED;             /*@Z427VLS*/ 03046000
*                 DEVICE = DEVICE && DEVICE;               /*@Z427VLS*/ 03047000
         L     @08,DEVPTR(,R2)                                     0940 03048000
         XC    DEVICE(254,@08),DEVICE(@08)                         0940 03049000
*                 INDEX2 = ZERO;                           /*@Z427VLS*/ 03050000
         SLR   @08,@08                                             0941 03051000
         ST    @08,INDEX2                                          0941 03052000
*                 INDEX3 = ZERO;                           /*@Z427VLS*/ 03053000
         ST    @08,INDEX3                                          0942 03054000
*                 DO UNTIL (RPORC = OFF);                  /*@Z427VLS*/ 03055000
@DL00943 DS    0H                                                  0944 03056000
*                   CALL SCANCRP;             /* FIND THE DELIMITER  */ 03057000
         BAL   @14,SCANCRP                                         0944 03058000
*                   FOUND = OFF;                           /*@Z427VLS*/ 03059000
         NI    FOUND,B'11101111'                                   0945 03060000
*                   /*                                       @Z427VLS*/ 03061000
*                   /* EITHER AN OPERAND OF LENGTH 5 OR LENGTH 4 IS  */ 03062000
*                   /* VALID.  IF THE LENGTH IS 5, THE EXLUSION OF   */ 03063000
*                   /* DEVICES IS ASSUMED AND ALL OPERANDS MUST      */ 03064000
*                   /* SPECIFY THE LEADING 'N'.  IF THE LENGTH IS 4, */ 03065000
*                   /* THE INCLUSION OF DEVICES IS ASSUMED AND ALL   */ 03066000
*                   /* OPERANDS MUST NOT SPECIFY THE LEADING 'N'.    */ 03067000
*                   /* THE PROCEDURE FINDDEV WILL VALIDATE THE DEVICE*/ 03068000
*                   /* SPECIFICATION AGAINST DEVTABLE.       @Z427VLS*/ 03069000
*                   /*                                       @Z427VLS*/ 03070000
*                   IF NEXTC = 5 & PARMFLD(INDEX1) = 'N' THEN      0946 03071000
         CLC   NEXTC(4),@CF00079                                   0946 03072000
         BNE   @RF00946                                            0946 03073000
         LA    @08,PARMFLD-1(INDEX1)                               0946 03074000
         CLI   0(@08),C'N'                                         0946 03075000
         BNE   @RF00946                                            0946 03076000
*                     DO;                                  /*@Z427VLS*/ 03077000
*                        IF DEVINCL = ON THEN                      0948 03078000
         TM    DEVINCL,B'00001000'                                 0948 03079000
         BNO   @RF00948                                            0948 03080000
*                          CALL OUTMSG(SYNTAX);            /*@Z427VLS*/ 03081000
         LA    @01,@AL00949                                        0949 03082000
         BAL   @14,OUTMSG                                          0949 03083000
*                        ELSE                                      0950 03084000
*                          DEVEXCL = ON;                   /*@Z427VLS*/ 03085000
         B     @RC00948                                            0950 03086000
@RF00948 OI    DEVEXCL(R2),B'00100000'                             0950 03087000
*                        INDEX1 = INDEX1 + 1;     /* STEP OVER 'N'   */ 03088000
@RC00948 AL    INDEX1,@CF00055                                     0951 03089000
*                        CALL FINDDEV;                     /*@Z427VLS*/ 03090000
         BAL   @14,FINDDEV                                         0952 03091000
*                     END;                                 /*@Z427VLS*/ 03092000
*                   ELSE                                           0954 03093000
*                     IF NEXTC = 4 THEN                            0954 03094000
         B     @RC00946                                            0954 03095000
@RF00946 CLC   NEXTC(4),@CF00064                                   0954 03096000
         BNE   @RF00954                                            0954 03097000
*                       DO;                                /*@Z427VLS*/ 03098000
*                         IF DEVEXCL = ON THEN                     0956 03099000
         TM    DEVEXCL(R2),B'00100000'                             0956 03100000
         BNO   @RF00956                                            0956 03101000
*                           CALL OUTMSG(SYNTAX);           /*@Z427VLS*/ 03102000
         LA    @01,@AL00957                                        0957 03103000
         BAL   @14,OUTMSG                                          0957 03104000
*                         ELSE                                     0958 03105000
*                           DEVINCL = ON;                  /*@Z427VLS*/ 03106000
         B     @RC00956                                            0958 03107000
@RF00956 OI    DEVINCL,B'00001000'                                 0958 03108000
*                         CALL FINDDEV;                    /*@Z427VLS*/ 03109000
@RC00956 BAL   @14,FINDDEV                                         0959 03110000
*                       END;                               /*@Z427VLS*/ 03111000
*                     ELSE                                         0961 03112000
*                       DO;                                /*@Z427VLS*/ 03113000
         B     @RC00954                                            0961 03114000
@RF00954 DS    0H                                                  0962 03115000
*                         CALL OUTMSG(SYNTAX);    /* WRONG LNGTH OPER * 03116000
         LA    @01,@AL00962                                        0962 03117000
         BAL   @14,OUTMSG                                          0962 03118000
*                         INDEX1 = INDEX1 + NEXTC + 1;     /*@Z427VLS*/ 03119000
         LR    @08,INDEX1                                          0963 03120000
         AL    @08,NEXTC                                           0963 03121000
         AL    @08,@CF00055                                        0963 03122000
         LR    INDEX1,@08                                          0963 03123000
*                       END;                               /*@Z427VLS*/ 03124000
*                 END;                                     /*@Z427VLS*/ 03125000
@RC00954 DS    0H                                                  0965 03126000
@RC00946 DS    0H                                                  0965 03127000
@DE00943 TM    RPORC,B'10000000'                                   0965 03128000
         BNZ   @DL00943                                            0965 03129000
*                 DEVNUM = INDEX2;                /* STORE # OBR ENTR*/ 03130000
         L     @08,DEVPTR(,R2)                                     0966 03131000
         L     @04,INDEX2                                          0966 03132000
         STH   @04,DEVNUM(,@08)                                    0966 03133000
*                 MDRNUM = INDEX3;                /* STORE # MDR ENTR*/ 03134000
         L     @04,INDEX3                                          0967 03135000
         STH   @04,MDRNUM(,@08)                                    0967 03136000
*               END;                                       /*@Z427VLS*/ 03137000
*END;                                                      /*@Z427VLS*/ 03138000
@EL00035 DS    0H                                                  0969 03139000
@EF00035 DS    0H                                                  0969 03140000
@ER00035 L     @14,@SA00035                                        0969 03141000
         L     @01,@SA00035+4                                      0969 03142000
         BR    @14                                                 0969 03143000
*/********************************************************************/ 03144000
*/*                                                          @Z427VLS*/ 03145000
*/*      SYNTAX CHECK FOR LIBADR (=XXXX)                     @Z427VLS*/ 03146000
*/*                                                          @Z427VLS*/ 03147000
*/********************************************************************/ 03148000
*PARMLIBA:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 03149000
PARMLIBA ST    @14,@SA00036                                        0970 03150000
         ST    @01,@SA00036+4                                      0970 03151000
*             IF LIBFLG = ON THEN                                  0971 03152000
         TM    LIBFLG,B'00000010'                                  0971 03153000
         BNO   @RF00971                                            0971 03154000
*               CALL DUPLICAT;              /* LIBADR ALREADY SPEC*/    03155000
         BAL   @14,DUPLICAT                                        0972 03156000
*             ELSE                                                 0973 03157000
*               DO INDEX1 = INDEX1 + 7;         /* INCR OVER PARM    */ 03158000
         B     @RC00971                                            0973 03159000
@RF00971 LA    @08,7                                               0973 03160000
         ALR   @08,INDEX1                                          0973 03161000
         LR    INDEX1,@08                                          0973 03162000
*                 LIBFLG = ON;                             /*@Z427VLS*/ 03163000
         OI    LIBFLG,B'00000010'                                  0974 03164000
*                 /*                                         @Z427VLS*/ 03165000
*                 /* GET SPACE FOR TABLE.  ESTABLISH BASE POINTER.   */ 03166000
*                 /* CLEAR TABLE.                            @Z427VLS*/ 03167000
*                 /*                                         @Z427VLS*/ 03168000
*                 RESPECIFY (R1) RESTRICTED;               /*@Z427VLS*/ 03169000
*                 R1 = 16;                                 /*@Z427VLS*/ 03170000
         LA    R1,16                                               0976 03171000
*                 GEN (GETMAIN R,LV=(1),SP=20);            /*@Z427VLS*/ 03172000
         GETMAIN R,LV=(1),SP=20                                         03173000
*                 LIBADPTR = R1;                           /*@Z427VLS*/ 03174000
         ST    R1,LIBADPTR(,R2)                                    0978 03175000
*                 RESPECIFY (R1) UNRESTRICTED;             /*@Z427VLS*/ 03176000
*                 LIBADR = LIBADR && LIBADR;               /*@Z427VLS*/ 03177000
         L     @08,LIBADPTR(,R2)                                   0980 03178000
         XC    LIBADR(10,@08),LIBADR(@08)                          0980 03179000
*                 CALL SCANC;                    /* FIND DELIMITER   */ 03180000
         BAL   @14,SCANC                                           0981 03181000
*                 IF NEXTC = 4 THEN                                0982 03182000
         CLC   NEXTC(4),@CF00064                                   0982 03183000
         BNE   @RF00982                                            0982 03184000
*                   DO;                                    /*@Z427VLS*/ 03185000
*                     /*                                     @Z427VLS*/ 03186000
*                     /* ONLY A FOUR DIGIT HEX VALUE IS ALLOWED.  IT */ 03187000
*                     /* IS VALIDATED, PACKED, AND STORED IN THE     */ 03188000
*                     /* THE NUMBER OF ENTRIES IS SET TO 1.  @Z427VLS*/ 03189000
*                     /*                                     @Z427VLS*/ 03190000
*                     CALL VALIDHEX(4);                    /*@Z427VLS*/ 03191000
         LA    @01,@AL00984                                        0984 03192000
         BAL   @14,VALIDHEX                                        0984 03193000
*                     CALL HEXPACK(4);                     /*@Z427VLS*/ 03194000
         LA    @01,@AL00985                                        0985 03195000
         BAL   @14,HEXPACK                                         0985 03196000
*                     LIBVAL(1) = HOLDAREA(1:2);           /*@Z427VLS*/ 03197000
         L     @08,LIBADPTR(,R2)                                   0986 03198000
         MVC   LIBVAL(2,@08),HOLDAREA                              0986 03199000
*                     LIBADNUM = 1;                        /*@Z427VLS*/ 03200000
         MVC   LIBADNUM(2,@08),@CH00055                            0987 03201000
*                   END;                                   /*@Z427VLS*/ 03202000
*                 ELSE                                             0989 03203000
*                   DO;                                    /*@Z427VLS*/ 03204000
         B     @RC00982                                            0989 03205000
@RF00982 DS    0H                                                  0990 03206000
*                     CALL OUTMSG(SYNTAX);        /* WRONG LENGTH FLD*/ 03207000
         LA    @01,@AL00990                                        0990 03208000
         BAL   @14,OUTMSG                                          0990 03209000
*                     INDEX1 = INDEX1 + NEXTC;             /*@Z427VLS*/ 03210000
         AL    INDEX1,NEXTC                                        0991 03211000
*                   END;                                   /*@Z427VLS*/ 03212000
*               END;                                       /*@Z427VLS*/ 03213000
@RC00982 DS    0H                                                  0994 03214000
*END;                                                      /*@Z427VLS*/ 03215000
@EL00036 DS    0H                                                  0994 03216000
@EF00036 DS    0H                                                  0994 03217000
@ER00036 L     @14,@SA00036                                        0994 03218000
         L     @01,@SA00036+4                                      0994 03219000
         BR    @14                                                 0994 03220000
*/********************************************************************/ 03221000
*/*                                                          @Z427VLS*/ 03222000
*/*      SYNTAX CHECK FOR ERRORID (NNNN(,YY,ZZZZ,HH,MM,SS,T))        */ 03223000
*/*      WHERE NNNN IS THE SEQUENCE NUMBER                   @Z427VLS*/ 03224000
*/*            YY   IS THE CPU ID                            @Z427VLS*/ 03225000
*/*            ZZZZ IS THE ADDRESS SPACE ID                  @Z427VLS*/ 03226000
*/*            HH,MM,SS,T IS THE TIME                        @Z427VLS*/ 03227000
*/*                                                          @Z427VLS*/ 03228000
*/********************************************************************/ 03229000
*PARMERRO:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 03230000
PARMERRO ST    @14,@SA00037                                        0995 03231000
         ST    @01,@SA00037+4                                      0995 03232000
*             NEXTRPC = OFF;                /* LOOK FOR R PAREN      */ 03233000
         NI    NEXTRPC,B'11111011'                                 0996 03234000
*             IF ERRORFLG = ON THEN         /* ERRORID ALREADY SPECIF*/ 03235000
         TM    ERRORFLG,B'00000001'                                0997 03236000
         BNO   @RF00997                                            0997 03237000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 03238000
         BAL   @14,DUPLICAT                                        0998 03239000
*             ELSE                                                 0999 03240000
*               DO INDEX1 = INDEX1 + 9;     /* INCR OVER PARM        */ 03241000
         B     @RC00997                                            0999 03242000
@RF00997 LA    @08,9                                               0999 03243000
         ALR   @08,INDEX1                                          0999 03244000
         LR    INDEX1,@08                                          0999 03245000
*                 ERRORFLG = ON;                           /*@Z427VLS*/ 03246000
         OI    ERRORFLG,B'00000001'                                1000 03247000
*                 ERRORID = ON;                            /*@Z427VLS*/ 03248000
         OI    ERRORID(R2),B'00000100'                             1001 03249000
*                 /*                                         @Z427VLS*/ 03250000
*                 /* FIND THE TERMINATING RIGHT PAREN.  IF THE LENGTH*/ 03251000
*                 /* OF THE OPERANDS IS 19, IT IS ASSUMED THAT DATE  */ 03252000
*                 /* AND TIME HAVE ALSO BEEN SPECIFIED.  IF THE      */ 03253000
*                 /* LENGTH OF THE OPERANDS IS 4, THEN ONLY ERRORID  */ 03254000
*                 /* HAS BEEN SPECIFIED.  ALL OTHERS ARE AN ERROR.   */ 03255000
*                 /* FOR AN OPERANDS OF LENGTH 19, THE COMMA IS NEXT */ 03256000
*                 /* LOOKED FOR.                             @Z427VLS*/ 03257000
*                 /*                                         @Z427VLS*/ 03258000
*                 CALL SCANRP;                             /*@Z427VLS*/ 03259000
         BAL   @14,SCANRP                                          1002 03260000
*                 IF NEXTC = 24 THEN                               1003 03261000
         CLC   NEXTC(4),@CF00227                                   1003 03262000
         BNE   @RF01003                                            1003 03263000
*                   CALL SCANC;                            /*@Z427VLS*/ 03264000
         BAL   @14,SCANC                                           1004 03265000
*                 IF NEXTC = 5 THEN                                1005 03266000
@RF01003 CLC   NEXTC(4),@CF00079                                   1005 03267000
         BNE   @RF01005                                            1005 03268000
*                   DO;                                    /*@Z427VLS*/ 03269000
*                     /*                                     @Z427VLS*/ 03270000
*                     /* VALIDATE FOR NUMERICS.  PACK THE FIELD AND  */ 03271000
*                     /* STORE IN ID VALUE.  IF ONLY THE ERRORID WAS */ 03272000
*                     /* SPECIFIED, THE NEXT CHARACTER IN THE STRING */ 03273000
*                     /* WILL BE A RIGHT PAREN.  OTHERWISE A COMMA.  */ 03274000
*                     /*                                     @Z427VLS*/ 03275000
*                     CALL VALIDNUM(5);                    /*@Z427VLS*/ 03276000
         LA    @01,@AL01007                                        1007 03277000
         BAL   @14,VALIDNUM                                        1007 03278000
*                     IDVALUE = (((PARMFLD(INDEX1)*10 +            1008 03279000
*                                 PARMFLD(INDEX1+1))*10 +          1008 03280000
*                                 PARMFLD(INDEX1+2))*10 +          1008 03281000
*                                 PARMFLD(INDEX1+3))*10 +          1008 03282000
*                                 PARMFLD(INDEX1+4);       /*@Z427VLS*/ 03283000
         LA    @08,10                                              1008 03284000
         SLR   @01,@01                                             1008 03285000
         IC    @01,PARMFLD-1(INDEX1)                               1008 03286000
         MR    @00,@08                                             1008 03287000
         SLR   @04,@04                                             1008 03288000
         IC    @04,PARMFLD(INDEX1)                                 1008 03289000
         ALR   @01,@04                                             1008 03290000
         MR    @00,@08                                             1008 03291000
         SLR   @04,@04                                             1008 03292000
         IC    @04,PARMFLD+1(INDEX1)                               1008 03293000
         ALR   @01,@04                                             1008 03294000
         MR    @00,@08                                             1008 03295000
         SLR   @04,@04                                             1008 03296000
         IC    @04,PARMFLD+2(INDEX1)                               1008 03297000
         ALR   @01,@04                                             1008 03298000
         MR    @00,@08                                             1008 03299000
         SLR   @08,@08                                             1008 03300000
         IC    @08,PARMFLD+3(INDEX1)                               1008 03301000
         ALR   @01,@08                                             1008 03302000
         STH   @01,IDVALUE(,R2)                                    1008 03303000
*                     INDEX1 = INDEX1 + 5;                 /*@Z427VLS*/ 03304000
         AL    INDEX1,@CF00079                                     1009 03305000
*                     IF RPORC = ON THEN                           1010 03306000
         TM    RPORC,B'10000000'                                   1010 03307000
         BNO   @RF01010                                            1010 03308000
*                       DO INDEX1 = INDEX1 + 1;  /* STEP OVER COMMA */  03309000
         LA    @08,1                                               1011 03310000
         ALR   @08,INDEX1                                          1011 03311000
         LR    INDEX1,@08                                          1011 03312000
*                         CALL SCANCRP;     /* FIND A DELIMITER      */ 03313000
         BAL   @14,SCANCRP                                         1012 03314000
*                         IF NEXTC = 2 THEN                        1013 03315000
         CLC   NEXTC(4),@CF00074                                   1013 03316000
         BNE   @RF01013                                            1013 03317000
*                           DO;                            /*@Z427VLS*/ 03318000
*                             /*                             @Z427VLS*/ 03319000
*                             /* VALIDATE THE CPU ID FOR HEX 00,     */ 03320000
*                             /* HEX 40, OR HEX 41.          @Z427VLS*/ 03321000
*                             /*                             @Z427VLS*/ 03322000
*                             CALL VALIDNUM(2);            /*@Z427VLS*/ 03323000
         LA    @01,@AL01015                                        1015 03324000
         BAL   @14,VALIDNUM                                        1015 03325000
*                             CALL HEXPACK(2);             /*@Z427VLS*/ 03326000
         LA    @01,@AL01016                                        1016 03327000
         BAL   @14,HEXPACK                                         1016 03328000
*                             IF HOLDAREA(1) = '00'X |             1017 03329000
*                                HOLDAREA(1) = '40'X |             1017 03330000
*                                HOLDAREA(1) = '41'X THEN          1017 03331000
         CLI   HOLDAREA,X'00'                                      1017 03332000
         BE    @RT01017                                            1017 03333000
         CLI   HOLDAREA,X'40'                                      1017 03334000
         BE    @RT01017                                            1017 03335000
         CLI   HOLDAREA,X'41'                                      1017 03336000
         BNE   @RF01017                                            1017 03337000
@RT01017 DS    0H                                                  1018 03338000
*                               IDCPU = HOLDAREA(1);       /*@Z427VLS*/ 03339000
         MVC   IDCPU(1,R2),HOLDAREA                                1018 03340000
*                             ELSE                                 1019 03341000
*                               DO PLACE = 2;              /*@Z427VLS*/ 03342000
         B     @RC01017                                            1019 03343000
@RF01017 LA    @08,2                                               1019 03344000
         ST    @08,PLACE                                           1019 03345000
*                                 CALL OUTMSG(SYNTAX);     /*@Z427VLS*/ 03346000
         LA    @01,@AL01020                                        1020 03347000
         BAL   @14,OUTMSG                                          1020 03348000
*                               END;                       /*@Z427VLS*/ 03349000
*                           END;                           /*@Z427VLS*/ 03350000
*                         ELSE                                     1023 03351000
*                           DO;                            /*@Z427VLS*/ 03352000
         B     @RC01013                                            1023 03353000
@RF01013 DS    0H                                                  1024 03354000
*                             CALL OUTMSG (SYNTAX);        /*@Z427VLS*/ 03355000
         LA    @01,@AL01024                                        1024 03356000
         BAL   @14,OUTMSG                                          1024 03357000
*                             INDEX1 = INDEX1 + NEXTC;     /*@Z427VLS*/ 03358000
         AL    INDEX1,NEXTC                                        1025 03359000
*                           END;                           /*@Z427VLS*/ 03360000
*                         IF RPORC = ON THEN                       1027 03361000
@RC01013 TM    RPORC,B'10000000'                                   1027 03362000
         BNO   @RF01027                                            1027 03363000
*                           INDEX1 = INDEX1 + 1;           /*@Z427VLS*/ 03364000
         AL    INDEX1,@CF00055                                     1028 03365000
*                         CALL SCANCRP;        /* FIND DELIMITER     */ 03366000
@RF01027 BAL   @14,SCANCRP                                         1029 03367000
*                         IF NEXTC = 4 THEN                        1030 03368000
         CLC   NEXTC(4),@CF00064                                   1030 03369000
         BNE   @RF01030                                            1030 03370000
*                           DO;                            /*@Z427VLS*/ 03371000
*                             /*                             @Z427VLS*/ 03372000
*                             /* PROCESS ADDRESS SPACE ID    @Z427VLS*/ 03373000
*                             /*                             @Z427VLS*/ 03374000
*                             CALL VALIDHEX (4);           /*@Z427VLS*/ 03375000
         LA    @01,@AL01032                                        1032 03376000
         BAL   @14,VALIDHEX                                        1032 03377000
*                             CALL HEXPACK(4);             /*@Z427VLS*/ 03378000
         LA    @01,@AL01033                                        1033 03379000
         BAL   @14,HEXPACK                                         1033 03380000
*                             IDASID = HOLDAREA(1:2);      /*@Z427VLS*/ 03381000
         MVC   IDASID(2,R2),HOLDAREA                               1034 03382000
*                           END;                           /*@Z427VLS*/ 03383000
*                         ELSE                                     1036 03384000
*                           DO;                            /*@Z427VLS*/ 03385000
         B     @RC01030                                            1036 03386000
@RF01030 DS    0H                                                  1037 03387000
*                             CALL OUTMSG (SYNTAX);        /*@Z427VLS*/ 03388000
         LA    @01,@AL01037                                        1037 03389000
         BAL   @14,OUTMSG                                          1037 03390000
*                             INDEX1 = INDEX1 + NEXTC;     /*@Z427VLS*/ 03391000
         AL    INDEX1,NEXTC                                        1038 03392000
*                           END;                           /*@Z427VLS*/ 03393000
*                         IF RPORC = ON THEN                       1040 03394000
@RC01030 TM    RPORC,B'10000000'                                   1040 03395000
         BNO   @RF01040                                            1040 03396000
*                           INDEX1 = INDEX1 + 1;           /*@Z427VLS*/ 03397000
         AL    INDEX1,@CF00055                                     1041 03398000
*                         CALL SCANCRP;        /* FIND DELIMITER     */ 03399000
@RF01040 BAL   @14,SCANCRP                                         1042 03400000
*                         IF NEXTC = 2 THEN                        1043 03401000
         CLC   NEXTC(4),@CF00074                                   1043 03402000
         BNE   @RF01043                                            1043 03403000
*                           DO;                            /*@Z427VLS*/ 03404000
*                             /*                             @Z427VLS*/ 03405000
*                             /* PROCESS HOUR SPECIFICATION  @Z427VLS*/ 03406000
*                             /*                             @Z427VLS*/ 03407000
*                             CALL VALIDNUM (2);           /*@Z427VLS*/ 03408000
         LA    @01,@AL01045                                        1045 03409000
         BAL   @14,VALIDNUM                                        1045 03410000
*                             IDHOUR = PARMFLD(INDEX1) * 10 +      1046 03411000
*                                      PARMFLD(INDEX1+1);  /*@Z427VLS*/ 03412000
         SLR   @08,@08                                             1046 03413000
         IC    @08,PARMFLD-1(INDEX1)                               1046 03414000
         MH    @08,@CH00034                                        1046 03415000
         SLR   @04,@04                                             1046 03416000
         IC    @04,PARMFLD(INDEX1)                                 1046 03417000
         ALR   @08,@04                                             1046 03418000
         STC   @08,IDHOUR(,R2)                                     1046 03419000
*                             IF IDHOUR > 24 THEN                  1047 03420000
         CLI   IDHOUR(R2),24                                       1047 03421000
         BNH   @RF01047                                            1047 03422000
*                               CALL OUTMSG (SYNTAX);      /*@Z427VLS*/ 03423000
         LA    @01,@AL01048                                        1048 03424000
         BAL   @14,OUTMSG                                          1048 03425000
*                           END;                           /*@Z427VLS*/ 03426000
*                         ELSE                                     1050 03427000
*                           CALL OUTMSG (SYNTAX);          /*@Z427VLS*/ 03428000
         B     @RC01043                                            1050 03429000
@RF01043 LA    @01,@AL01050                                        1050 03430000
         BAL   @14,OUTMSG                                          1050 03431000
*                         INDEX1 = INDEX1 + NEXTC;         /*@Z427VLS*/ 03432000
@RC01043 AL    INDEX1,NEXTC                                        1051 03433000
*                         IF RPORC = ON THEN                       1052 03434000
         TM    RPORC,B'10000000'                                   1052 03435000
         BNO   @RF01052                                            1052 03436000
*                           INDEX1 = INDEX1 + 1;           /*@Z427VLS*/ 03437000
         AL    INDEX1,@CF00055                                     1053 03438000
*                         CALL SCANCRP;        /* FIND DELIMITER     */ 03439000
@RF01052 BAL   @14,SCANCRP                                         1054 03440000
*                         IF NEXTC = 2 THEN                        1055 03441000
         CLC   NEXTC(4),@CF00074                                   1055 03442000
         BNE   @RF01055                                            1055 03443000
*                           DO;                            /*@Z427VLS*/ 03444000
*                             /*                             @Z427VLS*/ 03445000
*                             /* PROCESS MINUTE SPECIFICATION        */ 03446000
*                             /*                             @Z427VLS*/ 03447000
*                             CALL VALIDNUM (2);           /*@Z427VLS*/ 03448000
         LA    @01,@AL01057                                        1057 03449000
         BAL   @14,VALIDNUM                                        1057 03450000
*                             IDMIN = PARMFLD(INDEX1) * 10 +       1058 03451000
*                                      PARMFLD(INDEX1+1);  /*@Z427VLS*/ 03452000
         SLR   @08,@08                                             1058 03453000
         IC    @08,PARMFLD-1(INDEX1)                               1058 03454000
         MH    @08,@CH00034                                        1058 03455000
         SLR   @04,@04                                             1058 03456000
         IC    @04,PARMFLD(INDEX1)                                 1058 03457000
         ALR   @08,@04                                             1058 03458000
         STC   @08,IDMIN(,R2)                                      1058 03459000
*                             IF IDMIN > 59 |                      1059 03460000
*                                (IDHOUR = 24 & IDMIN ^= ZERO) THEN     03461000
         CLI   IDMIN(R2),59                                        1059 03462000
         BH    @RT01059                                            1059 03463000
         CLI   IDHOUR(R2),24                                       1059 03464000
         BNE   @RF01059                                            1059 03465000
         CLI   IDMIN(R2),0                                         1059 03466000
         BE    @RF01059                                            1059 03467000
@RT01059 DS    0H                                                  1060 03468000
*                               CALL OUTMSG (SYNTAX);      /*@Z427VLS*/ 03469000
         LA    @01,@AL01060                                        1060 03470000
         BAL   @14,OUTMSG                                          1060 03471000
*                           END;                           /*@Z427VLS*/ 03472000
*                         ELSE                                     1062 03473000
*                           CALL OUTMSG (SYNTAX);          /*@Z427VLS*/ 03474000
         B     @RC01055                                            1062 03475000
@RF01055 LA    @01,@AL01062                                        1062 03476000
         BAL   @14,OUTMSG                                          1062 03477000
*                         INDEX1 = INDEX1 + NEXTC;         /*@Z427VLS*/ 03478000
@RC01055 AL    INDEX1,NEXTC                                        1063 03479000
*                         IF RPORC = ON THEN                       1064 03480000
         TM    RPORC,B'10000000'                                   1064 03481000
         BNO   @RF01064                                            1064 03482000
*                           INDEX1 = INDEX1 + 1;           /*@Z427VLS*/ 03483000
         AL    INDEX1,@CF00055                                     1065 03484000
*                         CALL SCANCRP;        /* FIND DELIMITER     */ 03485000
@RF01064 BAL   @14,SCANCRP                                         1066 03486000
*                         IF NEXTC = 2 THEN                        1067 03487000
         CLC   NEXTC(4),@CF00074                                   1067 03488000
         BNE   @RF01067                                            1067 03489000
*                           DO;                            /*@Z427VLS*/ 03490000
*                             /*                             @Z427VLS*/ 03491000
*                             /* PROCESS SECOND SPECIFICATION        */ 03492000
*                             /*                             @Z427VLS*/ 03493000
*                             CALL VALIDNUM (2);           /*@Z427VLS*/ 03494000
         LA    @01,@AL01069                                        1069 03495000
         BAL   @14,VALIDNUM                                        1069 03496000
*                             IDSEC = PARMFLD(INDEX1) * 10 +       1070 03497000
*                                      PARMFLD(INDEX1+1);  /*@Z427VLS*/ 03498000
         SLR   @08,@08                                             1070 03499000
         IC    @08,PARMFLD-1(INDEX1)                               1070 03500000
         MH    @08,@CH00034                                        1070 03501000
         SLR   @04,@04                                             1070 03502000
         IC    @04,PARMFLD(INDEX1)                                 1070 03503000
         ALR   @08,@04                                             1070 03504000
         STC   @08,IDSEC(,R2)                                      1070 03505000
*                             IF IDSEC > 59 |                      1071 03506000
*                                (IDHOUR = 24 & IDSEC ^= ZERO) THEN     03507000
         CLI   IDSEC(R2),59                                        1071 03508000
         BH    @RT01071                                            1071 03509000
         CLI   IDHOUR(R2),24                                       1071 03510000
         BNE   @RF01071                                            1071 03511000
         CLI   IDSEC(R2),0                                         1071 03512000
         BE    @RF01071                                            1071 03513000
@RT01071 DS    0H                                                  1072 03514000
*                               CALL OUTMSG (SYNTAX);      /*@Z427VLS*/ 03515000
         LA    @01,@AL01072                                        1072 03516000
         BAL   @14,OUTMSG                                          1072 03517000
*                           END;                           /*@Z427VLS*/ 03518000
*                         ELSE                                     1074 03519000
*                           CALL OUTMSG (SYNTAX);          /*@Z427VLS*/ 03520000
         B     @RC01067                                            1074 03521000
@RF01067 LA    @01,@AL01074                                        1074 03522000
         BAL   @14,OUTMSG                                          1074 03523000
*                         INDEX1 = INDEX1 + NEXTC;         /*@Z427VLS*/ 03524000
@RC01067 AL    INDEX1,NEXTC                                        1075 03525000
*                         IF RPORC = ON THEN                       1076 03526000
         TM    RPORC,B'10000000'                                   1076 03527000
         BNO   @RF01076                                            1076 03528000
*                           INDEX1 = INDEX1 + 1;           /*@Z427VLS*/ 03529000
         AL    INDEX1,@CF00055                                     1077 03530000
*                         CALL SCANRP;         /* FIND DELIMITER     */ 03531000
@RF01076 BAL   @14,SCANRP                                          1078 03532000
*                         IF NEXTC = 1 THEN                        1079 03533000
         CLC   NEXTC(4),@CF00055                                   1079 03534000
         BNE   @RF01079                                            1079 03535000
*                           DO;                            /*@Z427VLS*/ 03536000
*                             /*                             @Z427VLS*/ 03537000
*                             /* PROCESS TENTHS SPECIFICATION        */ 03538000
*                             /*                             @Z427VLS*/ 03539000
*                             CALL VALIDNUM (1);           /*@Z427VLS*/ 03540000
         LA    @01,@AL01081                                        1081 03541000
         BAL   @14,VALIDNUM                                        1081 03542000
*                             IDTSEC = PARMFLD(INDEX1);    /*@Z427VLS*/ 03543000
         SLR   @08,@08                                             1082 03544000
         IC    @08,PARMFLD-1(INDEX1)                               1082 03545000
         STC   @08,IDTSEC(,R2)                                     1082 03546000
*                             IF IDHOUR = 24 & IDTSEC ^= ZERO THEN 1083 03547000
         CLI   IDHOUR(R2),24                                       1083 03548000
         BNE   @RF01083                                            1083 03549000
         CLI   IDTSEC(R2),0                                        1083 03550000
         BE    @RF01083                                            1083 03551000
*                               CALL OUTMSG (SYNTAX);      /*@Z427VLS*/ 03552000
         LA    @01,@AL01084                                        1084 03553000
         BAL   @14,OUTMSG                                          1084 03554000
*                           END;                           /*@Z427VLS*/ 03555000
*                         ELSE                                     1086 03556000
*                           CALL OUTMSG (SYNTAX);          /*@Z427VLS*/ 03557000
         B     @RC01079                                            1086 03558000
@RF01079 LA    @01,@AL01086                                        1086 03559000
         BAL   @14,OUTMSG                                          1086 03560000
*                       END;                               /*@Z427VLS*/ 03561000
@RC01079 DS    0H                                                  1088 03562000
*                   END;                                   /*@Z427VLS*/ 03563000
*                 ELSE                                             1089 03564000
*                   CALL OUTMSG(SYNTAX);         /* WRONG LNGTH FIELD*/ 03565000
         B     @RC01005                                            1089 03566000
@RF01005 LA    @01,@AL01089                                        1089 03567000
         BAL   @14,OUTMSG                                          1089 03568000
*                 CALL SCANRP;                             /*@Z427VLS*/ 03569000
@RC01005 BAL   @14,SCANRP                                          1090 03570000
*                 INDEX1 = INDEX1 + NEXTC + 1;             /*@Z427VLS*/ 03571000
         LR    @08,INDEX1                                          1091 03572000
         AL    @08,NEXTC                                           1091 03573000
         AL    @08,@CF00055                                        1091 03574000
         LR    INDEX1,@08                                          1091 03575000
*               END;                                       /*@Z427VLS*/ 03576000
*END;                                                      /*@Z427VLS*/ 03577000
@EL00037 DS    0H                                                  1093 03578000
@EF00037 DS    0H                                                  1093 03579000
@ER00037 L     @14,@SA00037                                        1093 03580000
         L     @01,@SA00037+4                                      1093 03581000
         BR    @14                                                 1093 03582000
*/********************************************************************/ 03583000
*/*                                                          @Z427VLS*/ 03584000
*/*      SYNTAX CHECK FOR CPU (NNNNNN.NNNN(,NNNNNN.NNNN,...,ETC))    */ 03585000
*/*      MAXIMUM OF EIGHT ENTRIES                            @Z427VLS*/ 03586000
*/*                                                          @Z427VLS*/ 03587000
*/********************************************************************/ 03588000
*PARMCPU:   PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 03589000
PARMCPU  ST    @14,@SA00038                                        1094 03590000
         ST    @01,@SA00038+4                                      1094 03591000
*             NEXTRPC = OFF;                /* LOOK FOR R PAREN      */ 03592000
         NI    NEXTRPC,B'11111011'                                 1095 03593000
*             IF CPUFLG = ON THEN           /* CPU ALREADY SPECIFIED */ 03594000
         TM    CPUFLG,B'10000000'                                  1096 03595000
         BNO   @RF01096                                            1096 03596000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 03597000
         BAL   @14,DUPLICAT                                        1097 03598000
*             ELSE                                                 1098 03599000
*               DO INDEX1 = INDEX1 + 5;        /* STEP OVER PARM     */ 03600000
         B     @RC01096                                            1098 03601000
@RF01096 LA    @08,5                                               1098 03602000
         ALR   @08,INDEX1                                          1098 03603000
         LR    INDEX1,@08                                          1098 03604000
*                 CPUFLG = ON;                             /*@Z427VLS*/ 03605000
         OI    CPUFLG,B'10000000'                                  1099 03606000
*                 /*                                         @Z427VLS*/ 03607000
*                 /* GET SPACE FOR THE TABLE.  ESTABLISH THE BASE    */ 03608000
*                 /* POINTER.  CLEAR THE TABLE.              @Z427VLS*/ 03609000
*                 /*                                         @Z427VLS*/ 03610000
*                 RESPECIFY (R1) RESTRICTED;               /*@Z427VLS*/ 03611000
*                 R1 = 48;                                 /*@Z427VLS*/ 03612000
         LA    R1,48                                               1101 03613000
*                 GEN (GETMAIN R,LV=(1),SP=20);            /*@Z427VLS*/ 03614000
         GETMAIN R,LV=(1),SP=20                                         03615000
*                 CPUPTR = R1;                             /*@Z427VLS*/ 03616000
         ST    R1,CPUPTR(,R2)                                      1103 03617000
*                 RESPECIFY (R1) UNRESTRICTED;             /*@Z427VLS*/ 03618000
*                 CPUS = CPUS && CPUS;                     /*@Z427VLS*/ 03619000
         L     @08,CPUPTR(,R2)                                     1105 03620000
         XC    CPUS(42,@08),CPUS(@08)                              1105 03621000
*                 INDEX2 = ZERO;                           /*@Z427VLS*/ 03622000
         SLR   @08,@08                                             1106 03623000
         ST    @08,INDEX2                                          1106 03624000
*                 DO UNTIL (RPORC = OFF);                  /*@Z427VLS*/ 03625000
@DL01107 DS    0H                                                  1108 03626000
*                   CALL SCANCRP;                  /* FIND DELIMITER */ 03627000
         BAL   @14,SCANCRP                                         1108 03628000
*                   IF NEXTC = 11 THEN                             1109 03629000
         CLC   NEXTC(4),@CF00035                                   1109 03630000
         BNE   @RF01109                                            1109 03631000
*                     DO;                                  /*@Z427VLS*/ 03632000
*                       FOUND = OFF;                       /*@Z427VLS*/ 03633000
         NI    FOUND,B'11101111'                                   1111 03634000
*                       CALL VALIDNUM(6);          /* VALIDATE SER NUM* 03635000
         LA    @01,@AL01112                                        1112 03636000
         BAL   @14,VALIDNUM                                        1112 03637000
*                       CALL HEXPACK(6);           /* PACK VALUE      * 03638000
         LA    @01,@AL01113                                        1113 03639000
         BAL   @14,HEXPACK                                         1113 03640000
*                       CPUHOLD = HOLDAREA(1:3);   /* SAVE   @Z427VLS*/ 03641000
         MVC   CPUHOLD(3),HOLDAREA                                 1114 03642000
*                       IF INDEX2 < DIM(CPUVAL) THEN               1115 03643000
         L     @08,INDEX2                                          1115 03644000
         C     @08,@CF00066                                        1115 03645000
         BNL   @RF01115                                            1115 03646000
*                         INDEX2 = INDEX2 + 1;     /* GET INDEX      */ 03647000
         AL    @08,@CF00055                                        1116 03648000
         ST    @08,INDEX2                                          1116 03649000
*                       ELSE                                       1117 03650000
*                         DO PLACE = 6;                    /*@Z427VLS*/ 03651000
         B     @RC01115                                            1117 03652000
@RF01115 LA    @08,6                                               1117 03653000
         ST    @08,PLACE                                           1117 03654000
*                           CALL OUTMSG(SYNTAX);           /*@Z427VLS*/ 03655000
         LA    @01,@AL01118                                        1118 03656000
         BAL   @14,OUTMSG                                          1118 03657000
*                         END;                             /*@Z427VLS*/ 03658000
*                       /*                                   @Z427VLS*/ 03659000
*                       /* CHECK FOR THE PERIOD DELIMITER.  IF THERE,*/ 03660000
*                       /* VALIDATE THE MODEL NUMBER AGAINST CPUTABLE*/ 03661000
*                       /* IF FOUND, PLACE THE CONVERTED VALUE IN    */ 03662000
*                       /* HOLD AREA.                        @Z427VLS*/ 03663000
*                       /*                                   @Z427VLS*/ 03664000
*                       IF PARMFLD(INDEX1) = PERIOD THEN           1120 03665000
@RC01115 LA    @08,PARMFLD-1(INDEX1)                               1120 03666000
         CLI   0(@08),C'.'                                         1120 03667000
         BNE   @RF01120                                            1120 03668000
*                         DO;                              /*@Z427VLS*/ 03669000
*                           DO I = DIM(CPUTABLE) TO 1 BY -1        1122 03670000
*                                        WHILE(FOUND = OFF);       1122 03671000
         LA    I,14                                                1122 03672000
@DL01122 TM    FOUND,B'00010000'                                   1122 03673000
         BNZ   @DC01122                                            1122 03674000
*                             IF PARMFLD(INDEX1+1:INDEX1+4) =      1123 03675000
*                                      CPUEBDIC(I) THEN            1123 03676000
         LR    @08,I                                               1123 03677000
         MH    @08,@CH00081                                        1123 03678000
         LA    @07,PARMFLD(INDEX1)                                 1123 03679000
         LA    @04,CPUEBDIC-6(@08)                                 1123 03680000
         CLC   0(4,@07),0(@04)                                     1123 03681000
         BNE   @RF01123                                            1123 03682000
*                               DO;                        /*@Z427VLS*/ 03683000
*                               /*                           @Z427VLS*/ 03684000
*                               /* IF VALID, STORE THE MODEL NUMBER. */ 03685000
*                               /* MOVE THE ENTIRE FIELD TO THE TABLE*/ 03686000
*                               /*                           @Z427VLS*/ 03687000
*                                 FOUND = ON;              /*@Z427VLS*/ 03688000
         OI    FOUND,B'00010000'                                   1125 03689000
*                                 HOLDAREA(4:5) = CPUNO(I);/*@Z427VLS*/ 03690000
         LA    @07,CPUNO-6(@08)                                    1126 03691000
         MVC   HOLDAREA+3(2),0(@07)                                1126 03692000
*                                 CPUVAL(INDEX2) = HOLDAREA;       1127 03693000
         L     @08,INDEX2                                          1127 03694000
         MH    @08,@CH00079                                        1127 03695000
         L     @07,CPUPTR(,R2)                                     1127 03696000
         ALR   @07,@08                                             1127 03697000
         AL    @07,@CF01062                                        1127 03698000
         MVC   CPUVAL-2(5,@07),HOLDAREA                            1127 03699000
*                               END;                       /*@Z427VLS*/ 03700000
*                           END;                           /*@Z427VLS*/ 03701000
@RF01123 BCTR  I,0                                                 1129 03702000
         LTR   I,I                                                 1129 03703000
         BP    @DL01122                                            1129 03704000
@DC01122 DS    0H                                                  1130 03705000
*                           IF FOUND = OFF THEN                    1130 03706000
         TM    FOUND,B'00010000'                                   1130 03707000
         BNZ   @RF01130                                            1130 03708000
*                             DO PLACE = -1;               /*@Z427VLS*/ 03709000
         SLR   @08,@08                                             1131 03710000
         BCTR  @08,0                                               1131 03711000
         ST    @08,PLACE                                           1131 03712000
*                               CALL OUTMSG (SYNTAX);      /*@Z427VLS*/ 03713000
         LA    @01,@AL01132                                        1132 03714000
         BAL   @14,OUTMSG                                          1132 03715000
*                             END;                         /*@Z427VLS*/ 03716000
*                         END;                             /*@Z427VLS*/ 03717000
*                       ELSE                                       1135 03718000
*                         CALL OUTMSG(SYNTAX);    /* INVALID MODEL    * 03719000
         B     @RC01120                                            1135 03720000
@RF01120 LA    @01,@AL01135                                        1135 03721000
         BAL   @14,OUTMSG                                          1135 03722000
*                       INDEX1 = INDEX1 + 6;      /* STEP OVER OPERAND* 03723000
@RC01120 AL    INDEX1,@CF00081                                     1136 03724000
*                     END;                                 /*@Z427VLS*/ 03725000
*                   ELSE                                           1138 03726000
*                     DO;                                  /*@Z427VLS*/ 03727000
         B     @RC01109                                            1138 03728000
@RF01109 DS    0H                                                  1139 03729000
*                       CALL OUTMSG(SYNTAX);      /* WRONG LENGTH FLD * 03730000
         LA    @01,@AL01139                                        1139 03731000
         BAL   @14,OUTMSG                                          1139 03732000
*                       INDEX1 = INDEX1 + NEXTC + 1;       /*@Z427VLS*/ 03733000
         LR    @08,INDEX1                                          1140 03734000
         AL    @08,NEXTC                                           1140 03735000
         AL    @08,@CF00055                                        1140 03736000
         LR    INDEX1,@08                                          1140 03737000
*                     END;                                 /*@Z427VLS*/ 03738000
*                 END;                                     /*@Z427VLS*/ 03739000
@RC01109 DS    0H                                                  1142 03740000
@DE01107 TM    RPORC,B'10000000'                                   1142 03741000
         BNZ   @DL01107                                            1142 03742000
*                 CPUNUM = INDEX2;                /* STORE # OF ENTRS * 03743000
         L     @08,CPUPTR(,R2)                                     1143 03744000
         L     @04,INDEX2                                          1143 03745000
         STH   @04,CPUNUM(,@08)                                    1143 03746000
*                 /*                                         @Z427VLS*/ 03747000
*                 /* CHECK FOR DUPLICATES                    @Z427VLS*/ 03748000
*                 /*                                         @Z427VLS*/ 03749000
*                 DO J = 1 TO CPUNUM BY 1;                 /*@Z427VLS*/ 03750000
         LA    J,1                                                 1144 03751000
         B     @DE01144                                            1144 03752000
@DL01144 DS    0H                                                  1145 03753000
*                   DO I = J+1 TO CPUNUM BY 1;             /*@Z427VLS*/ 03754000
         LA    I,1                                                 1145 03755000
         ALR   I,J                                                 1145 03756000
         B     @DE01145                                            1145 03757000
@DL01145 DS    0H                                                  1146 03758000
*                     IF CPUVAL(J) = CPUVAL(I) THEN                1146 03759000
         LA    @08,5                                               1146 03760000
         LR    @01,J                                               1146 03761000
         MR    @00,@08                                             1146 03762000
         L     @07,CPUPTR(,R2)                                     1146 03763000
         LR    @15,@08                                             1146 03764000
         MR    @14,I                                               1146 03765000
         ALR   @01,@07                                             1146 03766000
         AL    @01,@CF01062                                        1146 03767000
         ALR   @15,@07                                             1146 03768000
         AL    @15,@CF01062                                        1146 03769000
         CLC   CPUVAL-2(5,@01),CPUVAL-2(@15)                       1146 03770000
         BNE   @RF01146                                            1146 03771000
*                       DO PLACE = (CPUNUM - I) * 11 + 6;  /*@Z427VLS*/ 03772000
         LH    @08,CPUNUM(,@07)                                    1147 03773000
         SLR   @08,I                                               1147 03774000
         MH    @08,@CH00035                                        1147 03775000
         AL    @08,@CF00081                                        1147 03776000
         ST    @08,PLACE                                           1147 03777000
*                         CALL OUTMSG (DUPE);              /*@Z427VLS*/ 03778000
         LA    @01,@AL01148                                        1148 03779000
         BAL   @14,OUTMSG                                          1148 03780000
*                       END;                               /*@Z427VLS*/ 03781000
*                   END;                                   /*@Z427VLS*/ 03782000
@RF01146 AL    I,@CF00055                                          1150 03783000
@DE01145 L     @08,CPUPTR(,R2)                                     1150 03784000
         CH    I,CPUNUM(,@08)                                      1150 03785000
         BNH   @DL01145                                            1150 03786000
*                 END;                                     /*@Z427VLS*/ 03787000
         AL    J,@CF00055                                          1151 03788000
@DE01144 L     @08,CPUPTR(,R2)                                     1151 03789000
         CH    J,CPUNUM(,@08)                                      1151 03790000
         BNH   @DL01144                                            1151 03791000
*               END;                                       /*@Z427VLS*/ 03792000
*END;                                                      /*@Z427VLS*/ 03793000
@EL00038 DS    0H                                                  1153 03794000
@EF00038 DS    0H                                                  1153 03795000
@ER00038 L     @14,@SA00038                                        1153 03796000
         L     @01,@SA00038+4                                      1153 03797000
         BR    @14                                                 1153 03798000
*/********************************************************************/ 03799000
*/*                                                          @Z427VLS*/ 03800000
*/*      SYNTAX CHECK FOR CPUCUA (NNNNNN.XXX,NNNNNN.XXX(,ETC))       */ 03801000
*/*      ASSUMED TWO OPERANDS PRESENT.                       @Z427VLS*/ 03802000
*/*      MAXIMUM OF FOUR ENTRIES                             @Z427VLS*/ 03803000
*/*                                                          @Z427VLS*/ 03804000
*/********************************************************************/ 03805000
*PARMCPUC:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 03806000
PARMCPUC ST    @14,@SA00039                                        1154 03807000
         ST    @01,@SA00039+4                                      1154 03808000
*             NEXTRPC = OFF;                /* LOOK FOR R PAREN      */ 03809000
         NI    NEXTRPC,B'11111011'                                 1155 03810000
*             IF CPUCUFLG = ON THEN         /* CPUCUA ALREADY SPECIF */ 03811000
         TM    CPUCUFLG,B'01000000'                                1156 03812000
         BNO   @RF01156                                            1156 03813000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 03814000
         BAL   @14,DUPLICAT                                        1157 03815000
*             ELSE                                                 1158 03816000
*               DO INDEX1 = INDEX1 + 8;     /* STEP OVER PARM        */ 03817000
         B     @RC01156                                            1158 03818000
@RF01156 LA    @08,8                                               1158 03819000
         ALR   @08,INDEX1                                          1158 03820000
         LR    INDEX1,@08                                          1158 03821000
*                 CPUCUFLG = ON;                           /*@Z427VLS*/ 03822000
         OI    CPUCUFLG,B'01000000'                                1159 03823000
*                 /*                                         @Z427VLS*/ 03824000
*                 /* GET SPACE FOR TABLE.  ESTABLISH BASE POINTER.   */ 03825000
*                 /* CLEAR TABLE.                            @Z427VLS*/ 03826000
*                 /*                                         @Z427VLS*/ 03827000
*                 RESPECIFY (R1) RESTRICTED;               /*@Z427VLS*/ 03828000
*                 R1 = LENGTH(CPUCUAS);                    /*@0099VLS*/ 03829000
         LA    R1,30                                               1161 03830000
*                 GEN (GETMAIN R,LV=(1),SP=20);            /*@Z427VLS*/ 03831000
         GETMAIN R,LV=(1),SP=20                                         03832000
*                 CPCUAPTR = R1;                           /*@Z427VLS*/ 03833000
         ST    R1,CPCUAPTR(,R2)                                    1163 03834000
*                 RESPECIFY (R1) UNRESTRICTED;             /*@Z427VLS*/ 03835000
*                 INDEX2 = ZERO;                           /*@Z427VLS*/ 03836000
         SLR   @08,@08                                             1165 03837000
         ST    @08,INDEX2                                          1165 03838000
*                 CPUCUAS = CPUCUAS && CPUCUAS;            /*@Z427VLS*/ 03839000
         L     @08,CPCUAPTR(,R2)                                   1166 03840000
         XC    CPUCUAS(30,@08),CPUCUAS(@08)                        1166 03841000
*                 DO UNTIL (RPORC = OFF);                  /*@Z427VLS*/ 03842000
@DL01167 DS    0H                                                  1168 03843000
*                   CALL SCANCRP;           /* FIND DELIMITER        */ 03844000
         BAL   @14,SCANCRP                                         1168 03845000
*                   CALL VALCPUCU;          /* VALIDATE OPERAND      */ 03846000
         BAL   @14,VALCPUCU                                        1169 03847000
*                 END;                                     /*@Z427VLS*/ 03848000
@DE01167 TM    RPORC,B'10000000'                                   1170 03849000
         BNZ   @DL01167                                            1170 03850000
*                 CPCUANUM = INDEX2;        /* STORE # OF ENTRIES    */ 03851000
         L     @08,CPCUAPTR(,R2)                                   1171 03852000
         L     @04,INDEX2                                          1171 03853000
         STH   @04,CPCUANUM(,@08)                                  1171 03854000
*               END;                                       /*@Z427VLS*/ 03855000
*END;                                                      /*@Z427VLS*/ 03856000
@EL00039 DS    0H                                                  1173 03857000
@EF00039 DS    0H                                                  1173 03858000
@ER00039 L     @14,@SA00039                                        1173 03859000
         L     @01,@SA00039+4                                      1173 03860000
         BR    @14                                                 1173 03861000
*/********************************************************************/ 03862000
*/*                                                          @Z427VLS*/ 03863000
*/*      SYNTAX CHECK FOR CUA (UP TO 8 OF NXX,               @Z427VLS*/ 03864000
*/*                                       NNX,               @Z427VLS*/ 03865000
*/*                                       NNN,               @Z427VLS*/ 03866000
*/*                                       NNN-NNN)           @Z427VLS*/ 03867000
*/*                                                          @Z427VLS*/ 03868000
*/********************************************************************/ 03869000
*PARMCUA:   PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 03870000
PARMCUA  ST    @14,@SA00040                                        1174 03871000
         ST    @01,@SA00040+4                                      1174 03872000
*             NEXTRPC = OFF;                  /* LOOK FOR R PAREN   */  03873000
         NI    NEXTRPC,B'11111011'                                 1175 03874000
*             IF CUAFLG = ON THEN             /* CUA ALREADY SPECIF */  03875000
         TM    CUAFLG,B'00000100'                                  1176 03876000
         BNO   @RF01176                                            1176 03877000
*               CALL DUPLICAT;                             /*@Z427VLS*/ 03878000
         BAL   @14,DUPLICAT                                        1177 03879000
*             ELSE                                                 1178 03880000
*               DO INDEX1 = INDEX1 + 5;       /* INCR OVER PARM     */  03881000
         B     @RC01176                                            1178 03882000
@RF01176 LA    @08,5                                               1178 03883000
         ALR   @08,INDEX1                                          1178 03884000
         LR    INDEX1,@08                                          1178 03885000
*                 CUAFLG = ON;                             /*@Z427VLS*/ 03886000
         OI    CUAFLG,B'00000100'                                  1179 03887000
*                 /*                                         @Z427VLS*/ 03888000
*                 /* GET SPACE FOR TABLE.  ESTABLISH BASE POINTER.   */ 03889000
*                 /* CLEAR TABLE.                            @Z427VLS*/ 03890000
*                 /*                                         @Z427VLS*/ 03891000
*                 RESPECIFY (R1) RESTRICTED;               /*@Z427VLS*/ 03892000
*                 R1 = 40;                                 /*@Z427VLS*/ 03893000
         LA    R1,40                                               1181 03894000
*                 GEN(GETMAIN R,LV=(1),SP=20);             /*@Z427VLS*/ 03895000
         GETMAIN R,LV=(1),SP=20                                         03896000
*                 CUAPTR = R1;                             /*@Z427VLS*/ 03897000
         ST    R1,CUAPTR(,R2)                                      1183 03898000
*                 RESPECIFY (R1) UNRESTRICTED;             /*@Z427VLS*/ 03899000
*                 CUA = CUA && CUA;                        /*@Z427VLS*/ 03900000
         L     @08,CUAPTR(,R2)                                     1185 03901000
         XC    CUA(34,@08),CUA(@08)                                1185 03902000
*                 INDEX2 = ZERO;                           /*@Z427VLS*/ 03903000
         SLR   @08,@08                                             1186 03904000
         ST    @08,INDEX2                                          1186 03905000
*                 DO UNTIL (RPORC = OFF);                  /*@Z427VLS*/ 03906000
@DL01187 DS    0H                                                  1188 03907000
*                   CALL SCANCRP;             /* FIND DELIMITER      */ 03908000
         BAL   @14,SCANCRP                                         1188 03909000
*                   IF NEXTC = 3 THEN                              1189 03910000
         LA    @08,3                                               1189 03911000
         C     @08,NEXTC                                           1189 03912000
         BNE   @RF01189                                            1189 03913000
*                     DO;                                  /*@Z427VLS*/ 03914000
*                       /*                                   @Z427VLS*/ 03915000
*                       /* ONE OF THE POSSIBLE THREE-CHARACTER FIELDS*/ 03916000
*                       /* HAS BEEN SPECIFIED.  A CHARACTER ZERO IS  */ 03917000
*                       /* PLACED IN FRONT OF THE FIELD FOR  @Z427VLS*/ 03918000
*                       /* TRANSLATION PURPOSES.  THE FIELD IS THEN  */ 03919000
*                       /* VERIFIED BY A TABLE LOOKUP.  THE CHARACTER*/ 03920000
*                       /* VALUE IS REPLACED BY A HEXADECIMAL        */ 03921000
*                       /* EQUIVALENT.                       @Z427VLS*/ 03922000
*                       /*                                   @Z427VLS*/ 03923000
*                       CUAHOLD = PARMFLD(INDEX1:INDEX1+2);/*@Z427VLS*/ 03924000
         LA    @07,PARMFLD-1(INDEX1)                               1191 03925000
         MVC   CUAHOLD(3),0(@07)                                   1191 03926000
*                       INDEX1 = INDEX1 - 1;               /*@Z427VLS*/ 03927000
         BCTR  INDEX1,0                                            1192 03928000
*                       PARMFLD(INDEX1) = '0';             /*@Z427VLS*/ 03929000
         LA    @07,PARMFLD-1(INDEX1)                               1193 03930000
         MVI   0(@07),C'0'                                         1193 03931000
*                       I = INDEX1 + 3;                    /*@Z427VLS*/ 03932000
         ALR   @08,INDEX1                                          1194 03933000
         LR    I,@08                                               1194 03934000
*                       DO INDEX3 = INDEX1 TO I BY 1;      /*@Z427VLS*/ 03935000
         LR    @08,INDEX1                                          1195 03936000
         ST    @08,INDEX3                                          1195 03937000
         B     @DE01195                                            1195 03938000
@DL01195 DS    0H                                                  1196 03939000
*                         VALID = OFF;                     /*@Z427VLS*/ 03940000
         NI    VALID,B'01111111'                                   1196 03941000
*                         DO J = 17 TO 1 BY -1 WHILE (VALID = OFF);     03942000
         LA    J,17                                                1197 03943000
@DL01197 TM    VALID,B'10000000'                                   1197 03944000
         BNZ   @DC01197                                            1197 03945000
*                           IF PARMFLD(INDEX3) = NUMTAB(J) THEN    1198 03946000
         L     @08,INDEX3                                          1198 03947000
         LA    @07,PARMFLD-1(@08)                                  1198 03948000
         LA    @03,NUMTAB-1(J)                                     1198 03949000
         CLC   0(1,@07),0(@03)                                     1198 03950000
         BNE   @RF01198                                            1198 03951000
*                             DO;                          /*@Z427VLS*/ 03952000
*                               VALID = ON;                /*@Z427VLS*/ 03953000
         OI    VALID,B'10000000'                                   1200 03954000
*                               PARMFLD(INDEX3) = HEXTAB(J);       1201 03955000
         LA    @07,PARMFLD-1(@08)                                  1201 03956000
         LA    @08,HEXTAB-1(J)                                     1201 03957000
         MVC   0(1,@07),0(@08)                                     1201 03958000
*                             END;                         /*@Z427VLS*/ 03959000
*                         END;                             /*@Z427VLS*/ 03960000
@RF01198 BCTR  J,0                                                 1203 03961000
         LTR   J,J                                                 1203 03962000
         BP    @DL01197                                            1203 03963000
@DC01197 DS    0H                                                  1204 03964000
*                         IF VALID = OFF THEN   /* NOT A VALID DIGIT */ 03965000
         TM    VALID,B'10000000'                                   1204 03966000
         BNZ   @RF01204                                            1204 03967000
*                           DO PLACE = INDEX1 - INDEX3;    /*@Z427VLS*/ 03968000
         LR    @08,INDEX1                                          1205 03969000
         SL    @08,INDEX3                                          1205 03970000
         ST    @08,PLACE                                           1205 03971000
*                             CALL OUTMSG(SYNTAX);         /*@Z427VLS*/ 03972000
         LA    @01,@AL01206                                        1206 03973000
         BAL   @14,OUTMSG                                          1206 03974000
*                           END;                           /*@Z427VLS*/ 03975000
*                       END;                               /*@Z427VLS*/ 03976000
@RF01204 LA    @08,1                                               1208 03977000
         AL    @08,INDEX3                                          1208 03978000
         ST    @08,INDEX3                                          1208 03979000
@DE01195 CR    @08,I                                               1208 03980000
         BNH   @DL01195                                            1208 03981000
*                       IF INDEX2 < DIM(CUAVAL) THEN               1209 03982000
         L     @08,INDEX2                                          1209 03983000
         C     @08,@CF00066                                        1209 03984000
         BNL   @RF01209                                            1209 03985000
*                         INDEX2 = INDEX2 + 1;       /* GET INDEX VAL*/ 03986000
         AL    @08,@CF00055                                        1210 03987000
         ST    @08,INDEX2                                          1210 03988000
*                       ELSE                                       1211 03989000
*                           DO PLACE = -1;                 /*@Z427VLS*/ 03990000
         B     @RC01209                                            1211 03991000
@RF01209 SLR   @08,@08                                             1211 03992000
         BCTR  @08,0                                               1211 03993000
         ST    @08,PLACE                                           1211 03994000
*                             CALL OUTMSG(SYNTAX);         /*@Z427VLS*/ 03995000
         LA    @01,@AL01212                                        1212 03996000
         BAL   @14,OUTMSG                                          1212 03997000
*                           END;                           /*@Z427VLS*/ 03998000
*                       CALL HEXPACK(4);             /* PACK @Z427VLS*/ 03999000
@RC01209 LA    @01,@AL01214                                        1214 04000000
         BAL   @14,HEXPACK                                         1214 04001000
*                       CUA1(INDEX2) = HOLDAREA(1:2); /* STORE LOW CUA* 04002000
         L     @08,INDEX2                                          1215 04003000
         SLA   @08,2                                               1215 04004000
         L     @04,CUAPTR(,R2)                                     1215 04005000
         ALR   @04,@08                                             1215 04006000
         BCTR  @04,0                                               1215 04007000
         BCTR  @04,0                                               1215 04008000
         MVC   CUA1-2(2,@04),HOLDAREA                              1215 04009000
*                       /*                                   @Z427VLS*/ 04010000
*                       /* VALIDATE FOR THE TRAILING X'S AS ABOVE.   */ 04011000
*                       /* A HEX '0F' IS PLACED THERE FOR ALL VALIDS.*/ 04012000
*                       /*                                   @Z427VLS*/ 04013000
*                       INDEX1 = INDEX1 - 4;               /*@Z427VLS*/ 04014000
         SL    INDEX1,@CF00064                                     1216 04015000
*                       IF CUAHOLD(1) = 'X' THEN                   1217 04016000
         CLI   CUAHOLD,C'X'                                        1217 04017000
         BNE   @RF01217                                            1217 04018000
*                         DO PLACE = -1;                   /*@Z427VLS*/ 04019000
         SLR   @08,@08                                             1218 04020000
         BCTR  @08,0                                               1218 04021000
         ST    @08,PLACE                                           1218 04022000
*                           CALL OUTMSG(SYNTAX);           /*@Z427VLS*/ 04023000
         LA    @01,@AL01219                                        1219 04024000
         BAL   @14,OUTMSG                                          1219 04025000
*                         END;                             /*@Z427VLS*/ 04026000
*                       IF CUAHOLD(3) = 'X' THEN                   1221 04027000
@RF01217 CLI   CUAHOLD+2,C'X'                                      1221 04028000
         BNE   @RF01221                                            1221 04029000
*                         DO;                              /*@Z427VLS*/ 04030000
*                            PARMFLD(INDEX1+3) = CUAFOX;   /*@Z427VLS*/ 04031000
         LA    @08,PARMFLD+2(INDEX1)                               1223 04032000
         MVI   0(@08),X'0F'                                        1223 04033000
*                            IF CUAHOLD(2) = 'X' THEN              1224 04034000
         CLI   CUAHOLD+1,C'X'                                      1224 04035000
         BNE   @RF01224                                            1224 04036000
*                              PARMFLD(INDEX1+2) = CUAFOX; /*@Z427VLS*/ 04037000
         LA    @08,PARMFLD+1(INDEX1)                               1225 04038000
         MVI   0(@08),X'0F'                                        1225 04039000
*                         END;                             /*@Z427VLS*/ 04040000
*                       ELSE                                       1227 04041000
*                         IF CUAHOLD(2) = 'X' THEN                 1227 04042000
         B     @RC01221                                            1227 04043000
@RF01221 CLI   CUAHOLD+1,C'X'                                      1227 04044000
         BNE   @RF01227                                            1227 04045000
*                           DO PLACE = -2;                 /*@Z427VLS*/ 04046000
         L     @08,@CF00880                                        1228 04047000
         ST    @08,PLACE                                           1228 04048000
*                             CALL OUTMSG(SYNTAX);         /*@Z427VLS*/ 04049000
         LA    @01,@AL01229                                        1229 04050000
         BAL   @14,OUTMSG                                          1229 04051000
*                           END;                           /*@Z427VLS*/ 04052000
*                       CALL HEXPACK(4);     /* PACK FOR HIGH VALUE  */ 04053000
@RF01227 DS    0H                                                  1231 04054000
@RC01221 LA    @01,@AL01231                                        1231 04055000
         BAL   @14,HEXPACK                                         1231 04056000
*                       CUA2(INDEX2) = HOLDAREA(1:2);  /* STORE      */ 04057000
         L     @08,INDEX2                                          1232 04058000
         SLA   @08,2                                               1232 04059000
         L     @04,CUAPTR(,R2)                                     1232 04060000
         ST    @08,@TF00001                                        1232 04061000
         ALR   @08,@04                                             1232 04062000
         MVC   CUA2-4(2,@08),HOLDAREA                              1232 04063000
*                       /*                                   @Z427VLS*/ 04064000
*                       /* DETERMINE IF THE SAME CUA HAS BEEN SPECIFD*/ 04065000
*                       /* TWICE.  AN INDEX AND BIT DISPLACEMENT IS  */ 04066000
*                       /* CALCULATED INTO THE TABLE CUAS.  IF THE   */ 04067000
*                       /* BIT IS TURNED ON, THEN THE CUA HAS ALREADY*/ 04068000
*                       /* BEEN SPECIFIED.  IF NOT, THE BIT IS TURNED*/ 04069000
*                       /* ON.  EACH CUA IS EXAMINED IN TURN.        */ 04070000
*                       /*                                   @Z427VLS*/ 04071000
*                       DO J = CUA1(INDEX2) TO CUA2(INDEX2) BY 1;  1233 04072000
         L     @08,CUAPTR(,R2)                                     1233 04073000
         AL    @08,@TF00001                                        1233 04074000
         BCTR  @08,0                                               1233 04075000
         BCTR  @08,0                                               1233 04076000
         SLR   J,J                                                 1233 04077000
         ICM   J,3,CUA1-2(@08)                                     1233 04078000
         B     @DE01233                                            1233 04079000
@DL01233 DS    0H                                                  1234 04080000
*                         SWITCHC = '80'X;                 /*@Z427VLS*/ 04081000
         MVI   SWITCHC,X'80'                                       1234 04082000
*                         I = J/8;                         /*@Z427VLS*/ 04083000
         LR    @00,J                                               1235 04084000
         SRDA  @00,32                                              1235 04085000
         D     @00,@CF00066                                        1235 04086000
         LR    I,@01                                               1235 04087000
*                         INDEX3 = J - I*8;                /*@Z427VLS*/ 04088000
         LR    @08,I                                               1236 04089000
         SLA   @08,3                                               1236 04090000
         LCR   @08,@08                                             1236 04091000
         ALR   @08,J                                               1236 04092000
         ST    @08,INDEX3                                          1236 04093000
*                         SRL (SWITCHC,INDEX3);            /*@Z427VLS*/ 04094000
         SLR   @07,@07                                             1237 04095000
         IC    @07,SWITCHC                                         1237 04096000
         SRL   @07,0(@08)                                          1237 04097000
         STC   @07,SWITCHC                                         1237 04098000
*                         I = I + 1;                       /*@Z427VLS*/ 04099000
         AL    I,@CF00055                                          1238 04100000
*                         IF (CUAS(I) & SWITCHC) = SWITCHC THEN    1239 04101000
         LA    @08,CUAS-1(I)                                       1239 04102000
         MVC   @TS00001(1),0(@08)                                  1239 04103000
         NC    @TS00001(1),SWITCHC                                 1239 04104000
         CLC   @TS00001(1),SWITCHC                                 1239 04105000
         BNE   @RF01239                                            1239 04106000
*                           DO PLACE = 3;                  /*@Z427VLS*/ 04107000
         LA    @08,3                                               1240 04108000
         ST    @08,PLACE                                           1240 04109000
*                             CALL OUTMSG(DUPE);           /*@Z427VLS*/ 04110000
         LA    @01,@AL01241                                        1241 04111000
         BAL   @14,OUTMSG                                          1241 04112000
*                           END;                           /*@Z427VLS*/ 04113000
*                         ELSE                                     1243 04114000
*                           CUAS(I) = CUAS(I) | SWITCHC;   /*@Z427VLS*/ 04115000
         B     @RC01239                                            1243 04116000
@RF01239 LA    @08,CUAS-1(I)                                       1243 04117000
         OC    0(1,@08),SWITCHC                                    1243 04118000
*                       END;                               /*@Z427VLS*/ 04119000
@RC01239 AL    J,@CF00055                                          1244 04120000
@DE01233 L     @08,INDEX2                                          1244 04121000
         SLA   @08,2                                               1244 04122000
         L     @03,CUAPTR(,R2)                                     1244 04123000
         ALR   @03,@08                                             1244 04124000
         SLR   @08,@08                                             1244 04125000
         ICM   @08,3,CUA2-4(@03)                                   1244 04126000
         CR    J,@08                                               1244 04127000
         BNH   @DL01233                                            1244 04128000
*                     END;                                 /*@Z427VLS*/ 04129000
*                   ELSE                                           1246 04130000
*                     IF NEXTC = 7 THEN                            1246 04131000
         B     @RC01189                                            1246 04132000
@RF01189 CLC   NEXTC(4),@CF00083                                   1246 04133000
         BNE   @RF01246                                            1246 04134000
*                       DO;                                /*@Z427VLS*/ 04135000
*                         /*                                 @Z427VLS*/ 04136000
*                         /* A LOW-HIGH RANGE HAS BEEN SPECIFIED.    */ 04137000
*                         /* THE LOW AND HIGH ARE EXAMINED IN TURN.  */ 04138000
*                         /* THE RANGE IS STORED.  THEN THE CHECK FOR*/ 04139000
*                         /* DUPLICATE CUA SPECIFICATION IS CHECKED. */ 04140000
*                         /* A CHARACTER ZERO IS PLACED IN FRONT OF  */ 04141000
*                         /* THE CUA FOR CONVERSION PURPOSES.  THE   */ 04142000
*                         /* FIELD IS THEN CHECKED FOR VALID HEX AND */ 04143000
*                         /* PACKED.                         @Z427VLS*/ 04144000
*                         /*                                 @Z427VLS*/ 04145000
*                         INDEX1 = INDEX1 - 1;             /*@Z427VLS*/ 04146000
         BCTR  INDEX1,0                                            1248 04147000
*                         PARMFLD(INDEX1) = '0';           /*@Z427VLS*/ 04148000
         LA    @08,PARMFLD-1(INDEX1)                               1249 04149000
         MVI   0(@08),C'0'                                         1249 04150000
*                         CALL VALIDHEX(4);                /*@Z427VLS*/ 04151000
         LA    @01,@AL01250                                        1250 04152000
         BAL   @14,VALIDHEX                                        1250 04153000
*                         CALL HEXPACK(4);                 /*@Z427VLS*/ 04154000
         LA    @01,@AL01251                                        1251 04155000
         BAL   @14,HEXPACK                                         1251 04156000
*                         IF INDEX2 < DIM(CUAVAL) THEN             1252 04157000
         L     @08,INDEX2                                          1252 04158000
         C     @08,@CF00066                                        1252 04159000
         BNL   @RF01252                                            1252 04160000
*                           INDEX2 = INDEX2 + 1;           /*@Z427VLS*/ 04161000
         AL    @08,@CF00055                                        1253 04162000
         ST    @08,INDEX2                                          1253 04163000
*                         ELSE                                     1254 04164000
*                           DO PLACE = 3;                  /*@Z427VLS*/ 04165000
         B     @RC01252                                            1254 04166000
@RF01252 LA    @08,3                                               1254 04167000
         ST    @08,PLACE                                           1254 04168000
*                             CALL OUTMSG(SYNTAX);         /*@Z427VLS*/ 04169000
         LA    @01,@AL01255                                        1255 04170000
         BAL   @14,OUTMSG                                          1255 04171000
*                           END;                           /*@Z427VLS*/ 04172000
*                         CUA1(INDEX2) = HOLDAREA(1:2); /* STORE LOW */ 04173000
@RC01252 L     @08,INDEX2                                          1257 04174000
         SLA   @08,2                                               1257 04175000
         L     @04,CUAPTR(,R2)                                     1257 04176000
         ALR   @04,@08                                             1257 04177000
         BCTR  @04,0                                               1257 04178000
         BCTR  @04,0                                               1257 04179000
         MVC   CUA1-2(2,@04),HOLDAREA                              1257 04180000
*                         /*                                 @Z427VLS*/ 04181000
*                         /* IF THE DELIMITER IS A DASH, THEN CHECK  */ 04182000
*                         /* FOR VALID SYNTAX.  IF NOT, THEN THERE IS*/ 04183000
*                         /* AN ERROR.                       @Z427VLS*/ 04184000
*                         /*                                 @Z427VLS*/ 04185000
*                         IF PARMFLD(INDEX1) = DASH THEN           1258 04186000
         LA    @08,PARMFLD-1(INDEX1)                               1258 04187000
         CLI   0(@08),C'-'                                         1258 04188000
         BNE   @RF01258                                            1258 04189000
*                           DO;                            /*@Z427VLS*/ 04190000
*                             /*                             @Z427VLS*/ 04191000
*                             /* A CHARACTER ZERO IS PLACED IN FRONT */ 04192000
*                             /* OF THE CUA FOR CONVERSION PURPOSES. */ 04193000
*                             /* THE FIELD IS VALIDATED FOR HEX AND  */ 04194000
*                             /* PACKED AND STORED AS THE HIGH VALUE.*/ 04195000
*                             /*                             @Z427VLS*/ 04196000
*                             PARMFLD(INDEX1) = '0';       /*@Z427VLS*/ 04197000
         LA    @08,PARMFLD-1(INDEX1)                               1260 04198000
         MVI   0(@08),C'0'                                         1260 04199000
*                             CALL VALIDHEX(4);            /*@Z427VLS*/ 04200000
         LA    @01,@AL01261                                        1261 04201000
         BAL   @14,VALIDHEX                                        1261 04202000
*                             CALL HEXPACK(4);             /*@Z427VLS*/ 04203000
         LA    @01,@AL01262                                        1262 04204000
         BAL   @14,HEXPACK                                         1262 04205000
*                             CUA2(INDEX2) = HOLDAREA(1:2);/*@Z427VLS*/ 04206000
         L     @08,INDEX2                                          1263 04207000
         SLA   @08,2                                               1263 04208000
         L     @04,CUAPTR(,R2)                                     1263 04209000
         ST    @08,@TF00001                                        1263 04210000
         ALR   @08,@04                                             1263 04211000
         MVC   CUA2-4(2,@08),HOLDAREA                              1263 04212000
*                             IF CUA2(INDEX2) > CUA1(INDEX2) THEN  1264 04213000
         LR    @08,@04                                             1264 04214000
         AL    @08,@TF00001                                        1264 04215000
         LR    @03,@04                                             1264 04216000
         AL    @03,@TF00001                                        1264 04217000
         BCTR  @03,0                                               1264 04218000
         BCTR  @03,0                                               1264 04219000
         CLC   CUA2-4(2,@08),CUA1-2(@03)                           1264 04220000
         BNH   @RF01264                                            1264 04221000
*                               DO J = CUA1(INDEX2)                1265 04222000
*                                      TO CUA2(INDEX2) BY 1;       1265 04223000
         L     @08,CUAPTR(,R2)                                     1265 04224000
         AL    @08,@TF00001                                        1265 04225000
         BCTR  @08,0                                               1265 04226000
         BCTR  @08,0                                               1265 04227000
         SLR   J,J                                                 1265 04228000
         ICM   J,3,CUA1-2(@08)                                     1265 04229000
         B     @DE01265                                            1265 04230000
@DL01265 DS    0H                                                  1266 04231000
*                                 /*                         @Z427VLS*/ 04232000
*                                 /* DETERMINE IF THE SAME CUA HAS   */ 04233000
*                                 /* BEEN SPECIFIED TWICE.  AN INDEX */ 04234000
*                                 /* AND BIT DISPLACEMENT IS CALCULAT*/ 04235000
*                                 /* INTO THE TABLE CUAS.  IF THE BIT*/ 04236000
*                                 /* IS TURNED ON, THEN THE CUA HAS  */ 04237000
*                                 /* ALREADY BEEN SPECIFIED.  IF NOT,*/ 04238000
*                                 /* THE BIT IS TURNED ON.  EACH CUA */ 04239000
*                                 /* IS EXAMINED IN TURN.    @Z427VLS*/ 04240000
*                                 /*                         @Z427VLS*/ 04241000
*                                 SWITCHC = '80'X;         /*@Z427VLS*/ 04242000
         MVI   SWITCHC,X'80'                                       1266 04243000
*                                 I = J/8;                 /*@Z427VLS*/ 04244000
         LR    @00,J                                               1267 04245000
         SRDA  @00,32                                              1267 04246000
         D     @00,@CF00066                                        1267 04247000
         LR    I,@01                                               1267 04248000
*                                 INDEX3 = J - I*8;        /*@Z427VLS*/ 04249000
         LR    @08,I                                               1268 04250000
         SLA   @08,3                                               1268 04251000
         LCR   @08,@08                                             1268 04252000
         ALR   @08,J                                               1268 04253000
         ST    @08,INDEX3                                          1268 04254000
*                                 SRL (SWITCHC,INDEX3);    /*@Z427VLS*/ 04255000
         SLR   @07,@07                                             1269 04256000
         IC    @07,SWITCHC                                         1269 04257000
         SRL   @07,0(@08)                                          1269 04258000
         STC   @07,SWITCHC                                         1269 04259000
*                                 I = I + 1;               /*@Z427VLS*/ 04260000
         AL    I,@CF00055                                          1270 04261000
*                                 IF (CUAS(I) & SWITCHC) = SWITCHC THEN 04262000
         LA    @08,CUAS-1(I)                                       1271 04263000
         MVC   @TS00001(1),0(@08)                                  1271 04264000
         NC    @TS00001(1),SWITCHC                                 1271 04265000
         CLC   @TS00001(1),SWITCHC                                 1271 04266000
         BNE   @RF01271                                            1271 04267000
*                                   DO PLACE = 7;          /*@Z427VLS*/ 04268000
         LA    @08,7                                               1272 04269000
         ST    @08,PLACE                                           1272 04270000
*                                     CALL OUTMSG(DUPE);   /*@Z427VLS*/ 04271000
         LA    @01,@AL01273                                        1273 04272000
         BAL   @14,OUTMSG                                          1273 04273000
*                                   END;                   /*@Z427VLS*/ 04274000
*                                 ELSE                             1275 04275000
*                                   CUAS(I) = CUAS(I) | SWITCHC;   1275 04276000
         B     @RC01271                                            1275 04277000
@RF01271 LA    @08,CUAS-1(I)                                       1275 04278000
         OC    0(1,@08),SWITCHC                                    1275 04279000
*                               END;                       /*@Z427VLS*/ 04280000
@RC01271 AL    J,@CF00055                                          1276 04281000
@DE01265 L     @08,INDEX2                                          1276 04282000
         SLA   @08,2                                               1276 04283000
         L     @03,CUAPTR(,R2)                                     1276 04284000
         ALR   @03,@08                                             1276 04285000
         SLR   @08,@08                                             1276 04286000
         ICM   @08,3,CUA2-4(@03)                                   1276 04287000
         CR    J,@08                                               1276 04288000
         BNH   @DL01265                                            1276 04289000
*                             ELSE                                 1277 04290000
*                               DO PLACE = 3;              /*@Z427VLS*/ 04291000
         B     @RC01264                                            1277 04292000
@RF01264 LA    @08,3                                               1277 04293000
         ST    @08,PLACE                                           1277 04294000
*                                 CALL OUTMSG(SYNTAX);     /*@Z427VLS*/ 04295000
         LA    @01,@AL01278                                        1278 04296000
         BAL   @14,OUTMSG                                          1278 04297000
*                               END;                       /*@Z427VLS*/ 04298000
*                           END;                           /*@Z427VLS*/ 04299000
*                         ELSE                                     1281 04300000
*                           DO;                            /*@Z427VLS*/ 04301000
         B     @RC01258                                            1281 04302000
@RF01258 DS    0H                                                  1282 04303000
*                             CALL OUTMSG(SYNTAX);   /* DASH MISSING */ 04304000
         LA    @01,@AL01282                                        1282 04305000
         BAL   @14,OUTMSG                                          1282 04306000
*                             INDEX1 = INDEX1 + 4;         /*@Z427VLS*/ 04307000
         AL    INDEX1,@CF00064                                     1283 04308000
*                           END;                           /*@Z427VLS*/ 04309000
*                       END;                               /*@Z427VLS*/ 04310000
*                     ELSE                                         1286 04311000
*                       DO;                                /*@Z427VLS*/ 04312000
         B     @RC01246                                            1286 04313000
@RF01246 DS    0H                                                  1287 04314000
*                         CALL OUTMSG(SYNTAX);    /* WRONG LENGTH FLD*/ 04315000
         LA    @01,@AL01287                                        1287 04316000
         BAL   @14,OUTMSG                                          1287 04317000
*                         INDEX1 = INDEX1 + NEXTC;         /*@Z427VLS*/ 04318000
         AL    INDEX1,NEXTC                                        1288 04319000
*                       END;                               /*@Z427VLS*/ 04320000
*                 INDEX1 = INDEX1 + 1;                     /*@Z427VLS*/ 04321000
@RC01246 DS    0H                                                  1290 04322000
@RC01189 AL    INDEX1,@CF00055                                     1290 04323000
*                 END;                                     /*@Z427VLS*/ 04324000
@DE01187 TM    RPORC,B'10000000'                                   1291 04325000
         BNZ   @DL01187                                            1291 04326000
*                 CUANUM = INDEX2;        /* STORE # OF ENTRIES      */ 04327000
         L     @08,CUAPTR(,R2)                                     1292 04328000
         L     @04,INDEX2                                          1292 04329000
         STH   @04,CUANUM(,@08)                                    1292 04330000
*               END;                                       /*@Z427VLS*/ 04331000
*END;                                                      /*@Z427VLS*/ 04332000
@EL00040 DS    0H                                                  1294 04333000
@EF00040 DS    0H                                                  1294 04334000
@ER00040 L     @14,@SA00040                                        1294 04335000
         L     @01,@SA00040+4                                      1294 04336000
         BR    @14                                                 1294 04337000
*/********************************************************************/ 04338000
*/*                                                          @Z427VLS*/ 04339000
*/*      SYNTAX CHECK FOR LINECT (NNN)                       @Z427VLS*/ 04340000
*/*                                                          @Z427VLS*/ 04341000
*/********************************************************************/ 04342000
*PARMLINE:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 04343000
PARMLINE ST    @14,@SA00041                                        1295 04344000
         ST    @01,@SA00041+4                                      1295 04345000
*             IF LINEFLG = ON THEN                                 1296 04346000
         TM    LINEFLG,B'00000010'                                 1296 04347000
         BNO   @RF01296                                            1296 04348000
*               CALL DUPLICAT;           /* LINECT ALREADY SPECIF    */ 04349000
         BAL   @14,DUPLICAT                                        1297 04350000
*             ELSE                                                 1298 04351000
*               DO INDEX1 = INDEX1 + 7;  /* STEP OVER PARAMETER      */ 04352000
         B     @RC01296                                            1298 04353000
@RF01296 LA    @08,7                                               1298 04354000
         ALR   @08,INDEX1                                          1298 04355000
         LR    INDEX1,@08                                          1298 04356000
*                 CALL SCANC;            /* FIND DELIMITER   @Z427VLS*/ 04357000
         BAL   @14,SCANC                                           1299 04358000
*                 LINEFLG = ON;                            /*@Z427VLS*/ 04359000
         OI    LINEFLG,B'00000010'                                 1300 04360000
*                 IF NEXTC > 0 & NEXTC < 4 THEN                    1301 04361000
         L     @08,NEXTC                                           1301 04362000
         LTR   @08,@08                                             1301 04363000
         BNP   @RF01301                                            1301 04364000
         C     @08,@CF00064                                        1301 04365000
         BNL   @RF01301                                            1301 04366000
*                   DO;                                    /*@Z427VLS*/ 04367000
*                     /*                                     @Z427VLS*/ 04368000
*                     /* VALID LENGTH.  DETERMINE THE VALUE FOR THE  */ 04369000
*                     /* LINE COUNT IN BINARY AND STORE IT.  @Z427VLS*/ 04370000
*                     /*                                     @Z427VLS*/ 04371000
*                     CALL VALIDNUM(NEXTC);                /*@Z427VLS*/ 04372000
         LA    @01,@AL01303                                        1303 04373000
         BAL   @14,VALIDNUM                                        1303 04374000
*                     LINECT = PARMFLD(INDEX1);            /*@Z427VLS*/ 04375000
         SLR   @08,@08                                             1304 04376000
         IC    @08,PARMFLD-1(INDEX1)                               1304 04377000
         STH   @08,LINECT(,R2)                                     1304 04378000
*                     IF NEXTC >= 2 THEN                           1305 04379000
         L     @04,NEXTC                                           1305 04380000
         C     @04,@CF00074                                        1305 04381000
         BL    @RF01305                                            1305 04382000
*                       LINECT = LINECT*10 + PARMFLD(INDEX1+1);    1306 04383000
         MH    @08,@CH00034                                        1306 04384000
         SLR   @04,@04                                             1306 04385000
         IC    @04,PARMFLD(INDEX1)                                 1306 04386000
         ALR   @08,@04                                             1306 04387000
         STH   @08,LINECT(,R2)                                     1306 04388000
*                     IF NEXTC = 3 THEN                            1307 04389000
@RF01305 CLC   NEXTC(4),@CF00076                                   1307 04390000
         BNE   @RF01307                                            1307 04391000
*                       LINECT = LINECT*10 + PARMFLD(INDEX1+2);    1308 04392000
         LH    @08,LINECT(,R2)                                     1308 04393000
         MH    @08,@CH00034                                        1308 04394000
         SLR   @04,@04                                             1308 04395000
         IC    @04,PARMFLD+1(INDEX1)                               1308 04396000
         ALR   @08,@04                                             1308 04397000
         STH   @08,LINECT(,R2)                                     1308 04398000
*                     IF LINECT <= 24 THEN                         1309 04399000
@RF01307 LH    @08,LINECT(,R2)                                     1309 04400000
         C     @08,@CF00227                                        1309 04401000
         BH    @RF01309                                            1309 04402000
*                       DO;                                /*@Z427VLS*/ 04403000
*                         LINECT = 50;                     /*@Z427VLS*/ 04404000
         MVC   LINECT(2,R2),@CH00293                               1311 04405000
*                         CALL OUTMSG(SYNTAX);             /*@Z427VLS*/ 04406000
         LA    @01,@AL01312                                        1312 04407000
         BAL   @14,OUTMSG                                          1312 04408000
*                       END;                               /*@Z427VLS*/ 04409000
*                   END;                                   /*@Z427VLS*/ 04410000
*                 ELSE                                             1315 04411000
*                   CALL OUTMSG(SYNTAX);     /* WRONG LENGTH FIELD   */ 04412000
         B     @RC01301                                            1315 04413000
@RF01301 LA    @01,@AL01315                                        1315 04414000
         BAL   @14,OUTMSG                                          1315 04415000
*                 INDEX1 = INDEX1 + NEXTC;                 /*@Z427VLS*/ 04416000
@RC01301 AL    INDEX1,NEXTC                                        1316 04417000
*               END;                                       /*@Z427VLS*/ 04418000
*END;                                                      /*@Z427VLS*/ 04419000
@EL00041 DS    0H                                                  1318 04420000
@EF00041 DS    0H                                                  1318 04421000
@ER00041 L     @14,@SA00041                                        1318 04422000
         L     @01,@SA00041+4                                      1318 04423000
         BR    @14                                                 1318 04424000
*/*                                                          @G51DGVS*/ 04425000
*/* PARAMETER USERPGM                                        @G51DGVS*/ 04426000
*/*                                                          @G51DGVS*/ 04427000
*PARMUSER: PROC OPTIONS(SAVE(1,14));                       /*@G51DGVS*/ 04428000
PARMUSER ST    @14,@SA00042                                        1319 04429000
         ST    @01,@SA00042+4                                      1319 04430000
*       IF USERFLG = ON THEN                                       1320 04431000
         TM    USERFLG,B'00000010'                                 1320 04432000
         BNO   @RF01320                                            1320 04433000
*         CALL DUPLICAT;                                   /*@G51DGVS*/ 04434000
         BAL   @14,DUPLICAT                                        1321 04435000
*       ELSE                                                       1322 04436000
*         DO INDEX1 = INDEX1 + 8;                          /*@G51DGVS*/ 04437000
         B     @RC01320                                            1322 04438000
@RF01320 LA    @08,8                                               1322 04439000
         ALR   @08,INDEX1                                          1322 04440000
         LR    INDEX1,@08                                          1322 04441000
*           USERFLG = ON;                                  /*@G51DGVS*/ 04442000
         OI    USERFLG,B'00000010'                                 1323 04443000
*           USERPGM = PARMFLD(INDEX1:INDEX1+7);            /*@G51DGVS*/ 04444000
         LA    @08,PARMFLD-1(INDEX1)                               1324 04445000
         MVC   USERPGM(8,R2),0(@08)                                1324 04446000
*           CALL SCANC;                                    /*@G51DGVS*/ 04447000
         BAL   @14,SCANC                                           1325 04448000
*           INDEX1 = INDEX1 + NEXTC;                       /*@G51DGVS*/ 04449000
         AL    INDEX1,NEXTC                                        1326 04450000
*         END;                                             /*@G51DGVS*/ 04451000
*  END;                                                    /*@G51DGVS*/ 04452000
@EL00042 DS    0H                                                  1328 04453000
@EF00042 DS    0H                                                  1328 04454000
@ER00042 L     @14,@SA00042                                        1328 04455000
         L     @01,@SA00042+4                                      1328 04456000
         BR    @14                                                 1328 04457000
*/********************************************************************/ 04458000
*/*                                                          @Z427VLS*/ 04459000
*/*      SYNTAX CHECK FOR DEBUG (N(,N,...,N))                @Z427VLS*/ 04460000
*/*                                                          @Z427VLS*/ 04461000
*/********************************************************************/ 04462000
*PARMDEBU:  PROC OPTIONS(SAVE(1,14));                      /*@Z427VLS*/ 04463000
PARMDEBU ST    @14,@SA00043                                        1329 04464000
         ST    @01,@SA00043+4                                      1329 04465000
*             NEXTRPC = OFF;             /* LOOK FOR R PAREN @Z427VLS*/ 04466000
         NI    NEXTRPC,B'11111011'                                 1330 04467000
*             INDEX1 = INDEX1 + 7;       /* INCR OVER PARM   @Z427VLS*/ 04468000
         AL    INDEX1,@CF00083                                     1331 04469000
*             DO UNTIL (RPORC = OFF);                      /*@Z427VLS*/ 04470000
@DL01332 DS    0H                                                  1333 04471000
*               CALL SCANCRP;            /* FIND DELIMITER   @Z427VLS*/ 04472000
         BAL   @14,SCANCRP                                         1333 04473000
*               INDEX3 = ZERO;                             /*@Z427VLS*/ 04474000
         SLR   @08,@08                                             1334 04475000
         ST    @08,INDEX3                                          1334 04476000
*               IF NEXTC =  1 THEN                                 1335 04477000
         CLC   NEXTC(4),@CF00055                                   1335 04478000
         BNE   @RF01335                                            1335 04479000
*                 DO;                                      /*@Z427VLS*/ 04480000
*                   /*                                       @Z427VLS*/ 04481000
*                   /* A SINGLE DIGIT HAS BEEN SPECIFIED.  VALIDATE  */ 04482000
*                   /* FOR NUMERICS AND STORE.               @Z427VLS*/ 04483000
*                   /*                                       @Z427VLS*/ 04484000
*                   CALL VALIDNUM(1);                      /*@Z427VLS*/ 04485000
         LA    @01,@AL01337                                        1337 04486000
         BAL   @14,VALIDNUM                                        1337 04487000
*                   INDEX3 = PARMFLD(INDEX1);              /*@Z427VLS*/ 04488000
         SLR   @08,@08                                             1338 04489000
         IC    @08,PARMFLD-1(INDEX1)                               1338 04490000
         ST    @08,INDEX3                                          1338 04491000
*                 END;                                     /*@Z427VLS*/ 04492000
*               IF NEXTC =  2 THEN                                 1340 04493000
@RF01335 CLC   NEXTC(4),@CF00074                                   1340 04494000
         BNE   @RF01340                                            1340 04495000
*                 DO;                                      /*@Z427VLS*/ 04496000
*                   /*                                       @Z427VLS*/ 04497000
*                   /* TWO DIGITS HAVE    BEEN SPECIFIED.  VALIDATE  */ 04498000
*                   /* FOR NUMERICS AND STORE.               @Z427VLS*/ 04499000
*                   /*                                       @Z427VLS*/ 04500000
*                   CALL VALIDNUM(2);                      /*@Z427VLS*/ 04501000
         LA    @01,@AL01342                                        1342 04502000
         BAL   @14,VALIDNUM                                        1342 04503000
*                   INDEX3 = PARMFLD(INDEX1)*10 + PARMFLD(INDEX1+1);    04504000
         SLR   @08,@08                                             1343 04505000
         IC    @08,PARMFLD-1(INDEX1)                               1343 04506000
         MH    @08,@CH00034                                        1343 04507000
         SLR   @04,@04                                             1343 04508000
         IC    @04,PARMFLD(INDEX1)                                 1343 04509000
         ALR   @08,@04                                             1343 04510000
         ST    @08,INDEX3                                          1343 04511000
*                 END;                                     /*@Z427VLS*/ 04512000
*               IF INDEX3 < 32 THEN                                1345 04513000
@RF01340 L     @08,INDEX3                                          1345 04514000
         C     @08,@CF00586                                        1345 04515000
         BNL   @RF01345                                            1345 04516000
*                 DO;                                      /*@Z427VLS*/ 04517000
*                   /*                                       @Z427VLS*/ 04518000
*                   /* DETERMINE THE BIT LOCATION IN THE DEBUG BYTES */ 04519000
*                   /* AND OR THE BIT ON.                    @Z427VLS*/ 04520000
*                   /*                                       @Z427VLS*/ 04521000
*                   J = '80000000'X;                       /*@Z427VLS*/ 04522000
         L     J,@CF00894                                          1347 04523000
*                   SRL (J,INDEX3);                        /*@Z427VLS*/ 04524000
         SRL   J,0(@08)                                            1348 04525000
*                   DEBUG = DEBUG | J;                     /*@Z427VLS*/ 04526000
         L     @08,DEBUG(,R2)                                      1349 04527000
         OR    @08,J                                               1349 04528000
         ST    @08,DEBUG(,R2)                                      1349 04529000
*                 END;                                     /*@Z427VLS*/ 04530000
*               IF INDEX3 >= 32 & INDEX3 < 64 THEN                 1351 04531000
@RF01345 L     @08,INDEX3                                          1351 04532000
         LA    @04,32                                              1351 04533000
         CR    @08,@04                                             1351 04534000
         BL    @RF01351                                            1351 04535000
         C     @08,@CF00895                                        1351 04536000
         BNL   @RF01351                                            1351 04537000
*                 DO;                                      /*@Z427VLS*/ 04538000
*                   /*                                       @Z427VLS*/ 04539000
*                   /* DETERMINE THE BIT LOCATION IN THE DEBUG BYTES */ 04540000
*                   /* AND OR THE BIT ON.                    @Z427VLS*/ 04541000
*                   /*                                       @Z427VLS*/ 04542000
*                   J = '80000000'X;                       /*@Z427VLS*/ 04543000
         L     J,@CF00894                                          1353 04544000
*                   INDEX3 = INDEX3 - 32;                  /*@Z427VLS*/ 04545000
         LA    @03,32                                              1354 04546000
         SLR   @08,@03                                             1354 04547000
         ST    @08,INDEX3                                          1354 04548000
*                   SRL (J,INDEX3);                        /*@Z427VLS*/ 04549000
         SRL   J,0(@08)                                            1355 04550000
*                   DEBUGA = DEBUGA | J;                   /*@Z427VLS*/ 04551000
         L     @08,DEBUGA(,R2)                                     1356 04552000
         OR    @08,J                                               1356 04553000
         ST    @08,DEBUGA(,R2)                                     1356 04554000
*                 END;                                     /*@Z427VLS*/ 04555000
*               INDEX1 = INDEX1 + NEXTC + 1;               /*@Z427VLS*/ 04556000
@RF01351 LR    @08,INDEX1                                          1358 04557000
         AL    @08,NEXTC                                           1358 04558000
         AL    @08,@CF00055                                        1358 04559000
         LR    INDEX1,@08                                          1358 04560000
*             END;                                         /*@Z427VLS*/ 04561000
@DE01332 TM    RPORC,B'10000000'                                   1359 04562000
         BNZ   @DL01332                                            1359 04563000
*END;                                                      /*@Z427VLS*/ 04564000
@EL00043 DS    0H                                                  1360 04565000
@EF00043 DS    0H                                                  1360 04566000
@ER00043 L     @14,@SA00043                                        1360 04567000
         L     @01,@SA00043+4                                      1360 04568000
         BR    @14                                                 1360 04569000
*/*                                                          @0099VLS*/ 04570000
*/* PROCESS THE KEYWORD PARAMETERS BY A CASE STATEMENT       @0099VLS*/ 04571000
*/*                                                          @0099VLS*/ 04572000
*KEYCASE: PROC;                                            /*@0099VLS*/ 04573000
KEYCASE  STM   @14,@12,@SA00044                                    1361 04574000
*  PARMFLD(INDEX2+1) = COMMA;                              /*@0099VLS*/ 04575000
         L     @08,INDEX2                                          1362 04576000
         LA    @04,PARMFLD(@08)                                    1362 04577000
         MVI   0(@04),C','                                         1362 04578000
*  LENGPARM = INDEX2;                       /* SAVE LENGTH OF PARMS  */ 04579000
         ST    @08,LENGPARM                                        1363 04580000
*  PARMFLD(108) = RPAREN;                   /* RPAREN FOR SEARCH     */ 04581000
         MVI   PARMFLD+107,C')'                                    1364 04582000
*  PARMFLD(109) = COMMA;                    /* COMMA FOR SEARCH      */ 04583000
         MVI   PARMFLD+108,C','                                    1365 04584000
*  /*                                                        @0099VLS*/ 04585000
*  /* START THE SEARCH FOR PARAMETERS.  A STRING OF TEN CHARACTERS   */ 04586000
*  /* IS ACCESSED AND USED FOR A CASE MACRO.   THE MACRO WORKS       */ 04587000
*  /* A STRING OF CHARACTERS UP TO THE NEXT COMMA.           @0099VLS*/ 04588000
*  /*                                                        @0099VLS*/ 04589000
*  INDEX1 = 1;                                             /*@0099VLS*/ 04590000
         LA    INDEX1,1                                            1366 04591000
*  DO UNTIL (INDEX1> LENGPARM);                            /*@0099VLS*/ 04592000
@DL01367 DS    0H                                                  1368 04593000
*    KEYWORD = PARMFLD(INDEX1:INDEX1+10);   /* GET KEYWORD   @0099VLS*/ 04594000
         LA    @08,PARMFLD-1(INDEX1)                               1368 04595000
         MVC   KEYWORD(11),0(@08)                                  1368 04596000
*    PARMFLG = OFF;                                        /*@0099VLS*/ 04597000
*    NEXTRPC = ON;                                         /*@0099VLS*/ 04598000
*                                                                  1370 04599000
         OI    NEXTRPC,B'00000100'                                 1370 04600000
         NI    PARMFLG,B'11011111'                                 1370 04601000
*/*EREPCASE (KEYWORD) VALUES('ACC','HIST','MES','MERGE','RDESUM','EVENT 04602000
*,'SHORT','SYSUM','TRENDS','ZERO','DATE=(','DEVSER=(','MOD=(','TERMN=', 04603000
*VOLID=(','TYPE=','PRINT=','SYMCDE=','THRESHOLD=(','TIME=(','TABSIZE=', 04604000
*DEV=(','LIBADR=','ERRORID=(','CPU=(','CPUCUA=(','CUA=(','LINECT=','DEB 04605000
*G=(','USERPGM=')*/                                                1371 04606000
* DCL  I0001   FIXED(15);                                          1371 04607000
*     I0001 = 0;                                                   1372 04608000
         SLR   I0001,I0001                                         1372 04609000
*     IF KEYWORD = 'ACC' THEN                                      1373 04610000
         CLC   KEYWORD(3),@CC00903                                 1373 04611000
         BNE   @RF01373                                            1373 04612000
*          I0001 = 4 ;                                             1374 04613000
         LA    I0001,4                                             1374 04614000
*     IF KEYWORD = 'HIST' THEN                                     1375 04615000
@RF01373 CLC   KEYWORD(4),@CC00904                                 1375 04616000
         BNE   @RF01375                                            1375 04617000
*          I0001 = 8 ;                                             1376 04618000
         LA    I0001,8                                             1376 04619000
*     IF KEYWORD = 'MES' THEN                                      1377 04620000
@RF01375 CLC   KEYWORD(3),@CC00905                                 1377 04621000
         BNE   @RF01377                                            1377 04622000
*          I0001 = 12 ;                                            1378 04623000
         LA    I0001,12                                            1378 04624000
*     IF KEYWORD = 'MERGE' THEN                                    1379 04625000
@RF01377 CLC   KEYWORD(5),@CC00906                                 1379 04626000
         BNE   @RF01379                                            1379 04627000
*          I0001 = 16 ;                                            1380 04628000
         LA    I0001,16                                            1380 04629000
*     IF KEYWORD = 'RDESUM' THEN                                   1381 04630000
@RF01379 CLC   KEYWORD(6),@CC00907                                 1381 04631000
         BNE   @RF01381                                            1381 04632000
*          I0001 = 20 ;                                            1382 04633000
         LA    I0001,20                                            1382 04634000
*     IF KEYWORD = 'EVENT' THEN                                    1383 04635000
@RF01381 CLC   KEYWORD(5),@CC00908                                 1383 04636000
         BNE   @RF01383                                            1383 04637000
*          I0001 = 24 ;                                            1384 04638000
         LA    I0001,24                                            1384 04639000
*     IF KEYWORD = 'SHORT' THEN                                    1385 04640000
@RF01383 CLC   KEYWORD(5),@CC00909                                 1385 04641000
         BNE   @RF01385                                            1385 04642000
*          I0001 = 28 ;                                            1386 04643000
         LA    I0001,28                                            1386 04644000
*     IF KEYWORD = 'SYSUM' THEN                                    1387 04645000
@RF01385 CLC   KEYWORD(5),@CC00911                                 1387 04646000
         BNE   @RF01387                                            1387 04647000
*          I0001 = 32 ;                                            1388 04648000
         LA    I0001,32                                            1388 04649000
*     IF KEYWORD = 'TRENDS' THEN                                   1389 04650000
@RF01387 CLC   KEYWORD(6),@CC00912                                 1389 04651000
         BNE   @RF01389                                            1389 04652000
*          I0001 = 36 ;                                            1390 04653000
         LA    I0001,36                                            1390 04654000
*     IF KEYWORD = 'ZERO' THEN                                     1391 04655000
@RF01389 CLC   KEYWORD(4),@CC00914                                 1391 04656000
         BNE   @RF01391                                            1391 04657000
*          I0001 = 40 ;                                            1392 04658000
         LA    I0001,40                                            1392 04659000
*     IF KEYWORD = 'DATE=(' THEN                                   1393 04660000
@RF01391 CLC   KEYWORD(6),@CC00915                                 1393 04661000
         BNE   @RF01393                                            1393 04662000
*          I0001 = 44 ;                                            1394 04663000
         LA    I0001,44                                            1394 04664000
*     IF KEYWORD = 'DEVSER=(' THEN                                 1395 04665000
@RF01393 CLC   KEYWORD(8),@CC00917                                 1395 04666000
         BNE   @RF01395                                            1395 04667000
*          I0001 = 48 ;                                            1396 04668000
         LA    I0001,48                                            1396 04669000
*     IF KEYWORD = 'MOD=(' THEN                                    1397 04670000
@RF01395 CLC   KEYWORD(5),@CC00918                                 1397 04671000
         BNE   @RF01397                                            1397 04672000
*          I0001 = 52 ;                                            1398 04673000
         LA    I0001,52                                            1398 04674000
*     IF KEYWORD = 'TERMN=' THEN                                   1399 04675000
@RF01397 CLC   KEYWORD(6),@CC00919                                 1399 04676000
         BNE   @RF01399                                            1399 04677000
*          I0001 = 56 ;                                            1400 04678000
         LA    I0001,56                                            1400 04679000
*     IF KEYWORD = 'VOLID=(' THEN                                  1401 04680000
@RF01399 CLC   KEYWORD(7),@CC00921                                 1401 04681000
         BNE   @RF01401                                            1401 04682000
*          I0001 = 60 ;                                            1402 04683000
         LA    I0001,60                                            1402 04684000
*     IF KEYWORD = 'TYPE=' THEN                                    1403 04685000
@RF01401 CLC   KEYWORD(5),@CC00923                                 1403 04686000
         BNE   @RF01403                                            1403 04687000
*          I0001 = 64 ;                                            1404 04688000
         LA    I0001,64                                            1404 04689000
*     IF KEYWORD = 'PRINT=' THEN                                   1405 04690000
@RF01403 CLC   KEYWORD(6),@CC00924                                 1405 04691000
         BNE   @RF01405                                            1405 04692000
*          I0001 = 68 ;                                            1406 04693000
         LA    I0001,68                                            1406 04694000
*     IF KEYWORD = 'SYMCDE=' THEN                                  1407 04695000
@RF01405 CLC   KEYWORD(7),@CC00926                                 1407 04696000
         BNE   @RF01407                                            1407 04697000
*          I0001 = 72 ;                                            1408 04698000
         LA    I0001,72                                            1408 04699000
*     IF KEYWORD = 'THRESHOLD=(' THEN                              1409 04700000
@RF01407 CLC   KEYWORD(11),@CC00928                                1409 04701000
         BNE   @RF01409                                            1409 04702000
*          I0001 = 76 ;                                            1410 04703000
         LA    I0001,76                                            1410 04704000
*     IF KEYWORD = 'TIME=(' THEN                                   1411 04705000
@RF01409 CLC   KEYWORD(6),@CC00931                                 1411 04706000
         BNE   @RF01411                                            1411 04707000
*          I0001 = 80 ;                                            1412 04708000
         LA    I0001,80                                            1412 04709000
*     IF KEYWORD = 'TABSIZE=' THEN                                 1413 04710000
@RF01411 CLC   KEYWORD(8),@CC00932                                 1413 04711000
         BNE   @RF01413                                            1413 04712000
*          I0001 = 84 ;                                            1414 04713000
         LA    I0001,84                                            1414 04714000
*     IF KEYWORD = 'DEV=(' THEN                                    1415 04715000
@RF01413 CLC   KEYWORD(5),@CC00934                                 1415 04716000
         BNE   @RF01415                                            1415 04717000
*          I0001 = 88 ;                                            1416 04718000
         LA    I0001,88                                            1416 04719000
*     IF KEYWORD = 'LIBADR=' THEN                                  1417 04720000
@RF01415 CLC   KEYWORD(7),@CC00936                                 1417 04721000
         BNE   @RF01417                                            1417 04722000
*          I0001 = 92 ;                                            1418 04723000
         LA    I0001,92                                            1418 04724000
*     IF KEYWORD = 'ERRORID=(' THEN                                1419 04725000
@RF01417 CLC   KEYWORD(9),@CC00938                                 1419 04726000
         BNE   @RF01419                                            1419 04727000
*          I0001 = 96 ;                                            1420 04728000
         LA    I0001,96                                            1420 04729000
*     IF KEYWORD = 'CPU=(' THEN                                    1421 04730000
@RF01419 CLC   KEYWORD(5),@CC00941                                 1421 04731000
         BNE   @RF01421                                            1421 04732000
*          I0001 = 100 ;                                           1422 04733000
         LA    I0001,100                                           1422 04734000
*     IF KEYWORD = 'CPUCUA=(' THEN                                 1423 04735000
@RF01421 CLC   KEYWORD(8),@CC00942                                 1423 04736000
         BNE   @RF01423                                            1423 04737000
*          I0001 = 104 ;                                           1424 04738000
         LA    I0001,104                                           1424 04739000
*     IF KEYWORD = 'CUA=(' THEN                                    1425 04740000
@RF01423 CLC   KEYWORD(5),@CC00944                                 1425 04741000
         BNE   @RF01425                                            1425 04742000
*          I0001 = 108 ;                                           1426 04743000
         LA    I0001,108                                           1426 04744000
*     IF KEYWORD = 'LINECT=' THEN                                  1427 04745000
@RF01425 CLC   KEYWORD(7),@CC00945                                 1427 04746000
         BNE   @RF01427                                            1427 04747000
*          I0001 = 112 ;                                           1428 04748000
         LA    I0001,112                                           1428 04749000
*     IF KEYWORD = 'DEBUG=(' THEN                                  1429 04750000
@RF01427 CLC   KEYWORD(7),@CC00947                                 1429 04751000
         BNE   @RF01429                                            1429 04752000
*          I0001 = 116 ;                                           1430 04753000
         LA    I0001,116                                           1430 04754000
*     IF KEYWORD = 'USERPGM=' THEN                                 1431 04755000
@RF01429 CLC   KEYWORD(8),@CC00949                                 1431 04756000
         BNE   @RF01431                                            1431 04757000
*          I0001 = 120 ;                                           1432 04758000
         LA    I0001,120                                           1432 04759000
*     GENERATE;                                                    1433 04760000
@RF01431 DS    0H                                                  1433 04761000
        B    L00010(I0001)                                              04762000
L00010 B    L000131                                                     04763000
        B    L00011                                                     04764000
        B    L00012                                                     04765000
        B    L00013                                                     04766000
        B    L00014                                                     04767000
        B    L00015                                                     04768000
        B    L00016                                                     04769000
        B    L00017                                                     04770000
        B    L00018                                                     04771000
        B    L00019                                                     04772000
        B    L000110                                                    04773000
        B    L000111                                                    04774000
        B    L000112                                                    04775000
        B    L000113                                                    04776000
        B    L000114                                                    04777000
        B    L000115                                                    04778000
        B    L000116                                                    04779000
        B    L000117                                                    04780000
        B    L000118                                                    04781000
        B    L000119                                                    04782000
        B    L000120                                                    04783000
        B    L000121                                                    04784000
        B    L000122                                                    04785000
        B    L000123                                                    04786000
        B    L000124                                                    04787000
        B    L000125                                                    04788000
        B    L000126                                                    04789000
        B    L000127                                                    04790000
        B    L000128                                                    04791000
        B    L000129                                                    04792000
        B    L000130                                                    04793000
*                                                                  1434 04794000
*/*EREPSUB  */                                                     1434 04795000
*L00011:DO;                                             /*@0099VLS*/    04796000
L00011   DS    0H                                                  1435 04797000
*      CALL PARMACC;             /* PARAMETER ACC            @0099VLS*/ 04798000
*                                                                  1435 04799000
         BAL   @14,PARMACC                                         1435 04800000
*/*EREPSEND  */                                                    1436 04801000
*         GO TO L000132;                                           1436 04802000
         B     L000132                                             1436 04803000
*       END;                                            /*@0099VLS*/    04804000
*                                                                  1437 04805000
*/*EREPSUB  */                                                     1438 04806000
*L00012:DO;                                             /*@0099VLS*/    04807000
L00012   DS    0H                                                  1439 04808000
*      CALL PARMHIST;            /* PARAMETER HIST           @0099VLS*/ 04809000
*                                                                  1439 04810000
         BAL   @14,PARMHIST                                        1439 04811000
*/*EREPSEND  */                                                    1440 04812000
*         GO TO L000132;                                           1440 04813000
         B     L000132                                             1440 04814000
*       END;                                            /*@0099VLS*/    04815000
*                                                                  1441 04816000
*/*EREPSUB  */                                                     1442 04817000
*L00013:DO;                                             /*@0099VLS*/    04818000
L00013   DS    0H                                                  1443 04819000
*      CALL PARMES;              /* PARAMETER MES            @0099VLS*/ 04820000
*                                                                  1443 04821000
         BAL   @14,PARMES                                          1443 04822000
*/*EREPSEND  */                                                    1444 04823000
*         GO TO L000132;                                           1444 04824000
         B     L000132                                             1444 04825000
*       END;                                            /*@0099VLS*/    04826000
*                                                                  1445 04827000
*/*EREPSUB  */                                                     1446 04828000
*L00014:DO;                                             /*@0099VLS*/    04829000
L00014   DS    0H                                                  1447 04830000
*      CALL PARMERGE;            /* PARAMETER MERGE          @0099VLS*/ 04831000
*                                                                  1447 04832000
         BAL   @14,PARMERGE                                        1447 04833000
*/*EREPSEND  */                                                    1448 04834000
*         GO TO L000132;                                           1448 04835000
         B     L000132                                             1448 04836000
*       END;                                            /*@0099VLS*/    04837000
*                                                                  1449 04838000
*/*EREPSUB  */                                                     1450 04839000
*L00015:DO;                                             /*@0099VLS*/    04840000
L00015   DS    0H                                                  1451 04841000
*      CALL PARMRDE;             /* PARAMETER RDESUM         @0099VLS*/ 04842000
*                                                                  1451 04843000
         BAL   @14,PARMRDE                                         1451 04844000
*/*EREPSEND  */                                                    1452 04845000
*         GO TO L000132;                                           1452 04846000
         B     L000132                                             1452 04847000
*       END;                                            /*@0099VLS*/    04848000
*                                                                  1453 04849000
*/*EREPSUB  */                                                     1454 04850000
*L00016:DO;                                             /*@0099VLS*/    04851000
L00016   DS    0H                                                  1455 04852000
*      CALL PARMEVEN;            /* PARAMETER EVENT          @0099VLS*/ 04853000
*                                                                  1455 04854000
         BAL   @14,PARMEVEN                                        1455 04855000
*/*EREPSEND  */                                                    1456 04856000
*         GO TO L000132;                                           1456 04857000
         B     L000132                                             1456 04858000
*       END;                                            /*@0099VLS*/    04859000
*                                                                  1457 04860000
*/*EREPSUB  */                                                     1458 04861000
*L00017:DO;                                             /*@0099VLS*/    04862000
L00017   DS    0H                                                  1459 04863000
*      CALL PARMSHOR;            /* PARAMETER SHORT          @0099VLS*/ 04864000
*                                                                  1459 04865000
         BAL   @14,PARMSHOR                                        1459 04866000
*/*EREPSEND  */                                                    1460 04867000
*         GO TO L000132;                                           1460 04868000
         B     L000132                                             1460 04869000
*       END;                                            /*@0099VLS*/    04870000
*                                                                  1461 04871000
*/*EREPSUB  */                                                     1462 04872000
*L00018:DO;                                             /*@0099VLS*/    04873000
L00018   DS    0H                                                  1463 04874000
*      CALL PARMSYSU;            /* PARAMETER SYSUM          @0099VLS*/ 04875000
*                                                                  1463 04876000
         BAL   @14,PARMSYSU                                        1463 04877000
*/*EREPSEND  */                                                    1464 04878000
*         GO TO L000132;                                           1464 04879000
         B     L000132                                             1464 04880000
*       END;                                            /*@0099VLS*/    04881000
*                                                                  1465 04882000
*/*EREPSUB  */                                                     1466 04883000
*L00019:DO;                                             /*@0099VLS*/    04884000
L00019   DS    0H                                                  1467 04885000
*      CALL PARMTREN;            /* PARAMETER TREND          @0099VLS*/ 04886000
*                                                                  1467 04887000
         BAL   @14,PARMTREN                                        1467 04888000
*/*EREPSEND  */                                                    1468 04889000
*         GO TO L000132;                                           1468 04890000
         B     L000132                                             1468 04891000
*       END;                                            /*@0099VLS*/    04892000
*                                                                  1469 04893000
*/*EREPSUB  */                                                     1470 04894000
*L000110:                                                          1470 04895000
*       DO;                                             /*@0099VLS*/    04896000
L000110  DS    0H                                                  1471 04897000
*      CALL PARMZERO;            /* PARAMETER ZERO           @0099VLS*/ 04898000
*                                                                  1471 04899000
         BAL   @14,PARMZERO                                        1471 04900000
*/*EREPSEND  */                                                    1472 04901000
*         GO TO L000132;                                           1472 04902000
         B     L000132                                             1472 04903000
*       END;                                            /*@0099VLS*/    04904000
*                                                                  1473 04905000
*/*EREPSUB  */                                                     1474 04906000
*L000111:                                                          1474 04907000
*       DO;                                             /*@0099VLS*/    04908000
L000111  DS    0H                                                  1475 04909000
*      CALL PARMDATE;            /* PARAMETER DATE           @0099VLS*/ 04910000
*                                                                  1475 04911000
         BAL   @14,PARMDATE                                        1475 04912000
*/*EREPSEND  */                                                    1476 04913000
*         GO TO L000132;                                           1476 04914000
         B     L000132                                             1476 04915000
*       END;                                            /*@0099VLS*/    04916000
*                                                                  1477 04917000
*/*EREPSUB  */                                                     1478 04918000
*L000112:                                                          1478 04919000
*       DO;                                             /*@0099VLS*/    04920000
L000112  DS    0H                                                  1479 04921000
*      CALL PARMDEVS;            /* PARAMETER DEVSER         @0099VLS*/ 04922000
*                                                                  1479 04923000
         BAL   @14,PARMDEVS                                        1479 04924000
*/*EREPSEND  */                                                    1480 04925000
*         GO TO L000132;                                           1480 04926000
         B     L000132                                             1480 04927000
*       END;                                            /*@0099VLS*/    04928000
*                                                                  1481 04929000
*/*EREPSUB  */                                                     1482 04930000
*L000113:                                                          1482 04931000
*       DO;                                             /*@0099VLS*/    04932000
L000113  DS    0H                                                  1483 04933000
*      CALL PARMMOD;             /* PARAMETER MOD            @0099VLS*/ 04934000
*                                                                  1483 04935000
         BAL   @14,PARMMOD                                         1483 04936000
*/*EREPSEND  */                                                    1484 04937000
*         GO TO L000132;                                           1484 04938000
         B     L000132                                             1484 04939000
*       END;                                            /*@0099VLS*/    04940000
*                                                                  1485 04941000
*/*EREPSUB  */                                                     1486 04942000
*L000114:                                                          1486 04943000
*       DO;                                             /*@0099VLS*/    04944000
L000114  DS    0H                                                  1487 04945000
*      CALL PARMTERM;            /* PARAMETER TERMN          @0099VLS*/ 04946000
*                                                                  1487 04947000
         BAL   @14,PARMTERM                                        1487 04948000
*/*EREPSEND  */                                                    1488 04949000
*         GO TO L000132;                                           1488 04950000
         B     L000132                                             1488 04951000
*       END;                                            /*@0099VLS*/    04952000
*                                                                  1489 04953000
*/*EREPSUB  */                                                     1490 04954000
*L000115:                                                          1490 04955000
*       DO;                                             /*@0099VLS*/    04956000
L000115  DS    0H                                                  1491 04957000
*      CALL PARMVOL;             /* PARAMETER VOLID          @0099VLS*/ 04958000
*                                                                  1491 04959000
         BAL   @14,PARMVOL                                         1491 04960000
*/*EREPSEND  */                                                    1492 04961000
*         GO TO L000132;                                           1492 04962000
         B     L000132                                             1492 04963000
*       END;                                            /*@0099VLS*/    04964000
*                                                                  1493 04965000
*/*EREPSUB  */                                                     1494 04966000
*L000116:                                                          1494 04967000
*       DO;                                             /*@0099VLS*/    04968000
L000116  DS    0H                                                  1495 04969000
*      CALL PARMTYPE;            /* PARAMETER TYPE           @0099VLS*/ 04970000
*                                                                  1495 04971000
         BAL   @14,PARMTYPE                                        1495 04972000
*/*EREPSEND  */                                                    1496 04973000
*         GO TO L000132;                                           1496 04974000
         B     L000132                                             1496 04975000
*       END;                                            /*@0099VLS*/    04976000
*                                                                  1497 04977000
*/*EREPSUB  */                                                     1498 04978000
*L000117:                                                          1498 04979000
*       DO;                                             /*@0099VLS*/    04980000
L000117  DS    0H                                                  1499 04981000
*      CALL PARMPRIN;            /* PARAMETER PRINT          @0099VLS*/ 04982000
*                                                                  1499 04983000
         BAL   @14,PARMPRIN                                        1499 04984000
*/*EREPSEND  */                                                    1500 04985000
*         GO TO L000132;                                           1500 04986000
         B     L000132                                             1500 04987000
*       END;                                            /*@0099VLS*/    04988000
*                                                                  1501 04989000
*/*EREPSUB  */                                                     1502 04990000
*L000118:                                                          1502 04991000
*       DO;                                             /*@0099VLS*/    04992000
L000118  DS    0H                                                  1503 04993000
*      CALL PARMSYMC;            /* PARAMETER SYMCDE         @0099VLS*/ 04994000
*                                                                  1503 04995000
         BAL   @14,PARMSYMC                                        1503 04996000
*/*EREPSEND  */                                                    1504 04997000
*         GO TO L000132;                                           1504 04998000
         B     L000132                                             1504 04999000
*       END;                                            /*@0099VLS*/    05000000
*                                                                  1505 05001000
*/*EREPSUB  */                                                     1506 05002000
*L000119:                                                          1506 05003000
*       DO;                                             /*@0099VLS*/    05004000
L000119  DS    0H                                                  1507 05005000
*      CALL PARMTHRE;            /* PARAMETER THRESHOLD      @0099VLS*/ 05006000
*                                                                  1507 05007000
         BAL   @14,PARMTHRE                                        1507 05008000
*/*EREPSEND  */                                                    1508 05009000
*         GO TO L000132;                                           1508 05010000
         B     L000132                                             1508 05011000
*       END;                                            /*@0099VLS*/    05012000
*                                                                  1509 05013000
*/*EREPSUB  */                                                     1510 05014000
*L000120:                                                          1510 05015000
*       DO;                                             /*@0099VLS*/    05016000
L000120  DS    0H                                                  1511 05017000
*      CALL PARMTIME;            /* PARAMETER TIME           @0099VLS*/ 05018000
*                                                                  1511 05019000
         BAL   @14,PARMTIME                                        1511 05020000
*/*EREPSEND  */                                                    1512 05021000
*         GO TO L000132;                                           1512 05022000
         B     L000132                                             1512 05023000
*       END;                                            /*@0099VLS*/    05024000
*                                                                  1513 05025000
*/*EREPSUB  */                                                     1514 05026000
*L000121:                                                          1514 05027000
*       DO;                                             /*@0099VLS*/    05028000
L000121  DS    0H                                                  1515 05029000
*      CALL PARMTABS;            /* PARAMETER TABSIZE        @0099VLS*/ 05030000
*                                                                  1515 05031000
         BAL   @14,PARMTABS                                        1515 05032000
*/*EREPSEND  */                                                    1516 05033000
*         GO TO L000132;                                           1516 05034000
         B     L000132                                             1516 05035000
*       END;                                            /*@0099VLS*/    05036000
*                                                                  1517 05037000
*/*EREPSUB  */                                                     1518 05038000
*L000122:                                                          1518 05039000
*       DO;                                             /*@0099VLS*/    05040000
L000122  DS    0H                                                  1519 05041000
*      CALL PARMDEV;             /* PARAMETER DEV            @0099VLS*/ 05042000
*                                                                  1519 05043000
         BAL   @14,PARMDEV                                         1519 05044000
*/*EREPSEND  */                                                    1520 05045000
*         GO TO L000132;                                           1520 05046000
         B     L000132                                             1520 05047000
*       END;                                            /*@0099VLS*/    05048000
*                                                                  1521 05049000
*/*EREPSUB  */                                                     1522 05050000
*L000123:                                                          1522 05051000
*       DO;                                             /*@0099VLS*/    05052000
L000123  DS    0H                                                  1523 05053000
*      CALL PARMLIBA;            /* PARAMETER LIBADR         @0099VLS*/ 05054000
*                                                                  1523 05055000
         BAL   @14,PARMLIBA                                        1523 05056000
*/*EREPSEND  */                                                    1524 05057000
*         GO TO L000132;                                           1524 05058000
         B     L000132                                             1524 05059000
*       END;                                            /*@0099VLS*/    05060000
*                                                                  1525 05061000
*/*EREPSUB  */                                                     1526 05062000
*L000124:                                                          1526 05063000
*       DO;                                             /*@0099VLS*/    05064000
L000124  DS    0H                                                  1527 05065000
*      CALL PARMERRO;            /* PARAMETER ERRORID        @0099VLS*/ 05066000
*                                                                  1527 05067000
         BAL   @14,PARMERRO                                        1527 05068000
*/*EREPSEND  */                                                    1528 05069000
*         GO TO L000132;                                           1528 05070000
         B     L000132                                             1528 05071000
*       END;                                            /*@0099VLS*/    05072000
*                                                                  1529 05073000
*/*EREPSUB  */                                                     1530 05074000
*L000125:                                                          1530 05075000
*       DO;                                             /*@0099VLS*/    05076000
L000125  DS    0H                                                  1531 05077000
*      CALL PARMCPU;             /* PARAMETER CPU            @0099VLS*/ 05078000
*                                                                  1531 05079000
         BAL   @14,PARMCPU                                         1531 05080000
*/*EREPSEND  */                                                    1532 05081000
*         GO TO L000132;                                           1532 05082000
         B     L000132                                             1532 05083000
*       END;                                            /*@0099VLS*/    05084000
*                                                                  1533 05085000
*/*EREPSUB  */                                                     1534 05086000
*L000126:                                                          1534 05087000
*       DO;                                             /*@0099VLS*/    05088000
L000126  DS    0H                                                  1535 05089000
*      CALL PARMCPUC;            /* PARAMETER CPUCUA         @0099VLS*/ 05090000
*                                                                  1535 05091000
         BAL   @14,PARMCPUC                                        1535 05092000
*/*EREPSEND  */                                                    1536 05093000
*         GO TO L000132;                                           1536 05094000
         B     L000132                                             1536 05095000
*       END;                                            /*@0099VLS*/    05096000
*                                                                  1537 05097000
*/*EREPSUB  */                                                     1538 05098000
*L000127:                                                          1538 05099000
*       DO;                                             /*@0099VLS*/    05100000
L000127  DS    0H                                                  1539 05101000
*      CALL PARMCUA;             /* PARAMETER CUA            @0099VLS*/ 05102000
*                                                                  1539 05103000
         BAL   @14,PARMCUA                                         1539 05104000
*/*EREPSEND  */                                                    1540 05105000
*         GO TO L000132;                                           1540 05106000
         B     L000132                                             1540 05107000
*       END;                                            /*@0099VLS*/    05108000
*                                                                  1541 05109000
*/*EREPSUB  */                                                     1542 05110000
*L000128:                                                          1542 05111000
*       DO;                                             /*@0099VLS*/    05112000
L000128  DS    0H                                                  1543 05113000
*      CALL PARMLINE;            /* PARAMETER LINECT         @0099VLS*/ 05114000
*                                                                  1543 05115000
         BAL   @14,PARMLINE                                        1543 05116000
*/*EREPSEND  */                                                    1544 05117000
*         GO TO L000132;                                           1544 05118000
         B     L000132                                             1544 05119000
*       END;                                            /*@0099VLS*/    05120000
*                                                                  1545 05121000
*/*EREPSUB  */                                                     1546 05122000
*L000129:                                                          1546 05123000
*       DO;                                             /*@0099VLS*/    05124000
L000129  DS    0H                                                  1547 05125000
*      CALL PARMDEBU;            /* PARAMETER DEBUG          @0099VLS*/ 05126000
*                                                                  1547 05127000
         BAL   @14,PARMDEBU                                        1547 05128000
*/*EREPSEND  */                                                    1548 05129000
*         GO TO L000132;                                           1548 05130000
         B     L000132                                             1548 05131000
*       END;                                            /*@0099VLS*/    05132000
*                                                                  1549 05133000
*/*EREPSUB  */                                                     1550 05134000
*L000130:                                                          1550 05135000
*       DO;                                             /*@G51DGVS*/    05136000
L000130  DS    0H                                                  1551 05137000
*      CALL PARMUSER;            /* PARAMETER USERPGM        @G51DGVS*/ 05138000
*                                                                  1551 05139000
         BAL   @14,PARMUSER                                        1551 05140000
*/*EREPSEND  */                                                    1552 05141000
*         GO TO L000132;                                           1552 05142000
         B     L000132                                             1552 05143000
*       END;                                            /*@G51DGVS*/    05144000
*/********************************************************************/ 05145000
*/*                                                          @G51DGVS*/ 05146000
*/*  ALL OTHER PARAMETERS                                    @G51DGVS*/ 05147000
*/*                                                          @G51DGVS*/ 05148000
*/********************************************************************/ 05149000
*                                                                  1554 05150000
*/*EREPSUB  */                                                     1554 05151000
*L000131:                                                          1554 05152000
*       DO;                                             /*@0099VLS*/    05153000
L000131  DS    0H                                                  1555 05154000
*      CALL OUTMSG(SYNTAX);           /* UNRECOGNIZED PARAMETER      */ 05155000
         LA    @01,@AL01555                                        1555 05156000
         BAL   @14,OUTMSG                                          1555 05157000
*      CALL SCANC;                    /* FIND A COMMA DELIMITER      */ 05158000
         BAL   @14,SCANC                                           1556 05159000
*      INDEX1 = INDEX1 + NEXTC;                            /*@0099VLS*/ 05160000
*                                                                  1557 05161000
         AL    INDEX1,NEXTC                                        1557 05162000
*/*EREPSEND  */                                                    1558 05163000
*         GO TO L000132;                                           1558 05164000
         B     L000132                                             1558 05165000
*       END;                                            /*@0099VLS*/    05166000
*                                                                  1560 05167000
*/*EREPCEND  */                                                    1560 05168000
*L000132:;                                               /*@0099VLS*/   05169000
L000132  DS    0H                                                  1561 05170000
*    IF PARMFLD(INDEX1) ^= COMMA THEN   /* NOT A COMMA       @0099VLS*/ 05171000
         LA    @08,PARMFLD-1(INDEX1)                               1561 05172000
         CLI   0(@08),C','                                         1561 05173000
         BE    @RF01561                                            1561 05174000
*      DO;                                                 /*@0099VLS*/ 05175000
*        CALL OUTMSG(SYNTAX);                              /*@0099VLS*/ 05176000
         LA    @01,@AL01563                                        1563 05177000
         BAL   @14,OUTMSG                                          1563 05178000
*        CALL SCANC;                                       /*@0099VLS*/ 05179000
         BAL   @14,SCANC                                           1564 05180000
*        INDEX1 = INDEX1 + NEXTC;                          /*@0099VLS*/ 05181000
         AL    INDEX1,NEXTC                                        1565 05182000
*      END;                                                /*@0099VLS*/ 05183000
*    ELSE                                                          1567 05184000
*      IF INDEX1 = LENGPARM THEN                                   1567 05185000
         B     @RC01561                                            1567 05186000
@RF01561 C     INDEX1,LENGPARM                                     1567 05187000
         BNE   @RF01567                                            1567 05188000
*        CALL OUTMSG(SYNTAX);                              /*@0099VLS*/ 05189000
         LA    @01,@AL01568                                        1568 05190000
         BAL   @14,OUTMSG                                          1568 05191000
*    INDEX1 = INDEX1 + 1;                                  /*@0099VLS*/ 05192000
@RF01567 DS    0H                                                  1569 05193000
@RC01561 AL    INDEX1,@CF00055                                     1569 05194000
*  END;                                                    /*@0099VLS*/ 05195000
@DE01367 C     INDEX1,LENGPARM                                     1570 05196000
         BNH   @DL01367                                            1570 05197000
*END;                                                      /*@0099VLS*/ 05198000
@EL00044 DS    0H                                                  1571 05199000
@EF00044 DS    0H                                                  1571 05200000
@ER00044 LM    @14,@12,@SA00044                                    1571 05201000
         BR    @14                                                 1571 05202000
@PB00044 DS    0H                                                  1572 05203000
*/********************************************************************/ 05204000
*/*                                                          @Z427VLS*/ 05205000
*/*  STRIP INPUT PARM OF ALL QUOTES AND PUT A COMMA AT END   @Z427VLS*/ 05206000
*/*                                                          @Z427VLS*/ 05207000
*/********************************************************************/ 05208000
*RESPECIFY (R1,R3) RESTRICTED;                             /*@G51DGVS*/ 05209000
*PLOGREC = ON;                                             /*@Z427VLS*/ 05210000
         OI    PLOGREC(R2),B'00000010'                             1573 05211000
*OTOURIST = OFF;                                           /*@Z427VLS*/ 05212000
*OSERLOG = ON;                                             /*@Z427VLS*/ 05213000
*OACCDEV = ON;                                /* DEFAULT OF ACC=Y    */ 05214000
         OI    OSERLOG(R2),B'00101000'                             1576 05215000
         NI    OTOURIST(R2),B'01111111'                            1576 05216000
* INDEX2 = R1;                                             /*@0001VLS*/ 05217000
         ST    R1,INDEX2                                           1577 05218000
*RESPECIFY (R3) UNRESTRICTED;                              /*@G51DGVS*/ 05219000
*GENERATE;                                                 /*@Z427VLS*/ 05220000
         TIME  DEC                            GET TIME                  05221000
         STCM  R1,X'7',YYDDD                  STORE IN VARIABLE         05222000
*UNPK (HOLDAREA,YYDDD);                       /* CHANGE TO CHARACTERS*/ 05223000
         UNPK  HOLDAREA(5),YYDDD(3)                                1580 05224000
*DAYNOW = HOLDAREA(3:5);                      /* SAVE DAY    @Z427VLS*/ 05225000
         MVC   DAYNOW(3,R2),HOLDAREA+2                             1581 05226000
*YEARNOW = HOLDAREA(1:2);                     /* SAVE YEAR   @Z427VLS*/ 05227000
         MVC   YEARNOW(2,R2),HOLDAREA                              1582 05228000
*HEADYR = DATENOW;                            /* MOVE TO HEADING     */ 05229000
         MVC   HEADYR(6),DATENOW(R2)                               1583 05230000
*PRINTADR = ADDR(HEADING);                    /* ADDRESS OF HEADING  */ 05231000
         LA    @08,HEADING                                         1584 05232000
         ST    @08,PRINTADR(,R2)                                   1584 05233000
*CALL IOHND(RITEPRTR);                        /* PRINT HEADING       */ 05234000
         L     @15,ADIOHND(,R2)                                    1585 05235000
         LA    @01,@AL01585                                        1585 05236000
         BALR  @14,@15                                             1585 05237000
*PRINTADR = ADDR(HEADING);                    /* AND A BLANK LINE    */ 05238000
         LA    @08,HEADING                                         1586 05239000
         ST    @08,PRINTADR(,R2)                                   1586 05240000
*CALL IOHND(RITEPRTR);                        /* PRINT IT    @Z427VLS*/ 05241000
         L     @15,ADIOHND(,R2)                                    1587 05242000
         LA    @01,@AL01587                                        1587 05243000
         BALR  @14,@15                                             1587 05244000
*R1 = INDEX2;                                 /* RESTORE PTR TO PARMS*/ 05245000
         L     R1,INDEX2                                           1588 05246000
*IF PARMLEN ^= ZERO THEN                      /* ANY PARMS   @Z427VLS*/ 05247000
         SLR   @08,@08                                             1589 05248000
         L     @04,PARMPTR(,R1)                                    1589 05249000
         CH    @08,PARMLEN(,@04)                                   1589 05250000
         BE    @RF01589                                            1589 05251000
*    DO;                                                   /*@Z427VLS*/ 05252000
*      /*                                                    @Z427VLS*/ 05253000
*      /* COPY THE INPUT PARM STRING TO A HOLD AREA, EXCLUDING ALL   */ 05254000
*      /* QUOTE MARKS. THIS AREA WILL BE USED FOR THE SCAN.  A COMMA */ 05255000
*      /* IS PLACED AT THE END OF THE AREA FOR SCAN TERMINATION.     */ 05256000
*      /*                                                    @Z427VLS*/ 05257000
*      INDEX2 = ZERO;                                      /*@Z427VLS*/ 05258000
         ST    @08,INDEX2                                          1591 05259000
*      DO INDEX1 = 1 TO PARMLEN BY 1;                      /*@Z427VLS*/ 05260000
         LA    INDEX1,1                                            1592 05261000
         B     @DE01592                                            1592 05262000
@DL01592 DS    0H                                                  1593 05263000
*         IF JCLPARM(INDEX1) ^= QUOTE THEN                         1593 05264000
         L     @08,PARMPTR(,R1)                                    1593 05265000
         LR    @04,@08                                             1593 05266000
         ALR   @04,INDEX1                                          1593 05267000
         CLI   JCLPARM-1(@04),C''''                                1593 05268000
         BE    @RF01593                                            1593 05269000
*            DO;                                           /*@Z427VLS*/ 05270000
*              INDEX2 = INDEX2 + 1;                        /*@Z427VLS*/ 05271000
         LA    @04,1                                               1595 05272000
         AL    @04,INDEX2                                          1595 05273000
         ST    @04,INDEX2                                          1595 05274000
*              PARMFLD(INDEX2) = JCLPARM(INDEX1);          /*@Z427VLS*/ 05275000
         LA    @03,PARMFLD-1(@04)                                  1596 05276000
         ALR   @08,INDEX1                                          1596 05277000
         MVC   0(1,@03),JCLPARM-1(@08)                             1596 05278000
*            END;                                          /*@Z427VLS*/ 05279000
*      END;                                                /*@Z427VLS*/ 05280000
@RF01593 AL    INDEX1,@CF00055                                     1598 05281000
@DE01592 L     @08,PARMPTR(,R1)                                    1598 05282000
         CH    INDEX1,PARMLEN(,@08)                                1598 05283000
         BNH   @DL01592                                            1598 05284000
*      PARMPRT(1:INDEX2) = PARMFLD(1:INDEX2);  /* COPY FOR OUTPUTTING*/ 05285000
         L     @08,INDEX2                                          1599 05286000
         BCTR  @08,0                                               1599 05287000
         EX    @08,@SM01063                                        1599 05288000
*      PRINTADR = ADDR(PARMPT);                            /*@Z427VLS*/ 05289000
         LA    @08,PARMPT                                          1600 05290000
         ST    @08,PRINTADR(,R2)                                   1600 05291000
*      CALL IOHND(RITEPRTR);                   /* OUTPUT INPUT PARMS */ 05292000
         L     @15,ADIOHND(,R2)                                    1601 05293000
         LA    @01,@AL01601                                        1601 05294000
         BALR  @14,@15                                             1601 05295000
*      RESPECIFY (R1) UNRESTRICTED;                        /*@0099VLS*/ 05296000
*      IF INDEX2 = FOUR & PARMFLD(1:4) = 'CARD' THEN               1603 05297000
         CLC   INDEX2(4),@CF00064                                  1603 05298000
         BNE   @RF01603                                            1603 05299000
         CLC   PARMFLD(4),@CC01016                                 1603 05300000
         BNE   @RF01603                                            1603 05301000
*        DO;                                               /*@0099VLS*/ 05302000
*          /*                                                @0099VLS*/ 05303000
*          /* INPUT IS TO BE READ FROM CARDS                 @0099VLS*/ 05304000
*          /*                                                @0099VLS*/ 05305000
*          HOLDAREA(1:2) = OPENIO;                         /*@0099VLS*/ 05306000
         MVC   HOLDAREA(2),OPENIO(R2)                              1605 05307000
*          OPENIO = OPENIO && OPENIO;                      /*@0099VLS*/ 05308000
         XC    OPENIO(2,R2),OPENIO(R2)                             1606 05309000
*          OSYSIN = ON;                       /* OPEN SYSIN DATA SET */ 05310000
         OI    OSYSIN(R2),B'00000100'                              1607 05311000
*          RESPECIFY (R15) RESTRICTED;                     /*@0099VLS*/ 05312000
*          CALL IOHND (IOOPEN);                            /*@0099VLS*/ 05313000
         L     @15,ADIOHND(,R2)                                    1609 05314000
         LA    @01,@AL01609                                        1609 05315000
         BALR  @14,@15                                             1609 05316000
*          J = R15;                                        /*@0099VLS*/ 05317000
         LR    J,R15                                               1610 05318000
*          RESPECIFY (R15) UNRESTRICTED;                   /*@0099VLS*/ 05319000
*          OPENIO = HOLDAREA(1:2);                         /*@0099VLS*/ 05320000
         MVC   OPENIO(2,R2),HOLDAREA                               1612 05321000
*          OSYSIN = OFF;                                   /*@0099VLS*/ 05322000
         NI    OSYSIN(R2),B'11111011'                              1613 05323000
*          IF J = ZERO THEN                   /* GOOD OPEN   @0099VLS*/ 05324000
         LTR   J,J                                                 1614 05325000
         BNZ   @RF01614                                            1614 05326000
*            DO;                                           /*@0099VLS*/ 05327000
*              CARDOPEN = ON;                 /* INDICATE FOR PARM2  */ 05328000
         OI    CARDOPEN,B'00010000'                                1616 05329000
*              CARDEOF = OFF;                              /*@0099VLS*/ 05330000
         NI    CARDEOF,B'11111110'                                 1617 05331000
*              DO WHILE (CARDEOF = OFF);      /* READ UNTIL NO PARMS */ 05332000
         B     @DE01618                                            1618 05333000
@DL01618 DS    0H                                                  1619 05334000
*                RESPECIFY (R15) RESTRICTED;               /*@0099VLS*/ 05335000
*                CALL IOHND (READCARD);                    /*@0099VLS*/ 05336000
         L     @15,ADIOHND(,R2)                                    1620 05337000
         LA    @01,@AL01620                                        1620 05338000
         BALR  @14,@15                                             1620 05339000
*                J = R15;                                  /*@0099VLS*/ 05340000
         LR    J,R15                                               1621 05341000
*                RESPECIFY (R15) UNRESTRICTED;             /*@0099VLS*/ 05342000
*                IF J ^= ZERO THEN                                 1623 05343000
         LTR   J,J                                                 1623 05344000
         BZ    @RF01623                                            1623 05345000
*                  DO;                                     /*@0099VLS*/ 05346000
*                    CARDEOF = ON;            /* TERMINATE PROCESSING*/ 05347000
         OI    CARDEOF,B'00000001'                                 1625 05348000
*                    CARDCLOS = ON;                        /*@0099VLS*/ 05349000
         OI    CARDCLOS,B'00001000'                                1626 05350000
*                  END;                                    /*@0099VLS*/ 05351000
*                ELSE                                              1628 05352000
*                  IF CARD(1:7) = 'ENDPARM' THEN                   1628 05353000
         B     @RC01623                                            1628 05354000
@RF01623 CLC   CARD(7,R7),@CC01017                                 1628 05355000
         BNE   @RF01628                                            1628 05356000
*                    CARDEOF = ON;            /* END OF PARMS        */ 05357000
         OI    CARDEOF,B'00000001'                                 1629 05358000
*                  ELSE                                            1630 05359000
*                    IF CARD(1) ^= STAR THEN                       1630 05360000
         B     @RC01628                                            1630 05361000
@RF01628 CLI   CARD(R7),C'*'                                       1630 05362000
         BE    @RF01630                                            1630 05363000
*                      DO;                    /* NON-COMMENT CARD    */ 05364000
*                        FOUND = OFF;                      /*@0099VLS*/ 05365000
         NI    FOUND,B'11101111'                                   1632 05366000
*                        DO INDEX1 = 1 TO 72 BY 1 WHILE(FOUND = OFF);   05367000
         LA    INDEX1,1                                            1633 05368000
@DL01633 TM    FOUND,B'00010000'                                   1633 05369000
         BNZ   @DC01633                                            1633 05370000
*                          IF CARD(INDEX1) ^= BLANK THEN           1634 05371000
         LR    @08,R7                                              1634 05372000
         ALR   @08,INDEX1                                          1634 05373000
         BCTR  @08,0                                               1634 05374000
         CLI   CARD(@08),C' '                                      1634 05375000
         BE    @RF01634                                            1634 05376000
*                            FOUND = ON;      /* FIRST NON-BLANK     */ 05377000
         OI    FOUND,B'00010000'                                   1635 05378000
*                        END;                              /*@0099VLS*/ 05379000
@RF01634 AL    INDEX1,@CF00055                                     1636 05380000
         C     INDEX1,@CF00927                                     1636 05381000
         BNH   @DL01633                                            1636 05382000
@DC01633 DS    0H                                                  1637 05383000
*                        PARMFLD(1) = BLANK;  /* CLEAR ENTIRE FIELD  */ 05384000
         MVI   PARMFLD,C' '                                        1637 05385000
*                        PARMFLD(2:110) = PARMFLD(1:109);  /*@0099VLS*/ 05386000
         MVC   @TS00001(109),PARMFLD                               1638 05387000
         MVC   PARMFLD+1(109),@TS00001                             1638 05388000
*                        INDEX2 = ZERO;                    /*@0099VLS*/ 05389000
         SLR   @08,@08                                             1639 05390000
         ST    @08,INDEX2                                          1639 05391000
*                        DO J = INDEX1-1 BY 1 TO 72;       /*@0099VLS*/ 05392000
         LR    J,INDEX1                                            1640 05393000
         BCTR  J,0                                                 1640 05394000
         B     @DE01640                                            1640 05395000
@DL01640 DS    0H                                                  1641 05396000
*                          IF CARD(J) ^= QUOTE THEN                1641 05397000
         LR    @08,R7                                              1641 05398000
         ALR   @08,J                                               1641 05399000
         BCTR  @08,0                                               1641 05400000
         CLI   CARD(@08),C''''                                     1641 05401000
         BE    @RF01641                                            1641 05402000
*                            DO;                           /*@0099VLS*/ 05403000
*                              INDEX2 = INDEX2 + 1;        /*@0099VLS*/ 05404000
         LA    @08,1                                               1643 05405000
         AL    @08,INDEX2                                          1643 05406000
         ST    @08,INDEX2                                          1643 05407000
*                              PARMFLD(INDEX2) = CARD(J);  /*@0099VLS*/ 05408000
         LA    @06,PARMFLD-1(@08)                                  1644 05409000
         LR    @08,R7                                              1644 05410000
         ALR   @08,J                                               1644 05411000
         BCTR  @08,0                                               1644 05412000
         MVC   0(1,@06),CARD(@08)                                  1644 05413000
*                            END;                          /*@0099VLS*/ 05414000
*                        END;                              /*@0099VLS*/ 05415000
@RF01641 AL    J,@CF00055                                          1646 05416000
@DE01640 C     J,@CF00927                                          1646 05417000
         BNH   @DL01640                                            1646 05418000
*                        FOUND = OFF;                      /*@0099VLS*/ 05419000
         NI    FOUND,B'11101111'                                   1647 05420000
*                        DO J = 72 BY -1 TO 1 WHILE(FOUND = OFF);  1648 05421000
         LA    J,72                                                1648 05422000
@DL01648 TM    FOUND,B'00010000'                                   1648 05423000
         BNZ   @DC01648                                            1648 05424000
*                          IF PARMFLD(J) ^= BLANK THEN             1649 05425000
         LA    @08,PARMFLD-1(J)                                    1649 05426000
         CLI   0(@08),C' '                                         1649 05427000
         BE    @RF01649                                            1649 05428000
*                            DO INDEX2 = J;                /*@0099VLS*/ 05429000
         LR    @08,J                                               1650 05430000
         ST    @08,INDEX2                                          1650 05431000
*                              FOUND = ON;                 /*@0099VLS*/ 05432000
         OI    FOUND,B'00010000'                                   1651 05433000
*                            END;                          /*@0099VLS*/ 05434000
*                        END;                              /*@0099VLS*/ 05435000
@RF01649 BCTR  J,0                                                 1653 05436000
         LTR   J,J                                                 1653 05437000
         BP    @DL01648                                            1653 05438000
@DC01648 DS    0H                                                  1654 05439000
*                        PARMPRT(1:INDEX2) = PARMFLD(1:INDEX2);    1654 05440000
         L     @08,INDEX2                                          1654 05441000
         BCTR  @08,0                                               1654 05442000
         EX    @08,@SM01063                                        1654 05443000
*                        PRINTADR = ADDR(PARMPT);          /*@0099VLS*/ 05444000
         LA    @08,PARMPT                                          1655 05445000
         ST    @08,PRINTADR(,R2)                                   1655 05446000
*                        CALL IOHND(RITEPRTR);             /*@0099VLS*/ 05447000
         L     @15,ADIOHND(,R2)                                    1656 05448000
         LA    @01,@AL01656                                        1656 05449000
         BALR  @14,@15                                             1656 05450000
*                        CALL KEYCASE;      /* PROCESS PARMS @0099VLS*/ 05451000
         BAL   @14,KEYCASE                                         1657 05452000
*                      END;                                /*@0099VLS*/ 05453000
*                    ELSE                                          1659 05454000
*                      DO;                                 /*@0099VLS*/ 05455000
         B     @RC01630                                            1659 05456000
@RF01630 DS    0H                                                  1660 05457000
*                        PARMPRT (1:80) = CARD;            /*@0099VLS*/ 05458000
         MVC   PARMPRT(80),CARD(R7)                                1660 05459000
*                        PRINTADR = ADDR(PARMPT);          /*@0099VLS*/ 05460000
         LA    @08,PARMPT                                          1661 05461000
         ST    @08,PRINTADR(,R2)                                   1661 05462000
*                        CALL IOHND(RITEPRTR);             /*@0099VLS*/ 05463000
         L     @15,ADIOHND(,R2)                                    1662 05464000
         LA    @01,@AL01662                                        1662 05465000
         BALR  @14,@15                                             1662 05466000
*                      END;                                /*@0099VLS*/ 05467000
*              END;                                        /*@0099VLS*/ 05468000
@RC01630 DS    0H                                                  1664 05469000
@RC01628 DS    0H                                                  1664 05470000
@RC01623 DS    0H                                                  1664 05471000
@DE01618 TM    CARDEOF,B'00000001'                                 1664 05472000
         BZ    @DL01618                                            1664 05473000
*            END;                                          /*@0099VLS*/ 05474000
*        END;                                              /*@0099VLS*/ 05475000
*      ELSE                                                        1667 05476000
*        CALL KEYCASE;                        /* USE THE PARMFLD     */ 05477000
         B     @RC01603                                            1667 05478000
@RF01603 BAL   @14,KEYCASE                                         1667 05479000
*    END;                                /* END LOOP FOR PARAMETERS  */ 05480000
@RC01603 DS    0H                                                  1669 05481000
*/*                                                          @Z427VLS*/ 05482000
*/* IF NO ERRORS, CALL THE SECOND PART OF THE PARM ANALYSIS ROUTINE. */ 05483000
*/* OTHERWISE, EXIT.                                         @Z427VLS*/ 05484000
*/*                                                          @Z427VLS*/ 05485000
*    RESPECIFY (R15) RESTRICTED;                           /*@Z427VLS*/ 05486000
@RF01589 DS    0H                                                  1670 05487000
*    IF DEBUG4 = ON THEN        /*PRINT THE NAME AND COMPILE DATE    */ 05488000
         TM    DEBUG4(R2),B'00001000'                              1670 05489000
         BNO   @RF01670                                            1670 05490000
*     DO;                                                  /*@Z427VLS*/ 05491000
*      R15 = R9 - 27;                                      /*@Z427VLS*/ 05492000
         LR    R15,R9                                              1672 05493000
         SL    R15,@CF00596                                        1672 05494000
*      GEN(MVC  MSGNO(16),0(R15));                         /*@Z427VLS*/ 05495000
         MVC  MSGNO(16),0(R15)                                          05496000
*      R15 = ADDR(IFCPARM2);                               /*@Z427VLS*/ 05497000
         L     R15,@CV00620                                        1674 05498000
*      GEN(MVC  MSGNO+20(16),5(R15));                      /*@Z427VLS*/ 05499000
         MVC  MSGNO+20(16),5(R15)                                       05500000
*      R15 = ADDR(IFCDEVIC);                               /*@G51DGVS*/ 05501000
         L     R15,@CV00621                                        1676 05502000
*       GEN(MVC  MSGNO+40(16),5(R15));                     /*@G51DGVS*/ 05503000
         MVC  MSGNO+40(16),5(R15)                                       05504000
*      PRINTADR = ADDR(PARMPT);                            /*@Z427VLS*/ 05505000
         LA    @14,PARMPT                                          1678 05506000
         ST    @14,PRINTADR(,R2)                                   1678 05507000
*      CALL IOHND(RITEPRTR);                               /*@Z427VLS*/ 05508000
         L     @15,ADIOHND(,R2)                                    1679 05509000
         LA    @01,@AL01679                                        1679 05510000
         BALR  @14,@15                                             1679 05511000
*     END;                                                 /*@Z427VLS*/ 05512000
*    IF RETCODE = ZERO THEN                                        1681 05513000
@RF01670 L     @14,RETCODE                                         1681 05514000
         LTR   @14,@14                                             1681 05515000
         BNZ   @RF01681                                            1681 05516000
*      DO;                                                 /*@Z427VLS*/ 05517000
*        CALL IFCPARM2(IPSWES);                            /*@Z427VLS*/ 05518000
         L     @15,@CV00620                                        1683 05519000
         LA    @01,@AL01683                                        1683 05520000
         BALR  @14,@15                                             1683 05521000
*        RETCODE = R15;         /* RETURN CODE FROM IFCPARM2 @Z427VLS*/ 05522000
         ST    R15,RETCODE                                         1684 05523000
*      END;                                                /*@Z427VLS*/ 05524000
*    IF DEBUG31 = ON THEN       /* DEBUG 31 MEANS TO TERMINATE ALWAYS*/ 05525000
@RF01681 TM    DEBUG31(R2),B'00000001'                             1686 05526000
         BNO   @RF01686                                            1686 05527000
*      RETCODE = TWELVE;                                   /*@Z427VLS*/ 05528000
         MVC   RETCODE(4),@CF00036                                 1687 05529000
*    R15 = RETCODE;             /* SET THE RETURN CODE       @Z427VLS*/ 05530000
@RF01686 L     R15,RETCODE                                         1688 05531000
*    RETURN;                                               /*@Z427VLS*/ 05532000
@EL00001 L     @13,4(,@13)                                         1689 05533000
@EF00001 DS    0H                                                  1689 05534000
@ER00001 L     @14,12(,@13)                                        1689 05535000
         LM    @00,@12,20(@13)                                     1689 05536000
         BR    @14                                                 1689 05537000
*    RESPECIFY (R15) UNRESTRICTED;                         /*@Z427VLS*/ 05538000
* END                                                      /*@Z427VLS*/ 05539000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 05540000
*/*%INCLUDE SYSLIB  (COMTABLE)                                        * 05541000
*;                                                                 1691 05542000
@DATA    DS    0H                                                       05543000
@CH00033 DC    H'9'                                                     05544000
@SM01051 MVC   TERM(0,R2),0(@04)                                        05545000
@SM01054 MVC   VOLVAL-2(0,@04),0(@03)                                   05546000
@SM01056 MVC   HOLDAREA(0),0(@04)                                       05547000
@SM01058 MVC   RDTHRSH-1(0,@08),HOLDAREA                                05548000
@SM01060 MVC   WRTHRSH-1(0,@08),HOLDAREA                                05549000
@SM01063 MVC   PARMPRT(0),PARMFLD                                       05550000
         DS    0F                                                       05551000
@AL00099 EQU   *                       LIST WITH   1 ARGUMENT(S)        05552000
@AL00144 EQU   *                       LIST WITH   1 ARGUMENT(S)        05553000
@AL00164 EQU   *                       LIST WITH   1 ARGUMENT(S)        05554000
@AL00188 EQU   *                       LIST WITH   1 ARGUMENT(S)        05555000
@AL00210 EQU   *                       LIST WITH   1 ARGUMENT(S)        05556000
@AL00545 EQU   *                       LIST WITH   1 ARGUMENT(S)        05557000
@AL00584 EQU   *                       LIST WITH   1 ARGUMENT(S)        05558000
@AL00704 EQU   *                       LIST WITH   1 ARGUMENT(S)        05559000
@AL00728 EQU   *                       LIST WITH   1 ARGUMENT(S)        05560000
@AL01015 EQU   *                       LIST WITH   1 ARGUMENT(S)        05561000
@AL01016 EQU   *                       LIST WITH   1 ARGUMENT(S)        05562000
@AL01045 EQU   *                       LIST WITH   1 ARGUMENT(S)        05563000
@AL01057 EQU   *                       LIST WITH   1 ARGUMENT(S)        05564000
@AL01069 EQU   *                       LIST WITH   1 ARGUMENT(S)        05565000
@AL01148 EQU   *                       LIST WITH   1 ARGUMENT(S)        05566000
@AL01241 EQU   *                       LIST WITH   1 ARGUMENT(S)        05567000
@AL01273 EQU   *                       LIST WITH   1 ARGUMENT(S)        05568000
@AL01342 DC    A(@CF00074)             LIST WITH   1 ARGUMENT(S)        05569000
@AL00114 DC    A(@CF00699)             LIST WITH   2 ARGUMENT(S)        05570000
         DC    A(@AFTEMPS)                                              05571000
@AL00116 DC    A(@CF00701)             LIST WITH   2 ARGUMENT(S)        05572000
         DC    A(@AFTEMPS)                                              05573000
@AL00119 EQU   *                       LIST WITH   1 ARGUMENT(S)        05574000
@AL01585 EQU   *                       LIST WITH   1 ARGUMENT(S)        05575000
@AL01587 EQU   *                       LIST WITH   1 ARGUMENT(S)        05576000
@AL01601 EQU   *                       LIST WITH   1 ARGUMENT(S)        05577000
@AL01656 EQU   *                       LIST WITH   1 ARGUMENT(S)        05578000
@AL01662 EQU   *                       LIST WITH   1 ARGUMENT(S)        05579000
@AL01679 DC    A(@CF00074+2)           LIST WITH   1 ARGUMENT(S)        05580000
@AL00131 EQU   *                       LIST WITH   3 ARGUMENT(S)        05581000
@AL00276 EQU   *                       LIST WITH   1 ARGUMENT(S)        05582000
@AL00390 EQU   *                       LIST WITH   1 ARGUMENT(S)        05583000
@AL00422 EQU   *                       LIST WITH   1 ARGUMENT(S)        05584000
@AL00432 EQU   *                       LIST WITH   1 ARGUMENT(S)        05585000
@AL00442 EQU   *                       LIST WITH   1 ARGUMENT(S)        05586000
@AL01007 DC    A(@CF00079)             LIST WITH   1 ARGUMENT(S)        05587000
         DC    A(@CF00055)                                              05588000
         DC    A(HOLDAREA)                                              05589000
@AL00151 DC    A(@CF00032)             LIST WITH   3 ARGUMENT(S)        05590000
@AL00277 EQU   *                       LIST WITH   1 ARGUMENT(S)        05591000
@AL00326 EQU   *                       LIST WITH   1 ARGUMENT(S)        05592000
@AL00364 EQU   *                       LIST WITH   1 ARGUMENT(S)        05593000
@AL00462 EQU   *                       LIST WITH   1 ARGUMENT(S)        05594000
@AL00799 EQU   *                       LIST WITH   1 ARGUMENT(S)        05595000
@AL00808 EQU   *                       LIST WITH   1 ARGUMENT(S)        05596000
@AL00858 EQU   *                       LIST WITH   1 ARGUMENT(S)        05597000
@AL00859 EQU   *                       LIST WITH   1 ARGUMENT(S)        05598000
@AL00880 EQU   *                       LIST WITH   1 ARGUMENT(S)        05599000
@AL00881 EQU   *                       LIST WITH   1 ARGUMENT(S)        05600000
@AL00984 EQU   *                       LIST WITH   1 ARGUMENT(S)        05601000
@AL00985 EQU   *                       LIST WITH   1 ARGUMENT(S)        05602000
@AL01032 EQU   *                       LIST WITH   1 ARGUMENT(S)        05603000
@AL01033 EQU   *                       LIST WITH   1 ARGUMENT(S)        05604000
@AL01214 EQU   *                       LIST WITH   1 ARGUMENT(S)        05605000
@AL01231 EQU   *                       LIST WITH   1 ARGUMENT(S)        05606000
@AL01250 EQU   *                       LIST WITH   1 ARGUMENT(S)        05607000
@AL01251 EQU   *                       LIST WITH   1 ARGUMENT(S)        05608000
@AL01261 EQU   *                       LIST WITH   1 ARGUMENT(S)        05609000
@AL01262 DC    A(@CF00064)             LIST WITH   1 ARGUMENT(S)        05610000
         DC    A(HOLDAREA)                                              05611000
@AL00174 EQU   *                       LIST WITH   3 ARGUMENT(S)        05612000
@AL00138 EQU   *                       LIST WITH   1 ARGUMENT(S)        05613000
@AL00158 EQU   *                       LIST WITH   1 ARGUMENT(S)        05614000
@AL00181 EQU   *                       LIST WITH   1 ARGUMENT(S)        05615000
@AL00203 EQU   *                       LIST WITH   1 ARGUMENT(S)        05616000
@AL00216 EQU   *                       LIST WITH   1 ARGUMENT(S)        05617000
@AL00233 EQU   *                       LIST WITH   1 ARGUMENT(S)        05618000
@AL00251 EQU   *                       LIST WITH   1 ARGUMENT(S)        05619000
@AL00284 EQU   *                       LIST WITH   1 ARGUMENT(S)        05620000
@AL00312 EQU   *                       LIST WITH   1 ARGUMENT(S)        05621000
@AL00332 EQU   *                       LIST WITH   1 ARGUMENT(S)        05622000
@AL00338 EQU   *                       LIST WITH   1 ARGUMENT(S)        05623000
@AL00413 EQU   *                       LIST WITH   1 ARGUMENT(S)        05624000
@AL00490 EQU   *                       LIST WITH   1 ARGUMENT(S)        05625000
@AL00494 EQU   *                       LIST WITH   1 ARGUMENT(S)        05626000
@AL00502 EQU   *                       LIST WITH   1 ARGUMENT(S)        05627000
@AL00532 EQU   *                       LIST WITH   1 ARGUMENT(S)        05628000
@AL00534 EQU   *                       LIST WITH   1 ARGUMENT(S)        05629000
@AL00537 EQU   *                       LIST WITH   1 ARGUMENT(S)        05630000
@AL00582 EQU   *                       LIST WITH   1 ARGUMENT(S)        05631000
@AL00592 EQU   *                       LIST WITH   1 ARGUMENT(S)        05632000
@AL00606 EQU   *                       LIST WITH   1 ARGUMENT(S)        05633000
@AL00615 EQU   *                       LIST WITH   1 ARGUMENT(S)        05634000
@AL00633 EQU   *                       LIST WITH   1 ARGUMENT(S)        05635000
@AL00640 EQU   *                       LIST WITH   1 ARGUMENT(S)        05636000
@AL00663 EQU   *                       LIST WITH   1 ARGUMENT(S)        05637000
@AL00667 EQU   *                       LIST WITH   1 ARGUMENT(S)        05638000
@AL00685 EQU   *                       LIST WITH   1 ARGUMENT(S)        05639000
@AL00692 EQU   *                       LIST WITH   1 ARGUMENT(S)        05640000
@AL00723 EQU   *                       LIST WITH   1 ARGUMENT(S)        05641000
@AL00734 EQU   *                       LIST WITH   1 ARGUMENT(S)        05642000
@AL00763 EQU   *                       LIST WITH   1 ARGUMENT(S)        05643000
@AL00765 EQU   *                       LIST WITH   1 ARGUMENT(S)        05644000
@AL00795 EQU   *                       LIST WITH   1 ARGUMENT(S)        05645000
@AL00798 EQU   *                       LIST WITH   1 ARGUMENT(S)        05646000
@AL00812 EQU   *                       LIST WITH   1 ARGUMENT(S)        05647000
@AL00826 EQU   *                       LIST WITH   1 ARGUMENT(S)        05648000
@AL00837 EQU   *                       LIST WITH   1 ARGUMENT(S)        05649000
@AL00862 EQU   *                       LIST WITH   1 ARGUMENT(S)        05650000
@AL00866 EQU   *                       LIST WITH   1 ARGUMENT(S)        05651000
@AL00872 EQU   *                       LIST WITH   1 ARGUMENT(S)        05652000
@AL00884 EQU   *                       LIST WITH   1 ARGUMENT(S)        05653000
@AL00888 EQU   *                       LIST WITH   1 ARGUMENT(S)        05654000
@AL00895 EQU   *                       LIST WITH   1 ARGUMENT(S)        05655000
@AL00923 EQU   *                       LIST WITH   1 ARGUMENT(S)        05656000
@AL00925 EQU   *                       LIST WITH   1 ARGUMENT(S)        05657000
@AL00949 EQU   *                       LIST WITH   1 ARGUMENT(S)        05658000
@AL00957 EQU   *                       LIST WITH   1 ARGUMENT(S)        05659000
@AL00962 EQU   *                       LIST WITH   1 ARGUMENT(S)        05660000
@AL00990 EQU   *                       LIST WITH   1 ARGUMENT(S)        05661000
@AL01020 EQU   *                       LIST WITH   1 ARGUMENT(S)        05662000
@AL01024 EQU   *                       LIST WITH   1 ARGUMENT(S)        05663000
@AL01037 EQU   *                       LIST WITH   1 ARGUMENT(S)        05664000
@AL01048 EQU   *                       LIST WITH   1 ARGUMENT(S)        05665000
@AL01050 EQU   *                       LIST WITH   1 ARGUMENT(S)        05666000
@AL01060 EQU   *                       LIST WITH   1 ARGUMENT(S)        05667000
@AL01062 EQU   *                       LIST WITH   1 ARGUMENT(S)        05668000
@AL01072 EQU   *                       LIST WITH   1 ARGUMENT(S)        05669000
@AL01074 EQU   *                       LIST WITH   1 ARGUMENT(S)        05670000
@AL01081 EQU   *                       LIST WITH   1 ARGUMENT(S)        05671000
@AL01084 EQU   *                       LIST WITH   1 ARGUMENT(S)        05672000
@AL01086 EQU   *                       LIST WITH   1 ARGUMENT(S)        05673000
@AL01089 EQU   *                       LIST WITH   1 ARGUMENT(S)        05674000
@AL01118 EQU   *                       LIST WITH   1 ARGUMENT(S)        05675000
@AL01132 EQU   *                       LIST WITH   1 ARGUMENT(S)        05676000
@AL01135 EQU   *                       LIST WITH   1 ARGUMENT(S)        05677000
@AL01139 EQU   *                       LIST WITH   1 ARGUMENT(S)        05678000
@AL01206 EQU   *                       LIST WITH   1 ARGUMENT(S)        05679000
@AL01212 EQU   *                       LIST WITH   1 ARGUMENT(S)        05680000
@AL01219 EQU   *                       LIST WITH   1 ARGUMENT(S)        05681000
@AL01229 EQU   *                       LIST WITH   1 ARGUMENT(S)        05682000
@AL01255 EQU   *                       LIST WITH   1 ARGUMENT(S)        05683000
@AL01278 EQU   *                       LIST WITH   1 ARGUMENT(S)        05684000
@AL01282 EQU   *                       LIST WITH   1 ARGUMENT(S)        05685000
@AL01287 EQU   *                       LIST WITH   1 ARGUMENT(S)        05686000
@AL01312 EQU   *                       LIST WITH   1 ARGUMENT(S)        05687000
@AL01315 EQU   *                       LIST WITH   1 ARGUMENT(S)        05688000
@AL01337 EQU   *                       LIST WITH   1 ARGUMENT(S)        05689000
@AL01555 EQU   *                       LIST WITH   1 ARGUMENT(S)        05690000
@AL01563 EQU   *                       LIST WITH   1 ARGUMENT(S)        05691000
@AL01568 DC    A(@CF00055)             LIST WITH   1 ARGUMENT(S)        05692000
@AL00323 EQU   *                       LIST WITH   1 ARGUMENT(S)        05693000
@AL00407 EQU   *                       LIST WITH   1 ARGUMENT(S)        05694000
@AL00452 EQU   *                       LIST WITH   1 ARGUMENT(S)        05695000
@AL00525 EQU   *                       LIST WITH   1 ARGUMENT(S)        05696000
@AL01112 EQU   *                       LIST WITH   1 ARGUMENT(S)        05697000
@AL01113 DC    A(@CF00081)             LIST WITH   1 ARGUMENT(S)        05698000
         DC    A(HOLDAREA)                                              05699000
@AL00196 DC    A(@CF00035)             LIST WITH   3 ARGUMENT(S)        05700000
@AL00328 DC    A(@CF00034)             LIST WITH   1 ARGUMENT(S)        05701000
         DC    A(HOLDAREA)                                              05702000
@AL00351 EQU   *                       LIST WITH   1 ARGUMENT(S)        05703000
@AL00380 DC    A(@CF00076)             LIST WITH   1 ARGUMENT(S)        05704000
@AL00829 EQU   *                       LIST WITH   1 ARGUMENT(S)        05705000
@AL00840 EQU   *                       LIST WITH   1 ARGUMENT(S)        05706000
@AL01303 DC    A(NEXTC)                LIST WITH   1 ARGUMENT(S)        05707000
@AL00914 DC    A(@AFTEMPS+4)           LIST WITH   1 ARGUMENT(S)        05708000
@AL01609 DC    A(@CF00055+2)           LIST WITH   1 ARGUMENT(S)        05709000
@AL01620 DC    A(@CH00033)             LIST WITH   1 ARGUMENT(S)        05710000
@AL01683 DC    A(IPSWES)               LIST WITH   1 ARGUMENT(S)        05711000
         DS    0F                                                       05712000
@SA00001 DS    18F                                                      05713000
@SA00002 DS    2F                                                       05714000
@SA00003 DS    15F                                                      05715000
@PC00003 DS    1F                                                       05716000
@SA00004 DS    2F                                                       05717000
@SA00005 DS    15F                                                      05718000
@PC00005 DS    1F                                                       05719000
@SA00006 DS    15F                                                      05720000
@PC00006 DS    1F                                                       05721000
@SA00010 DS    2F                                                       05722000
@PC00011 DS    1F                                                       05723000
@SA00012 DS    2F                                                       05724000
@PC00012 DS    1F                                                       05725000
@SA00013 DS    2F                                                       05726000
@SA00014 DS    2F                                                       05727000
@SA00015 DS    2F                                                       05728000
@SA00016 DS    2F                                                       05729000
@SA00017 DS    2F                                                       05730000
@SA00018 DS    2F                                                       05731000
@SA00019 DS    2F                                                       05732000
@SA00020 DS    2F                                                       05733000
@SA00021 DS    2F                                                       05734000
@SA00022 DS    2F                                                       05735000
@SA00023 DS    2F                                                       05736000
@SA00024 DS    2F                                                       05737000
@SA00025 DS    2F                                                       05738000
@SA00026 DS    2F                                                       05739000
@SA00027 DS    2F                                                       05740000
@SA00028 DS    2F                                                       05741000
@SA00029 DS    2F                                                       05742000
@SA00030 DS    2F                                                       05743000
@SA00031 DS    2F                                                       05744000
@SA00032 DS    2F                                                       05745000
@SA00033 DS    2F                                                       05746000
@SA00034 DS    2F                                                       05747000
@SA00035 DS    2F                                                       05748000
@SA00036 DS    2F                                                       05749000
@SA00037 DS    2F                                                       05750000
@SA00038 DS    2F                                                       05751000
@SA00039 DS    2F                                                       05752000
@SA00040 DS    2F                                                       05753000
@SA00041 DS    2F                                                       05754000
@SA00042 DS    2F                                                       05755000
@SA00043 DS    2F                                                       05756000
@SA00044 DS    15F                                                      05757000
@AL00001 DS    3A                                                       05758000
@TF00001 DS    F                                                        05759000
@AFTEMPS DS    2F                                                       05760000
         DS    0F                                                       05761000
@CF00055 DC    F'1'                                                     05762000
@CH00055 EQU   @CF00055+2                                               05763000
@CF00074 DC    F'2'                                                     05764000
@CF00076 DC    F'3'                                                     05765000
@CF00064 DC    F'4'                                                     05766000
@CF00079 DC    F'5'                                                     05767000
@CH00079 EQU   @CF00079+2                                               05768000
@CF00081 DC    F'6'                                                     05769000
@CH00081 EQU   @CF00081+2                                               05770000
@CF00083 DC    F'7'                                                     05771000
@CH00083 EQU   @CF00083+2                                               05772000
@CF00066 DC    F'8'                                                     05773000
@CF00034 DC    F'10'                                                    05774000
@CH00034 EQU   @CF00034+2                                               05775000
@CF00035 DC    F'11'                                                    05776000
@CH00035 EQU   @CF00035+2                                               05777000
@CF00036 DC    F'12'                                                    05778000
@CF00032 DC    F'15'                                                    05779000
@CF00227 DC    F'24'                                                    05780000
@CF00596 DC    F'27'                                                    05781000
@CF00586 DC    F'32'                                                    05782000
@CF00812 DC    F'38'                                                    05783000
@CF00807 DC    F'40'                                                    05784000
@CF00532 DC    F'41'                                                    05785000
@CF00293 DC    F'50'                                                    05786000
@CH00293 EQU   @CF00293+2                                               05787000
@CF00895 DC    F'64'                                                    05788000
@CF00699 DC    F'65'                                                    05789000
@CF00701 DC    F'66'                                                    05790000
@CF00927 DC    F'72'                                                    05791000
@CF00422 DC    F'100'                                                   05792000
@CF00802 DC    F'65535'                                                 05793000
@CF01041 DC    F'-5'                                                    05794000
@CF01053 DC    F'-4'                                                    05795000
@CF01062 DC    F'-3'                                                    05796000
@CF00880 DC    F'-2'                                                    05797000
@CF00714 DC    F'-1'                                                    05798000
@CF00894 DC    XL4'80000000'                                            05799000
@CV00620 DC    V(IFCPARM2)                                              05800000
@CV00621 DC    V(IFCDEVIC)                                              05801000
         DS    0D                                                       05802000
LENGPARM DC    F'0'                                                     05803000
RETCODE  DC    F'0'                                                     05804000
INDEX3   DS    F                                                        05805000
PLACE    DC    F'0'                                                     05806000
INDEX2   DS    F                                                        05807000
NEXTC    DS    F                                                        05808000
@TS00001 DS    CL109                                                    05809000
@CC00928 DC    C'THRESHOLD=('                                           05810000
@CC00938 DC    C'ERRORID=('                                             05811000
@CC00834 DC    C'IFCSYMCD'                                              05812000
@CC00917 DC    C'DEVSER=('                                              05813000
@CC00932 DC    C'TABSIZE='                                              05814000
@CC00942 DC    C'CPUCUA=('                                              05815000
@CC00949 DC    C'USERPGM='                                              05816000
@CC00921 DC    C'VOLID=('                                               05817000
@CC00926 DC    C'SYMCDE='                                               05818000
@CC00936 DC    C'LIBADR='                                               05819000
@CC00945 DC    C'LINECT='                                               05820000
@CC00947 DC    C'DEBUG=('                                               05821000
@CC01017 DC    C'ENDPARM'                                               05822000
@CC00907 DC    C'RDESUM'                                                05823000
@CC00912 DC    C'TRENDS'                                                05824000
@CC00915 DC    C'DATE=('                                                05825000
@CC00919 DC    C'TERMN='                                                05826000
@CC00924 DC    C'PRINT='                                                05827000
@CC00931 DC    C'TIME=('                                                05828000
@CC00906 DC    C'MERGE'                                                 05829000
@CC00908 DC    C'EVENT'                                                 05830000
@CC00909 DC    C'SHORT'                                                 05831000
@CC00911 DC    C'SYSUM'                                                 05832000
@CC00918 DC    C'MOD=('                                                 05833000
@CC00923 DC    C'TYPE='                                                 05834000
@CC00934 DC    C'DEV=('                                                 05835000
@CC00941 DC    C'CPU=('                                                 05836000
@CC00944 DC    C'CUA=('                                                 05837000
@CC00904 DC    C'HIST'                                                  05838000
@CC00914 DC    C'ZERO'                                                  05839000
@CC01016 DC    C'CARD'                                                  05840000
@CC00903 DC    C'ACC'                                                   05841000
@CC00905 DC    C'MES'                                                   05842000
@CC00655 DC    C'=Y'                                                    05843000
@CC00657 DC    C'=N'                                                    05844000
@CC00706 DC    C'XX'                                                    05845000
@CC00826 DC    C'PT'                                                    05846000
@CC00827 DC    C'PS'                                                    05847000
@CC00828 DC    C'SU'                                                    05848000
@CC00829 DC    C'NO'                                                    05849000
@CB00198 DC    X'8000'                                                  05850000
@CB00208 DC    X'0000'                                                  05851000
@CB00737 DC    X'366F'                                                  05852000
@CB00738 DC    X'000F'                                                  05853000
@CB00844 DC    X'2400'                                                  05854000
IPSWES   DC    X'00000000'                                              05855000
         ORG   IPSWES                                                   05856000
TYPEFLG  DS    BL1                                                      05857000
THRSHFLG EQU   IPSWES+0                                                 05858000
TIMEFLG  EQU   IPSWES+0                                                 05859000
TABFLG   EQU   IPSWES+0                                                 05860000
PRINTFLG EQU   IPSWES+0                                                 05861000
SYMFLG   EQU   IPSWES+0                                                 05862000
LINEFLG  EQU   IPSWES+0                                                 05863000
ERRORFLG EQU   IPSWES+0                                                 05864000
CPUFLG   DS    BL1                                                      05865000
CPUCUFLG EQU   IPSWES+1                                                 05866000
VOLFLG   EQU   IPSWES+1                                                 05867000
ACCFLG   EQU   IPSWES+1                                                 05868000
TERMFLG  EQU   IPSWES+1                                                 05869000
MODFLG   EQU   IPSWES+1                                                 05870000
LIBFLG   EQU   IPSWES+1                                                 05871000
SERFLG   EQU   IPSWES+1                                                 05872000
HISTFLG  DS    BL1                                                      05873000
MESFLG   EQU   IPSWES+2                                                 05874000
MERGEFLG EQU   IPSWES+2                                                 05875000
RDEFLG   EQU   IPSWES+2                                                 05876000
DEVFLG   EQU   IPSWES+2                                                 05877000
CUAFLG   EQU   IPSWES+2                                                 05878000
EVENTFLG EQU   IPSWES+2                                                 05879000
SHORTFLG EQU   IPSWES+2                                                 05880000
SYSUMFLG DS    BL1                                                      05881000
TRENDFLG EQU   IPSWES+3                                                 05882000
ZEROFLG  EQU   IPSWES+3                                                 05883000
CARDOPEN EQU   IPSWES+3                                                 05884000
CARDCLOS EQU   IPSWES+3                                                 05885000
DATEFLG  EQU   IPSWES+3                                                 05886000
USERFLG  EQU   IPSWES+3                                                 05887000
         ORG   IPSWES+4                                                 05888000
PARMPT   DS    CL134                                                    05889000
         ORG   PARMPT                                                   05890000
@NM00012 DC    CL2'11'                                                  05891000
MSGNO    DC    CL32'INPUT PARAMETER STRING'                             05892000
PARMPRT  DC    CL100' '                                                 05893000
         ORG   PARMPT+134                                               05894000
HEADING  DS    CL134                                                    05895000
         ORG   HEADING                                                  05896000
@NM00013 DC    CL2'1 '                                                  05897000
@NM00014 DC    CL52' '                                                  05898000
@NM00015 DC    CL27'EREP INFORMATIONAL MESSAGES'                        05899000
@NM00016 DC    CL21' '                                                  05900000
@NM00017 DC    CL7'DATE - '                                             05901000
HEADYR   DS    CL6                                                      05902000
@NM00018 DC    CL19' '                                                  05903000
         ORG   HEADING+134                                              05904000
PARMFLD  DC    CL110' '                                                 05905000
HOLDAREA DS    CL5                                                      05906000
         DS    CL7                                                      05907000
KEYWORD  DS    CL11                                                     05908000
SWES     DC    X'0000'                                                  05909000
         ORG   SWES                                                     05910000
VALID    DS    BL1                                                      05911000
MRGEFLG  EQU   SWES+0                                                   05912000
PARMFLG  EQU   SWES+0                                                   05913000
FOUND    EQU   SWES+0                                                   05914000
DEVINCL  EQU   SWES+0                                                   05915000
NEXTRPC  EQU   SWES+0                                                   05916000
AVALIDEV EQU   SWES+0                                                   05917000
CARDEOF  EQU   SWES+0                                                   05918000
RPORC    DS    BL1                                                      05919000
         ORG   SWES+2                                                   05920000
CUAS     DS    CL512                                                    05921000
         ORG   CUAS                                                     05922000
@NM00019 DC    512X'00'                                                 05923000
         ORG   CUAS+512                                                 05924000
SWITCHON DS    BL2                                                      05925000
YYDDD    DS    CL3                                                      05926000
         ORG   YYDDD                                                    05927000
YY       DS    CL1                                                      05928000
DDDS     DS    CL2                                                      05929000
         ORG   DDDS                                                     05930000
DD       DS    CL1                                                      05931000
DS       DS    CL1                                                      05932000
         ORG   YYDDD+3                                                  05933000
SYMHOLD  DS    CL4                                                      05934000
BLDLIST  DS    CL18                                                     05935000
         ORG   BLDLIST                                                  05936000
@NM00020 DC    H'1'                                                     05937000
@NM00021 DC    H'14'                                                    05938000
@NM00022 DC    CL8'IFCRDESM'                                            05939000
@NM00023 DC    6X'00'                                                   05940000
         ORG   BLDLIST+18                                               05941000
SUPERZAP DC    3CL10'SUPERZAP'                                          05942000
CPUTABLE DS    CL6                                                      05943000
         ORG   CPUTABLE+0                                               05944000
CPUEBDIC DC    CL4'0115'                                                05945000
CPUNO    DC    X'0115'                                                  05946000
         ORG   CPUTABLE+6                                               05947000
         ORG   CPUTABLE+6                                               05948000
         DC    CL4'0125'                                                05949000
         DC    X'0125'                                                  05950000
         ORG   CPUTABLE+12                                              05951000
         ORG   CPUTABLE+12                                              05952000
         DC    CL4'0135'                                                05953000
         DC    X'0135'                                                  05954000
         ORG   CPUTABLE+18                                              05955000
         ORG   CPUTABLE+18                                              05956000
         DC    CL4'0138'                                                05957000
         DC    X'0138'                                                  05958000
         ORG   CPUTABLE+24                                              05959000
         ORG   CPUTABLE+24                                              05960000
         DC    CL4'0145'                                                05961000
         DC    X'0145'                                                  05962000
         ORG   CPUTABLE+30                                              05963000
         ORG   CPUTABLE+30                                              05964000
         DC    CL4'0148'                                                05965000
         DC    X'0148'                                                  05966000
         ORG   CPUTABLE+36                                              05967000
         ORG   CPUTABLE+36                                              05968000
         DC    CL4'0155'                                                05969000
         DC    X'0155'                                                  05970000
         ORG   CPUTABLE+42                                              05971000
         ORG   CPUTABLE+42                                              05972000
         DC    CL4'0158'                                                05973000
         DC    X'0158'                                                  05974000
         ORG   CPUTABLE+48                                              05975000
         ORG   CPUTABLE+48                                              05976000
         DC    CL4'0165'                                                05977000
         DC    X'0165'                                                  05978000
         ORG   CPUTABLE+54                                              05979000
         ORG   CPUTABLE+54                                              05980000
         DC    CL4'0168'                                                05981000
         DC    X'0168'                                                  05982000
         ORG   CPUTABLE+60                                              05983000
         ORG   CPUTABLE+60                                              05984000
         DC    CL4'3031'                                                05985000
         DC    X'3031'                                                  05986000
         ORG   CPUTABLE+66                                              05987000
         ORG   CPUTABLE+66                                              05988000
         DC    CL4'3032'                                                05989000
         DC    X'3032'                                                  05990000
         ORG   CPUTABLE+72                                              05991000
         ORG   CPUTABLE+72                                              05992000
         DC    CL4'3033'                                                05993000
         DC    X'3033'                                                  05994000
         ORG   CPUTABLE+78                                              05995000
         ORG   CPUTABLE+78                                              05996000
         DC    CL4'3062'                                                05997000
         DC    X'3062'                                                  05998000
         ORG   CPUTABLE+84                                              05999000
TYPETAB  DC    CL1'M'                                                   06000000
         DC    CL1'C'                                                   06001000
         DC    CL1'O'                                                   06002000
         DC    CL1'S'                                                   06003000
         DC    CL1'I'                                                   06004000
         DC    CL1'D'                                                   06005000
         DC    CL1'H'                                                   06006000
         DC    CL1'E'                                                   06007000
         DC    CL1'T'                                                   06008000
NUMTAB   DC    CL1'0'                                                   06009000
         DC    CL1'1'                                                   06010000
         DC    CL1'2'                                                   06011000
         DC    CL1'3'                                                   06012000
         DC    CL1'4'                                                   06013000
         DC    CL1'5'                                                   06014000
         DC    CL1'6'                                                   06015000
         DC    CL1'7'                                                   06016000
         DC    CL1'8'                                                   06017000
         DC    CL1'9'                                                   06018000
         DC    CL1'A'                                                   06019000
         DC    CL1'B'                                                   06020000
         DC    CL1'C'                                                   06021000
         DC    CL1'D'                                                   06022000
         DC    CL1'E'                                                   06023000
         DC    CL1'F'                                                   06024000
         DC    CL1'X'                                                   06025000
HEXTAB   DC    X'00'                                                    06026000
         DC    X'01'                                                    06027000
         DC    X'02'                                                    06028000
         DC    X'03'                                                    06029000
         DC    X'04'                                                    06030000
         DC    X'05'                                                    06031000
         DC    X'06'                                                    06032000
         DC    X'07'                                                    06033000
         DC    X'08'                                                    06034000
         DC    X'09'                                                    06035000
         DC    X'0A'                                                    06036000
         DC    X'0B'                                                    06037000
         DC    X'0C'                                                    06038000
         DC    X'0D'                                                    06039000
         DC    X'0E'                                                    06040000
         DC    X'0F'                                                    06041000
         DC    X'00'                                                    06042000
TABLE    DC    CL1'0'                                                   06043000
         DC    CL1'1'                                                   06044000
         DC    CL1'2'                                                   06045000
         DC    CL1'3'                                                   06046000
         DC    CL1'4'                                                   06047000
         DC    CL1'5'                                                   06048000
         DC    CL1'6'                                                   06049000
         DC    CL1'7'                                                   06050000
         DC    CL1'8'                                                   06051000
         DC    CL1'9'                                                   06052000
         DC    CL1'A'                                                   06053000
         DC    CL1'B'                                                   06054000
         DC    CL1'C'                                                   06055000
         DC    CL1'D'                                                   06056000
         DC    CL1'E'                                                   06057000
         DC    CL1'F'                                                   06058000
         DC    CL1'G'                                                   06059000
         DC    CL1'H'                                                   06060000
         DC    CL1'I'                                                   06061000
         DC    CL1'J'                                                   06062000
         DC    CL1'K'                                                   06063000
         DC    CL1'L'                                                   06064000
         DC    CL1'M'                                                   06065000
         DC    CL1'N'                                                   06066000
         DC    CL1'O'                                                   06067000
         DC    CL1'P'                                                   06068000
         DC    CL1'Q'                                                   06069000
         DC    CL1'R'                                                   06070000
         DC    CL1'S'                                                   06071000
         DC    CL1'T'                                                   06072000
         DC    CL1'U'                                                   06073000
         DC    CL1'V'                                                   06074000
         DC    CL1'W'                                                   06075000
         DC    CL1'X'                                                   06076000
         DC    CL1'Y'                                                   06077000
         DC    CL1'Z'                                                   06078000
         DC    CL1'#'                                                   06079000
         DC    CL1'@'                                                   06080000
         DC    CL1'$'                                                   06081000
         DC    CL1' '                                                   06082000
         DC    CL1'-'                                                   06083000
         DS    CL2                                                      06084000
PATCH    DC    20F'0'                                                   06085000
IFCPARM1 CSECT                                                          06086000
         DC    S(SUPERZAP)                                              06087000
IFCPARM1 CSECT                                                          06088000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       06089000
@01      EQU   01                                                       06090000
@02      EQU   02                                                       06091000
@03      EQU   03                                                       06092000
@04      EQU   04                                                       06093000
@05      EQU   05                                                       06094000
@06      EQU   06                                                       06095000
@07      EQU   07                                                       06096000
@08      EQU   08                                                       06097000
@09      EQU   09                                                       06098000
@10      EQU   10                                                       06099000
@11      EQU   11                                                       06100000
@12      EQU   12                                                       06101000
@13      EQU   13                                                       06102000
@14      EQU   14                                                       06103000
@15      EQU   15                                                       06104000
I0001    EQU   @04                                                      06105000
J        EQU   @04                                                      06106000
I        EQU   @06                                                      06107000
R1       EQU   @01                                                      06108000
R2       EQU   @02                                                      06109000
R3       EQU   @03                                                      06110000
R7       EQU   @07                                                      06111000
R9       EQU   @09                                                      06112000
R15      EQU   @15                                                      06113000
INDEX1   EQU   @05                                                      06114000
R0       EQU   @00                                                      06115000
R10      EQU   @10                                                      06116000
R11      EQU   @11                                                      06117000
R12      EQU   @12                                                      06118000
R13      EQU   @13                                                      06119000
R14      EQU   @14                                                      06120000
R4       EQU   @04                                                      06121000
R5       EQU   @05                                                      06122000
R6       EQU   @06                                                      06123000
R8       EQU   @08                                                      06124000
IOHND    EQU   0                                                        06125000
IFCMSG   EQU   0                                                        06126000
PARM     EQU   0                                                        06127000
RECTYPE  EQU   PARM                                                     06128000
PMCH     EQU   RECTYPE                                                  06129000
PCHAN    EQU   RECTYPE                                                  06130000
PMCHFRAM EQU   RECTYPE+1                                                06131000
PCCHFRAM EQU   RECTYPE+1                                                06132000
SWITCHES EQU   PARM+2                                                   06133000
RDESUM   EQU   SWITCHES                                                 06134000
PARMMES  EQU   SWITCHES                                                 06135000
SHORTOBR EQU   SWITCHES                                                 06136000
TREND    EQU   SWITCHES                                                 06137000
PARMTHR  EQU   SWITCHES                                                 06138000
SYSUM    EQU   SWITCHES                                                 06139000
TIMESEQ  EQU   SWITCHES                                                 06140000
ZEROALL  EQU   SWITCHES+1                                               06141000
DEVEXCL  EQU   SWITCHES+1                                               06142000
SHIFT3RD EQU   SWITCHES+1                                               06143000
DEBUG    EQU   PARM+4                                                   06144000
DEBUG4   EQU   DEBUG                                                    06145000
DEBUG31  EQU   DEBUG+3                                                  06146000
DEBUGA   EQU   PARM+8                                                   06147000
MISC     EQU   PARM+12                                                  06148000
PACC     EQU   MISC                                                     06149000
PHIST    EQU   MISC                                                     06150000
PRINTES  EQU   MISC                                                     06151000
PEDIT    EQU   PRINTES                                                  06152000
PSUM     EQU   PRINTES                                                  06153000
ERRORID  EQU   MISC                                                     06154000
PLOGREC  EQU   MISC                                                     06155000
OPENCLSE EQU   PARM+13                                                  06156000
OPENIO   EQU   OPENCLSE                                                 06157000
OTOURIST EQU   OPENIO                                                   06158000
OSERLOG  EQU   OPENIO                                                   06159000
OACCIN   EQU   OPENIO                                                   06160000
OACCDEV  EQU   OPENIO                                                   06161000
OSYSIN   EQU   OPENIO                                                   06162000
ODRCTWRK EQU   OPENIO                                                   06163000
CLOSEIO  EQU   OPENCLSE+2                                               06164000
DATENOW  EQU   PARM+17                                                  06165000
DAYNOW   EQU   DATENOW                                                  06166000
YEARNOW  EQU   DATENOW+4                                                06167000
STDT     EQU   PARM+23                                                  06168000
STDATE   EQU   STDT                                                     06169000
PSTD     EQU   STDATE+1                                                 06170000
ENDDT    EQU   PARM+31                                                  06171000
ENDDATE  EQU   ENDDT                                                    06172000
PEND     EQU   ENDDATE+1                                                06173000
STTIME1  EQU   PARM+39                                                  06174000
ENDTIME1 EQU   PARM+43                                                  06175000
STTIME2  EQU   PARM+47                                                  06176000
ENDTIME2 EQU   PARM+51                                                  06177000
STRTDATE EQU   PARM+55                                                  06178000
TERM     EQU   PARM+58                                                  06179000
RDTHRSH  EQU   PARM+66                                                  06180000
WRTHRSH  EQU   PARM+69                                                  06181000
@NM00007 EQU   PARM+75                                                  06182000
TABSIZE  EQU   PARM+80                                                  06183000
ERRID    EQU   PARM+92                                                  06184000
IDVALUE  EQU   ERRID                                                    06185000
IDCPU    EQU   ERRID+3                                                  06186000
IDASID   EQU   ERRID+4                                                  06187000
IDTIMEA  EQU   ERRID+6                                                  06188000
IDTIME   EQU   IDTIMEA                                                  06189000
IDHOUR   EQU   IDTIME                                                   06190000
IDMIN    EQU   IDTIME+1                                                 06191000
IDSEC    EQU   IDTIME+2                                                 06192000
IDTSEC   EQU   IDTIME+3                                                 06193000
USERPGM  EQU   PARM+102                                                 06194000
CCHHRLNG EQU   PARM+112                                                 06195000
LINECT   EQU   PARM+120                                                 06196000
ADIOHND  EQU   PARM+124                                                 06197000
ADIFCMSG EQU   PARM+128                                                 06198000
ADEDITB  EQU   PARM+132                                                 06199000
EVPTR    EQU   PARM+136                                                 06200000
SORTADR  EQU   PARM+140                                                 06201000
PRINTADR EQU   PARM+148                                                 06202000
CUAPTR   EQU   PARM+152                                                 06203000
DEVPTR   EQU   PARM+156                                                 06204000
MODPTR   EQU   PARM+160                                                 06205000
SERPTR   EQU   PARM+164                                                 06206000
VOLPTR   EQU   PARM+168                                                 06207000
CPUPTR   EQU   PARM+172                                                 06208000
CPCUAPTR EQU   PARM+176                                                 06209000
LIBADPTR EQU   PARM+180                                                 06210000
SYMCDPTR EQU   PARM+184                                                 06211000
SYSUMPTR EQU   PARM+188                                                 06212000
TRENPTR  EQU   PARM+192                                                 06213000
SHAREPTR EQU   PARM+196                                                 06214000
MERDCPTR EQU   PARM+208                                                 06215000
DUMPTABL EQU   PARM+228                                                 06216000
DUMPINFO EQU   DUMPTABL+4                                               06217000
TRENDONE EQU   0                                                        06218000
TREGEN   EQU   TRENDONE+8                                               06219000
TRECCH0  EQU   TREGEN+8                                                 06220000
TREND2   EQU   0                                                        06221000
TRENDKEY EQU   TREND2                                                   06222000
TRENDRT  EQU   TRENDKEY+1                                               06223000
TRENCPUS EQU   TRENDKEY+3                                               06224000
TRENDITM EQU   TRENDKEY+4                                               06225000
EVTABLE  EQU   0                                                        06226000
EVSTOP   EQU   EVTABLE                                                  06227000
EVKEY    EQU   EVTABLE+6                                                06228000
SORTABLE EQU   0                                                        06229000
SORTKEY  EQU   SORTABLE                                                 06230000
SORTCCHR EQU   SORTABLE+5                                               06231000
SYSUMONE EQU   0                                                        06232000
SYSUM2   EQU   0                                                        06233000
SYSUMKEY EQU   SYSUM2                                                   06234000
SYSRT    EQU   SYSUMKEY+1                                               06235000
SYSCPUS  EQU   SYSUMKEY+3                                               06236000
SYSITEM  EQU   SYSUMKEY+4                                               06237000
SHARE    EQU   0                                                        06238000
SHAREIO  EQU   SHARE+2                                                  06239000
SHRCUCPU EQU   SHAREIO                                                  06240000
SHARECUA EQU   SHRCUCPU                                                 06241000
EDITLOAD EQU   0                                                        06242000
EDITABLE EQU   EDITLOAD+4                                               06243000
CUA      EQU   0                                                        06244000
CUANUM   EQU   CUA                                                      06245000
CUAVAL   EQU   CUA+2                                                    06246000
CUA1     EQU   CUAVAL                                                   06247000
CUA2     EQU   CUAVAL+2                                                 06248000
DEVICE   EQU   0                                                        06249000
DEVNUM   EQU   DEVICE                                                   06250000
DEVVAL   EQU   DEVICE+2                                                 06251000
MDRNUM   EQU   DEVICE+202                                               06252000
MDRVAL   EQU   DEVICE+204                                               06253000
MODELS   EQU   0                                                        06254000
MODNUM   EQU   MODELS                                                   06255000
MODVAL   EQU   MODELS+2                                                 06256000
DEVSERAL EQU   0                                                        06257000
SERNUM   EQU   DEVSERAL                                                 06258000
SERVAL   EQU   DEVSERAL+2                                               06259000
VOLUME   EQU   0                                                        06260000
VOLNUM   EQU   VOLUME                                                   06261000
VOLVAL   EQU   VOLUME+2                                                 06262000
CPUS     EQU   0                                                        06263000
CPUNUM   EQU   CPUS                                                     06264000
CPUVAL   EQU   CPUS+2                                                   06265000
CPUCUAS  EQU   0                                                        06266000
CPCUANUM EQU   CPUCUAS                                                  06267000
CPUCUAV  EQU   CPUCUAS+2                                                06268000
CPUCUX1  EQU   CPUCUAV                                                  06269000
CPUCUX2  EQU   CPUCUAV+3                                                06270000
CPUCUX3  EQU   CPUCUAV+5                                                06271000
LIBADR   EQU   0                                                        06272000
LIBADNUM EQU   LIBADR                                                   06273000
LIBVAL   EQU   LIBADR+2                                                 06274000
SYMCODE  EQU   0                                                        06275000
SYMCDNUM EQU   SYMCODE                                                  06276000
SYMVAL   EQU   SYMCODE+2                                                06277000
SYMVAL1  EQU   SYMVAL                                                   06278000
SYMVAL2  EQU   SYMVAL+2                                                 06279000
MERIDIAN EQU   0                                                        06280000
PARMPTR  EQU   0                                                        06281000
PARAMS   EQU   0                                                        06282000
PARMLEN  EQU   PARAMS                                                   06283000
JCLPARM  EQU   PARAMS+2                                                 06284000
CARD     EQU   0                                                        06285000
ERROR    EQU   0                                                        06286000
LENGTHH  EQU   0                                                        06287000
LENGTHV  EQU   0                                                        06288000
HEXLEN   EQU   0                                                        06289000
INCR     EQU   0                                                        06290000
HOLD     EQU   HOLDAREA                                                 06291000
SWITCHC  EQU   SWITCHON                                                 06292000
CPUHOLD  EQU   YYDDD                                                    06293000
CUAHOLD  EQU   YYDDD                                                    06294000
TRECCH   EQU   TRECCH0                                                  06295000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    06296000
MODEL    EQU   MERIDIAN+2                                               06297000
MRDNUMBR EQU   MERIDIAN                                                 06298000
LOADPTR  EQU   EDITABLE+8                                               06299000
LOADNAME EQU   EDITABLE                                                 06300000
EDITNUM  EQU   EDITLOAD                                                 06301000
SHARLET  EQU   SHAREIO+10                                               06302000
SHARSERB EQU   SHAREIO+7                                                06303000
SHARECUB EQU   SHAREIO+5                                                06304000
SHARSERA EQU   SHRCUCPU+2                                               06305000
SHAREDX  EQU   SHARECUA                                                 06306000
SHARENUM EQU   SHARE                                                    06307000
SYSTEMP  EQU   SYSUM2+9                                                 06308000
SYSPERM  EQU   SYSUM2+7                                                 06309000
SYSDEV   EQU   SYSUM2+5                                                 06310000
SYSOLDA  EQU   SYSITEM                                                  06311000
SYS3705  EQU   SYSITEM                                                  06312000
SYSOLD   EQU   SYSCPUS                                                  06313000
SYSCPU   EQU   SYSCPUS                                                  06314000
SYSCUA   EQU   SYSRT                                                    06315000
SYSGROUP EQU   SYSUMKEY                                                 06316000
SYSUMEOD EQU   SYSUMONE+96                                              06317000
SYSUMPER EQU   SYSUMONE+92                                              06318000
SYSUMPEA EQU   SYSUMONE+88                                              06319000
SYSUMPEI EQU   SYSUMONE+84                                              06320000
SYSUMCH  EQU   SYSUMONE+20                                              06321000
SYSUMMCN EQU   SYSUMONE+16                                              06322000
SYSUMMCR EQU   SYSUMONE+12                                              06323000
SYSUMNXT EQU   SYSUMONE+8                                               06324000
SYSUMIPL EQU   SYSUMONE+4                                               06325000
SYSUMNUM EQU   SYSUMONE                                                 06326000
SORTCORE EQU   SORTCCHR                                                 06327000
SORTTIME EQU   SORTKEY+1                                                06328000
SORTYEAR EQU   SORTKEY                                                  06329000
EVLETTER EQU   EVKEY+5                                                  06330000
EVSERIAL EQU   EVKEY+2                                                  06331000
EVMODEL  EQU   EVKEY                                                    06332000
EVNUM    EQU   EVTABLE+4                                                06333000
EVDAY    EQU   EVSTOP+1                                                 06334000
EVYEAR   EQU   EVSTOP                                                   06335000
TRETMP   EQU   TREND2+10                                                06336000
TREPRM   EQU   TREND2+8                                                 06337000
TRENDDEV EQU   TREND2+6                                                 06338000
TRENDDAT EQU   TRENDKEY+5                                               06339000
TRENDOD  EQU   TRENDITM                                                 06340000
TREND037 EQU   TRENDITM                                                 06341000
TRENDOLD EQU   TRENCPUS                                                 06342000
TRENDCPU EQU   TRENCPUS                                                 06343000
@NM00011 EQU   TRENDRT+1                                                06344000
TRENDCUA EQU   TRENDRT                                                  06345000
TRENDGRP EQU   TRENDKEY                                                 06346000
TREPRE   EQU   TREGEN+72                                                06347000
TRECCHF  EQU   TREGEN+68                                                06348000
TRECCHE  EQU   TREGEN+64                                                06349000
TRECCHD  EQU   TREGEN+60                                                06350000
TRECCHC  EQU   TREGEN+56                                                06351000
TRECCHB  EQU   TREGEN+52                                                06352000
TRECCHA  EQU   TREGEN+48                                                06353000
TRECCH9  EQU   TREGEN+44                                                06354000
TRECCH8  EQU   TREGEN+40                                                06355000
TRECCH7  EQU   TREGEN+36                                                06356000
TRECCH6  EQU   TREGEN+32                                                06357000
TRECCH5  EQU   TREGEN+28                                                06358000
TRECCH4  EQU   TREGEN+24                                                06359000
TRECCH3  EQU   TREGEN+20                                                06360000
TRECCH2  EQU   TREGEN+16                                                06361000
TRECCH1  EQU   TREGEN+12                                                06362000
TREMCH   EQU   TREGEN+4                                                 06363000
TREIPL   EQU   TREGEN                                                   06364000
TRENUM   EQU   TRENDONE+4                                               06365000
TRENEXT  EQU   TRENDONE                                                 06366000
DUMPSIZE EQU   DUMPINFO+4                                               06367000
DUMPADR  EQU   DUMPINFO                                                 06368000
DUMPNUM  EQU   DUMPTABL                                                 06369000
@NM00010 EQU   PARM+212                                                 06370000
RECLNGT1 EQU   PARM+204                                                 06371000
FRAMEPTR EQU   PARM+200                                                 06372000
ADCPUT   EQU   PARM+144                                                 06373000
RECLNGTH EQU   CCHHRLNG+6                                               06374000
@NM00009 EQU   CCHHRLNG+5                                               06375000
RECCCHHR EQU   CCHHRLNG                                                 06376000
@NM00008 EQU   ERRID+2                                                  06377000
NUMDAYS  EQU   PARM+88                                                  06378000
SORTNUM  EQU   PARM+84                                                  06379000
SYSRETRN EQU   @NM00007                                                 06380000
@NM00006 EQU   PARM+72                                                  06381000
EVSDAY   EQU   STRTDATE+1                                               06382000
EVSYEAR  EQU   STRTDATE                                                 06383000
PENSEC2  EQU   ENDTIME2+2                                               06384000
PENMIN2  EQU   ENDTIME2+1                                               06385000
PENHOUR2 EQU   ENDTIME2                                                 06386000
PSTSEC2  EQU   STTIME2+2                                                06387000
PSTMIN2  EQU   STTIME2+1                                                06388000
PSTHOUR2 EQU   STTIME2                                                  06389000
PENSEC1  EQU   ENDTIME1+2                                               06390000
PENMIN1  EQU   ENDTIME1+1                                               06391000
PENHOUR1 EQU   ENDTIME1                                                 06392000
PSTSEC1  EQU   STTIME1+2                                                06393000
PSTMIN1  EQU   STTIME1+1                                                06394000
PSTHOUR1 EQU   STTIME1                                                  06395000
@NM00005 EQU   ENDDT+4                                                  06396000
PENDY    EQU   PEND+1                                                   06397000
PENYR    EQU   PEND                                                     06398000
@NM00004 EQU   ENDDATE                                                  06399000
@NM00003 EQU   STDT+4                                                   06400000
PSTDY    EQU   PSTD+1                                                   06401000
PSTYR    EQU   PSTD                                                     06402000
@NM00002 EQU   STDATE                                                   06403000
@NM00001 EQU   DATENOW+3                                                06404000
CSNAP    EQU   CLOSEIO                                                  06405000
CDRCTWRK EQU   CLOSEIO                                                  06406000
CSYSIN   EQU   CLOSEIO                                                  06407000
CACCDEV  EQU   CLOSEIO                                                  06408000
CACCIN   EQU   CLOSEIO                                                  06409000
CSERLOG  EQU   CLOSEIO                                                  06410000
CEREPPT  EQU   CLOSEIO                                                  06411000
CTOURIST EQU   CLOSEIO                                                  06412000
OSNAP    EQU   OPENIO                                                   06413000
OEREPPT  EQU   OPENIO                                                   06414000
PASSFLAG EQU   MISC                                                     06415000
PZERO    EQU   MISC                                                     06416000
DEBUG63  EQU   DEBUGA+3                                                 06417000
DEBUG62  EQU   DEBUGA+3                                                 06418000
DEBUG61  EQU   DEBUGA+3                                                 06419000
DEBUG60  EQU   DEBUGA+3                                                 06420000
DEBUG59  EQU   DEBUGA+3                                                 06421000
DEBUG58  EQU   DEBUGA+3                                                 06422000
DEBUG57  EQU   DEBUGA+3                                                 06423000
DEBUG56  EQU   DEBUGA+3                                                 06424000
DEBUG55  EQU   DEBUGA+2                                                 06425000
DEBUG54  EQU   DEBUGA+2                                                 06426000
DEBUG53  EQU   DEBUGA+2                                                 06427000
DEBUG52  EQU   DEBUGA+2                                                 06428000
DEBUG51  EQU   DEBUGA+2                                                 06429000
DEBUG50  EQU   DEBUGA+2                                                 06430000
DEBUG49  EQU   DEBUGA+2                                                 06431000
DEBUG48  EQU   DEBUGA+2                                                 06432000
DEBUG47  EQU   DEBUGA+1                                                 06433000
DEBUG46  EQU   DEBUGA+1                                                 06434000
DEBUG45  EQU   DEBUGA+1                                                 06435000
DEBUG44  EQU   DEBUGA+1                                                 06436000
DEBUG43  EQU   DEBUGA+1                                                 06437000
DEBUG42  EQU   DEBUGA+1                                                 06438000
DEBUG41  EQU   DEBUGA+1                                                 06439000
DEBUG40  EQU   DEBUGA+1                                                 06440000
DEBUG39  EQU   DEBUGA                                                   06441000
DEBUG38  EQU   DEBUGA                                                   06442000
DEBUG37  EQU   DEBUGA                                                   06443000
DEBUG36  EQU   DEBUGA                                                   06444000
DEBUG35  EQU   DEBUGA                                                   06445000
DEBUG34  EQU   DEBUGA                                                   06446000
DEBUG33  EQU   DEBUGA                                                   06447000
DEBUG32  EQU   DEBUGA                                                   06448000
DEBUG30  EQU   DEBUG+3                                                  06449000
DEBUG29  EQU   DEBUG+3                                                  06450000
DEBUG28  EQU   DEBUG+3                                                  06451000
DEBUG27  EQU   DEBUG+3                                                  06452000
DEBUG26  EQU   DEBUG+3                                                  06453000
DEBUG25  EQU   DEBUG+3                                                  06454000
DEBUG24  EQU   DEBUG+3                                                  06455000
DEBUG23  EQU   DEBUG+2                                                  06456000
DEBUG22  EQU   DEBUG+2                                                  06457000
DEBUG21  EQU   DEBUG+2                                                  06458000
DEBUG20  EQU   DEBUG+2                                                  06459000
DEBUG19  EQU   DEBUG+2                                                  06460000
DEBUG18  EQU   DEBUG+2                                                  06461000
DEBUG17  EQU   DEBUG+2                                                  06462000
DEBUG16  EQU   DEBUG+2                                                  06463000
DEBUG15  EQU   DEBUG+1                                                  06464000
DEBUG14  EQU   DEBUG+1                                                  06465000
DEBUG13  EQU   DEBUG+1                                                  06466000
DEBUG12  EQU   DEBUG+1                                                  06467000
DEBUG11  EQU   DEBUG+1                                                  06468000
DEBUG10  EQU   DEBUG+1                                                  06469000
DEBUG9   EQU   DEBUG+1                                                  06470000
DEBUG8   EQU   DEBUG+1                                                  06471000
DEBUG7   EQU   DEBUG                                                    06472000
DEBUG6   EQU   DEBUG                                                    06473000
DEBUG5   EQU   DEBUG                                                    06474000
DEBUG3   EQU   DEBUG                                                    06475000
DEBUG2   EQU   DEBUG                                                    06476000
DEBUG1   EQU   DEBUG                                                    06477000
DEBUG0   EQU   DEBUG                                                    06478000
SORTBRK  EQU   SWITCHES+1                                               06479000
COREFAIL EQU   SWITCHES+1                                               06480000
ANALYSIS EQU   SWITCHES+1                                               06481000
NOTALL   EQU   SWITCHES+1                                               06482000
NOSDR    EQU   SWITCHES                                                 06483000
PTTYP    EQU   RECTYPE+1                                                06484000
PEOD     EQU   RECTYPE                                                  06485000
PMIH     EQU   RECTYPE                                                  06486000
PDDR     EQU   RECTYPE                                                  06487000
PIPL     EQU   RECTYPE                                                  06488000
PSOFT    EQU   RECTYPE                                                  06489000
POBR     EQU   RECTYPE                                                  06490000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      06491000
@RC00309 EQU   @EL00012                                                 06492000
@RC00304 EQU   @EL00012                                                 06493000
@RC00302 EQU   @EL00012                                                 06494000
@RC00347 EQU   @EL00014                                                 06495000
@RF00352 EQU   @EL00014                                                 06496000
@RC00360 EQU   @EL00015                                                 06497000
@RF00365 EQU   @EL00015                                                 06498000
@RC00376 EQU   @EL00016                                                 06499000
@RF00381 EQU   @EL00016                                                 06500000
@RC00386 EQU   @EL00017                                                 06501000
@RF00391 EQU   @EL00017                                                 06502000
@RC00403 EQU   @EL00018                                                 06503000
@RF00408 EQU   @EL00018                                                 06504000
@RF00412 EQU   @EL00018                                                 06505000
@RC00418 EQU   @EL00019                                                 06506000
@RF00423 EQU   @EL00019                                                 06507000
@RC00428 EQU   @EL00020                                                 06508000
@RF00433 EQU   @EL00020                                                 06509000
@RC00438 EQU   @EL00021                                                 06510000
@RF00443 EQU   @EL00021                                                 06511000
@RC00448 EQU   @EL00022                                                 06512000
@RF00453 EQU   @EL00022                                                 06513000
@RC00458 EQU   @EL00023                                                 06514000
@RF00463 EQU   @EL00023                                                 06515000
@RF00488 EQU   @RC00483                                                 06516000
@RC00469 EQU   @EL00024                                                 06517000
@RC00510 EQU   @EL00025                                                 06518000
@RC00554 EQU   @EL00026                                                 06519000
@RC00600 EQU   @EL00027                                                 06520000
@RC00649 EQU   @EL00028                                                 06521000
@RC00711 EQU   @EL00029                                                 06522000
@RF00762 EQU   @RC00750                                                 06523000
@RC00760 EQU   @RC00750                                                 06524000
@RC00755 EQU   @RC00750                                                 06525000
@RC00753 EQU   @RC00750                                                 06526000
@RC00743 EQU   @EL00030                                                 06527000
@RC00770 EQU   @EL00031                                                 06528000
@RC00820 EQU   @EL00032                                                 06529000
@RC00849 EQU   @EL00033                                                 06530000
@RF00922 EQU   @RC00912                                                 06531000
@RC00907 EQU   @EL00034                                                 06532000
@RC00931 EQU   @EL00035                                                 06533000
@RC00971 EQU   @EL00036                                                 06534000
@RC01017 EQU   @RC01013                                                 06535000
@RF01047 EQU   @RC01043                                                 06536000
@RF01059 EQU   @RC01055                                                 06537000
@RF01071 EQU   @RC01067                                                 06538000
@RF01083 EQU   @RC01079                                                 06539000
@RF01010 EQU   @RC01005                                                 06540000
@RC00997 EQU   @EL00037                                                 06541000
@RF01130 EQU   @RC01120                                                 06542000
@RC01096 EQU   @EL00038                                                 06543000
@RC01156 EQU   @EL00039                                                 06544000
@RF01224 EQU   @RC01221                                                 06545000
@RC01258 EQU   @RC01246                                                 06546000
@RC01176 EQU   @EL00040                                                 06547000
@RF01309 EQU   @RC01301                                                 06548000
@RC01296 EQU   @EL00041                                                 06549000
@RC01320 EQU   @EL00042                                                 06550000
@PB00043 EQU   @PB00044                                                 06551000
@RF01614 EQU   @RC01603                                                 06552000
@RC01264 EQU   @RC01258                                                 06553000
@PB00042 EQU   @PB00043                                                 06554000
@PB00041 EQU   @PB00042                                                 06555000
@PB00040 EQU   @PB00041                                                 06556000
@PB00039 EQU   @PB00040                                                 06557000
@PB00038 EQU   @PB00039                                                 06558000
@PB00037 EQU   @PB00038                                                 06559000
@PB00036 EQU   @PB00037                                                 06560000
@PB00035 EQU   @PB00036                                                 06561000
@PB00034 EQU   @PB00035                                                 06562000
@PB00033 EQU   @PB00034                                                 06563000
@PB00032 EQU   @PB00033                                                 06564000
@PB00031 EQU   @PB00032                                                 06565000
@PB00030 EQU   @PB00031                                                 06566000
@PB00029 EQU   @PB00030                                                 06567000
@PB00028 EQU   @PB00029                                                 06568000
@PB00027 EQU   @PB00028                                                 06569000
@PB00026 EQU   @PB00027                                                 06570000
@PB00025 EQU   @PB00026                                                 06571000
@PB00024 EQU   @PB00025                                                 06572000
@PB00023 EQU   @PB00024                                                 06573000
@PB00022 EQU   @PB00023                                                 06574000
@PB00021 EQU   @PB00022                                                 06575000
@PB00020 EQU   @PB00021                                                 06576000
@PB00019 EQU   @PB00020                                                 06577000
@PB00018 EQU   @PB00019                                                 06578000
@PB00017 EQU   @PB00018                                                 06579000
@PB00016 EQU   @PB00017                                                 06580000
@PB00015 EQU   @PB00016                                                 06581000
@PB00014 EQU   @PB00015                                                 06582000
@PB00013 EQU   @PB00014                                                 06583000
@PB00012 EQU   @PB00013                                                 06584000
@PB00011 EQU   @PB00012                                                 06585000
@PB00010 EQU   @PB00011                                                 06586000
@PB00009 EQU   @PB00010                                                 06587000
@PB00008 EQU   @PB00009                                                 06588000
@PB00007 EQU   @PB00008                                                 06589000
@PB00006 EQU   @PB00007                                                 06590000
@PB00005 EQU   @PB00006                                                 06591000
@PB00004 EQU   @PB00005                                                 06592000
@PB00003 EQU   @PB00004                                                 06593000
@PB00002 EQU   @PB00003                                                 06594000
@ENDDATA EQU   *                                                        06595000
         END   IFCPARM1,(C'PLS0511',0701,77315)                         06596000
