         TITLE 'IFCSXXXA / SUM TABLE - LINKNAME=IFCS2400,ALIASES=IFCS32C00065042
               11,IFCS3540'                                             00095042
         SPACE 2                                                        00130042
*  LINE MACRO     LINE MACRO     LINE MACRO     LINE MACRO            * 00195042
         MACRO                                                          00260042
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      00325042
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     00390042
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    00455042
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 00520042
.*                                 ENTRIES. LASTLY IT DETERMINES THE    00585042
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    00650042
.*                                 THE PREVIOUS LINE AND STORES THAT #  00715042
.*                                 INTO THE APPROPRIATE BYTE.           00780042
.*                                 &DATA(1) - CHARACTER POSITION TO     00845042
.*                                 BEGIN DATA.                          00910042
.*                                                                      00975042
.*                                 &DATA(2) - # OF SPACES BETWEEN       01040042
.*                                 SUCCESSIVE DATA COLUMN STARTING      01105042
.*                                 CHARACTERS.                          01170042
.*                                                                      01235042
.*                                 &LABEL(1) - CHARACTER POSITION       01300042
.*                                 TO BEGIN LABELS.                     01365042
.*                                                                      01430042
.*                                 &LABEL(2) - # OF SPACES BETWEEN      01495042
.*                                 LINE'S LABEL STARTING CHARACTERS.    01560042
.*                                                                      01625042
.*                                 &SKIP= - # OF LINES TO ADVANCE       01690042
.*                                 CARRIAGE TO BEGIN NEXT PRINTED LINE. 01755042
.*                                                                      01820042
.*                                 NEW ENTRIES ARE GENERATED ONLY WHEN  01885042
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   01950042
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 02015042
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   02080042
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 02145042
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    02210042
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   02275042
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   02340042
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   02405042
.*                                 THE SUBJECT LINE.                    02470042
         GBLA  &DB,&DT,&LB,&LT,&NRENTS                                  02535042
         GBLA  &LASTCC,&INITIAL                                         02600042
         GBLC  &NRENTSX                                                 02665042
         GBLC  &CARRCON                                                 02730042
         GBLB  &TEST                                                    02795042
         LCLA  &S                                                       02860042
&NAME    DS    0C                                                       02925042
         AIF   (&INITIAL EQ 0).FIRSTLN                                  02990042
         LINEND                                                         03055042
         AGO   .NTFIRST                                                 03120042
.FIRSTLN ANOP                                                           03185042
&NRENTSX SETC  'N&SYSNDX'                                               03250042
&INITIAL SETA  1                                                        03315042
&LASTCC  SETA  1                                                        03380042
N&SYSNDX EQU   *                                                        03445042
.NTFIRST ANOP                                                           03510042
         DC    AL1(0)                                                   03575042
         AIF   ('&DATA(1)' EQ '').CKDTABS                               03640042
         AIF   ('&DATA'(1,1) NE '(').SLABEL                             03705042
         AIF   (&DATA(1) EQ &DB).CKDTABS                                03770042
&DB      SETA  &DATA(1)                                                 03835042
         AGO   .AA                                                      03900042
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                03965042
         AIF   (&DATA(2) EQ &DT).NCDATA                                 04030042
         AGO   .CC                                                      04095042
.AA      AIF   ('&DATA(2)' EQ '').BB                                    04160042
         AIF   (&DATA(2) EQ &DT).BB                                     04225042
.CC      ANOP                                                           04290042
&DT      SETA  &DATA(2)                                                 04355042
.BB      DC    XL2'FFFE'                                                04420042
         DC    FL1'&DB'                                                 04485042
         DC    FL1'&DT'                                                 04550042
&NRENTS  SETA  &NRENTS+1                                                04615042
.NCDATA  ANOP                                                           04680042
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              04745042
         AIF   ('&LABEL'(1,1) NE '(').SLABEL                            04810042
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               04875042
&LB      SETA  &LABEL(1)                                                04940042
         AGO   .AAA                                                     05005042
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              05070042
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               05135042
         AGO   .CCC                                                     05200042
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  05265042
         AIF   (&LABEL(2) EQ &LT).BBB                                   05330042
.CCC     ANOP                                                           05395042
&LT      SETA  &LABEL(2)                                                05460042
.BBB     DC    XL2'FFFF'                                                05525042
         DC    FL1'&LB'                                                 05590042
         DC    FL1'&LT'                                                 05655042
&NRENTS  SETA  &NRENTS+1                                                05720042
.NCLABEL ANOP                                                           05785042
         AIF   ('&SKIP' EQ 'E').EJECT                                   05850042
         AIF   ('&SKIP' EQ '').TESTOFF                                  05915042
.CONT    ANOP                                                           05980042
         AIF   (&TEST EQ 0).AB                                          06045042
         AIF   (&SKIP EQ &LASTCC).TESTOFF                               06110042
&S       SETA  &SKIP                                                    06175042
         ORG   &CARRCON+3                                               06240042
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 06305042
         ORG                                                            06370042
&LASTCC  SETA  &S                                                       06435042
.SLABEL  ANOP                                                           06500042
.TESTOFF ANOP                                                           06565042
&TEST    SETB  0                                                        06630042
         AGO   .DD                                                      06695042
.EJECT   DC    XL2'FFFB'                                                06760042
&NRENTS  SETA  &NRENTS+1                                                06825042
         DC    X'8B'              SKIP TO CHANNEL 1                     06890042
         DC    AL.3(0),AL.2(&LASTCC),AL.3(1)                            06955042
&TEST    SETB  1                                                        07020042
         AGO   .DD                                                      07085042
.AB      AIF   (&SKIP EQ &LASTCC).NOCHANG                               07150042
A&SYSNDX DC    XL2'FFFB'                                                07215042
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              07280042
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              07345042
&LASTCC  SETA  &SKIP                                                    07410042
&TEST    SETB  1                                                        07475042
&CARRCON SETC  'A&SYSNDX'                                               07540042
&NRENTS  SETA  &NRENTS+1                                                07605042
.DD      ANOP                                                           07670042
.NOCHANG ANOP                                                           07735042
         MEND                                                           07800042
         EJECT                                                          07865042
         SPACE 2                                                        07930042
*  ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO     ROUTINE MACRO* 07995042
         MACRO                                                          08060042
&NAME    ROUTINE &LOGITEM,&RNAME                                        08125042
         GBLC  &DSECT,&CSECT                                            08190042
         GBLC  &ITEM(1000)                                              08255042
         GBLA  &SHIFT(1000),&ITEMNBR                                    08320042
         GBLA  &NRENTS                                                  08385042
         LCLA  &ISHIFT,&NDX                                             08450042
.LOOP    ANOP                                                           08515042
&NDX     SETA  &NDX+1                                                   08580042
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      08645042
         AIF   (&NDX LT &ITEMNBR).LOOP                                  08710042
         MNOTE *,'LOG ITEM NOT DEFINED'                                 08775042
         MEXIT                                                          08840042
.FOUND   ANOP                                                           08905042
&ISHIFT  SETA  &SHIFT(&NDX)                                             08970042
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           09035042
         DC    AL.4(&ISHIFT),AL.12(&RNAME-&CSECT)                       09100042
&NRENTS  SETA  &NRENTS+1                                                09165042
         MEND                                                           09230042
*  DSGEN MACRO     DSGEN MACRO     DSGEN MACRO     DSGEN MACRO        * 09295042
         SPACE 2                                                        09360042
         MACRO                                                          09425042
&NAME    DSGEN &X1,&X2,&X3,&X4,&X5,&X6,&X7,&X8,&X9,&X10,&X11,&X12,&X13,X09490042
               &X14,&X15,&X16,&X17,&X18,&X19,&X20,&X21,&X22,&X23,&X24, X09555042
               &X25,&X26,&X27,&X28,&X29,&X30,&X31,&X32                  09620042
.*                            THIS MACRO GENERATES ONE DSECT WORD       09685042
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 09750042
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  09815042
.*                                 FIRST IS THE NAME OF THE LOG ITEM    09880042
.*                                 WHILE THE SECOND IS THE # OF BITS TO 09945042
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   10010042
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 10075042
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      10140042
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  10205042
.*                                 THE LOG ITEMS MAY THEN BE USED IN    10270042
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   10335042
         GBLC &ITEM(1000)                                               10400042
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000)                         10465042
         LCLC  &SYMBOL                                                  10530042
         LCLA  &OP,&COUNT,&BYTE                                         10595042
.LOOP    ANOP                                                           10660042
&OP      SETA  &OP+1                                                    10725042
&ITEMNBR SETA  &ITEMNBR+1                                               10790042
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        10855042
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            10920042
         MNOTE *,'NULL BIT COUNT FIELD'                                 10985042
         MEXIT                                                          11050042
.OK1     ANOP                                                           11115042
         AIF   ('&SYMBOL' NE '').OK                                     11180042
         MNOTE 'LOG ITEM SYMBOL NOT PROVIDED'                           11245042
         AGO   .CNT                                                     11310042
.OK      ANOP                                                           11375042
         AIF   ('&SYMBOL'(1,1) EQ '''').CNT                *TEMP*       11440042
&SYMBOL  EQU   *+&BYTE                                                  11505042
&ITEM(&ITEMNBR)  SETC '&SYSLIST(&OP,1)'                                 11570042
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    11635042
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    11700042
.CNT     ANOP                                                           11765042
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   11830042
&BYTE    SETA  &COUNT/8                                                 11895042
         AIF (&OP LT N'&SYSLIST).LOOP                                   11960042
         AIF   (&COUNT NE 32).NOT32                                     12025042
&NAME    DS    4C                                                       12090042
         MEXIT                                                          12155042
.NOT32   AIF   (&COUNT NE 64).ERR                                       12220042
&NAME    DS    8C                                                       12285042
         MEXIT                                                          12350042
.ERR     MNOTE '**BIT COUNT FIELDS DO NOT TOTAL 32 OR 64**'             12415042
         MEND                                                           12480042
         MACRO                                                          12545042
         LINEND                                                         12610042
.*                            THIS MACRO IS USED ONLY BY THE LINE       12675042
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   12740042
.*                                 ASSOCIATED WITH EACH LINE.           12805042
         GBLA  &NRENTS                                                  12870042
         GBLC &NRENTSX                                                  12935042
         ORG   &NRENTSX                                                 13000042
         DC    FL1'&NRENTS'                                             13065042
         ORG                                                            13130042
&NRENTS  SETA  0                                                        13195042
B&SYSNDX EQU   *                                                        13260042
&NRENTSX SETC  'B&SYSNDX'                                               13325042
         MEND                                                           13390042
         SPACE 2                                                        13455042
         EJECT                                                          13520042
*  LABEL MACRO     LABEL MACRO     LABEL MACRO     LABEL MACRO        * 13585042
         SPACE 2                                                        13650042
         MACRO                                                          13715042
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C13780042
               &LABEL7,&LABEL8                                          13845042
.*                            THIS MACRO ALLOWS UP TO ACHT LABELS TO    13910042
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   13975042
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  14040042
.*                                 TION MARKS. THE COLUMN AND LINE END  14105042
.*                                 CONTROLS WILL BE INSERTED BY THE     14170042
.*                                 MACRO. OMITTED OPERANDS MEAN NO      14235042
.*                                 LABEL REQUIRED FOR RESPECTIVE        14300042
.*                                 COLUMN. THIS MACRO WILL ALSO ALERT   14365042
.*                                 THE PROGRAMMER TO EXACTLY WHERE THE  14430042
.*                                 TABLE MUST BE BROKEN IF NECESSARY    14495042
.*                                 TO AVOID EXCEEDING THE MAXIMUM LIMIT 14560042
         GBLC &LABELS(2000)                                             14625042
         GBLC  &LBL(100)                                                14690042
         GBLA  &LBLCTR(100)                                             14755042
         GBLA  &LABELNR                                                 14820042
         GBLA  &NRENTS,&LPTR                                            14885042
         LCLC  &MARGIN,&TACK                                            14950042
         LCLC  &TEXT                                                    15015042
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            15080042
&MARGIN  SETC  '*'                                                      15145042
         AIF   ('&NAME' EQ '').LOOPOUT                                  15210042
&LPTR    SETA  &LPTR+1                                                  15275042
&LBL(&LPTR) SETC '&NAME'                                                15340042
&LBLCTR(&LPTR) SETA &LABELNR+1                                          15405042
.LOOPOUT ANOP                                                           15470042
&OP      SETA  &OP+1                                                    15535042
&K       SETA  K'&SYSLIST(&OP)                                          15600042
         AIF (&K GE 2).NORM                                             15665042
&K       SETA  2                                                        15730042
.NORM    ANOP                                                           15795042
&START   SETA  2                                                        15860042
         AIF (&OP LT N'&SYSLIST).NOTLAST                                15925042
&MARGIN  SETC  '$'                                                      15990042
.NOTLAST ANOP                                                           16055042
&NRCHAR  SETA  8                                                        16120042
&TACK    SETC  ''                                                       16185042
.LOOPIN  ANOP                                                           16250042
&REMAIN  SETA  &K-&START                                                16315042
         AIF (&REMAIN GE 8).MORE                                        16380042
&TACK    SETC  '&MARGIN'                                                16445042
&NRCHAR  SETA  &REMAIN                                                  16510042
.MORE    ANOP                                                           16575042
&TEXT    SETC  ''                                                       16640042
         AIF (&REMAIN EQ 0).ENDTEXT                                     16705042
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          16770042
.ENDTEXT ANOP                                                           16835042
&LABELNR SETA  &LABELNR+1                                               16900042
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  16965042
&START   SETA  &START+8                                                 17030042
         AIF ('&TACK' EQ '').LOOPIN                                     17095042
         AIF ('&TACK' EQ '*').LOOPOUT                                   17160042
         MEND                                                           17225042
         SPACE 2                                                        17290042
         MACRO                                                          17355042
         LSTART                                                         17420042
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  17485042
.*                                 OF THE TABLE IS TO BEGIN.            17550042
         GBLC &LABELS(2000)                                             17615042
         GBLA  &LABELNR                                                 17680042
         GBLC  &LBL(100)                                                17745042
         GBLA  &LBLCTR(100)                                             17810042
         LCLA  &NDX,&CTR                                                17875042
         LINEND                                                         17940042
&CTR     SETA  1                                                        18005042
.LOOP    ANOP                                                           18070042
&NDX     SETA  &NDX+1                                                   18135042
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            18200042
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         18265042
&CTR     SETA  &CTR+1                                                   18330042
         AGO   .LOOPCTL                                                 18395042
.NOLBL   ANOP                                                           18460042
         DC    C'&LABELS(&NDX)'                                         18525042
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  18590042
         MEND                                                           18655042
         SPACE 2                                                        18720042
*  BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO     BIN MACRO  * 18785042
         SPACE 2                                                        18850042
         MACRO                                                          18915042
         BIN   &LOGITEM,&SKIP$OR                                        18980042
.*                                 &LOGITEM - NAME OF ITEM IN LOG       19045042
.*                                      RECORD DSECT                    19110042
.*                                 &SKIP$OR - NBR OF SPACES TO SKIP ON  19175042
.*                                 MULTIPLE PRINT OR NBR OF SPACES      19240042
.*                                      TO BACK UP FROM COLUMN FOR      19305042
.*                                      START OF PRINTING. THE LETTER   19370042
.*                                      B PRECEEDS THE NUMBER (B5) IF   19435042
.*                                      THE LATTER IS DESIRED. OMISSION 19500042
.*                                      OF THIS OPERAND FORCES OPTION 2 19565042
.*                                      WITH BACKUP SPACING EQUAL TO    19630042
.*                                 THE NUMBER OF BITS IN THE ITEM       19695042
.*                                 DEFINITION (VIA MACRO 'DSGEN').      19760042
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     19825042
.*                                 TOTAL NUMBER OF BITS TO PRINT.       19890042
         GBLC &ITEM(1000)                                               19955042
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 20020042
         GBLC  &DSECT                                                   20085042
         LCLB  &B                                                       20150042
         LCLA  &IBITS,&NDX,&ISHIFT,&K                                   20215042
         LCLA  &TEMP,&T                                                 20280042
         LCLC  &S                                                       20345042
.LOOP    ANOP                                                           20410042
&NDX     SETA  &NDX+1                                                   20475042
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      20540042
         AIF   (&NDX LT &ITEMNBR).LOOP                                  20605042
         MNOTE *,'YOU BLEW IT'                                          20670042
         ROUTINE DUM,SKIPPER                                            20735042
         MEXIT                                                          20800042
.FOUND   ANOP                                                           20865042
&ISHIFT  SETA  &SHIFT(&NDX)                                             20930042
&IBITS   SETA  &BITS(&NDX)                                              20995042
&T       SETA  &IBITS-1                                                 21060042
&B       SETB  0                                                        21125042
         AIF   ('&SKIP$OR' EQ '').BACKUP                                21190042
&K       SETA  K'&SKIP$OR                                               21255042
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 21320042
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   21385042
&T       SETA  &S                                                       21450042
.BACKUP  ANOP                                                           21515042
&NRENTS  SETA  &NRENTS+1                                                21580042
&TEMP    SETA  &ISHIFT                                                  21645042
A&SYSNDX DC    AL.12(&LOGITEM-&DSECT),XL.4'&TEMP'                       21710042
         AIF (&IBITS EQ 1 AND &B EQ 0).OUT                              21775042
         ORG   A&SYSNDX                                                 21840042
&B       SETB  1                                                        21905042
         DC    AL.12(&LOGITEM-&DSECT),XL.4'C'                           21970042
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             22035042
.OUT     ANOP                                                           22100042
         MEND                                                           22165042
         EJECT                                                          22230042
*  HEX MACRO     HEX MACRO     HEX MACRO    HEXN MACRO     HEX MACRO  * 22295042
         SPACE 2                                                        22360042
         MACRO                                                          22425042
         HEX   &LOGITEM,&SKIP$OR,&BYTES                                 22490042
.*                            THIS MACRO FACILITATES GENERATION OF THE  22555042
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    22620042
.*                                 CONVERSIONS.                         22685042
.*                            &LOGITEM - NAME OF DATA ITEM TO BE        22750042
.*                                 CONVERTED                            22815042
.*                            &SKIP$OR - NUMBER OF SPACES TO SKIP ON    22880042
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   22945042
.*                                 BACK UP FROM COLUMN FOR START OF     23010042
.*                                 PRINTING. THE LETTER B PRECEEDS THE  23075042
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  23140042
.*                                 DESIRED. OMISSION OF THIS OPERAND    23205042
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  23270042
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  23335042
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 23400042
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    23465042
.*                                 IMPLICITLY B).                       23530042
.*                            &BYTES - NUMBER OF TOTAL INPUT BYTES TO   23595042
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     23660042
.*                                 WITH AN L,R, OR B TO STIPULATE       23725042
.*                                 PRINTING OF THE LEFT HALF, RIGHT     23790042
.*                                 HALF, OR BOTH HALVES OF THE BYTE     23855042
.*                                 RESPECTIVELY. OMISSION OF THIS       23920042
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  23985042
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 24050042
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 24115042
.*                                 SARY. THIS MACRO MUST BE THE FIRST   24180042
.*                                 MACRO INSTRUCTION ISSUED FOR THE     24245042
.*                                 SUBJECT LINE(S).                     24310042
         GBLC &ITEM(1000),&DSECT                                        24375042
         GBLA &ITEMNBR,&BITS(1000),&SHIFT(1000),&NRENTS                 24440042
         LCLB  &B                                                       24505042
         LCLA  &IBITS,&NDX,&ISHIFT,&K,&T,&CODE,&BYTESP                  24570042
         LCLC  &S,&LETTER                                               24635042
.LOOP    ANOP                                                           24700042
&NDX     SETA  &NDX+1                                                   24765042
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      24830042
         AIF   (&NDX LT &ITEMNBR).LOOP                                  24895042
         MNOTE *,'LOG ITEM NOT DEFINED'                                 24960042
         MEXIT                                                          25025042
.FOUND   ANOP                                                           25090042
&ISHIFT  SETA  &SHIFT(&NDX)                                             25155042
&IBITS   SETA  &BITS(&NDX)                                              25220042
&CODE    SETA  1                                                        25285042
&K       SETA  K'&BYTES                                                 25350042
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            25415042
         MNOTE *,'BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL'   25480042
         MEXIT                                                          25545042
.OK      AIF   ('&BYTES' EQ '').USEDEFN                                 25610042
&LETTER  SETC  '&BYTES'(&K,1)                                           25675042
&S       SETC  '&BYTES'(1,&K-1)                                         25740042
&BYTESP  SETA  &S                                                       25805042
         AIF   ('&LETTER' EQ 'B').BOTH                                  25870042
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).OK2                       25935042
.ERR     MNOTE *,'DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY'            26000042
         MEXIT                                                          26065042
.USEDEFN ANOP                                                           26130042
&BYTESP  SETA  &IBITS/8                                                 26195042
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       26260042
&CODE    SETA  3                                                        26325042
&T       SETA  &BYTESP*2-1                                              26390042
&S       SETC  '&T'                                                     26455042
.OK2     AIF   (&ISHIFT EQ 0).L                                         26520042
&CODE    SETA  2                                                        26585042
.L       ANOP                                                           26650042
&B       SETB  1                                                        26715042
         AIF   ('&SKIP$OR' EQ '').BACKUP                                26780042
&K       SETA  K'&SKIP$OR                                               26845042
&B       SETB  ('&SKIP$OR'(1,1) EQ 'B')                                 26910042
&S       SETC  '&SKIP$OR'(&B+1,&K-&B)                                   26975042
.BACKUP  ANOP                                                           27040042
&NRENTS  SETA  &NRENTS+1                                                27105042
         DC    AL.12(&LOGITEM-&DSECT),XL.4'A'                           27170042
         DC    BL.1'&B',FL.7'&S',FL.4'&BYTESP',FL.4'&CODE'              27235042
.OUT     ANOP                                                           27300042
         MEND                                                           27365042
         MACRO                                                          27430042
         SPECIAL  &ROUTINE,&PARAM,&SPACE=                               27495042
.*                            THIS MACRO GENERATES A SPECIAL ROUTINE    27560042
.*                                 ENTRY TO BE PROCESSED BY THE SUM. M. 27625042
.*                            &ROUTINE - SYMBOL ON SPECIAL ROUTINE EWT. 27690042
.*                            &PARAM - AN 8 BIT BINARY REPRESENTATION   27755042
.*                                 TO OCCUPY THE 'MASK' FIELD BUT TO BE 27820042
.*                                 INTERPRETED AS AN ARGUMENT OF THE    27885042
.*                                 SPECIAL ROUTINE.                     27950042
.*                            &SPACE - THE NUMBER OF 2BYTE COUNTERS TO  28015042
.*                                 ALLOCATE FOR REQUIRED PROCESSING.    28080042
         GBLC  &CSECT                                                   28145042
         GBLA  &COUNTR                                                  28210042
         LCLA  &ADD                                                     28275042
         DC    AL1(128)                                                 28340042
         DC    BL.8'&PARAM'                                             28405042
         DC    AL2(&ROUTINE-&CSECT)                                     28470042
         DC    AL2(&COUNTR)                                             28535042
&ADD     SETA  1                                                        28600042
         AIF   ('&SPACE' EQ '').NORM                                    28665042
&ADD     SETA  &SPACE                                                   28730042
.NORM    ANOP                                                           28795042
&COUNTR  SETA  &COUNTR+&ADD                                             28860042
         MEND                                                           28925042
         MACRO                                                          28990042
         SUM   &LOGITEM,&MASK                                           29055042
.*                            THIS MACRO GENERATES A NORMAL EDIT ENTRY  29120042
.*                                 FOR PROCESSING BY THE SUMMARY MODULE 29185042
.*                            &LOGITEM - NAME OF DATA ITEM TO BE SUMMED 29250042
.*                            &MASK - BYTE MASK FOR BITS TO BE TESTED.  29315042
.*                                 THIS OPERAND SHOULD BE OMITTED FOR   29380042
.*                                 SINGLE BIT ITEMS IN WHICH CASE THE   29445042
.*                                 MASK WILL BE SET ACCORDING TO THE    29510042
.*                                 OFF BYTE BIT DISPLACEMENT OF THE     29575042
.*                                ITEM AS DEFINED BY THE MACRO 'DSGEN'  29640042
         GBLA  &COUNTR,&ITEMNBR,&BITS(1000),&SHIFT(1000)                29705042
         GBLC  &ITEM(1000),&DSECT                                       29770042
         LCLA  &IBITS,&NDX,&ISHIFT,&M,&BITNBR                           29835042
.LOOP    ANOP                                                           29900042
&NDX     SETA  &NDX+1                                                   29965042
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      30030042
         AIF   (&NDX LT &ITEMNBR).LOOP                                  30095042
         MNOTE *,'LOGITEM NOT FOUND'                                    30160042
         MEXIT                                                          30225042
.FOUND   ANOP                                                           30290042
         DC    AL1(0)                                                   30355042
&ISHIFT  SETA  &SHIFT(&NDX)                                             30420042
&IBITS   SETA  &BITS(&NDX)                                              30485042
         AIF   ('&MASK' EQ '').FORM                                     30550042
         DC    B'&MASK'                                                 30615042
         AGO   .ITEM                                                    30680042
.FORM    ANOP                                                           30745042
&BITNBR  SETA  &ISHIFT-7                                                30810042
&BITNBR  SETA  0-&BITNBR                                                30875042
&M       SETA  1                                                        30940042
.LOOP2   ANOP                                                           31005042
         AIF   (&BITNBR EQ 0).GOTIT                                     31070042
&M       SETA  &M*2                                                     31135042
&BITNBR  SETA  &BITNBR-1                                                31200042
         AGO   .LOOP2                                                   31265042
.GOTIT   ANOP                                                           31330042
         DC    AL1(&M)                                                  31395042
.ITEM    DC    AL2(&LOGITEM-&DSECT)                                     31460042
         DC    AL2(&COUNTR)                                             31525042
&COUNTR  SETA  &COUNTR+1                                                31590042
         MEND                                                           31655042
         GBLC  &DSECT,&CSECT                                            31720042
&CSECT   SETC  'IFCSXXXA'                                               31785042
&DSECT   SETC  'XXXA'                                                   31850042
IFCSXXXA CSECT                                                          31915042
*              OBR SUM TABLE                                            31980042
*                                                                       32045042
*              DEVICE CODE=8001 DEVICE TYPE=2400  ALIAS=IFCS2400        32110042
*                                                                       32175042
XXXA     DSECT                                                          32240042
         DSGEN (XKEY1,16),(XDUM1,8),(XSW,1),(SW2B1,1),           S21021X32305042
               (SHRTSW,1),(SW2B3,1),(SW2B4,1),(SW2B5,1),         S21021X32370042
               (SW2B6,1),(SW2B7,1)                               S21021 32435042
         DSGEN (XDUM2,32)                    SPARES                     32500042
         DSGEN (XDATE,32)                    DATE                       32565042
         DSGEN (XTIME,32)                    TIME                       32630042
         DSGEN (XDUM3,8),(XSER,24)           SERIAL NO                  32695042
         DSGEN (XMODEL,16),(XDUM8,16)        MODEL NUMBER               32760042
         DSGEN (XPGN1,32)                    JOB                        32825042
         DSGEN (XPGN2,32)                       NAME                    32890042
         DSGEN (XFCCWCC,8),(XFCCWDA,24)      FAILING                    32955042
         DSGEN (XFCCWFL,8),(XZERO,8),(XFCCWCT,16)   FAILING CCW         33020042
         DSGEN (XCSWK,8),(XCSWCA,24)                CSW                 33085042
         DSGEN (XCSWATTN,1),(XCSWSM,1),(XCSWUA,1),(XCSWBSY,1),         C33150042
               (XCSWCE,1),(XCSWDE,1),(XCSWUC,1),(XCSWUE,1),            C33215042
               (XCSWPCI,1),(XCSWSILI,1),(XCSWPC,1),(XCSWPCHK,1),       C33280042
               (XCSWCDC,1),(XCSWCCC,1),(XCSWICC,1),(XCSWCH,1),         C33345042
               (XCSWCT,16)                                              33410042
         DSGEN (XECSW,32)                              ECSW             33475042
         DSGEN (XDEVT1,16),(XDEVT2,16)                                  33540042
         DSGEN (XDUM6,8),(XCUA,24)                     CUA              33605042
         DSGEN (XDUM7,32)                              VOLUME           33670042
         DSGEN (XVOL1,32)                                   SERIAL      33735042
         DSGEN (XVOL2,16),(XDUMP,16)                             NO     33800042
         DSGEN (XDUM11,32)                                              33865042
         DSGEN (XDUM12,32)                                              33930042
         DSGEN (XDUM13,32)                                              33995042
         DSGEN (XDUM14,32)                                              34060042
         DSGEN (SDR1,8),(SDR2,8),(SDR3,8),(SDR4,8),              S21021C34125042
               (SDR5,8),(SDR6,8),(SDR7,8),(SDR8,8)               S21021 34190042
         DSGEN (XDUM17,16),                                            C34255042
               (XB0CMDR,1),(XB0INTRQ,1),(XB0BUSC,1),(XB0ECHK,1),       C34320042
               (XB0DCHK,1),(XB0OVRN,1),(XB0WRD,1),(XB0DTC,1),          C34385042
               (XB1NOISE,1),(XB1STATA,1),(XB1STATB,1),(XB17TRCK,1),    C34450042
               (XB1LOADP,1),(XB1WTSTA,1),(XB1FLPRT,1),(XB1NCOMP,1)      34515042
         DSGEN (XB2TE0,1),(XB2TE1,1),(XB2TE2,1),(XB2TE3,1),            C34580042
               (XB2TE4,1),(XB2TE5,1),(XB2TE6,1),(XB2TE7,1),            C34645042
               (XB3RUN,1),(XB3LRC,1),(XB3SKW,1),(XB3CRC,1),            C34710042
               (XB3SKV,1),(XB3PDE,1),(XB3BKW,1),(XB3CCM,1),            C34775042
               (XB4ECH,1),(XB4REJ,1),(XB4RDC,1),(XB4WRC,1),            C34840042
               (XB4DLY,1),(XB4CSQ,1),(XB4BSQ,1),(XB4ASQ,1),            C34905042
               (XB5BT0,1),(XB5BT1,1),(XB5BT2,1),(XB5BT3,1),            C34970042
               (XB5BT4,1),(XB5BT5,1),(XB5BT6,1),(XB5BT7,1)              35035042
*                                                                S21021 35100042
EXPNOBR  DSECT                                                   S21021 35165042
EXPNHDRA DS    CL52                                              S21021 35230042
EXPNDEVA DS    CL12                                              S21021 35295042
EXPNDA   DS    CL24                                              S21021 35360042
EXPNSDRA DS    CL10                                              S21021 35425042
EXPNSNSA DS    CL6                                               S21021 35490042
*                                                                S21021 35555042
SHRTOBR  DSECT                                                   S21021 35620042
SHRTHDRA DS    CL24                                              S21021 35685042
SHRTDEVA DS    CL8                                               S21021 35750042
SHRTSDRA DS    CL10                                              S21021 35815042
*                                                                S21021 35880042
NORMOBR  DSECT                                                   S21021 35945042
NORMHDRA DS    CL64                                              S21021 36010042
NORMDA   DS    CL8                                               S21021 36075042
NORMSDRA DS    CL10                                              S21021 36140042
NORMSNSA DS    CL6                                               S21021 36205042
*                                                                S21021 36270042
*                                                                S21021 36595042
IFCSXXXA CSECT                                                          36660042
         USING XXXA,R2                                                  36725042
         USING *,R9                                                     36790042
         DC    A(ENTRIES)               PTR TO ENTRIES                  36855042
         DC    A(PEDIT)                 PTR TO EDIT SECTION OF SUM TBL  36920042
REG8     DC    F'0'                     R8 SAVE AREA CURRENT ENTRY      36985042
SCSIZE   DC    H'190'                   NO OF 2 BYTE CNTRS TO GETS21021 37050042
R0       EQU   0                                                        37115042
R1       EQU   1                                                        37180042
R2       EQU   2                                                        37245042
R3       EQU   3                                                        37310042
R4       EQU   4                                                        37375042
R5       EQU   5                                                        37440042
R6       EQU   6                                                        37505042
R7       EQU   7                                                        37570042
R8       EQU   8                                                        37635042
R9       EQU   9                                                        37700042
R10      EQU   10                                                       37765042
R11      EQU   11                                                       37830042
R12      EQU   12                                                       37895042
R13      EQU   13                                                       37960042
R14      EQU   14                                                       38025042
R15      EQU   15                                                       38090042
*                                                                       38155042
*        SPECIAL ROUTINE SECTION   R2=PTR TO LOGREC R9=BASE ADDR        38220042
*                                  R3=PTR TO BUM COUNTER                38285042
*                                                                       38350042
*        VOLUME SER      3 CNTRS ARE VOL SER  1 COUNTER THE NUMBER      38415042
*                                             R3 POINTS TO COUNTER      38480042
SETVOLS  TM    XSW,HEX20                IS THIS A SHORT RECORD?  S21021 38545042
         BCR   1,R14                    YES, NO VOLSER, RETURN   S21021 38610042
         STM   R5,R8,XSAVE              SAVE REGS                S21021 38675042
         CLC   XDEVT2(L2),H3211         TEST FOR 3211            S20202 38740042
         BE    RETURNV                  BRANCH                   S20202 38805042
         LA    R5,L10              LOOP COUNT                           38870042
         LR    R6,L3               SET COUNTER PTR                      38935042
SETVOL1  CLC   L0(L6,R6),ZEROS     IS COUNTER EMPTY                     39000042
         BE    SETVOL2             BR-YES                               39065042
         CLC   L0(L6,R6),XVOL1          DOES THIS SER MATCH             39130042
         BE    SETVOL3             YES                                  39195042
         LA    R6,L8(R6)           BUMP TO NEXT SLOT                    39260042
         BCT   R5,SETVOL1          LOOP                                 39325042
         B     RETURNV             ALL FULL IGNORE                      39390042
SETVOL2  MVC   L0(L6,R6),XVOL1     STORE NEW VOLUME SER                 39455042
SETVOL3  LH    R7,L6(R6)           ADD                                  39520042
         LA    R7,L1(R7)               1                                39585042
         STH   R7,L6(R6)                TO COUNTER                      39650042
RETURNV  LM    R5,R6,XSAVE                AND                           39715042
         BR    R14                          RETURN                      39780042
XFAILCCW EQU   *                                                        39845042
         TM    XSW,HEX20                IS THIS A SHORT RECORD?  S21021 39910042
         BCR   1,R14                    YES, NO CCW, RETURN      S21021 39975042
*                                                                       40040042
         STM   R14,R12,L12(R13)         SAVE REGS                       40105042
         SR    R7,R7                                                    40170042
         IC    R7,XFCCWCC               PICK UP FAILING CCW CODE        40235042
         B     COMMON                                                   40300042
*                                                                       40365042
*                                                                       40430042
XDATE1   STM   R14,R15,L12(R13)         SAVE R14 & R 15          S21021 40495042
         BAL   R14,EXPANDER             BAL TO EXPAND REC        S21021 40560042
         STM   R0,R12,L20(R13)          SAVE REMAINDER OF REGS   S21021 40625042
         CLC   XDATE(L4),HEX00         IS DATE ZERO                     40690042
         BE    RETURN                   BR-ZERO                         40755042
         CLC   L0(L4,R3),HEX00          IS LOW DATE ZERO                40820042
         BNE   XDATE2                   BR-NO                           40885042
         MVC   L0(L4,R3),XDATE          MOVE IN DATE                    40950042
XDATE2   EQU   *                                                        41015042
         CLC   XDATE(L4),L0(R3)         CHECK FOR LOW DATE              41080042
         BL    SAVELOW                  LOWER SAVE IT                   41145042
         CLC   XDATE(L4),L4(R3)         CHECK FOR HI                    41210042
         BNH   RETURN                   BR-NOT HI                       41275042
SAVEHI   MVC   L4(L4,R3),XDATE          MOVE HI DATE                    41340042
         B     RETURN                                                   41405042
SAVELOW  MVC   L0(L4,R3),XDATE          MOVE LOW DATE                   41470042
         B     RETURN                                                   41535042
*                                                                S21021 41600042
*                                       ROUTINE TO SUM SDR CNTRS S21021 41665042
*                                                                S21021 41730042
SDR1L    IC    R15,SDR1                                          S21021 41795042
SDRLEFT  SLL   R15,L24                  SHIFT OFF UNUSED BITS    S21021 41860042
SDRADD   SRL   R15,L28                  MOVE IT BACK FOR ADD     S21021 41925042
         AH    R15,L0(R3)               ADD IN COUNTER           S21021 41990042
         STH   R15,L0(R3)               SAVE RESULT              S21021 42055042
         BR    R14  RETURN                                       S21021 42120042
SDR1R    IC    R15,SDR1                 PICK UP COUNTER          S21021 42185042
SDRRIGHT SLL   R15,L28                  SHIFT OFF UNUSED BITS    S21021 42250042
         B     SDRADD                                            S21021 42315042
SDR2L    IC    R15,SDR2                                          S21021 42380042
         B     SDRLEFT                                           S21021 42445042
SDR3L    IC    R15,SDR3                                          S21021 42510042
         B     SDRLEFT                                           S21021 42575042
SDR4L    IC    R15,SDR4                                          S21021 42640042
         B     SDRLEFT                                           S21021 42705042
SDR5L    IC    R15,SDR5                                          S21021 42770042
         B     SDRLEFT                                           S21021 42835042
SDR6L    IC    R15,SDR6                                          S21021 42900042
         B     SDRLEFT                                           S21021 42965042
SDR7L    IC    R15,SDR7                                          S21021 43030042
         B     SDRLEFT                                           S21021 43095042
SDR8L    IC    R15,SDR8                                          S21021 43160042
         B     SDRLEFT                                           S21021 43225042
SDR2R    IC    R15,SDR2                                          S21021 43290042
         B     SDRRIGHT                                          S21021 43355042
SDR3R    IC    R15,SDR3                                          S21021 43420042
         B     SDRRIGHT                                          S21021 43485042
SDR4R    IC    R15,SDR4                                          S21021 43550042
         B     SDRRIGHT                                          S21021 43615042
SDR5R    IC    R15,SDR5                                          S21021 43680042
         B     SDRRIGHT                                          S21021 43745042
SDR6R    IC    R15,SDR6                                          S21021 43810042
         B     SDRRIGHT                                          S21021 43875042
SDR7R    IC    R15,SDR7                                          S21021 43940042
         B     SDRRIGHT                                          S21021 44005042
SDR8R    IC    R15,SDR8                                          S21021 44070042
         B     SDRRIGHT                                          S21021 44135042
*                                                                S21021 44200042
EXPANDER STM   R5,R6,XSAVE              SAVE WORK REGS           S21021 44265042
         LA    R5,OBRAREA               GET EXP AREA             S21021 44330042
         LR    R6,R2                    SWAP ADDRESSES           S21021 44395042
         USING EXPNOBR,R5               SET DSECT ADDRESSABILITY S21021 44460042
         USING NORMOBR,R6                                        S21021 44525042
         XC    OBRAREA(L104),OBRAREA    CLEAR AREA               S21021 44590042
         TM    XKEY1,HEX02              IS IT A CONVERTED REC    S21021 44655042
         BO    MOVEALL                  YES                      S21021 44720042
         TM    XSW,HEX20                IS IT A SHORT HEC        S21021 44785042
         BO    MOVESHRT                 YES                      S21021 44850042
         MVC   EXPNHDRA(L72),NORMHDRA   MOVE HEADER AND VOLSER   S21021 45045042
         MVC   EXPNSDRA(L10),NORMSDRA   MOVE SDR'S               S21021 45110042
         MVC   EXPNSNSA(L6),NORMSNSA    MOVE SENSE               S21021 45175042
EXPNDRET ST    R2,SAVE2                 SAVE R2                  S21021 45240042
         LR    R2,R5                    SWAP REG POINTERS        S21021 45305042
         LM    R5,R6,XSAVE              RESET REGS               S21021 45370042
         BR    R14                      RETURN                   S21021 45435042
MOVEALL  MVC   EXPNOBR(L104),NORMOBR    MOVE ALL REC             S21021 45500042
         B     EXPNDRET                                          S21021 45565042
         USING SHRTOBR,R6                                        S21021 45630042
MOVESHRT MVC   EXPNHDRA(L24),SHRTHDRA                            S21021 45695042
         MVC   EXPNDEVA(L8),SHRTDEVA                             S21021 45760042
         MVC   EXPNSDRA(L10),SHRTSDRA                            S21021 45825042
         B     EXPNDRET                                          S21021 45890042
*                                                                S21021 45955042
RESETR2  L     R2,SAVE2                 RESET R2                 S21021 46345042
         BR    R14                                               S21021 46410042
*                                                                S21021 46475042
*                                                                       46540042
*                                                                       46605042
L0       EQU   0                                                        46670042
L1       EQU   1                                                        46735042
L2       EQU   2                                                        46800042
L3       EQU   3                                                        46865042
L4       EQU   4                                                        46930042
L5       EQU   5                                                        46995042
L6       EQU   6                                                 S21021 47060042
L7       EQU   7                                                        47125042
L8       EQU   8                                                        47190042
L9       EQU   9                                                 S21021 47255042
L10      EQU   10                                                       47320042
L12      EQU   12                                                       47385042
L13      EQU   13                                                S21021 47450042
L14      EQU   14                                                S21021 47515042
L16      EQU   16                                                S21021 47580042
L17      EQU   17                                                S21021 47645042
L18      EQU   18                                                S21021 47710042
L20      EQU   20                                                S21021 47775042
L24      EQU   24                                                S21021 47840042
L28      EQU   28                                                S21021 47905042
L32      EQU   32                                                S21021 47970042
L64      EQU   64                                                S21021 48035042
L72      EQU   72                                                S21021 48100042
L104     EQU   104                                               S21021 48165042
HEX20    EQU   X'20'                                             S21021 48230042
SAVE2    DS    F                                                 S21021 48295042
OBRAREA  DS    CL104                                             S21021 48360042
         DS    0H                                                       48425042
HEXFF    DC    X'FFFF'                                                  48490042
HEX00    DC    XL4'00'                                                  48555042
COMMON   SR    R1,R1                                                    48620042
         L     R8,REG8             GET CURRENT PTR                      48685042
         IC    R1,L1(R8)           PICK UP NUMBER OF ITERATIONS         48750042
         LR    R5,R1               PLACE VALUE IN R5                    48815042
         SLL   R5,L2               MULTIPLY BY 2                        48880042
         AR    R5,R3               SET PTR TO POS PAST CTRS HOLDING     48945042
*                                  DATA - SUM COUNTER                   49010042
         LH    R4,HEXFF            PICK UP FULL FLG                     49075042
LOOP1    CH    R4,L0(R3)           IS THIS COUNT EMPTY                  49140042
         BNE   STORE               BR-YES NOT FFFF                      49205042
         CH    R7,L2(R3)           IS DATE EQUAL TO STORED              49270042
         BE    BUMP                YES                                  49335042
         LA    R3,L4(R3)           BUMP DATA PTR                        49400042
         LA    R5,L2(R5)           BUMP SUM PTR                         49465042
         BCT   R1,LOOP1            LOOP TILL DONE                       49530042
         B     RETURN              FULL RETURN                          49595042
STORE    STH   R4,L0(R3)           STORE FFFF FLAG                      49660042
BUMP     LH    R6,L0(R5)                PICK UP COUNTER                 49725042
         STH   R7,L2(R3)           STORE DATA                           49790042
         LA    R6,L1(R6)           BASED ON R5                          49855042
         STH   R6,L0(R5)                                                49920042
*                                                                       49985042
RETURN   LM    R14,R12,L12(R13)    RESTORE REGS                         50050042
         BR    R14                 RETURN                               50115042
*                                                                       50180042
XDEVT    MVC   L0(L4,R3),XDEVT1         MOVE INTO SUM AREA DEVTYPE      50245042
         BR    R14                      RETURN                          50310042
ZEROS    DC    XL6'00'                                                  50375042
ENTRIES  DS    0F                                                       50440042
         SPECIAL    XDATE1,00000000,SPACE=4                             50505042
         SPECIAL    XDEVT,00000000,SPACE=2                              50570042
         SPECIAL    XFAILCCW,00011000,SPACE=72                          50635042
         SPECIAL    SETVOLS,00000000,SPACE=40                           50700042
*                                                 SAVED 2 CNTRS SAVE    50765042
*                                                 CCW & 1 CNTER FOR SUM 50830042
*                                                                       50895042
         SUM        XB0CMDR                                             50960042
         SUM        XB0INTRQ                                            51025042
         SUM        XB0BUSC                                             51090042
         SUM        XB0ECHK                                             51155042
         SUM        XB0DCHK                                             51220042
         SUM        XB0OVRN                                             51285042
         SUM        XB0WRD                                              51350042
         SUM        XB0DTC                                              51415042
         SUM        XB1NOISE                                            51480042
         SUM   XB1STATA                                                 51545042
         SUM   XB1STATB                                                 51610042
         SUM   XB17TRCK                                                 51675042
         SUM   XB1LOADP                                                 51740042
         SUM        XB1WTSTA                                            51805042
         SUM        XB1FLPRT                                            51870042
         SUM        XB1NCOMP                                            51935042
         SUM        XB2TE0                                              52000042
         SUM        XB2TE1                                              52065042
         SUM        XB2TE2                                              52130042
         SUM        XB2TE3                                              52195042
         SUM   XB2TE4                                                   52260042
         SUM        XB2TE5                                              52325042
         SUM   XB2TE6                                                   52390042
         SUM        XB2TE7                                              52455042
         SUM        XB3RUN                                              52520042
         SUM        XB3LRC                                              52585042
         SUM        XB3SKW                                              52650042
         SUM        XB3CRC                                              52715042
         SUM        XB3SKV                                              52780042
         SUM        XB3PDE                                              52845042
         SUM        XB3BKW                                              52910042
         SUM   XB3CCM                                                   52975042
         SUM   XB4ECH                                                   53040042
         SUM   XB4REJ                                                   53105042
         SUM        XB4RDC                                              53170042
         SUM        XB4WRC                                              53235042
         SUM        XB4DLY                                              53300042
         SUM   XB4CSQ                                                   53365042
         SUM        XB4BSQ                                              53430042
         SUM        XB4ASQ                                              53495042
         SUM        XB5BT0                                              53560042
         SUM        XB5BT1                                              53625042
         SUM        XB5BT2                                              53690042
         SUM        XB5BT3                                              53755042
         SUM        XB5BT4                                              53820042
         SUM   XB5BT5                                                   53885042
         SUM   XB5BT6                                                   53950042
         SUM   XB5BT7                                                   54015042
         SPECIAL  SDR1L,0,SPACE=1                                S21021 54080042
         SPECIAL  SDR1R,0,SPACE=1                                S21021 54145042
         SPECIAL  SDR2L,0,SPACE=1                                S21021 54210042
         SPECIAL  SDR2R,0,SPACE=1                                S21021 54275042
         SPECIAL  SDR3L,0,SPACE=1                                S21021 54340042
         SPECIAL  SDR3R,0,SPACE=1                                S21021 54405042
         SPECIAL  SDR4L,0,SPACE=1                                S21021 54470042
         SPECIAL  SDR4R,0,SPACE=1                                S21021 54535042
         SPECIAL  SDR5L,0,SPACE=1                                S21021 54600042
         SPECIAL  SDR5R,0,SPACE=1                                S21021 54665042
         SPECIAL  SDR6L,0,SPACE=1                                S21021 54730042
         SPECIAL  SDR6R,0,SPACE=1                                S21021 54795042
         SPECIAL  SDR7L,0,SPACE=1                                S21021 54860042
         SPECIAL  SDR7R,0,SPACE=1                                S21021 54925042
         SPECIAL  SDR8L,0,SPACE=1                                S21021 54990042
         SPECIAL  SDR8R,0,SPACE=1                                S21021 55055042
         SUM   SHRTSW                                            S21021 55120042
         SPECIAL    RESETR2,0,SPACE=1                            S21021 55185042
         DC    X'FF'                                                    55250042
PEDIT    DS    0F                                                       55315042
&DSECT   SETC  'YYYA'                                                   55380042
&CSECT   SETC  'PEDIT'                                                  55445042
         USING *,R9                                                     55510042
         USING YYYA,R2                                           S20202 55575042
*                                                                       55640042
*              EDIT AND PRINT SECTION                                   55705042
*                                                                       55770042
         DC    A(PENTRY)                ADDRESS OF EDIT ENTRIES         55835042
         DC    CL8'IFCSXXXA'                                            55900042
YR9PTR   DS    F                                                        55965042
YLABELP  DS    F                                                        56030042
*                                                                       56095042
YYYA     DSECT                                                          56160042
         DS    3H                                                       56225042
         DSGEN (YDUMA,16),(YNOREC,16)                                   56290042
         DSGEN (YTYPE,8),(YCHAN,8),(YCUA,24),(YSER,24)                  56355042
         DSGEN (YCPU,16),(YSMSW,16)                                     56420042
         DSGEN (YLOWD,32)               LOW DATE                        56485042
         DSGEN (YHID,32)                HI DATE                         56550042
         DSGEN (YDEVT1,16),(YDEVT2,16)                                  56615042
         DSGEN (YFFF01,16),(YNC01,8),(YCC01,8)                          56680042
         DSGEN (YFFF02,16),(YNC02,8),(YCC02,8)                          56745042
         DSGEN (YFFF03,16),(YNC03,8),(YCC03,8)                          56810042
         DSGEN (YFFF04,16),(YNC04,8),(YCC04,8)                          56875042
         DSGEN (YFFF05,16),(YNC05,8),(YCC05,8)                          56940042
         DSGEN (YFFF06,16),(YNC06,8),(YCC06,8)                          57005042
         DSGEN (YFFF07,16),(YNC07,8),(YCC07,8)                          57070042
         DSGEN (YFFF08,16),(YNC08,8),(YCC08,8)                          57135042
         DSGEN (YFFF09,16),(YNC09,8),(YCC09,8)                          57200042
         DSGEN (YFFF10,16),(YNC10,8),(YCC10,8)                          57265042
         DSGEN (YFFF11,16),(YNC11,8),(YCC11,8)                          57330042
         DSGEN (YFFF12,16),(YNC12,8),(YCC12,8)                          57395042
         DSGEN (YFFF13,16),(YNC13,8),(YCC13,8)                          57460042
         DSGEN (YFFF14,16),(YNC14,8),(YCC14,8)                          57525042
         DSGEN (YFFF15,16),(YNC15,8),(YCC15,8)                          57590042
         DSGEN (YFFF16,16),(YNC16,8),(YCC16,8)                          57655042
         DSGEN (YFFF17,16),(YNC17,8),(YCC17,8)                          57720042
         DSGEN (YFFF18,16),(YNC18,8),(YCC18,8)                          57785042
         DSGEN (YFFF19,16),(YNC19,8),(YCC19,8)                          57850042
         DSGEN (YFFF20,16),(YNC20,8),(YCC20,8)                          57915042
         DSGEN (YFFF21,16),(YNC21,8),(YCC21,8)                          57980042
         DSGEN (YFFF22,16),(YNC22,8),(YCC22,8)                          58045042
         DSGEN (YFFF23,16),(YNC23,8),(YCC23,8)                          58110042
         DSGEN (YFFF24,16),(YNC24,8),(YCC24,8)                          58175042
         DSGEN (YSC01,16),(YSC02,16)                                    58240042
         DSGEN (YSC03,16),(YSC04,16)                                    58305042
         DSGEN (YSC05,16),(YSC06,16)                                    58370042
         DSGEN (YSC07,16),(YSC08,16)                                    58435042
         DSGEN (YSC09,16),(YSC10,16)                                    58500042
         DSGEN (YSC11,16),(YSC12,16)                                    58565042
         DSGEN (YSC13,16),(YSC14,16)                                    58630042
         DSGEN (YSC15,16),(YSC16,16)                                    58695042
         DSGEN (YSC17,16),(YSC18,16)                                    58760042
         DSGEN (YSC19,16),(YSC20,16)                                    58825042
         DSGEN (YSC21,16),(YSC22,16)                                    58890042
         DSGEN (YSC23,16),(YSC24,16)                                    58955042
         DSGEN (YVOL1,48),(YVOL1C,16)                                   59020042
         DSGEN (YVOL2,48),(YVOL2C,16)                                   59085042
         DSGEN (YVOL3,48),(YVOL3C,16)                                   59150042
         DSGEN (YVOL4,48),(YVOL4C,16)                                   59215042
         DSGEN (YVOL5,48),(YVOL5C,16)                                   59280042
         DSGEN (YVOL6,48),(YVOL6C,16)                                   59345042
         DSGEN (YVOL7,48),(YVOL7C,16)                                   59410042
         DSGEN (YVOL8,48),(YVOL8C,16)                                   59475042
         DSGEN (YVOL9,48),(YVOL9C,16)                                   59540042
         DSGEN (YVOLA,48),(YVOLAC,16)                                   59605042
         DSGEN (YB0CMDR,16),(YB0INTV,16),(YB0BOCHK,16),(YB0ECHK,16)     59670042
         DSGEN (YB0DCHK,16),(YB0OVRN,16),(YB0WRD,16),(YB0DTC,16)        59735042
         DSGEN (YB1NOISE,16),(YB1STATA,16)                              59800042
         DSGEN (YB1STATB,16),(YB17TRCK,16)                              59865042
         DSGEN (YB1LOADP,16),(YB1WTSTA,16)                              59930042
         DSGEN (YB1FLPRT,16),(YB1NCOMP,16)                              59995042
         DSGEN (YB2TE0,16),(YB2TE1,16),(YB2TE2,16),(YB2TE3,16)          60060042
         DSGEN (YB2TE4,16),(YB2TE5,16),(YB2TE6,16),(YB2TE7,16)          60125042
         DSGEN (YB3WRN,16),(YB3LRC,16),(YB3SKW,16),(YB3CRC,16)          60190042
         DSGEN (YB3SKV,16),(YB3PED,16),(YB3BKW,16),(YB3CCM,16)          60255042
         DSGEN (YB4ECH,16),(YB4REJ,16),(YB4RDC,16),(YB4WRC,16)          60320042
         DSGEN (YB4DLY,16),(YB4CSQ,16),(YB4BSQ,16),(YB4ASQ,16)          60385042
         DSGEN (YB5BT0,16),(YB5BT1,16),(YB5BT2,16),(YB5BT3,16)          60450042
         DSGEN (YB5BT4,16),(YB5BT5,16),(YB5BT6,16),(YB5BT7,16)          60515042
         DSGEN (YSDR1L,16),(YSDR1R,16)                           S21021 60580042
         DSGEN (YSDR2L,16),(YSDR2R,16)                           S21021 60645042
         DSGEN (YSDR3L,16),(YSDR3R,16)                           S21021 60710042
         DSGEN (YSDR4L,16),(YSDR4R,16)                           S21021 60775042
         DSGEN (YSDR5L,16),(YSDR5R,16)                           S21021 60840042
         DSGEN (YSDR6L,16),(YSDR6R,16)                           S21021 60905042
         DSGEN (YSDR7L,16),(YSDR7R,16)                           S21021 60970042
         DSGEN (YSDR8L,16),(YSDR8R,16)                           S21021 61035042
         DSGEN (YSHRT,16),(YDUM1,16)                             S21021 61100042
IFCSXXXA CSECT                                                          61165042
*                                                                       61230042
*        SPECIAL ROUTINE SECTION                                        61295042
SETST1   STM   R5,R8,XSAVE              SAVE                     S20202 61360042
         CLC   L0(L2,R4),H3211          TEST FOR 3211            S20202 61425042
         BNE   IS3540                                          @Y30OPDP 61490042
         LA    R5,SENS3211              POINT AT SENSE LABELS    S21021 61555042
         ST    R5,YLABELP                                        S20202 61620042
         B     RETURNA                                           S20202 61685042
IS3540   CLC   L0(L2,R4),H3540                                 @Y30OPDP 61695042
         BNE   RETURNA                                         @Y30OPDP 61705042
         LA    R5,SENS3540                                     @Y30OPDP 61715042
         ST    R5,YLABELP                                      @Y30OPDP 61725042
         B     RETURNA                                         @Y30OPDP 61735042
*                                                                S20202 61750042
*                                                                       61815042
SETVOL   MVC   L0(L6,R3),L0(R4)         MOV VOL LABEL TO LINE           61880042
         BR    R14                                                      61945042
CHKVOL   CLC   L0(L6,R4),YZERO          IS COUNTER IN USE               62010042
         BCR   L7,R14                   BR YES                          62075042
         SR    R15,R15                  DON'T PRINT LINE         S21021 62140042
         BR    R14                      RETURN                   S21021 62205042
CONVERT  STM   R5,R8,XSAVE              SAVE REGS                       62270042
         LH    R5,L0(R4)                PICK UP COUNT                   62335042
CONV1    CVD   R5,WORK                  CONVERT IT TO DEVIMALP          62400042
         UNPK  L0(L4,R3),WORK+L5(L3)    UNPACK IT      XA02745/YA02991  62465042
         MVZ   L3(L1,R3),L0(R3)         MOVE ZONE      XA02745/YA02991  62525042
RETURNA  LM    R5,R8,XSAVE              RESTORE REGS                    62595042
         BR    R14                                                      62660042
*                                                                       62725042
SKIPPER  BR    R14                      RETURN                          62790042
*                                                                       62855042
SETDATE  UNPK  WORK(L8),L0(L4,R4)       PACK DATE                       62920042
         MVZ   WORK+L7(L1),WORK         MOVE ON ZONE                    62985042
         MVC   L0(L3,R3),WORK+L5        MOVE DATE TO PRINT LINE         63050042
         MVC   L5(L2,R3),WORK+L3        MOVE YEAR TO PRINT LINE         63115042
         BR    R14                                                      63180042
*                                                                       63245042
CONVCC1  CLC   L0(L2,R4),HEXFFFF        IS THIS COUNTER EMPYT           63310042
         BCR   L8,R14                   NO TI IS FULL                   63375042
         SR    R15,R15                  STOP LINE PRINTING              63440042
         BR    R14                      RETURN                          63505042
*                                                                       63570042
*        FREEE COUNTERS AREA LAST THING DONE                            63635042
*                                                                       63700042
FREECTR  STM   R14,R12,L12(R13)         SAVE ALL REGS                   63765042
         LR    R12,R13                  SAVE SAVE AREA ADDR             63830042
         LA    R13,FSAVE                POINT TO MY SAVE                63895042
         ST    R12,L4(R13)              SET CHAINING POINTERS           63960042
         ST    R13,L8(R12)                                              64025042
         L     R3,L4(R2)                PICK UP POINTER TO NEXT COUNTER 64090042
         ST    R3,L28(R12)              SAVE POINTER IN REG SAVE        64155042
         LH    R0,SIZE                  PICK UP SIZE OF AREA            64220042
         LR    R1,R2                    SET ADDRESS                     64285042
         FREEMAIN R,LV=(0),A=(1)                                        64350042
         LTR   R3,R3                    ANY MORE COUNTERS               64415042
         BZ    RETURN0                  NO  RETURN                      64480042
         LA    R5,PENTRY+L10            POINT TO TOP ENTRY - 4          64545042
         ST    R5,YR9PTR                                                64610042
         LA    R5,LABELS-L1               POINT TO FIRST LABEL - 1      64675042
         ST    R5,YLABELP               STORE IT IN TABLE               64740042
RETURN0  L    R13,L4(R13)               PICK UP &                       64805042
         LM    R14,R12,L12(R13)         RESTOR E REGS                   64870042
         BR    R14                                                      64935042
SETDEV   STM   R5,R8,XSAVE              SAVE REGS                S21021 65000042
         LA    R6,DEVTABLE                                       S20202 65065042
         LA    R5,3                LOOP CNT                    @XA15970 65130001
SETDEVT  CLC   L0(L2,R4),L0(R6)                                  S20202 65195042
         BE    SDEVFND                                           S20202 65260042
         LA    R6,L6(R6)                                         S20202 65325042
         BCT   R5,SETDEVT                                        S20202 65390042
         B     RETURNA                                           S20202 65520042
SDEVFND  MVC   L0(L4,R3),L2(R6)                                  S20202 65585042
         B     RETURNA                                           S20202 65650042
XFF      EQU   X'FF'                                             S21021 65715042
SETCPUNO STM   R5,R8,XSAVE              SAVE REGS                S21021 65780042
         SR    R5,R5                    CLEAAR R5                S21021 65845042
         IC    R5,0(R4)                 PICK UP                  S21021 65910042
         SLL   R5,R8                      CPU TYPE               S21021 65975042
         IC    R5,L1(R4)                    FIELD                S21021 66040042
         LTR   R5,R5                    IS TI ZERO?              S21021 66105042
         BNZ   RETURNA                  NO, LINE IS GOOD, RETURN S21021 66170042
         LA    R6,L64                   ELSE, BACK UP DATA PTR   S21021 66235042
         SR    R3,R6                    TO PUT IN NEW INFO       S21021 66300042
         MVC   0(L6,R3),SHARED          SAY MODEL SHARED       @Z427VLS 66365042
         B     RETURNA                  RETURN                   S21021 66495042
*                                                                S21021 66560042
NOSUM    STM   R5,R8,XSAVE         SAVE REGS                   @XA15970 66564001
         CLC   L0(L2,R4),H3203     IS DEVICE A 3203            @XA15970 66568001
         BE    RETURNA                                         @XA15970 66572001
         LA    R5,NEXLINE-4        POINT TO NEXT LINE          @XA15970 66576001
         LA    R6,NEXLAB           POINT TO NEXT LABEL         @XA15970 66580001
REPOINT  ST    R5,YR9PTR           REPOINT LINE                @XA15970 66584001
         ST    R6,YLABELP          REPOINT LABEL               @XA15970 66588001
         SR    R15,R15             SKIP THIS LINE              @XA15970 66592001
         B     RETURNA                                         @XA15970 66596001
TABEND   STM   R5,R8,XSAVE         SAVE REGS                   @XA15970 66600001
         LA    R5,FREELIN-4        POINT TO FREEMAIN ROUTINE   @XA15970 66604001
         LA    R6,FREELAB          DONE                        @XA15970 66608001
         B     REPOINT             REPOINT LINE/LABEL          @XA15970 66612001
SETSTAT  DS    0H                                                S21021 66625042
         STM   R5,R8,XSAVE              SAVE REGS                S21021 66690042
         LA    R5,STATSECT-4            PNT TO EDITS FOR STATS   S21021 66755042
         ST    R5,YR9PTR                LET EREP KNOW            S21021 66820042
         LA    R5,STATLABS+1            PNTR FOR STAT LABELS     S21021 66885042
         ST    R5,YLABELP               SET FOR EREP             S21021 66950042
         LA    R5,L17(R5)               BUMP PAST FIRST LABEL    S21021 67015042
         LA    R6,L3            NUMBER OF ENTRIES              @XA15970 67080001
         LA    R8,STLBLIST              POINT TO FIRST LABEL ENTRS21021 67145042
STLBCOMP CLC   0(L2,R4),0(R8)           IS THIS THE DEVICE TYPE  S21021 67210042
         BE    STLBLTFD                 YES, GO MOVE LABELS      S21021 67275042
         LA    R8,L18(R8)               NO, BUMP TO NEXT         S21021 67340042
         BCT   R6,STLBCOMP              NOT DONE, GO BACK        S21021 67405042
         LA    R8,STLBDFLT              DONE, USE DEFAULT        S21021 67470042
STLBLTFD DS    0H                  LABELS FOUND                  S21021 67535042
         LA    R8,L2(R8)                USE LABELS               S21021 67600042
         LA    R7,L16(R8)               DETERMINE END POINT      S21021 67665042
         ST    R7,STLBLEND              SAVE FOR COMPARE         S21021 67730042
STLABLP  DS    0H                                                S21021 67795042
         CLI   0(R8),XFF                IS THIS 'NOT USED'       S21021 67860042
         BE    STLBLNUS                 YES, LABEL = 'NOT USED'  S21021 67925042
         SR    R7,R7                    CLEAR R7                 S21021 67990042
         IC    R7,0(R8)                 GET INDEX TO LABEL       S21021 68055042
         MH    R7,HW13                  MULTIPLY TO GET LABEL    S21021 68120042
         A     R7,STLBTBAD              SET TO LABEL             S21021 68185042
         MVC   L0(L13,R5),L0(R7)        MOVE IN LABEL            S21021 68250042
         B     STLBL001                                          S21021 68315042
STLBLNUS DS    0H                                                S21021 68380042
         MVC   L0(L13,R5),STLBNTUS      'NOT USED' LABEL         S21021 68445042
STLBL001 DS    0H                                                S21021 68510042
         LA    R5,L14(R5)               BUMP R5                  S21021 68575042
         LA    R7,STLBTABL              GET PROPER LABEL         S21021 68640042
         LA    R8,L1(R8)                POINT TO NEXT INDEX      S21021 68705042
         C     R8,STLBLEND              AT END OF LIST?          S21021 68770042
         BNE   STLABLP                  NO, CONTINUE             S21021 68835042
         B     RETURNA                                           S21021 68900042
*                                                                S21021 68965042
STLBNTUS DC    C'NOT USED     '                                  S21021 69030042
STLBLIST DS    0C                                                S21021 69095042
         DC    X'8001'                                           S21021 69160042
         DC    X'000102030405060708090A0B0C0D0E0F' 2400 STAT LABES21021 69225042
         DC    X'0844'                                         @Y30OPDP 69245042
         DC    X'FFFFFF1EFF1718191A1B1C1DFFFFFF0F' 3540 STAT LABE       69265042
STLBDFLT DS    0C                                                S21021 69290042
         DC    X'0809'                                           S21021 69355042
         DC    X'0001FF03041011FF12131415FF16FF0F' 3211 STAT LABES21021 69420042
STLBTBAD DC    A(STLBTABL)                                       S21021 69485042
STLBTABL DS    0C                                                S21021 69550042
         DC    C'TEMPY READS  '         00                       S21021 69615042
         DC    C'TEMPY WRITES '         01                       S21021 69680042
         DC    C'INTRVN REQD  '         02                       S21021 69745042
         DC    C'BUS OUT CHK  '         03                       S21021 69810042
         DC    C'EQUIP CHK    '         04                       S21021 69875042
         DC    C'OVERRUN      '         05                       S21021 69940042
         DC    C'WD CT 0      '         06                       S21021 70005042
         DC    C'DATA CONV CHK'         07                       S21021 70070042
         DC    C'R/W VRC      '         08                       S21021 70135042
         DC    C'LRCR         '         09                       S21021 70200042
         DC    C'SKEW         '         0A                       S21021 70265042
         DC    C'CRC          '         0B                       S21021 70330042
         DC    C'SKEW REG VRC '         0C                       S21021 70395042
         DC    C'NOISE        '         0D                       S21021 70460042
         DC    C'RD OPP RECVY '         0E                       S21021 70525042
         DC    C'CHAN DATA CHK'         0F                       S21021 70590042
         DC    C'BUFF PTY CHK '         10                       S21021 70655042
         DC    C'LOAD CHECK   '         11                       S21021 70720042
         DC    C'CMND RETRY   '         12                       S21021 70785042
         DC    C'PRINT CHECK  '         13                       S21021 70850042
         DC    C'PRNT QUALITY '         14                       S21021 70915042
         DC    C'LINE POS     '         15                       S21021 70980042
         DC    C'CMND SUPPRESS'         16                       S21021 71045042
         DC    C'NRF CRC ERR  '               17               @Y30OPDP 71052042
         DC    C'NRF NO CRC ER'               18               @Y30OPDP 71059042
         DC    C'FAST/SLO INDX'               19               @Y30OPDP 71066042
         DC    C'ADR MARK FAIL'               1A               @Y30OPDP 71073042
         DC    C'DATA AM INCOR'               1B               @Y30OPDP 71080042
         DC    C'DATA CRC ERR '               1C               @Y30OPDP 71087042
         DC    C'CTRL U OVRRUN'               1D               @Y30OPDP 71094042
         DC    C'BUS OUT CHECK'               1E               @Y30OPDP 71101042
STLBLEND DC    F'0'                                              S21021 71110042
HW13     DC    H'13'                                             S21021 71175042
SHARED   DC    C'SHARED'                                       @Z427VLS 71305042
DEVTABLE DC    X'0809'                                           S20202 71370042
         DC           C'3211'                                    S20202 71435042
         DC    X'8001'                                           S20202 71500042
         DC           C'2400'                                    S20202 71565042
H3203    DC    X'080B'                                         @XA15970 71570001
         DC    C'3203'                                         @XA15970 71575001
FREELAB  DC    C' *$$$$$$'                                     @XA15970 71580001
H3540    DC    X'0844'                                         @Y30OPDP 71585042
         DC           C'3540'                                  @Y30OPDP 71605042
H3211    DC    X'0809'                                           S20202 71630042
DEVCODE  DC    X'8001'                                           S20202 71695042
*                                                                       71760042
SENS3211 DC    C'CMND REJ*CMD RETRY*CAR F MOV*UCB PRTY*'                71825042
         DC    C'XTRA SCAN*BIT 0$'                                      71890042
         DC    C'INTV REQ*PRT CHECK*CAR SQ CK*PLB PRTY*'                71955042
         DC    C'PRT TRIG *BIT 1$'                                      72020042
         DC    C'BUS O CK*PRT QLTY *CAR SP CK*FCB PRTY*'                72085042
         DC    C'BLK PRINT*BIT 2$'                                      72150042
         DC    C'EQUIP CK*LINE POS *PLT F ADV*COIL PRO*'                72215042
         DC    C'PLAT INLK*BIT 3$'                                      72280042
         DC    C'DATA CHK*FRM CHECK*PLT F RET*H FIR CK*'                72345042
         DC    C'CAR GO   *BIT 4$'                                      72410042
         DC    C'B PAR CK*CMND SUPP*FORMS JAM*SERV AID*'         PT1403 72475042
         DC    C'CAR SETTL*BIT 5$'                                      72540042
         DC    C'LD CHECK*MECH MOTN*RIB MOT  *UCSAR S C*'               72605042
         DC    C'CAR COMPR*BIT 6$'                                      72670042
         DC    C'CHAN 9  *UNASSIGN*TRN OVLD *PSE S CHK*'                72735042
         DC    C'FWD DRIVE*BIT 7$'                                      72800042
         DC    C'$$$$$$'                                                72865042
*                                                                       72930042
SENS3540 DC    C'CMND REJ*PERM ERR*  FLAGS        *  CC           *'    72933042
         DC    C'   HH          *   R           $'             @Y30OPDP 72936042
         DC    C'INV REQ*AUTO RETRY*               *               *'   72939042
         DC    C'               *               $'             @Y30OPDP 72942042
         DC    C'BUS O CHK*MOT. MAL*               *               *'   72945042
         DC    C'               *               $'             @Y30OPDP 72948042
         DC    C'EQP CK*RETRY/IR*               *               *'      72951042
         DC    C'               *               $'             @Y30OPDP 72954042
         DC    C'DATA CK*SREC XFR*               *               *'     72957042
         DC    C'               *               $'             @Y30OPDP 72960042
         DC    C'NOT USED*NOT USED*               *               *'    72963042
         DC    C'               *               $'             @Y30OPDP 72966042
         DC    C'NOT USED*NOT USED*               *               *'    72969042
         DC    C'               *               $'             @Y30OPDP 72972042
         DC    C'NOT USED*NOT USED*               *               *'    72975042
         DC    C'               *               $'             @Y30OPDP 72978042
         DC    C'$$$$$$'                                       @Y30OPDP 72981042
*                                                              @Y30OPDP 72984042
HEX02    EQU   X'02'                                                    72995042
*                                                                       73060042
WORK     DS    D                                                        73125042
XSAVE    DS    4F                                                       73190042
FSAVE    DS    18F                                                      73255042
SIZE     DC    H'402'                   NO OF BYTES TO BE FREED  S21021 73320042
HEXFFFF  DC    X'FFFF'                                                  73385042
YZERO    DC    XL6'00'                                                  73450042
PENTRY   DS    0F                                                       73515042
         DC    X'00010001'                                              73580042
         DC    X'00010001'                                              73645042
         DC    A(LABELS)                                                73710042
         DC    H'0'                                                     73775042
*                                                                       73840042
         DC    X'01'                                                    73905042
         DC    X'000B8B00'                                              73970042
         LABEL      ' '                                                 74035042
         LINE  (57,32),(23,26)                                   S21021 74100042
         HEX   YCPU,0,2B                                         S21021 74165042
         HEX   YSER,0,3B                                         S21021 74230042
         ROUTINE  YCPU,SETCPUNO                                  S21021 74295042
         LABEL 'DAY YEAR   DAY YEAR','MODEL-','SERIAL NO.'       S21021 74360042
         LINE       (23,11),(1,30)                                      74425042
         ROUTINE    YLOWD,SETDATE                                       74490042
         ROUTINE    YHID,SETDATE                                        74555042
         LABEL      'OUTBOARD DATE RANGE -','TO'                        74620042
*                                                                       74685042
         LINE       (61,16),(1,62)                                      74750042
         HEX        YCUA                                                74815042
         ROUTINE    YDEVT2,SETDEV       GO DETERMINE DEVICE TYPE S20202 74880042
         LABEL 'SUMMARY OF I/O OUTBOARD ENVIRONMENT RECORDS FOR DEVICE'C74945042
               ,'DEVICE TYPE'                                    S20202 75010042
*                                                                       75075042
         LINE  (29,),,SKIP=1                                     S21021 75140042
         ROUTINE    YNOREC,CONVERT                                      75205042
         LABEL      'TOTAL NUMBER OF RECORDS'                           75270042
         LINE  ,,SKIP=2                                          S21021 75335042
         ROUTINE  YSHRT,CONVERT                                  S21021 75400042
         LABEL 'TOTAL OF OVERFLOW RECORDS'                       S21021 75465042
         LINE  ,,SKIP=1                                        @XA21033 75474001
         ROUTINE YDEVT2,NOSUM                                  @XA15970 75483001
         LABEL 'NO SUMMARY REPORT PROVIDED FOR D/T 3203'       @XA21033 75492001
         LINE  ,,SKIP=2                                        @XA21033 75495001
         LABEL 'DETAIL EDIT REQUIRED TO FORMAT ERROR RECORDS'  @XA21033 75498001
         LINE                                                  @XA15970 75501001
         ROUTINE YDEVT2,TABEND                                 @XA15970 75510001
         LABEL ' '                                             @XA15970 75519001
*                                                                       75530042
NEXLINE  LINE  ,(1,1)                                          @XA15970 75595001
         ROUTINE    YDUM1,SKIPPER                                       75660042
NEXLAB   LABEL 'CCW COMMAND CODES ENCOUNTERED(MAXIMUM OF 24)'  @XA15970 75725001
*                                                                       75790042
         LINE       ,(3,6),SKIP=1                                       75855042
         ROUTINE    YDUM1,SKIPPER                                       75920042
         LABEL      'CMND','TOTAL'                                      75985042
         LINE       (4,6),(1,1)                                         76050042
         HEX        YCC01                                               76115042
         ROUTINE    YSC01,CONVERT                                       76180042
         ROUTINE    YFFF01,CONVCC1                                      76245042
         LABEL      ' '                                                 76310042
         LINE                                                           76375042
         HEX        YCC02                                               76440042
         ROUTINE    YSC02,CONVERT                                       76505042
         ROUTINE    YFFF02,CONVCC1                                      76570042
         LABEL      ' '                                                 76635042
         LINE                                                           76700042
         HEX        YCC03                                               76765042
         ROUTINE    YSC03,CONVERT                                       76830042
         ROUTINE    YFFF03,CONVCC1                                      76895042
         LABEL      ' '                                                 76960042
         LINE                                                           77025042
         HEX        YCC04                                               77090042
         ROUTINE    YSC04,CONVERT                                       77155042
         ROUTINE    YFFF04,CONVCC1                                      77220042
         LABEL      ' '                                                 77285042
         LINE                                                           77350042
         HEX        YCC05                                               77415042
         ROUTINE    YSC05,CONVERT                                       77480042
         ROUTINE    YFFF05,CONVCC1                                      77545042
         LABEL      ' '                                                 77610042
         LINE                                                           77675042
         HEX        YCC06                                               77740042
         ROUTINE    YSC06,CONVERT                                       77805042
         ROUTINE    YFFF06,CONVCC1                                      77870042
         LABEL      ' '                                                 77935042
         LINE                                                           78000042
         HEX        YCC07                                               78065042
         ROUTINE    YSC07,CONVERT                                       78130042
         ROUTINE    YFFF07,CONVCC1                                      78195042
         LABEL      ' '                                                 78260042
         LINE                                                           78325042
         HEX        YCC08                                               78390042
         ROUTINE    YSC08,CONVERT                                       78455042
         ROUTINE    YFFF08,CONVCC1                                      78520042
         LABEL      ' '                                                 78585042
         LINE                                                           78650042
         HEX        YCC09                                               78715042
         ROUTINE    YSC09,CONVERT                                       78780042
         ROUTINE    YFFF09,CONVCC1                                      78845042
         LABEL      ' '                                                 78910042
         LINE                                                           78975042
         HEX        YCC10                                               79040042
         ROUTINE    YSC10,CONVERT                                       79105042
         ROUTINE    YFFF10,CONVCC1                                      79170042
         LABEL      ' '                                                 79235042
         LINE                                                           79300042
         HEX        YCC11                                               79365042
         ROUTINE    YSC11,CONVERT                                       79430042
         ROUTINE    YFFF11,CONVCC1                                      79495042
         LABEL      ' '                                                 79560042
         LINE                                                           79625042
         HEX        YCC12                                               79690042
         ROUTINE    YSC12,CONVERT                                       79755042
         ROUTINE    YFFF12,CONVCC1                                      79820042
         LABEL      ' '                                                 79885042
         LINE                                                           79950042
         HEX        YCC13                                               80015042
         ROUTINE    YSC13,CONVERT                                       80080042
         ROUTINE    YFFF13,CONVCC1                                      80145042
         LABEL      ' '                                                 80210042
         LINE                                                           80275042
         HEX        YCC14                                               80340042
         ROUTINE    YSC14,CONVERT                                       80405042
         ROUTINE    YFFF14,CONVCC1                                      80470042
         LABEL      ' '                                                 80535042
         LINE                                                           80600042
         HEX        YCC15                                               80665042
         ROUTINE    YSC15,CONVERT                                       80730042
         ROUTINE    YFFF15,CONVCC1                                      80795042
         LABEL      ' '                                                 80860042
         LINE                                                           80925042
         HEX        YCC16                                               80990042
         ROUTINE    YSC16,CONVERT                                       81055042
         ROUTINE    YFFF16,CONVCC1                                      81120042
         LABEL      ' '                                                 81185042
         LINE                                                           81250042
         HEX        YCC17                                               81315042
         ROUTINE    YSC17,CONVERT                                       81380042
         ROUTINE    YFFF17,CONVCC1                                      81445042
         LABEL      ' '                                                 81510042
         LINE                                                           81575042
         HEX        YCC18                                               81640042
         ROUTINE    YSC18,CONVERT                                       81705042
         ROUTINE    YFFF18,CONVCC1                                      81770042
         LABEL      ' '                                                 81835042
         LINE                                                           81900042
         HEX        YCC19                                               81965042
         ROUTINE    YSC19,CONVERT                                       82030042
         ROUTINE    YFFF19,CONVCC1                                      82095042
         LABEL      ' '                                                 82160042
         LINE                                                           82225042
         HEX        YCC20                                               82290042
         ROUTINE    YSC20,CONVERT                                       82355042
         ROUTINE    YFFF20,CONVCC1                                      82420042
         LABEL      ' '                                                 82485042
         LINE                                                           82550042
         HEX        YCC21                                               82615042
         ROUTINE    YSC21,CONVERT                                       82680042
         ROUTINE    YFFF21,CONVCC1                                      82745042
         LABEL      ' '                                                 82810042
         LINE                                                           82875042
         HEX        YCC22                                               82940042
         ROUTINE    YSC22,CONVERT                                       83005042
         ROUTINE    YFFF22,CONVCC1                                      83070042
         LABEL      ' '                                                 83135042
         LINE                                                           83200042
         HEX        YCC23                                               83265042
         ROUTINE    YSC23,CONVERT                                       83330042
         ROUTINE    YFFF23,CONVCC1                                      83395042
         LABEL      ' '                                                 83460042
         LINE       ,,SKIP=1                                            83525042
         HEX        YCC24                                               83590042
         ROUTINE    YSC24,CONVERT                                       83655042
         ROUTINE    YFFF24,CONVCC1                                      83720042
         LABEL      ' '                                                 83785042
         LINE       (12,12),(1,1),SKIP=1                                83850042
         LABEL ''                                                S21021 83915042
         LINE                                                    S21021 83980042
         ROUTINE    YDUM1,SKIPPER                                       84045042
         LABEL      'VOLUME LABELS ENCOUNTERED (MAXIMUM OF 10)'         84110042
         LINE                                                           84175042
         ROUTINE    YVOL1,SETVOL                                        84240042
         ROUTINE    YVOL1C,CONVERT                                      84305042
         LABEL      'VOL. LABEL'                                        84370042
         ROUTINE    YVOL1,CHKVOL                                        84435042
         LINE                                                           84500042
         ROUTINE    YVOL2,SETVOL                                        84565042
         ROUTINE    YVOL2C,CONVERT                                      84630042
         ROUTINE    YVOL2,CHKVOL                                        84695042
         LABEL      ' '                                                 84760042
         LINE                                                           84825042
         ROUTINE    YVOL3,SETVOL                                        84890042
         ROUTINE    YVOL3C,CONVERT                                      84955042
         ROUTINE    YVOL3,CHKVOL                                        85020042
         LABEL      ' '                                                 85085042
         LINE                                                           85150042
         ROUTINE    YVOL4,SETVOL                                        85215042
         ROUTINE    YVOL4C,CONVERT                                      85280042
         ROUTINE    YVOL4,CHKVOL                                        85345042
         LABEL      ' '                                                 85410042
         LINE                                                           85475042
         ROUTINE    YVOL5,SETVOL                                        85540042
         ROUTINE    YVOL5C,CONVERT                                      85605042
         ROUTINE    YVOL5,CHKVOL                                        85670042
         LABEL      ' '                                                 85735042
         LINE                                                           85800042
         ROUTINE    YVOL6,SETVOL                                        85865042
         ROUTINE    YVOL6C,CONVERT                                      85930042
         ROUTINE    YVOL6,CHKVOL                                        85995042
         LABEL      ' '                                                 86060042
         LINE                                                           86125042
         ROUTINE    YVOL7,SETVOL                                        86190042
         ROUTINE    YVOL7C,CONVERT                                      86255042
         ROUTINE    YVOL7,CHKVOL                                        86320042
         LABEL      ' '                                                 86385042
         LINE                                                           86450042
         ROUTINE    YVOL8,SETVOL                                        86515042
         ROUTINE    YVOL8C,CONVERT                                      86580042
         ROUTINE    YVOL8,CHKVOL                                        86645042
         LABEL      ' '                                                 86710042
         LINE                                                           86775042
         ROUTINE    YVOL9,SETVOL                                        86840042
         ROUTINE    YVOL9C,CONVERT                                      86905042
         ROUTINE    YVOL9,CHKVOL                                        86970042
         LABEL      ' '                                                 87035042
         LINE       ,,SKIP=2                                            87100042
         ROUTINE    YVOLA,SETVOL                                        87165042
         ROUTINE    YVOLAC,CONVERT                                      87230042
         ROUTINE    YVOLA,CHKVOL                                        87295042
         LABEL      ' '                                                 87360042
         LINE                                                           87425042
         LABEL ''                                                S21021 87490042
         LINE                                                    S21021 87555042
         LABEL      'SENSE BYTE SUMMARY'                                87620042
         LINE      (12,19),(1,19)                                       87685042
         LABEL 'BYTE 0','BYTE 1','BYTE 2','BYTE 3','BYTE 4','BYTE 5'    87750042
         LINE       (12,19),(1,19),SKIP=1                               87815042
         ROUTINE    YB0CMDR,CONVERT                                     87880042
         ROUTINE    YB1NOISE,CONVERT                                    87945042
         ROUTINE    YB2TE0,CONVERT                                      88010042
         ROUTINE    YB3WRN,CONVERT                                      88075042
         ROUTINE    YB4ECH,CONVERT                                      88140042
         ROUTINE    YB5BT0,CONVERT                                      88205042
         ROUTINE    YDEVT2,SETST1                                S20202 88270042
         LABEL 'CMNP REJ','NOISE','TRK ERR 0','R/W VRC','ECHO ERR',    C88335042
               'BIT 0'                                                  88400042
*                                                                       88465042
         LINE                                                           88530042
         ROUTINE    YB0INTV,CONVERT                                     88595042
         ROUTINE    YB1STATA,CONVERT                                    88660042
         ROUTINE    YB2TE1,CONVERT                                      88725042
         ROUTINE    YB3LRC,CONVERT                                      88790042
         ROUTINE    YB4REJ,CONVERT                                      88855042
         ROUTINE    YB5BT1,CONVERT                                      88920042
         LABEL 'INTV REQD','TU STAT A','TRK ERR 1','LRCR','REJECT TU', *88985042
               'BIT 1'                                                  89050042
         LINE                                                           89115042
         ROUTINE    YB0BOCHK,CONVERT                                    89180042
         ROUTINE    YB1STATB,CONVERT                                    89245042
         ROUTINE    YB2TE2,CONVERT                                      89310042
         ROUTINE    YB3SKW,CONVERT                                      89375042
         ROUTINE    YB4RDC,CONVERT                                      89440042
         ROUTINE    YB5BT2,CONVERT                                      89505042
         LABEL 'BUS O CHK','TU STAT B','TRK ERR 2','SKEW','READ CLCK', C89570042
               'BIT 2'                                                  89635042
         LINE                                                           89700042
         ROUTINE    YB0ECHK,CONVERT                                     89765042
         ROUTINE    YB17TRCK,CONVERT                                    89830042
         ROUTINE    YB2TE3,CONVERT                                      89895042
         ROUTINE    YB3CRC,CONVERT                                      89960042
         ROUTINE    YB4WRC,CONVERT                                      90025042
         ROUTINE    YB5BT3,CONVERT                                      90090042
         LABEL 'EQUIP CHK','7 TRACK','TRK ERR 3','CRC/DT CH','WRITE CLCC90155042
               ','BIT 3'                                                90220042
         LINE                                                           90285042
         ROUTINE    YB0DCHK,CONVERT                                     90350042
         ROUTINE    YB1LOADP,CONVERT                                    90415042
         ROUTINE    YB2TE4,CONVERT                                      90480042
         ROUTINE    YB3SKV,CONVERT                                      90545042
         ROUTINE    YB4DLY,CONVERT                                      90610042
         ROUTINE    YB5BT4,CONVERT                                      90675042
         LABEL 'DATA CHK','LOAD PT','TRK ERR 4','SKEW VRC',     XA00641C90740042
               'ST RD CHK','BIT 4'                              XA00641 90800042
         LINE                                                           90870042
         ROUTINE    YB0OVRN,CONVERT                                     90935042
         ROUTINE    YB1WTSTA,CONVERT                                    91000042
         ROUTINE    YB2TE5,CONVERT                                      91065042
         ROUTINE    YB3PED,CONVERT                                      91130042
         ROUTINE    YB4CSQ,CONVERT                                      91195042
         ROUTINE    YB5BT5,CONVERT                                      91260042
         LABEL 'OVERRUN','WRITE STA','TRK ERR 5','PE DRIVE','C SEQUENC'C91325042
               ,'BIT 5'                                                 91390042
         LINE                                                           91455042
         ROUTINE    YB0WRD,CONVERT                                      91520042
         ROUTINE    YB1FLPRT,CONVERT                                    91585042
         ROUTINE    YB2TE6,CONVERT                                      91650042
         ROUTINE    YB3BKW,CONVERT                                      91715042
         ROUTINE    YB4BSQ,CONVERT                                      91780042
         ROUTINE    YB5BT6,CONVERT                                      91845042
         LABEL 'WTD CNT 0','FL PROT','TRK ERR 6','BACKWARD','B SEQUENC'C91910042
               ,'BIT 6'                                                 91975042
         LINE  ,,SKIP=2                                          S21021 92040042
         ROUTINE    YB0DTC,CONVERT                                      92105042
         ROUTINE    YB1NCOMP,CONVERT                                    92170042
         ROUTINE    YB2TE7,CONVERT                                      92235042
         ROUTINE    YB3CCM,CONVERT                                      92300042
         ROUTINE    YB4ASQ,CONVERT                                      92365042
         ROUTINE    YB5BT7,CONVERT                                      92430042
         LABEL 'DT CNVRT','NOT COMP','TRK ERR 7','C COMPARE','A-SEQUENCC92495042
               ','BIT 7'                                                92560042
         LINE                                                           92625042
         ROUTINE  YDEVT2,SETSTAT        GO SET STAT LABELS       S21021 92690042
STATLABS LABEL ''                                                S21021 92755042
         LABEL      'STATISTICAL DATA'                           S21021 92820042
STATSECT DS    0C                                                S21021 92885042
         LINE  (20,30),(1,30),SKIP=1                             S21021 92950042
         ROUTINE    YSDR1L,CONVERT                               S21021 93015042
         ROUTINE    YSDR1R,CONVERT                               S21021 93080042
         LABEL '             ','             '                   S21021 93145042
         LINE                                                    S21021 93210042
         ROUTINE    YSDR2L,CONVERT                               S21021 93275042
         ROUTINE    YSDR2R,CONVERT                               S21021 93340042
         LABEL '             ','             '                   S21021 93405042
         LINE                                                    S21021 93470042
         ROUTINE    YSDR3L,CONVERT                               S21021 93535042
         ROUTINE    YSDR3R,CONVERT                               S21021 93600042
         LABEL '             ','             '                   S21021 93665042
         LINE                                                    S21021 93730042
         ROUTINE    YSDR4L,CONVERT                               S21021 93795042
         ROUTINE    YSDR4R,CONVERT                               S21021 93860042
         LABEL '             ','             '                   S21021 93925042
         LINE                                                    S21021 93990042
         ROUTINE    YSDR5L,CONVERT                               S21021 94055042
         ROUTINE    YSDR5R,CONVERT                               S21021 94120042
         LABEL '             ','             '                   S21021 94185042
         LINE                                                    S21021 94250042
         ROUTINE    YSDR6L,CONVERT                               S21021 94315042
         ROUTINE    YSDR6R,CONVERT                               S21021 94380042
         LABEL '             ','             '                   S21021 94445042
         LINE                                                    S21021 94510042
         ROUTINE    YSDR7L,CONVERT                               S21021 94575042
         ROUTINE    YSDR7R,CONVERT                               S21021 94640042
         LABEL '             ','             '                   S21021 94705042
         LINE                                                    S21021 94770042
         ROUTINE    YSDR8L,CONVERT                               S21021 94835042
         ROUTINE    YSDR8R,CONVERT                               S21021 94900042
         LABEL '             ','             '                   S21021 94965042
FREELIN  LINE                                                  @XA15970 94985001
         LABEL ' '                                             @XA15970 95005001
         LINE                                                    S21021 95030042
         ROUTINE    YDUM1,FREECTR                                       95095042
         LABEL      ' '                                                 95160042
         DC    X'FF'                                                    95225042
         DC    XL6'00'                                                  95290042
         DC    C'$'                                                     95355042
LABELS   EQU   *                                                        95420042
         LSTART                                                         95485042
         END                                                            95550042
