*** THIS MODULE APPLICABLE FOR VS1 W/ SU01, MVS W/ SU27 AND AS SVS ICR  00050002
*** THIS MODULE SUPPORTS 3895 DEVICE --- SUPPORT CODE = G30HIMD         00100002
         MACRO                                                          00150002
         BIN   ,                                                        00200002
.*                                 &SYSLIST(&OP,1) - NAME OF LOG ITEM   00250002
.*                                      RECORD DSECT                    00300002
.*                                 $SYSLIST(&OP,2) - NBR OF SPACES      00350002
.*                                      TO SKIP ON MULTIPLE             00400002
.*                                      PRINT OR NBR OF SPACES          00450002
.*                                      TO BACK UP FROM COLUMN FOR      00500002
.*                                      START OF PRINTING. THE LETTER   00550002
.*                                      B PRECEEDS THE NUMBER (B5) IF   00600002
.*                                      THE LATTER IS DESIRED. OMISSION 00650002
.*                                      OF THIS OPERAND FORCES OPTION 2 00700002
.*                                      WITH BACKUP SPACING EQUAL TO    00750002
.*                                 THE NUMBER OF BITS IN THE ITEM       00800002
.*                                 DEFINITION (VIA MACRO 'DSGEN').      00850002
.*                            A LIMIT OF 15 BITS IS IMPOSED FOR THE     00900002
.*                                 TOTAL NUMBER OF BITS TO PRINT.       00950002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             01000002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  01050002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  01100002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              01150002
         GBLA  &NRENTS,&SHIFT(3000)                                     01200002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           01250002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       01300002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         01350002
         LCLB  &B,&SUB                                                  01400002
         LCLA  &IBITS,&ISHIFT,&K                                        01450002
         LCLA  &TEMP,&T,&OP                                             01500002
         LCLC  &S,&ARG                                                  01550002
          ACTR  500000                                                  01600002
         AIF   (&DIAGTST EQ 0).NOMSG                                    01650002
         AIF   (&INITIAL EQ 0).NOMSG                                    01700002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    01750002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  01800002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     01850002
*        LINE                                                           01900002
         LINE                                                           01950002
.NOMSG   ANOP                                                           02000002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  02050002
&SUB     SETB  1                                                        02100002
.LOOP    ANOP                                                           02150002
&OP      SETA  &OP+1                                                    02200002
&ARG     SETC  '&SYSLIST(&OP,1)'                                        02250002
         ITEMFIND &ARG                                                  02300002
         AIF   (&ITEMXPT EQ 0).MEXIT                                    02350002
&ISHIFT  SETA  &SHIFT(&ITEMXPT)                                         02400002
&IBITS   SETA  &BITS(&ITEMXPT)                                          02450002
         AIF   (&SUB EQ 1).SUB00                                        02500002
         AIF   ('&SYSLIST(3)' EQ '').SETT                               02550002
&IBITS   SETA  &SYSLIST(3)                                              02600002
         AGO   .SETT                                                    02650002
.SUB00   AIF   ('&SYSLIST(&OP,3)' EQ '').SETT                           02700002
&IBITS   SETA  &SYSLIST(&OP,3)                                          02750002
.SETT    ANOP                                                           02800002
&T       SETA  &IBITS-1                                                 02850002
&B       SETB  0                                                        02900002
         AIF   (&IBITS GT 0 AND &IBITS LT 16).SUB0                      02950002
         MNOTE '**NO. OF BITS OUTSIDE RANGE OF 1-15**'                  03000002
.MEXIT   MEXIT                                                          03050002
.SUB0    AIF   (&SUB EQ 1).SUBA                                         03100002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             03150002
&K       SETA  K'&SYSLIST(2)                                            03200002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              03250002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                03300002
         AGO   .SUBB                                                    03350002
.SUBA    ANOP                                                           03400002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         03450002
&K       SETA  K'&SYSLIST(&OP,2)                                        03500002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          03550002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            03600002
.SUBB    ANOP                                                           03650002
&T       SETA  &S                                                       03700002
.BACKUP  ANOP                                                           03750002
&NRENTS  SETA  &NRENTS+1                                                03800002
         AIF   (&IBITS NE 1 OR &B NE 0).BIN2                            03850002
&TEMP    SETA  &ISHIFT                                                  03900002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'&TEMP'                03950002
         AGO   .OUT                                                     04000002
         AIF   (&SUB EQ 1).BIN2                                         04050002
         AIF   ('&SYSLIST(2)' NE '').BIN3                               04100002
         AGO   .BIN2A                                                   04150002
.BIN2    AIF   ('&SYSLIST(&OP,2)' NE '').BIN3                           04200002
.BIN2A   ANOP                                                           04250002
&B       SETB  1                                                        04300002
.BIN3    ANOP                                                           04350002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'C'                    04400002
         DC    BL.1'&B',AL.7(&T),AL.4(&IBITS),FL.4'&ISHIFT'             04450002
.OUT     ANOP                                                           04500002
&ITEMXPT     SETA  0                                                    04550002
         AIF   (&SUB EQ 0).OUTA                                         04600002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 04650002
.OUTA    ANOP                                                           04700002
         MEND                                                           04750002
         MACRO                                                          04800002
&NAME    DSGEN ,                                                        04850002
.*                            THIS MACRO GENERATES ONE DSECT WORD       04900002
.*                                 FORMATTED FOR THE SUBJECT LOG RECORD 04950002
.*                                 EACH OPERAND HAS TWO SUB LISTS. THE  05000002
.*                                 FIRST IS THE NAME OF THE LOG ITEM    05050002
.*                                 WHILE THE SECOND IS THE # OF BITS TO 05100002
.*                                 ALLOCATE FOR THIS ITEM. ITEMS MUST   05150002
.*                                 BE DEFINED CONTIGUOUSLY WITHOUT GAPS 05200002
.*                                 UNUSED BIT GROUPS MUST BE GIVEN      05250002
.*                                 DUMMY NAMES. THE NAMES PROVIDED FOR  05300002
.*                                 THE LOG ITEMS MAY THEN BE USED IN    05350002
.*                                 THE CONVERSION MACRO INSTRUCTIONS.   05400002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             05450002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  05500002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  05550002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              05600002
         GBLA  &NRENTS,&SHIFT(3000)                                     05650002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           05700002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       05750002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         05800002
         LCLB  &ONLY1,&CTIND                                            05850002
         LCLA  &START1,&START2,&END1,&END2                              05900002
         LCLC  &SYMBOL,&EQUSYM                                          05950002
         LCLA  &OP,&COUNT,&BYTE,&EQUCNT                                 06000002
         ACTR  100000                                                   06050002
         AIF   (&ITEMITR EQ 0).START                                    06100002
 MNOTE   20,'DSGEN MACRO OCCURRS AFTER ITEMSORT MACRO HAS BEEN ISSUED.' 06150002
         MEXIT                                                          06200002
.START   AIF   (N'&SYSLIST(&OP+1) LT 3).LOOP                            06250002
         AIF   ('&SYSLIST(&OP+1,3)' EQ 'EQU').LOOP     TEST FOR EQU     06300002
  AIF   ('&SYSLIST(&OP+1,3)' EQ '' OR '&SYSLIST(&OP+1,4)' EQ '').ERR1   06350002
         AIF   ('&SYSLIST(&OP+1,3)' GT '&SYSLIST(&OP+1,4)').ERR3        06400002
&START1  SETA  &SYSLIST(&OP+1,3)        GET START COUNT OF 1            06450002
&START2  SETA  &SYSLIST(&OP+1,4)        GET FIRST END COUNT             06500002
         AGO   .SET2A                   BRANCH AROUND                   06550002
         AIF   ('&SYSLIST(&OP+1,5)' GT '&SYSLIST(&OP+1,6)').ERR3        06600002
.ERR1    MNOTE '**FIRST SYMBOL CONCATENATION INCOMPLETE**'              06650002
         MEXIT                                                          06700002
.SET2A   AIF   ('&SYSLIST(&OP+1,5)' EQ ''AND '&SYSLIST(&OP+1,6)' EQ '' X06750002
               ).SET2                   TEST FOR NO SECOND              06800002
  AIF   ('&SYSLIST(&OP+1,5)' EQ '' OR '&SYSLIST(&OP+1,6)' EQ '').ERR2   06850002
&END1    SETA  &SYSLIST(&OP+1,5)        GET START COUNT OF 2            06900002
&END2    SETA  &SYSLIST(&OP+1,6)        GET END COUNT OF 2              06950002
         AGO   .LOOP                                                    07000002
.SET2    ANOP                                                           07050002
&ONLY1   SETB  1                        INDICATE ONLY ONE CONCATENATION 07100002
         AGO   .LOOP                                                    07150002
.ERR2    MNOTE '**SECOND SYMBOL CONCATENATION INCOMPLETE**'             07200002
         MEXIT                                                          07250002
.ERR3    MNOTE '**START GREATER THAN END CONCATENATION**'               07300002
         MEXIT                                                          07350002
.LOOP    ANOP                                                           07400002
&OP      SETA  &OP+1                                                    07450002
         AIF   (&OP GT N'&SYSLIST).DONE      TEST IF ALL DONE           07500002
&ITEMNBR SETA  &ITEMNBR+1                                               07550002
         AIF   ('&SYSLIST(&OP,2)' NE '').OK1                            07600002
         MNOTE '**NULL BIT COUNT FIELD**'                               07650002
         MEXIT                                                          07700002
.OK1     ANOP                                                           07750002
&SYMBOL  SETC  '&SYSLIST(&OP,1)'                                        07800002
         AIF   ('&SYMBOL' NE '').OK                                     07850002
*              *****     LOG ITEM SYMBOL NOT PROVIDED     *****         07900002
         AIF   ('&SYSLIST(&OP,3)' NE 'EQU').CNT                         07950002
         AGO   .START                   GET NEXT                        08000002
.OK      AIF   (N'&SYSLIST(&OP) LT 3).NO3    TEST FOR OLD FORMAT        08050002
         AIF   ('&SYSLIST(&OP,3)' EQ 'EQU').EQU   TEST FOR EQU          08100002
         AIF   (&ONLY1).OK2             TEST FOR ONLY ONE CONCAT        08150002
&SYMBOL  SETC  '&SYMBOL.&START1.&END1'       GET 1 AND 2 CONCAT         08200002
         AGO   .NO3                     BRANCH AROUND                   08250002
.OK2     ANOP                                                           08300002
&SYMBOL  SETC  '&SYMBOL.&START1'        GET 1 CONCATENATED              08350002
.NO3     ANOP                                                           08400002
&SYMBOL  EQU   *+&BYTE                                                  08450002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL IN GLOBAL             08500002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)                                    08550002
&SHIFT(&ITEMNBR) SETA &COUNT-&BYTE*8                                    08600002
.CNT     ANOP                                                           08650002
&CTIND   SETB  1                        SET COUNT INDICATOR             08700002
&COUNT   SETA  &COUNT+&SYSLIST(&OP,2)                                   08750002
&BYTE    SETA  &COUNT/8                                                 08800002
         AIF   (N'&SYSLIST(&OP) LT 3).START  TEST FOR OLD FORMAT        08850002
         AIF   (&ONLY1).TSTST           TEST FOR ONLY ONE CONCAT        08900002
         AIF   (&END1 EQ &END2).TSTST   TEST FOR SECOND END             08950002
&END1    SETA  &END1+1                  INCREMENT COUNT                 09000002
&OP      SETA  &OP-1                    DECREMENT INCREMENT             09050002
         AGO   .LOOP                    GENERATE NEXT                   09100002
.TSTST   ANOP                                                           09150002
         AIF   (&START1 EQ &START2).LPDONE   TEST FOR END               09200002
         AIF   (&ONLY1).NSET1           TEST FOR ONLY ONE CONCAT        09250002
&END1    SETA  &SYSLIST(&OP,5)          RE-INIT SECOND START COUNT      09300002
.NSET1   ANOP                                                           09350002
&OP      SETA  &OP-1                    DECREMENT INDEX                 09400002
&START1  SETA  &START1+1                INCREMENT FIRST COUNT           09450002
         AGO   .LOOP                    GO DO NEXT                      09500002
.LPDONE  ANOP                                                           09550002
&ONLY1   SETB  0                        CLEAR INDICATOR                 09600002
         AGO   .START                   GO TEST FOR MORE SUB-LISTS      09650002
.DONE    AIF   (&COUNT-&COUNT/8*8 NE 0).ERR  TEST FOR MULTIPLE OF EIGHT 09700002
         AIF   (&CTIND EQ 0).END        NO DS IF NO COUNT               09750002
&COUNT   SETA  &COUNT/8                 GET NUMBER OF BYTES             09800002
&NAME    DS    &COUNT.C                                                 09850002
.END     MEXIT                                                          09900002
.ERR     MNOTE '**BIT COUNT FLDS DO NOT TOTAL MULTIPLE OF 8**'          09950002
         MEXIT                                                          10000002
.EQU     AIF   ('&SYSLIST(&OP,4)' NE '').EQU1     TEST FOR NULL LABEL   10050002
.ERR4    MNOTE '**EQU OPERAND OMITTED OR NOT FOUND**'                   10100002
         MEXIT                                                          10150002
.EQU1    AIF   (&SYSLIST(&OP,2) LT 16).EQU2  COUNT OVER FIFTEEN         10200002
*****               THE FOLLOWING STATEMENT                *****        10250002
*****     NUMBER OF BITS EXCEED 15 - DO NOT USE AS BIN     *****        10300002
.EQU2    ANOP                                                           10350002
&EQUCNT  SETA  0                        CLEAR COUNTER                   10400002
&EQUSYM  SETC  '&SYSLIST(&OP,4)'        GET EQU OPERAND                 10450002
.EQULOP  ANOP                                                           10500002
&EQUCNT  SETA  &EQUCNT+1                INCREMENT INDEX                 10550002
         AIF   ('&ITEM(&EQUCNT)' EQ '&EQUSYM').EQUOUT  LABEL FOUND?     10600002
         AIF   (&EQUCNT EQ &ITEMNBR).ERR4    ALL TESTED?                10650002
         AGO   .EQULOP                  NO-GET NEXT                     10700002
.EQUOUT  ANOP                                                           10750002
&ITEM(&ITEMNBR) SETC '&SYMBOL'          GET LABEL NAME                  10800002
&BITS(&ITEMNBR) SETA &SYSLIST(&OP,2)    GET NUMBER OF BITS              10850002
&SHIFT(&ITEMNBR) SETA &SHIFT(&EQUCNT)   GET SHIFT COUNT                 10900002
&SYMBOL  EQU   &EQUSYM                  THIS SYMBOL EQUATED             10950002
         AGO   .START                   RETURN FOR NEXT                 11000002
         MEND                                                           11050002
         MACRO                                                          11100002
         CONVT ,                                                        11150002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             11200002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  11250002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  11300002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              11350002
         GBLA  &NRENTS,&SHIFT(3000)                                     11400002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           11450002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       11500002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         11550002
         LCLB  &SUB                                                     11600002
         LCLA  &OP                                                      11650002
         LCLA  &OFFSET,&OUT,&IN,&IND,&IBITS,&ISHIFT                     11700002
.*                                                                      11750002
.*       CONVERT BINARY TO DECIMAL                                      11800002
.*             &NAME IS THE REFERENCE INTO THE DSECT RECORD             11850002
.*             &OUT    IS THE NUMBER OF CHARS TO BE PUT ONTO PRINT LINE 11900002
.*                                      DEFAULT IS FOUR MAXIMUM IS 8    11950002
.*             &IN       IS THE NUMBER OF BYTES AS INPUT                12000002
.*                                      ERROR DEFAULT IS 2 MAXIMUM IS 4 12050002
.*                                                                      12100002
         AIF   (&DIAGTST EQ 0).NOMSG                                    12150002
         AIF   (&INITIAL EQ 0).NOMSG                                    12200002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    12250002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  12300002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     12350002
*        LINE                                                           12400002
         LINE                                                           12450002
.NOMSG   ANOP                                                           12500002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LLOP                  12550002
&SUB     SETB  1                                                        12600002
.LLOP    ANOP                                                           12650002
&OP      SETA  &OP+1                                                    12700002
&OUT     SETA  4                        .BR NOT NULL ELSE SET TO 4      12750002
         AIF   (&SUB EQ 1).SUBA                                         12800002
         AIF   ('&SYSLIST(3)' EQ '').B  TEST FOR NULL INPUT             12850002
&OUT     SETA  &SYSLIST(3)             SET &OUT FROM INPUT              12900002
         AGO   .A                                                       12950002
.SUBA    AIF   ('&SYSLIST(&OP,3)' EQ '').B                              13000002
&OUT     SETA  &SYSLIST(&OP,3)          SET &OUT FROM INPUT             13050002
.A       AIF   (&OUT GT 0 AND &OUT LT 9).B   TEST RANGE                 13100002
.AERR    MNOTE '*** BYTES OUT INCORRECTLY SPECIFIED DEFAULT USED ***'   13150002
&OUT     SETA  4                                                        13200002
.B       AIF   (&SUB EQ 1).SUBB                                         13250002
         AIF   ('&SYSLIST(2)' EQ '').LOOP    BRANCH IF NULL             13300002
&IN      SETA  &SYSLIST(2)              .SET &IN FROM INPUT             13350002
         AGO   .BB                                                      13400002
.SUBB    AIF   ('&SYSLIST(&OP,2)' EQ '').LOOP                           13450002
&IN      SETA  &SYSLIST(&OP,2)          .SET &IN FROM INPUT             13500002
.BB      AIF   (&IN GT 0 AND &IN LT 5).D     TEST RANGE                 13550002
.BERR    MNOTE '*** BYTES IN INCORRECTLY SPECIFIED DEFAULT USED ***'    13600002
&IN      SETA  2                                                        13650002
         AGO   .D                                                       13700002
.LOOP    ANOP                           .LOOP TO FIND &NAME IN DSECT    13750002
&IND     SETA  &IND+1                   .SET UP LOOP COUNTER            13800002
         AIF   ('&ITEM(&IND)' EQ '&SYSLIST(&OP,1)').FOUND               13850002
         AIF   (&IND LT &ITEMNBR).LOOP  .TEST FOR END OF DSECT          13900002
         MNOTE '*** LOG ITEM NOT DEFINED ***'                           13950002
         MEXIT                                                          14000002
.FOUND   ANOP                                                           14050002
&IBITS   SETA  &BITS(&IND)              .SET UP NUMBER OF BITS SPEC     14100002
         AIF   (&IBITS-((&IBITS/8)*8) EQ 0).C  .TEST FOR MULTIPLE OF 8  14150002
         MNOTE '*** DATA NOT DEFINED A MULTIPLE OF 8 BITS ***'          14200002
         MEXIT                                                          14250002
.C       ANOP                                                           14300002
&IN      SETA  &IBITS/8                 .COMPUTE NUMBER OF BYTES        14350002
         AIF   (&IN LT 1 OR &IN GT 4).BERR  .TEST RANGE B IF IN ERROR   14400002
&ISHIFT  SETA  &SHIFT(&IND)             .SET UP FOR TEST OF BYTE BNDR   14450002
         AIF   (&ISHIFT EQ 0).D         .TEST FOR BYTE BNDRY            14500002
         MNOTE '*** DATA NOT ALIGNED ON A BYTE BOUNDARY ***'            14550002
         MEXIT                                                          14600002
.*                                                                      14650002
.D       ANOP                                                           14700002
&NRENTS  SETA  &NRENTS+1                                                14750002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),AL.4(9)                    14800002
         DC    X'&IN',X'&OUT'                                           14850002
&IND     SETA  0                                                        14900002
         AIF   (&SUB EQ 0).OUTA                                         14950002
         AIF   (&OP LT N'&SYSLIST).LLOP                                 15000002
.OUTA    ANOP                                                           15050002
         MEND                                                           15100002
         MACRO                                                          15150002
         ITEMFIND &ARG,&ITFDIAG=                                        15200002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             15250002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  15300002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  15350002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              15400002
         GBLA  &NRENTS,&SHIFT(3000)                                     15450002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           15500002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       15550002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         15600002
         LCLA  &A,&B,&X,&I                                              15650002
         LCLC  &C1,&C2,&S                                               15700002
         ACTR  100000                                                   15750002
&ITEMXPT SETA  0                  INDICATE ITEM NOT FOUND.              15800002
         AIF   ('&ARG' NE '').NORM                                      15850002
         AIF   ('&ITFDIAG' EQ 'OFF'  OR  '&ITFDIAG' EQ 'ON').DIAGSET    15900002
  MNOTE 0,'ITEMFIND - OPERAND (&ITFDIAG) INVALID FOR ITFDIAG KEYWORD.'  15950002
         MEXIT                                                          16000002
.DIAGSET ANOP                                                           16050002
&DIAGITF SETB  ('&ITFDIAG' EQ 'ON')                                     16100002
         MEXIT                                                          16150002
.NORM    AIF   (&ITEMITR GT 0).SORTED                                   16200002
         ITEMSORT                                                       16250002
.SORTED  ANOP                                                           16300002
&I       SETA  &ITEMITR           COMPUTED ITTERATION COUNT.            16350002
&X       SETA  &ITEMMDX           COMPUTED MAXIMUM INDEX.               16400002
&C1      SETC  '&ARG'             ISOLATE SEARCH ARGUMENT.              16450002
&C1      SETC  '&C1'.'       '(1,8-K'&C1) PAD TO FULL 8 CHARACTERS.     16500002
.SRCHUP  ANOP                                                           16550002
&A       SETA  &A+&X              CURRENT TABLE SUBSCRIPT + INDEX.      16600002
&S       SETC  '+'                                                      16650002
         AIF   (&A  GT &ITEMNBR  AND  NOT &DIAGITF).SRCHDN1             16700002
         AIF   (&A  LE &ITEMNBR).SRCH00                                 16750002
&C2      SETC  '*-OVER-*'                                               16800002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         16850002
&X       SETA  &X/2               HALVE INDEX VALUE.                    16900002
 MNOTE *,'&ARG - &C2   ITRCTR = &I   PTR = &A&S &X'                     16950002
         AIF   (&I GE 0).SRCHDWN  IF ITTERATION COUNT NOT EXPIRED.      17000002
.NOFIND  MNOTE  20,' ITEMFIND FAILED FOR NAME  &C1  '                   17050002
         MEXIT                                                          17100002
.SRCH00  ANOP                                                           17150002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         17200002
         AIF   (&I LT 0).NOFIND   IF COUNT HAS GONE TO ZERO.            17250002
&X       SETA  &X/2               HALVE INDEX VALUE.                    17300002
&B       SETA  &ITEMNDX(&A)       GET SUBSCRIPT FROM INDEX TABLE.       17350002
&C2      SETC  '&ITEM(&B)'.'       '(1,8-K'&ITEM(&B))  PAD COMPARAND.   17400002
         AIF   (NOT &DIAGITF).COMPARE                                   17450002
 MNOTE *,'&ARG - &C2   ITRCTR = &I   PTR = &A&S &X   POS = &B'          17500002
.COMPARE AIF   ('&C1' LT '&C2').SRCHDWN   ARGUMENT LOWER, MOVE DOWN.    17550002
         AIF   ('&C1' GT '&C2').SRCHUP    ARGUMENT HIGHER, MOVE UP.     17600002
&ITEMXPT SETA  &B                 FOUND. SET INDEX POINTER FOR RETURN.  17650002
&ITEMFST(&I+1)  SETA  &ITEMFST(&I+1)+1                                  17700002
         MEXIT                                                          17750002
.SRCHDWN ANOP                                                           17800002
&A       SETA  &A-&X              CURRENT POINTER MINUS INDEX VALUE.    17850002
&S       SETC  '-'                                                      17900002
         AIF   (&A LE &ITEMNBR).SRCH00    IF WITHIN BOUNDS OF TABLE.    17950002
.SRCHDN1 ANOP                                                           18000002
&I       SETA  &I-1               DECREMENT ITTERATION COUNTER.         18050002
&X       SETA  &X/2               HALVE INDEX VALUE.                    18100002
         AIF   (&I GE 0).SRCHDWN  IF ITTERATION COUNT NOT EXPIRED.      18150002
         MNOTE  20,' ITEMFIND FAILED FOR NAME  &C1  '                   18200002
         MEND                                                           18250002
         MACRO                                                          18300002
         ITEMSORT  &DUMMY                                               18350002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             18400002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  18450002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  18500002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              18550002
         GBLA  &NRENTS,&SHIFT(3000)                                     18600002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           18650002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       18700002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         18750002
         LCLA  &R,&ZI,&I,&A1,&A2,&TEMP                                  18800002
         LCLB  &SR,&GOTO,&TB                                            18850002
         LCLB   &SW(4000)                                               18900002
         LCLC  &C1,&C2                                                  18950002
         ACTR   200000                                                  19000002
&A1      SETA  0                                                        19050002
         AIF   (&ITEMITR EQ 0).LOOP0   TEST FOR RE-ENTRY.               19100002
 MNOTE   0,'ITEMSORT MACRO OCCURRS MORE THAN ONCE. TABLE NOT RESORTED.' 19150002
         MEXIT                                                          19200002
.LOOP0   ANOP                                                           19250002
&A1      SETA  &A1+1                                                    19300002
&ITEMNDX(&A1) SETA &A1                                                  19350002
         AIF   (&A1 LT &ITEMNBR).LOOP0                                  19400002
         AIF   (&ITEMNBR LT 2).MEXIT                                    19450002
&A1      SETA  &ITEMNBR/2         HALF OF TOTAL ENTRIES.                19500002
&A2      SETA  0                                                        19550002
.LOOP1   ANOP                                                           19600002
&A2      SETA  &A2+1                                                    19650002
&SW(&A2) SETB  1                  SET FIRST HALF OF SWITCHES TO 1.      19700002
         AIF   (&A2 LT &A1).LOOP1                                       19750002
.LOOP2   ANOP                                                           19800002
&A2      SETA  &A2+1                                                    19850002
&SW(&A2) SETB  0                  SET SECOND HALF TO ZERO.              19900002
         AIF   (&A2 LT &ITEMNBR).LOOP2                                  19950002
&R       SETA  0                  SET R TO FIRST TRIAL ITEM.            20000002
&ZI      SETA  &ITEMNBR-1         SET ZI TO LAST ITEM.                  20050002
&I       SETA  &ZI-1                                                    20100002
.T3      ANOP                                                           20150002
&SR      SETB  (&SW(&R+1))        GET FLAG, WHICH WAY TO GO?            20200002
&R       SETA  (&R*2)+1+&SR       R=2R+(1 OR 2)                         20250002
         AIF   (&R LE &I).T3                                            20300002
.T4      ANOP                                                           20350002
&R       SETA  (&R-1)/2           R=(R-1)/2                             20400002
&SR      SETB  (&SW(&R+1))        GET SUBTREE SELECT FLAG.              20450002
         AIF   (&SR EQ 0).T7                                            20500002
         AIF   (&GOTO EQ 0).T5                                          20550002
.T7      ANOP                                                           20600002
&A1      SETA  &ITEMNDX(&R+1)                                           20650002
&A2      SETA  &ITEMNDX(&ZI+1)                                          20700002
&C1      SETC  '&ITEM(&A1)'.'       '(1,8-K'&ITEM(&A1))                 20750002
&C2      SETC  '&ITEM(&A2)'.'       '(1,8-K'&ITEM(&A2))                 20800002
         AIF   ('&C1' LT '&C2').T8                                      20850002
.T9      ANOP                                                           20900002
&TEMP    SETA  &ITEMNDX(&R+1)     Z(R) TO TEMP.                         20950002
&TB      SETB  (&SW(&R+1))                                              21000002
&ITEMNDX(&R+1) SETA &ITEMNDX(&ZI+1)    Z(I) TO Z(R)                     21050002
&SW(&R+1) SETB (&SW(&ZI+1))                                             21100002
&ITEMNDX(&ZI+1) SETA &TEMP        TEMP TO Z(I)                          21150002
&SW(&ZI+1) SETB (&TB)                                                   21200002
&SR      SETB  (&SR EQ 0)                                               21250002
&SW(&R+1) SETB (&SR)                                                    21300002
.T8      AIF   (&R GT 0).T4                                             21350002
&GOTO    SETB  1                  SET 'GO TO' T7                        21400002
&ZI      SETA  &ZI-1                                                    21450002
&I       SETA  &I-1                                                     21500002
         AIF   (&I GE 0).T3                                             21550002
.MEXIT   ANOP                                                           21600002
&ITEMITR SETA 1                                                         21650002
&ITEMMDX SETA 1                                                         21700002
.ITRLOOP ANOP                                                           21750002
&ITEMITR SETA &ITEMITR+1                                                21800002
&ITEMMDX SETA &ITEMMDX+&ITEMMDX                                         21850002
         AIF  (&ITEMMDX LT &ITEMNBR).ITRLOOP                            21900002
&ITEMITR SETA &ITEMITR-1                                                21950002
&ITEMMDX SETA &ITEMMDX/2                                                22000002
&A1      SETA &ITEMNBR                                                  22050002
&A2      SETA &ITEMMDX                                                  22100002
&TEMP    SETA &ITEMITR                                                  22150002
 MNOTE *,' ITEMS = &A1, MAX INDEX = &A2, ITTERATION COUNT = &TEMP'      22200002
         MEXIT                                                          22250002
.T5      ANOP                                                           22300002
&TEMP    SETA  &ITEMNDX(&R+1)     Z(R) TO TEMP.                         22350002
&TB      SETB  (&SW(&R+1))                                              22400002
&ITEMNDX(&R+1) SETA &ITEMNDX(&ZI+1)    Z(I) TO Z(R)                     22450002
&SW(&R+1) SETB (&SW(&ZI+1))                                             22500002
&ITEMNDX(&ZI+1) SETA &TEMP        TEMP TO Z(I)                          22550002
&SW(&ZI+1) SETB (&TB)                                                   22600002
&SR      SETB  (&SR EQ 0)                                               22650002
&SW(&R+1) SETB (&SR)                                                    22700002
         AGO   .T3                                                      22750002
         MEND                                                           22800002
           MACRO                                                        22850002
&NAME    LABEL &LABEL1,&LABEL2,&LABEL3,&LABEL4,&LABEL5,&LABEL6,        C22900002
               &LABEL7,&LABEL8                                          22950002
.*                                 THIS MACRO ALLOWS LABELS TO          23000002
.*                                 BE SPECIFIED FOR A GIVEN LINE. THE   23050002
.*                                 LABELS SHOULD BE ENCLOSED IN QUOTA-  23100002
.*                                 TION MARKS. THE COLUMN AND LINE END  23150002
.*                                 CONTROLS WILL BE INSERTED BY THE     23200002
.*                                 MACRO. OMITTED OPERANDS MEAN NO      23250002
.*                                 LABEL REQUIRED FOR RESPECTIVE        23300002
.*                                 COLUMN.                              23350002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             23400002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  23450002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  23500002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              23550002
         GBLA  &NRENTS,&SHIFT(3000)                                     23600002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           23650002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       23700002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         23750002
         LCLC  &MARGIN,&TACK                                            23800002
         LCLC  &TEXT                                                    23850002
         LCLA  &OP,&K,&START,&NRCHAR,&REMAIN                            23900002
         AIF   (&INITIAL EQ 0).DIAGCLR                                  23950002
         AIF   (&DIAGTST EQ 0).DIAGCLR                                  24000002
         AIF   (&DIAGLIN EQ 1).DIAGCLR                                  24050002
         MNOTE '**NO LINE ASSOCIATED WITH PREVIOUS LABEL**'             24100002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   24150002
*        LINE                                                           24200002
         LINE                                                           24250002
.DIAGCLR ANOP                                                           24300002
&DIAGSET SETB  0                                                        24350002
&DIAGLIN SETB  0                                                        24400002
&MARGIN  SETC  '*'                                                      24450002
         AIF   ('&NAME' EQ '').LOOPOUT                                  24500002
&LPTR    SETA  &LPTR+1                                                  24550002
&LBL(&LPTR) SETC '&NAME'                                                24600002
&LBLCTR(&LPTR) SETA &LABELNR+1                                          24650002
.LOOPOUT ANOP                                                           24700002
&OP      SETA  &OP+1                                                    24750002
&K       SETA  K'&SYSLIST(&OP)                                          24800002
         AIF (&K GE 2).NORM                                             24850002
&K       SETA  2                                                        24900002
.NORM    ANOP                                                           24950002
&START   SETA  2                                                        25000002
         AIF (&OP LT N'&SYSLIST).NOTLAST                                25050002
&MARGIN  SETC  '$'                                                      25100002
.NOTLAST ANOP                                                           25150002
&NRCHAR  SETA  8                                                        25200002
&TACK    SETC  ''                                                       25250002
.LOOPIN  ANOP                                                           25300002
&REMAIN  SETA  &K-&START                                                25350002
         AIF (&REMAIN GE 8).MORE                                        25400002
&TACK    SETC  '&MARGIN'                                                25450002
&NRCHAR  SETA  &REMAIN                                                  25500002
.MORE    ANOP                                                           25550002
&TEXT    SETC  ''                                                       25600002
         AIF (&REMAIN EQ 0).ENDTEXT                                     25650002
&TEXT    SETC  '&SYSLIST(&OP)'(&START,&NRCHAR)                          25700002
.ENDTEXT ANOP                                                           25750002
&LABELNR SETA  &LABELNR+1                                               25800002
&LABELS(&LABELNR) SETC '&TEXT'.'&TACK'                                  25850002
&START   SETA  &START+8                                                 25900002
         AIF ('&TACK' EQ '').LOOPIN                                     25950002
         AIF ('&TACK' EQ '*').LOOPOUT                                   26000002
         MEND                                                           26050002
         MACRO                                                          26100002
&NAME    LINE  &DATA,&LABEL,&SKIP=                                      26150002
.*                            THIS MACRO ESTABLISHES THE MARGINS OR     26200002
.*                                 COLUMN SETTINGS FOR EACH LINE. IT    26250002
.*                                 GENERATES NECESSARY CARRIAGE CONTROL 26300002
.*                                 ENTRIES. LASTLY IT DETERMINES THE    26350002
.*                                 NUMBER OF ENTRIES ASSOCIATED WITH    26400002
.*                                 THE PREVIOUS LINE AND STORES THAT #  26450002
.*                                 INTO THE APPROPRIATE BYTE.           26500002
.*                            &DATA(1) - CHARACTER POSITION TO BEGIN    26550002
.*                                 DATA.                                26600002
.*                            &DATA(2) - # OF SPACES BETWEEN SUCCESSIVE 26650002
.*                                 DATA COLUMN STARTING CHARACTERS.     26700002
.*                            &LABEL(1) - CHAR. POS. TO BEGIN LABELS.   26750002
.*                            &LABEL(2) - # SPACES BETWEEN LINE'S LABEL 26800002
.*                                 STARTING CHARACTERS.                 26850002
.*                            &SKIP= - # OF LINES TO ADVANCE CARRIAGE   26900002
.*                                 TO BEGIN NEXT PRINTED LINE.          26950002
.*                            NEW ENTRIES ARE GENERATED ONLY WHEN       27000002
.*                                 NECESSARY. OMISSION OF ITEMS MEANS   27050002
.*                                 THEY HAVE NOT CHANGED SINCE PREVIOUS 27100002
.*                                 SETTINGS. A LINE MACRO IS REQUIRED   27150002
.*                                 FOR EACH PRINTED LINE. IF NO SETTING 27200002
.*                                 CHANGES ARE REQUIRED ALL OPERANDS    27250002
.*                                 ARE OMITTED IN WHICH CASE ONLY THE   27300002
.*                                 # OF ENTRIES FOR THE PREVIOUS LINE   27350002
.*                                 IS COMPUTED. THIS MACRO MUST BE THE  27400002
.*                                 FIRST MACRO INSTRUCTION ISSUED FOR   27450002
.*                                 THE SUBJECT LINE                     27500002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             27550002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  27600002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  27650002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              27700002
         GBLA  &NRENTS,&SHIFT(3000)                                     27750002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           27800002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       27850002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         27900002
         LCLA  &S                                                       27950002
         AIF   (&INITIAL EQ 0 OR &DIAGTST EQ 0).DIAGSET                 28000002
         AIF   (&DIAGSET EQ 0).DIAGSET                                  28050002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  28100002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   28150002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       28200002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 28250002
.DIAGSET ANOP                                                           28300002
&DIAGSET SETB  1                                                        28350002
&DIAGLIN SETB  1                                                        28400002
&NAME    DS    0C                                                       28450002
         AIF   (&INITIAL EQ 0).FIRSTLN                                  28500002
         LINEND                                                         28550002
         AGO   .NTFIRST                                                 28600002
.FIRSTLN ANOP                                                           28650002
&NRENTSX SETC  'N&SYSNDX'                                               28700002
&INITIAL SETA  1                                                        28750002
N&SYSNDX EQU   *                                                        28800002
.NTFIRST ANOP                                                           28850002
         DC    AL1(0)                                                   28900002
         AIF   ('&DATA(1)' EQ '').CKDTABS                               28950002
         AIF   (&DATA(1) EQ &DB).CKDTABS                                29000002
&DB      SETA  &DATA(1)                                                 29050002
         AGO   .AA                                                      29100002
.CKDTABS AIF   ('&DATA(2)' EQ '').NCDATA                                29150002
         AIF   (&DATA(2) EQ &DT).NCDATA                                 29200002
         AGO   .CC                                                      29250002
.AA      AIF   ('&DATA(2)' EQ '').BB                                    29300002
         AIF   (&DATA(2) EQ &DT).BB                                     29350002
.CC      ANOP                                                           29400002
&DT      SETA  &DATA(2)                                                 29450002
.BB      DC    XL2'FFFE'                                                29500002
         DC    FL1'&DB'                                                 29550002
         DC    FL1'&DT'                                                 29600002
&NRENTS  SETA  &NRENTS+1                                                29650002
.NCDATA  ANOP                                                           29700002
         AIF   ('&LABEL(1)' EQ '').CKLTABS                              29750002
         AIF   (&LABEL(1) EQ &LB).CKLTABS                               29800002
&LB      SETA  &LABEL(1)                                                29850002
         AGO   .AAA                                                     29900002
.CKLTABS AIF   ('&LABEL(2)' EQ '').NCLABEL                              29950002
         AIF   (&LABEL(2) EQ &LT).NCLABEL                               30000002
         AGO   .CCC                                                     30050002
.AAA     AIF   ('&LABEL(2)' EQ '').BBB                                  30100002
         AIF   (&LABEL(2) EQ &LT).BBB                                   30150002
.CCC     ANOP                                                           30200002
&LT      SETA  &LABEL(2)                                                30250002
.BBB     DC    XL2'FFFF'                                                30300002
         DC    FL1'&LB'                                                 30350002
         DC    FL1'&LT'                                                 30400002
&NRENTS  SETA  &NRENTS+1                                                30450002
.NCLABEL ANOP                                                           30500002
         AIF   ('&SKIP' NE '').CONT                                     30550002
         AIF   (&TEST EQ 0).NOCHANG                                     30600002
         AGO   .DEFALTA                                                 30650002
.CONT    ANOP                                                           30700002
         AIF   (&TEST EQ 0).AB                                          30750002
         AIF   ('&SKIP' EQ 'E').AB                                      30800002
&S       SETA  &SKIP                                                    30850002
.DEFAULT ANOP                                                           30900002
         AIF   (&SKIP EQ &LASTCC).DEFALTA                               30950002
         ORG   &CARRCON+3                                               31000002
         DC    AL.3(0),AL.2(&S),AL.3(1)                                 31050002
         ORG                                                            31100002
&LASTCC  SETA  &S                                                       31150002
.DEFALTA ANOP                                                           31200002
&TEST    SETB  0                                                        31250002
         AGO   .DD                                                      31300002
.AB      AIF   ('&SKIP' NE 'E').ABB                                     31350002
A&SYSNDX DC    X'FFFB8B00'              EJECT                           31400002
&LASTCC  SETA  184                                                      31450002
&TEST    SETB  1                                                        31500002
         AGO   .ABC                                                     31550002
.ABB     AIF   (&SKIP EQ &LASTCC).NOCHANG                               31600002
A&SYSNDX DC    XL2'FFFB'                                                31650002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              31700002
         DC    AL.3(0),AL.2(&SKIP),AL.3(1)                              31750002
&LASTCC  SETA  &SKIP                                                    31800002
&TEST    SETB  1                                                        31850002
.ABC     ANOP                                                           31900002
&CARRCON SETC  'A&SYSNDX'                                               31950002
&NRENTS  SETA  &NRENTS+1                                                32000002
.DD      ANOP                                                           32050002
.NOCHANG ANOP                                                           32100002
         MEND                                                           32150002
         MACRO                                                          32200002
         LINEND ,                                                       32250002
.*                                 THIS MACRO IS USED ONLY BY THE LINE  32300002
.*                                 MACRO TO SET THE NUMBER OF ENTRIES   32350002
.*                                 ASSOCIATED WITH EACH LINE.           32400002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             32450002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  32500002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  32550002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              32600002
         GBLA  &NRENTS,&SHIFT(3000)                                     32650002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           32700002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       32750002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         32800002
         ORG   &NRENTSX                                                 32850002
         DC    FL1'&NRENTS'                                             32900002
         ORG                                                            32950002
&NRENTS  SETA  0                                                        33000002
B&SYSNDX EQU   *                                                        33050002
&NRENTSX SETC  'B&SYSNDX'                                               33100002
         MEND                                                           33150002
         MACRO                                                          33200002
         LSTART ,                                                       33250002
.*                            THIS MACRO IS ISSUED WHEN THE LABEL AREA  33300002
.*                                 OF THE TABLE IS TO BEGIN.            33350002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             33400002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  33450002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  33500002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              33550002
         GBLA  &NRENTS,&SHIFT(3000)                                     33600002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           33650002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       33700002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         33750002
         LCLA  &NDX,&CTR                                                33800002
         ACTR  500000                                                   33850002
         AIF   (&DIAGTST EQ 0).NODIAG                                   33900002
         AIF   (&DIAGSET EQ 0).NODIAG                                   33950002
         MNOTE '**NO LABEL ASSOCIATED WITH LAST SET**'                  34000002
***** THE FOLLOWING GENERATED FOR TEST PURPOSES *****                   34050002
*        LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%'       34100002
               LABEL '%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%' 34150002
.NODIAG  ANOP                                                           34200002
         LINEND                                                         34250002
&CTR     SETA  1                                                        34300002
.LOOP    ANOP                                                           34350002
&NDX     SETA  &NDX+1                                                   34400002
         AIF   (&LBLCTR(&CTR) NE &NDX).NOLBL                            34450002
&LBL(&CTR) DC  C'&LABELS(&NDX)'                                         34500002
&CTR     SETA  &CTR+1                                                   34550002
         AGO   .LOOPCTL                                                 34600002
.NOLBL   ANOP                                                           34650002
         DC    C'&LABELS(&NDX)'                                         34700002
.LOOPCTL AIF   (&NDX LT &LABELNR).LOOP                                  34750002
         MEND                                                           34800002
         MACRO                                                          34850002
&NAME    ROUTINE &LOGITEM,&RNAME                                        34900002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             34950002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  35000002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  35050002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              35100002
         GBLA  &NRENTS,&SHIFT(3000)                                     35150002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           35200002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       35250002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         35300002
         AIF   (&DIAGTST EQ 0).NOMSG                                    35350002
         AIF   (&INITIAL EQ 0).NOMSG                                    35400002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    35450002
         MNOTE '**NO LINE ASSOCIATED WITH THIS ROUTINE**'               35500002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     35550002
*        LINE                                                           35600002
         LINE                                                           35650002
.NOMSG   ANOP                                                           35700002
&NAME    DC    AL.12(&LOGITEM-&DSECT),XL.4'D'                           35750002
         DC    AL2(&RNAME-&CSECT)                                       35800002
&NRENTS  SETA  &NRENTS+1                                                35850002
         MEND                                                           35900002
         MACRO                                                          35950002
         SPECIAL &ROUTINE,&PARAM,&SPACE=                                36000002
.*                            THIS MACRO GENERATES A SPECIAL ROUTINE    36050002
.*                                 ENTRY TO BE PROCESSED BY THE SUM. M. 36100002
.*                            &ROUTINE - SYMBOL ON SPECIAL ROUTINE EWT. 36150002
.*                            &PARAM - AN 8 BIT BINARY REPRESENTATION   36200002
.*                                 TO OCCUPY THE 'MASK' FIELD BUT TO BE 36250002
.*                                 INTERPRETED AS AN ARGUMENT OF THE    36300002
.*                                 SPECIAL ROUTINE.                     36350002
.*                            &SPACE - THE NUMBER OF 2BYTE COUNTERS TO  36400002
.*                                 ALLOCATE FOR REQUIRED PROCESSING.    36450002
         GBLC  &CSECT                                                   36500002
         GBLA  &COUNTR                                                  36550002
         LCLA  &ADD                                                     36600002
         DC    AL1(128)                                                 36650002
         DC    BL.8'&PARAM'                                             36700002
         DC    AL2(&ROUTINE-&CSECT)                                     36750002
         DC    AL2(&COUNTR)                                             36800002
&ADD     SETA  1                                                        36850002
         AIF   ('&SPACE' EQ '').NORM                                    36900002
&ADD     SETA  &SPACE                                                   36950002
.NORM    ANOP                                                           37000002
&COUNTR  SETA  &COUNTR+&ADD                                             37050002
         MEND                                                           37100002
         MACRO                                                          37150002
         HEX   ,                                                        37200002
.*                            THIS MACRO FACILITATES GENERATION OF THE  37250002
.*                                 TABLE ENTRIES SPECIFYING HEX TYPE    37300002
.*                                 CONVERSIONS.                         37350002
.*                            &SYSLIST(&OP,1) - NAME OF DATA ITEM TO BE 37400002
.*                                 CONVERTED                            37450002
.*                            &SYSLIST(&OP,2) - # OF SPACES TO SKIP ON  37500002
.*                                 MULTIPLE PRINT OR NBR OF SPACES TO   37550002
.*                                 BACK UP FROM COLUMN FOR START OF     37600002
.*                                 PRINTING. THE LETTER B PRECEEDS THE  37650002
.*                                 NUMBER (B8) IF THE LATTER OPTION IS  37700002
.*                                 DESIRED. OMISSION OF THIS OPERAND    37750002
.*                                 FORCES OPTION 2 WITH BACKUP SPACING  37800002
.*                                 EQUAL TO THE NUMBER OF BYTES SPECI-  37850002
.*                                 FIED BY THE NEXT OPERAND (TWICE THIS 37900002
.*                                 NUMBER IF SUFFIX IS EXPLICITLY OR    37950002
.*                                 IMPLICITLY B).                       38000002
.*                            &SYSLIST(&OP,3) - NUMBER OF BYTES TO      38050002
.*                                 PROCESS. THIS NUMBER IS SUFFIXED     38100002
.*                                 WITH AN L,R, OR B TO STIPULATE       38150002
.*                                 PRINTING OF THE LEFT HALF, RIGHT     38200002
.*                                 HALF, OR BOTH HALVES OF THE BYTE     38250002
.*                                 RESPECTIVELY. OMISSION OF THIS       38300002
.*                                 OPERAND DEFAULTS TO B WITH THE NUM-  38350002
.*                                 BER OF BYTES EQUAL TO THE ITEM LNGTH 38400002
.*                            A NEW ENTRY IS GENERATED ONLY WHEN NECES- 38450002
.*                                 SARY. THIS MACRO MUST BE THE FIRST   38500002
.*                                 MACRO INSTRUCTION ISSUED FOR THE     38550002
.*                                 SUBJECT LINE(S).                     38600002
         GBLA  &BITS(3000),&DB,&DT,&INITIAL                             38650002
         GBLA  &ITEMITR,&ITEMFST(20),&ITEMNBR,&ITEMMDX                  38700002
         GBLA  &ITEMNDX(3000),&ITEMXPT                                  38750002
         GBLA  &LABELNR,&LASTCC,&LB,&LBLCTR(100),&LPTR,&LT              38800002
         GBLA  &NRENTS,&SHIFT(3000)                                     38850002
         GBLB  &DIAGITF,&DIAGLIN,&DIAGSET,&DIAGTST,&FSW,&TEST           38900002
         GBLC  &CARRCON,&CSECT,&DSECT,&ITEM(3000)                       38950002
         GBLC  &LABELS(3000),&LBL(100),&NRENTSX                         39000002
         LCLB  &B,&SUB                                                  39050002
         LCLA  &IBITS,&ISHIFT,&K,&T,&CODE,&BYTESP,&OP                   39100002
         LCLC  &S,&LETTER,&ARG                                          39150002
       ACTR  500000                                                     39200002
         AIF   (&DIAGTST EQ 0).NOMSG                                    39250002
         AIF   (&INITIAL EQ 0).NOMSG                                    39300002
         AIF   (&DIAGLIN EQ 1).NOMSG                                    39350002
         MNOTE '**NO LINE ASSOCIATED WITH THIS DATA**'                  39400002
*****THE FOLLOWING GENERATED FOR TEST PURPOSES*****                     39450002
*        LINE                                                           39500002
         LINE                                                           39550002
.NOMSG   ANOP                                                           39600002
         AIF   (K'&SYSLIST(1) EQ K'&SYSLIST(1,1)).LOOP                  39650002
&SUB     SETB  1                                                        39700002
.LOOP    ANOP                                                           39750002
&OP      SETA  &OP+1                                                    39800002
&ARG     SETC  '&SYSLIST(&OP,1)'                                        39850002
         ITEMFIND  &ARG                                                 39900002
         AIF   (&ITEMXPT EQ 0).MEXIT                                    39950002
.FOUND   ANOP                                                           40000002
&ISHIFT  SETA  &SHIFT(&ITEMXPT)                                         40050002
&IBITS   SETA  &BITS(&ITEMXPT)                                          40100002
         AIF   (&ISHIFT EQ 0 OR &ISHIFT EQ 4).ALIGN                     40150002
.ERR     MNOTE '**DATA NOT ALLIGNED ON HEX OR BYTE BOUNDARY**'          40200002
.MEXIT   MEXIT                                                          40250002
.ALIGN   ANOP                                                           40300002
&CODE    SETA  1                                                        40350002
         AIF   (&SUB EQ 1).SUBA                                         40400002
&K       SETA  K'&SYSLIST(3)                                            40450002
         AGO   .SUBB                                                    40500002
.SUBA    ANOP                                                           40550002
&K       SETA  K'&SYSLIST(&OP,3)                                        40600002
.SUBB    ANOP                                                           40650002
         AIF   (&K EQ 1).ERR3                                           40700002
         AIF   (&IBITS-(&IBITS/4)*4 EQ 0).OK                            40750002
         MNOTE '**BIT LENGTH SPECIFICATION INCONSISTENT WITH CONTROL**' 40800002
         MEXIT                                                          40850002
.OK      AIF   (&SUB EQ 1).SUBC                                         40900002
         AIF   ('&SYSLIST(3)' EQ '').USEDEFN                            40950002
&LETTER  SETC  '&SYSLIST(3)'(&K,1)                                      41000002
&S       SETC  '&SYSLIST(3)'(1,&K-1)                                    41050002
         AGO   .SUBD                                                    41100002
.SUBC    ANOP                                                           41150002
         AIF   ('&SYSLIST(&OP,3)' EQ '').USEDEFN                        41200002
&LETTER  SETC  '&SYSLIST(&OP,3)'(&K,1)                                  41250002
&S       SETC  '&SYSLIST(&OP,3)'(1,&K-1)                                41300002
.SUBD    ANOP                                                           41350002
&BYTESP  SETA  &S                                                       41400002
         AIF   ('&LETTER' EQ 'B').BOTH                                  41450002
         AIF   ('&LETTER' EQ 'L').LEFT                                  41500002
         AIF   ('&LETTER' EQ 'R').RIGHT                                 41550002
.ERR3    MNOTE '**PARAMETER 3 INCOMPLETE-DSGEN DEFINITION USED**'       41600002
         AGO   .USEDEFN                                                 41650002
.RIGHT   ANOP                                                           41700002
&CODE    SETA  2                                                        41750002
         AGO   .L                                                       41800002
.LEFT    ANOP                                                           41850002
&CODE    SETA  1                                                        41900002
         AGO   .L                                                       41950002
.USEDEFN ANOP                                                           42000002
&BYTESP  SETA  &IBITS/8                                                 42050002
.BOTH    AIF   (&ISHIFT NE 0).ERR                                       42100002
&CODE    SETA  3                                                        42150002
&T       SETA  &BYTESP*2-1                                              42200002
&S       SETC  '&T'                                                     42250002
.OK2     AIF   (&ISHIFT EQ 0).L                                         42300002
&CODE    SETA  2                                                        42350002
.L       ANOP                                                           42400002
&B       SETB  1                                                        42450002
         AIF   (&SUB EQ 1).SUBE                                         42500002
         AIF   ('&SYSLIST(2)' EQ '').BACKUP                             42550002
&K       SETA  K'&SYSLIST(2)                                            42600002
&B       SETB  ('&SYSLIST(2)'(1,1) EQ 'B')                              42650002
&S       SETC  '&SYSLIST(2)'(&B+1,&K-&B)                                42700002
         AGO   .SUBF                                                    42750002
.SUBE    ANOP                                                           42800002
         AIF   ('&SYSLIST(&OP,2)' EQ '').BACKUP                         42850002
&K       SETA  K'&SYSLIST(&OP,2)                                        42900002
&B       SETB  ('&SYSLIST(&OP,2)'(1,1) EQ 'B')                          42950002
&S       SETC  '&SYSLIST(&OP,2)'(&B+1,&K-&B)                            43000002
.SUBF    ANOP                                                           43050002
.BACKUP  ANOP                                                           43100002
&NRENTS  SETA  &NRENTS+1                                                43150002
         AIF   (&BYTESP GT 0 AND &BYTESP LT 16).SUB0                    43200002
         MNOTE '**NO. OF BYTES OUTSIDE RANGE OF 1-15**'                 43250002
         MEXIT                                                          43300002
.SUB0    AIF   (&SUB EQ 1).SUBG                                         43350002
         DC    AL.12(&SYSLIST(1)-&DSECT),XL.4'A'                        43400002
         AGO   .SUBH                                                    43450002
.SUBG    ANOP                                                           43500002
         DC    AL.12(&SYSLIST(&OP,1)-&DSECT),XL.4'A'                    43550002
.SUBH    ANOP                                                           43600002
         DC    BL.1'&B',FL.7'&S',AL.4(&BYTESP),FL.4'&CODE'              43650002
.OUT     ANOP                                                           43700002
&ITEMXPT     SETA  0                                                    43750002
         AIF   (&SUB EQ 0).OUTA                                         43800002
         AIF   (&OP LT N'&SYSLIST).LOOP                                 43850002
.OUTA    ANOP                                                           43900002
         MEND                                                           43950002
         MACRO                                                          44000002
         SUM   &LOGITEM,&MASK                                           44050002
.*                            THIS MACRO GENERATES A NORMAL EDIT ENTRY  44100002
.*                                 FOR PROCESSING BY THE SUMMARY MODULE 44150002
.*                            &LOGITEM - NAME OF DATA ITEM TO BE SUMMED 44200002
.*                            &MASK - BYTE MASK FOR BITS TO BE TESTED.  44250002
.*                                 THIS OPERAND SHOULD BE OMITTED FOR   44300002
.*                                 SINGLE BIT ITEMS IN WHICH CASE THE   44350002
.*                                 MASK WILL BE SET ACCORDING TO THE    44400002
.*                                 OFF BYTE BIT DISPLACEMENT OF THE     44450002
.*                                 ITEM AS DEFINED BY THE MACRO 'DSGEN' 44500002
         GBLA  &COUNTR,&ITEMNBR,&BITS(3000),&SHIFT(3000)                44550002
         GBLC  &ITEM(3000),&DSECT                                       44600002
         LCLA  &IBITS,&NDX,&ISHIFT,&M,&BITNBR                           44650002
.LOOP    ANOP                                                           44700002
&NDX     SETA  &NDX+1                                                   44750002
         AIF   ('&ITEM(&NDX)' EQ '&LOGITEM').FOUND                      44800002
         AIF   (&NDX LT &ITEMNBR).LOOP                                  44850002
         MNOTE *,'LOGITEM NOT FOUND'                                    44900002
         MEXIT                                                          44950002
.FOUND   ANOP                                                           45000002
&ISHIFT  SETA  &SHIFT(&NDX)                                             45050002
&IBITS   SETA  &BITS(&NDX)                                              45100002
         AIF   (&IBITS EQ 1).FORM1      TEST FOR OLD FORM               45150002
         AIF   ('&MASK' NE '').FORM1    TEST FOR MASK                   45200002
         AIF   (&IBITS+&ISHIFT GT 8).MSG     TEST FOR MORE THAN EIGHT   45250002
         DC    AL.1(0),AL.3(&ISHIFT),AL.4(&IBITS)                       45300002
         DC    AL1(0)                                                   45350002
         AGO   .ITEM                                                    45400002
.MSG     MNOTE '**BITS GREATER THAN 8**'                                45450002
         MEXIT                                                          45500002
.FORM1   ANOP                                                           45550002
         DC    AL1(0)                                                   45600002
         AIF   ('&MASK' EQ '').FORM                                     45650002
         DC    B'&MASK'                                                 45700002
         AGO   .ITEM                                                    45750002
.FORM    ANOP                                                           45800002
&BITNBR  SETA  &ISHIFT-7                                                45850002
&BITNBR  SETA  0-&BITNBR                                                45900002
&M       SETA  1                                                        45950002
.LOOP2   ANOP                                                           46000002
         AIF   (&BITNBR EQ 0).GOTIT                                     46050002
&M       SETA  &M*2                                                     46100002
&BITNBR  SETA  &BITNBR-1                                                46150002
         AGO   .LOOP2                                                   46200002
.GOTIT   ANOP                                                           46250002
         DC    AL1(&M)                                                  46300002
.ITEM    DC    AL2(&LOGITEM-&DSECT)                                     46350002
         DC    AL2(&COUNTR)                                             46400002
&COUNTR  SETA  &COUNTR+1                                                46450002
         MEND                                                           46500002
         GBLC  &DSECT,&CSECT                                            46550002
&CSECT   SETC  'IFCSXXXH'          ALIAS IFCST00D                       46600002
&DSECT   SETC  'RECORD'                                                 46650002
IFCSXXXH CSECT                                                          46700002
RECORD   DSECT                                                          46750002
         DS    0F                  HEADING DSECT FOR OBR & MDR          46800002
         DSGEN (CLASRC,8),              RECORD TYPE                    X46850002
               (SYSREL,8),              SYSTEM & RELEASE LEVEL         X46900002
               (SWITCH1,16),(SWITCH2,16),                      @M04AE95X46950002
               (RCDCNT,8),              COUNT & MULTI PART ID          X47000002
               (SPACE1,8),              SPACE (1,BYTE)                 X47050002
               (DATE,32),               DATE                           X47100002
               (TIME,32),               TIME                           X47150002
               (XDUM1,8),               MACHINE VERSION                X47200002
               (CPUSER,24),             C P U SERIAL NO.               X47250002
               (CPUID,16),              C P U I.D.                     X47300002
               (MCEL,16)                MAX LGTH OF MACH DEP LOG        47350002
*                            --------------------------                 47400002
*                                  OBR (UNIT CHECK) DSECT               47450002
*                            --------------------------                 47500002
         DSGEN (JOBID,64),              JOB NAME                       X47550002
               (FAILCCW,64),            FAILING CCW                    X47600002
               (CSW,64),                CSW CONTENTS                   X47650002
               (DEVDEPC,8),             DEV DEPNOT DATA COUNT          X47700002
               (SECUA,24),              SECONDARY CHAN & UNIT ADDR     X47750002
               (DEVTYPE,32),            DEVICE TYPE BYTES              X47800002
               (XDUM6,8),               RESERVED BYTE                  X47850002
               (XCUA,24),               PRIMARY CHAN & UNIT ADDR       X47900002
               (IORETRY,16),            # OF I/O RETRY ATTEMPTS        X47950002
               (SENSCNT,16)             # OF SENSE BYTES IN RCD         48000002
         DSGEN (SENS00,1,0,7)      SENSE                                48050002
         DSGEN (SENS01,1,0,7)      BYTES                                48100002
         DSGEN (SENS02,1,0,7)                                           48150002
         DSGEN (SENS03,1,0,7)                                           48200002
         DSGEN (SENS04,1,0,7)                                           48250002
         DSGEN (SENS05,1,0,7)                                           48300002
         DSGEN (SENS0615,80)                                   @M04AE95 48350002
         DSGEN (SENS16,1,0,7)                                  @M04AE95 48360002
         DSGEN (SENS1721,24)                                   @XA20885 48370001
         DSGEN (SENS20,1,0,7)                                  @XA20885 48372001
         DSGEN (SENS2131,8)                                    @XA20885 48374001
         DSGEN (SENS22,1,0,7)                                  @M04AE95 48380001
         DSGEN (SENS23,1,0,7)                                  @XA20885 48385001
         DSGEN (SENS2331,64)                                   @XA20885 48390001
         DSGEN (XRESV,56)                                      @M04AE95 48400002
         DSGEN (DEVDEPSB,8)                                    @M04AE95 48420002
         DSGEN (BASICS1,1,0,7)                                 @M04AE95 48450002
         DSGEN (BASICS2,1,0,7)                                 @M04AE95 48470002
         DSGEN (XDUMZ,8),(XSIOCNT,24)                                   48550002
*                                                                       48600002
*                                  MDR DSECT                            48650002
         ORG   JOBID                                                    48700002
         DSGEN (MDRCUA,16),(RECTYP,8),(XDUMQ,8)                         48750002
         DSGEN (MDREC2,16,0,62)      TWO BYTE COUNTERS         @XA20899 48800001
         DSGEN (MDRC1,8,0,111)       ONE BYTE COUNTERS         @XA20899 48820001
*                                                                       48900002
*                                  END OF MDR DSECT                     48950002
*                                                                       49000002
*                                                                       49150002
         TITLE 'IFCSXXXH - 3895 SUMMARY - ALIAS IFCS3895,IFCST00D'      49200002
*                                                                       49250002
IFCSXXXH CSECT                                                          49300002
         USING RECORD,R2                                                49350002
         USING *,R9                                                     49400002
         DC    A(ENTRY)                 PTR TO SUM ENTRIES              49450002
         DC    A(PEDIT)                 PTR TO EDIT TABLE               49500002
REG8     DC    F'0'                     PTR TO ACTIVE ENTRY             49550002
SCSIZE   DC    H'482'           NUMBER OF 2 BYTE COUNTERS      @XA20885 49600001
R0       EQU   0                                                        49650002
R1       EQU   1                                                        49700002
R2       EQU   2                                                        49750002
R3       EQU   3                        COUNTER POINTER                 49800002
R4       EQU   4                                                        49850002
R5       EQU   5                                                        49900002
R6       EQU   6                                                        49950002
R7       EQU   7                                                        50000002
R8       EQU   8                                                        50050002
R9       EQU   9                                                        50100002
R10      EQU   10                                                       50150002
R11      EQU   11                                                       50200002
R12      EQU   12                                                       50250002
R13      EQU   13                                                       50300002
R14      EQU   14                                                       50350002
R15      EQU   15                                                       50400002
L0       EQU   0                                                        50450002
L1       EQU   1                                                        50500002
L2       EQU   2                                                        50550002
L3       EQU   3                                                        50600002
L4       EQU   4                                                        50650002
L5       EQU   5                                                        50700002
L6       EQU   6                                                        50750002
L7       EQU   7                                                        50800002
L8       EQU   8                                                        50850002
L9       EQU   9                                                        50900002
L10      EQU   10                                                       50950002
L11      EQU   11                                                       51000002
L12      EQU   12                                                       51050002
L13      EQU   13                                                       51100002
L14      EQU   14                                                       51150002
L15      EQU   15                                                       51200002
L16      EQU   16                                                       51250002
L17      EQU   17                                                       51300002
L18      EQU   18                                                       51350002
L19      EQU   19                                                       51400002
L20      EQU   20                                                       51450002
L21      EQU   21                                                       51500002
L22      EQU   22                                                       51550002
L23      EQU   23                                                       51600002
L28      EQU   28                                                       51650002
L32      EQU   32                                                       51700002
L44      EQU   44                                                       51750002
L46      EQU   46                                                       51800002
L64      EQU   64                                                       51850002
L71      EQU   71                                              @M04AE95 51900002
L96      EQU   96                                              @M04AE95 51920002
L128     EQU   128                                                      51950002
WORK1    DC    D'0'                WORK AREA # 1                        52000002
X00      DC    2F'0'                                                    52050002
REGSAVE  DC    4F'0'                    REG SAVE AREA                   52100002
SAVE24   DC    3F'0'               REGS 2/4 SAVE AREA                   52150002
HW2      DC    H'2'                                                     52200002
HW8      DC    H'8'                     EIGHT                           52250002
HW16     DC    H'16'                    SIXTEEN                         52300002
NOCARRY  EQU   12                       COND CODE AFTER'AL'END CARRY    52400002
HEX00    EQU   X'00'                                                    52450002
X01      EQU   X'01'                                           @M04AE95 52470002
X10      EQU   X'10'                                                    52500002
X20      EQU   X'20'                                                    52550002
X40      EQU   X'40'                                                    52600002
X7F      EQU   X'7F'                                                    52650002
X80      EQU   X'80'                                                    52700002
X90      EQU   X'90'                                                    52750002
         DS    0H                                                       52800002
RETURN   LM    R5,R8,REGSAVE            RESTORE REGS                    52850002
         BR    R14                 RETURN                               52900002
MDRCK    EQU   *                                                        52950002
         STM   R5,R8,REGSAVE            SAVE REGS                       53000002
         TM    CLASRC,X90               MDR RECORD ?                    53050002
         BNO   RETURN                   NO, BR TO RETURN                53100002
         LR    R5,R3                    GET CTR PTR                     53200002
         BAL   R8,ADDUP                 GO ADD TO MDR CTR               53250002
         LA    R8,MDRCT-L6         GET MDR PROC ADDRESS                 53300002
         ST    R8,REG8             PUT IT IN PTR                        53350002
         B    RETURN                 RETURN                             53400002
MDRCHK   STM   R5,R8,REGSAVE       SAVE REGS                            53450002
         LA    R8,63            LENGTH OF TWO BYTE COUNTERS    @XA20885 53500001
         LR    R7,R3               SUM AREA ADDRESS                     53550002
         LA    R6,MDREC20          INPUT RECORD ADDRESS        @M04AE95 53600002
DOALL    SR    R5,R5               ZERO R5                              53650002
         CH    R5,L0(R6)           ANY DATA IN INPUT?                   53700002
         BE    NXTBYTE             BRANCH IF NO                         53750002
         LH    R5,L0(R6)           GET SUM COUNTER VALUE                53800002
         A     R5,L0(R7)           ADD NEW VALUE                        53850002
         ST    R5,L0(R7)           STORE NEW VALUE IN SUM AREA          53900002
NXTBYTE  LA    R7,L4(R7)           STEP SUM AREA COUNTER                53950002
         LA    R6,L2(R6)           STEP INPUT AREA COUNTER              54000002
         BCT   R8,DOALL            DO ALL SENSE BYTES                   54050002
         LA    R8,112           LENGTH OF ONE BYTE COUNTERS    @XA20885 54054001
         LA    R6,MDRC10        ADDR OF 1 BYTE COUNTERS        @XA20899 54058001
DOALL1   SR    R5,R5               ZERO R5                     @M04AE95 54062002
         ICM   R5,1,L0(R6)         GET VALUE OF COUNTER        @M04AE95 54066002
         LTR   R5,R5               ANY VALUE                   @M04AE95 54070002
         BZ    NXTBYTE1            NO,CHECK NEXT COUNTER       @M04AE95 54074002
         A     R5,L0(R7)           ADD ORIGINAL VALUE          @M04AE95 54078002
         ST    R5,L0(R7)           STORE NEW VALUE IN SUM AREA @M04AE95 54082002
NXTBYTE1 LA    R7,L4(R7)           STEP SUM AREA COUNTER       @M04AE95 54086002
         LA    R6,L1(R6)           STEP INPUT AREA COUNTER     @M04AE95 54090002
         BCT   R8,DOALL1           DO ALL ONE BYTE COUNTERS    @M04AE95 54094002
         B     RETURN              RETURN WHEN FINISHED                 54100002
OBRSENSE STM   R5,R8,REGSAVE       SAVE REGS                            54150002
         STM   R2,R4,SAVE24        SAVE REGS                            54200002
         LA    R8,16                                                    54250002
         LR    R6,R3                                                    54300002
         LA    R5,BASICS10         ADDR OF INPUT BASIC SENSE   @M04AE95 54350002
         BAL   R3,SUMSNS                                                54400002
         LA    R5,BASICS10         ADDR OF INPUT BASIC SENSE   @M04AE95 54450002
         TM    L0(R5),X10          ANY PROCESSOR/EXTENDED SNS?          54500002
         BZ    RETURN9             BRANCH IF NO                         54550002
         LA    R5,BASICS20         ADDR OF BASIC SENSE BTYE 2  @M04AE95 54600002
         TM    L0(R5),X01          PROCESSOR OR EXTENDED?      @M04AE95 54620002
         BO    PROCSNS             BRANCH IF PROCESSOR                  54700002
         LA    R5,SENS000          INPUT DATA FOR EXTENDED SNS          54750002
         LA    R8,48               NUMBER OF EXTENDED BITS              54800002
         L     R6,SAVE24+4         SUM COUNTER POINTER                  54850002
         LA    R6,L64(R6)          SUM COUNTER AREA FOR EXPANDED        54900002
         BAL   R3,SUMSNS           GO SUM COUNTERS                      54950002
         LA    R5,SENS160          INPUT FOR EXT SENSE BYTE 16 @M04AE95 54960002
         LA    R8,8                NUMBER OF BITS TO SUM       @M04AE95 54970002
         BAL   R3,SUMSNS           GO SUM COUNTERS             @M04AE95 54980002
         LA    R5,SENS200       INPUT FOR EXT SENSE BYTE 20    @XA20885 54985001
         LA    R8,8                NUMBER OF BYTES TO SUM      @M04AE95 54990001
         BAL   R3,SUMSNS           GO SUM COUNTERS             @M04AE95 54995001
         LA    R5,SENS220       INPUT FOR EXT SENSE BYTE 22    @XA20885 54995701
         LA    R8,8             NUMBER OF BITS TO SUM          @XA20885 54996401
         BAL   R3,SUMSNS        GO TO SUM COUNTERS             @XA20885 54997101
         LA    R5,SENS230       INPUT FOR EXT SENSE BYTE 23    @XA20885 54997801
         LA    R8,8             NUMBER OF BITS TO SUM          @XA20885 54998501
         BAL   R3,SUMSNS        GO TO SUM COUNTERS             @XA20885 54999201
RETURN9  LM    R2,R4,SAVE24        RESTORE REGS                         55000002
         B     RETURN              RETURN TO CALLER                     55050002
PROCSNS  LA    R5,SENS040          PROCESSOR SENSE BYTES 4,5   @M04AE95 55100002
         LA    R8,16               NUMBER OF PROCESSOR BITS             55150002
         L     R6,SAVE24+4         SUM COUNTER ADDRESS                  55200002
         LA    R6,L32(R6)          SUM AREA ADDRESS FOR PROCESSOR       55250002
         BAL   R3,SUMSNS           GO SUM COUNTERS                      55300002
         LM    R2,R4,SAVE24        RESTORE REGS                         55350002
         B     RETURN              RETURN TO CALLER                     55400002
SUMSNS   LA    R7,L128                                                  55450002
         LA    R2,L8                                                    55500002
NEXTBIT  EX    R7,TESTSNS                                               55550002
         BZ    NEXT                                                     55600002
         LH    R4,L0(R6)                                                55650002
         LA    R4,L1(R4)                                                55700002
         STH   R4,L0(R6)                                                55750002
NEXT     LA    R6,L2(R6)                                                55800002
         SRL   R7,L1                                                    55850002
         BCT   R8,STEP5                                                 55900002
         L     R2,SAVE24                                                55950002
         BR    R3                                                       56000002
STEP5    BCT   R2,NEXTBIT                                               56050002
         LA    R5,L1(R5)                                                56100002
         B     SUMSNS                                                   56150002
TESTSNS  TM    0(R5),HEX00                                              56200002
OBRSIO   STM   R5,R8,REGSAVE       SAVE REGS                            56250002
         LR    R5,R3               GET OLD I/O COUNT ADDRESS            56300002
         LA    R6,XDUMZ            SIO ADDRESS -1                       56350002
         L     R7,0(R5)            GET OLD SIO COUNT                    56400002
         A     R7,0(R6)            ADD LATEST COUNT                     56450002
         ST    R7,0(R5)            STORE NEW COUNT                      56500002
         B     RETURN              RETURN TO CALLER                     56550002
ADDUP    EQU   *                                                        56600002
         LH    R6,L0(R5)                LOAD SUM CTR                    56650002
         LA    R6,L1(R6)                ADD ONE TO CTR                  56700002
         STH   R6,L0(R5)                SAVE CTR                        56750002
         LA    R5,L2(R5)                BUMP SUM CTR PTR                56800002
         BR    R8                       RETURN                          56850002
OBRCNT   DS    0H                                                       56900002
         STM   R5,R8,REGSAVE            SAVE REGS                       56950002
         TM    CLASRC,X90               MDR RECORD ?                    57000002
         BO    RETURN                   YES, RETURN                     57050002
          LR    R5,R3                    GET COUNTER PTR                57100002
OBRLNG   DS    0H                                                       57150002
         LA    R5,L2(R5)                BUMP CTR PTR                    57200002
         BAL   R8,ADDUP                 GO ADD TO CTR                   57250002
         TM    BASICS10,X10             EQIUPMENT CHECK        @XA19168 57255001
         BZ    RETURN                   NO, RETURN             @XA19168 57260001
         TM    DEVDEPSB,X80             ERROR READING EXT OR   @XA19168 57265001
*                                       PROCESSOR SENSE        @XA19168 57270001
         BZ    RETURN                   NO, RETURN             @XA19168 57275001
         TM    BASICS20,X01             PROCESSOR SENSE FAILURE         57280001
         BO    PROSNS                   YES, BRANCH            @XA19168 57285001
         LA    R5,L2(R5)                BUMP COUNTER FOR EXT SENSE      57290001
PROSNS   BAL   R8,ADDUP                 GO ADD TO COUNTER      @XA19168 57295001
         B     RETURN                   RETURN                          57300002
XDATE1    DS    0H                                                      57350002
         STM   R5,R8,REGSAVE            SAVE REGS                       57400002
         CLC   DATE(L4),X00             IS DATE 0 ?                     57450002
         BE    RETURN                   YES, BR                         57500002
         CLC   L0(L4,R3),X00            IS LO DATE / ?                  57550002
         BNE   XDATE2                   NO, BR                          57600002
         MVC   L0(L4,R3),DATE           MOVE DATE IN                    57650002
XDATE2   EQU   *                                                        57700002
         CLC   DATE(L4),L0(R3)          CHECK FOR LO DATE               57750002
         BL    SAVELOW                  IT IS LOWER, BRANCH             57800002
         CLC   DATE(L4),L4(R3)          CHECK FOR HI DATE               57850002
         BNH   RETURN                   IT IS IN BETWEEN, BR            57900002
         MVC   L4(L4,R3),DATE           IT IS HIGHER, SAVE IT           57950002
         B     RETURN                   RETURN                          58000002
MDRTYPE  STM   R5,R8,REGSAVE                                            58050002
         LR    R5,R3               SAVE COUNTER POINTER                 58100002
         TM    RECTYP,X40          COUNTER OVERFLOW?                    58150002
         BO    OVFLW               BRANCH IF YES                        58200002
         LA    R5,L2(R5)           STEP COUNTER FOR UNKNOWN RECS        58250002
         BAL   R8,ADDUP            ADD TO COUNTER              @XA19168 58260001
         B     MDRERR              GO CHECK FOR ERRORS         @XA19168 58270001
OVFLW    BAL   R8,ADDUP            GO ADD TO COUNTER                    58300002
         LA    R5,L2(R5)           STEP COUNTER FOR MDR ERRORS @XA19168 58310001
MDRERR   TM    RECTYP,X80          ERROR READING PRED SENSE    @XA19168 58320001
         BZ    RETURN              NO, RETURN                  @XA19168 58330001
         BAL   R8,ADDUP            YES, ADD TO ERROR COUNTER   @XA19168 58340001
         B     RETURN                                                   58350002
SAVELOW  EQU   *                                                        58400002
         MVC   L0(L4,R3),DATE           IT IS LO, SAVE IT               58450002
         B     RETURN                   RETURN                          58500002
ENTRY    DS    0F                                                       58550002
         SPECIAL XDATE1,0,SPACE=4                                       58600002
         SPECIAL MDRCK,0,SPACE=2                                        58650002
         SPECIAL OBRCNT,0,SPACE=4                              @XA19168 58700001
         SPECIAL OBRSENSE,0,SPACE=112                          @XA20885 58750001
         SPECIAL OBRSIO,0,SPACE=2                                       58800002
         DC    XL1'FF'                  END OF SUM SECTION              58850002
MDRCT    EQU   *                                                        58900002
         SPECIAL MDRTYPE,0,SPACE=3                             @XA19168 58950001
         SPECIAL MDRCHK,0,SPACE=346                            @XA20885 59000001
         DC    XL1'FF'             MDR END                              59050002
PEDIT    DS    0F                                                       59100002
&DSECT   SETC  'HAWKCTR'                                                59150002
&CSECT   SETC  'PEDIT'                                                  59200002
         USING *,R9                                                     59250002
         USING HAWKCTR,R2                                               59300002
         DC    A(PENTRY)                                                59350002
         DC    A(IFCSXXXH)                                              59400002
R9PTR    DC    F'0'                                                     59450002
LABELPTR DC    F'0'                                                     59500002
*                                                                       59550002
*        COUNTER DSECT DEFINITION,MUST BE IN ACCESS SEQUENCE            59600002
*                                                                       59650002
HAWKCTR  DSECT                                                          59700002
         DS    3H                                                       59750002
         DSGEN (YDUMA,16),              DUMMY                          X59800002
               (YNOREC,16),             NO. OF RECORDS                 X59850002
               (YTYPE,8),               LAST TYPE ENCOUNTERED          X59900002
               (YCHAN,16),              CHAN ADDR              @XA19168X59950001
               (YCUA,16),               CHAN UNIT ADDR         @XA19168X59970001
               (YSER,24),               CPU SERIAL #                   X60050002
               (YCPU,16),               CPU MODEL #                    X60100002
               (YSMSW,16)               SWITCH                          60150002
         DSGEN (LODATE,32),             EARLIEST DATE                  X60200002
               (HIDATE,32)              LATEST DATE                     60250002
         DSGEN (MDRCD,16),              COUNT OF MDR RECORDS           X60300002
               (CULOG,16),              ENTRIES IN ALL MDR RECORDS     X60350002
               (OBRST,16),              COUNT OF OBR SHORT RECORDS     X60400002
               (OBRLG,16),              COUNT OF OBR LONG RECORDS      X60450001
               (PROCFAIL,16),           COUNT OF PROC SENSE FAILURES   X60460001
               (EXTFAIL,16)             COUNT OF EXT SENSE FAILURES     60470001
         DSGEN (SNSCT,16,0,15)                                          60500002
         DSGEN (PROCT,16,0,15)                                          60550002
         DSGEN (EXTCT,16,0,79)                                 @XA20885 60600001
         DSGEN (IOCNT,32)                                               60650002
         DSGEN (TYPCT,16,0,2)                                  @XA19168 60700001
         DSGEN (TWOBYT,32,0,62)                                @XA20899 60750001
         DSGEN (ONEBY,32,0,111)                                @XA20899 60770001
IFCSXXXH CSECT                                                          61900002
YR9PTR   DC    F'0'                                                     61950002
YLABEL   DC    F'0'                                                     62000002
*                                                                       62050002
*                        SPECIAL ROUTINES FOR SUMMARY                   62100002
*                                                                       62150002
         DS    0F                                                       62200002
RETURN1  LM    R5,R8,REGSAVE1           RESTORE REGS                    62250002
RETURN2  BR    R14                      RETURN TO CALLER                62300002
SKIP     BR    R14                 RETURN                               62350002
SKIPPER  BR    R14                 RETURN                               62400002
SETCPUNO EQU   *                                                        62450002
         STM   R5,R8,REGSAVE1           SAVE REGS                       62500002
         SR    R5,R5                    ZERO R5                         62550002
         IC    R5,L0(R4)                PICK UP CPU TYPE                62600002
         SLL   R5,L8                      V                             62650002
         IC    R5,L1(R4)                  V                             62700002
         LTR   R5,R5                    IS IT ZERO ?                    62750002
         BNZ   RETURN1                  NO, BRANCH                      62800002
         LA    R6,L46                   BACK UP POINTER 46 BYTES        62850002
         SR    R3,R6                     TO PUT IN NEW INFO             62900002
         MVC   L0(L9,R3),UNIV           SAY MODEL = UNIVERSAL           62950002
         MVC   L23(L6,R3),NONE          SAY SERIAL = NONE               63000002
         B     RETURN1                  RETURN                          63050002
SETDATE  EQU   *                                                        63100002
         UNPK  WORK(L8),L0(L4,R4)       UNPACK A DATE                   63150002
         MVZ   WORK+L7(L1),WORK         MOVE IN ZONE BITS               63200002
         MVC   L0(L3,R3),WORK+L5        MOVE DAY TO PRINT BUFF          63250002
         MVC   L5(L2,R3),WORK+L3        MOVE YEAR TO RPINT BUFF         63300002
         BR    R14                      RETURN                          63350002
CKOBRCNT EQU   *                                               @XA19531 63352001
         STM   R5,R8,REGSAVE1                                  @XA19531 63354001
         CLC   L0(L2,R4),HW0                                   @XA19531 63356001
         BNE   RETURN1                                         @XA19531 63358001
         L     R5,MDRLOC                                       @XA19531 63360001
         ST    R5,LABELPTR                                     @XA20700 63362001
         L     R5,MDRLAB                                       @XA19531 63364001
         ST    R5,YR9PTR                                       @XA20700 63366001
         B     RETURN1                                         @XA19531 63368001
CKMDRCNT EQU   *                                               @XA19531 63370001
         STM   R5,R8,REGSAVE1                                  @XA19531 63372001
         CLC   L0(L2,R4),HW0                                   @XA19531 63374001
         BNE   RETURN1                                         @XA19531 63376001
         L     R5,FINISH                                       @XA19531 63378001
         ST    R5,LABELPTR                                     @XA20700 63380001
         L     R5,FINISH1                                      @XA19531 63382001
         ST    R5,YR9PTR                                       @XA20700 63384001
         B     RETURN1                                         @XA19531 63386001
SPACE20  EQU   *                                                        63400002
         LA    R3,L19(R3)               BUMP POINTER TO BUFF            63450002
         BR    R14                      RETURN                          63500002
THEND    EQU   *                                                        63550002
         STM   R14,R12,L12(R13)         SAVE REGS                       63600002
         LR    R12,R13                  LOAD SAVE AREA ADDR             63650002
         LA    R13,FSAVE                LOAD MY SAVE AREA ADDR          63700002
         ST    R12,L4(R13)              SAVE CALLERS SAVE AREA ADDR     63750002
         ST    R13,L8(R13)              SAVE MY SAVE AREA ADDR IN CALLR 63800002
         L     R3,L4(R2)                LOAD ADDR OF NEXT CTR           63850002
         LH    R0,SIZE                  LOAD SIZE OF CTRS               63900002
         LR    R1,R2                    LOAD ADDR OF CTRS               63950002
         TM    ONETIME,YES              COUNTERS ALREADY FREE? @XA20701 63960001
         BO    NOFREEMN                 ALREADY FREED, BYPASS  @XA20701 63970001
         FREEMAIN R,LV=(0),A=(1)        FREE CTR STORAGE                64000002
         MVI   ONETIME,YES              SET ONETIME SWITCH     @XA20701 64010001
NOFREEMN EQU   *                        BYPASS OF FREEMAIN     @XA20701 64020001
         LTR   R3,R3                    ARE THERE MORE CTRS ?           64050002
         BZ    RETURNF                  NO,RETURN                       64100002
         LR    R2,R3                    LOAD POINTER                    64150002
         LA    R5,PENTRY+L10            LOAD EDIT TBL ADDR              64200002
         ST    R5,YR9PTR                STORE IT FOR EREP CTL           64250002
         LA    R5,LABELS-L1             LOAD LABEL ADDR                 64300002
         ST    R5,YLABEL                STORE IT FOR EREP CTL           64350002
RETURNF  EQU   *                                                        64400002
         L     R13,L4(R13)              LOAD CALLERS SAVE AREA ADDR     64450002
         LM    R14,R12,L12(R13)         RESTORE REGS                    64500002
         SR    R15,R15                  PREVENT PRINTING                64550001
         BR    R14                      RETURN                          64560001
FSAVE    DC    18F'0'                                                   64600002
SIZE     DC    H'986'           BYTES OF COUNTERS + 22         @XA20885 64650001
REGSAVE1 DC    4F'0'                    REG SAVE AREA                   64700002
UNIV     DC    C'UNIVERSAL'                                             64750002
NONE     DC    C'NONE  '                                                64800002
WORK     DC    D'0'                     WORK AREA                       64850002
HW0      DC    H'0'                     ZERO FOR CTR COMPARE            64900002
MDRLOC   DC    A(MDR-4)                                        @XA19531 64910001
MDRLAB   DC    A(MDR1-1)                                       @XA19531 64920001
FINISH   DC    A(FIN-4)                                        @XA19531 64930001
FINISH1  DC    A(FIN1-1)                                       @XA19531 64940001
ONETIME  DC    X'00'                    ONETIME(FREEMAIN) SWTCH@XA20701 64943001
YES      EQU   X'01'                    ALREADY FREEMAINED     @XA20701 64946001
PENTRY   DS    0F                                                       64950002
         DC   X'00000000'                                               65000002
         DC   X'00000000'                                               65050002
         DC    A(LABELS)                                                65100002
         DC    H'0'                                                     65150002
         DC    X'01'                                                    65200002
         DC    X'000B8B00'                                              65250002
         LABEL ''                                                       65300002
         LINE  ,,SKIP=0                                        @XA19531 65310001
         ROUTINE OBRLG,CKOBRCNT                                @XA19531 65320001
         LABEL  ' '                                            @XA19531 65330001
         LINE  (97,18),(1,103),SKIP=2                                   65350002
         HEX   YCPU,0,2B                                                65400002
         HEX   YSER,0,3B                                                65450002
         ROUTINE YCPU,SETCPUNO                                          65500002
         LABEL 'SUMMARY OF I/O RECORDS     TYPE - OBR       SOURCE - OUX65550002
               TBOARD         DEVICE TYPE 3895    MODEL ','SERIAL NO.'  65600001
         LINE  ,(13),SKIP=1                                             65650002
         LABEL 'DAY YEAR    DAY YEAR'                                   65700002
         LINE  (13,12),(1,20),SKIP=2                                    65750002
         ROUTINE LODATE,SETDATE                                         65800002
         ROUTINE HIDATE,SETDATE                                         65850002
         LABEL 'DATE RANGE','TO'                                        65900002
         LINE  (26,41),(3,38),SKIP=2                           @XA19168 65950001
         HEX   YCUA,0,2B                                       @XA19168 65970001
         CONVT OBRLG,2,5                                                66050002
         LABEL 'CHANNEL/UNIT ADDRESS -','TOTAL NUMBER OF RECORDS -'     66150001
         LINE  (33,18),(3,37),SKIP=2                           @XA19168 66160001
         CONVT PROCFAIL,2,5                                    @XA19168 66170001
         CONVT EXTFAIL,2,5                                     @XA19168 66180001
         LABEL 'SENSE FAILURES -- PROCESSOR -','EXTENDED -'    @XA19168 66190001
         LINE  (1,1),(18,58),SKIP=2                            @M04AE95 66250002
         ROUTINE YDUMA,SKIP                                             66300002
         LABEL '--- SENSE DATA ---',                           @M04AE95*66350002
               '--- PROCESSOR SENSE DATA ---'                  @M04AE95 66370002
         LINE  (1,1),(1,29),SKIP=0                             @M04AE95 66400002
         ROUTINE YDUMA,SKIP                                    @M04AE95 66450002
         LABEL 'BIT BYTE 0         COUNT',                     @M04AE95*66500002
               'BIT BYTE 1         COUNT'                      @M04AE95 66550002
         LINE  (1,1),(61,32),SKIP=1                            @XA20891 66570001
         ROUTINE YDUMA,SKIP                                    @M04AE95 66600002
         LABEL 'BIT BYTE 4            COUNT',                  @M04AE95*66650002
               'BIT BYTE 5            COUNT'                   @M04AE95 66700002
         LINE  (20,29),(2,29),SKIP=0                           @M04AE95 66750002
         CONVT SNSCT0,2,5                                      @M04AE95 66770002
         CONVT SNSCT8,2,5                                      @M04AE95 66800002
         LABEL '0  COMMAND REJ','0  PREDICTOR REQ'             @M04AE95 66850002
         LINE  (83,32),(62,32),SKIP=1                          @M04AE95 66900002
         CONVT PROCT0,2,5                                      @M04AE95 66950002
         CONVT PROCT8,2,5                                      @M04AE95 66970002
         LABEL '0  PROG SET HARD ERR','0  A-PRTY CHK'          @M04AE95 67000002
         LINE  (20,29),(2,29),SKIP=0                           @M04AE95 67050002
         CONVT SNSCT1,2,5                      '               @M04AE95 67100002
         CONVT SNSCT9,2,5                                      @M04AE95 67150002
         LABEL '1  INTRVN REQD','1  FEATURE CHK'               @M04AE95 67170002
         LINE  (83,32),(62,32),SKIP=1                          @M04AE95 67200002
         CONVT PROCT1,2,5                                      @M04AE95 67250002
         CONVT PROCT9,2,5                                      @M04AE95 67300002
         LABEL '1  CS DATA CHK','1  B-PRTY CHK'                @M04AE95 67350002
         LINE  (20,29),(2,29),SKIP=0                           @M04AE95 67370002
         CONVT SNSCT2,2,5                                      @M04AE95 67400002
         CONVT SNSCT10,2,5                                     @M04AE95 67450002
         LABEL '2  BUS OUT CHK','2  FEED CMD REQD'             @M04AE95 67500002
         LINE  (83,32),(62,32),SKIP=1                          @M04AE95 67550002
         CONVT PROCT2,2,5                                      @M04AE95 67570002
         CONVT PROCT10,2,5                                     @M04AE95 67600002
         LABEL '2  CS ADDR CHK','2  SCAN BUFR CHK'             @M04AE95 67650002
         LINE  (20,29),(2,29),SKIP=0                           @M04AE95 67700002
         CONVT SNSCT3,2,5                                      @M04AE95 67750002
         CONVT SNSCT11,2,5                                     @M04AE95 67770002
         LABEL '3  EQUIP CHK','3  RESERVED'                    @M04AE95 67800002
         LINE  (83,32),(62,32),SKIP=1                          @M04AE95 67850002
         CONVT PROCT3,2,5                                      @M04AE95 67900002
         CONVT PROCT11,2,5                                     @M04AE95 67950002
         LABEL '3  CYCLE CTL CHK','3  CHAN TIME-OUT'           @XA20886 67970001
         LINE  (20,29),(2,29),SKIP=0                           @M04AE95 68000002
         CONVT SNSCT4,2,5                                      @M04AE95 68050002
         CONVT SNSCT12,2,5                                     @M04AE95 68100002
         LABEL '4  DATA CHK','4  INVALID CMD'                  @M04AE95 68150002
         LINE  (83,32),(62,32),SKIP=1                          @M04AE95 68170002
         CONVT PROCT4,2,5                                      @M04AE95 68200002
         CONVT PROCT12,2,5                                     @M04AE95 68250002
         LABEL '4  RESERVED','4  RESERVED'                     @M04AE95 68300001
         LINE  (20,29),(2,29),SKIP=0                           @M04AE95 68350002
         CONVT SNSCT5,2,5                                      @M04AE95 68370002
         CONVT SNSCT13,2,5                                     @M04AE95 68400002
         LABEL '5  RESERVED','5  INCOMP PROC'                  @M04AE95 68450002
         LINE  (83,32),(62,32),SKIP=1                          @M04AE95 68500002
         CONVT PROCT5,2,5                                      @M04AE95 68550002
         CONVT PROCT13,2,5                                     @M04AE95 68570002
         LABEL '5  RESERVED','5  RESERVED'                     @M04AE95 68600001
         LINE  (20,29),(2,29),SKIP=0                           @M04AE95 68650002
         CONVT SNSCT6,2,5                                      @M04AE95 68700002
         CONVT SNSCT14,2,5                                     @M04AE95 68750002
         LABEL '6  NOT INIT','6  MERGE FEED'                   @M04AE95 68770002
         LINE (83,32),(62,32),SKIP=1                           @M04AE95 68800002
         CONVT PROCT6,2,5                                      @M04AE95 68850002
         CONVT PROCT14,2,5                                     @M04AE95 68900002
         LABEL '6  RESERVED','6  RESERVED'                     @M04AE95 68950001
         LINE  (20,29),(2,29),SKIP=0                           @M04AE95 68970002
         CONVT SNSCT7,2,5                                      @M04AE95 69000002
         CONVT SNSCT15,2,5                                     @M04AE95 69050002
         LABEL '7  RUNNING','7  PROC NOT FUNC'                 @M04AE95 69100002
         LINE  (83,32),(62,32),SKIP=2                          @M04AE95 69150002
         CONVT PROCT7,2,5                                      @M04AE95 69170002
         CONVT PROCT15,2,5                                     @M04AE95 69200002
         LABEL '7  RESERVED','7  RESERVED'                     @M04AE95 69250001
         LINE  ,,SKIP=1                                        @XA20891 69260001
         ROUTINE YDUMA,SKIP                                    @M04AE95 69270002
         LABEL ''                                              @M04AE95 69280002
         LINE  (1,1),(47),SKIP=2                               @M04AE95 69300002
         ROUTINE YDUMA,SKIP                                    @M04AE95 69350002
         LABEL '--- EXTENDED SENSE DATA ---'                   @M04AE95 69370002
         LINE  (1,1),(1,31),SKIP=1                             @XA20891 69400001
         ROUTINE YDUMA,SKIP                                    @M04AE95 69450002
         LABEL 'BIT BYTE 0           COUNT',                   @M04AE95*69500002
               'BIT BYTE 1           COUNT',                   @M04AE95*69550002
               'BIT BYTE 2           COUNT',                   @M04AE95*69570002
               'BIT BYTE 3           COUNT'                    @M04AE95 69600002
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 69650002
         CONVT EXTCT0,2,5                                      @M04AE95 69700002
         CONVT EXTCT8,2,5                                      @M04AE95 69750002
         CONVT EXTCT16,2,5                                     @M04AE95 69770002
         CONVT EXTCT24,2,5                                     @M04AE95 69800002
         LABEL '0  CTL ERR','0  RESERVED',                     @M04AE95*69850002
               '0  M-BUFR PRTY CHK','0  BEAM NOT MVNG'         @M04AE95 69900002
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 69950002
         CONVT EXTCT1,2,5                                      @M04AE95 69970002
         CONVT EXTCT9,2,5                                      @M04AE95 70000002
         CONVT EXTCT17,2,5                                     @M04AE95 70050002
         CONVT EXTCT25,2,5                                     @M04AE95 70100002
         LABEL '1  PRT COIL ERR','1  BUFR PRTY CHK',           @M04AE95*70150002
               '1  CMP ST PRTY CHK','1  RTS, NO TRACE'         @M04AE95 70170001
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 70200002
         CONVT EXTCT2,2,5                                      @M04AE95 70250002
         CONVT EXTCT10,2,5                                     @M04AE95 70300002
         CONVT EXTCT18,2,5                                     @M04AE95 70350002
         CONVT EXTCT26,2,5                                     @M04AE95 70370002
         LABEL '2  INS COIL ERR','2  RESERVED',                @M04AE95*70400002
               '2  M-BUFR ADDR CHK','2  WINDOW OVRSCN'         @M04AE95 70450002
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 70500002
         CONVT EXTCT3,2,5                                      @M04AE95 70550002
         CONVT EXTCT11,2,5                                     @M04AE95 70570002
         CONVT EXTCT19,2,5                                     @M04AE95 70600002
         CONVT EXTCT27,2,5                                     @M04AE95 70650002
         LABEL '3  BUFR PRTY CHK','3  RESERVED',               @M04AE95*70700002
               '3  CMP ST ADDR CHK','3  ROTATION ERR'          @M04AE95 70750001
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 70770002
         CONVT EXTCT4,2,5                                      @M04AE95 70800002
         CONVT EXTCT12,2,5                                     @M04AE95 70850002
         CONVT EXTCT20,2,5                                     @M04AE95 70900002
         CONVT EXTCT28,2,5                                     @M04AE95 70950002
         LABEL '4  BUFR ADDR CHK','4  BUFR CHR OVRN',          @M04AE95*70970002
               '4  PROG CHK','4  READ DATA CHK'                @M04AE95 71000002
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 71050002
         CONVT EXTCT5,2,5                                      @M04AE95 71100002
         CONVT EXTCT13,2,5                                     @M04AE95 71150002
         CONVT EXTCT21,2,5                                     @M04AE95 71170002
         CONVT EXTCT29,2,5                                     @M04AE95 71200002
         LABEL '5  RESERVED','5  RESERVED',                    @M04AE95*71250002
               '5  TIME-OUT ERR','5  WRITE DATA CHK'           @M04AE95 71300001
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 71350002
         CONVT EXTCT6,2,5                                      @M04AE95 71370002
         CONVT EXTCT14,2,5                                     @M04AE95 71400002
         CONVT EXTCT22,2,5                                     @M04AE95 71450002
         CONVT EXTCT30,2,5                                     @M04AE95 71500002
         LABEL '6  RESERVED','6  RESERVED','6  DCS SPEC ERR',  @XA20889*71550001
               '6  LOW CRT PMT 1'                              @XA20888 71570001
         LINE  (22,31),(2,31),SKIP=3                           @M04AE95 71600002
         CONVT EXTCT7,2,5                                      @M04AE95 71650002
         CONVT EXTCT15,2,5                                     @M04AE95 71700002
         CONVT EXTCT23,2,5                                     @M04AE95 71750002
         CONVT EXTCT31,2,5                                     @M04AE95 71770002
         LABEL '7  RESERVED','7  RESERVED','7  RESERVED',      @M04AE95*71800002
               '7  LOW DOC PMT 1'                              @XA20888 71850001
         LINE  (1,1),(1,31),SKIP=1                             @XA20891 71900001
         ROUTINE YDUMA,SKIP                                    @M04AE95 71950002
         LABEL 'BIT BYTE 4           COUNT',                   @M04AE95*71970001
               'BIT BYTE 5           COUNT',                   @M04AE95*71980001
               'BIT BYTE 16          COUNT',                   @M04AE95*72000001
               'BIT BYTE 20          COUNT'                    @XA20885 72020001
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 72100001
         CONVT EXTCT32,2,5                                     @M04AE95 72150002
         CONVT EXTCT40,2,5                                     @M04AE95 72170002
         CONVT EXTCT48,2,5                                     @M04AE95 72200002
         CONVT EXTCT56,2,5                                     @M04AE95 72220001
         LABEL '0  ENDORSER CHK','0  MCS PRTY CHK',            @M04AE95*72250002
               '0  RESERVED','0  CHAN ADAPT'                   @XA20885 72300001
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 72320001
         CONVT EXTCT33,2,5                                     @M04AE95 72370002
         CONVT EXTCT41,2,5                                     @M04AE95 72400002
         CONVT EXTCT49,2,5                                     @M04AE95 72450002
         CONVT EXTCT57,2,5                                     @M04AE95 72470001
         LABEL '1  RESERVED','1  MCS HANG CHK','1  RESERVED',  @M04AE95*72500001
               '1  RUN CTL'                                    @XA20885 72520001
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 72550001
         CONVT EXTCT34,2,5                                     @M04AE95 72570002
         CONVT EXTCT42,2,5                                     @M04AE95 72600002
         CONVT EXTCT50,2,5                                     @M04AE95 72650002
         CONVT EXTCT58,2,5                                     @M04AE95 72670001
         LABEL '2  RESERVED','2  INVLD OP CODE',               @M04AE95*72700002
               '2  NON-SELECT CHK','2  MICR'                   @XA20885 72750001
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 72760001
         CONVT EXTCT35,2,5                                     @M04AE95 72800002
         CONVT EXTCT43,2,5                                     @M04AE95 72850002
         CONVT EXTCT51,2,5                                     @M04AE95 72900002
         CONVT EXTCT59,2,5                                     @M04AE95 72920001
         LABEL '3  RESERVED','3  VIS ADDR CHK',                @M04AE95*72950002
               '3  GET DATA CHK','3  DIH'                      @XA20885 72970001
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 72980001
         CONVT EXTCT36,2,5                                     @M04AE95 73050002
         CONVT EXTCT44,2,5                                     @M04AE95 73100002
         CONVT EXTCT52,2,5                                     @M04AE95 73150002
         CONVT EXTCT60,2,5                                     @M04AE95 73160001
         LABEL '4  RESERVED','4  RESERVED','4  PUT DATA CHK',  @M04AE95*73170001
               '4  INS/PRT'                                    @XA20885 73180001
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 73200001
         CONVT EXTCT37,2,5                                     @M04AE95 73250002
         CONVT EXTCT45,2,5                                     @M04AE95 73300002
         CONVT EXTCT53,2,5                                     @M04AE95 73350002
         CONVT EXTCT61,2,5                                     @M04AE95 73360001
         LABEL '5  RESERVED','5  RESERVED','5  TAG CHK',       @M04AE95*73370001
               '5  OCR'                                        @XA20885 73380001
         LINE  (22,31),(2,31),SKIP=1                           @M04AE95 73400001
         CONVT EXTCT38,2,5                                              74050002
         CONVT EXTCT46,2,5                                              74100002
         CONVT EXTCT54,2,5                                              74150002
         CONVT EXTCT62,2,5                                     @M04AE95 74160001
         LABEL '6  RESERVED','6  RESERVED','6  SELECT CHK',    @M04AE95*74170001
               '6  MICROFILM'                                  @XA20885 74180001
         LINE  (22,31),(2,31),SKIP=3                           @XA20891 74200001
         CONVT EXTCT39,2,5                                              74220002
         CONVT EXTCT47,2,5                                              74250002
         CONVT EXTCT55,2,5                                              74300002
         CONVT EXTCT63,2,5                                     @M04AE95 74310001
         LABEL '7  RESERVED','7  RESERVED','7  ADDR CHK',      @M04AE95*74320001
               '7  GENERAL'                                    @XA20885 74420001
         LINE  (1,1),(1,31),SKIP=1                             @XA20885 74427001
         ROUTINE YDUMA,SKIP                                    @XA20885 74434001
         LABEL 'BIT BYTE 22          COUNT',                   @XA20885*74441001
               'BIT BYTE 23          COUNT'                    @XA20885 74448001
         LINE  (22,31),(2,31),SKIP=1                           @XA20885 74455001
         CONVT EXTCT64,2,5                                     @XA20885 74462001
         CONVT EXTCT72,2,5                                     @XA20885 74469001
         LABEL '0  LAMP CHK PRT','0  A-PRTY CHK'               @XA20885 74476001
         LINE  (22,31),(2,31),SKIP=1                           @XA20885 74483001
         CONVT EXTCT65,2,5                                     @XA20885 74490001
         CONVT EXTCT73,2,5                                     @XA20885 74497001
         LABEL '1  LAMP CHK RR','1  B-PRTY CHK'                @XA20885 74504001
         LINE  (22,31),(2,31),SKIP=1                           @XA20885 74511001
         CONVT EXTCT66,2,5                                     @XA20885 74518001
         CONVT EXTCT74,2,5                                     @XA20885 74525001
         LABEL '2  CAPSTAN CHK','2  FB ADDR CHK'               @XA20885 74532001
         LINE  (22,31),(2,31),SKIP=1                           @XA20885 74539001
         CONVT EXTCT67,2,5                                     @XA20885 74546001
         CONVT EXTCT75,2,5                                     @XA20885 74553001
         LABEL '3  SHUTTER CHK','3  VB ADDR CHK'               @XA20885 74560001
         LINE  (22,31),(2,31),SKIP=1                           @XA20885 74567001
         CONVT EXTCT68,2,5                                     @XA20885 74574001
         CONVT EXTCT76,2,5                                     @XA20885 74581001
         LABEL '4  RESERVED','4  FB PRTY CHK'                  @XA20885 74588001
         LINE  (22,31),(2,31),SKIP=1                           @XA20885 74595001
         CONVT EXTCT69,2,5                                     @XA20885 74602001
         CONVT EXTCT77,2,5                                     @XA20885 74609001
         LABEL '5  RESERVED','5  VB PRTY CHK'                  @XA20885 74616001
         LINE  (22,31),(2,31),SKIP=1                           @XA20885 74623001
         CONVT EXTCT70,2,5                                     @XA20885 74630001
         CONVT EXTCT78,2,5                                     @XA20885 74637001
         LABEL '6  RESERVED','6  CHAN TIME-OUT'                @XA20885 74644001
         LINE  (22,31),(2,31),SKIP=1                           @XA20885 74651001
         CONVT EXTCT71,2,5                                     @XA20885 74658001
         CONVT EXTCT79,2,5                                     @XA20885 74665001
         LABEL '7  RESERVED','7  RESERVED'                     @XA20885 74672001
         LINE  ,,SKIP=E                                                 74700002
         ROUTINE YDUMA,SKIP                                             74750002
         LABEL ' '                                                      74800002
MDR      LINE  ,,SKIP=0                                        @XA19531 74810001
         ROUTINE MDRCD,CKMDRCNT                                @XA19531 74820001
MDR1     LABEL  ' '                                            @XA19531 74830001
         LINE  (97,18),(1,103),SKIP=2                                   74850002
         HEX   YCPU,0,2B                                                74900002
         HEX   YSER,0,3B                                                74950002
         LABEL 'SUMMARY OF I/O RECORDS     TYPE - MDR     SOURCE - MISC*75000002
               ELLANEOUS     DEVICE TYPE 3895     MODEL ','SERIAL NO.'  75050001
         LINE  (24,21),(3,60),SKIP=1                           @XA19168 75100001
         HEX   YCUA,0,2B                                       @XA19168 75150001
         LABEL 'CHANNEL/UNIT ADDRESS','DAY YEAR    DAY YEAR'   @XA19168 75200001
         LINE  (63,12),(51,20),SKIP=2                                   75250002
         ROUTINE LODATE,SETDATE                                         75300002
         ROUTINE HIDATE,SETDATE                                         75350002
         LABEL 'DATE RANGE','TO'                                        75400002
         LINE  (29,1),(1,1),SKIP=1                             @XA19168 75450001
         CONVT TYPCT0,2,5                                               75500002
         LABEL 'COUNTER OVERFLOW RECORDS'                               75550002
         LINE                                                           75600002
         CONVT TYPCT1,2,5                                               75650002
         LABEL 'OFFLINE/END-OF-DAY RECORDS'                    @XA19168 75700001
         LINE  (1,1),(29,1),SKIP=1                             @XA19168 75750001
         ROUTINE YDUMA,SKIP                                             75800002
         LABEL '-----'                                                  75850002
         LINE  (29,43),(1,50),SKIP=2                           @XA19168 75900001
         CONVT MDRCD,2,5                                                75950002
         CONVT TYPCT2,2,5                                      @XA19168 75970001
         LABEL 'TOTAL NUMBER OF RECORDS','PREDICTOR FAILURES -'         76000001
         LINE  (1,1),(1,31),SKIP=1                             @M04AE95 76050002
         ROUTINE YDUMA,SKIP                                    @M04AE95 76070002
         LABEL '--OPERATIONS--------------',                   @M04AE95*76100002
               '--MICR 1 PERFORMANCE------',                   @M04AE95*76120002
               '--MICR 2 PERFORMANCE------',                   @M04AE95*76150002
               '--FE COUNTERS-------------'                    @M04AE95 76200002
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 76220002
         CONVT TWOBYT0,4,8                                     @M04AE95 76250002
         CONVT TWOBYT32,4,8                                    @M04AE95 76270002
         CONVT TWOBYT40,4,8                                    @M04AE95 76300002
         CONVT TWOBYT44,4,8                                    @M04AE95 76350002
         LABEL 'TOTAL DOCS','AMT PRES, INVLD',                 @M04AE95*76370002
               'ERROR DOCS','COUNTER 1, LOC 88'                @XA20891 76400001
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 76420002
         CONVT TWOBYT1,4,8                                     @M04AE95 76450002
         CONVT TWOBYT33,4,8                                    @M04AE95 76500002
         CONVT TWOBYT41,4,8                                    @M04AE95 76520002
         CONVT TWOBYT45,4,8                                    @M04AE95 76550002
         LABEL 'MERGE DOCS','TPC PRES, INVLD',                 @M04AE95*76570002
               'EARLY START','COUNTER 2, LOC 90'               @XA20891 76600001
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 76650002
         CONVT TWOBYT2,4,8                                     @M04AE95 76670002
         CONVT TWOBYT34,4,8                                    @M04AE95 76700002
         CONVT TWOBYT42,4,8                                    @M04AE95 76720002
         CONVT TWOBYT46,4,8                                    @M04AE95 76750002
         LABEL 'DOCS INSCRIBED','ACT PRES, INVLD',             @M04AE95*76800002
               'SHORT TERM ERR','COUNTER 3, LOC 92'            @XA20891 76820001
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 76850002
         CONVT TWOBYT3,4,8                                     @M04AE95 76870002
         CONVT TWOBYT35,4,8                                    @M04AE95 76900002
         CONVT TWOBYT43,4,8                                    @M04AE95 76950002
         CONVT TWOBYT47,4,8                                    @M04AE95 76970002
         LABEL 'SEC FLD INSCRIBES','TNF PRES, INVLD',          @M04AE95*77000002
               'LONG TERM ERR','COUNTER 4, LOC 94'             @XA20891 77020001
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 77050002
         CONVT TWOBYT4,4,8                                     @M04AE95 77100002
         CONVT TWOBYT36,4,8                                    @M04AE95 77120002
         LABEL 'EXTENDED PRINTS','AUX PRES, INVLD'             @XA20890 77150001
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 77170002
         CONVT TWOBYT5,4,8                                     @M04AE95 77200002
         CONVT TWOBYT37,4,8                                    @M04AE95 77250002
         LABEL 'LATE STOP','PEAK ERR',                         @XA20897*77270001
               '--ELECTRONIC DSF/IDENTICAL AMOUNT----------------------*77277001
               --'                                             @XA20897 77284001
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 77300002
         CONVT TWOBYT6,4,8                                     @M04AE95 77320002
         CONVT TWOBYT38,4,8                                    @M04AE95 77350002
         CONVT TWOBYT48,4,8                                    @XA20897 77400001
         CONVT TWOBYT49,4,8                                    @XA20897 77405001
         LABEL 'INCREMENT','CONFLICT','EDSF HEADER DOCS','CHECKS/EDSF'  77410001
         LINE  (19,31),(1,31),SKIP=2                           @M04AE95 77420002
         CONVT TWOBYT7,4,8                                     @M04AE95 77450002
         CONVT TWOBYT39,4,8                                    @M04AE95 77470002
         CONVT TWOBYT50,4,8                                    @XA20897 77500001
         CONVT TWOBYT51,4,8                                    @XA20897 77510001
         LABEL 'LATE CPU RESP','RESERVED','ACPTS/EDSF',        @XA20890*77520001
               'CHECKS/IDENT AMT'                              @XA20897 77530001
         LINE  (1,1),(1),SKIP=1                                @M04AE95 77550002
         ROUTINE YDUMA,SKIP                                    @M04AE95 77570002
         LABEL '--OCR PERFORMANCE--------------------------------------*78100002
               --------------------------------------------------------*78150002
               --------'                                       @M04AE95 78200002
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 78220002
         CONVT TWOBYT8,4,8                                     @M04AE95 78250002
         CONVT TWOBYT9,4,8                                     @M04AE95 78300002
         CONVT TWOBYT10,4,8                                    @M04AE95 78320002
         CONVT TWOBYT11,4,8                                    @M04AE95 78350002
         LABEL 'CASH TICKET','ADD MACH TAPE',                  @M04AE95*78370002
               'FIX ENT DEP SLIP','CASH CHECK TRANS'           @M04AE95 78400002
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 78450002
         CONVT TWOBYT12,4,8                                    @M04AE95 78470002
         CONVT TWOBYT13,4,8                                    @M04AE95 78500002
         CONVT TWOBYT14,4,8                                    @M04AE95 78520002
         CONVT TWOBYT15,4,8                                    @M04AE95 78550002
         LABEL 'DIH MATCH','BAR CODES','BUSNS DEP SLIP',       @M04AE95*78600002
               'PERS DEP SLIP'                                 @M04AE95 78620002
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 78650002
         CONVT TWOBYT16,4,8                                    @M04AE95 78670002
         CONVT TWOBYT17,4,8                                    @M04AE95 78700002
         CONVT TWOBYT18,4,8                                    @M04AE95 78750002
         CONVT TWOBYT19,4,8                                    @M04AE95 78770002
         LABEL 'ACPTS/DEP SLIP','CHECKS/DEP SLIP',             @XA20891*78800001
               'CHECKS/AM TAPE','OCR1 VLD ON CHECK'            @XA20891 78810001
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 78850002
         CONVT TWOBYT20,4,8                                    @M04AE95 78900002
         CONVT TWOBYT21,4,8                                    @M04AE95 78920002
         CONVT TWOBYT22,4,8                                    @M04AE95 78950002
         CONVT TWOBYT23,4,8                                    @M04AE95 78970002
         LABEL 'OCR3 VLD ON CHECK','BUSNS CHECK',              @XA20891*79000001
               'BUSNS CHECK FTF','BUSNS CHECK FGR'             @M04AE95 79050002
         LINE  (19,31),(1,31),SKIP=1                           @M04AE95 79070002
         CONVT TWOBYT24,4,8                                    @M04AE95 79100002
         CONVT TWOBYT25,4,8                                    @M04AE95 79120002
         CONVT TWOBYT26,4,8                                    @M04AE95 79150002
         CONVT TWOBYT27,4,8                                    @M04AE95 79200002
         LABEL 'PERS CHECK','PERS CHECK FTF','PERS CHECK FGR', @M04AE95*79220002
               'DOC STOP RJCT'                                 @M04AE95 79250002
         LINE  (19,31),(1,31),SKIP=2                           @M04AE95 79270002
         CONVT TWOBYT28,4,8                                    @M04AE95 79300002
         CONVT TWOBYT29,4,8                                    @M04AE95 79350002
         CONVT TWOBYT30,4,8                                    @M04AE95 79370002
         CONVT TWOBYT31,4,8                                    @M04AE95 79400002
         LABEL 'CLIP LVL X-HIGH','CLIP LVL HIGH',              @M04AE95*79420002
               'CLIP LVL MEDIUM','CLIP LVL LOW'                @M04AE95 79450002
         LINE  (114),(1,93),SKIP=1                             @M04AE95 79500001
         CONVT ONEBY74,4,6                                     @XA20899 79530001
         LABEL '--JAM/STOPS, DEGRADATION-------',              @XA20899*79560001
               'ABORTED DOCS'                                  @XA20899 79590001
         LINE  ,(14),SKIP=1                                    @XA20899 79620001
         LABEL 'DOC LATE   DEGRADE'                            @XA20899 79650001
         LINE  (16,10),(1,38),SKIP=1                           @XA20899 79680001
         CONVT ONEBY0,4,6                                      @XA20899 79810001
         CONVT ONEBY14,4,6                                     @XA20899 79860001
         LABEL 'ALIGNER DS',                                   @M04AE95*80250001
               '--COMMON CHANNEL ERRORS--------------------------------*80260001
               --------------------------------'               @XA19168 80270001
         LINE  (16,10),(1,38),SKIP=1                           @XA20899 80300001
         CONVT ONEBY1,4,6                                      @XA20899 80330001
         CONVT ONEBY15,4,6                                     @XA20899 80360001
         LABEL 'MICR 1 DS','ERROR/UNIT       CHANNEL  RUN CTL   MICR   *80390001
                  DIH    INS/PRT   RECO     MFILM    RSRVD'    @XA20891 80420001
         LINE  (16,10),(1,38),SKIP=0                           @XA20899 80450001
         CONVT ONEBY2,4,6                                      @XA20899 80480001
         CONVT ONEBY16,4,6                                     @XA20899 80510001
         LABEL 'PRESCAN DS','NON-SELECT CHK'                   @M04AE95 80540001
         LINE  (56,9),,SKIP=1                                  @XA20899 80570001
         CONVT ONEBY26,4,6                                     @XA20899 80660001
         CONVT ONEBY27,4,6                                     @XA20899 80670001
         CONVT ONEBY28,4,6                                     @XA20899 80680001
         CONVT ONEBY29,4,6                                     @XA20899 80690001
         CONVT ONEBY30,4,6                                     @XA20899 80700001
         CONVT ONEBY31,4,6                                     @XA20899 80710001
         CONVT ONEBY32,4,6                                     @XA20899 80720001
         CONVT ONEBY33,4,6                                     @XA20899 80730001
         LABEL ''                                              @XA20899 80740001
         LINE  (26),(1,16),SKIP=0                              @XA20899 80750001
         CONVT ONEBY17,4,6                                     @XA20899 80758001
         LABEL 'MERGE DS','----'                               @XA20899 80766001
         LINE  ,(39),SKIP=0                                    @XA20899 80774001
         LABEL 'GET DATA CHK'                                  @XA20899 80782001
         LINE  (56,9),,SKIP=1                                  @XA20899 80790001
         CONVT ONEBY34,4,6                                     @XA20899 80810001
         CONVT ONEBY35,4,6                                     @XA20899 80820001
         CONVT ONEBY36,4,6                                     @XA20899 80830001
         CONVT ONEBY37,4,6                                     @XA20899 80840001
         CONVT ONEBY38,4,6                                     @XA20899 80850001
         CONVT ONEBY39,4,6                                     @XA20899 80860001
         CONVT ONEBY40,4,6                                     @XA20899 80870001
         CONVT ONEBY41,4,6                                     @XA20899 80880001
         LABEL ''                                              @XA20899 80890001
         LINE  (26),(1,16),SKIP=0                              @XA20899 80900001
         CONVT ONEBY18,4,6                                     @XA20899 80908001
         LABEL 'SCAN DS','----'                                @XA20899 80916001
         LINE  ,(39),SKIP=0                                    @XA20899 80924001
         LABEL 'PUT DATA CHK'                                  @XA20899 80932001
         LINE  (56,9),,SKIP=1                                  @XA20899 80940001
         CONVT ONEBY42,4,6                                     @XA20899 80960001
         CONVT ONEBY43,4,6                                     @XA20899 80970001
         CONVT ONEBY44,4,6                                     @XA20899 80980001
         CONVT ONEBY45,4,6                                     @XA20899 80990001
         CONVT ONEBY46,4,6                                     @XA20899 81000001
         CONVT ONEBY47,4,6                                     @XA20899 81010001
         CONVT ONEBY48,4,6                                     @XA20899 81020001
         CONVT ONEBY49,4,6                                     @XA20899 81030001
         LABEL ''                                              @XA20899 81040001
         LINE  (26),(1,16),SKIP=0                              @XA20899 81050001
         CONVT ONEBY3,4,6                                      @XA20899 81058001
         LABEL 'SCAN DS, PRIM','----'                          @XA20899 81066001
         LINE  ,(39),SKIP=0                                    @XA20899 81074001
         LABEL 'TAG CHK'                                       @XA20899 81082001
         LINE  (56,9),,SKIP=1                                  @XA20899 81090001
         CONVT ONEBY50,4,6                                     @XA20899 81110001
         CONVT ONEBY51,4,6                                     @XA20899 81120001
         CONVT ONEBY52,4,6                                     @XA20899 81130001
         CONVT ONEBY53,4,6                                     @XA20899 81140001
         CONVT ONEBY54,4,6                                     @XA20899 81150001
         CONVT ONEBY55,4,6                                     @XA20899 81160001
         CONVT ONEBY56,4,6                                     @XA20899 81170001
         CONVT ONEBY57,4,6                                     @XA20899 81180001
         LABEL ''                                              @XA20899 81190001
         LINE  (26),(1,16),SKIP=0                              @XA20899 81200001
         CONVT ONEBY4,4,6                                      @XA20899 81208001
         LABEL 'SCAN DS, MERGE','----'                         @XA20899 81216001
         LINE  ,(39),SKIP=0                                    @XA20899 81224001
         LABEL 'SELECT CHK'                                    @XA20899 81232001
         LINE  (56,9),,SKIP=1                                  @XA20899 81240001
         CONVT ONEBY58,4,6                                     @XA20899 81260001
         CONVT ONEBY59,4,6                                     @XA20899 81270001
         CONVT ONEBY60,4,6                                     @XA20899 81280001
         CONVT ONEBY61,4,6                                     @XA20899 81290001
         CONVT ONEBY62,4,6                                     @XA20899 81300001
         CONVT ONEBY63,4,6                                     @XA20899 81310001
         CONVT ONEBY64,4,6                                     @XA20899 81320001
         CONVT ONEBY65,4,6                                     @XA20899 81330001
         LABEL ''                                              @XA20899 81340001
         LINE  (16,10),(1,38),SKIP=0                           @XA20899 81350001
         CONVT ONEBY5,4,6                                      @XA20899 81358001
         CONVT ONEBY19,4,6                                     @XA20899 81366001
         LABEL 'PRE-INSCRIBE DS','ADDR CHK'                    @XA20899 81374001
         LINE  (56,9),,SKIP=1                                  @XA20899 81382001
         CONVT ONEBY66,4,6                                     @XA20899 81400001
         CONVT ONEBY67,4,6                                     @XA20899 81410001
         CONVT ONEBY68,4,6                                     @XA20899 81420001
         CONVT ONEBY69,4,6                                     @XA20899 81430001
         CONVT ONEBY70,4,6                                     @XA20899 81440001
         CONVT ONEBY71,4,6                                     @XA20899 81450001
         CONVT ONEBY72,4,6                                     @XA20899 81460001
         CONVT ONEBY73,4,6                                     @XA20899 81470001
         LABEL ''                                              @XA20899 81480001
         LINE  (16,10),(1),SKIP=1                              @XA20899 81490001
         CONVT ONEBY6,4,6                                      @XA20899 81498001
         CONVT ONEBY20,4,6                                     @XA20899 81506001
         LABEL 'INSCRIBE DS'                                   @XA20899 81514001
         LINE  (16,10),(1,38),SKIP=1                           @XA20899 81522001
         CONVT ONEBY7,4,6                                      @XA20899 81540001
         CONVT ONEBY21,4,6                                     @XA20899 81550001
         LABEL 'MICR 2 DS','--VIDEO ERRORS----------     --RECO ERRORS-*81560001
               ----------     --DIH ERRORS------------'        @XA20899 81570001
         LINE  (16,10),(1),SKIP=0                              @XA20899 81580001
         CONVT ONEBY8,4,6                                      @XA20899 81590001
         CONVT ONEBY22,4,6                                     @XA20899 81600001
         LABEL '1ST BAY DS'                                    @XA20899 81610001
         LINE  (56,30),(38,30),SKIP=1                          @XA20899 81620001
         CONVT ONEBY75,4,6                                     @XA20899 81630001
         CONVT ONEBY85,4,6                                     @XA20899 81640001
         CONVT ONEBY90,4,6                                     @XA20899 81650001
         LABEL 'SCF ON DEP DOC','MCS PRTY CHK','M-BUFR PRTY CHK'        81660001
         LINE  (16,10),(1),SKIP=0                              @XA20899 81670001
         CONVT ONEBY9,4,6                                      @XA20899 81680001
         CONVT ONEBY23,4,6                                     @XA20899 81690001
         LABEL '2ND BAY DS'                                    @XA20899 81700001
         LINE  (56,30),(38,30),SKIP=1                          @XA20899 81710001
         CONVT ONEBY76,4,6                                     @XA20899 81720001
         CONVT ONEBY86,4,6                                     @XA20899 81730001
         CONVT ONEBY91,4,6                                     @XA20899 81740001
         LABEL 'SCF ON CHECK','MCS HANG CHK','M-BUFR ADDR CHK' @XA20899 81750001
         LINE  (26),(1),SKIP=0                                 @XA20899 81760001
         CONVT ONEBY24,4,6                                     @XA20899 81770001
         LABEL 'MFILM RESYNC DS ----'                          @XA20899 81780001
         LINE  (56,30),(38,30),SKIP=1                          @XA20899 81790001
         CONVT ONEBY77,4,6                                     @XA20899 81800001
         CONVT ONEBY87,4,6                                     @XA20899 81810001
         CONVT ONEBY92,4,6                                     @XA20899 81820001
         LABEL 'ROTATION ERR','INVLD OP CODE','CMP ST PRTY CHK'         81830001
         LINE  (26),(1),SKIP=0                                 @XA20899 81840001
         CONVT ONEBY25,4,6                                     @XA20899 81850001
         LABEL 'MFILM EXIT DS   ----'                          @XA20899 81860001
         LINE  (56,30),(38,30),SKIP=1                          @XA20899 81870001
         CONVT ONEBY78,4,6                                     @XA20899 81880001
         CONVT ONEBY88,4,6                                     @XA20899 81890001
         CONVT ONEBY93,4,6                                     @XA20899 81900001
         LABEL 'WINDOW OVRSCN','VIS ADDR CHK','CMP ST ADDR CHK'         81910001
         LINE  (20),(1),SKIP=0                                 @XA20899 81920001
         CONVT ONEBY10,4,6                                     @XA20899 81930001
         LABEL 'STCKR SWITCH JAM'                              @XA20899 81940001
         LINE  (56,30),(38,30),SKIP=1                          @XA20899 81950001
         CONVT ONEBY79,4,6                                     @XA20899 81960001
         CONVT ONEBY89,4,6                                     @XA20899 81970001
         CONVT ONEBY94,4,6                                     @XA20899 81980001
         LABEL 'RTS, NO TRACE','RESERVRD','PROGRAM CHK'        @XA20899 81990001
         LINE  (20),(1),SKIP=0                                 @XA20899 82000001
         CONVT ONEBY11,4,6                                     @XA20899 82010001
         LABEL 'STUB/LNG DOC STOP'                             @XA20899 82020001
         LINE  (56,60),(38,60),SKIP=1                          @XA20899 82030001
         CONVT ONEBY80,4,6                                     @XA20899 82040001
         CONVT ONEBY95,4,6                                     @XA20899 82050001
         LABEL 'BEAM NOT MVNG','TIME-OUT ERR'                  @XA20899 82060001
         LINE  (20),(1),SKIP=0                                 @XA20899 82070001
         CONVT ONEBY12,4,6                                     @XA20899 82080001
         LABEL 'MICR RIBBON STOP'                              @XA20899 82090001
         LINE  (56),(38),SKIP=0                                @XA20899 82100001
         CONVT ONEBY81,4,6                                     @XA20899 82110001
         LABEL 'READ DATA CHK'                                 @XA20899 82120001
         LINE  (116),(68,30),SKIP=1                            @XA20899 82130001
         CONVT ONEBY96,4,6                                     @XA20899 82140001
         LABEL '--MICROFILM ERRORS------','DCS SPEC ERR'       @XA20899 82150001
         LINE  (20),(1),SKIP=0                                 @XA20899 82160001
         CONVT ONEBY13,4,6                                     @XA20899 82170001
         LABEL 'MFILM JAM'                                     @XA20891 82180001
         LINE  (56,30),(38,30),SKIP=1                          @XA20899 82190001
         CONVT ONEBY82,4,6                                     @XA20899 82200001
         CONVT ONEBY103,4,6                                    @XA20899 82210001
         CONVT ONEBY97,4,6                                     @XA20899 82220001
         LABEL 'WRITE DATA CHK','FILM CHK','RESERVED'          @XA20899 82230001
         LINE  (56,30),(38,30),SKIP=1                          @XA20899 82240001
         CONVT ONEBY83,4,6                                     @XA20899 82250001
         CONVT ONEBY104,4,6                                    @XA20899 82260001
         LABEL 'LOW DOC PMT I','CAPSTAN CHK'                   @XA20899 82270001
         LINE  (56,30),(38,30),SKIP=1                          @XA20899 82280001
         CONVT ONEBY84,4,6                                     @XA20899 82290001
         CONVT ONEBY105,4,6                                    @XA20899 82300001
         LABEL 'LOW CRT PMT I','SHUTTER CHK',                  @XA20899*82310001
               '--MICR ERRORS-----------'                      @XA20899 82320001
         LINE  (116),(98),SKIP=2                               @XA20899 82330001
         CONVT ONEBY102,4,6                                    @XA20899 82340001
         LABEL 'BUFR PRTY CHK'                                 @XA20899 82350001
         LINE  ,(1,68),SKIP=1                                  @XA20899 82360001
         LABEL '--OTHER COUNTERS---------------------------------------*82370001
               --','--OTHER ERRORS----------'                  @XA20899 82380001
         LINE  (19,32),(1,32),SKIP=0                           @XA20899 82390001
         CONVT TWOBYT52,4,8                                    @XA20899 82400001
         CONVT TWOBYT53,4,8                                    @XA20899 82410001
         LABEL 'LOC 104','LOC 106'                             @XA20899 82420001
         LINE  (86),(68,30),SKIP=1                             @XA20899 82430001
         CONVT ONEBY106,4,6                                    @XA20899 82440001
         LABEL 'LOC 232','--INSCR/PRTR ERRORS-----'            @XA20899 82450001
         LINE  (19,32),(1,32),SKIP=0                           @XA20899 82460001
         CONVT TWOBYT54,4,8                                    @XA20899 82470001
         CONVT TWOBYT55,4,8                                    @XA20899 82480001
         LABEL 'LOC 108','LOC 110'                             @XA20899 82490001
         LINE  (86,30),(68,30),SKIP=1                          @XA20899 82500001
         CONVT ONEBY107,4,6                                    @XA20899 82510001
         CONVT ONEBY98,4,6                                     @XA20899 82520001
         LABEL 'LOC 233','INVLD CHAR'                          @XA20899 82530001
         LINE  (19,32),(1,32),SKIP=0                           @XA20899 82540001
         CONVT TWOBYT56,4,8                                    @XA20899 82550001
         CONVT TWOBYT57,4,8                                    @XA20899 82560001
         LABEL 'LOC 112','LOC 114'                             @XA20899 82570001
         LINE  (86,30),(68,30),SKIP=1                          @XA20899 82580001
         CONVT ONEBY108,4,6                                    @XA20899 82590001
         CONVT ONEBY99,4,6                                     @XA20899 82600001
         LABEL 'LOC 234','CONTROL ERR'                         @XA20899 82610001
         LINE  (19,32),(1,32),SKIP=0                           @XA20899 82620001
         CONVT TWOBYT58,4,8                                    @XA20899 82630001
         CONVT TWOBYT59,4,8                                    @XA20899 82640001
         LABEL 'LOC 116','LOC 118'                             @XA20899 82650001
         LINE  (86,30),(68,30),SKIP=1                          @XA20899 82660001
         CONVT ONEBY109,4,6                                    @XA20899 82670001
         CONVT ONEBY100,4,6                                    @XA20899 82680001
         LABEL 'LOC 235','BUFR PRTY CHK'                       @XA20899 82690001
         LINE  (19,32),(1,32),SKIP=0                           @XA20899 82700001
         CONVT TWOBYT60,4,8                                    @XA20899 82710001
         CONVT TWOBYT61,4,8                                    @XA20899 82720001
         LABEL 'LOC 120','LOC 122'                             @XA20899 82730001
         LINE  (86,30),(68,30),SKIP=1                          @XA20899 82740001
         CONVT ONEBY110,4,6                                    @XA20899 82750001
         CONVT ONEBY101,4,6                                    @XA20899 82760001
         LABEL 'LOC 236','BUFR ADDR CHK'                       @XA20899 82770001
         LINE  (19,67),(1,67),SKIP=1                           @XA20899 82780001
         CONVT TWOBYT62,4,8                                    @XA20899 82790001
         CONVT ONEBY111,4,6                                    @XA20899 82800001
         LABEL 'LOC 124','LOC 237'                             @XA20899 82810001
FIN      LINE  ,,SKIP=0                                        @XA20701 84492701
         ROUTINE YDUMA,THEND                                   @XA20701 84493401
FIN1     LABEL ''                                                       84494101
         DC    X'FF'                                                    84495002
         DC    X'0000'                                                  84500002
         DC    X'0000'                                                  84550002
         DC    X'0000'                                                  84600002
         DC    C'$'                                                     84650002
LABELS   EQU   *                                                        84700002
         LSTART                                                         84750002
         END                                                            84800002
