         TITLE 'IFCSYSUM-SYSTEM SUMMARY FOR EREP PROCESSING            *00001000
                        '                                               00002000
IFCSYSUM CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IFCSYSUM  78.108'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  ST    @14,12(,@13)                                        0001 00010000
         STM   @00,@12,20(@13)                                     0001 00011000
         BALR  @10,0                                               0001 00012000
@PSTART  LA    @11,4095(,@10)                                      0001 00013000
         LA    @12,4095(,@11)                                      0001 00014000
         USING @PSTART,@10                                         0001 00015000
         USING @PSTART+4095,@11                                    0001 00016000
         USING @PSTART+8190,@12                                    0001 00017000
         ST    @13,@SA00001+4                                      0001 00018000
         LA    @14,@SA00001                                        0001 00019000
         ST    @14,8(,@13)                                         0001 00020000
         LR    @13,@14                                             0001 00021000
         B     @PB00002                                            0145 00022000
CONVBIN  STM   @14,@12,@SA00002                                    0145 00023000
* R8 = BINWORD;                  /*LOAD THE ITEM TO CONVERT  @Z427VLS*/ 00024000
         L     R8,BINWORD                                          0146 00025000
* GEN(CVD   R8,DBLWORD);         /*CONVERT THE NUMBER        @Z427VLS*/ 00026000
         CVD   R8,DBLWORD                                               00027000
* GEN(UNPK   WORK(8),DBLWORD);   /*UNPACK THE CONVERTED NUMBER       */ 00028000
         UNPK   WORK(8),DBLWORD                                         00029000
* GEN(OI  WORK+7,X'F0');         /*MAKE SURE NO PROBLEM      @Z427VLS*/ 00030000
         OI  WORK+7,X'F0'                                               00031000
* SWITCH4 = OFF;                 /*CLEAR THE SWITCH PRIOR TO START   */ 00032000
         NI    SWITCH4,B'11101111'                                 0150 00033000
* DO L = 1 BY 1 TO 7 WHILE (SWITCH4 = OFF);                /*@Z427VLS*/ 00034000
         LA    @03,1                                               0151 00035000
         ST    @03,L                                               0151 00036000
@DL00151 TM    SWITCH4,B'00010000'                                 0151 00037000
         BNZ   @DC00151                                            0151 00038000
*  IF WORKOVER(L)  = 'F0'X       /*IS IT A 0 IF SO MAKE IT A BLANK   */ 00039000
*    THEN                                                          0152 00040000
         LA    @01,WORKOVER-1(@03)                                 0152 00041000
         CLI   0(@01),X'F0'                                        0152 00042000
         BNE   @RF00152                                            0152 00043000
*      WORKOVER(L) = '40'X;      /*SET TO A BLANK            @Z427VLS*/ 00044000
         LA    @01,WORKOVER-1(@03)                                 0153 00045000
         MVI   0(@01),X'40'                                        0153 00046000
*    ELSE                                                          0154 00047000
*      SWITCH4 = ON;             /*SET SWITCH TO TERMINATE DO LOOP   */ 00048000
         B     @RC00152                                            0154 00049000
@RF00152 OI    SWITCH4,B'00010000'                                 0154 00050000
* END;                                                     /*@Z427VLS*/ 00051000
@RC00152 LA    @03,1                                               0155 00052000
         AL    @03,L                                               0155 00053000
         ST    @03,L                                               0155 00054000
         C     @03,@CF00080                                        0155 00055000
         BNH   @DL00151                                            0155 00056000
@DC00151 DS    0H                                                  0156 00057000
* IF (TEN   - L) > BNDECNUM      /*IS THE CONVERTED NUMBER TO LARGE  */ 00058000
*    THEN                                                          0156 00059000
         L     @03,TEN                                             0156 00060000
         SL    @03,L                                               0156 00061000
         C     @03,BNDECNUM                                        0156 00062000
         BNH   @RF00156                                            0156 00063000
*      DO;                                                 /*@Z427VLS*/ 00064000
*        GEN(MVI   WORKOVER,X'F9');  /*SET FIRST NINE IN THE MEASSAGE*/ 00065000
         MVI   WORKOVER,X'F9'                                           00066000
*        GEN(MVC   WORKOVER+1(7),WORKOVER);/*FILL WITH NINES @Z427VLS*/ 00067000
         MVC   WORKOVER+1(7),WORKOVER                                   00068000
*      END;                                                /*@Z427VLS*/ 00069000
* R8 = ADDR(WORKOVER) + (8-BNDECNUM);/*SET WHERE TO MOVE FROM ADDRESS*/ 00070000
@RF00156 LA    R8,WORKOVER                                         0161 00071000
         L     @03,BNDECNUM                                        0161 00072000
         LA    @15,8                                               0161 00073000
         SLR   @15,@03                                             0161 00074000
         ALR   R8,@15                                              0161 00075000
* R9 = BNDECNUM - ONE;           /*NUMBER OF BYTES TO MOVE   @Z427VLS*/ 00076000
         SL    @03,ONE                                             0162 00077000
         LR    R9,@03                                              0162 00078000
* RESPECIFY (R6) RESTRICTED;                               /*@Z427VLS*/ 00079000
* R6 = DECADDR;                  /*ADDRESS TO MOVE TO        @Z427VLS*/ 00080000
         L     R6,DECADDR                                          0164 00081000
* GEN(EX    R9,MVCINS);          /*MOVE DATA TO REQUESTED LOCATION   */ 00082000
         EX    R9,MVCINS                                                00083000
* GENERATE DATA;                                           /*@Z427VLS*/ 00084000
* RESPECIFY (R6) UNRESTRICTED;                             /*@Z427VLS*/ 00085000
*END;                                                      /*@Z427VLS*/ 00086000
@EL00002 DS    0H                                                  0168 00087000
@EF00002 DS    0H                                                  0168 00088000
@ER00002 LM    @14,@12,@SA00002                                    0168 00089000
         BR    @14                                                 0168 00090000
*/********************************************************************/ 00091000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00092000
*/*    THIS PROC WILL CONVERT THE HEX DATA INTO PRINTABLE    @Z427VLS*/ 00093000
*/*                                                          @Z427VLS*/ 00094000
*/*    IF IT IS NECESSARY TO CONVERT ONLY 1/2 OF FIRST BYTE(CUA FOR  */ 00095000
*/*    EXP. THEN THE USER SHOULD SET THE SWITCH1 TO THEON CONDITION  */ 00096000
*CONVERT: PROC;                                            /*@Z427VLS*/ 00097000
CONVERT  STM   @14,@12,12(@13)                                     0169 00098000
* DO P = NUMBER BY -1 TO 1;      /*# = # OF BYTES TO CONVERT TO PRINT*/ 00099000
         L     @03,NUMBER                                          0170 00100000
         ST    @03,P                                               0170 00101000
         B     @DE00170                                            0170 00102000
@DL00170 DS    0H                                                  0171 00103000
*   R8 = NEXTBYTE(P);            /*LOAD THE NEXT BYTE TO CONVERT     */ 00104000
         L     @01,NEXTBY                                          0171 00105000
         BCTR  @01,0                                               0171 00106000
         SLR   R8,R8                                               0171 00107000
         IC    R8,NEXTBYTE(@03,@01)                                0171 00108000
*   X =  TWO * P;                /*OUTPUT INDEX MUST BE TWICE INPUT  */ 00109000
         L     @01,TWO                                             0172 00110000
         MR    @00,@03                                             0172 00111000
         ST    @01,X                                               0172 00112000
*   SRDL  (R8,FOUR);             /*MOVE 1/2 IN TO NEXT REG   @Z427VLS*/ 00113000
         SRDL  R8,4                                                0173 00114000
*   SRL   (R9,TWOEIGHT);         /*SHIFT THE REG 28 BITS     @Z427VLS*/ 00115000
         L     @15,TWOEIGHT                                        0174 00116000
         SRL   R9,0(@15)                                           0174 00117000
*   R9  =  R9 + NUMBER1;         /*INSURE INDEX BY 0 DOES NOT AFFECT */ 00118000
         L     @15,NUMBER1                                         0175 00119000
         ALR   R9,@15                                              0175 00120000
*   R8  =  R8 + NUMBER1;         /*SAME                      @Z427VLS*/ 00121000
         ALR   R8,@15                                              0176 00122000
*   IF SWITCH1 = ON & P = ONE    /*DO WE NOT PUT THE HALF BYTE OUT   */ 00123000
*    THEN                                                          0177 00124000
         TM    SWITCH1,B'10000000'                                 0177 00125000
         BNO   @RF00177                                            0177 00126000
         C     @03,ONE                                             0177 00127000
         BNE   @RF00177                                            0177 00128000
*     SWITCH1 = OFF;             /*TURN OFF THE SWITCH       @Z427VLS*/ 00129000
         NI    SWITCH1,B'01111111'                                 0178 00130000
*    ELSE                                                          0179 00131000
*     ADDNUM(X-ONE) = CHARS(R8);/*PUT THE PRINT CHAR INTO THE OUTPUT*/  00132000
         B     @RC00177                                            0179 00133000
@RF00177 L     @03,X                                               0179 00134000
         SL    @03,ONE                                             0179 00135000
         L     @01,ADDNXT                                          0179 00136000
         ALR   @01,@03                                             0179 00137000
         BCTR  @01,0                                               0179 00138000
         LA    @03,CHARS-1(R8)                                     0179 00139000
         MVC   ADDNUM(1,@01),0(@03)                                0179 00140000
*     ADDNUM(X)  = CHARS(R9);   /*FINSH THE BYTE             @Z427VLS*/ 00141000
@RC00177 L     @03,ADDNXT                                          0180 00142000
         AL    @03,X                                               0180 00143000
         BCTR  @03,0                                               0180 00144000
         LA    @01,CHARS-1(R9)                                     0180 00145000
         MVC   ADDNUM(1,@03),0(@01)                                0180 00146000
* END;                                                     /*@Z427VLS*/ 00147000
         SLR   @03,@03                                             0181 00148000
         BCTR  @03,0                                               0181 00149000
         AL    @03,P                                               0181 00150000
         ST    @03,P                                               0181 00151000
@DE00170 LTR   @03,@03                                             0181 00152000
         BP    @DL00170                                            0181 00153000
*END;                                                      /*@Z427VLS*/ 00154000
@EL00003 DS    0H                                                  0182 00155000
@EF00003 DS    0H                                                  0182 00156000
@ER00003 LM    @14,@12,12(@13)                                     0182 00157000
         BR    @14                                                 0182 00158000
*/********************************************************************/ 00159000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00160000
*/*    THIS PROC WILL FORMAT THE DATE OF THE RUN & THE START STOP    */ 00161000
*/*    DATES OF THE DATA AND PRINT THE TOP THREE LINES OF THE HEADING*/ 00162000
*/*    FOR THE PART-1 OUTPUT                                 @Z427VLS*/ 00163000
*/*                                                          @Z427VLS*/ 00164000
*HEADING1:  PROC;                                          /*@Z427VLS*/ 00165000
HEADING1 STM   @14,@12,@SA00004                                    0183 00166000
*  SPACING = UPSPACE;      /*SET FOR A NEW PAGE              @Z427VLS*/ 00167000
         MVC   SPACING(1),UPSPACE                                  0184 00168000
*  CALL PRINTIT;                                           /*@Z427VLS*/ 00169000
         BAL   @14,PRINTIT                                         0185 00170000
*  SPACING = SINGLE;                                       /*@Z427VLS*/ 00171000
         MVC   SPACING(1),SINGLE                                   0186 00172000
*  DAYSDATE = DATENOW;     /*MOVE TODAYS DATE FROM PARM TABLE        */ 00173000
         MVC   DAYSDATE(6),DATENOW(R2)                             0187 00174000
*  HEADMOVE= LINE1;        /*MOVE IN THE FIRST LINE OF THE HEADING   */ 00175000
         MVC   HEADMOVE(59),LINE1                                  0188 00176000
*  CALL PRINTIT;           /*GO PRINT THE FIRST LINE OF THE HEADING  */ 00177000
         BAL   @14,PRINTIT                                         0189 00178000
*  NUMBER = TWO;           /*SET UP TO CONVERT TWO BYTES OF DATA     */ 00179000
         L     @03,TWO                                             0190 00180000
         ST    @03,NUMBER                                          0190 00181000
*  SRL(EVSDAY,FOUR);      /*DROP THE SIGN 1/2 BYTE           @Z427VLS*/ 00182000
         LH    @03,EVSDAY(,R2)                                     0191 00183000
         N     @03,@CF00907                                        0191 00184000
         SRL   @03,4                                               0191 00185000
         STH   @03,EVSDAY(,R2)                                     0191 00186000
*  NEXTBY = ADDR(EVSDAY);  /*SET WHERE TO FIND THE DATA TO CONVERT   */ 00187000
         LA    @03,EVSDAY(,R2)                                     0192 00188000
         ST    @03,NEXTBY                                          0192 00189000
*  ADDNXT = ADDR(FROMDATE)-1;/*  WHERE TO PUT THE CONVERTED TO PRINT */ 00190000
         LA    @03,FROMDATE                                        0193 00191000
         BCTR  @03,0                                               0193 00192000
         ST    @03,ADDNXT                                          0193 00193000
*  SWITCH1 = ON;           /*SET SO WILL NOT CONVERT THE LAST 1/2 BYT*/ 00194000
         OI    SWITCH1,B'10000000'                                 0194 00195000
*  CALL CONVERT;           /*GO AND CONVERT THE DATA TO PRINTABLE    */ 00196000
         BAL   @14,CONVERT                                         0195 00197000
*  NUMBER = ONE;           /*SET UP TO CONVERT ONE BYTE  OF DATA     */ 00198000
         L     @03,ONE                                             0196 00199000
         ST    @03,NUMBER                                          0196 00200000
*  NEXTBY = ADDR(EVSYEAR); /*SET WHERE TO FIND THE YEAR TO CONVERT   */ 00201000
         LA    @03,EVSYEAR(,R2)                                    0197 00202000
         ST    @03,NEXTBY                                          0197 00203000
*  ADDNXT = ADDR(FROMYEAR);/*SET WHERE TO PUT CONVERTED YEAR @Z427VLS*/ 00204000
         LA    @03,FROMYEAR                                        0198 00205000
         ST    @03,ADDNXT                                          0198 00206000
*  CALL CONVERT;           /*GO AND CONVERT THE YEAR TO PRINTABLE    */ 00207000
         BAL   @14,CONVERT                                         0199 00208000
*  HEADMOVE= LINE2;        /*MOVE SECOND LINE OF THE HEADING INTO LNE*/ 00209000
         MVC   HEADMOVE(59),LINE2                                  0200 00210000
*  CALL PRINTIT;           /*GO AND PRINT THE SECOND LINE OF HEADING */ 00211000
         BAL   @14,PRINTIT                                         0201 00212000
*  SRL(EVDAY,FOUR);        /*HAVE TO SHIFT OUT THE F IN THE DAY      */ 00213000
         L     @03,EVPTR(,R2)                                      0202 00214000
         SLR   @15,@15                                             0202 00215000
         ICM   @15,3,EVDAY(@03)                                    0202 00216000
         SRL   @15,4                                               0202 00217000
         STCM  @15,3,EVDAY(@03)                                    0202 00218000
*  NEXTBY = ADDR(EVDAY);   /*SET UP ADDRESS OF THE LAST DAY OF INPUT */ 00219000
         LA    @03,EVDAY(,@03)                                     0203 00220000
         ST    @03,NEXTBY                                          0203 00221000
*  ADDNXT = ADDR(TODATE)-1;/*WHERE TO PUT THE CONVERTED DAY  @Z427VLS*/ 00222000
         LA    @03,TODATE                                          0204 00223000
         BCTR  @03,0                                               0204 00224000
         ST    @03,ADDNXT                                          0204 00225000
*  SWITCH1 = ON;           /*AS DAY IS 3 BYTES SET TO DROP 1/2 BYTE  */ 00226000
         OI    SWITCH1,B'10000000'                                 0205 00227000
*  NUMBER = TWO;           /*SET TO PROCESS TWO BYTES OF DATA        */ 00228000
         L     @03,TWO                                             0206 00229000
         ST    @03,NUMBER                                          0206 00230000
*  CALL CONVERT;           /*GO AND CONVERT THE DAY TO PRINTABLE     */ 00231000
         BAL   @14,CONVERT                                         0207 00232000
*  NUMBER = ONE;           /*SET UP FOR ONE BYTE IN 2 OUT IN PRINTABL*/ 00233000
         L     @03,ONE                                             0208 00234000
         ST    @03,NUMBER                                          0208 00235000
*  ADDNXT = ADDR(TOYEAR);  /*ADDRESS OF WHERE TO PUT CONVERTED DATA  */ 00236000
         LA    @03,TOYEAR                                          0209 00237000
         ST    @03,ADDNXT                                          0209 00238000
*  NEXTBY = ADDR(EVYEAR);  /*ADDRESS OF WHERE THE DATA TO CONVERT IS */ 00239000
         L     @03,EVPTR(,R2)                                      0210 00240000
         ST    @03,NEXTBY                                          0210 00241000
*  CALL CONVERT;           /*GO CONVERT THE DATA TO PRINTABLE        */ 00242000
         BAL   @14,CONVERT                                         0211 00243000
*  HEADMOVE= LINE3;        /*MOVE THE LAST HEADING TO PRINT BUFFER   */ 00244000
         MVC   HEADMOVE(59),LINE3                                  0212 00245000
*  CALL PRINTIT;           /*GO AND PRINT THE LAST LINE      @Z427VLS*/ 00246000
         BAL   @14,PRINTIT                                         0213 00247000
*  SPACING= DOUBLE;        /*SPACE THE PAGE UP 3 LINES       @Z427VLS*/ 00248000
         MVC   SPACING(1),DOUBLE                                   0214 00249000
*  CALL PRINTIT;           /*GO UPSPACE THE PRINTABLE        @Z427VLS*/ 00250000
         BAL   @14,PRINTIT                                         0215 00251000
*  R9 =SIX * EVNUM + FIVE; /*SET UP NUMBER OF CHARS/CPU + TOTAL      */ 00252000
         L     @03,EVPTR(,R2)                                      0216 00253000
         L     R9,SIX                                              0216 00254000
         MH    R9,EVNUM(,@03)                                      0216 00255000
         AL    R9,FIVE                                             0216 00256000
*  R8 = ADDR(TOTAHED);                                     /*@Z427VLS*/ 00257000
         LA    R8,TOTAHED                                          0217 00258000
*  RESPECIFY (R6) RESTRICTED;                              /*@Z427VLS*/ 00259000
*  R6 = ADDR(PRTLINE) + 20;                                /*@Z427VLS*/ 00260000
         LA    R6,PRTLINE                                          0219 00261000
         AL    R6,@CF00719                                         0219 00262000
*  RESPECIFY (R6) UNRESTRICTED;                            /*@Z427VLS*/ 00263000
*  GEN(EX   R9,MOVETOTL);  /*EXEC MOVE CHAR R9 = # OF CHARS TO MOVE  */ 00264000
         EX   R9,MOVETOTL                                               00265000
*  CALL PRINTIT;           /*GO PRINT THE LINE WITH TOTAL & CPU-A ETC*/ 00266000
         BAL   @14,PRINTIT                                         0222 00267000
*  SPACING= SINGLE;        /*GO BACK TO SINGLE SPACING       @Z427VLS*/ 00268000
         MVC   SPACING(1),SINGLE                                   0223 00269000
*  GENERATE DATA;                                          /*@Z427VLS*/ 00270000
*END;                                                      /*@Z427VLS*/ 00271000
@EL00004 DS    0H                                                  0225 00272000
@EF00004 DS    0H                                                  0225 00273000
@ER00004 LM    @14,@12,@SA00004                                    0225 00274000
         BR    @14                                                 0225 00275000
*/********************************************************************/ 00276000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00277000
*/*   THIS PROC WILL CONTROL THE OUTPUT FOR PART-1 BY CALLING PROCS  */ 00278000
*/*   TO PROCESS EACH DIFFERENT SECTION OF THE REPORT        @Z427VLS*/ 00279000
*/*                                                          @Z427VLS*/ 00280000
*TOTAL1:  PROC;                                            /*@Z427VLS*/ 00281000
TOTAL1   STM   @14,@12,@SA00005                                    0226 00282000
* ADDRSAVE = SYSUMPTR;       /*SAVE ADDRESS OF THE FIRST TABLE       */ 00283000
         L     ADDRSAVE,SYSUMPTR(,R2)                              0227 00284000
* CALL IPLWORK;                /*GO FORMAT CONVERT AND PRINT IPL DATA*/ 00285000
         BAL   @14,IPLWORK                                         0228 00286000
* CALL MCHWORK;                /*GO PROCESS INFO ABOUT MCH RECORDS   */ 00287000
         BAL   @14,MCHWORK                                         0229 00288000
* CALL CCHWORK;                /*GO PROCESS CCH TYPE DATA    @Z427VLS*/ 00289000
         BAL   @14,CCHWORK                                         0230 00290000
* CALL PROGERR;               /*HANDLE SOFTWARE DATA         @Z427VLS*/ 00291000
         BAL   @14,PROGERR                                         0231 00292000
* CALL EODWORK;                /*GO PROCESS EOD RECORDS IF ANY       */ 00293000
         BAL   @14,EODWORK                                         0232 00294000
* CALL PRT1TOT;                /*PRINT THE TOTAL FOR ALL     @Z427VLS*/ 00295000
         BAL   @14,PRT1TOT                                         0233 00296000
* IF DEBUG21 = ON THEN         /*REQUESTING HEX-DUMP OF PART 1 INFO  */ 00297000
         TM    DEBUG21(R2),B'00000100'                             0234 00298000
         BNO   @RF00234                                            0234 00299000
*  DO;                                                     /*@Z427VLS*/ 00300000
*   DDTYPE = 'F1'X;           /*MOVE OUTPUT TO TOURIST  DD   @Z427VLS*/ 00301000
         MVI   DDTYPE,X'F1'                                        0236 00302000
*   DO I = 1 BY 1 TO NUMTODO;                              /*@Z427VLS*/ 00303000
         LA    @15,1                                               0237 00304000
         ST    @15,I                                               0237 00305000
         B     @DE00237                                            0237 00306000
@DL00237 DS    0H                                                  0238 00307000
*    ADDNXT = ADDR(PRTLINE);  /*ADDRESS OF WHERE TO PUT OUTPUT       */ 00308000
         LA    @15,PRTLINE                                         0238 00309000
         ST    @15,ADDNXT                                          0238 00310000
*    NEXTBY = SYSUMPTR;       /*WHERE THE DATA IS TO HEX DUMP        */ 00311000
         L     @15,SYSUMPTR(,R2)                                   0239 00312000
         ST    @15,NEXTBY                                          0239 00313000
*    NUMBER = 52;             /*HAD TO STOP SOMEWHERE TO MANY FOR 1  */ 00314000
         MVC   NUMBER(4),@CF00820                                  0240 00315000
*    CALL CONVERT;            /*SET UP CORE DATA FOR PRINTING        */ 00316000
         BAL   @14,CONVERT                                         0241 00317000
*    CALL PRINTIT;            /*PRINT THE FIRST LINE         @Z427VLS*/ 00318000
         BAL   @14,PRINTIT                                         0242 00319000
*    NEXTBY = NEXTBY + 52;    /*MOVE POINTER PAST ALREADY DONE DATA  */ 00320000
         LA    @15,52                                              0243 00321000
         AL    @15,NEXTBY                                          0243 00322000
         ST    @15,NEXTBY                                          0243 00323000
*    NUMBER = 48;             /*SET UP TO PRINT REST OF TABLE        */ 00324000
         MVC   NUMBER(4),@CF00821                                  0244 00325000
*    CALL CONVERT;            /*GO CONVERT DATA TO PRINTABLE @Z427VLS*/ 00326000
         BAL   @14,CONVERT                                         0245 00327000
*    CALL PRINTIT;                                         /*@Z427VLS*/ 00328000
         BAL   @14,PRINTIT                                         0246 00329000
*    SYSUMPTR = SYSUMNXT;     /*SET ADDRESSABILITY FOR NEXT TABLE    */ 00330000
         L     @01,SYSUMPTR(,R2)                                   0247 00331000
         L     @15,SYSUMNXT(,@01)                                  0247 00332000
         ST    @15,SYSUMPTR(,R2)                                   0247 00333000
*   END;                                                   /*@Z427VLS*/ 00334000
         LA    @15,1                                               0248 00335000
         AL    @15,I                                               0248 00336000
         ST    @15,I                                               0248 00337000
@DE00237 C     @15,NUMTODO                                         0248 00338000
         BNH   @DL00237                                            0248 00339000
*  SYSUMPTR = ADDRSAVE;       /*RESTORE ADDRESS POINTER TO START     */ 00340000
         ST    ADDRSAVE,SYSUMPTR(,R2)                              0249 00341000
*  DDTYPE = 'F0'X;            /*RETURN TO THE CORRECT PRINT DATA SET */ 00342000
         MVI   DDTYPE,X'F0'                                        0250 00343000
* END;                                                     /*@Z427VLS*/ 00344000
*END;                                                      /*@Z427VLS*/ 00345000
@EL00005 DS    0H                                                  0252 00346000
@EF00005 DS    0H                                                  0252 00347000
@ER00005 LM    @14,@12,@SA00005                                    0252 00348000
         BR    @14                                                 0252 00349000
*/********************************************************************/ 00350000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00351000
*/*    THIS PROC WILL PROCESS THE DATA FOR PROGERR DATA      @Z427VLS*/ 00352000
*PROGERR: PROC;                                            /*@Z427VLS*/ 00353000
PROGERR  STM   @14,@12,@SA00006                                    0253 00354000
* COUNTER = 22;                /*SET INDEX TO PROGER         @Z427VLS*/ 00355000
         MVC   COUNTER(4),@CF00475                                 0254 00356000
* CALL PRINTIT;                                            /*@Z427VLS*/ 00357000
         BAL   @14,PRINTIT                                         0255 00358000
* DATAINFO = DISCRIPT(COUNTER);/*MOVE MAIN HEADING FOR PROGERR IN    */ 00359000
         L     @15,COUNTER                                         0256 00360000
         MH    @15,@CH00466                                        0256 00361000
         LA    @14,DISCRIPT-17(@15)                                0256 00362000
         MVC   DATAINFO(17),0(@14)                                 0256 00363000
* CALL PRINTIT;                 /*PRINT THE HEADING          @Z427VLS*/ 00364000
         BAL   @14,PRINTIT                                         0257 00365000
* CALL PRINTIT;                /*ADD A BLANK LINE            @Z427VLS*/ 00366000
         BAL   @14,PRINTIT                                         0258 00367000
* COUNTER = COUNTER + ONE;      /*SPACE TO FIRST SUB GROUP OF PROGERR*/ 00368000
         L     @15,COUNTER                                         0259 00369000
         AL    @15,ONE                                             0259 00370000
         ST    @15,COUNTER                                         0259 00371000
* DATAINFO = DISCRIPT(COUNTER);                            /*@Z427VLS*/ 00372000
         MH    @15,@CH00466                                        0260 00373000
         LA    @14,DISCRIPT-17(@15)                                0260 00374000
         MVC   DATAINFO(17),0(@14)                                 0260 00375000
* DECADDR = ADDR(TOTAL);                                   /*@Z427VLS*/ 00376000
         LA    @15,TOTAL                                           0261 00377000
         ST    @15,DECADDR                                         0261 00378000
* DO I = 1 BY 1 TO NUMTODO;                                /*@Z427VLS*/ 00379000
         LA    @15,1                                               0262 00380000
         ST    @15,I                                               0262 00381000
         B     @DE00262                                            0262 00382000
@DL00262 DS    0H                                                  0263 00383000
*  BINWORD = SYSUMPEI;                                     /*@Z427VLS*/ 00384000
         L     @01,SYSUMPTR(,R2)                                   0263 00385000
         L     @14,SYSUMPEI(,@01)                                  0263 00386000
         ST    @14,BINWORD                                         0263 00387000
*   TOTALPRM(I) = TOTALPRM(I) + BINWORD; /*KEEP TRACK OF OVERALL TOT*/  00388000
         SLA   @15,2                                               0264 00389000
         AL    @14,TOTALPRM-4(@15)                                 0264 00390000
         ST    @14,TOTALPRM-4(@15)                                 0264 00391000
*  CALL CONVBIN;                                           /*@Z427VLS*/ 00392000
         BAL   @14,CONVBIN                                         0265 00393000
*  DECADDR = DECADDR + SIX;                                /*@Z427VLS*/ 00394000
         L     @15,DECADDR                                         0266 00395000
         AL    @15,SIX                                             0266 00396000
         ST    @15,DECADDR                                         0266 00397000
*  SYSUMPTR = SYSUMNXT;         /*KEEP THE ADDRESABITY CORRECT       */ 00398000
         L     @01,SYSUMPTR(,R2)                                   0267 00399000
         L     @15,SYSUMNXT(,@01)                                  0267 00400000
         ST    @15,SYSUMPTR(,R2)                                   0267 00401000
* END;                                                     /*@Z427VLS*/ 00402000
         LA    @15,1                                               0268 00403000
         AL    @15,I                                               0268 00404000
         ST    @15,I                                               0268 00405000
@DE00262 C     @15,NUMTODO                                         0268 00406000
         BNH   @DL00262                                            0268 00407000
* CALL PRINTIT;                                            /*@Z427VLS*/ 00408000
         BAL   @14,PRINTIT                                         0269 00409000
* DECADDR = ADDR(TOTAL);                                   /*@Z427VLS*/ 00410000
         LA    @15,TOTAL                                           0270 00411000
         ST    @15,DECADDR                                         0270 00412000
* COUNTER = COUNTER + ONE;                                 /*@Z427VLS*/ 00413000
         L     @15,COUNTER                                         0271 00414000
         AL    @15,ONE                                             0271 00415000
         ST    @15,COUNTER                                         0271 00416000
* SYSUMPTR = ADDRSAVE;                                     /*@Z427VLS*/ 00417000
         ST    ADDRSAVE,SYSUMPTR(,R2)                              0272 00418000
* DATAINFO = DISCRIPT(COUNTER);                            /*@Z427VLS*/ 00419000
         MH    @15,@CH00466                                        0273 00420000
         LA    @14,DISCRIPT-17(@15)                                0273 00421000
         MVC   DATAINFO(17),0(@14)                                 0273 00422000
* DO I = 1 BY 1 TO NUMTODO;                                /*@Z427VLS*/ 00423000
         LA    @15,1                                               0274 00424000
         ST    @15,I                                               0274 00425000
         B     @DE00274                                            0274 00426000
@DL00274 DS    0H                                                  0275 00427000
*  BINWORD = SYSUMPEA;                                     /*@Z427VLS*/ 00428000
         L     @01,SYSUMPTR(,R2)                                   0275 00429000
         L     @14,SYSUMPEA(,@01)                                  0275 00430000
         ST    @14,BINWORD                                         0275 00431000
*   TOTALPRM(I) = TOTALPRM(I) + BINWORD; /*KEEP TRACK OF OVERALL TOT*/  00432000
         SLA   @15,2                                               0276 00433000
         AL    @14,TOTALPRM-4(@15)                                 0276 00434000
         ST    @14,TOTALPRM-4(@15)                                 0276 00435000
*  CALL CONVBIN;                                           /*@Z427VLS*/ 00436000
         BAL   @14,CONVBIN                                         0277 00437000
*  DECADDR = DECADDR + SIX;                                /*@Z427VLS*/ 00438000
         L     @15,DECADDR                                         0278 00439000
         AL    @15,SIX                                             0278 00440000
         ST    @15,DECADDR                                         0278 00441000
*  SYSUMPTR = SYSUMNXT;         /*KEEP THE ADDRESSABILIITY CORRECT   */ 00442000
         L     @01,SYSUMPTR(,R2)                                   0279 00443000
         L     @15,SYSUMNXT(,@01)                                  0279 00444000
         ST    @15,SYSUMPTR(,R2)                                   0279 00445000
* END;                                                     /*@Z427VLS*/ 00446000
         LA    @15,1                                               0280 00447000
         AL    @15,I                                               0280 00448000
         ST    @15,I                                               0280 00449000
@DE00274 C     @15,NUMTODO                                         0280 00450000
         BNH   @DL00274                                            0280 00451000
* CALL PRINTIT;                                            /*@Z427VLS*/ 00452000
         BAL   @14,PRINTIT                                         0281 00453000
* DECADDR = ADDR(TOTAL);                                   /*@Z427VLS*/ 00454000
         LA    @15,TOTAL                                           0282 00455000
         ST    @15,DECADDR                                         0282 00456000
* SYSUMPTR = ADDRSAVE;                                     /*@Z427VLS*/ 00457000
         ST    ADDRSAVE,SYSUMPTR(,R2)                              0283 00458000
* COUNTER = COUNTER + ONE;                                 /*@Z427VLS*/ 00459000
         L     @15,COUNTER                                         0284 00460000
         AL    @15,ONE                                             0284 00461000
         ST    @15,COUNTER                                         0284 00462000
* DATAINFO = DISCRIPT(COUNTER);                            /*@Z427VLS*/ 00463000
         MH    @15,@CH00466                                        0285 00464000
         LA    @14,DISCRIPT-17(@15)                                0285 00465000
         MVC   DATAINFO(17),0(@14)                                 0285 00466000
* DO I = 1 BY 1 TO NUMTODO;                                /*@Z427VLS*/ 00467000
         LA    @15,1                                               0286 00468000
         ST    @15,I                                               0286 00469000
         B     @DE00286                                            0286 00470000
@DL00286 DS    0H                                                  0287 00471000
*  BINWORD = SYSUMPER;                                     /*@Z427VLS*/ 00472000
         L     @01,SYSUMPTR(,R2)                                   0287 00473000
         L     @14,SYSUMPER(,@01)                                  0287 00474000
         ST    @14,BINWORD                                         0287 00475000
*   TOTALPRM(I) = TOTALPRM(I) + BINWORD; /*KEEP TRACK OF OVERALL TOT*/  00476000
         SLA   @15,2                                               0288 00477000
         AL    @14,TOTALPRM-4(@15)                                 0288 00478000
         ST    @14,TOTALPRM-4(@15)                                 0288 00479000
*  CALL CONVBIN;                                           /*@Z427VLS*/ 00480000
         BAL   @14,CONVBIN                                         0289 00481000
*  SYSUMPTR = SYSUMNXT;         /*KEEP THE ADDRESSABILIITY CORRECT   */ 00482000
         L     @01,SYSUMPTR(,R2)                                   0290 00483000
         L     @15,SYSUMNXT(,@01)                                  0290 00484000
         ST    @15,SYSUMPTR(,R2)                                   0290 00485000
*  DECADDR = DECADDR + SIX;                                /*@Z427VLS*/ 00486000
         L     @15,DECADDR                                         0291 00487000
         AL    @15,SIX                                             0291 00488000
         ST    @15,DECADDR                                         0291 00489000
* END;                                                     /*@Z427VLS*/ 00490000
         LA    @15,1                                               0292 00491000
         AL    @15,I                                               0292 00492000
         ST    @15,I                                               0292 00493000
@DE00286 C     @15,NUMTODO                                         0292 00494000
         BNH   @DL00286                                            0292 00495000
* CALL PRINTIT;                                            /*@Z427VLS*/ 00496000
         BAL   @14,PRINTIT                                         0293 00497000
* SYSUMPTR = ADDRSAVE;          /*RESTORE THE ADDRESSABILITY @Z427VLS*/ 00498000
         ST    ADDRSAVE,SYSUMPTR(,R2)                              0294 00499000
*END;                                                      /*@Z427VLS*/ 00500000
@EL00006 DS    0H                                                  0295 00501000
@EF00006 DS    0H                                                  0295 00502000
@ER00006 LM    @14,@12,@SA00006                                    0295 00503000
         BR    @14                                                 0295 00504000
*/********************************************************************/ 00505000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00506000
*/*    THIS PROC WILL PROCESS THE DATA FOR EOD OUTPUT        @Z427VLS*/ 00507000
*/*                                                          @Z427VLS*/ 00508000
*EODWORK: PROC;                                            /*@Z427VLS*/ 00509000
EODWORK  STM   @14,@12,@SA00007                                    0296 00510000
* CALL PRINTIT;                /*FOR SPACE BETWEEN LINES     @Z427VLS*/ 00511000
         BAL   @14,PRINTIT                                         0297 00512000
* DECADDR = ADDR(TOTAL);       /*SET POINTER TO PRINT START  @Z427VLS*/ 00513000
         LA    @15,TOTAL                                           0298 00514000
         ST    @15,DECADDR                                         0298 00515000
* DATAINFO = DISCRIPT(26);     /*MOVE THE DISCRIPTION INTO PRINT LINE*/ 00516000
         MVC   DATAINFO(17),DISCRIPT+425                           0299 00517000
*  DO I = 1 BY 1 TO NUMTODO;                               /*@Z427VLS*/ 00518000
         LA    @15,1                                               0300 00519000
         ST    @15,I                                               0300 00520000
         B     @DE00300                                            0300 00521000
@DL00300 DS    0H                                                  0301 00522000
*  BINWORD = SYSUMEOD;          /*SET UP ITEM TO CONVERT TO PRINT    */ 00523000
         L     @01,SYSUMPTR(,R2)                                   0301 00524000
         L     @14,SYSUMEOD(,@01)                                  0301 00525000
         ST    @14,BINWORD                                         0301 00526000
*   TOTALPRM(I) = TOTALPRM(I) + BINWORD; /*KEEP TRACK OF OVERALL TOT*/  00527000
         SLA   @15,2                                               0302 00528000
         AL    @14,TOTALPRM-4(@15)                                 0302 00529000
         ST    @14,TOTALPRM-4(@15)                                 0302 00530000
*  CALL CONVBIN;                /*GO DO THE BINARY TO PRINT CONVERT  */ 00531000
         BAL   @14,CONVBIN                                         0303 00532000
*  DECADDR = DECADDR + SIX;     /*MOVE THE POINTER DOWN THE PRINT LNE*/ 00533000
         L     @15,DECADDR                                         0304 00534000
         AL    @15,SIX                                             0304 00535000
         ST    @15,DECADDR                                         0304 00536000
*  SYSUMPTR = SYSUMNXT;         /*CHANGE ADDRESSABILITY FOR NEXT BLOK*/ 00537000
         L     @01,SYSUMPTR(,R2)                                   0305 00538000
         L     @15,SYSUMNXT(,@01)                                  0305 00539000
         ST    @15,SYSUMPTR(,R2)                                   0305 00540000
* END;                                                     /*@Z427VLS*/ 00541000
         LA    @15,1                                               0306 00542000
         AL    @15,I                                               0306 00543000
         ST    @15,I                                               0306 00544000
@DE00300 C     @15,NUMTODO                                         0306 00545000
         BNH   @DL00300                                            0306 00546000
* SPACING= DOUBLE;              /*AS NEW TYPE SKIP AN EXTRA LINE     */ 00547000
         MVC   SPACING(1),DOUBLE                                   0307 00548000
* CALL PRINTIT;                 /*GO PRINT THE MESSAGE       @Z427VLS*/ 00549000
         BAL   @14,PRINTIT                                         0308 00550000
* SPACING= SINGLE;              /*RESTORE THE SPACING TO SINGLE      */ 00551000
         MVC   SPACING(1),SINGLE                                   0309 00552000
* SYSUMPTR = ADDRSAVE;          /*RESTORE THE ADDRESSABILITY FOR NEXT*/ 00553000
         ST    ADDRSAVE,SYSUMPTR(,R2)                              0310 00554000
*END;                                                      /*@Z427VLS*/ 00555000
@EL00007 DS    0H                                                  0311 00556000
@EF00007 DS    0H                                                  0311 00557000
@ER00007 LM    @14,@12,@SA00007                                    0311 00558000
         BR    @14                                                 0311 00559000
*/********************************************************************/ 00560000
*/*    THIS PROC WILL PROCESS THE COUNTS FOR CHANNEL CHECKS  @Z427VLS*/ 00561000
*CCHWORK: PROC;                                            /*@Z427VLS*/ 00562000
CCHWORK  STM   @14,@12,@SA00008                                    0312 00563000
* CALL PRINTIT;                                            /*@Z427VLS*/ 00564000
         BAL   @14,PRINTIT                                         0313 00565000
* DATAINFO = DISCRIPT(5);    /*MOVE IN THE MAIN CHANNEL CHECK HEADING*/ 00566000
         MVC   DATAINFO(17),DISCRIPT+68                            0314 00567000
* CALL PRINTIT;              /*GO PRINT THE HEADING          @Z427VLS*/ 00568000
         BAL   @14,PRINTIT                                         0315 00569000
* CALL PRINTIT;              /*GO PRINT BLANK LINE           @Z427VLS*/ 00570000
         BAL   @14,PRINTIT                                         0316 00571000
* COUNTER = SIX;             /*SET INDEX TO FIRST CHANNEL VERBAGE    */ 00572000
         L     @15,SIX                                             0317 00573000
         ST    @15,COUNTER                                         0317 00574000
*/* SPACING = DOUBLE    AT C.E.S REQUEST SINGLE SPACE OCT 16,1976*****/ 00575000
* DO J = 1 BY 1 TO 16;       /*DO ALL 16 DIFFERENT CHANNELS + TOTAL  */ 00576000
         LA    @15,1                                               0318 00577000
         ST    @15,J                                               0318 00578000
@DL00318 DS    0H                                                  0319 00579000
*   DECADDR = ADDR(TOTAL);  /*SE UP THE ADDRESS OF WHERE TO PUT DATA*/  00580000
         LA    @15,TOTAL                                           0319 00581000
         ST    @15,DECADDR                                         0319 00582000
*   DATAINFO = DISCRIPT(COUNTER);/*MOVE DATA DISCRIPTION IN PRINT LIN*/ 00583000
         L     @15,COUNTER                                         0320 00584000
         MH    @15,@CH00466                                        0320 00585000
         LA    @14,DISCRIPT-17(@15)                                0320 00586000
         MVC   DATAINFO(17),0(@14)                                 0320 00587000
*   SYSUMPTR = ADDRSAVE;     /*SET UP ADDRESSABLE TO FIRST BLOCK OF  */ 00588000
         ST    ADDRSAVE,SYSUMPTR(,R2)                              0321 00589000
*   DO I = 1 BY 1  TO NUMTODO;                             /*@Z427VLS*/ 00590000
         LA    @15,1                                               0322 00591000
         ST    @15,I                                               0322 00592000
         B     @DE00322                                            0322 00593000
@DL00322 DS    0H                                                  0323 00594000
*     BINWORD = SYSUMCH(J);  /*PICK UP BINARY INFO FROM CHANNEL DATA */ 00595000
         L     @14,J                                               0323 00596000
         SLA   @14,2                                               0323 00597000
         L     @01,SYSUMPTR(,R2)                                   0323 00598000
         L     @14,SYSUMCH-4(@14,@01)                              0323 00599000
         ST    @14,BINWORD                                         0323 00600000
*   TOTALPRM(I) = TOTALPRM(I) + BINWORD; /*KEEP TRACK OF OVERALL TOT*/  00601000
         SLA   @15,2                                               0324 00602000
         AL    @14,TOTALPRM-4(@15)                                 0324 00603000
         ST    @14,TOTALPRM-4(@15)                                 0324 00604000
*     CALL CONVBIN;          /*CONVERT THE BINARY TO PRINTABLE       */ 00605000
         BAL   @14,CONVBIN                                         0325 00606000
*     DECADDR = DECADDR + SIX; /*MOVE DOWN PRINT LINE FOR EACH CPU   */ 00607000
         L     @15,DECADDR                                         0326 00608000
         AL    @15,SIX                                             0326 00609000
         ST    @15,DECADDR                                         0326 00610000
*     SYSUMPTR = SYSUMNXT;   /*SET UP THE ADDRESS FOR THE NEXT BLOCK */ 00611000
         L     @01,SYSUMPTR(,R2)                                   0327 00612000
         L     @15,SYSUMNXT(,@01)                                  0327 00613000
         ST    @15,SYSUMPTR(,R2)                                   0327 00614000
*   END;                                                   /*@Z427VLS*/ 00615000
         LA    @15,1                                               0328 00616000
         AL    @15,I                                               0328 00617000
         ST    @15,I                                               0328 00618000
@DE00322 C     @15,NUMTODO                                         0328 00619000
         BNH   @DL00322                                            0328 00620000
*   CALL PRINTIT;            /*GO AND PRINT THE INFORMATION  @Z427VLS*/ 00621000
         BAL   @14,PRINTIT                                         0329 00622000
*   COUNTER = COUNTER + ONE; /*MOVE INDEX TO NEXT CHANNEL DISCRIPTION*/ 00623000
         L     @15,COUNTER                                         0330 00624000
         AL    @15,ONE                                             0330 00625000
         ST    @15,COUNTER                                         0330 00626000
* END;                                                     /*@Z427VLS*/ 00627000
         LA    @15,1                                               0331 00628000
         AL    @15,J                                               0331 00629000
         ST    @15,J                                               0331 00630000
         C     @15,@CF00086                                        0331 00631000
         BNH   @DL00318                                            0331 00632000
*SYSUMPTR = ADDRSAVE;        /*SET UP ADDRESSABILITY FOR NEXT SECTION*/ 00633000
         ST    ADDRSAVE,SYSUMPTR(,R2)                              0332 00634000
*SPACING = SINGLE;           /*RESET TO SINGLE SPACING       @Z427VLS*/ 00635000
         MVC   SPACING(1),SINGLE                                   0333 00636000
*END;                                                      /*@Z427VLS*/ 00637000
@EL00008 DS    0H                                                  0334 00638000
@EF00008 DS    0H                                                  0334 00639000
@ER00008 LM    @14,@12,@SA00008                                    0334 00640000
         BR    @14                                                 0334 00641000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00642000
*/*    THIS PROC WILL PROCESS THE DATA FOR MCH OUTPUT        @Z427VLS*/ 00643000
*MCHWORK: PROC;                                            /*@Z427VLS*/ 00644000
MCHWORK  STM   @14,@12,@SA00009                                    0335 00645000
* CALL PRINTIT;                                            /*@Z427VLS*/ 00646000
         BAL   @14,PRINTIT                                         0336 00647000
* DECADDR = ADDR(TOTAL);       /*SET POINTER TO PRINT START  @Z427VLS*/ 00648000
         LA    @15,TOTAL                                           0337 00649000
         ST    @15,DECADDR                                         0337 00650000
* DATAINFO = DISCRIPT(TWO);    /*MOVE THE DISCRIPTION INTO PRINT LINE*/ 00651000
         L     @15,TWO                                             0338 00652000
         MH    @15,@CH00466                                        0338 00653000
         LA    @14,DISCRIPT-17(@15)                                0338 00654000
         MVC   DATAINFO(17),0(@14)                                 0338 00655000
* CALL PRINTIT;                /*GO AND PRINT THE MAIN MCH HEADING   */ 00656000
         BAL   @14,PRINTIT                                         0339 00657000
* CALL PRINTIT;                /*GO AND PRINT BLANK LINE     @Z427VLS*/ 00658000
         BAL   @14,PRINTIT                                         0340 00659000
* DATAINFO = DISCRIPT(3);      /*MOVE FIRST MCH TYPE INTO LINE       */ 00660000
         MVC   DATAINFO(17),DISCRIPT+34                            0341 00661000
* DO I = 1 BY 1 TO NUMTODO;/*PROCESS ALL CPUS + 1 FOR TOTAL  @Z427VLS*/ 00662000
         LA    @15,1                                               0342 00663000
         ST    @15,I                                               0342 00664000
         B     @DE00342                                            0342 00665000
@DL00342 DS    0H                                                  0343 00666000
*  BINWORD = SYSUMMCR;          /*SET UP ITEM TO CONVERT TO PRINT    */ 00667000
         L     @01,SYSUMPTR(,R2)                                   0343 00668000
         L     @14,SYSUMMCR(,@01)                                  0343 00669000
         ST    @14,BINWORD                                         0343 00670000
*   TOTALPRM(I) = TOTALPRM(I) + BINWORD; /*KEEP TRACK OF OVERALL TOT*/  00671000
         SLA   @15,2                                               0344 00672000
         AL    @14,TOTALPRM-4(@15)                                 0344 00673000
         ST    @14,TOTALPRM-4(@15)                                 0344 00674000
*  CALL CONVBIN;                /*GO DO THE BINARY TO PRINT CONVERT  */ 00675000
         BAL   @14,CONVBIN                                         0345 00676000
*  DECADDR = DECADDR + SIX;     /*MOVE THE POINTER DOWN THE PRINT LNE*/ 00677000
         L     @15,DECADDR                                         0346 00678000
         AL    @15,SIX                                             0346 00679000
         ST    @15,DECADDR                                         0346 00680000
*  SYSUMPTR = SYSUMNXT;         /*CHANGE ADDRESSABILITY FOR NEXT BLOK*/ 00681000
         L     @01,SYSUMPTR(,R2)                                   0347 00682000
         L     @15,SYSUMNXT(,@01)                                  0347 00683000
         ST    @15,SYSUMPTR(,R2)                                   0347 00684000
* END;                                                     /*@Z427VLS*/ 00685000
         LA    @15,1                                               0348 00686000
         AL    @15,I                                               0348 00687000
         ST    @15,I                                               0348 00688000
@DE00342 C     @15,NUMTODO                                         0348 00689000
         BNH   @DL00342                                            0348 00690000
* CALL PRINTIT;                 /*GO PRINT THE MESSAGE       @Z427VLS*/ 00691000
         BAL   @14,PRINTIT                                         0349 00692000
* DATAINFO = DISCRIPT(4);       /*MOVE NON-RECOVERABLE WORDS TO LINE */ 00693000
         MVC   DATAINFO(17),DISCRIPT+51                            0350 00694000
* DECADDR = ADDR(TOTAL);        /*BACK UP POINTER FOR NEW OUTPUT     */ 00695000
         LA    @15,TOTAL                                           0351 00696000
         ST    @15,DECADDR                                         0351 00697000
* SYSUMPTR = ADDRSAVE;          /*RESTORE ADDRESSABILITY TO START    */ 00698000
         ST    ADDRSAVE,SYSUMPTR(,R2)                              0352 00699000
* DO I = 1 BY 1 TO NUMTODO;/*CPU'S + ONE FOR THE TOTALS      @Z427VLS*/ 00700000
         LA    @15,1                                               0353 00701000
         ST    @15,I                                               0353 00702000
         B     @DE00353                                            0353 00703000
@DL00353 DS    0H                                                  0354 00704000
*  BINWORD = SYSUMMCN;          /*MOVE # TO CONVERT TO PRINTABLE     */ 00705000
         L     @01,SYSUMPTR(,R2)                                   0354 00706000
         L     @14,SYSUMMCN(,@01)                                  0354 00707000
         ST    @14,BINWORD                                         0354 00708000
*   TOTALPRM(I) = TOTALPRM(I) + BINWORD; /*KEEP TRACK OF OVERALL TOT*/  00709000
         SLA   @15,2                                               0355 00710000
         AL    @14,TOTALPRM-4(@15)                                 0355 00711000
         ST    @14,TOTALPRM-4(@15)                                 0355 00712000
*  CALL CONVBIN;/*CONVERT BINWORD TO PRINTABLE               @Z427VLS*/ 00713000
         BAL   @14,CONVBIN                                         0356 00714000
*  DECADDR = DECADDR + SIX;     /*MOVE DOWN THE PRINT LINE NEXT CPU  */ 00715000
         L     @15,DECADDR                                         0357 00716000
         AL    @15,SIX                                             0357 00717000
         ST    @15,DECADDR                                         0357 00718000
*  SYSUMPTR = SYSUMNXT ;        /*CHANGE THE BASE FOR NEXT BLOCK     */ 00719000
         L     @01,SYSUMPTR(,R2)                                   0358 00720000
         L     @15,SYSUMNXT(,@01)                                  0358 00721000
         ST    @15,SYSUMPTR(,R2)                                   0358 00722000
* END;                                                     /*@Z427VLS*/ 00723000
         LA    @15,1                                               0359 00724000
         AL    @15,I                                               0359 00725000
         ST    @15,I                                               0359 00726000
@DE00353 C     @15,NUMTODO                                         0359 00727000
         BNH   @DL00353                                            0359 00728000
* CALL PRINTIT;                 /*GO PRINT LAST MCH DATA LINE        */ 00729000
         BAL   @14,PRINTIT                                         0360 00730000
* SYSUMPTR = ADDRSAVE;          /*RESTORE THE ADDRESSABILITY TO START*/ 00731000
         ST    ADDRSAVE,SYSUMPTR(,R2)                              0361 00732000
*END;                                                      /*@Z427VLS*/ 00733000
@EL00009 DS    0H                                                  0362 00734000
@EF00009 DS    0H                                                  0362 00735000
@ER00009 LM    @14,@12,@SA00009                                    0362 00736000
         BR    @14                                                 0362 00737000
*/********************************************************************/ 00738000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00739000
*/*    THIS PROC WILL PROCESS THE DATA FOR CPU OUTPUT        @Z427VLS*/ 00740000
*/*                                                          @Z427VLS*/ 00741000
*CPUINFO: PROC;                                            /*@Z427VLS*/ 00742000
CPUINFO  STM   @14,@12,@SA00010                                    0363 00743000
*  SPACING = DOUBLE;           /*OFFSET ON THE PAGE          @Z427VLS*/ 00744000
         MVC   SPACING(1),DOUBLE                                   0364 00745000
*  CALL PRINTIT;               /*UPSPACE THREE LINE PRIOR TO START   */ 00746000
         BAL   @14,PRINTIT                                         0365 00747000
*  IF (LINECT - MYLINECT) < (EVNUM + 2  ) THEN                     0366 00748000
         LH    @03,LINECT(,R2)                                     0366 00749000
         SL    @03,MYLINECT                                        0366 00750000
         L     @01,EVPTR(,R2)                                      0366 00751000
         LA    @00,2                                               0366 00752000
         AH    @00,EVNUM(,@01)                                     0366 00753000
         CR    @03,@00                                             0366 00754000
         BNL   @RF00366                                            0366 00755000
*   DO;                                                    /*@Z427VLS*/ 00756000
*    MYLINECT = ZERO;                                      /*@Z427VLS*/ 00757000
         SLR   @03,@03                                             0368 00758000
         ST    @03,MYLINECT                                        0368 00759000
*    SPACING = UPSPACE;                                    /*@Z427VLS*/ 00760000
         MVC   SPACING(1),UPSPACE                                  0369 00761000
*    CALL PRINTIT;                                         /*@Z427VLS*/ 00762000
         BAL   @14,PRINTIT                                         0370 00763000
*    SPACING = DOUBLE;                                     /*@Z427VLS*/ 00764000
         MVC   SPACING(1),DOUBLE                                   0371 00765000
*   END;                                                   /*@Z427VLS*/ 00766000
*  CPULINE1 = CPULINE;         /*SET UP THE HEADING FOR CPU SERIAL   */ 00767000
@RF00366 MVC   CPULINE1(24),CPULINE                                0373 00768000
*  CALL PRINTIT ;              /*GO AND PRINT OUT THE HEADING        */ 00769000
         BAL   @14,PRINTIT                                         0374 00770000
*  SPACING = SINGLE;           /*RETURN SPACING TO SINGLE OR NORMAL  */ 00771000
         MVC   SPACING(1),SINGLE                                   0375 00772000
*  DO I = 1 BY 1 TO NUMTODO-1; /*SET TO PROCESS ALL CPUS + TOTALS    */ 00773000
         LA    @03,1                                               0376 00774000
         ST    @03,I                                               0376 00775000
         B     @DE00376                                            0376 00776000
@DL00376 DS    0H                                                  0377 00777000
*   CPUTYPE = EVLETTER(I);     /*SET IN ACTUAL LETTER        @Z427VLS*/ 00778000
         MH    @03,@CH00078                                        0377 00779000
         L     @15,EVPTR(,R2)                                      0377 00780000
         ST    @03,@TF00001                                        0377 00781000
         ALR   @03,@15                                             0377 00782000
         MVC   CPUTYPE(1),EVLETTER-6(@03)                          0377 00783000
*   NUMBER = TWO;              /*DO 2 BYTES OF DATA          @Z427VLS*/ 00784000
         L     @03,TWO                                             0378 00785000
         ST    @03,NUMBER                                          0378 00786000
*   ADDNXT = ADDR(CPUMODEL);   /*WHERE THE INFO IS TO BE PLACED      */ 00787000
         LA    @03,CPUMODEL                                        0379 00788000
         ST    @03,ADDNXT                                          0379 00789000
*   NEXTBY = ADDR(EVMODEL(I)); /*ADDRESS OF WHERE THE DATA IS        */ 00790000
         L     @03,@TF00001                                        0380 00791000
         LA    @03,EVMODEL-6(@03,@15)                              0380 00792000
         ST    @03,NEXTBY                                          0380 00793000
*   CALL CONVERT;              /*GO AND CONVERTB THE DATA    @Z427VLS*/ 00794000
         BAL   @14,CONVERT                                         0381 00795000
*   NUMBER = THREE;            /*SERIAL SHOULD HAVE 6 BYTES OF PRINT */ 00796000
         MVC   NUMBER(4),@CF00073                                  0382 00797000
*   ADDNXT = ADDR(CPUSERAL);   /*WHERE THE SERIAL INFO IS STORED     */ 00798000
         LA    @03,CPUSERAL                                        0383 00799000
         ST    @03,ADDNXT                                          0383 00800000
*   NEXTBY = ADDR(EVSERIAL(I));                            /*@Z427VLS*/ 00801000
         L     @03,I                                               0384 00802000
         MH    @03,@CH00078                                        0384 00803000
         L     @01,EVPTR(,R2)                                      0384 00804000
         LA    @03,EVSERIAL-6(@03,@01)                             0384 00805000
         ST    @03,NEXTBY                                          0384 00806000
*   CALL CONVERT;              /*GO AND CONVERT THE DATA     @Z427VLS*/ 00807000
         BAL   @14,CONVERT                                         0385 00808000
*   MOVECPU = CPUDATA;         /*MOVE CPU DATA TO PRINT BUFFER       */ 00809000
         MVC   MOVECPU(22),CPUDATA                                 0386 00810000
*   CALL PRINTIT;              /*GO AND PRINT THE RESULTS OF THIS    */ 00811000
         BAL   @14,PRINTIT                                         0387 00812000
*  END;                                                    /*@Z427VLS*/ 00813000
         LA    @03,1                                               0388 00814000
         AL    @03,I                                               0388 00815000
         ST    @03,I                                               0388 00816000
@DE00376 L     @15,NUMTODO                                         0388 00817000
         BCTR  @15,0                                               0388 00818000
         CR    @03,@15                                             0388 00819000
         BNH   @DL00376                                            0388 00820000
*END;                                                      /*@Z427VLS*/ 00821000
@EL00010 DS    0H                                                  0389 00822000
@EF00010 DS    0H                                                  0389 00823000
@ER00010 LM    @14,@12,@SA00010                                    0389 00824000
         BR    @14                                                 0389 00825000
*/********************************************************************/ 00826000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00827000
*/*    THIS PROC WILL PROCESS THE DATA FOR THE IPL PART OF THE REPORT*/ 00828000
*/*                                                          @Z427VLS*/ 00829000
*IPLWORK: PROC;                                            /*@Z427VLS*/ 00830000
IPLWORK  STM   @14,@12,@SA00011                                    0390 00831000
*  DATAINFO = DISCRIPT(ONE);    /*MOVE IN IPL LABEL          @Z427VLS*/ 00832000
         L     @15,ONE                                             0391 00833000
         MH    @15,@CH00466                                        0391 00834000
         LA    @14,DISCRIPT-17(@15)                                0391 00835000
         MVC   DATAINFO(17),0(@14)                                 0391 00836000
*  DECADDR = ADDR(TOTAL);     /*SET UP ADDRESS TO PUT THE DATA       */ 00837000
         LA    @15,TOTAL                                           0392 00838000
         ST    @15,DECADDR                                         0392 00839000
*  DO I = 1 BY 1 TO NUMTODO;                               /*@Z427VLS*/ 00840000
         LA    @15,1                                               0393 00841000
         ST    @15,I                                               0393 00842000
         B     @DE00393                                            0393 00843000
@DL00393 DS    0H                                                  0394 00844000
*   BINWORD = SYSUMIPL;      /*LOAD THE VALUE TO CONVERT     @Z427VLS*/ 00845000
         L     @01,SYSUMPTR(,R2)                                   0394 00846000
         L     @14,SYSUMIPL(,@01)                                  0394 00847000
         ST    @14,BINWORD                                         0394 00848000
*   TOTALPRM(I) = TOTALPRM(I) + BINWORD; /*KEEP TRACK OF OVERALL TOT*/  00849000
         SLA   @15,2                                               0395 00850000
         AL    @14,TOTALPRM-4(@15)                                 0395 00851000
         ST    @14,TOTALPRM-4(@15)                                 0395 00852000
*   CALL CONVBIN;            /*GO CONVERT THE BINARY VALUE TO PRINT  */ 00853000
         BAL   @14,CONVBIN                                         0396 00854000
*   DECADDR = DECADDR + SIX; /*MOVE WHERE TO PUT THE DATA IN LINE    */ 00855000
         L     @15,DECADDR                                         0397 00856000
         AL    @15,SIX                                             0397 00857000
         ST    @15,DECADDR                                         0397 00858000
*   SYSUMPTR = SYSUMNXT;     /*CHANGE THE BASE FOR NEXT BLOCK OF DATA*/ 00859000
         L     @01,SYSUMPTR(,R2)                                   0398 00860000
         L     @15,SYSUMNXT(,@01)                                  0398 00861000
         ST    @15,SYSUMPTR(,R2)                                   0398 00862000
*  END;                                                    /*@Z427VLS*/ 00863000
         LA    @15,1                                               0399 00864000
         AL    @15,I                                               0399 00865000
         ST    @15,I                                               0399 00866000
@DE00393 C     @15,NUMTODO                                         0399 00867000
         BNH   @DL00393                                            0399 00868000
*  CALL PRINTIT;/*GO AND PRINT THE LINE OF DATA TO OUT       @Z427VLS*/ 00869000
         BAL   @14,PRINTIT                                         0400 00870000
*  SYSUMPTR = ADDRSAVE;      /*RESTORE THE ADDRESS ABILIITY TO START */ 00871000
         ST    ADDRSAVE,SYSUMPTR(,R2)                              0401 00872000
*END;                                                      /*@Z427VLS*/ 00873000
@EL00011 DS    0H                                                  0402 00874000
@EF00011 DS    0H                                                  0402 00875000
@ER00011 LM    @14,@12,@SA00011                                    0402 00876000
         BR    @14                                                 0402 00877000
*/********************************************************************/ 00878000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00879000
*/*    THIS PROC WILL PRINT THE TOTAL COUNTS FOR EACH COLUMN PART-1  */ 00880000
*/*                                                          @Z427VLS*/ 00881000
*PRT1TOT: PROC;                                            /*@Z427VLS*/ 00882000
PRT1TOT  STM   @14,@12,@SA00012                                    0403 00883000
* PRTLINE = TOTCT;        /*MOVE IN THE LINE LABLE           @Z427VLS*/ 00884000
         MVI   PRTLINE+13,C' '                                     0404 00885000
         MVC   PRTLINE+14(138),PRTLINE+13                          0404 00886000
         MVC   PRTLINE(13),TOTCT                                   0404 00887000
* BNDECNUM = FIVE;           /*ALLOW FIVE PRINT POSITIONS IN CONVBIN*/  00888000
         L     @03,FIVE                                            0405 00889000
         ST    @03,BNDECNUM                                        0405 00890000
* DECADDR = ADDR(TOTAL);     /*ADDRESS OF WHERE TO PUT TOTAL VALUE   */ 00891000
         LA    @03,TOTAL                                           0406 00892000
         ST    @03,DECADDR                                         0406 00893000
* DO I = 1 BY 1 TO NUMTODO;  /*# CPUS + ONE FOR THE TOTAL    @Z427VLS*/ 00894000
         LA    @03,1                                               0407 00895000
         ST    @03,I                                               0407 00896000
         B     @DE00407                                            0407 00897000
@DL00407 DS    0H                                                  0408 00898000
*  BINWORD = TOTALPRM(I);    /*PICK UP THE VALUE TO CONVERT  @Z427VLS*/ 00899000
         SLA   @03,2                                               0408 00900000
         L     @03,TOTALPRM-4(@03)                                 0408 00901000
         ST    @03,BINWORD                                         0408 00902000
*  CALL CONVBIN;             /*GO AND CONVERT THE VALUE      @Z427VLS*/ 00903000
         BAL   @14,CONVBIN                                         0409 00904000
*  DECADDR = DECADDR + SIX;  /*MOVE DOWN THE PRINT LINE      @Z427VLS*/ 00905000
         L     @03,DECADDR                                         0410 00906000
         AL    @03,SIX                                             0410 00907000
         ST    @03,DECADDR                                         0410 00908000
* END;                                                     /*@Z427VLS*/ 00909000
         LA    @03,1                                               0411 00910000
         AL    @03,I                                               0411 00911000
         ST    @03,I                                               0411 00912000
@DE00407 C     @03,NUMTODO                                         0411 00913000
         BNH   @DL00407                                            0411 00914000
* CALL PRINTIT;              /*TELL THE WORLD THE TOTAL COUNTS FOR AL*/ 00915000
         BAL   @14,PRINTIT                                         0412 00916000
* GEN(XC  TOTALPRM(68),TOTALPRM);/*CLEAR THE TABLE FOR PART 2        */ 00917000
         XC  TOTALPRM(68),TOTALPRM                                      00918000
*END;                                                      /*@Z427VLS*/ 00919000
@EL00012 DS    0H                                                  0414 00920000
@EF00012 DS    0H                                                  0414 00921000
@ER00012 LM    @14,@12,@SA00012                                    0414 00922000
         BR    @14                                                 0414 00923000
*/********************************************************************/ 00924000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00925000
*/*    THIS PROC WILL PRINT THE CPU PERM TEMP LINE OF DISCRIPTION    */ 00926000
*/*                                                          @Z427VLS*/ 00927000
*TOPLINE: PROC;                                            /*@Z427VLS*/ 00928000
TOPLINE  STM   @14,@12,@SA00013                                    0415 00929000
* RESPECIFY (R6) RESTRICTED;                               /*@Z427VLS*/ 00930000
* CALL PRINTIT;              /*PRINT BLANK LINE              @Z427VLS*/ 00931000
         BAL   @14,PRINTIT                                         0417 00932000
* R9 = 22 + 10 * EVNUM;      /*DETERMINE # OF HEADING TO MOVE        */ 00933000
         L     @07,EVPTR(,R2)                                      0418 00934000
         LH    R9,EVNUM(,@07)                                      0418 00935000
         MH    R9,@CH00272                                         0418 00936000
         AL    R9,@CF00475                                         0418 00937000
* R8 = ADDR(HEAD2);          /*WHERE THE HEADING IS          @Z427VLS*/ 00938000
         LA    R8,HEAD2                                            0419 00939000
* R6 = ADDR(PRTLINE);        /*WHERE TO MOVE THE DATA TO     @Z427VLS*/ 00940000
         LA    R6,PRTLINE                                          0420 00941000
* GEN(EX   R9,MOVETOTL);     /*ONLY WAY FOR VARABLE # OF CHARACTERS  */ 00942000
         EX   R9,MOVETOTL                                               00943000
* CALL PRINTIT;              /*GO PRINT THE HEADING LINE 1   @Z427VLS*/ 00944000
         BAL   @14,PRINTIT                                         0422 00945000
* R9 = 24 + 10 * EVNUM;      /*CHARS TO MOVE FOR THE SECOND LINE     */ 00946000
         L     @07,EVPTR(,R2)                                      0423 00947000
         LH    R9,EVNUM(,@07)                                      0423 00948000
         MH    R9,@CH00272                                         0423 00949000
         AL    R9,@CF00225                                         0423 00950000
* R8 = ADDR(HEAD20);         /*WHERE THE DATA FO  2 LINE IS AT       */ 00951000
         LA    R8,HEAD20                                           0424 00952000
* GEN(EX  R9,MOVETOTL);      /*MOVE THE CHARACTERS TO PRINTLINE      */ 00953000
         EX  R9,MOVETOTL                                                00954000
* CALL PRINTIT;              /*GO PRINT THE HEADING          @Z427VLS*/ 00955000
         BAL   @14,PRINTIT                                         0426 00956000
* RESPECIFY (R6) UNRESTRICTED;                             /*@Z427VLS*/ 00957000
*END;                                                      /*@Z427VLS*/ 00958000
@EL00013 DS    0H                                                  0428 00959000
@EF00013 DS    0H                                                  0428 00960000
@ER00013 LM    @14,@12,@SA00013                                    0428 00961000
         BR    @14                                                 0428 00962000
*/********************************************************************/ 00963000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 00964000
*/*    THIS PROC WILL PRINT DEBUG INFORMATION FOR THE USER   @Z427VLS*/ 00965000
*/*                                                          @Z427VLS*/ 00966000
*DODEBUG: PROC;                                            /*@Z427VLS*/ 00967000
DODEBUG  STM   @14,@12,@SA00014                                    0429 00968000
* DDTYPE = '1';              /*CHANGE THE DD SET DATA PRINTED ON     */ 00969000
         MVI   DDTYPE,C'1'                                         0430 00970000
* PRTLINE = BUG18;   /*MOVE THE HEADING INTO THE PRINT LINE  @0001VLS*/ 00971000
         MVI   PRTLINE+19,C' '                                     0431 00972000
         MVC   PRTLINE+20(132),PRTLINE+19                          0431 00973000
         MVC   PRTLINE(19),BUG18                                   0431 00974000
* CALL PRINTIT;      /*GO PRINT THE DEBUG HEADING            @0001VLS*/ 00975000
         BAL   @14,PRINTIT                                         0432 00976000
* DECADDR = ADDR(GROUPNUM) ; /*WHERE TO PUT CONVERTED NUMBER @Z427VLS*/ 00977000
         LA    @03,GROUPNUM                                        0433 00978000
         ST    @03,DECADDR                                         0433 00979000
* BNDECNUM = SIX;            /*SET UP FOR SIX CHARACTERS FROM BINARY#*/ 00980000
         L     @03,SIX                                             0434 00981000
         ST    @03,BNDECNUM                                        0434 00982000
* DO I = 1 BY 1 TO SIX;      /*CURRENNT LENGTY OF DEV GROUP  @Z427VLS*/ 00983000
         LA    @03,1                                               0435 00984000
         ST    @03,I                                               0435 00985000
         B     @DE00435                                            0435 00986000
@DL00435 DS    0H                                                  0436 00987000
*  BINWORD = DBUGCT(I);      /*PICK UP THE COUNT             @Z427VLS*/ 00988000
         SLA   @03,2                                               0436 00989000
         L     @03,DBUGCT-4(@03)                                   0436 00990000
         ST    @03,BINWORD                                         0436 00991000
*  CALL CONVBIN;             /*GO AND CONVERT THE BINARY NUMBER      */ 00992000
         BAL   @14,CONVBIN                                         0437 00993000
*  GPNAME = DEVGROUP(I);     /*MOVE IN THE NAME OF THE GROUP @Z427VLS*/ 00994000
         L     @03,I                                               0438 00995000
         SLA   @03,3                                               0438 00996000
         LA    @01,DEVGROUP-8(@03)                                 0438 00997000
         MVC   GPNAME(8),0(@01)                                    0438 00998000
*  PRTLINE = GROUPCT;        /*MOVE THE MESSAGE TO THE OUTPUT BUFFER */ 00999000
         MVI   PRTLINE+32,C' '                                     0439 01000000
         MVC   PRTLINE+33(119),PRTLINE+32                          0439 01001000
         MVC   PRTLINE(32),GROUPCT                                 0439 01002000
*  CALL PRINTIT;             /*GO PRINT THE BUFFER           @Z427VLS*/ 01003000
         BAL   @14,PRINTIT                                         0440 01004000
* END;                                                     /*@Z427VLS*/ 01005000
         LA    @03,1                                               0441 01006000
         AL    @03,I                                               0441 01007000
         ST    @03,I                                               0441 01008000
@DE00435 C     @03,SIX                                             0441 01009000
         BNH   @DL00435                                            0441 01010000
* BINWORD = CT - ONE;        /*MUST - 1 AS CT ONE AHEAD AT THIS TIME */ 01011000
         L     @03,CT                                              0442 01012000
         SL    @03,ONE                                             0442 01013000
         ST    @03,BINWORD                                         0442 01014000
* DECADDR = ADDR(TOTALCT);   /*WHERE TO PUT THE CONVERTED ITEM       */ 01015000
         LA    @03,TOTALCT                                         0443 01016000
         ST    @03,DECADDR                                         0443 01017000
* CALL  CONVBIN; /*GO AND CONVERT THE ITEM TO PRINTABLE      @Z427VLS*/ 01018000
         BAL   @14,CONVBIN                                         0444 01019000
* PRTLINE = TOTALS;          /*MOVE MESSAGE TO THE PRINT LINE        */ 01020000
         MVI   PRTLINE+22,C' '                                     0445 01021000
         MVC   PRTLINE+23(129),PRTLINE+22                          0445 01022000
         MVC   PRTLINE(22),TOTALS                                  0445 01023000
* CALL PRINTIT;                                            /*@Z427VLS*/ 01024000
         BAL   @14,PRINTIT                                         0446 01025000
* PRTLINE = BUGHEAD;         /*PRINT OUT THE WORDS DEBUG COUNTS      */ 01026000
         MVI   PRTLINE+16,C' '                                     0447 01027000
         MVC   PRTLINE+17(135),PRTLINE+16                          0447 01028000
         MVC   PRTLINE(16),BUGHEAD                                 0447 01029000
* CALL PRINTIT;              /*GO PRINT THE MESSAGE          @Z427VLS*/ 01030000
         BAL   @14,PRINTIT                                         0448 01031000
* PRTLINE = DBUGCT1;         /*MOVE THE HEADER IN TO BUFFER  @Z427VLS*/ 01032000
         MVI   PRTLINE+34,C' '                                     0449 01033000
         MVC   PRTLINE+35(117),PRTLINE+34                          0449 01034000
         MVC   PRTLINE(34),DBUGCT1                                 0449 01035000
* CALL PRINTIT;                                            /*@Z427VLS*/ 01036000
         BAL   @14,PRINTIT                                         0450 01037000
* DO I = 1 BY 1 TO NUMTODO - 1;                            /*@Z427VLS*/ 01038000
         LA    @03,1                                               0451 01039000
         ST    @03,I                                               0451 01040000
         B     @DE00451                                            0451 01041000
@DL00451 DS    0H                                                  0452 01042000
*  CPULETTR = EVLETTER(I);  /*MOVE IN CPU LETTER             @Z427VLS*/ 01043000
         LR    @15,@03                                             0452 01044000
         MH    @15,@CH00078                                        0452 01045000
         L     @01,EVPTR(,R2)                                      0452 01046000
         ALR   @01,@15                                             0452 01047000
         MVC   CPULETTR(1),EVLETTER-6(@01)                         0452 01048000
*  BINWORD  = PRIMEYES(I);    /*MOVE IN BINARY COUNT FOR THIS CPU     * 01049000
         SLA   @03,2                                               0453 01050000
         L     @03,PRIMEYES-4(@03)                                 0453 01051000
         ST    @03,BINWORD                                         0453 01052000
*  DECADDR = ADDR(PRTLINE) + 14;                           /*@Z427VLS*/ 01053000
         LA    @03,PRTLINE                                         0454 01054000
         AL    @03,@CF00727                                        0454 01055000
         ST    @03,DECADDR                                         0454 01056000
*  CALL CONVBIN;                                           /*@Z427VLS*/ 01057000
         BAL   @14,CONVBIN                                         0455 01058000
*  BINWORD = PRIMENO(I);                                   /*@Z427VLS*/ 01059000
         L     @03,I                                               0456 01060000
         SLA   @03,2                                               0456 01061000
         L     @03,PRIMENO-4(@03)                                  0456 01062000
         ST    @03,BINWORD                                         0456 01063000
*  DECADDR = DECADDR + TEN;          /*SPACE DOWN THE PRINT LINE BY10*/ 01064000
         L     @03,DECADDR                                         0457 01065000
         AL    @03,TEN                                             0457 01066000
         ST    @03,DECADDR                                         0457 01067000
*  CALL CONVBIN;                                           /*@Z427VLS*/ 01068000
         BAL   @14,CONVBIN                                         0458 01069000
*  CALL PRINTIT;                                           /*@Z427VLS*/ 01070000
         BAL   @14,PRINTIT                                         0459 01071000
* END;                                                     /*@Z427VLS*/ 01072000
         LA    @03,1                                               0460 01073000
         AL    @03,I                                               0460 01074000
         ST    @03,I                                               0460 01075000
@DE00451 L     @15,NUMTODO                                         0460 01076000
         BCTR  @15,0                                               0460 01077000
         CR    @03,@15                                             0460 01078000
         BNH   @DL00451                                            0460 01079000
* IF SPCHANGE ^= ZERO THEN     /*ONLY PRINT IF HAD ODD CUA-DEV*/   0461 01080000
         L     @03,SPCHANGE                                        0461 01081000
         LTR   @03,@03                                             0461 01082000
         BZ    @RF00461                                            0461 01083000
*  DO;                                                     /*@0001VLS*/ 01084000
*   BINWORD = SPCHANGE;        /*SET UP THE NUMBER TO CONVERT   */ 0463 01085000
         ST    @03,BINWORD                                         0463 01086000
*   DECADDR = ADDR(SPNUM);     /*SET ADDRESS OF WHERE TO PUT IT */ 0464 01087000
         LA    @03,SPNUM                                           0464 01088000
         ST    @03,DECADDR                                         0464 01089000
*   CALL CONVBIN;              /*GO CONVERT THE ITEM TO PRINTABLE*/     01090000
         BAL   @14,CONVBIN                                         0465 01091000
*   PRTLINE = SPCHNG;          /*MOVE THE LINE OF PRINT TO BUFFER */    01092000
         MVI   PRTLINE+50,C' '                                     0466 01093000
         MVC   PRTLINE+51(101),PRTLINE+50                          0466 01094000
         MVC   PRTLINE(50),SPCHNG                                  0466 01095000
*   CALL PRINTIT;              /*GO PRINT THE MESSAGE        @0001VLS*/ 01096000
         BAL   @14,PRINTIT                                         0467 01097000
*  END;                                                    /*@0001VLS*/ 01098000
*END;                                                      /*@Z427VLS*/ 01099000
@EL00014 DS    0H                                                  0469 01100000
@EF00014 DS    0H                                                  0469 01101000
@ER00014 LM    @14,@12,@SA00014                                    0469 01102000
         BR    @14                                                 0469 01103000
*/********************************************************************/ 01104000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 01105000
*/*    THIS PROC WILL PRINT THE RESULT OF THE PROC DOCOUNT   @Z427VLS*/ 01106000
*/*                                                          @Z427VLS*/ 01107000
*DATALINE:  PROC;                                          /*@Z427VLS*/ 01108000
DATALINE STM   @14,@12,@SA00015                                    0470 01109000
*  R9 = CT - ONE;            /*SET UP TO LOOK BACK ON ENTRY  @0001VLS*/ 01110000
         L     @03,ONE                                             0471 01111000
         L     R9,CT                                               0471 01112000
         SLR   R9,@03                                              0471 01113000
* BNDECNUM = FIVE;                                         /*@Z427VLS*/ 01114000
         L     @15,FIVE                                            0472 01115000
         ST    @15,BNDECNUM                                        0472 01116000
* IF R9 > ZERO & SYSDEV(R9) ^= SAVEDEV & OLDGROUP ^= FIVE THEN     0473 01117000
         LTR   R9,R9                                               0473 01118000
         BNP   @RF00473                                            0473 01119000
         LR    @14,R9                                              0473 01120000
         MH    @14,@CH00703                                        0473 01121000
         L     @01,SORTADR(,R2)                                    0473 01122000
         ALR   @01,@14                                             0473 01123000
         AL    @01,@CF00909                                        0473 01124000
         CLC   SYSDEV-5(2,@01),SAVEDEV                             0473 01125000
         BE    @RF00473                                            0473 01126000
         C     @15,OLDGROUP                                        0473 01127000
         BE    @RF00473                                            0473 01128000
*  DO;                                                     /*@0001VLS*/ 01129000
*   SPCHANGE = SPCHANGE + ONE; /*KEEP TRACK OF ODD CASES     @0001VLS*/ 01130000
         AL    @03,SPCHANGE                                        0475 01131000
         ST    @03,SPCHANGE                                        0475 01132000
*  CALL DEVTYPE;          /*JUST IN CASE THE DEVICES ARE DIFFERENT*/    01133000
         BAL   @14,DEVTYPE                                         0476 01134000
*                         /*ON DIFFERENT CPUS & SAME CUA     @Z427VLS*/ 01135000
*  END;                                                    /*@0001VLS*/ 01136000
* DECADDR = ADDR(TOTE2) - 3;  /*SETUP ADDRESS OF WHERE TO PUT THE DAT*/ 01137000
@RF00473 LA    @03,TOTE2                                           0478 01138000
         SL    @03,@CF00073                                        0478 01139000
         ST    @03,DECADDR                                         0478 01140000
* BINWORD = SYS2TPRM;        /*SET UP TO CONVERT THE TOTAL OF PERMS  */ 01141000
         L     @03,SYS2TPRM                                        0479 01142000
         ST    @03,BINWORD                                         0479 01143000
* CALL CONVBIN;              /*GO CONVERT THE BINARY TO PRINTABLE    */ 01144000
         BAL   @14,CONVBIN                                         0480 01145000
* DECADDR = DECADDR + SIX ;  /*MOVE DOWN THE PRINT LINE FOR TOTAL TEM*/ 01146000
         L     @03,DECADDR                                         0481 01147000
         AL    @03,SIX                                             0481 01148000
         ST    @03,DECADDR                                         0481 01149000
* BINWORD = SYS2TTOT;        /*MOVE IN THE TEMPARY TOTAL     @Z427VLS*/ 01150000
         L     @03,SYS2TTOT                                        0482 01151000
         ST    @03,BINWORD                                         0482 01152000
* CALL CONVBIN;              /*GO AND CONVERT THE # TO PRINTABLE     */ 01153000
         BAL   @14,CONVBIN                                         0483 01154000
* DECADDR = DECADDR + TWO;                                 /*@Z427VLS*/ 01155000
         L     @03,DECADDR                                         0484 01156000
         AL    @03,TWO                                             0484 01157000
         ST    @03,DECADDR                                         0484 01158000
* BNDECNUM = FOUR;                                         /*@Z427VLS*/ 01159000
         MVC   BNDECNUM(4),@CF00060                                0485 01160000
* DO R = 1 BY 1 TO EVNUM;                                  /*@Z427VLS*/ 01161000
         LA    @03,1                                               0486 01162000
         ST    @03,R                                               0486 01163000
         B     @DE00486                                            0486 01164000
@DL00486 DS    0H                                                  0487 01165000
*  IF SHRFLGS(R) = ON THEN                                         0487 01166000
         SLR   @15,@15                                             0487 01167000
         IC    @15,SHRFLGS-1(@03)                                  0487 01168000
         C     @15,@CF00052                                        0487 01169000
         BNE   @RF00487                                            0487 01170000
*   DO;                                                    /*@Z427VLS*/ 01171000
*   DECADDR = DECADDR + FIVE;/*MOVE FIVE DOWN THE PRINT LINE @Z427VLS*/ 01172000
         L     @15,DECADDR                                         0489 01173000
         AL    @15,FIVE                                            0489 01174000
         ST    @15,DECADDR                                         0489 01175000
*   BINWORD = SYS2PERM(R);   /*PICK UP THE PERM ERRORS FOR NEXT CPU  */ 01176000
         SLA   @03,2                                               0490 01177000
         L     @03,SYS2PERM-4(@03)                                 0490 01178000
         ST    @03,BINWORD                                         0490 01179000
*   CALL CONVBIN;            /*GO CONVERT THE ITEM TO PRINTABLE      */ 01180000
         BAL   @14,CONVBIN                                         0491 01181000
*   DECADDR = DECADDR + FIVE;/*MOVE DOWN THE PRINT LINE FOR TEMP     */ 01182000
         L     @03,DECADDR                                         0492 01183000
         AL    @03,FIVE                                            0492 01184000
         ST    @03,DECADDR                                         0492 01185000
*   BINWORD = SYS2TEMP(R);   /*PICK UP THE NEXT TEMPARY COUNT TO CONV*/ 01186000
         L     @03,R                                               0493 01187000
         SLA   @03,2                                               0493 01188000
         L     @03,SYS2TEMP-4(@03)                                 0493 01189000
         ST    @03,BINWORD                                         0493 01190000
*   CALL CONVBIN;            /*GO CONVERT THE TEMPARY COUNT  @Z427VLS*/ 01191000
         BAL   @14,CONVBIN                                         0494 01192000
*   END;                                                   /*@Z427VLS*/ 01193000
*   ELSE                                                           0496 01194000
*    DO;                                                   /*@Z427VLS*/ 01195000
         B     @RC00487                                            0496 01196000
@RF00487 DS    0H                                                  0497 01197000
*     R9 = DECADDR + EIGHT;  /*WHERE TO PUT THE DASH         @Z427VLS*/ 01198000
         LA    R9,8                                                0497 01199000
         AL    R9,DECADDR                                          0497 01200000
*     GEN(MVI  0(R9),X'60'); /*PUT THE DASHH IN WHERE A ZERO WOULD BE*/ 01201000
         MVI  0(R9),X'60'                                               01202000
*     R9 = R9 + FIVE;        /*MOVE THE POINTER TO THE NEXT LOCATION */ 01203000
         AL    R9,FIVE                                             0499 01204000
*     GEN(MVI  0(R9),X'60'); /*ANGAIN MOVE IN A DASH         @Z427VLS*/ 01205000
         MVI  0(R9),X'60'                                               01206000
*     DECADDR = DECADDR + TEN;/*MOVE POINTER DOWN THE PRINT LINE     */ 01207000
         L     @03,DECADDR                                         0501 01208000
         AL    @03,TEN                                             0501 01209000
         ST    @03,DECADDR                                         0501 01210000
*    END;                                                  /*@Z427VLS*/ 01211000
* END;                                                     /*@Z427VLS*/ 01212000
@RC00487 LA    @03,1                                               0503 01213000
         AL    @03,R                                               0503 01214000
         ST    @03,R                                               0503 01215000
@DE00486 L     @01,EVPTR(,R2)                                      0503 01216000
         CH    @03,EVNUM(,@01)                                     0503 01217000
         BNH   @DL00486                                            0503 01218000
* CALL PRINTIT;              /*GO PRINT THIS GREAT INFO      @Z427VLS*/ 01219000
         BAL   @14,PRINTIT                                         0504 01220000
* SYS2TPRM = ZERO;           /*ZERO FOR THE NEXT PASS        @Z427VLS*/ 01221000
         SLR   @03,@03                                             0505 01222000
         ST    @03,SYS2TPRM                                        0505 01223000
* SYS2TTOT = ZERO;           /*SAME AS ABOVE                 @Z427VLS*/ 01224000
         ST    @03,SYS2TTOT                                        0506 01225000
*   IF SWITCH2 = ON & CT ^> MAXLIMIT THEN /*CHECK IF DONE FIRST    */   01226000
         TM    SWITCH2,B'01000000'                                 0507 01227000
         BNO   @RF00507                                            0507 01228000
         L     @03,CT                                              0507 01229000
         C     @03,MAXLIMIT                                        0507 01230000
         BH    @RF00507                                            0507 01231000
*  DO;                       /*PROC CALLING PROC THAT WOULD CALL     */ 01232000
*   CALL HEADING2;           /*CALLING PROC                  @Z427VLS*/ 01233000
         BAL   @14,HEADING2                                        0509 01234000
*   CALL TOPLINE;            /*GOT TO HAVE COMLPETE HEADING  @Z427VLS*/ 01235000
         BAL   @14,TOPLINE                                         0510 01236000
*   SWITCH2 = OFF;           /*SO DONT RETURN TILL NEEDED    @Z427VLS*/ 01237000
         NI    SWITCH2,B'10111111'                                 0511 01238000
*   CALL PRTGROUP;           /*TELL THEM AGAIN ABOUT THE GROUP NAME  */ 01239000
         BAL   @14,PRTGROUP                                        0512 01240000
*   CALL DEVTYPE;            /*PUT IN TO THE PRINT LINE      @Z427VLS*/ 01241000
         BAL   @14,DEVTYPE                                         0513 01242000
*   CALL DOCUX;              /*PUT THE CUX INTO THE PRINT LINE       */ 01243000
         BAL   @14,DOCUX                                           0514 01244000
*  END;                                                    /*@Z427VLS*/ 01245000
* IF DEBUG22 = ON THEN                                             0516 01246000
@RF00507 TM    DEBUG22(R2),B'00000010'                             0516 01247000
         BNO   @RF00516                                            0516 01248000
*  DO;                                                     /*@Z427VLS*/ 01249000
* PRTLINE = BUG22MSG;           /*MOVE IN A LABLE FOR DEBUG DATA  */    01250000
         MVI   PRTLINE+16,C' '                                     0518 01251000
         MVC   PRTLINE+17(135),PRTLINE+16                          0518 01252000
         MVC   PRTLINE(16),BUG22MSG                                0518 01253000
*   DECADDR= ADDR(TOTE2) + 3;   /*ADDRESS OF WHERE TO PUT THE DATA */   01254000
         LA    @03,TOTE2                                           0519 01255000
         AL    @03,@CF00073                                        0519 01256000
         ST    @03,DECADDR                                         0519 01257000
*   BINWORD = NUMP;               /*NUMBER OF TIMES THIS PRIME CPU   */ 01258000
         L     @03,NUMP                                            0520 01259000
         ST    @03,BINWORD                                         0520 01260000
*   CALL CONVBIN;                 /*GO CONVERT TO PRINTABLE  @Z427VLS*/ 01261000
         BAL   @14,CONVBIN                                         0521 01262000
*   DO R = 1 BY 1 TO NUMTODO -1;  /*SET UP LOOP CONTROLS FOR ALL CPUS*/ 01263000
         LA    @03,1                                               0522 01264000
         ST    @03,R                                               0522 01265000
         B     @DE00522                                            0522 01266000
@DL00522 DS    0H                                                  0523 01267000
*    DECADDR= DECADDR+ TEN;       /*MOVE DOWN THE PRINT LINE @Z427VLS*/ 01268000
         L     @15,DECADDR                                         0523 01269000
         AL    @15,TEN                                             0523 01270000
         ST    @15,DECADDR                                         0523 01271000
*    BINWORD = NUMS(R);           /*LOAD COUNT OF ITEM IN SEC CPU    */ 01272000
         SLA   @03,2                                               0524 01273000
         L     @03,NUMS-4(@03)                                     0524 01274000
         ST    @03,BINWORD                                         0524 01275000
*    CALL CONVBIN;                /*CONVERT # OF ITEMS SUMED THIS CPU*/ 01276000
         BAL   @14,CONVBIN                                         0525 01277000
*   END;                                                   /*@Z427VLS*/ 01278000
         LA    @03,1                                               0526 01279000
         AL    @03,R                                               0526 01280000
         ST    @03,R                                               0526 01281000
@DE00522 L     @15,NUMTODO                                         0526 01282000
         BCTR  @15,0                                               0526 01283000
         CR    @03,@15                                             0526 01284000
         BNH   @DL00522                                            0526 01285000
*   CALL PRINTIT;                 /*GO PRINT THE DEBUG COUNTS        */ 01286000
         BAL   @14,PRINTIT                                         0527 01287000
*   NUMP = ZERO;                  /*CLEAR THE COUNTER        @Z427VLS*/ 01288000
         SLR   @03,@03                                             0528 01289000
         ST    @03,NUMP                                            0528 01290000
*   GEN(XC NUMS(64),NUMS);        /*CLEAR THE ARRAY          @Z427VLS*/ 01291000
         XC NUMS(64),NUMS                                               01292000
*  END;                                                    /*@Z427VLS*/ 01293000
* GEN(XC  SHRFLGS(16),SHRFLGS);/*CLEAR PRINT FLAGS FOR NEXT ENTRY    */ 01294000
@RF00516 DS    0H                                                  0531 01295000
         XC  SHRFLGS(16),SHRFLGS                                        01296000
* GEN(MVI SYS2TEMP,X'00');   /*CAN'T DO ALL FOUR AT ONCE DO TO COMPLI*/ 01297000
         MVI SYS2TEMP,X'00'                                             01298000
* GEN(MVC SYS2TEMP+1(127),SYS2TEMP);/*MAY PUT SINGLE ITEMS AWAY FROM */ 01299000
         MVC SYS2TEMP+1(127),SYS2TEMP                                   01300000
*                            /*WHERE IT PUTS THE ARRAYS WHY(?)       */ 01301000
*END;                                                      /*@Z427VLS*/ 01302000
@EL00015 DS    0H                                                  0534 01303000
@EF00015 DS    0H                                                  0534 01304000
@ER00015 LM    @14,@12,@SA00015                                    0534 01305000
         BR    @14                                                 0534 01306000
*/********************************************************************/ 01307000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 01308000
*/*    THIS PROC WILL DO THE WORK OF ADDING THE RECORDS UP   @Z427VLS*/ 01309000
*/*    SHRFLGS SETTING OF THIS TABLE IS TO SUPPRES THE # OF ZERO'S   */ 01310000
*/*    IN THE PRINT OUT WITH A BYTE FOR EACH CPU & ONE FOR THE TOTALS*/ 01311000
*/*    THE TOTALS IS ALWAYS INIT TO ONE SO ALWAYS PRINT TOTAL       */  01312000
*/*    FOR THE REST IF NO DATA FROM CPU PRIME OR SECONDARY THE NOTHIN*/ 01313000
*/*                                                          @Z427VLS*/ 01314000
*DOCOUNT:  PROC;                                           /*@Z427VLS*/ 01315000
DOCOUNT  STM   @14,@12,12(@13)                                     0535 01316000
*       R8 = LASTCPU + '10'X;      /*PICK UP PRIME CPU       @Z427VLS*/ 01317000
         LA    R8,16                                               0536 01318000
         AL    R8,LASTCPU                                          0536 01319000
*       SRL(R8,FOUR);             /*SET UP FOR INDEXING      @Z427VLS*/ 01320000
         SRL   R8,4                                                0537 01321000
*       SHRFLGS(R8) = ON;                                  /*@Z427VLS*/ 01322000
         LA    @03,1                                               0538 01323000
         STC   @03,SHRFLGS-1(R8)                                   0538 01324000
*       IF DEBUG22 = ON THEN      /*COUNT THE NUMBER FOR EACH SORT B */ 01325000
         TM    DEBUG22(R2),B'00000010'                             0539 01326000
         BNO   @RF00539                                            0539 01327000
*        DO;                                               /*@Z427VLS*/ 01328000
*         NUMP = NUMP + ONE;      /*COUNT OF # OF PRIME THIS SORT BRE*/ 01329000
         L     @03,ONE                                             0541 01330000
         L     @15,NUMP                                            0541 01331000
         ALR   @15,@03                                             0541 01332000
         ST    @15,NUMP                                            0541 01333000
*         NUMS(R8) = NUMS(R8) + ONE;/*SECONDARY CPU THIS SORT BREAK  */ 01334000
         LR    @15,R8                                              0542 01335000
         SLA   @15,2                                               0542 01336000
         AL    @03,NUMS-4(@15)                                     0542 01337000
         ST    @03,NUMS-4(@15)                                     0542 01338000
*        END;                                              /*@Z427VLS*/ 01339000
*       R9 = R8;                  /*SAVE FOR LATTER USE      @Z427VLS*/ 01340000
@RF00539 LR    R9,R8                                               0544 01341000
*       R8 = (SYSITEM(CT) & '0F'X) + ONE;/*INX TO POINTER TO OLD CPU*/  01342000
         L     @03,ONE                                             0545 01343000
         L     @15,CT                                              0545 01344000
         MH    @15,@CH00703                                        0545 01345000
         L     @14,SORTADR(,R2)                                    0545 01346000
         LA    R8,15                                               0545 01347000
         LA    @01,0(@15,@14)                                      0545 01348000
         AL    @01,@CF00911                                        0545 01349000
         SLR   @00,@00                                             0545 01350000
         IC    @00,SYSITEM-4(,@01)                                 0545 01351000
         NR    R8,@00                                              0545 01352000
         ALR   R8,@03                                              0545 01353000
*       SHRFLGS(R8) = ON;         /*A PRINT TIME IF ZERO NO PRINT    */ 01354000
         LA    @07,1                                               0546 01355000
         STC   @07,SHRFLGS-1(R8)                                   0546 01356000
*     SYS2TPRM = SYS2TPRM + SYSPERM(CT);                   /*@0099VLS*/ 01357000
         ST    @15,@TF00001                                        0547 01358000
         ALR   @15,@14                                             0547 01359000
         AL    @15,@CF00912                                        0547 01360000
         ICM   @15,12,SYSPERM-7(@15)                               0547 01361000
         SRA   @15,16                                              0547 01362000
         L     @07,SYS2TPRM                                        0547 01363000
         ALR   @07,@15                                             0547 01364000
         ST    @07,SYS2TPRM                                        0547 01365000
*     SYS2PERM(R8) = SYS2PERM(R8) + SYSPERM(CT);           /*@0099VLS*/ 01366000
         LR    @07,R8                                              0548 01367000
         SLA   @07,2                                               0548 01368000
         L     @06,SYS2PERM-4(@07)                                 0548 01369000
         ALR   @06,@15                                             0548 01370000
         ST    @06,SYS2PERM-4(@07)                                 0548 01371000
*     TOTALPRM(R8) = TOTALPRM(R8) + SYSPERM(CT);           /*@0099VLS*/ 01372000
         L     @06,TOTALPRM-4(@07)                                 0549 01373000
         ALR   @06,@15                                             0549 01374000
         ST    @06,TOTALPRM-4(@07)                                 0549 01375000
*     TOTALTOT = TOTALTOT + SYSPERM(CT);                   /*@0099VLS*/ 01376000
         AL    @15,TOTALTOT                                        0550 01377000
         ST    @15,TOTALTOT                                        0550 01378000
*       SYS2TEMP(R8) = SYS2TEMP(R8) + SYSTEMP(CT);         /*@Z427VLS*/ 01379000
         AL    @14,@TF00001                                        0551 01380000
         AL    @14,@CF00913                                        0551 01381000
         ICM   @15,15,SYSTEMP-9(@14)                               0551 01382000
         L     @14,SYS2TEMP-4(@07)                                 0551 01383000
         ALR   @14,@15                                             0551 01384000
         ST    @14,SYS2TEMP-4(@07)                                 0551 01385000
*       SYS2TTOT = SYS2TTOT + SYSTEMP(CT);                 /*@Z427VLS*/ 01386000
         L     @14,SYS2TTOT                                        0552 01387000
         ALR   @14,@15                                             0552 01388000
         ST    @14,SYS2TTOT                                        0552 01389000
*         TOTALTP = TOTALTP+ SYSTEMP(CT);                  /*@Z427VLS*/ 01390000
         L     @14,TOTALTP                                         0553 01391000
         ALR   @14,@15                                             0553 01392000
         ST    @14,TOTALTP                                         0553 01393000
*         TOTALTMP(R8) = TOTALTMP(R8) + SYSTEMP(CT);       /*@Z427VLS*/ 01394000
         AL    @15,TOTALTMP-4(@07)                                 0554 01395000
         ST    @15,TOTALTMP-4(@07)                                 0554 01396000
*       IF DEBUG18 = ON THEN                                       0555 01397000
         TM    DEBUG18(R2),B'00100000'                             0555 01398000
         BNO   @RF00555                                            0555 01399000
*        DO;                                               /*@Z427VLS*/ 01400000
*         DBUGCT(OLDGROUP) = DBUGCT(OLDGROUP) + ONE;       /*@Z427VLS*/ 01401000
         L     @06,OLDGROUP                                        0557 01402000
         SLA   @06,2                                               0557 01403000
         L     @15,DBUGCT-4(@06)                                   0557 01404000
         ALR   @15,@03                                             0557 01405000
         ST    @15,DBUGCT-4(@06)                                   0557 01406000
*         PRIMEYES(R8) = PRIMEYES(R8) + ONE;               /*@Z427VLS*/ 01407000
         L     @06,PRIMEYES-4(@07)                                 0558 01408000
         ALR   @06,@03                                             0558 01409000
         ST    @06,PRIMEYES-4(@07)                                 0558 01410000
*         IF R8 ^= R9 THEN           /*IS THE ENTRY FROM A SHARED DEV*/ 01411000
         CR    R8,R9                                               0559 01412000
         BE    @RF00559                                            0559 01413000
*         PRIMENO(R9) = PRIMENO(R9) + ONE;                 /*@Z427VLS*/ 01414000
         LR    @15,R9                                              0560 01415000
         SLA   @15,2                                               0560 01416000
         AL    @03,PRIMENO-4(@15)                                  0560 01417000
         ST    @03,PRIMENO-4(@15)                                  0560 01418000
*        END;                                              /*@Z427VLS*/ 01419000
@RF00559 DS    0H                                                  0562 01420000
*       CT = CT + ONE;                                     /*@Z427VLS*/ 01421000
@RF00555 L     @03,CT                                              0562 01422000
         AL    @03,ONE                                             0562 01423000
         ST    @03,CT                                              0562 01424000
*END;                                                      /*@Z427VLS*/ 01425000
@EL00016 DS    0H                                                  0563 01426000
@EF00016 DS    0H                                                  0563 01427000
@ER00016 LM    @14,@12,12(@13)                                     0563 01428000
         BR    @14                                                 0563 01429000
*/********************************************************************/ 01430000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 01431000
*/*    THIS PROC WILL MOVE THE DEVICE TYPE INTO THE PRINT BUFFER     */ 01432000
*/*    IF THE DEVICE TYPE IS ALL ZEROS WORD UKNO IS MOVED IN @Z427VLS*/ 01433000
*/*                                                          @Z427VLS*/ 01434000
*DEVTYPE: PROC;                                            /*@Z427VLS*/ 01435000
DEVTYPE  STM   @14,@12,@SA00017                                    0564 01436000
*IF SYSDEV(CT) ^= '0000'X THEN                                     0565 01437000
         L     @03,CT                                              0565 01438000
         MH    @03,@CH00703                                        0565 01439000
         L     @15,SORTADR(,R2)                                    0565 01440000
         ST    @03,@TF00001                                        0565 01441000
         ALR   @03,@15                                             0565 01442000
         AL    @03,@CF00909                                        0565 01443000
         CLC   SYSDEV-5(2,@03),@CB00206                            0565 01444000
         BE    @RF00565                                            0565 01445000
* DO;                                                      /*@Z427VLS*/ 01446000
* ADDNXT = ADDR(DEVTYP);          /*SET UP WHERE TO PUT CONVERTED    */ 01447000
         LA    @03,DEVTYP                                          0567 01448000
         ST    @03,ADDNXT                                          0567 01449000
* NUMBER = TWO;                   /*SET UP TO CHANGE 2 BYTES TO PRINT*/ 01450000
         L     @03,TWO                                             0568 01451000
         ST    @03,NUMBER                                          0568 01452000
* NEXTBY = ADDR(SYSDEV(CT));      /*ADDRESS OF WHERE TO GET THE DATA */ 01453000
         L     @03,@TF00001                                        0569 01454000
         AL    @15,@CF00909                                        0569 01455000
         LA    @03,SYSDEV-5(@03,@15)                               0569 01456000
         ST    @03,NEXTBY                                          0569 01457000
* CALL CONVERT;                   /*GO CONVERT THE ITEM TO PRINTABLE */ 01458000
         BAL   @14,CONVERT                                         0570 01459000
* END;                                                     /*@Z427VLS*/ 01460000
* ELSE                                                             0572 01461000
* DEVTYP = UKNO;                  /*MOVE UKNO INTO PRINT BUFFER      */ 01462000
         B     @RC00565                                            0572 01463000
@RF00565 MVC   DEVTYP(4),UKNO                                      0572 01464000
* SAVEDEV = SYSDEV(CT);   /*SAVE FOR LATER CHECK             @Z427VLS*/ 01465000
@RC00565 L     @03,CT                                              0573 01466000
         MH    @03,@CH00703                                        0573 01467000
         L     @01,SORTADR(,R2)                                    0573 01468000
         ALR   @01,@03                                             0573 01469000
         AL    @01,@CF00909                                        0573 01470000
         MVC   SAVEDEV(2),SYSDEV-5(@01)                            0573 01471000
*END;                                                      /*@Z427VLS*/ 01472000
@EL00017 DS    0H                                                  0574 01473000
@EF00017 DS    0H                                                  0574 01474000
@ER00017 LM    @14,@12,@SA00017                                    0574 01475000
         BR    @14                                                 0574 01476000
*/********************************************************************/ 01477000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 01478000
*/*    THIS PROC WILL MOVE THE CUA INTO THE PRINT BUFFER AND FOR SOME*/ 01479000
*/*    GROUPS WILL FORCE AN X IN THE LAST POSITION OF THE CUA        */ 01480000
*/*                                                          @Z427VLS*/ 01481000
*DOCUX: PROC;                                              /*@Z427VLS*/ 01482000
DOCUX    STM   @14,@12,@SA00018                                    0575 01483000
* ADDNXT = ADDR(CUX);             /*SET UP WHERE TO PUT CONVERTED    */ 01484000
         LA    @03,CUX                                             0576 01485000
         ST    @03,ADDNXT                                          0576 01486000
* NUMBER = TWO;                   /*SET UP TO CHANGE 2 BYTES TO PRINT*/ 01487000
         L     @03,TWO                                             0577 01488000
         ST    @03,NUMBER                                          0577 01489000
* SWITCH1 = ON;                   /*SET NOT TO USE 1/2 OF FIRST BYTE */ 01490000
         OI    SWITCH1,B'10000000'                                 0578 01491000
* R8 = SYSRT(CT);                 /*PULL UP WORD WITH CUX INFO       */ 01492000
         L     @03,CT                                              0579 01493000
         MH    @03,@CH00703                                        0579 01494000
         L     @01,SORTADR(,R2)                                    0579 01495000
         ALR   @01,@03                                             0579 01496000
         AL    @01,@CF00914                                        0579 01497000
         SLR   R8,R8                                               0579 01498000
         ICM   R8,3,SYSRT-1(@01)                                   0579 01499000
* SRL(R8,FOUR);                   /*DUMP JUNK BITS & POSITION CORRECT*/ 01500000
         SRL   R8,4                                                0580 01501000
* TEMPCUA =  R8;                  /*SET VALUE IN ITEM TO CONVERT     */ 01502000
         STH   R8,TEMPCUA                                          0581 01503000
* NEXTBY = ADDR(TEMPCUA);         /*SET UP ADDRESS OF WHERE DATA KEPT*/ 01504000
         LA    @03,TEMPCUA                                         0582 01505000
         ST    @03,NEXTBY                                          0582 01506000
* CALL CONVERT;                   /*GO CONVERT THE DATA TO PRINTABLE */ 01507000
         BAL   @14,CONVERT                                         0583 01508000
* IF SYSGROUP(CT) = TWO |                                          0584 01509000
*    SYSGROUP(CT) = THREE |                                        0584 01510000
*    SYSGROUP(CT) = FOUR                                           0584 01511000
*   THEN                                                           0584 01512000
         L     @03,CT                                              0584 01513000
         MH    @03,@CH00703                                        0584 01514000
         L     @01,SORTADR(,R2)                                    0584 01515000
         AL    @01,@CF00915                                        0584 01516000
         SLR   @15,@15                                             0584 01517000
         IC    @15,SYSGROUP(@03,@01)                               0584 01518000
         C     @15,TWO                                             0584 01519000
         BE    @RT00584                                            0584 01520000
         C     @15,@CF00073                                        0584 01521000
         BE    @RT00584                                            0584 01522000
         C     @15,@CF00060                                        0584 01523000
         BNE   @RF00584                                            0584 01524000
@RT00584 DS    0H                                                  0585 01525000
*     GEN(MVI  CUX+3,X'E7');       /*MOVE IN TO LAST BYTE AN 'X'    */  01526000
         MVI  CUX+3,X'E7'                                               01527000
*END;                                                      /*@Z427VLS*/ 01528000
@EL00018 DS    0H                                                  0586 01529000
@EF00018 DS    0H                                                  0586 01530000
@ER00018 LM    @14,@12,@SA00018                                    0586 01531000
         BR    @14                                                 0586 01532000
*/********************************************************************/ 01533000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 01534000
*/*    THIS PROC WILL PRINT OUT THE HEADING FOR THE SECOND PART      */ 01535000
*/*                                                          @Z427VLS*/ 01536000
*HEADING2:  PROC;                                          /*@Z427VLS*/ 01537000
HEADING2 STM   @14,@12,@SA00019                                    0587 01538000
*  IF SWITCH2 = OFF THEN /*AVOID A BLANK PAGE                @Z427VLS*/ 01539000
         TM    SWITCH2,B'01000000'                                 0588 01540000
         BNZ   @RF00588                                            0588 01541000
*  DO;                                                     /*@Z427VLS*/ 01542000
*  SPACING = UPSPACE;    /*LET'S START ON A FRESH PAGE BY SKIP CHN 1 */ 01543000
         MVC   SPACING(1),UPSPACE                                  0590 01544000
*  MYLINECT = ZERO;                                        /*@Z427VLS*/ 01545000
         SLR   @03,@03                                             0591 01546000
         ST    @03,MYLINECT                                        0591 01547000
*  CALL PRINTIT;         /*GP SKIP TO CHANNEL ONE            @Z427VLS*/ 01548000
         BAL   @14,PRINTIT                                         0592 01549000
*  END;                                                    /*@Z427VLS*/ 01550000
*  SPACING = SINGLE ;    /*RESTORE THE SPACING TO SINGLE     @Z427VLS*/ 01551000
@RF00588 MVC   SPACING(1),SINGLE                                   0594 01552000
*  PART1 = PART2;        /*SET UP THE FIRST LINE TO REFLECT SECOND   */ 01553000
         MVC   PART1(8),PART2                                      0595 01554000
*  CHANGE1 = CHANGE2 ;   /*CHANGE SECOND LINE TO 2 PART OF OUTPUT    */ 01555000
         MVC   CHANGE1(23),CHANGE2                                 0596 01556000
*  HEADMOVE = LINE1;     /*MOVE IN THE FIRST LINE TO BUFFER  @Z427VLS*/ 01557000
         MVC   HEADMOVE(59),LINE1                                  0597 01558000
*  CALL PRINTIT;         /*GO & PRINT OUT THE FIRST LINE     @Z427VLS*/ 01559000
         BAL   @14,PRINTIT                                         0598 01560000
*  HEADMOVE = LINE2;     /*MOVE SECOND LINE TO THE OUTPUT BUFFER     */ 01561000
         MVC   HEADMOVE(59),LINE2                                  0599 01562000
*  CALL PRINTIT;         /*GO AND PRINT THE OUTPUT           @Z427VLS*/ 01563000
         BAL   @14,PRINTIT                                         0600 01564000
*  HEADMOVE = LINE3;     /*MOVE IN THE THIRD LINE OF HEADING @Z427VLS*/ 01565000
         MVC   HEADMOVE(59),LINE3                                  0601 01566000
*  CALL PRINTIT;         /*GO & PRINT THE LINE               @Z427VLS*/ 01567000
         BAL   @14,PRINTIT                                         0602 01568000
*END;                                                      /*@Z427VLS*/ 01569000
@EL00019 DS    0H                                                  0603 01570000
@EF00019 DS    0H                                                  0603 01571000
@ER00019 LM    @14,@12,@SA00019                                    0603 01572000
         BR    @14                                                 0603 01573000
*/********************************************************************/ 01574000
*/* * * * * * * * * * * * * * * * * * * * * * *  * * * * * * * * * * */ 01575000
*/*    THIS PROC WILL SETUP LINKAGE TO ACCESS I/O SERVICE PRINT      */ 01576000
*/*                                                          @Z427VLS*/ 01577000
*PRINTIT: PROC;                                            /*@Z427VLS*/ 01578000
PRINTIT  STM   @14,@12,@SA00020                                    0604 01579000
*  PRINTADR = ADDR(PRINTLNE); /*HAVE TO PASS I/O ADDRESS OF BUFFER   */ 01580000
         LA    @03,PRINTLNE                                        0605 01581000
         ST    @03,PRINTADR(,R2)                                   0605 01582000
*  CALL IOHND(RITEPRTR);      /*PASS CONTROL TO I/O HANDLER  @Z427VLS*/ 01583000
         L     @15,ADIOHND(,R2)                                    0606 01584000
         LA    @01,@AL00606                                        0606 01585000
         BALR  @14,@15                                             0606 01586000
*  IF SPACING= SINGLE & DDTYPE = '0' THEN                          0607 01587000
         CLC   SPACING(1),SINGLE                                   0607 01588000
         BNE   @RF00607                                            0607 01589000
         CLI   DDTYPE,C'0'                                         0607 01590000
         BNE   @RF00607                                            0607 01591000
*   MYLINECT = MYLINECT + ONE;                             /*@Z427VLS*/ 01592000
         L     @03,MYLINECT                                        0608 01593000
         AL    @03,ONE                                             0608 01594000
         ST    @03,MYLINECT                                        0608 01595000
*   ELSE                                                           0609 01596000
*    IF SPACING= DOUBLE THEN  /*DOUBLE SPACING               @Z427VLS*/ 01597000
         B     @RC00607                                            0609 01598000
@RF00607 CLC   SPACING(1),DOUBLE                                   0609 01599000
         BNE   @RF00609                                            0609 01600000
*     MYLINECT = MYLINECT + TWO; /*ADD 2 TO THE COUNT        @Z427VLS*/ 01601000
         L     @03,MYLINECT                                        0610 01602000
         AL    @03,TWO                                             0610 01603000
         ST    @03,MYLINECT                                        0610 01604000
*      ELSE                                                        0611 01605000
*       IF SPACING = TRIPLE      /* RIGHT,TRIPLE SPACING     @Z427VLS*/ 01606000
*         THEN MYLINECT = MYLINECT + THREE;/*OTHER WISE UPSPACE      */ 01607000
         B     @RC00609                                            0611 01608000
@RF00609 CLC   SPACING(1),TRIPLE                                   0611 01609000
         BNE   @RF00611                                            0611 01610000
         LA    @03,3                                               0612 01611000
         AL    @03,MYLINECT                                        0612 01612000
         ST    @03,MYLINECT                                        0612 01613000
*       ELSE                                                       0613 01614000
*        IF SPACING = UPSPACE THEN /*DO WE NEED TO RESET COUNT       */ 01615000
         B     @RC00611                                            0613 01616000
@RF00611 CLC   SPACING(1),UPSPACE                                  0613 01617000
         BNE   @RF00613                                            0613 01618000
*          MYLINECT = ZERO;      /*AVOID MULTI UPSPACES      @Z427VLS*/ 01619000
         SLR   @03,@03                                             0614 01620000
         ST    @03,MYLINECT                                        0614 01621000
*    IF MYLINECT =>  LINECT      /*LINECT SET BY USER DEFAULT = 50   */ 01622000
*      THEN                                                        0615 01623000
@RF00613 DS    0H                                                  0615 01624000
@RC00611 DS    0H                                                  0615 01625000
@RC00609 DS    0H                                                  0615 01626000
@RC00607 L     @03,MYLINECT                                        0615 01627000
         CH    @03,LINECT(,R2)                                     0615 01628000
         BL    @RF00615                                            0615 01629000
*       DO;                                                /*@Z427VLS*/ 01630000
*        SPACING= UPSPACE;       /*CHANGE THE CHARIAGE CONTROL CHAR  */ 01631000
         MVC   SPACING(1),UPSPACE                                  0617 01632000
*        MYLINECT = ZERO;                                  /*@Z427VLS*/ 01633000
         SLR   @03,@03                                             0618 01634000
         ST    @03,MYLINECT                                        0618 01635000
*        PRINTADR = ADDR(PRINTLNE);                        /*@Z427VLS*/ 01636000
         LA    @03,PRINTLNE                                        0619 01637000
         ST    @03,PRINTADR(,R2)                                   0619 01638000
*        CALL IOHND(RITEPRTR);                             /*@Z427VLS*/ 01639000
         L     @15,ADIOHND(,R2)                                    0620 01640000
         LA    @01,@AL00620                                        0620 01641000
         BALR  @14,@15                                             0620 01642000
*        SPACING= SINGLE;        /*CHANGE CC BACK TO SINGLE SPACE    */ 01643000
         MVC   SPACING(1),SINGLE                                   0621 01644000
*        IF SWITCH3 = ON THEN    /*MAKE SURE WE ARE IN PART 2        */ 01645000
         TM    SWITCH3,B'00100000'                                 0622 01646000
         BNO   @RF00622                                            0622 01647000
*        SWITCH2 = ON;           /*IF PART TWO WANT NEW HEADING      */ 01648000
         OI    SWITCH2,B'01000000'                                 0623 01649000
*       END;                                               /*@Z427VLS*/ 01650000
*END;                                                      /*@Z427VLS*/ 01651000
@EL00020 DS    0H                                                  0625 01652000
@EF00020 DS    0H                                                  0625 01653000
@ER00020 LM    @14,@12,@SA00020                                    0625 01654000
         BR    @14                                                 0625 01655000
*/********************************************************************/ 01656000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01657000
*/*    THIS PROC WILL BUILD THE COUNTS FOR PART TWO OF THE REPORT    */ 01658000
*/*    THE TABLE BEING USED IS BUILT BY IFCFILT2 PRIOR TO THIS BEING */ 01659000
*/*    CALLED.  3705 IS BROKEN OUT AS IT HAD EXTRA BREAK POINT AND  */  01660000
*/*    DID NOT FIT INTO OVER ALL SET UP.  WILL PROCESS UP TO 16      */ 01661000
*/*    DIFFERENT CPUS BUT WILL ONLY PRINT OUT 11 (MAX FIT ON PAGE)   */ 01662000
*/*    WAS EASIER TO DO IT THIS WAY IF EVER DECIDED TO USE A WRAP    */ 01663000
*/*    AROUND IDEA TO PRINT ALL 16 GOOD LUCK AS WILL BE ALL BROKEN UP*/ 01664000
*/*    NOTE IF GROUP ORDER IS CHANGED SYSUM WILL FALL APART MAKE SURE*/ 01665000
*/*    THEY ARE ADDED AT THE BOTTOM IN IFCFILT2 THEN THERE WILL BE   */ 01666000
*/*    IMPACT ONLY TO DEVGROUP                               @Z427VLS*/ 01667000
*/*    THE FOLLOWING IS THE LAY OUT OF THE TABLE USED BY TOTAL2      */ 01668000
*/*                                                          @Z427VLS*/ 01669000
*/*     DCL   1    SYSUM2(*)   BASED(SORTADR), SORTADR SET BY FILT2 **/ 01670000
*/*            2   SYSUMKEY,                                 @Z427VLS*/ 01671000
*/*             3  SYSGROUP   FIXED(8) BDY(BYTE)             @Z427VLS*/ 01672000
*/*             3  SYSRT      BIT(16)                        @Z427VLS*/ 01673000
*/*              4 SYSCUA     BIT(12)                        @Z427VLS*/ 01674000
*/*              4   *        BIT(4)                         @Z427VLS*/ 01675000
*/*             3  SYSCPUS    BIT(8)                         @Z427VLS*/ 01676000
*/*              4 SYSCPU     BIT(4)                         @Z427VLS*/ 01677000
*/*              4 SYSOLD     BIT(4)  WILL ALWAYS BE ZERO    @Z427VLS*/ 01678000
*/*            2   SYSITEM    BIT(8)                         @Z427VLS*/ 01679000
*/*             3  SYS3705    BIT(4)                         @Z427VLS*/ 01680000
*/*             3  SYSOLDA    BIT(4)                         @Z427VLS*/ 01681000
*/*            2   SYSDEV     CHAR(2)                        @Z427VLS*/ 01682000
*/*            2   SYSTEMP    FIXED(31)                      @Z427VLS*/ 01683000
*/*             3  SYSPERM    BIT(1)                         @Z427VLS*/ 01684000
*/*             3     *       BIT(15)                        @Z427VLS*/ 01685000
*/*                                                          @Z427VLS*/ 01686000
*TOTAL2: PROC;                                             /*@Z427VLS*/ 01687000
TOTAL2   STM   @14,@12,@SA00021                                    0626 01688000
* MAXLIMIT = SORTNUM;                                      /*@Z427VLS*/ 01689000
         L     @03,SORTNUM(,R2)                                    0627 01690000
         ST    @03,MAXLIMIT                                        0627 01691000
* OLDGROUP=  SYSGROUP(ONE);       /*SET INITIAL GROUP CONTROL       */  01692000
         L     @03,ONE                                             0628 01693000
         MH    @03,@CH00703                                        0628 01694000
         L     @15,SORTADR(,R2)                                    0628 01695000
         AL    @03,@CF00915                                        0628 01696000
         SLR   @14,@14                                             0628 01697000
         IC    @14,SYSGROUP(@03,@15)                               0628 01698000
         ST    @14,OLDGROUP                                        0628 01699000
* LASTCPU = (SYSCPUS(1) & 'F0'X); /*SET CPU = FIRST ENTRY FOR FIRST  */ 01700000
         LA    @03,240                                             0629 01701000
         SLR   @14,@14                                             0629 01702000
         IC    @14,SYSCPUS(,@15)                                   0629 01703000
         NR    @03,@14                                             0629 01704000
         ST    @03,LASTCPU                                         0629 01705000
* LASTCUA = (SYSRT(1) ); /*SET CUA = FIRST ENTRY FOR FIRST   @Z427VLS*/ 01706000
         SLR   @03,@03                                             0630 01707000
         ICM   @03,3,SYSRT(@15)                                    0630 01708000
         ST    @03,LASTCUA                                         0630 01709000
* CALL TOPLINE;                   /*PRINT OUT TOTAL PERM TEMP WORDS  */ 01710000
         BAL   @14,TOPLINE                                         0631 01711000
* CT = ONE;                       /*SET UP THE INDEX         @Z427VLS*/ 01712000
         L     @03,ONE                                             0632 01713000
         ST    @03,CT                                              0632 01714000
* DO UNTIL (CT  > MAXLIMIT);                               /*@Z427VLS*/ 01715000
@DL00633 DS    0H                                                  0634 01716000
*    IF OLDGROUP ^= FIVE THEN /*3705 TAKEN CARE OF IN NEXT PROC  */     01717000
         L     @03,FIVE                                            0634 01718000
         C     @03,OLDGROUP                                        0634 01719000
         BE    @RF00634                                            0634 01720000
*     DO;                                                  /*@0001VLS*/ 01721000
*       IF   MYLINECT > (LINECT - FIVE )  THEN                     0636 01722000
         LCR   @03,@03                                             0636 01723000
         AH    @03,LINECT(,R2)                                     0636 01724000
         C     @03,MYLINECT                                        0636 01725000
         BNL   @RF00636                                            0636 01726000
*         CALL HEAD2P;         /*HEADING WITH GROUP          @0001VLS*/ 01727000
         BAL   @14,HEAD2P                                          0637 01728000
*        ELSE                                                      0638 01729000
*         CALL PRTGROUP;       /*JUST PRINT THE GROUP LABLE  @0001VLS*/ 01730000
         B     @RC00636                                            0638 01731000
@RF00636 BAL   @14,PRTGROUP                                        0638 01732000
*     END;                                                 /*@0001VLS*/ 01733000
@RC00636 DS    0H                                                  0640 01734000
* DO UNTIL(CT > MAXLIMIT     |   /*GROUP IS MAJOR BREAKPOINT @ZA25332*/ 01735000
*   OLDGROUP  ^=  SYSGROUP(CT));                           /*@ZA25332*/ 01736000
@RF00634 DS    0H                                                  0640 01737000
@DL00640 DS    0H                                                  0641 01738000
*    IF OLDGROUP = FIVE           /*3705 IS SPECIAL PAIN IN THE      */ 01739000
*      THEN                                                        0641 01740000
         CLC   OLDGROUP(4),FIVE                                    0641 01741000
         BNE   @RF00641                                            0641 01742000
*       CALL DO3705;                                       /*@Z427VLS*/ 01743000
         BAL   @14,DO3705                                          0642 01744000
*    IF CT ^> MAXLIMIT THEN                                        0643 01745000
@RF00641 L     @03,CT                                              0643 01746000
         C     @03,MAXLIMIT                                        0643 01747000
         BH    @RF00643                                            0643 01748000
*    DO;                                                   /*@Z427VLS*/ 01749000
*   CALL DOCUX;                    /* MOVE IN THE CUA OR CUX @0001VLS*/ 01750000
         BAL   @14,DOCUX                                           0645 01751000
*   CALL DEVTYPE;                  /* MOVE IN THE DEVICE TYPE        */ 01752000
         BAL   @14,DEVTYPE                                         0646 01753000
* DO UNTIL(CT > MAXLIMIT     |     /*SECOND MAJOR BREAKPOINT @ZA25332*/ 01754000
*    (SYSRT(CT)) ^= LASTCUA) |                             /*@ZA25332*/ 01755000
*            OLDGROUP^= SYSGROUP(CT);                      /*@Z427VLS*/ 01756000
@DL00647 DS    0H                                                  0648 01757000
*     CALL DOCUX;                                          /*@Z427VLS*/ 01758000
         BAL   @14,DOCUX                                           0648 01759000
* DO UNTIL(CT > MAXLIMIT     |     /*THIRD  MAJOR BREAKPOINT @ZA25332*/ 01760000
*    (SYSCPUS(CT) & 'F0'X) ^= LASTCPU                              0649 01761000
*             | LASTCUA ^=(SYSRT(CT) )                             0649 01762000
*             | OLDGROUP^= SYSGROUP(CT));                  /*@Z427VLS*/ 01763000
@DL00649 DS    0H                                                  0650 01764000
*              CALL DOCOUNT;       /*GO ADD UP HTE RECORDS   @Z427VLS*/ 01765000
         BAL   @14,DOCOUNT                                         0650 01766000
*     END;                                                 /*@Z427VLS*/ 01767000
@DE00649 L     @03,CT                                              0651 01768000
         C     @03,MAXLIMIT                                        0651 01769000
         BH    @DC00649                                            0651 01770000
         MH    @03,@CH00703                                        0651 01771000
         L     @15,SORTADR(,R2)                                    0651 01772000
         LA    @14,240                                             0651 01773000
         LA    @01,0(@03,@15)                                      0651 01774000
         AL    @01,@CF00917                                        0651 01775000
         SLR   @00,@00                                             0651 01776000
         IC    @00,SYSCPUS-3(,@01)                                 0651 01777000
         NR    @14,@00                                             0651 01778000
         C     @14,LASTCPU                                         0651 01779000
         BNE   @DC00649                                            0651 01780000
         L     @14,LASTCUA                                         0651 01781000
         ST    @03,@TF00001                                        0651 01782000
         ALR   @03,@15                                             0651 01783000
         AL    @03,@CF00914                                        0651 01784000
         SLR   @07,@07                                             0651 01785000
         ICM   @07,3,SYSRT-1(@03)                                  0651 01786000
         CR    @14,@07                                             0651 01787000
         BNE   @DC00649                                            0651 01788000
         L     @03,OLDGROUP                                        0651 01789000
         L     @14,@TF00001                                        0651 01790000
         AL    @15,@CF00915                                        0651 01791000
         SLR   @07,@07                                             0651 01792000
         IC    @07,SYSGROUP(@14,@15)                               0651 01793000
         CR    @03,@07                                             0651 01794000
         BE    @DL00649                                            0651 01795000
@DC00649 DS    0H                                                  0652 01796000
*    CALL DATALINE ;               /*GO PRINT THE DATA ACCUMLATED   */  01797000
         BAL   @14,DATALINE                                        0652 01798000
*    IF CT ^> MAXLIMIT THEN                                        0653 01799000
         L     @03,CT                                              0653 01800000
         C     @03,MAXLIMIT                                        0653 01801000
         BH    @RF00653                                            0653 01802000
*      LASTCPU = (SYSCPUS(CT) &'F0'X);                     /*@Z427VLS*/ 01803000
         MH    @03,@CH00703                                        0654 01804000
         L     @01,SORTADR(,R2)                                    0654 01805000
         LA    @00,240                                             0654 01806000
         AL    @01,@CF00917                                        0654 01807000
         SLR   @15,@15                                             0654 01808000
         IC    @15,SYSCPUS-3(@03,@01)                              0654 01809000
         NR    @00,@15                                             0654 01810000
         ST    @00,LASTCPU                                         0654 01811000
*    END;                                                  /*@Z427VLS*/ 01812000
@RF00653 DS    0H                                                  0655 01813000
@DE00647 L     @03,CT                                              0655 01814000
         C     @03,MAXLIMIT                                        0655 01815000
         BH    @DC00647                                            0655 01816000
         MH    @03,@CH00703                                        0655 01817000
         L     @15,SORTADR(,R2)                                    0655 01818000
         ST    @03,@TF00001                                        0655 01819000
         ALR   @03,@15                                             0655 01820000
         AL    @03,@CF00914                                        0655 01821000
         SLR   @14,@14                                             0655 01822000
         ICM   @14,3,SYSRT-1(@03)                                  0655 01823000
         C     @14,LASTCUA                                         0655 01824000
         BNE   @DC00647                                            0655 01825000
         L     @03,OLDGROUP                                        0655 01826000
         L     @14,@TF00001                                        0655 01827000
         AL    @15,@CF00915                                        0655 01828000
         SLR   @07,@07                                             0655 01829000
         IC    @07,SYSGROUP(@14,@15)                               0655 01830000
         CR    @03,@07                                             0655 01831000
         BE    @DL00647                                            0655 01832000
@DC00647 DS    0H                                                  0656 01833000
*    IF CT ^> MAXLIMIT THEN                                        0656 01834000
         L     @03,CT                                              0656 01835000
         C     @03,MAXLIMIT                                        0656 01836000
         BH    @RF00656                                            0656 01837000
*      LASTCUA = (SYSRT(CT) );/*SET FOR NEW CUA              @Z427VLS*/ 01838000
         MH    @03,@CH00703                                        0657 01839000
         L     @01,SORTADR(,R2)                                    0657 01840000
         ALR   @01,@03                                             0657 01841000
         AL    @01,@CF00914                                        0657 01842000
         SLR   @03,@03                                             0657 01843000
         ICM   @03,3,SYSRT-1(@01)                                  0657 01844000
         ST    @03,LASTCUA                                         0657 01845000
*  END;                                                    /*@Z427VLS*/ 01846000
@RF00656 DS    0H                                                  0659 01847000
* END;                                                     /*@Z427VLS*/ 01848000
@RF00643 DS    0H                                                  0659 01849000
@DE00640 L     @03,CT                                              0659 01850000
         C     @03,MAXLIMIT                                        0659 01851000
         BH    @DC00640                                            0659 01852000
         MH    @03,@CH00703                                        0659 01853000
         L     @01,SORTADR(,R2)                                    0659 01854000
         L     @00,OLDGROUP                                        0659 01855000
         AL    @01,@CF00915                                        0659 01856000
         SLR   @15,@15                                             0659 01857000
         IC    @15,SYSGROUP(@03,@01)                               0659 01858000
         CR    @00,@15                                             0659 01859000
         BE    @DL00640                                            0659 01860000
@DC00640 DS    0H                                                  0660 01861000
*  IF CT ^> MAXLIMIT THEN                                          0660 01862000
         L     @03,CT                                              0660 01863000
         C     @03,MAXLIMIT                                        0660 01864000
         BH    @RF00660                                            0660 01865000
*    OLDGROUP = SYSGROUP(CT);    /*RESET THE CONTROL TO NEW GROUP   */  01866000
         MH    @03,@CH00703                                        0661 01867000
         L     @01,SORTADR(,R2)                                    0661 01868000
         AL    @01,@CF00915                                        0661 01869000
         SLR   @00,@00                                             0661 01870000
         IC    @00,SYSGROUP(@03,@01)                               0661 01871000
         ST    @00,OLDGROUP                                        0661 01872000
*  SPACING = DOUBLE;                                       /*@Z427VLS*/ 01873000
@RF00660 MVC   SPACING(1),DOUBLE                                   0662 01874000
*  CALL PRINTIT;                                           /*@Z427VLS*/ 01875000
         BAL   @14,PRINTIT                                         0663 01876000
*  SPACING = SINGLE;                                       /*@Z427VLS*/ 01877000
         MVC   SPACING(1),SINGLE                                   0664 01878000
*END;                                                      /*@Z427VLS*/ 01879000
@DE00633 L     @03,CT                                              0665 01880000
         C     @03,MAXLIMIT                                        0665 01881000
         BNH   @DL00633                                            0665 01882000
*CALL ALLTOTAL;                /*PRINT TOTAL OF ALL COLUMNS  @Z427VLS*/ 01883000
         BAL   @14,ALLTOTAL                                        0666 01884000
* END;                                                     /*@Z427VLS*/ 01885000
@EL00021 DS    0H                                                  0667 01886000
@EF00021 DS    0H                                                  0667 01887000
@ER00021 LM    @14,@12,@SA00021                                    0667 01888000
         BR    @14                                                 0667 01889000
*/********************************************************************/ 01890000
*/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * **/ 01891000
*/*     THIS PROC WILL PROCESS GROUP 4(3705 TYPES) AS THEY REQUIRE   */ 01892000
*/*     SPECIAL PROCESSING  THEY ARE DONE COMPLETLY IN THIS PROC     */ 01893000
*/*     UPON EXIT ALL ITEM WILL BE SET TO PROCESS FOLLOWING GROUPS   */ 01894000
*DO3705: PROC;                                             /*@Z427VLS*/ 01895000
DO3705   STM   @14,@12,@SA00022                                    0668 01896000
* IF MYLINECT > LINECT - TWELVE                                    0669 01897000
*  THEN                                                            0669 01898000
         LH    @03,LINECT(,R2)                                     0669 01899000
         SL    @03,@CF00064                                        0669 01900000
         C     @03,MYLINECT                                        0669 01901000
         BNL   @RF00669                                            0669 01902000
*   CALL HEAD2P;               /*HEADING WITH THE GROUP LABLE      */   01903000
         BAL   @14,HEAD2P                                          0670 01904000
*  ELSE                                                            0671 01905000
*   CALL PRTGROUP;             /*JUST PRINT THE GROUP OUT    @0001VLS*/ 01906000
         B     @RC00669                                            0671 01907000
@RF00669 BAL   @14,PRTGROUP                                        0671 01908000
* DO UNTIL(CT > MAXLIMIT     |                             /*@ZA25332*/ 01909000
*   OLDGROUP  ^=  SYSGROUP(CT));                           /*@ZA25332*/ 01910000
@RC00669 DS    0H                                                  0672 01911000
@DL00672 DS    0H                                                  0673 01912000
*   LASTCPU = (SYSCPUS(CT) & 'F0'X);/*SET UP LAST CPU CONTROL       */  01913000
         LA    @03,240                                             0673 01914000
         L     @15,CT                                              0673 01915000
         MH    @15,@CH00703                                        0673 01916000
         L     @14,SORTADR(,R2)                                    0673 01917000
         LA    @01,0(@15,@14)                                      0673 01918000
         AL    @01,@CF00917                                        0673 01919000
         SLR   @00,@00                                             0673 01920000
         IC    @00,SYSCPUS-3(,@01)                                 0673 01921000
         NR    @00,@03                                             0673 01922000
         ST    @00,LASTCPU                                         0673 01923000
*   LASTCUA = (SYSRT(CT) ); /*SET UP LAST CUA                @Z427VLS*/ 01924000
         ST    @15,@TF00001                                        0674 01925000
         ALR   @15,@14                                             0674 01926000
         AL    @15,@CF00914                                        0674 01927000
         SLR   @07,@07                                             0674 01928000
         ICM   @07,3,SYSRT-1(@15)                                  0674 01929000
         ST    @07,LASTCUA                                         0674 01930000
*   OLD3705 =(SYSITEM(CT)& 'F0'X); /*SET 3705 ODD BREAK POINT       */  01931000
         L     @15,@TF00001                                        0675 01932000
         AL    @14,@CF00911                                        0675 01933000
         SLR   @07,@07                                             0675 01934000
         IC    @07,SYSITEM-4(@15,@14)                              0675 01935000
         NR    @03,@07                                             0675 01936000
         ST    @03,OLD3705                                         0675 01937000
* DO UNTIL(CT > MAXLIMIT     |                             /*@ZA25332*/ 01938000
*   LASTCUA ^= (SYSRT(CT) & 'FFF0'X)    /*CHECK FOR NEW CUA  @ZA25332*/ 01939000
*          | OLDGROUP^= SYSGROUP(CT));                     /*@Z427VLS*/ 01940000
@DL00676 DS    0H                                                  0677 01941000
*  IF MYLINECT  >  LINECT - EIGHT THEN /*MUST HAVE ROOM FOR ALL   */    01942000
         LH    @03,LINECT(,R2)                                     0677 01943000
         SL    @03,@CF00062                                        0677 01944000
         C     @03,MYLINECT                                        0677 01945000
         BNL   @RF00677                                            0677 01946000
*   CALL HEAD2P;              /*THEN PRINT HEADING WITH GROUP      */   01947000
         BAL   @14,HEAD2P                                          0678 01948000
*   CALL DEVTYPE;                  /*GO MOVE IN DEVICE TYPE  @Z427VLS*/ 01949000
@RF00677 BAL   @14,DEVTYPE                                         0679 01950000
*   CALL DOCUX;                    /*GO MOVE IN THE CUX      @Z427VLS*/ 01951000
         BAL   @14,DOCUX                                           0680 01952000
*   CALL PRINTIT;                  /*GO PRINT THE DEVICE TYPE & CUA  */ 01953000
         BAL   @14,PRINTIT                                         0681 01954000
*     DO UNTIL (CT > MAXLIMIT      /*DO ALL OF SAME CPU      @XA21538*/ 01955000
*       | (SYSCPUS(CT) & 'F0'X) ^= LASTCPU /*                @XA21538*/ 01956000
*       | (LASTCUA ^= (SYSRT(CT) ))                                0682 01957000
*       | OLDGROUP ^= SYSGROUP(CT));                       /*@Z427VLS*/ 01958000
@DL00682 DS    0H                                                  0683 01959000
*       R8 = SYSITEM(CT) + '10'X;   /*ADD ONE TO 3705 VALUE  @Z427VLS*/ 01960000
         L     @03,CT                                              0683 01961000
         MH    @03,@CH00703                                        0683 01962000
         L     @01,SORTADR(,R2)                                    0683 01963000
         LA    R8,16                                               0683 01964000
         AL    @01,@CF00911                                        0683 01965000
         SLR   @00,@00                                             0683 01966000
         IC    @00,SYSITEM-4(@03,@01)                              0683 01967000
         ALR   R8,@00                                              0683 01968000
*       SRL(R8,FOUR);                                      /*@Z427VLS*/ 01969000
         SRL   R8,4                                                0684 01970000
*       AT3705 = IS3705(R8);                               /*@Z427VLS*/ 01971000
         LR    @03,R8                                              0685 01972000
         MH    @03,@CH00078                                        0685 01973000
         LA    @01,IS3705-6(@03)                                   0685 01974000
         MVC   AT3705(6),0(@01)                                    0685 01975000
* DO UNTIL(CT > MAXLIMIT     |                             /*@ZA25332*/ 01976000
*   OLD3705 ^= (SYSITEM(CT) & 'F0'X)                       /*@ZA25332*/ 01977000
*                |(SYSCPUS(CT) & 'F0'X) ^= LASTCPU                 0686 01978000
*                | LASTCUA ^= (SYSRT(CT) & 'FFF0'X)                0686 01979000
*                | OLDGROUP^= SYSGROUP(CT));               /*@Z427VLS*/ 01980000
@DL00686 DS    0H                                                  0687 01981000
*         CALL DOCOUNT;             /*GO PROCESS ALL RECORDS @Z427VLS*/ 01982000
         BAL   @14,DOCOUNT                                         0687 01983000
*       END;                                               /*@Z427VLS*/ 01984000
@DE00686 L     @03,CT                                              0688 01985000
         C     @03,MAXLIMIT                                        0688 01986000
         BH    @DC00686                                            0688 01987000
         LA    @15,240                                             0688 01988000
         MH    @03,@CH00703                                        0688 01989000
         L     @14,SORTADR(,R2)                                    0688 01990000
         LA    @01,0(@03,@14)                                      0688 01991000
         AL    @01,@CF00911                                        0688 01992000
         SLR   @00,@00                                             0688 01993000
         IC    @00,SYSITEM-4(,@01)                                 0688 01994000
         NR    @00,@15                                             0688 01995000
         C     @00,OLD3705                                         0688 01996000
         BNE   @DC00686                                            0688 01997000
         LA    @01,0(@03,@14)                                      0688 01998000
         AL    @01,@CF00917                                        0688 01999000
         SLR   @00,@00                                             0688 02000000
         IC    @00,SYSCPUS-3(,@01)                                 0688 02001000
         NR    @15,@00                                             0688 02002000
         C     @15,LASTCPU                                         0688 02003000
         BNE   @DC00686                                            0688 02004000
         L     @15,@CF00889                                        0688 02005000
         ST    @03,@TF00001                                        0688 02006000
         ALR   @03,@14                                             0688 02007000
         AL    @03,@CF00914                                        0688 02008000
         SLR   @07,@07                                             0688 02009000
         ICM   @07,3,SYSRT-1(@03)                                  0688 02010000
         NR    @15,@07                                             0688 02011000
         C     @15,LASTCUA                                         0688 02012000
         BNE   @DC00686                                            0688 02013000
         L     @03,OLDGROUP                                        0688 02014000
         L     @15,@TF00001                                        0688 02015000
         AL    @14,@CF00915                                        0688 02016000
         SLR   @07,@07                                             0688 02017000
         IC    @07,SYSGROUP(@15,@14)                               0688 02018000
         CR    @03,@07                                             0688 02019000
         BE    @DL00686                                            0688 02020000
@DC00686 DS    0H                                                  0689 02021000
*       CALL DATALINE;              /*GO BUILD THE DATA LINE FOR PRT */ 02022000
         BAL   @14,DATALINE                                        0689 02023000
*       IF CT ^> MAXLIMIT THEN                                     0690 02024000
         L     @03,CT                                              0690 02025000
         C     @03,MAXLIMIT                                        0690 02026000
         BH    @RF00690                                            0690 02027000
*         OLD3705 =(SYSITEM(CT) & 'F0'X);/*CHANGE CONTROL    @Z427VLS*/ 02028000
         MH    @03,@CH00703                                        0691 02029000
         L     @01,SORTADR(,R2)                                    0691 02030000
         LA    @00,240                                             0691 02031000
         AL    @01,@CF00911                                        0691 02032000
         SLR   @15,@15                                             0691 02033000
         IC    @15,SYSITEM-4(@03,@01)                              0691 02034000
         NR    @00,@15                                             0691 02035000
         ST    @00,OLD3705                                         0691 02036000
*     END;                                                 /*@Z427VLS*/ 02037000
@RF00690 DS    0H                                                  0692 02038000
@DE00682 L     @03,CT                                              0692 02039000
         C     @03,MAXLIMIT                                        0692 02040000
         BH    @DC00682                                            0692 02041000
         MH    @03,@CH00703                                        0692 02042000
         L     @15,SORTADR(,R2)                                    0692 02043000
         LA    @14,240                                             0692 02044000
         LA    @01,0(@03,@15)                                      0692 02045000
         AL    @01,@CF00917                                        0692 02046000
         SLR   @00,@00                                             0692 02047000
         IC    @00,SYSCPUS-3(,@01)                                 0692 02048000
         NR    @14,@00                                             0692 02049000
         C     @14,LASTCPU                                         0692 02050000
         BNE   @DC00682                                            0692 02051000
         L     @14,LASTCUA                                         0692 02052000
         ST    @03,@TF00001                                        0692 02053000
         ALR   @03,@15                                             0692 02054000
         AL    @03,@CF00914                                        0692 02055000
         SLR   @07,@07                                             0692 02056000
         ICM   @07,3,SYSRT-1(@03)                                  0692 02057000
         CR    @14,@07                                             0692 02058000
         BNE   @DC00682                                            0692 02059000
         L     @03,OLDGROUP                                        0692 02060000
         L     @14,@TF00001                                        0692 02061000
         AL    @15,@CF00915                                        0692 02062000
         SLR   @07,@07                                             0692 02063000
         IC    @07,SYSGROUP(@14,@15)                               0692 02064000
         CR    @03,@07                                             0692 02065000
         BE    @DL00682                                            0692 02066000
@DC00682 DS    0H                                                  0693 02067000
*    IF CT ^> MAXLIMIT THEN                                        0693 02068000
         L     @03,CT                                              0693 02069000
         C     @03,MAXLIMIT                                        0693 02070000
         BH    @RF00693                                            0693 02071000
*      LASTCPU =(SYSCPUS(CT) & 'F0'X);                     /*@Z427VLS*/ 02072000
         MH    @03,@CH00703                                        0694 02073000
         L     @01,SORTADR(,R2)                                    0694 02074000
         LA    @00,240                                             0694 02075000
         AL    @01,@CF00917                                        0694 02076000
         SLR   @15,@15                                             0694 02077000
         IC    @15,SYSCPUS-3(@03,@01)                              0694 02078000
         NR    @00,@15                                             0694 02079000
         ST    @00,LASTCPU                                         0694 02080000
*   END;                                                   /*@Z427VLS*/ 02081000
@RF00693 DS    0H                                                  0695 02082000
@DE00676 L     @03,CT                                              0695 02083000
         C     @03,MAXLIMIT                                        0695 02084000
         BH    @DC00676                                            0695 02085000
         MH    @03,@CH00703                                        0695 02086000
         L     @15,SORTADR(,R2)                                    0695 02087000
         L     @14,@CF00889                                        0695 02088000
         ST    @03,@TF00001                                        0695 02089000
         ALR   @03,@15                                             0695 02090000
         AL    @03,@CF00914                                        0695 02091000
         SLR   @07,@07                                             0695 02092000
         ICM   @07,3,SYSRT-1(@03)                                  0695 02093000
         NR    @14,@07                                             0695 02094000
         C     @14,LASTCUA                                         0695 02095000
         BNE   @DC00676                                            0695 02096000
         L     @03,OLDGROUP                                        0695 02097000
         L     @14,@TF00001                                        0695 02098000
         AL    @15,@CF00915                                        0695 02099000
         SLR   @07,@07                                             0695 02100000
         IC    @07,SYSGROUP(@14,@15)                               0695 02101000
         CR    @03,@07                                             0695 02102000
         BE    @DL00676                                            0695 02103000
@DC00676 DS    0H                                                  0696 02104000
*  END;                                                    /*@Z427VLS*/ 02105000
@DE00672 L     @03,CT                                              0696 02106000
         C     @03,MAXLIMIT                                        0696 02107000
         BH    @DC00672                                            0696 02108000
         MH    @03,@CH00703                                        0696 02109000
         L     @01,SORTADR(,R2)                                    0696 02110000
         L     @00,OLDGROUP                                        0696 02111000
         AL    @01,@CF00915                                        0696 02112000
         SLR   @15,@15                                             0696 02113000
         IC    @15,SYSGROUP(@03,@01)                               0696 02114000
         CR    @00,@15                                             0696 02115000
         BE    @DL00672                                            0696 02116000
@DC00672 DS    0H                                                  0697 02117000
*END;                                                      /*@Z427VLS*/ 02118000
@EL00022 DS    0H                                                  0697 02119000
@EF00022 DS    0H                                                  0697 02120000
@ER00022 LM    @14,@12,@SA00022                                    0697 02121000
         BR    @14                                                 0697 02122000
*/*****************************************************************/    02123000
*/*            PROC WILL PRINT THE HEADING FOR PART 2 WITH THE GROUP*/  02124000
*/*            INFORMATION ALSO                              @0001VLS*/ 02125000
*HEAD2P: PROC;                                             /*@0001VLS*/ 02126000
HEAD2P   STM   @14,@12,@SA00023                                    0698 02127000
* CALL HEADING2 ;              /*PRINT THE TOP PART OF THE HEADING*/    02128000
         BAL   @14,HEADING2                                        0699 02129000
* CALL TOPLINE;                /*PRINT THE CPU TYPES ACROSS THE PAGE*/  02130000
         BAL   @14,TOPLINE                                         0700 02131000
* CALL PRTGROUP;               /*PRINT THE GROUP TYPE LABLE  @0001VLS*/ 02132000
         BAL   @14,PRTGROUP                                        0701 02133000
*END;                                                      /*@0001VLS*/ 02134000
@EL00023 DS    0H                                                  0702 02135000
@EF00023 DS    0H                                                  0702 02136000
@ER00023 LM    @14,@12,@SA00023                                    0702 02137000
         BR    @14                                                 0702 02138000
*/********************************************************************/ 02139000
*/*    THIS PROC WILL PRINT OUT THE DEVICE GROUP             @Z427VLS*/ 02140000
*PRTGROUP: PROC;                                           /*@Z427VLS*/ 02141000
PRTGROUP STM   @14,@12,@SA00024                                    0703 02142000
* IF OLDGROUP ^= ZERO THEN                                         0704 02143000
         L     @03,OLDGROUP                                        0704 02144000
         LTR   @03,@03                                             0704 02145000
         BZ    @RF00704                                            0704 02146000
*   DO;                                                    /*@Z427VLS*/ 02147000
*  IF MYLINECT => LINECT - 3 THEN                                  0706 02148000
         LH    @03,LINECT(,R2)                                     0706 02149000
         SL    @03,@CF00073                                        0706 02150000
         C     @03,MYLINECT                                        0706 02151000
         BH    @RF00706                                            0706 02152000
*  DO;                                                     /*@Z427VLS*/ 02153000
*   CALL HEADING2;                                         /*@Z427VLS*/ 02154000
         BAL   @14,HEADING2                                        0708 02155000
*   CALL TOPLINE;                                          /*@Z427VLS*/ 02156000
         BAL   @14,TOPLINE                                         0709 02157000
*  END;                                                    /*@Z427VLS*/ 02158000
* DEVGRP = DEVGROUP(OLDGROUP);/*MOVE THE NAME INTO THE PRINT LINE  */   02159000
@RF00706 L     @03,OLDGROUP                                        0711 02160000
         SLA   @03,3                                               0711 02161000
         LA    @01,DEVGROUP-8(@03)                                 0711 02162000
         MVC   DEVGRP(8),0(@01)                                    0711 02163000
* R9 = 15 + 10 * EVNUM;   /*# OF ASTRICKS TO BUILD           @Z427VLS*/ 02164000
         L     @03,EVPTR(,R2)                                      0712 02165000
         LH    R9,EVNUM(,@03)                                      0712 02166000
         MH    R9,@CH00272                                         0712 02167000
         AL    R9,@CF00035                                         0712 02168000
* GEN(MVI PRTLINE+10,X'5C');                               /*@Z427VLS*/ 02169000
         MVI PRTLINE+10,X'5C'                                           02170000
* GEN(EX  R9,MOVEGRP);                                     /*@Z427VLS*/ 02171000
         EX  R9,MOVEGRP                                                 02172000
* GENERATE DATA;                                           /*@Z427VLS*/ 02173000
* CALL PRINTIT;               /*PRINT THE GROUP LABLE        @Z427VLS*/ 02174000
         BAL   @14,PRINTIT                                         0716 02175000
* CALL PRINTIT;               /*ADD A SPACE                  @Z427VLS*/ 02176000
         BAL   @14,PRINTIT                                         0717 02177000
*END;                                                      /*@Z427VLS*/ 02178000
*END;                                                      /*@Z427VLS*/ 02179000
@EL00024 DS    0H                                                  0719 02180000
@EF00024 DS    0H                                                  0719 02181000
@ER00024 LM    @14,@12,@SA00024                                    0719 02182000
         BR    @14                                                 0719 02183000
*/********************************************************************/ 02184000
*/*    THIS PROC WILL PRINT TOTALS OF EACH CPU               @Z427VLS*/ 02185000
* ALLTOTAL: PROC;                                          /*@Z427VLS*/ 02186000
ALLTOTAL STM   @14,@12,@SA00025                                    0720 02187000
*  PRTLINE = TOTLABLE;       /*MOVE IN THE LABLE FOR LINE    @Z427VLS*/ 02188000
         MVI   PRTLINE+6,C' '                                      0721 02189000
         MVC   PRTLINE+7(145),PRTLINE+6                            0721 02190000
         MVC   PRTLINE(6),TOTLABLE                                 0721 02191000
*  BNDECNUM = FIVE;          /*FOR THE TOTAL OF TOTALS       @Z427VLS*/ 02192000
         L     @03,FIVE                                            0722 02193000
         ST    @03,BNDECNUM                                        0722 02194000
*  BINWORD = TOTALTOT;       /*PRINT TOTAL OF THE TOTALS     @Z427VLS*/ 02195000
         L     @03,TOTALTOT                                        0723 02196000
         ST    @03,BINWORD                                         0723 02197000
*  DECADDR = ADDR(TOTE2) - 3;                              /*@Z427VLS*/ 02198000
         LA    @03,TOTE2                                           0724 02199000
         SL    @03,@CF00073                                        0724 02200000
         ST    @03,DECADDR                                         0724 02201000
*  CALL CONVBIN;             /*GO CONVERT THE ITEM TO PRINTABLE      */ 02202000
         BAL   @14,CONVBIN                                         0725 02203000
*  DECADDR = DECADDR + SIX; /*MOVE DOWN THE PRINT LINE BY SIX      */   02204000
         L     @03,DECADDR                                         0726 02205000
         AL    @03,SIX                                             0726 02206000
         ST    @03,DECADDR                                         0726 02207000
*  BINWORD = TOTALTP;        /*PICK UP TOTA OF TEMP TOTALS MAY OVER  */ 02208000
         L     @03,TOTALTP                                         0727 02209000
         ST    @03,BINWORD                                         0727 02210000
*                            /*FLOW 5 PRINT POSITIONS BUT THATS TO BD*/ 02211000
*  CALL CONVBIN;             /*GO AND CONVERT THE ITEM TO PRINTABLE  */ 02212000
         BAL   @14,CONVBIN                                         0728 02213000
*  DECADDR = DECADDR + 2;                                  /*@Z427VLS*/ 02214000
         LA    @03,2                                               0729 02215000
         AL    @03,DECADDR                                         0729 02216000
         ST    @03,DECADDR                                         0729 02217000
*  BNDECNUM = FOUR;          /*CHANGE BACK TO ONLY FOUR CHARS OUT    */ 02218000
         MVC   BNDECNUM(4),@CF00060                                0730 02219000
*  DO R = 1 BY 1 TO NUMTODO -ONE;                          /*@Z427VLS*/ 02220000
         LA    @03,1                                               0731 02221000
         ST    @03,R                                               0731 02222000
         B     @DE00731                                            0731 02223000
@DL00731 DS    0H                                                  0732 02224000
*   DECADDR = DECADDR + FIVE;/*MOVE DOWN THE LINE FIVE PRINT POSITION*/ 02225000
         L     @15,DECADDR                                         0732 02226000
         AL    @15,FIVE                                            0732 02227000
         ST    @15,DECADDR                                         0732 02228000
*   BINWORD = TOTALPRM(R);   /*PICK UP TOTAL PERM ERRORS THIS ENTRY */  02229000
         SLA   @03,2                                               0733 02230000
         L     @03,TOTALPRM-4(@03)                                 0733 02231000
         ST    @03,BINWORD                                         0733 02232000
*   CALL CONVBIN;            /*GO CONVERT TO PRINTABLE       @Z427VLS*/ 02233000
         BAL   @14,CONVBIN                                         0734 02234000
*   DECADDR = DECADDR + FIVE;/*RIGHT DOWN THE PRINT LINE 5 MORE CHARS*/ 02235000
         L     @03,DECADDR                                         0735 02236000
         AL    @03,FIVE                                            0735 02237000
         ST    @03,DECADDR                                         0735 02238000
*   BINWORD = TOTALTMP(R);   /*PICK UP THE NEXT TEMP TOTAL   @Z427VLS*/ 02239000
         L     @03,R                                               0736 02240000
         SLA   @03,2                                               0736 02241000
         L     @03,TOTALTMP-4(@03)                                 0736 02242000
         ST    @03,BINWORD                                         0736 02243000
*   CALL CONVBIN;            /*GO CONVERT THE ITEM TO PRINTABLE      */ 02244000
         BAL   @14,CONVBIN                                         0737 02245000
*  END;                                                    /*@Z427VLS*/ 02246000
         LA    @03,1                                               0738 02247000
         AL    @03,R                                               0738 02248000
         ST    @03,R                                               0738 02249000
@DE00731 L     @15,NUMTODO                                         0738 02250000
         SL    @15,ONE                                             0738 02251000
         CR    @03,@15                                             0738 02252000
         BNH   @DL00731                                            0738 02253000
* END;                                                     /*@Z427VLS*/ 02254000
@EL00025 DS    0H                                                  0739 02255000
@EF00025 DS    0H                                                  0739 02256000
@ER00025 LM    @14,@12,@SA00025                                    0739 02257000
         BR    @14                                                 0739 02258000
@PB00025 DS    0H                                                  0740 02259000
*/********************************************************************/ 02260000
*/*    THIS IS THE MAIN BODY OF THE PROGRAM                  @Z427VLS*/ 02261000
*/*    THE TABLES BUILT IN THE PARM TABLE BY IFCFILT2 ARE    @Z427VLS*/ 02262000
*/*                   USED BY TOTAL1 OF THIS SECTION-THE ITEMS HAVE  */ 02263000
*/*                   BEEN TOTALED BY THE FILTER AND ARE JUST        */ 02264000
*/*                   FORMATED & THEN PRINTED BY THIS SECTION        */ 02265000
*/*                   USED BY TOTAL2 IS FOR THE SECOND PART OF THE   */ 02266000
*/*                   REPORT  THESE ITEMS HAVE NOT BEEN TOTALED THIS */ 02267000
*/*                   IS DONE BY THIS SECTION ONE LINE AT A TIME THEN*/ 02268000
*/*                   PRINTED  ONLY GLITCH IS CAUSED BY THE 3705     */ 02269000
*IF DEBUG4  = ON THEN        /*PRINT NAME AND COMPILE DATE   @Z427VLS*/ 02270000
         TM    DEBUG4(R2),B'00001000'                              0740 02271000
         BNO   @RF00740                                            0740 02272000
* DO;                                                      /*@Z427VLS*/ 02273000
*  DDTYPE = '1';                                           /*@Z427VLS*/ 02274000
         MVI   DDTYPE,C'1'                                         0742 02275000
*  R15 = R10 - 27;                                         /*@Z427VLS*/ 02276000
         LR    R15,R10                                             0743 02277000
         SL    R15,@CF00899                                        0743 02278000
*  GEN(MVC  PRTLINE(16),0(R15));                           /*@Z427VLS*/ 02279000
         MVC  PRTLINE(16),0(R15)                                        02280000
*  CALL PRINTIT;                                           /*@Z427VLS*/ 02281000
         BAL   @14,PRINTIT                                         0745 02282000
*  DDTYPE = '0';                                           /*@Z427VLS*/ 02283000
         MVI   DDTYPE,C'0'                                         0746 02284000
* END;                                                     /*@Z427VLS*/ 02285000
*NUMTODO = EVNUM + ONE;      /*SET UP LOOP CONTROL           @Z427VLS*/ 02286000
@RF00740 L     @03,EVPTR(,R2)                                      0748 02287000
         LH    @03,EVNUM(,@03)                                     0748 02288000
         AL    @03,ONE                                             0748 02289000
         ST    @03,NUMTODO                                         0748 02290000
*CALL HEADING1;              /*GO PRINT OUT THE HEADING      @Z427VLS*/ 02291000
         BAL   @14,HEADING1                                        0749 02292000
*CALL TOTAL1;                /*GO COMPUTE THE TOTALS AND PRINT THEM  */ 02293000
         BAL   @14,TOTAL1                                          0750 02294000
*CALL CPUINFO;              /*PRINT THE CPU AND LETTER ASSOCIATED   */  02295000
         BAL   @14,CPUINFO                                         0751 02296000
*IF SORTNUM ^= ZERO THEN                                           0752 02297000
         L     @03,SORTNUM(,R2)                                    0752 02298000
         LTR   @03,@03                                             0752 02299000
         BZ    @RF00752                                            0752 02300000
*DO;                                                       /*@Z427VLS*/ 02301000
*SWITCH3 = ON;               /*TELL  PRINTIT WE ARE DOING PART 2     */ 02302000
         OI    SWITCH3,B'00100000'                                 0754 02303000
*CALL HEADING2;              /*GO PRINT OUT THE HEADING PART 2       */ 02304000
         BAL   @14,HEADING2                                        0755 02305000
*CALL TOTAL2;                /*GO ADD UP THE TOTALS FOR PART 2       */ 02306000
         BAL   @14,TOTAL2                                          0756 02307000
*CALL CPUINFO;              /*PRINT OUT THE CPU AND LETTER   @Z427VLS*/ 02308000
         BAL   @14,CPUINFO                                         0757 02309000
*IF DEBUG18 = ON THEN       /*USER WANTS EXTRA DATA ABOUT THE PROGRAM*/ 02310000
         TM    DEBUG18(R2),B'00100000'                             0758 02311000
         BNO   @RF00758                                            0758 02312000
* CALL DODEBUG;                                            /*@Z427VLS*/ 02313000
         BAL   @14,DODEBUG                                         0759 02314000
*END;                                                      /*@Z427VLS*/ 02315000
@RF00758 DS    0H                                                  0761 02316000
*IF DEBUG12 = ON THEN       /*USER REQUESTED US TO DUMP CORE @Z427VLS*/ 02317000
@RF00752 TM    DEBUG12(R2),B'00001000'                             0761 02318000
         BNO   @RF00761                                            0761 02319000
* GEN(ABEND  240,DUMP);                                    /*@Z427VLS*/ 02320000
         ABEND  240,DUMP                                                02321000
*/********************************************************************/ 02322000
*/********************************************************************/ 02323000
*RETURN;                                                   /*@Z427VLS*/ 02324000
@EL00001 L     @13,4(,@13)                                         0763 02325000
@EF00001 DS    0H                                                  0763 02326000
@ER00001 L     @14,12(,@13)                                        0763 02327000
         LM    @00,@12,20(@13)                                     0763 02328000
         BR    @14                                                 0763 02329000
*END                                                       /*@Z427VLS*/ 02330000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 02331000
*/*%INCLUDE SYSLIB  (COMTABLE)                                        * 02332000
*;                                                                 0764 02333000
         B     @EL00001                                            0764 02334000
@DATA    DS    0H                                                       02335000
@CH00071 DC    H'2'                                                     02336000
@CH00078 DC    H'6'                                                     02337000
@CH00272 DC    H'10'                                                    02338000
@CH00703 DC    H'13'                                                    02339000
@CH00466 DC    H'17'                                                    02340000
         DS    0F                                                       02341000
@AL00606 EQU   *                       LIST WITH   1 ARGUMENT(S)        02342000
@AL00620 DC    A(@CH00071)             LIST WITH   1 ARGUMENT(S)        02343000
         DS    0F                                                       02344000
@SA00001 DS    18F                                                      02345000
@SA00002 DS    15F                                                      02346000
@SA00004 DS    15F                                                      02347000
@SA00020 DS    15F                                                      02348000
@SA00005 DS    15F                                                      02349000
@SA00011 DS    15F                                                      02350000
@SA00009 DS    15F                                                      02351000
@SA00008 DS    15F                                                      02352000
@SA00006 DS    15F                                                      02353000
@SA00007 DS    15F                                                      02354000
@SA00012 DS    15F                                                      02355000
@SA00010 DS    15F                                                      02356000
@SA00013 DS    15F                                                      02357000
@SA00014 DS    15F                                                      02358000
@SA00015 DS    15F                                                      02359000
@SA00017 DS    15F                                                      02360000
@SA00019 DS    15F                                                      02361000
@SA00024 DS    15F                                                      02362000
@SA00018 DS    15F                                                      02363000
@SA00021 DS    15F                                                      02364000
@SA00023 DS    15F                                                      02365000
@SA00022 DS    15F                                                      02366000
@SA00025 DS    15F                                                      02367000
@TF00001 DS    F                                                        02368000
         DS    0F                                                       02369000
@CF00073 DC    F'3'                                                     02370000
@CF00060 DC    F'4'                                                     02371000
@CF00080 DC    F'7'                                                     02372000
@CF00062 DC    F'8'                                                     02373000
@CF00064 DC    F'12'                                                    02374000
@CF00727 DC    F'14'                                                    02375000
@CF00035 DC    F'15'                                                    02376000
@CF00086 DC    F'16'                                                    02377000
@CF00719 DC    F'20'                                                    02378000
@CF00475 DC    F'22'                                                    02379000
@CF00225 DC    F'24'                                                    02380000
@CF00899 DC    F'27'                                                    02381000
@CF00821 DC    F'48'                                                    02382000
@CF00820 DC    F'52'                                                    02383000
@CF00915 DC    F'-13'                                                   02384000
@CF00914 DC    F'-12'                                                   02385000
@CF00917 DC    F'-10'                                                   02386000
@CF00911 DC    F'-9'                                                    02387000
@CF00909 DC    F'-8'                                                    02388000
@CF00912 DC    F'-6'                                                    02389000
@CF00913 DC    F'-4'                                                    02390000
@CF00907 DC    XL4'0000FFFF'                                            02391000
@CF00889 DC    XL4'FFF0'                                                02392000
@CF00052 DC    BL4'1'                                                   02393000
         DS    0D                                                       02394000
PRT      DC    F'0'                                                     02395000
COUNTER  DC    F'0'                                                     02396000
TEN      DC    F'10'                                                    02397000
FIVE     DC    F'5'                                                     02398000
ONE      DC    F'1'                                                     02399000
TWOEIGHT DC    F'28'                                                    02400000
NEXTBY   DC    F'0'                                                     02401000
ADDNXT   DC    F'0'                                                     02402000
BINWORD  DC    F'0'                                                     02403000
NUMBER1  DC    F'1'                                                     02404000
BNDECNUM DC    F'5'                                                     02405000
DECADDR  DC    F'0'                                                     02406000
NUMTODO  DC    F'0'                                                     02407000
I        DC    F'0'                                                     02408000
NUMBER   DC    F'0'                                                     02409000
TWO      DC    F'2'                                                     02410000
MINUS1   DC    F'-1'                                                    02411000
SPCHANGE DC    F'0'                                                     02412000
J        DC    F'0'                                                     02413000
SYS2TPRM DC    F'0'                                                     02414000
SYS2TTOT DC    F'0'                                                     02415000
X        DC    F'0'                                                     02416000
SIX      DC    F'6'                                                     02417000
L        DC    F'0'                                                     02418000
P        DC    F'0'                                                     02419000
R        DC    F'0'                                                     02420000
CT       DC    F'0'                                                     02421000
OLDGROUP DC    F'0'                                                     02422000
LASTCUA  DC    F'0'                                                     02423000
MYLINECT DC    F'0'                                                     02424000
NUMP     DC    F'0'                                                     02425000
LASTCPU  DC    F'0'                                                     02426000
OLD3705  DC    F'0'                                                     02427000
TOTALTOT DC    F'0'                                                     02428000
TOTALTP  DC    F'0'                                                     02429000
BIGPERM  DC    F'0'                                                     02430000
MAXLIMIT DC    F'0'                                                     02431000
TEMPCUA  DC    H'0'                                                     02432000
@CB00206 DC    X'0000'                                                  02433000
PRINTLNE DS    CL134                                                    02434000
         ORG   PRINTLNE                                                 02435000
DDTYPE   DC    CL1'0'                                                   02436000
SPACING  DC    CL1' '                                                   02437000
PRTLINE  DC    CL152' '                                                 02438000
         ORG   PRINTLNE+154                                             02439000
TOTAHED  DC    CL121'TOTAL CPU-A CPU-B CPU-C CPU-D CPU-E CPU-F CPU-G CPC02440000
               U-H CPU-I CPU-J CPU-K CPU-L CPU-M CPU-N CPU-O CPU-P     C02441000
               '                                                        02442000
PART2    DC    CL8'(PART 2)'                                            02443000
HEADING  DS    CL177                                                    02444000
         ORG   HEADING                                                  02445000
LINE1    DS    CL59                                                     02446000
         ORG   LINE1                                                    02447000
@NM00015 DC    CL53'S Y S T E M  S U M M A R Y               REPORT DATC02448000
               E '                                                      02449000
DAYSDATE DC    CL6'XXX XX'                                              02450000
         ORG   HEADING+59                                               02451000
LINE2    DS    CL59                                                     02452000
         ORG   LINE2                                                    02453000
@NM00016 DC    CL9'         '                                           02454000
PART1    DC    CL8'(PART 1)'                                            02455000
@NM00017 DC    CL36'                        PERIOD FROM '               02456000
FROMDATE DC    CL3'   '                                                 02457000
@NM00018 DC    CL1' '                                                   02458000
FROMYEAR DC    CL2'  '                                                  02459000
         ORG   HEADING+118                                              02460000
LINE3    DS    CL59                                                     02461000
         ORG   LINE3                                                    02462000
CHANGE   DC    CL23'CPU/CHANNEL/STORAGE/SCP'                            02463000
@NM00019 DC    CL30'                           TO '                     02464000
TODATE   DC    CL3'   '                                                 02465000
@NM00020 DC    CL1' '                                                   02466000
TOYEAR   DC    CL2'  '                                                  02467000
         ORG   HEADING+177                                              02468000
CPULINE  DC    CL24'CPU   MODEL   SERIAL NO.'                           02469000
CPUDATA  DC    CL22' '                                                  02470000
         ORG   CPUDATA                                                  02471000
@NM00021 DS    CL1                                                      02472000
CPUTYPE  DS    CL1                                                      02473000
@NM00022 DS    CL5                                                      02474000
CPUMODEL DS    CL3                                                      02475000
@NM00023 DS    CL6                                                      02476000
CPUSERAL DS    CL6                                                      02477000
         ORG   CPUDATA+22                                               02478000
CHANGE2  DC    CL23'      I/O SUBSYSTEM    '                            02479000
UPSPACE  DC    X'89'                                                    02480000
SINGLE   DC    X'09'                                                    02481000
DOUBLE   DC    X'11'                                                    02482000
NOTAPPLY DC    CL8'  N/A   '                                            02483000
CHARS    DC    CL16'0123456789ABCDEF'                                   02484000
         DS    CL4                                                      02485000
WORK     DS    CL8                                                      02486000
BUG18    DC    CL19'DEBUG18 INFORMATION'                                02487000
SPCHNG   DC    CL50' '                                                  02488000
         ORG   SPCHNG                                                   02489000
SPNUM    DS    CL5                                                      02490000
@NM00024 DC    CL45'     SAME CUA # WITH DIFFERENT DEVICES TYPES'       02491000
         ORG   SPCHNG+50                                                02492000
SHAREFLG DS    CL17                                                     02493000
         ORG   SHAREFLG                                                 02494000
TOTFLG   DC    BL1'1'                                                   02495000
SHRFLGS  DC    16AL1(0)                                                 02496000
         ORG   SHAREFLG+17                                              02497000
SWITCHE  DC    AL1(0)                                                   02498000
         ORG   SWITCHE                                                  02499000
SWITCH1  DS    BL1                                                      02500000
SWITCH2  EQU   SWITCHE+0                                                02501000
SWITCH3  EQU   SWITCHE+0                                                02502000
SWITCH4  EQU   SWITCHE+0                                                02503000
         ORG   SWITCHE+1                                                02504000
TRIPLE   DC    X'1B'                                                    02505000
UKNO     DC    CL4'UKNO'                                                02506000
TOTLABLE DC    CL6'TOTALS'                                              02507000
TOTCT    DC    CL13'TOTAL RECORDS'                                      02508000
BUG22MSG DC    CL16'COUNT/BREAKPOINT'                                   02509000
HEAD20   DS    CL135                                                    02510000
         ORG   HEAD20                                                   02511000
@NM00025 DC    CL12' '                                                  02512000
@NM00026 DC    CL13'PERM  TEMP   '                                      02513000
@NM00027 DC    11CL10'PERM TEMP '                                       02514000
         ORG   HEAD20+135                                               02515000
BUGHEAD  DS    CL16                                                     02516000
         ORG   BUGHEAD                                                  02517000
@NM00028 DC    CL16'    DEBUG COUNTS'                                   02518000
         ORG   BUGHEAD+16                                               02519000
HEAD2    DC    CL132' '                                                 02520000
         ORG   HEAD2                                                    02521000
@NM00031 DC    CL15' '                                                  02522000
@NM00032 DC    CL5'TOTAL'                                               02523000
@NM00033 DC    CL2'  '                                                  02524000
@NM00034 DC    CL10'     CPU-A'                                         02525000
         DC    CL10'     CPU-B'                                         02526000
         DC    CL10'     CPU-C'                                         02527000
         DC    CL10'     CPU-D'                                         02528000
         DC    CL10'     CPU-E'                                         02529000
         DC    CL10'     CPU-F'                                         02530000
         DC    CL10'     CPU-G'                                         02531000
         DC    CL10'     CPU-H'                                         02532000
         DC    CL10'     CPU-I'                                         02533000
         DC    CL10'     CPU-J'                                         02534000
         DS    1XL10                                                    02535000
         ORG   HEAD2+132                                                02536000
DBUGCT1  DS    CL34                                                     02537000
         ORG   DBUGCT1                                                  02538000
@NM00035 DC    CL11'CPU COUNTS '                                        02539000
@NM00036 DC    CL11'AS PRIMARY '                                        02540000
@NM00037 DC    CL12'AS SECONDARY'                                       02541000
         ORG   DBUGCT1+34                                               02542000
TOTALS   DS    CL22                                                     02543000
         ORG   TOTALS                                                   02544000
TOTALCT  DC    CL6'      '                                              02545000
@NM00038 DC    CL16'  OVER ALL COUNT'                                   02546000
         ORG   TOTALS+22                                                02547000
GROUPCT  DS    CL32                                                     02548000
         ORG   GROUPCT                                                  02549000
GROUPNUM DC    CL6'      '                                              02550000
@NM00039 DC    CL2'  '                                                  02551000
@NM00040 DC    CL14'ITEMS IN GROUP'                                     02552000
@NM00041 DC    CL2'  '                                                  02553000
GPNAME   DC    CL8'        '                                            02554000
         ORG   GROUPCT+32                                               02555000
SAVEDEV  DC    X'0000'                                                  02556000
         DS    CL4                                                      02557000
DBLWORD  DS    CL8                                                      02558000
SUPERZAP DC    3CL10'SUPERZAP'                                          02559000
DISCRIPT DC    CL17'IPL              '                                  02560000
         DC    CL17'MACHINE CHECK    '                                  02561000
         DC    CL17'  RECOVERABLE    '                                  02562000
         DC    CL17'  NON-RECOVERABLE'                                  02563000
         DC    CL17'CHANNEL CHECK    '                                  02564000
         DC    CL17'  CHANNEL 0      '                                  02565000
         DC    CL17'  CHANNEL 1      '                                  02566000
         DC    CL17'  CHANNEL 2      '                                  02567000
         DC    CL17'  CHANNEL 3      '                                  02568000
         DC    CL17'  CHANNEL 4      '                                  02569000
         DC    CL17'  CHANNEL 5      '                                  02570000
         DC    CL17'  CHANNEL 6      '                                  02571000
         DC    CL17'  CHANNEL 7      '                                  02572000
         DC    CL17'  CHANNEL 8      '                                  02573000
         DC    CL17'  CHANNEL 9      '                                  02574000
         DC    CL17'  CHANNEL A      '                                  02575000
         DC    CL17'  CHANNEL B      '                                  02576000
         DC    CL17'  CHANNEL C      '                                  02577000
         DC    CL17'  CHANNEL D      '                                  02578000
         DC    CL17'  CHANNEL E      '                                  02579000
         DC    CL17'  CHANNEL F      '                                  02580000
         DC    CL17'PROGRAM ERROR    '                                  02581000
         DC    CL17' PRGM INT        '                                  02582000
         DC    CL17' ABEND           '                                  02583000
         DC    CL17' RESTART         '                                  02584000
         DC    CL17'END OF DAY       '                                  02585000
DEVGROUP DC    CL8'CONS +UR'                                            02586000
         DC    CL8'DASD    '                                            02587000
         DC    CL8'TAPE    '                                            02588000
         DC    CL8'DISPLAY '                                            02589000
         DC    CL8'TP CNTRL'                                            02590000
         DC    CL8'TERMINAL'                                            02591000
         DS    2XL8                                                     02592000
IS3705   DC    CL6'CNTRLR'                                              02593000
         DC    CL6'NCP   '                                              02594000
         DC    CL6'LINES '                                              02595000
         DS    CL2                                                      02596000
SYS2TEMP DC    16F'0'                                                   02597000
SYS2PERM DC    16F'0'                                                   02598000
NUMS     DC    16F'0'                                                   02599000
PATCH    DC    20F'0'                                                   02600000
DBUGCT   DC    16F'0'                                                   02601000
TOTALTMP DC    16F'0'                                                   02602000
TOTALPRM DC    17F'0'                                                   02603000
PRIMEYES DC    16F'0'                                                   02604000
PRIMENO  DC    16F'0'                                                   02605000
IFCSYSUM CSECT                                                          02606000
         DC    S(SUPERZAP)                                              02607000
IFCSYSUM CSECT                                                          02608000
    DC  S(PATCH)                                                        02609000
IFCSYSUM CSECT                                                          02610000
MVCINS  MVC   R0(R0,R6),0(R8)                                           02611000
IFCSYSUM CSECT                                                          02612000
MOVETOTL   MVC  R0(R0,R6),0(R8)                                         02613000
IFCSYSUM CSECT                                                          02614000
MOVEGRP  MVC   PRTLINE+11(0),PRTLINE+10                                 02615000
IFCSYSUM CSECT                                                          02616000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02617000
@01      EQU   01                                                       02618000
@02      EQU   02                                                       02619000
@03      EQU   03                                                       02620000
@04      EQU   04                                                       02621000
@05      EQU   05                                                       02622000
@06      EQU   06                                                       02623000
@07      EQU   07                                                       02624000
@08      EQU   08                                                       02625000
@09      EQU   09                                                       02626000
@10      EQU   10                                                       02627000
@11      EQU   11                                                       02628000
@12      EQU   12                                                       02629000
@13      EQU   13                                                       02630000
@14      EQU   14                                                       02631000
@15      EQU   15                                                       02632000
ADDRSAVE EQU   @03                                                      02633000
R10      EQU   @10                                                      02634000
R11      EQU   @11                                                      02635000
R12      EQU   @12                                                      02636000
R2       EQU   @02                                                      02637000
R6       EQU   @06                                                      02638000
R8       EQU   @08                                                      02639000
R9       EQU   @09                                                      02640000
R15      EQU   @15                                                      02641000
R0       EQU   @00                                                      02642000
R1       EQU   @01                                                      02643000
R13      EQU   @13                                                      02644000
R14      EQU   @14                                                      02645000
R3       EQU   @03                                                      02646000
R4       EQU   @04                                                      02647000
R5       EQU   @05                                                      02648000
R7       EQU   @07                                                      02649000
IOHND    EQU   0                                                        02650000
PARM     EQU   0                                                        02651000
RECTYPE  EQU   PARM                                                     02652000
SWITCHES EQU   PARM+2                                                   02653000
DEBUG    EQU   PARM+4                                                   02654000
DEBUG4   EQU   DEBUG                                                    02655000
DEBUG12  EQU   DEBUG+1                                                  02656000
DEBUG18  EQU   DEBUG+2                                                  02657000
DEBUG21  EQU   DEBUG+2                                                  02658000
DEBUG22  EQU   DEBUG+2                                                  02659000
DEBUGA   EQU   PARM+8                                                   02660000
MISC     EQU   PARM+12                                                  02661000
PRINTES  EQU   MISC                                                     02662000
OPENCLSE EQU   PARM+13                                                  02663000
OPENIO   EQU   OPENCLSE                                                 02664000
CLOSEIO  EQU   OPENCLSE+2                                               02665000
DATENOW  EQU   PARM+17                                                  02666000
STDT     EQU   PARM+23                                                  02667000
STDATE   EQU   STDT                                                     02668000
PSTD     EQU   STDATE+1                                                 02669000
ENDDT    EQU   PARM+31                                                  02670000
ENDDATE  EQU   ENDDT                                                    02671000
PEND     EQU   ENDDATE+1                                                02672000
STTIME1  EQU   PARM+39                                                  02673000
ENDTIME1 EQU   PARM+43                                                  02674000
STTIME2  EQU   PARM+47                                                  02675000
ENDTIME2 EQU   PARM+51                                                  02676000
STRTDATE EQU   PARM+55                                                  02677000
EVSYEAR  EQU   STRTDATE                                                 02678000
EVSDAY   EQU   STRTDATE+1                                               02679000
@NM00007 EQU   PARM+75                                                  02680000
SORTNUM  EQU   PARM+84                                                  02681000
ERRID    EQU   PARM+92                                                  02682000
IDTIMEA  EQU   ERRID+6                                                  02683000
IDTIME   EQU   IDTIMEA                                                  02684000
CCHHRLNG EQU   PARM+112                                                 02685000
LINECT   EQU   PARM+120                                                 02686000
ADIOHND  EQU   PARM+124                                                 02687000
ADIFCMSG EQU   PARM+128                                                 02688000
ADEDITB  EQU   PARM+132                                                 02689000
EVPTR    EQU   PARM+136                                                 02690000
SORTADR  EQU   PARM+140                                                 02691000
PRINTADR EQU   PARM+148                                                 02692000
CUAPTR   EQU   PARM+152                                                 02693000
DEVPTR   EQU   PARM+156                                                 02694000
MODPTR   EQU   PARM+160                                                 02695000
SERPTR   EQU   PARM+164                                                 02696000
VOLPTR   EQU   PARM+168                                                 02697000
CPUPTR   EQU   PARM+172                                                 02698000
CPCUAPTR EQU   PARM+176                                                 02699000
LIBADPTR EQU   PARM+180                                                 02700000
SYMCDPTR EQU   PARM+184                                                 02701000
SYSUMPTR EQU   PARM+188                                                 02702000
TRENPTR  EQU   PARM+192                                                 02703000
SHAREPTR EQU   PARM+196                                                 02704000
MERDCPTR EQU   PARM+208                                                 02705000
DUMPTABL EQU   PARM+228                                                 02706000
DUMPINFO EQU   DUMPTABL+4                                               02707000
TRENDONE EQU   0                                                        02708000
TREGEN   EQU   TRENDONE+8                                               02709000
TRECCH0  EQU   TREGEN+8                                                 02710000
TREND2   EQU   0                                                        02711000
TRENDKEY EQU   TREND2                                                   02712000
TRENDRT  EQU   TRENDKEY+1                                               02713000
TRENCPUS EQU   TRENDKEY+3                                               02714000
TRENDITM EQU   TRENDKEY+4                                               02715000
EVTABLE  EQU   0                                                        02716000
EVSTOP   EQU   EVTABLE                                                  02717000
EVYEAR   EQU   EVSTOP                                                   02718000
EVDAY    EQU   EVSTOP+1                                                 02719000
EVNUM    EQU   EVTABLE+4                                                02720000
EVKEY    EQU   EVTABLE+6                                                02721000
EVMODEL  EQU   EVKEY                                                    02722000
EVSERIAL EQU   EVKEY+2                                                  02723000
EVLETTER EQU   EVKEY+5                                                  02724000
SORTABLE EQU   0                                                        02725000
SORTKEY  EQU   SORTABLE                                                 02726000
SORTCCHR EQU   SORTABLE+5                                               02727000
SYSUMONE EQU   0                                                        02728000
SYSUMIPL EQU   SYSUMONE+4                                               02729000
SYSUMNXT EQU   SYSUMONE+8                                               02730000
SYSUMMCR EQU   SYSUMONE+12                                              02731000
SYSUMMCN EQU   SYSUMONE+16                                              02732000
SYSUMCH  EQU   SYSUMONE+20                                              02733000
SYSUMPEI EQU   SYSUMONE+84                                              02734000
SYSUMPEA EQU   SYSUMONE+88                                              02735000
SYSUMPER EQU   SYSUMONE+92                                              02736000
SYSUMEOD EQU   SYSUMONE+96                                              02737000
SYSUM2   EQU   0                                                        02738000
SYSUMKEY EQU   SYSUM2                                                   02739000
SYSGROUP EQU   SYSUMKEY                                                 02740000
SYSRT    EQU   SYSUMKEY+1                                               02741000
SYSCPUS  EQU   SYSUMKEY+3                                               02742000
SYSITEM  EQU   SYSUMKEY+4                                               02743000
SYSDEV   EQU   SYSUM2+5                                                 02744000
SYSPERM  EQU   SYSUM2+7                                                 02745000
SYSTEMP  EQU   SYSUM2+9                                                 02746000
SHARE    EQU   0                                                        02747000
SHAREIO  EQU   SHARE+2                                                  02748000
SHRCUCPU EQU   SHAREIO                                                  02749000
SHARECUA EQU   SHRCUCPU                                                 02750000
EDITLOAD EQU   0                                                        02751000
EDITABLE EQU   EDITLOAD+4                                               02752000
CUA      EQU   0                                                        02753000
CUAVAL   EQU   CUA+2                                                    02754000
DEVICE   EQU   0                                                        02755000
MODELS   EQU   0                                                        02756000
DEVSERAL EQU   0                                                        02757000
VOLUME   EQU   0                                                        02758000
CPUS     EQU   0                                                        02759000
CPUCUAS  EQU   0                                                        02760000
CPUCUAV  EQU   CPUCUAS+2                                                02761000
LIBADR   EQU   0                                                        02762000
SYMCODE  EQU   0                                                        02763000
SYMVAL   EQU   SYMCODE+2                                                02764000
MERIDIAN EQU   0                                                        02765000
NEXTBYTE EQU   0                                                        02766000
ADDNUM   EQU   0                                                        02767000
IFCMSG   EQU   0                                                        02768000
PRTOVER  EQU   PRTLINE                                                  02769000
DATAINFO EQU   PRTOVER                                                  02770000
TOTALHD  EQU   PRTOVER+20                                               02771000
TOTAL    EQU   TOTALHD                                                  02772000
MOVECPU  EQU   PRTLINE                                                  02773000
HEADMOVE EQU   PRTLINE                                                  02774000
CPULINE1 EQU   PRTLINE                                                  02775000
DEVGRP   EQU   PRTLINE                                                  02776000
CHANGE1  EQU   CHANGE                                                   02777000
DEVTYP   EQU   PRTLINE                                                  02778000
CUX      EQU   PRTLINE+5                                                02779000
AT3705   EQU   PRTLINE+3                                                02780000
WORKOVER EQU   WORK                                                     02781000
CPULETTR EQU   PRTLINE+2                                                02782000
NHEADL   EQU   PRTLINE                                                  02783000
TOTE2    EQU   NHEADL+14                                                02784000
ERRDATA  EQU   SYSUMPEI                                                 02785000
SHAREPT  EQU   TOTFLG                                                   02786000
TRECCH   EQU   TRECCH0                                                  02787000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02788000
TEMP2    EQU   TOTE2+5                                                  02789000
@NM00030 EQU   TOTE2+4                                                  02790000
PERM2    EQU   TOTE2                                                    02791000
@NM00029 EQU   NHEADL                                                   02792000
@NM00014 EQU   TOTALHD+13                                               02793000
CPUA     EQU   TOTALHD+8                                                02794000
@NM00013 EQU   TOTALHD+5                                                02795000
@NM00012 EQU   PRTOVER+17                                               02796000
MODEL    EQU   MERIDIAN+2                                               02797000
MRDNUMBR EQU   MERIDIAN                                                 02798000
SYMVAL2  EQU   SYMVAL+2                                                 02799000
SYMVAL1  EQU   SYMVAL                                                   02800000
SYMCDNUM EQU   SYMCODE                                                  02801000
LIBVAL   EQU   LIBADR+2                                                 02802000
LIBADNUM EQU   LIBADR                                                   02803000
CPUCUX3  EQU   CPUCUAV+5                                                02804000
CPUCUX2  EQU   CPUCUAV+3                                                02805000
CPUCUX1  EQU   CPUCUAV                                                  02806000
CPCUANUM EQU   CPUCUAS                                                  02807000
CPUVAL   EQU   CPUS+2                                                   02808000
CPUNUM   EQU   CPUS                                                     02809000
VOLVAL   EQU   VOLUME+2                                                 02810000
VOLNUM   EQU   VOLUME                                                   02811000
SERVAL   EQU   DEVSERAL+2                                               02812000
SERNUM   EQU   DEVSERAL                                                 02813000
MODVAL   EQU   MODELS+2                                                 02814000
MODNUM   EQU   MODELS                                                   02815000
MDRVAL   EQU   DEVICE+204                                               02816000
MDRNUM   EQU   DEVICE+202                                               02817000
DEVVAL   EQU   DEVICE+2                                                 02818000
DEVNUM   EQU   DEVICE                                                   02819000
CUA2     EQU   CUAVAL+2                                                 02820000
CUA1     EQU   CUAVAL                                                   02821000
CUANUM   EQU   CUA                                                      02822000
LOADPTR  EQU   EDITABLE+8                                               02823000
LOADNAME EQU   EDITABLE                                                 02824000
EDITNUM  EQU   EDITLOAD                                                 02825000
SHARLET  EQU   SHAREIO+10                                               02826000
SHARSERB EQU   SHAREIO+7                                                02827000
SHARECUB EQU   SHAREIO+5                                                02828000
SHARSERA EQU   SHRCUCPU+2                                               02829000
SHAREDX  EQU   SHARECUA                                                 02830000
SHARENUM EQU   SHARE                                                    02831000
SYSOLDA  EQU   SYSITEM                                                  02832000
SYS3705  EQU   SYSITEM                                                  02833000
SYSOLD   EQU   SYSCPUS                                                  02834000
SYSCPU   EQU   SYSCPUS                                                  02835000
SYSCUA   EQU   SYSRT                                                    02836000
SYSUMNUM EQU   SYSUMONE                                                 02837000
SORTCORE EQU   SORTCCHR                                                 02838000
SORTTIME EQU   SORTKEY+1                                                02839000
SORTYEAR EQU   SORTKEY                                                  02840000
TRETMP   EQU   TREND2+10                                                02841000
TREPRM   EQU   TREND2+8                                                 02842000
TRENDDEV EQU   TREND2+6                                                 02843000
TRENDDAT EQU   TRENDKEY+5                                               02844000
TRENDOD  EQU   TRENDITM                                                 02845000
TREND037 EQU   TRENDITM                                                 02846000
TRENDOLD EQU   TRENCPUS                                                 02847000
TRENDCPU EQU   TRENCPUS                                                 02848000
@NM00011 EQU   TRENDRT+1                                                02849000
TRENDCUA EQU   TRENDRT                                                  02850000
TRENDGRP EQU   TRENDKEY                                                 02851000
TREPRE   EQU   TREGEN+72                                                02852000
TRECCHF  EQU   TREGEN+68                                                02853000
TRECCHE  EQU   TREGEN+64                                                02854000
TRECCHD  EQU   TREGEN+60                                                02855000
TRECCHC  EQU   TREGEN+56                                                02856000
TRECCHB  EQU   TREGEN+52                                                02857000
TRECCHA  EQU   TREGEN+48                                                02858000
TRECCH9  EQU   TREGEN+44                                                02859000
TRECCH8  EQU   TREGEN+40                                                02860000
TRECCH7  EQU   TREGEN+36                                                02861000
TRECCH6  EQU   TREGEN+32                                                02862000
TRECCH5  EQU   TREGEN+28                                                02863000
TRECCH4  EQU   TREGEN+24                                                02864000
TRECCH3  EQU   TREGEN+20                                                02865000
TRECCH2  EQU   TREGEN+16                                                02866000
TRECCH1  EQU   TREGEN+12                                                02867000
TREMCH   EQU   TREGEN+4                                                 02868000
TREIPL   EQU   TREGEN                                                   02869000
TRENUM   EQU   TRENDONE+4                                               02870000
TRENEXT  EQU   TRENDONE                                                 02871000
DUMPSIZE EQU   DUMPINFO+4                                               02872000
DUMPADR  EQU   DUMPINFO                                                 02873000
DUMPNUM  EQU   DUMPTABL                                                 02874000
@NM00010 EQU   PARM+212                                                 02875000
RECLNGT1 EQU   PARM+204                                                 02876000
FRAMEPTR EQU   PARM+200                                                 02877000
ADCPUT   EQU   PARM+144                                                 02878000
RECLNGTH EQU   CCHHRLNG+6                                               02879000
@NM00009 EQU   CCHHRLNG+5                                               02880000
RECCCHHR EQU   CCHHRLNG                                                 02881000
USERPGM  EQU   PARM+102                                                 02882000
IDTSEC   EQU   IDTIME+3                                                 02883000
IDSEC    EQU   IDTIME+2                                                 02884000
IDMIN    EQU   IDTIME+1                                                 02885000
IDHOUR   EQU   IDTIME                                                   02886000
IDASID   EQU   ERRID+4                                                  02887000
IDCPU    EQU   ERRID+3                                                  02888000
@NM00008 EQU   ERRID+2                                                  02889000
IDVALUE  EQU   ERRID                                                    02890000
NUMDAYS  EQU   PARM+88                                                  02891000
TABSIZE  EQU   PARM+80                                                  02892000
SYSRETRN EQU   @NM00007                                                 02893000
@NM00006 EQU   PARM+72                                                  02894000
WRTHRSH  EQU   PARM+69                                                  02895000
RDTHRSH  EQU   PARM+66                                                  02896000
TERM     EQU   PARM+58                                                  02897000
PENSEC2  EQU   ENDTIME2+2                                               02898000
PENMIN2  EQU   ENDTIME2+1                                               02899000
PENHOUR2 EQU   ENDTIME2                                                 02900000
PSTSEC2  EQU   STTIME2+2                                                02901000
PSTMIN2  EQU   STTIME2+1                                                02902000
PSTHOUR2 EQU   STTIME2                                                  02903000
PENSEC1  EQU   ENDTIME1+2                                               02904000
PENMIN1  EQU   ENDTIME1+1                                               02905000
PENHOUR1 EQU   ENDTIME1                                                 02906000
PSTSEC1  EQU   STTIME1+2                                                02907000
PSTMIN1  EQU   STTIME1+1                                                02908000
PSTHOUR1 EQU   STTIME1                                                  02909000
@NM00005 EQU   ENDDT+4                                                  02910000
PENDY    EQU   PEND+1                                                   02911000
PENYR    EQU   PEND                                                     02912000
@NM00004 EQU   ENDDATE                                                  02913000
@NM00003 EQU   STDT+4                                                   02914000
PSTDY    EQU   PSTD+1                                                   02915000
PSTYR    EQU   PSTD                                                     02916000
@NM00002 EQU   STDATE                                                   02917000
YEARNOW  EQU   DATENOW+4                                                02918000
@NM00001 EQU   DATENOW+3                                                02919000
DAYNOW   EQU   DATENOW                                                  02920000
CSNAP    EQU   CLOSEIO                                                  02921000
CDRCTWRK EQU   CLOSEIO                                                  02922000
CSYSIN   EQU   CLOSEIO                                                  02923000
CACCDEV  EQU   CLOSEIO                                                  02924000
CACCIN   EQU   CLOSEIO                                                  02925000
CSERLOG  EQU   CLOSEIO                                                  02926000
CEREPPT  EQU   CLOSEIO                                                  02927000
CTOURIST EQU   CLOSEIO                                                  02928000
OSNAP    EQU   OPENIO                                                   02929000
ODRCTWRK EQU   OPENIO                                                   02930000
OSYSIN   EQU   OPENIO                                                   02931000
OACCDEV  EQU   OPENIO                                                   02932000
OACCIN   EQU   OPENIO                                                   02933000
OSERLOG  EQU   OPENIO                                                   02934000
OEREPPT  EQU   OPENIO                                                   02935000
OTOURIST EQU   OPENIO                                                   02936000
PASSFLAG EQU   MISC                                                     02937000
PLOGREC  EQU   MISC                                                     02938000
ERRORID  EQU   MISC                                                     02939000
PSUM     EQU   PRINTES                                                  02940000
PEDIT    EQU   PRINTES                                                  02941000
PHIST    EQU   MISC                                                     02942000
PACC     EQU   MISC                                                     02943000
PZERO    EQU   MISC                                                     02944000
DEBUG63  EQU   DEBUGA+3                                                 02945000
DEBUG62  EQU   DEBUGA+3                                                 02946000
DEBUG61  EQU   DEBUGA+3                                                 02947000
DEBUG60  EQU   DEBUGA+3                                                 02948000
DEBUG59  EQU   DEBUGA+3                                                 02949000
DEBUG58  EQU   DEBUGA+3                                                 02950000
DEBUG57  EQU   DEBUGA+3                                                 02951000
DEBUG56  EQU   DEBUGA+3                                                 02952000
DEBUG55  EQU   DEBUGA+2                                                 02953000
DEBUG54  EQU   DEBUGA+2                                                 02954000
DEBUG53  EQU   DEBUGA+2                                                 02955000
DEBUG52  EQU   DEBUGA+2                                                 02956000
DEBUG51  EQU   DEBUGA+2                                                 02957000
DEBUG50  EQU   DEBUGA+2                                                 02958000
DEBUG49  EQU   DEBUGA+2                                                 02959000
DEBUG48  EQU   DEBUGA+2                                                 02960000
DEBUG47  EQU   DEBUGA+1                                                 02961000
DEBUG46  EQU   DEBUGA+1                                                 02962000
DEBUG45  EQU   DEBUGA+1                                                 02963000
DEBUG44  EQU   DEBUGA+1                                                 02964000
DEBUG43  EQU   DEBUGA+1                                                 02965000
DEBUG42  EQU   DEBUGA+1                                                 02966000
DEBUG41  EQU   DEBUGA+1                                                 02967000
DEBUG40  EQU   DEBUGA+1                                                 02968000
DEBUG39  EQU   DEBUGA                                                   02969000
DEBUG38  EQU   DEBUGA                                                   02970000
DEBUG37  EQU   DEBUGA                                                   02971000
DEBUG36  EQU   DEBUGA                                                   02972000
DEBUG35  EQU   DEBUGA                                                   02973000
DEBUG34  EQU   DEBUGA                                                   02974000
DEBUG33  EQU   DEBUGA                                                   02975000
DEBUG32  EQU   DEBUGA                                                   02976000
DEBUG31  EQU   DEBUG+3                                                  02977000
DEBUG30  EQU   DEBUG+3                                                  02978000
DEBUG29  EQU   DEBUG+3                                                  02979000
DEBUG28  EQU   DEBUG+3                                                  02980000
DEBUG27  EQU   DEBUG+3                                                  02981000
DEBUG26  EQU   DEBUG+3                                                  02982000
DEBUG25  EQU   DEBUG+3                                                  02983000
DEBUG24  EQU   DEBUG+3                                                  02984000
DEBUG23  EQU   DEBUG+2                                                  02985000
DEBUG20  EQU   DEBUG+2                                                  02986000
DEBUG19  EQU   DEBUG+2                                                  02987000
DEBUG17  EQU   DEBUG+2                                                  02988000
DEBUG16  EQU   DEBUG+2                                                  02989000
DEBUG15  EQU   DEBUG+1                                                  02990000
DEBUG14  EQU   DEBUG+1                                                  02991000
DEBUG13  EQU   DEBUG+1                                                  02992000
DEBUG11  EQU   DEBUG+1                                                  02993000
DEBUG10  EQU   DEBUG+1                                                  02994000
DEBUG9   EQU   DEBUG+1                                                  02995000
DEBUG8   EQU   DEBUG+1                                                  02996000
DEBUG7   EQU   DEBUG                                                    02997000
DEBUG6   EQU   DEBUG                                                    02998000
DEBUG5   EQU   DEBUG                                                    02999000
DEBUG3   EQU   DEBUG                                                    03000000
DEBUG2   EQU   DEBUG                                                    03001000
DEBUG1   EQU   DEBUG                                                    03002000
DEBUG0   EQU   DEBUG                                                    03003000
SORTBRK  EQU   SWITCHES+1                                               03004000
COREFAIL EQU   SWITCHES+1                                               03005000
ANALYSIS EQU   SWITCHES+1                                               03006000
SHIFT3RD EQU   SWITCHES+1                                               03007000
DEVEXCL  EQU   SWITCHES+1                                               03008000
ZEROALL  EQU   SWITCHES+1                                               03009000
NOTALL   EQU   SWITCHES+1                                               03010000
NOSDR    EQU   SWITCHES                                                 03011000
TIMESEQ  EQU   SWITCHES                                                 03012000
SYSUM    EQU   SWITCHES                                                 03013000
PARMTHR  EQU   SWITCHES                                                 03014000
TREND    EQU   SWITCHES                                                 03015000
SHORTOBR EQU   SWITCHES                                                 03016000
PARMMES  EQU   SWITCHES                                                 03017000
RDESUM   EQU   SWITCHES                                                 03018000
PCCHFRAM EQU   RECTYPE+1                                                03019000
PMCHFRAM EQU   RECTYPE+1                                                03020000
PTTYP    EQU   RECTYPE+1                                                03021000
PEOD     EQU   RECTYPE                                                  03022000
PMIH     EQU   RECTYPE                                                  03023000
PDDR     EQU   RECTYPE                                                  03024000
PIPL     EQU   RECTYPE                                                  03025000
PSOFT    EQU   RECTYPE                                                  03026000
POBR     EQU   RECTYPE                                                  03027000
PCHAN    EQU   RECTYPE                                                  03028000
PMCH     EQU   RECTYPE                                                  03029000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03030000
@RF00234 EQU   @EL00005                                                 03031000
@RF00461 EQU   @EL00014                                                 03032000
@RF00584 EQU   @EL00018                                                 03033000
@RF00615 EQU   @EL00020                                                 03034000
@RF00622 EQU   @EL00020                                                 03035000
@RF00704 EQU   @EL00024                                                 03036000
@PB00024 EQU   @PB00025                                                 03037000
@RF00761 EQU   @EL00001                                                 03038000
@PB00023 EQU   @PB00024                                                 03039000
@PB00022 EQU   @PB00023                                                 03040000
@PB00021 EQU   @PB00022                                                 03041000
@PB00020 EQU   @PB00021                                                 03042000
@PB00019 EQU   @PB00020                                                 03043000
@PB00018 EQU   @PB00019                                                 03044000
@PB00017 EQU   @PB00018                                                 03045000
@PB00016 EQU   @PB00017                                                 03046000
@PB00015 EQU   @PB00016                                                 03047000
@PB00014 EQU   @PB00015                                                 03048000
@PB00013 EQU   @PB00014                                                 03049000
@PB00012 EQU   @PB00013                                                 03050000
@PB00011 EQU   @PB00012                                                 03051000
@PB00010 EQU   @PB00011                                                 03052000
@PB00009 EQU   @PB00010                                                 03053000
@PB00008 EQU   @PB00009                                                 03054000
@PB00007 EQU   @PB00008                                                 03055000
@PB00006 EQU   @PB00007                                                 03056000
@PB00005 EQU   @PB00006                                                 03057000
@PB00004 EQU   @PB00005                                                 03058000
@PB00003 EQU   @PB00004                                                 03059000
@PB00002 EQU   @PB00003                                                 03060000
@ENDDATA EQU   *                                                        03061000
         END   IFCSYSUM                                                 03062000
