         TITLE 'IGCFK10D - REDRIVE PROCESSOR                           *00001000
                        '                                               00002000
IGCFK10D CSECT ,                                                01S0001 00003000
@PROLOG  BALR  @12,0                                            01S0001 00004000
@PSTART  DS    0H                                               01S0001 00005000
         USING @PSTART,@12                                      01S0001 00006000
*                                   /*                                  00007000
IGCFK10D IEDHJN AFTERHJN,HJN                                            00008000
*                                                               01S0295 00009000
*   /*****************************************************************/ 00010000
*   /*                                                               */ 00011000
*   /* INITIALIZATION                                                */ 00012000
*   /*                                                               */ 00013000
*   /*****************************************************************/ 00014000
*                                                               01S0295 00015000
*   ROPCAVT=RPARM;                  /* SET POINTER TO OP. CTL. AVT   */ 00016000
         LR    ROPCAVT,RPARM                                    01S0295 00017000
*   RAVT=OPCAVTPT;                  /* SET POINTER TO TCAM AVT       */ 00018000
         L     RAVT,OPCAVTPT(,ROPCAVT)                          01S0296 00019000
*   RSAVE=ADDR(OPCSAVE);            /* SET POINTER TO SAVE AREA      */ 00020000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          01S0297 00021000
*                                                               01S0298 00022000
*   /*****************************************************************/ 00023000
*   /*                                                               */ 00024000
*   /* CALCULATE 50% OF TCAM'S LINE UNITS                            */ 00025000
*   /*                                                               */ 00026000
*   /*****************************************************************/ 00027000
*                                                               01S0298 00028000
*   RUNITLVL=AVTNOLBF;              /* # OF TCAM LINE UNITS          */ 00029000
         LH    RUNITLVL,AVTNOLBF(,RAVT)                         01S0298 00030000
*   SRL(RUNITLVL,1);                /* DIVIDE BY TWO FOR 50%         */ 00031000
         SRL   RUNITLVL,1                                       01S0299 00032000
*   REQPRI=FREEREDR;                /* FREE REDRIVE ELEMENT          */ 00033000
         L     @09,OPCCOPCE(,ROPCAVT)                           01S0300 00034000
         MVI   REQPRI(@09),X'00'                                01S0300 00035000
*   IF OPCADGOT>=RUNITLVL THEN      /* IF # BUFFER UNITS A/D USING IS   00036000
*                                      GT OR E TO 1/2 TCAM'S LINE       00037000
*                                      UNITS                         */ 00038000
         LH    @09,OPCADGOT(,ROPCAVT)                           01S0301 00039000
         N     @09,@CF01487                                     01S0301 00040000
         CR    RUNITLVL,@09                                     01S0301 00041000
         BH    @RF00301                                         01S0301 00042000
*     OPCMODID=TO00;                /* SET TO XCTL TO IGC0010D       */ 00043000
         MVC   OPCMODID(2,ROPCAVT),TO00                         01S0302 00044000
*   ELSE                                                        01S0303 00045000
*     DO;                                                       01S0303 00046000
*                                                               01S0303 00047000
         B     @RC00301                                         01S0303 00048000
@RF00301 DS    0H                                               01S0304 00049000
*       /*************************************************************/ 00050000
*       /*                                                           */ 00051000
*       /* OBTAIN LAST OPCE ON A/D BUFFER UNIT WAIT CHAIN            */ 00052000
*       /*                                                           */ 00053000
*       /*************************************************************/ 00054000
*                                                               01S0304 00055000
*/* NOTE: THERE IS ALWAYS AT LEAST 1 OPCE ON CHAIN IF THIS ROUTINE   */ 00056000
*/*       IS CALLED                                                  */ 00057000
*                                                               01S0304 00058000
*       ROPCE=ADDR(OPCBUFWT)-(ADDR(OCLINK)-ADDR(IEDQOPCE));/* INIT.     00059000
*                                      OPCE POINTER SO THAT OCLINK      00060000
*                                      FIELD OF OPCE DSECT OVERLAYS     00061000
*                                      OPCBUFWT - THE WAIT CHAIN        00062000
*                                      ANCHOR                @YM08487*/ 00063000
         LA    @09,OPCBUFWT(,ROPCAVT)                           01S0304 00064000
         LR    @15,ROPCE                                        01S0304 00065000
         SLR   @15,ROPCE                                        01S0304 00066000
         SLR   @09,@15                                          01S0304 00067000
         LR    ROPCE,@09                                        01S0304 00068000
*       DO UNTIL(OCLINK=0);                                     01S0305 00069000
@DL00305 DS    0H                                               01S0306 00070000
*         RNXTLAST=ROPCE;           /* SET PTR. FOR NEXT TO LAST OPCE*/ 00071000
         LR    RNXTLAST,ROPCE                                   01S0306 00072000
*         ROPCE=OCLINK;             /* SET OPCE PTR. TO NEXT OPCE    */ 00073000
         L     ROPCE,OCLINK(,ROPCE)                             01S0307 00074000
*       END;                                                    01S0308 00075000
@DE00305 L     @09,OCLINK(,ROPCE)                               01S0308 00076000
         LTR   @09,@09                                          01S0308 00077000
         BNZ   @DL00305                                         01S0308 00078000
*                                                               02S0309 00079000
*       /*************************************************************/ 00080000
*       /*                                                           */ 00081000
*       /* OBTAIN AS MANY BUFFER UNITS AS THE OPCE NEEDS UP TO 50% OF*/ 00082000
*       /* TCAM'S UNITS. CHAIN THEM OFF OCUNIT FIELD OF THE REDRIVE  */ 00083000
*       /* OPCE.                                                     */ 00084000
*       /*                                                           */ 00085000
*       /*************************************************************/ 00086000
*                                                               02S0309 00087000
*       RFY                                                     02S0309 00088000
*         RZERO RSTD;               /* PARM. FOR ALLOCBUF            */ 00089000
*       RUNITPTR=ADDR(OCUNIT)-EVAL(ADDR(PRFTIC)-ADDR(IEDQPRF));/* SET   00090000
*                                      UNIT PTR. TO POINT INTO OPCE     00091000
*                                      SO THAT THE PRFTIC FIELD OF      00092000
*                                      THE PREFIX DSECT OVERLAYS        00093000
*                                      OCUNIT                        */ 00094000
         LA    @09,OCUNIT(,ROPCE)                               02S0310 00095000
         SL    @09,@CF00045                                     02S0310 00096000
         LR    RUNITPTR,@09                                     02S0310 00097000
*       IF OPCADGOT+OCBUFNED>RUNITLVL THEN/* IF TOTAL OF UNITS A/D      00098000
*                                      HAS AND UNITS NEEDED EXCEEDS     00099000
*                                      THE 50% LEVEL                 */ 00100000
         LH    @09,OPCADGOT(,ROPCAVT)                           02S0311 00101000
         N     @09,@CF01487                                     02S0311 00102000
         LH    @15,OCBUFNED(,ROPCE)                             02S0311 00103000
         N     @15,@CF01487                                     02S0311 00104000
         ALR   @15,@09                                          02S0311 00105000
         CR    @15,RUNITLVL                                     02S0311 00106000
         BNH   @RF00311                                         02S0311 00107000
*         RUNITGET=RUNITLVL-OPCADGOT;/* GET UNITS UP TO 50% LEVEL    */ 00108000
         LCR   @09,@09                                          02S0312 00109000
         ALR   @09,RUNITLVL                                     02S0312 00110000
         LR    RUNITGET,@09                                     02S0312 00111000
*       ELSE                                                    02S0313 00112000
*         RUNITGET=OCBUFNED;        /* GET AS MANY UNITS AS NEEDED   */ 00113000
         B     @RC00311                                         02S0313 00114000
@RF00311 LH    RUNITGET,OCBUFNED(,ROPCE)                        02S0313 00115000
         N     RUNITGET,@CF01487                                02S0313 00116000
*       DO UNTIL(RUNITGET=0);       /* GO TO ALLOCBUF AS MANY TIMES     00117000
*                                      AS NECESSAY TO OBTAIN UNITS   */ 00118000
@RC00311 DS    0H                                               02S0314 00119000
@DL00314 DS    0H                                               02S0315 00120000
*         IF RUNITGET>MAXUNTGT THEN /* IF FK IS TO GET MORE THAN THE    00121000
*                                      # OF UNITS ALLOCBUF CAN GIVE     00122000
*                                      PER CALL                      */ 00123000
         LA    @09,255                                          02S0315 00124000
         CR    RUNITGET,@09                                     02S0315 00125000
         BNH   @RF00315                                         02S0315 00126000
*           RPARM=MAXUNTGT;         /* GET THE MAXIMUM               */ 00127000
         LR    RPARM,@09                                        02S0316 00128000
*         ELSE                                                  02S0317 00129000
*           RPARM=RUNITGET;         /* GET # TO GET                  */ 00130000
         B     @RC00315                                         02S0317 00131000
@RF00315 LR    RPARM,RUNITGET                                   02S0317 00132000
*         CALL ALLOCBUF;            /* GET BUFFER UNITS              */ 00133000
*                                                               02S0318 00134000
@RC00315 L     @15,OPCGETBF(,ROPCAVT)                           02S0318 00135000
         BALR  @14,@15                                          02S0318 00136000
*         /***********************************************************/ 00137000
*         /*                                                         */ 00138000
*         /* LINK UNITS JUST GOTTEN OFF OF OCUNIT AT END OF CURRENT  */ 00139000
*         /* CHAIN OF BUFFERS                                        */ 00140000
*         /*                                                         */ 00141000
*         /***********************************************************/ 00142000
*                                                               02S0319 00143000
*         DO WHILE(TIC=VALTIC);     /* LOOP TO FIND END OF CURRENT      00144000
*                                      CHAIN                 @YM05731*/ 00145000
         B     @DE00319                                         02S0319 00146000
@DL00319 DS    0H                                               02S0320 00147000
*           RUNITPTR=PRFTI0;        /* POINT TO NEXT UNIT            */ 00148000
         L     @09,PRFTI0-1(,RUNITPTR)                          02S0320 00149000
         LA    @09,0(,@09)                                      02S0320 00150000
         LR    RUNITPTR,@09                                     02S0320 00151000
*         END;                                                  02S0321 00152000
@DE00319 TM    TIC(RUNITPTR),B'00000011'                        02S0321 00153000
         BZ    @DL00319                                         02S0321 00154000
*         PRFTI0=RPARM;             /* POINT TO UNITS JUST GOTTEN    */ 00155000
         STCM  RPARM,7,PRFTI0(RUNITPTR)                         02S0322 00156000
*         RUNITGET=RUNITGET-RZERO;  /* UPDATE # OF UNITS TO GET      */ 00157000
         SLR   RUNITGET,RZERO                                   02S0323 00158000
*         OCBUFNED=OCBUFNED-RZERO;  /* UPDATE # OF UNITS OPCE NEEDS  */ 00159000
         LH    @09,OCBUFNED(,ROPCE)                             02S0324 00160000
         N     @09,@CF01487                                     02S0324 00161000
         SLR   @09,RZERO                                        02S0324 00162000
         STH   @09,OCBUFNED(,ROPCE)                             02S0324 00163000
*         OCBUFGOT=OCBUFGOT+RZERO;  /* UPDATE # OF UNITS OPCE HAS    */ 00164000
         LH    @09,OCBUFGOT(,ROPCE)                             02S0325 00165000
         N     @09,@CF01487                                     02S0325 00166000
         ALR   @09,RZERO                                        02S0325 00167000
         STH   @09,OCBUFGOT(,ROPCE)                             02S0325 00168000
*         OPCADGOT=OPCADGOT+RZERO;  /* UPDATE # OF UNITS A/D HAS     */ 00169000
         LH    @09,OPCADGOT(,ROPCAVT)                           02S0326 00170000
         N     @09,@CF01487                                     02S0326 00171000
         ALR   @09,RZERO                                        02S0326 00172000
         STH   @09,OPCADGOT(,ROPCAVT)                           02S0326 00173000
*       END;                                                    02S0327 00174000
@DE00314 SLR   @09,@09                                          02S0327 00175000
         CR    RUNITGET,@09                                     02S0327 00176000
         BNE   @DL00314                                         02S0327 00177000
*       RFY                                                     02S0328 00178000
*         RZERO UNRSTD;                                         02S0328 00179000
*       RNXTLAST->OCLINK=0;         /* DELINK LAST OPCE              */ 00180000
         ST    @09,OCLINK(,RNXTLAST)                            01S0329 00181000
*       OPCCOPCE=ROPCE;             /* AND SPECIFY AS CURRENT OPCE   */ 00182000
         ST    ROPCE,OPCCOPCE(,ROPCAVT)                         01S0330 00183000
*       OPCMODID=OCWTG;             /* SET TO XCTL TO OCWTG MODULE   */ 00184000
         MVC   OPCMODID(2,ROPCAVT),OCWTG(ROPCE)                 01S0331 00185000
*       OCWTG=''B;                  /* CLEAR FOR SUBSEQUENT USE      */ 00186000
         XC    OCWTG(2,ROPCE),OCWTG(ROPCE)                      01S0332 00187000
*     END;                                                      01S0333 00188000
*                                                               01S0333 00189000
*   /*****************************************************************/ 00190000
*   /*                                                               */ 00191000
*   /* XCTL LINKAGE                                                  */ 00192000
*   /*                                                               */ 00193000
*   /*****************************************************************/ 00194000
*                                                               01S0334 00195000
*   RPARM=ROPCAVT;                  /* SET OP. CTL. AVT AS PARM.     */ 00196000
@RC00301 LR    RPARM,ROPCAVT                                    01S0334 00197000
*   GEN EXIT REFS(ROPCAVT,OPCXCTL);                             01S0335 00198000
         XCTL  SF=(E,OPCXCTL(ROPCAVT))                                  00199000
*   END IGCFK10D                                                01S0336 00200000
*                                                               01S0336 00201000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00202000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00203000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00204000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00205000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 00206000
*/*%INCLUDE SYSLIB  (TREQD   )                                       */ 00207000
*/*%INCLUDE SYSUT5  (GETUNITS)                                       */ 00208000
*                                                               01S0336 00209000
*       ;                                                       01S0336 00210000
@DATA    DS    0H                                                       00211000
@DATD    DSECT                                                          00212000
         DS    0F                                                       00213000
IGCFK10D CSECT                                                          00214000
         DS    0F                                                       00215000
@CF00045 DC    F'8'                                                     00216000
@CF01487 DC    XL4'0000FFFF'                                            00217000
@DATD    DSECT                                                          00218000
         DS    0D                                                       00219000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00220000
@ENDDATD EQU   *                                                        00221000
IGCFK10D CSECT                                                          00222000
         DS    0F                                                       00223000
@SIZDATD DC    AL1(0)                                                   00224000
         DC    AL3(@ENDDATD-@DATD)                                      00225000
         DS    0D                                                       00226000
TO00     DC    CL2'00'                                                  00227000
ADPATCH  DC    XL100'0'                                                 00228000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00229000
@01      EQU   01                                                       00230000
@02      EQU   02                                                       00231000
@03      EQU   03                                                       00232000
@04      EQU   04                                                       00233000
@05      EQU   05                                                       00234000
@06      EQU   06                                                       00235000
@07      EQU   07                                                       00236000
@08      EQU   08                                                       00237000
@09      EQU   09                                                       00238000
@10      EQU   10                                                       00239000
@11      EQU   11                                                       00240000
@12      EQU   12                                                       00241000
@13      EQU   13                                                       00242000
@14      EQU   14                                                       00243000
@15      EQU   15                                                       00244000
IEDQAPTR EQU   @04                                                      00245000
ROPCAVT  EQU   @02                                                      00246000
ROPCE    EQU   @03                                                      00247000
IEDQPPTR EQU   @06                                                      00248000
RZERO    EQU   @00                                                      00249000
RPARM    EQU   @01                                                      00250000
RAVT     EQU   @04                                                      00251000
RNXTLAST EQU   @05                                                      00252000
RUNITPTR EQU   @06                                                      00253000
RUNITLVL EQU   @07                                                      00254000
RUNITGET EQU   @08                                                      00255000
RSAVE    EQU   @13                                                      00256000
RRET     EQU   @14                                                      00257000
RBRNCH   EQU   @15                                                      00258000
IEDQAVTD EQU   0                                                        00259000
AVTSAVEX EQU   IEDQAVTD+288                                             00260000
@NM00003 EQU   IEDQAVTD+388                                             00261000
AVTCKFLG EQU   @NM00003                                                 00262000
AVTBASE  EQU   IEDQAVTD+412                                             00263000
AVTPKF   EQU   AVTBASE                                                  00264000
AVTNOLBF EQU   IEDQAVTD+454                                             00265000
AVTOSECB EQU   IEDQAVTD+492                                             00266000
AVTECB1  EQU   AVTOSECB                                                 00267000
AVTHG02  EQU   IEDQAVTD+528                                             00268000
AVTDISP  EQU   IEDQAVTD+552                                             00269000
AVTHD    EQU   IEDQAVTD+556                                             00270000
AVTSCOPT EQU   AVTHD                                                    00271000
AVTSAVTP EQU   IEDQAVTD+612                                             00272000
AVTSAVTF EQU   AVTSAVTP                                                 00273000
AVTCKPEL EQU   IEDQAVTD+652                                             00274000
AVTCKRMV EQU   AVTCKPEL                                                 00275000
AVTCKELF EQU   IEDQAVTD+680                                             00276000
AVTCKBYT EQU   IEDQAVTD+691                                             00277000
AVTHG01  EQU   IEDQAVTD+692                                             00278000
AVTCKLNK EQU   IEDQAVTD+696                                             00279000
AVTCRELE EQU   IEDQAVTD+708                                             00280000
AVTCCELE EQU   AVTCRELE                                                 00281000
AVTCLRHI EQU   IEDQAVTD+716                                             00282000
AVTADBUF EQU   IEDQAVTD+720                                             00283000
AVTSYSER EQU   IEDQAVTD+728                                             00284000
AVTBFRFG EQU   IEDQAVTD+784                                             00285000
AVTCKPQB EQU   IEDQAVTD+804                                             00286000
AVTCKPTB EQU   AVTCKPQB                                                 00287000
AVTCKPEC EQU   AVTCKPQB+4                                               00288000
AVTCKPCC EQU   AVTCKPEC                                                 00289000
AVTOPCQB EQU   IEDQAVTD+816                                             00290000
AVTOPCOB EQU   AVTOPCQB                                                 00291000
AVTOPCEC EQU   AVTOPCQB+4                                               00292000
AVTOPCCC EQU   AVTOPCEC                                                 00293000
AVTOLTQB EQU   IEDQAVTD+828                                             00294000
AVTCWFL1 EQU   IEDQAVTD+924                                             00295000
AVTCWFL2 EQU   IEDQAVTD+925                                             00296000
AVTSUBT  EQU   IEDQAVTD+948                                             00297000
AVTIOTR  EQU   IEDQAVTD+949                                             00298000
AVTBIT1  EQU   IEDQAVTD+1050                                            00299000
AVTBIT2  EQU   IEDQAVTD+1051                                            00300000
AVTBIT3  EQU   IEDQAVTD+1052                                            00301000
AVTBIT4  EQU   IEDQAVTD+1136                                            00302000
@NM00085 EQU   IEDQAVTD+1232                                            00303000
IEDNSVTD EQU   0                                                        00304000
SAVTDIAG EQU   IEDNSVTD                                                 00305000
SAVTDIAF EQU   SAVTDIAG                                                 00306000
SAVTLUSQ EQU   IEDNSVTD+88                                              00307000
SAVTTCPU EQU   IEDNSVTD+238                                             00308000
SAVTZELM EQU   IEDNSVTD+270                                             00309000
SAVTRDRV EQU   IEDNSVTD+284                                             00310000
SAVTCKQB EQU   IEDNSVTD+300                                             00311000
SAVTCKTB EQU   SAVTCKQB                                                 00312000
SAVTCKEC EQU   SAVTCKQB+4                                               00313000
SAVTCKCC EQU   SAVTCKEC                                                 00314000
SAVTNETF EQU   IEDNSVTD+324                                             00315000
SAVTCDRV EQU   IEDNSVTD+332                                             00316000
IEDQOPCD EQU   0                                                        00317000
OPCAVTPT EQU   IEDQOPCD+8                                               00318000
OPCCOPCE EQU   IEDQOPCD+12                                              00319000
OPCSAVE  EQU   IEDQOPCD+56                                              00320000
OPCAQCTL EQU   IEDQOPCD+180                                             00321000
OPCXCTL  EQU   IEDQOPCD+204                                             00322000
OPCLDNME EQU   IEDQOPCD+212                                             00323000
OPCMODID EQU   OPCLDNME+3                                               00324000
OPCGETBF EQU   IEDQOPCD+276                                             00325000
OPCSPEC  EQU   IEDQOPCD+300                                             00326000
OPCADGOT EQU   IEDQOPCD+318                                             00327000
OPCBUFWT EQU   IEDQOPCD+348                                             00328000
OPCPWCOB EQU   IEDQOPCD+368                                             00329000
OPCPWQCB EQU   OPCPWCOB                                                 00330000
OPCPWECB EQU   OPCPWCOB+4                                               00331000
OPCSESS  EQU   IEDQOPCD+384                                             00332000
OPCPCID  EQU   IEDQOPCD+456                                             00333000
OPCUNIQP EQU   OPCPCID+2                                                00334000
OPCSESSF EQU   IEDQOPCD+464                                             00335000
OPCBLIN  EQU   OPCSESSF                                                 00336000
IEDQOPCE EQU   0                                                        00337000
OCLINK   EQU   IEDQOPCE                                                 00338000
OCELEM   EQU   IEDQOPCE+4                                               00339000
OCUNIT   EQU   IEDQOPCE+8                                               00340000
OCRUDEST EQU   OCUNIT                                                   00341000
OCCKPKEY EQU   OCRUDEST                                                 00342000
OCSCAN   EQU   OCCKPKEY                                                 00343000
@NM00125 EQU   OCRUDEST+1                                               00344000
OCUNITBF EQU   @NM00125+2                                               00345000
OCOPTCDE EQU   IEDQOPCE+12                                              00346000
OCSWITCH EQU   IEDQOPCE+13                                              00347000
OCFLAG   EQU   IEDQOPCE+14                                              00348000
OCCIB    EQU   IEDQOPCE+16                                              00349000
OCMSTSAV EQU   OCCIB                                                    00350000
OCDEST   EQU   OCMSTSAV                                                 00351000
OCLINENO EQU   IEDQOPCE+22                                              00352000
OCTIOT   EQU   OCLINENO                                                 00353000
OCWTGB   EQU   OCTIOT                                                   00354000
OCTRUNIT EQU   IEDQOPCE+24                                              00355000
OCRSID   EQU   OCTRUNIT                                                 00356000
OCALSTAT EQU   OCRSID                                                   00357000
OCPARM   EQU   IEDQOPCE+28                                              00358000
OCWTG    EQU   IEDQOPCE+30                                              00359000
OCBACKUP EQU   IEDQOPCE+32                                              00360000
OCBUFNED EQU   OCBACKUP                                                 00361000
OCBUFGOT EQU   OCBACKUP+2                                               00362000
OCMODNME EQU   IEDQOPCE+40                                              00363000
OCIPLWA  EQU   OCMODNME                                                 00364000
OCCKDATA EQU   IEDQOPCE+48                                              00365000
OCRSTGTM EQU   OCCKDATA                                                 00366000
OC379RRT EQU   OCRSTGTM                                                 00367000
IEDQOPCN EQU   0                                                        00368000
OCLDNME  EQU   IEDQOPCN                                                 00369000
OCLINTTE EQU   OCLDNME                                                  00370000
OCREQFLG EQU   OCLINTTE+2                                               00371000
OCPREFLG EQU   OCLINTTE+3                                               00372000
IEDQPRF  EQU   0                                                        00373000
PRFRCB   EQU   IEDQPRF                                                  00374000
PRFKEY   EQU   PRFRCB                                                   00375000
PRFQCBA  EQU   PRFRCB+1                                                 00376000
PRFPRI   EQU   PRFRCB+4                                                 00377000
PRFLINK  EQU   PRFRCB+5                                                 00378000
PRFTIC   EQU   IEDQPRF+8                                                00379000
PRFTICC  EQU   PRFTIC                                                   00380000
PRFTI0   EQU   PRFTIC+1                                                 00381000
PRFVTCHK EQU   PRFTI0+2                                                 00382000
PRFNBUNT EQU   IEDQPRF+12                                               00383000
PRFSUNIT EQU   PRFNBUNT                                                 00384000
PRFPLQCB EQU   PRFSUNIT                                                 00385000
PRFSRCSZ EQU   IEDQPRF+16                                               00386000
PRFSTAT1 EQU   IEDQPRF+20                                               00387000
PRFEOFN  EQU   PRFSTAT1                                                 00388000
PRFCORE  EQU   IEDQPRF+21                                               00389000
PRFXTRA  EQU   PRFCORE                                                  00390000
PRFLU1TT EQU   PRFXTRA+1                                                00391000
PRFSCAN  EQU   IEDQPRF+24                                               00392000
PRFTQBCK EQU   IEDQPRF+26                                               00393000
PRFNTXT  EQU   PRFTQBCK                                                 00394000
PRFEOBOF EQU   PRFNTXT                                                  00395000
PRFLU2TT EQU   PRFNTXT+1                                                00396000
PRFCHDR  EQU   IEDQPRF+32                                               00397000
PRFHQBCK EQU   IEDQPRF+35                                               00398000
IEDPF1   EQU   0                                                        00399000
PRF1FLG1 EQU   IEDPF1+3                                                 00400000
PRF1WD2  EQU   IEDPF1+4                                                 00401000
PRF1SEQP EQU   PRF1WD2                                                  00402000
PRF1SQID EQU   PRF1SEQP                                                 00403000
PRF1TAG1 EQU   PRF1SQID                                                 00404000
PRF1RULN EQU   PRF1SEQP+2                                               00405000
IEDPF2   EQU   0                                                        00406000
PRF2FLG2 EQU   IEDPF2                                                   00407000
PRF2WD2  EQU   IEDPF2+4                                                 00408000
IEDREQD  EQU   0                                                        00409000
REQPRI   EQU   IEDREQD+4                                                00410000
REQROUTE EQU   IEDREQD+12                                               00411000
REQRCDS  EQU   IEDREQD+14                                               00412000
REQDATA  EQU   IEDREQD+16                                               00413000
ALLOCBUF EQU   0                                                        00414000
OPCAQWD  EQU   OPCAQCTL                                                 00415000
OPCAQWD1 EQU   OPCAQWD                                                  00416000
OPCAQWD2 EQU   OPCAQWD+4                                                00417000
OPCAQWD3 EQU   OPCAQWD+8                                                00418000
@NM00134 EQU   OCCIB                                                    00419000
@NM00135 EQU   @NM00134+1                                               00420000
OCCKPKY1 EQU   OCCKPKEY                                                 00421000
OCCKPTYP EQU   OCCKPKY1                                                 00422000
OCICACTN EQU   OCMODNME                                                 00423000
OCICDADR EQU   OCICACTN                                                 00424000
OCICSW   EQU   OCICDADR+3                                               00425000
OCFID0   EQU   OCMODNME                                                 00426000
OCFID01  EQU   OCBACKUP                                                 00427000
@NM00140 EQU   OCCKDATA                                                 00428000
OCMSGFLG EQU   OCPREFLG                                                 00429000
OCBKUP1  EQU   OCMODNME                                                 00430000
@NM00145 EQU   OCMODNME                                                 00431000
OCBKUP2  EQU   OCCKDATA                                                 00432000
OCBKUP3  EQU   OCLDNME                                                  00433000
OCRESPTR EQU   OCBKUP3+4                                                00434000
OCDIALLN EQU   OCRESPTR                                                 00435000
OCIPLDMP EQU   OCLDNME+4                                                00436000
@NM00159 EQU   PRFSRCSZ                                                 00437000
REQLDATA EQU   REQDATA                                                  00438000
REQSDATA EQU   REQDATA                                                  00439000
@NM00164 EQU   REQDATA                                                  00440000
REQDATA1 EQU   @NM00164+4                                               00441000
@NM00165 EQU   REQDATA                                                  00442000
REQDATA2 EQU   @NM00165+8                                               00443000
@NM00166 EQU   REQDATA1                                                 00444000
@NM00167 EQU   REQDATA1                                                 00445000
REQCDE   EQU   @NM00167                                                 00446000
@NM00168 EQU   REQDATA2                                                 00447000
REQSTFLG EQU   @NM00168                                                 00448000
REQSTALL EQU   REQSTFLG                                                 00449000
@NM00171 EQU   REQDATA1                                                 00450000
REQHIPRT EQU   @NM00171+6                                               00451000
REQHIPRP EQU   @NM00171+12                                              00452000
REQHIAR  EQU   @NM00171+16                                              00453000
@NM00173 EQU   REQHIAR                                                  00454000
REQHILSP EQU   @NM00173+4                                               00455000
@NM00174 EQU   REQHIAR                                                  00456000
@NM00175 EQU   REQHIAR                                                  00457000
@NM00176 EQU   REQDATA1                                                 00458000
REQTPMA  EQU   @NM00176                                                 00459000
@NM00177 EQU   REQDATA1                                                 00460000
TICFLD   EQU   PRFTIC                                                   00461000
TIC      EQU   TICFLD+3                                                 00462000
OCLINRRT EQU   OCTRUNIT                                                 00463000
OCPCID   EQU   OCBACKUP                                                 00464000
OCRSNCDE EQU   OCALSTAT                                                 00465000
PRFSHDR  EQU   IEDQPRF+42                                               00466000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00467000
@NM00178 EQU   TICFLD                                                   00468000
REQOPCPT EQU   @NM00177                                                 00469000
REQTPMT  EQU   REQTPMA+2                                                00470000
REQTPMI  EQU   REQTPMA                                                  00471000
REQHISAP EQU   @NM00175+8                                               00472000
REQHISRP EQU   @NM00175+4                                               00473000
REQHISAT EQU   @NM00175+2                                               00474000
REQHISRT EQU   @NM00175                                                 00475000
REQHIRRP EQU   @NM00174                                                 00476000
REQHITRT EQU   @NM00173+8                                               00477000
REQHIOSP EQU   REQHILSP                                                 00478000
REQHITRP EQU   @NM00173                                                 00479000
REQHIAPP EQU   REQHIPRP                                                 00480000
REQHIRSP EQU   @NM00171+8                                               00481000
REQHIAPT EQU   REQHIPRT                                                 00482000
REQHIRST EQU   @NM00171+4                                               00483000
@NM00172 EQU   @NM00171+1                                               00484000
REQHITYP EQU   @NM00171                                                 00485000
REQPUCPB EQU   @NM00168+8                                               00486000
REQPUBFR EQU   @NM00168+4                                               00487000
REQFRCPB EQU   @NM00168+2                                               00488000
@NM00170 EQU   @NM00168+1                                               00489000
@NM00169 EQU   REQSTFLG                                                 00490000
REQSTBFR EQU   REQSTALL                                                 00491000
REQSTCPB EQU   REQSTALL                                                 00492000
REQSTCLR EQU   REQSTFLG                                                 00493000
REQCDEA2 EQU   @NM00167+8                                               00494000
REQCDEA1 EQU   @NM00167+4                                               00495000
REQCDENA EQU   REQCDE+2                                                 00496000
REQCDEIN EQU   REQCDE                                                   00497000
REQUPTYP EQU   @NM00166+32                                              00498000
REQTTEP1 EQU   @NM00166+28                                              00499000
REQSIT2  EQU   @NM00166+24                                              00500000
REQNAME2 EQU   @NM00166+16                                              00501000
REQSIT1  EQU   @NM00166+12                                              00502000
REQNAME1 EQU   @NM00166+4                                               00503000
REQTNT2  EQU   @NM00166+2                                               00504000
REQTNT1  EQU   @NM00166                                                 00505000
REQNAME  EQU   @NM00165                                                 00506000
REQRTN   EQU   @NM00164                                                 00507000
REQSTNT  EQU   REQSDATA+4                                               00508000
REQSTTE  EQU   REQSDATA                                                 00509000
REQLSIBX EQU   REQLDATA+2                                               00510000
REQLTNT  EQU   REQLDATA                                                 00511000
PRFSVFLG EQU   @NM00159+3                                               00512000
PRFSVFFO EQU   @NM00159                                                 00513000
@NM00148 EQU   OCIPLDMP                                                 00514000
OCACTRQ  EQU   OCIPLDMP                                                 00515000
OCDACRQ  EQU   OCIPLDMP                                                 00516000
OCIPLRQ  EQU   OCIPLDMP                                                 00517000
OCDMPRQ  EQU   OCIPLDMP                                                 00518000
@NM00147 EQU   OCRESPTR+2                                               00519000
OCOHNATA EQU   OCDIALLN                                                 00520000
OCRRTPTR EQU   OCBKUP3                                                  00521000
@NM00146 EQU   OCBKUP2+4                                                00522000
OCNHITTC EQU   OCBKUP2+2                                                00523000
OCLINTTC EQU   OCBKUP2                                                  00524000
OCCSIB   EQU   @NM00145                                                 00525000
@NM00144 EQU   OCBKUP1+6                                                00526000
OCTARTTC EQU   OCBKUP1+4                                                00527000
OCSRTTC  EQU   OCBKUP1+2                                                00528000
OCRSTTC  EQU   OCBKUP1                                                  00529000
@NM00143 EQU   OCMSGFLG                                                 00530000
OCRRT    EQU   OCMSGFLG                                                 00531000
OCNAME   EQU   OCMSGFLG                                                 00532000
OCLU1TTE EQU   @NM00140+4                                               00533000
OCLU2TTI EQU   @NM00140+2                                               00534000
OCLU1TTI EQU   @NM00140                                                 00535000
OCSLUTNT EQU   OCFID01+6                                                00536000
OCPLUTNT EQU   OCFID01+4                                                00537000
OCBIADDR EQU   OCFID01                                                  00538000
OCSRCED  EQU   OCFID0+4                                                 00539000
OCSRCEU  EQU   OCFID0                                                   00540000
OCICINAC EQU   OCICSW                                                   00541000
@NM00139 EQU   OCICSW                                                   00542000
OCICATST EQU   OCICDADR+1                                               00543000
OCICTYPE EQU   OCICDADR                                                 00544000
@NM00138 EQU   OCCKPKY1                                                 00545000
OCCKPENV EQU   OCCKPKY1                                                 00546000
OCCKPRST EQU   OCCKPTYP                                                 00547000
OCCKPNCP EQU   OCCKPTYP                                                 00548000
OCCKPINC EQU   OCCKPTYP                                                 00549000
@NM00137 EQU   @NM00134+2                                               00550000
@NM00136 EQU   @NM00135                                                 00551000
OCTSTAT  EQU   @NM00135                                                 00552000
OCREASON EQU   @NM00134                                                 00553000
OPCAQLST EQU   OPCAQWD3+1                                               00554000
OPCAQRQ3 EQU   OPCAQWD3                                                 00555000
OPCAQSEC EQU   OPCAQWD2+1                                               00556000
OPCAQRQ2 EQU   OPCAQWD2                                                 00557000
OPCAQFST EQU   OPCAQWD1+1                                               00558000
OPCAQREQ EQU   OPCAQWD1                                                 00559000
REQRCD2  EQU   REQRCDS+1                                                00560000
REQRCD1  EQU   REQRCDS                                                  00561000
REQSWTCH EQU   REQROUTE+1                                               00562000
REQFLAG  EQU   REQROUTE                                                 00563000
REQRQCBA EQU   IEDREQD+9                                                00564000
REQRPRI  EQU   IEDREQD+8                                                00565000
REQLINK  EQU   IEDREQD+5                                                00566000
REQQCBA  EQU   IEDREQD+1                                                00567000
REQTYPE  EQU   IEDREQD                                                  00568000
PRF2SEQP EQU   PRF2WD2                                                  00569000
@NM00163 EQU   IEDPF2+1                                                 00570000
@NM00162 EQU   PRF2FLG2                                                 00571000
PRF2TERM EQU   PRF2FLG2                                                 00572000
PRF2SMI  EQU   PRF2FLG2                                                 00573000
PRF2FORM EQU   PRF2FLG2                                                 00574000
PRF2TNTI EQU   PRF2FLG2                                                 00575000
PRF1RCDE EQU   PRF1RULN                                                 00576000
PRF1TAG2 EQU   PRF1SQID+1                                               00577000
@NM00161 EQU   PRF1TAG1                                                 00578000
PRF1TAGS EQU   PRF1TAG1                                                 00579000
@NM00160 EQU   PRF1FLG1                                                 00580000
PRF1LOGD EQU   PRF1FLG1                                                 00581000
PRF1USS  EQU   PRF1FLG1                                                 00582000
PRF1FORM EQU   PRF1FLG1                                                 00583000
PRF1EXPI EQU   PRF1FLG1                                                 00584000
PRF1FIDI EQU   PRF1FLG1                                                 00585000
PRF1RH   EQU   IEDPF1                                                   00586000
PRFDEST  EQU   IEDQPRF+40                                               00587000
PRFISEQ  EQU   IEDQPRF+38                                               00588000
PRFSTXT  EQU   PRFHQBCK                                                 00589000
PRFNHDR  EQU   PRFCHDR                                                  00590000
PRFCRCD  EQU   IEDQPRF+29                                               00591000
PRFSVSEQ EQU   PRFLU2TT                                                 00592000
PRFSVPRI EQU   PRFEOBOF                                                 00593000
PRFISIZE EQU   PRFSCAN+1                                                00594000
@NM00158 EQU   PRFSCAN                                                  00595000
PRFEOB   EQU   PRFLU1TT                                                 00596000
PRFSTSO  EQU   PRFXTRA                                                  00597000
PRFNHDRN EQU   PRFSTAT1                                                 00598000
PRFNLSTN EQU   PRFSTAT1                                                 00599000
PRFLOCK  EQU   PRFEOFN                                                  00600000
PRFDUPLN EQU   PRFSTAT1                                                 00601000
PRFTSMSG EQU   PRFSTAT1                                                 00602000
PRFITCPN EQU   PRFSTAT1                                                 00603000
PRFERMGN EQU   PRFSTAT1                                                 00604000
PRFCNCLN EQU   PRFSTAT1                                                 00605000
PRFSIZE  EQU   PRFSRCSZ+2                                               00606000
PRFSRCE  EQU   PRFSRCSZ                                                 00607000
PRFLCB   EQU   IEDQPRF+13                                               00608000
PRFPIUO  EQU   PRFPLQCB                                                 00609000
@NM00157 EQU   PRFVTCHK                                                 00610000
PRFITSET EQU   PRFVTCHK                                                 00611000
@NM00156 EQU   PRFVTCHK                                                 00612000
@NM00155 EQU   PRFTI0                                                   00613000
@NM00154 EQU   PRFTICC                                                  00614000
@NM00153 EQU   PRFTICC                                                  00615000
@NM00152 EQU   PRFTICC                                                  00616000
PRFTICON EQU   PRFTICC                                                  00617000
@NM00151 EQU   PRFTICC                                                  00618000
@NM00150 EQU   PRFTICC                                                  00619000
PRFBFMM  EQU   PRFTICC                                                  00620000
PRFEOMSG EQU   PRFTICC                                                  00621000
PRFCOUNT EQU   PRFLINK+1                                                00622000
@NM00149 EQU   PRFLINK                                                  00623000
PRFFLAGS EQU   PRFPRI                                                   00624000
PRFIOADR EQU   PRFQCBA                                                  00625000
PRFOPCDE EQU   PRFKEY                                                   00626000
@NM00142 EQU   OCLDNME+4                                                00627000
@NM00141 EQU   OCPREFLG                                                 00628000
OCREMCON EQU   OCPREFLG                                                 00629000
OCCLNUP  EQU   OCPREFLG                                                 00630000
OCTOTEP  EQU   OCPREFLG                                                 00631000
OCREPOST EQU   OCPREFLG                                                 00632000
OCRSPSNT EQU   OCPREFLG                                                 00633000
OCBFREQ  EQU   OCPREFLG                                                 00634000
OCIDLE   EQU   OCREQFLG                                                 00635000
OCFORCE  EQU   OCREQFLG                                                 00636000
OCDCARD  EQU   OCREQFLG                                                 00637000
OCPARTAL EQU   OCREQFLG                                                 00638000
OCADNCP  EQU   OCREQFLG                                                 00639000
OCRMPORQ EQU   OCREQFLG                                                 00640000
OCCDLACT EQU   OCREQFLG                                                 00641000
OCFLUSHZ EQU   OCREQFLG                                                 00642000
OCRESPCT EQU   OCLINTTE                                                 00643000
OCCKPTWA EQU   OCCKDATA+4                                               00644000
OCNCP    EQU   OCRSTGTM+2                                               00645000
OCCKDAT2 EQU   OC379RRT+1                                               00646000
OCCKDAT1 EQU   OC379RRT                                                 00647000
OCPTRSAV EQU   OCMODNME+4                                               00648000
OCPUADR  EQU   OCIPLWA+2                                                00649000
OCWTGSAV EQU   OCIPLWA                                                  00650000
OCDVRDCT EQU   OCBACKUP+6                                               00651000
@NM00133 EQU   OCBACKUP+4                                               00652000
OCBUFRET EQU   OCBUFGOT                                                 00653000
OCBUFUSD EQU   OCBUFNED                                                 00654000
OCRESNUM EQU   OCPARM                                                   00655000
OCSEQ    EQU   OCTRUNIT+2                                               00656000
@NM00132 EQU   OCRSID+1                                                 00657000
OCNONE   EQU   OCALSTAT                                                 00658000
OCSOME   EQU   OCALSTAT                                                 00659000
OCALLFLG EQU   OCALSTAT                                                 00660000
OCACTREQ EQU   OCALSTAT                                                 00661000
OCREDRVE EQU   OCALSTAT                                                 00662000
OCSEQIND EQU   OCALSTAT                                                 00663000
@NM00131 EQU   OCALSTAT                                                 00664000
OCRENTRD EQU   OCALSTAT                                                 00665000
OCDIALX  EQU   OCWTGB                                                   00666000
OCTRMTBL EQU   IEDQOPCE+20                                              00667000
@NM00130 EQU   OCMSTSAV+2                                               00668000
OCREQVAL EQU   OCDEST+1                                                 00669000
OCCONID  EQU   OCDEST                                                   00670000
OCRLN    EQU   IEDQOPCE+15                                              00671000
OCRESP   EQU   OCFLAG                                                   00672000
OCATTACH EQU   OCFLAG                                                   00673000
OCSSCP   EQU   OCFLAG                                                   00674000
OCOUTPUT EQU   OCFLAG                                                   00675000
OCLINE   EQU   OCFLAG                                                   00676000
OCMPP    EQU   OCFLAG                                                   00677000
OCTOTE   EQU   OCFLAG                                                   00678000
OCCONSOL EQU   OCFLAG                                                   00679000
@NM00129 EQU   OCSWITCH                                                 00680000
OCQUCKN  EQU   OCSWITCH                                                 00681000
OCPRIFLG EQU   OCOPTCDE                                                 00682000
@NM00128 EQU   OCUNITBF                                                 00683000
OCINVTIC EQU   OCUNITBF                                                 00684000
@NM00127 EQU   OCUNITBF                                                 00685000
@NM00126 EQU   @NM00125                                                 00686000
@NM00124 EQU   OCSCAN                                                   00687000
OCNOTUCB EQU   OCSCAN                                                   00688000
OCNONAME EQU   OCSCAN                                                   00689000
OCALLRLN EQU   OCSCAN                                                   00690000
OCDDNAME EQU   OCSCAN                                                   00691000
OCDDNRLN EQU   OCSCAN                                                   00692000
OCADDR   EQU   OCSCAN                                                   00693000
OCELMPTR EQU   OCELEM+1                                                 00694000
OCELMPRI EQU   OCELEM                                                   00695000
OPCBOTTM EQU   IEDQOPCD+1276                                            00696000
OPCDSRWT EQU   IEDQOPCD+1272                                            00697000
@NM00123 EQU   IEDQOPCD+1188                                            00698000
@NM00122 EQU   IEDQOPCD+1036                                            00699000
@NM00121 EQU   IEDQOPCD+1028                                            00700000
@NM00120 EQU   IEDQOPCD+468                                             00701000
OPCLSABC EQU   IEDQOPCD+466                                             00702000
@NM00119 EQU   IEDQOPCD+465                                             00703000
@NM00118 EQU   OPCBLIN                                                  00704000
OPCBLDSC EQU   OPCBLIN                                                  00705000
OPCUNIQV EQU   OPCUNIQP+2                                               00706000
OPCUNIQU EQU   OPCUNIQP                                                 00707000
OPCOSSCP EQU   OPCPCID                                                  00708000
OPCSDUPU EQU   IEDQOPCD+452                                             00709000
OPCSDULU EQU   IEDQOPCD+448                                             00710000
OPCSDRVT EQU   IEDQOPCD+444                                             00711000
OPCSDRET EQU   IEDQOPCD+440                                             00712000
OPCSDHSY EQU   IEDQOPCD+436                                             00713000
OPCSDENQ EQU   IEDQOPCD+432                                             00714000
OPCSDDIA EQU   IEDQOPCD+428                                             00715000
OPCSDCIS EQU   IEDQOPCD+424                                             00716000
OPCSDBIS EQU   IEDQOPCD+420                                             00717000
OPCSDAPU EQU   IEDQOPCD+416                                             00718000
OPCSDALU EQU   IEDQOPCD+412                                             00719000
OPCCSKEY EQU   IEDQOPCD+408                                             00720000
OPCSSKEY EQU   IEDQOPCD+404                                             00721000
OPCPRTTE EQU   IEDQOPCD+400                                             00722000
OPCLU2TT EQU   OPCSESS+14                                               00723000
OPCLU1TT EQU   OPCSESS+12                                               00724000
OPCSENSE EQU   OPCSESS+8                                                00725000
OPCCSIB  EQU   OPCSESS+4                                                00726000
OPCCTTE  EQU   OPCSESS                                                  00727000
OPCGTSIB EQU   IEDQOPCD+380                                             00728000
@NM00117 EQU   OPCPWCOB+9                                               00729000
@NM00116 EQU   OPCPWCOB+8                                               00730000
@NM00115 EQU   OPCPWECB+1                                               00731000
OPCPWCCC EQU   OPCPWECB                                                 00732000
OPCPWCHN EQU   OPCPWQCB+1                                               00733000
OPCPWVTO EQU   OPCPWQCB                                                 00734000
OPCWAITV EQU   IEDQOPCD+364                                             00735000
OPCTOTCK EQU   IEDQOPCD+360                                             00736000
OPCAPXTL EQU   IEDQOPCD+356                                             00737000
OPCDECR  EQU   IEDQOPCD+352                                             00738000
OPCWRKSP EQU   IEDQOPCD+320                                             00739000
OPCRQCNT EQU   IEDQOPCD+316                                             00740000
OPPOLSTP EQU   IEDQOPCD+312                                             00741000
OPCCKCIB EQU   IEDQOPCD+308                                             00742000
OPCEND   EQU   IEDQOPCD+307                                             00743000
OPCSTCBS EQU   IEDQOPCD+306                                             00744000
OPCHNEND EQU   IEDQOPCD+302                                             00745000
OPCOQSW  EQU   IEDQOPCD+301                                             00746000
@NM00114 EQU   OPCSPEC                                                  00747000
@NM00113 EQU   OPCSPEC                                                  00748000
@NM00112 EQU   OPCSPEC                                                  00749000
@NM00111 EQU   OPCSPEC                                                  00750000
OPCFRMCA EQU   OPCSPEC                                                  00751000
OPCRSTRT EQU   OPCSPEC                                                  00752000
OPCPART  EQU   OPCSPEC                                                  00753000
OPCALTD  EQU   OPCSPEC                                                  00754000
OPCBFEND EQU   IEDQOPCD+296                                             00755000
OPCBFIRS EQU   IEDQOPCD+292                                             00756000
OPCAVBUF EQU   IEDQOPCD+290                                             00757000
OPCIPLCT EQU   IEDQOPCD+289                                             00758000
OPCCLNTS EQU   IEDQOPCD+288                                             00759000
OPCHA8   EQU   IEDQOPCD+286                                             00760000
OPCBFREQ EQU   IEDQOPCD+284                                             00761000
OPCFREBF EQU   IEDQOPCD+280                                             00762000
OPCNEXT  EQU   IEDQOPCD+272                                             00763000
OPCFMDFC EQU   IEDQOPCD+268                                             00764000
OPCSCNC  EQU   IEDQOPCD+264                                             00765000
OPCHORTG EQU   IEDQOPCD+260                                             00766000
OPCHORT  EQU   IEDQOPCD+256                                             00767000
OPCCKPTL EQU   IEDQOPCD+252                                             00768000
OPCCKPTF EQU   IEDQOPCD+248                                             00769000
OPCWAITA EQU   IEDQOPCD+244                                             00770000
OPCWAITR EQU   IEDQOPCD+240                                             00771000
OPCWAITP EQU   IEDQOPCD+236                                             00772000
OPCWAITO EQU   IEDQOPCD+232                                             00773000
OPCWAITN EQU   IEDQOPCD+228                                             00774000
OPCWAITL EQU   IEDQOPCD+224                                             00775000
OPCWAITC EQU   IEDQOPCD+220                                             00776000
@NM00110 EQU   OPCLDNME+5                                               00777000
@NM00109 EQU   OPCLDNME                                                 00778000
OPCWAIT  EQU   IEDQOPCD+192                                             00779000
OPCCKERB EQU   IEDQOPCD+164                                             00780000
OPCBFERB EQU   IEDQOPCD+148                                             00781000
OPCFLAG2 EQU   IEDQOPCD+147                                             00782000
OPCFLAG1 EQU   IEDQOPCD+146                                             00783000
OPCWRKSZ EQU   IEDQOPCD+144                                             00784000
OPCWORK  EQU   IEDQOPCD+140                                             00785000
OPCRSAVE EQU   IEDQOPCD+132                                             00786000
OPCQCBAD EQU   IEDQOPCD+128                                             00787000
OPCTRMWA EQU   IEDQOPCD+52                                              00788000
OPCPSTWT EQU   IEDQOPCD+48                                              00789000
OPCTNTEA EQU   IEDQOPCD+44                                              00790000
OPCPGCK  EQU   IEDQOPCD+40                                              00791000
OPCLCB   EQU   IEDQOPCD+36                                              00792000
@NM00108 EQU   IEDQOPCD+32                                              00793000
OPCIPLAD EQU   IEDQOPCD+28                                              00794000
OPCTOFLK EQU   IEDQOPCD+24                                              00795000
OPCOPTLK EQU   IEDQOPCD+20                                              00796000
OPCDCBLK EQU   IEDQOPCD+16                                              00797000
OPCDOUBL EQU   IEDQOPCD                                                 00798000
SAVTLLCB EQU   IEDNSVTD+380                                             00799000
SAVTSCF0 EQU   IEDNSVTD+376                                             00800000
SAVTLSNY EQU   IEDNSVTD+372                                             00801000
SAVTLSZP EQU   IEDNSVTD+368                                             00802000
SAVTOMSU EQU   IEDNSVTD+364                                             00803000
SAVTGTSB EQU   IEDNSVTD+360                                             00804000
SAVTHIBL EQU   IEDNSVTD+356                                             00805000
SAVTHISY EQU   IEDNSVTD+352                                             00806000
SAVTNAX2 EQU   IEDNSVTD+348                                             00807000
SAVTCDRU EQU   IEDNSVTD+344                                             00808000
SAVTPOLC EQU   IEDNSVTD+342                                             00809000
SAVTPOLM EQU   IEDNSVTD+340                                             00810000
SAVTPOLR EQU   IEDNSVTD+336                                             00811000
SAVTCDRN EQU   SAVTCDRV                                                 00812000
SAVTPOLL EQU   IEDNSVTD+328                                             00813000
SAVTPOLN EQU   IEDNSVTD+326                                             00814000
@NM00107 EQU   IEDNSVTD+325                                             00815000
@NM00106 EQU   SAVTNETF                                                 00816000
SAVTSDIS EQU   SAVTNETF                                                 00817000
SAVTROUT EQU   SAVTNETF                                                 00818000
SAVTNETW EQU   SAVTNETF                                                 00819000
SAVTDIAL EQU   IEDNSVTD+320                                             00820000
SAVTRQUT EQU   IEDNSVTD+316                                             00821000
SAVTBITN EQU   IEDNSVTD+312                                             00822000
@NM00105 EQU   SAVTCKQB+8                                               00823000
@NM00104 EQU   SAVTCKEC+1                                               00824000
@NM00103 EQU   SAVTCKCC                                                 00825000
SAVTCKPO EQU   SAVTCKCC                                                 00826000
SAVTCKWA EQU   SAVTCKCC                                                 00827000
SAVTCKCH EQU   SAVTCKTB+1                                               00828000
SAVTCKVT EQU   SAVTCKTB                                                 00829000
@NM00102 EQU   IEDNSVTD+297                                             00830000
SAVTRDFG EQU   SAVTRDRV+12                                              00831000
@NM00101 EQU   SAVTRDRV+5                                               00832000
SAVTRDPY EQU   SAVTRDRV+4                                               00833000
SAVTRDQB EQU   SAVTRDRV+1                                               00834000
SAVTRDKY EQU   SAVTRDRV                                                 00835000
SAVTNID  EQU   IEDNSVTD+280                                             00836000
SAVTDVAS EQU   IEDNSVTD+276                                             00837000
SAVTPLSZ EQU   IEDNSVTD+274                                             00838000
@NM00100 EQU   IEDNSVTD+273                                             00839000
SAVTSUBL EQU   IEDNSVTD+272                                             00840000
@NM00099 EQU   SAVTZELM+1                                               00841000
SAVTSUBM EQU   SAVTZELM                                                 00842000
SAVTMHDX EQU   IEDNSVTD+268                                             00843000
SAVTNAT1 EQU   IEDNSVTD+266                                             00844000
SAVTSH20 EQU   IEDNSVTD+264                                             00845000
SAVTLCBS EQU   IEDNSVTD+260                                             00846000
SAVTRNMP EQU   IEDNSVTD+256                                             00847000
SAVTTNTX EQU   IEDNSVTD+252                                             00848000
SAVTNAX  EQU   IEDNSVTD+248                                             00849000
SAVTSUBV EQU   IEDNSVTD+247                                             00850000
SAVTSUBA EQU   IEDNSVTD+246                                             00851000
SAVTSIBC EQU   IEDNSVTD+244                                             00852000
SAVTBSM  EQU   IEDNSVTD+240                                             00853000
SAVTSCPT EQU   SAVTTCPU                                                 00854000
SAVTRQTG EQU   IEDNSVTD+236                                             00855000
SAVTRQCH EQU   IEDNSVTD+232                                             00856000
SAVTMAND EQU   IEDNSVTD+228                                             00857000
SAVTSPLN EQU   IEDNSVTD+224                                             00858000
SAVTNADL EQU   IEDNSVTD+222                                             00859000
SAVTNATL EQU   IEDNSVTD+220                                             00860000
SAVTMHTB EQU   IEDNSVTD+216                                             00861000
SAVTSSMH EQU   IEDNSVTD+212                                             00862000
SAVTQRS  EQU   IEDNSVTD+208                                             00863000
SAVTRQIN EQU   IEDNSVTD+204                                             00864000
SAVTDFCO EQU   IEDNSVTD+200                                             00865000
SAVTSAO  EQU   IEDNSVTD+196                                             00866000
SAVTSARI EQU   IEDNSVTD+192                                             00867000
SAVTSAC  EQU   IEDNSVTD+188                                             00868000
SAVTSAI  EQU   IEDNSVTD+184                                             00869000
SAVTCSCI EQU   IEDNSVTD+180                                             00870000
SAVTSSRP EQU   IEDNSVTD+176                                             00871000
SAVTSSRQ EQU   IEDNSVTD+172                                             00872000
SAVTSCLU EQU   IEDNSVTD+168                                             00873000
SAVTXTRQ EQU   IEDNSVTD+164                                             00874000
SAVTMVBF EQU   IEDNSVTD+160                                             00875000
@NM00098 EQU   IEDNSVTD+148                                             00876000
SAVTIPCQ EQU   IEDNSVTD+144                                             00877000
@NM00097 EQU   IEDNSVTD+136                                             00878000
SAVTXFMI EQU   IEDNSVTD+132                                             00879000
@NM00096 EQU   IEDNSVTD+124                                             00880000
SAVTXFMO EQU   IEDNSVTD+120                                             00881000
@NM00095 EQU   IEDNSVTD+116                                             00882000
SAVTSSSR EQU   IEDNSVTD+112                                             00883000
SAVTSCPQ EQU   IEDNSVTD+108                                             00884000
SAVTSLCB EQU   IEDNSVTD+104                                             00885000
SAVTLUSR EQU   IEDNSVTD+100                                             00886000
@NM00094 EQU   SAVTLUSQ+8                                               00887000
SAVTLUSP EQU   SAVTLUSQ+4                                               00888000
SAVTLUSB EQU   SAVTLUSQ                                                 00889000
@NM00093 EQU   IEDNSVTD+84                                              00890000
SAVTSAT  EQU   IEDNSVTD+80                                              00891000
SAVTNAT  EQU   IEDNSVTD+76                                              00892000
SAVTCLUP EQU   IEDNSVTD+72                                              00893000
SAVTPIUT EQU   IEDNSVTD+68                                              00894000
SAVTRNTA EQU   IEDNSVTD+64                                              00895000
SAVTDNIR EQU   IEDNSVTD+60                                              00896000
SAVTCNIR EQU   IEDNSVTD+56                                              00897000
SAVTFLDH EQU   IEDNSVTD+52                                              00898000
SAVTSRTN EQU   IEDNSVTD+48                                              00899000
SAVTSREQ EQU   IEDNSVTD+44                                              00900000
SAVTFAIL EQU   IEDNSVTD+42                                              00901000
SAVTSUSE EQU   IEDNSVTD+40                                              00902000
SAVTSIB  EQU   IEDNSVTD+36                                              00903000
SAVTPRTN EQU   IEDNSVTD+32                                              00904000
@NM00092 EQU   IEDNSVTD+28                                              00905000
SAVTWH20 EQU   IEDNSVTD+26                                              00906000
SAVTPWT  EQU   IEDNSVTD+24                                              00907000
SAVTPRTQ EQU   IEDNSVTD+20                                              00908000
SAVTPREQ EQU   IEDNSVTD+16                                              00909000
SAVTPH20 EQU   IEDNSVTD+14                                              00910000
SAVTPUSE EQU   IEDNSVTD+12                                              00911000
SAVTPLCB EQU   IEDNSVTD+8                                               00912000
SAVTPOOL EQU   IEDNSVTD+4                                               00913000
SAVTPRMT EQU   SAVTDIAF                                                 00914000
SAVTVIRT EQU   SAVTDIAF                                                 00915000
AVTSITS  EQU   IEDQAVTD+1264                                            00916000
AVTMSUHI EQU   IEDQAVTD+1260                                            00917000
AVTSITU  EQU   IEDQAVTD+1256                                            00918000
AVTSITP  EQU   IEDQAVTD+1252                                            00919000
AVTPADDR EQU   IEDQAVTD+1248                                            00920000
@NM00091 EQU   IEDQAVTD+1246                                            00921000
AVTCPBNO EQU   IEDQAVTD+1244                                            00922000
AVTHRESS EQU   IEDQAVTD+1243                                            00923000
@NM00090 EQU   IEDQAVTD+1242                                            00924000
@NM00089 EQU   IEDQAVTD+1241                                            00925000
@NM00088 EQU   IEDQAVTD+1240                                            00926000
@NM00087 EQU   IEDQAVTD+1237                                            00927000
@NM00086 EQU   IEDQAVTD+1236                                            00928000
AVTHRESE EQU   @NM00085                                                 00929000
AVTRADDR EQU   IEDQAVTD+1228                                            00930000
AVTNADDR EQU   IEDQAVTD+1224                                            00931000
AVTHRESN EQU   IEDQAVTD+1220                                            00932000
AVTVOLRN EQU   IEDQAVTD+1216                                            00933000
AVTTOTNN EQU   IEDQAVTD+1212                                            00934000
AVTTRCYN EQU   IEDQAVTD+1208                                            00935000
AVTRCTRN EQU   IEDQAVTD+1204                                            00936000
AVTNOVON EQU   IEDQAVTD+1200                                            00937000
AVTADEBN EQU   IEDQAVTD+1196                                            00938000
AVTVOLRR EQU   IEDQAVTD+1192                                            00939000
AVTTOTNR EQU   IEDQAVTD+1188                                            00940000
AVTTRCYR EQU   IEDQAVTD+1184                                            00941000
AVTRCTRR EQU   IEDQAVTD+1180                                            00942000
AVTNOVOR EQU   IEDQAVTD+1176                                            00943000
AVTADEBR EQU   IEDQAVTD+1172                                            00944000
AVTLODPT EQU   IEDQAVTD+1168                                            00945000
AVTIOBN  EQU   IEDQAVTD+1164                                            00946000
AVTIOBR  EQU   IEDQAVTD+1160                                            00947000
AVTCPBPT EQU   IEDQAVTD+1156                                            00948000
AVTFCPB  EQU   IEDQAVTD+1152                                            00949000
@NM00084 EQU   IEDQAVTD+1148                                            00950000
AVTINCPQ EQU   IEDQAVTD+1144                                            00951000
@NM00083 EQU   IEDQAVTD+1140                                            00952000
@NM00082 EQU   IEDQAVTD+1137                                            00953000
@NM00081 EQU   AVTBIT4                                                  00954000
@NM00080 EQU   AVTBIT4                                                  00955000
@NM00079 EQU   AVTBIT4                                                  00956000
@NM00078 EQU   AVTBIT4                                                  00957000
@NM00077 EQU   AVTBIT4                                                  00958000
@NM00076 EQU   AVTBIT4                                                  00959000
@NM00075 EQU   AVTBIT4                                                  00960000
AVTRUFTN EQU   AVTBIT4                                                  00961000
@NM00074 EQU   IEDQAVTD+1132                                            00962000
AVTNOBFQ EQU   IEDQAVTD+1128                                            00963000
@NM00073 EQU   IEDQAVTD+1124                                            00964000
AVTDKENQ EQU   IEDQAVTD+1120                                            00965000
@NM00072 EQU   IEDQAVTD+1116                                            00966000
AVTDKAPQ EQU   IEDQAVTD+1112                                            00967000
AVTCOPY  EQU   IEDQAVTD+1108                                            00968000
AVTIA    EQU   IEDQAVTD+1104                                            00969000
AVTFL    EQU   IEDQAVTD+1100                                            00970000
@NM00071 EQU   IEDQAVTD+1096                                            00971000
AVTNCPBQ EQU   IEDQAVTD+1092                                            00972000
AVTTOTNC EQU   IEDQAVTD+1088                                            00973000
AVTCMAX  EQU   IEDQAVTD+1084                                            00974000
AVTCMIN  EQU   IEDQAVTD+1080                                            00975000
AVTHM02  EQU   IEDQAVTD+1076                                            00976000
AVTOPCIN EQU   IEDQAVTD+1074                                            00977000
AVTDCTLN EQU   IEDQAVTD+1072                                            00978000
AVTOPMSK EQU   IEDQAVTD+1068                                            00979000
AVTDDFT  EQU   IEDQAVTD+1064                                            00980000
AVTSTEAL EQU   IEDQAVTD+1060                                            00981000
AVTOPTN  EQU   IEDQAVTD+1056                                            00982000
AVTDSKCT EQU   IEDQAVTD+1054                                            00983000
AVTCKRST EQU   IEDQAVTD+1053                                            00984000
AVTSTAN  EQU   AVTBIT3                                                  00985000
AVTSTACN EQU   AVTBIT3                                                  00986000
AVTSTAIN EQU   AVTBIT3                                                  00987000
AVTSTAYN EQU   AVTBIT3                                                  00988000
AVTOLTBN EQU   AVTBIT3                                                  00989000
AVTTSAB  EQU   AVTBIT3                                                  00990000
AVTRFULN EQU   AVTBIT3                                                  00991000
AVTRECVN EQU   AVTBIT3                                                  00992000
@NM00070 EQU   AVTBIT2                                                  00993000
@NM00069 EQU   AVTBIT2                                                  00994000
AVTOPEIN EQU   AVTBIT2                                                  00995000
AVTSTRTN EQU   AVTBIT2                                                  00996000
AVTTOPOL EQU   AVTBIT2                                                  00997000
AVTCOPYN EQU   AVTBIT2                                                  00998000
AVTREUSN EQU   AVTBIT2                                                  00999000
AVTEXTSC EQU   AVTBIT2                                                  01000000
AVTDISKN EQU   AVTBIT1                                                  01001000
AVTQUCKN EQU   AVTBIT1                                                  01002000
AVTCLOSN EQU   AVTBIT1                                                  01003000
AVTREADN EQU   AVTBIT1                                                  01004000
AVTDLAYN EQU   AVTBIT1                                                  01005000
AVTAQTAN EQU   AVTBIT1                                                  01006000
AVTTSON  EQU   AVTBIT1                                                  01007000
AVTAPLKN EQU   AVTBIT1                                                  01008000
AVTDUMBR EQU   IEDQAVTD+1048                                            01009000
AVTDLQX  EQU   IEDQAVTD+1046                                            01010000
AVTINTLV EQU   IEDQAVTD+1044                                            01011000
AVTSMCNT EQU   IEDQAVTD+1042                                            01012000
AVTAVFCT EQU   IEDQAVTD+1040                                            01013000
AVTOPCON EQU   IEDQAVTD+1038                                            01014000
AVTOPCNT EQU   IEDQAVTD+1036                                            01015000
AVTLNCNT EQU   IEDQAVTD+1034                                            01016000
AVTKEYLE EQU   IEDQAVTD+1032                                            01017000
AVTHA16  EQU   IEDQAVTD+1030                                            01018000
AVTHA7   EQU   IEDQAVTD+1028                                            01019000
AVTHA4   EQU   IEDQAVTD+1026                                            01020000
AVTHA3   EQU   IEDQAVTD+1024                                            01021000
AVTHA2   EQU   IEDQAVTD+1022                                            01022000
AVTGETMS EQU   IEDQAVTD+1021                                            01023000
@NM00068 EQU   IEDQAVTD+1020                                            01024000
AVTGETMD EQU   IEDQAVTD+1016                                            01025000
AVTGETMN EQU   IEDQAVTD+1012                                            01026000
AVTCWTOT EQU   IEDQAVTD+1008                                            01027000
AVTCWINT EQU   IEDQAVTD+956                                             01028000
AVTDTRAP EQU   IEDQAVTD+952                                             01029000
@NM00067 EQU   IEDQAVTD+950                                             01030000
@NM00066 EQU   AVTIOTR                                                  01031000
AVTIOTRH EQU   AVTIOTR                                                  01032000
AVTIOTRE EQU   AVTIOTR                                                  01033000
@NM00065 EQU   AVTSUBT                                                  01034000
AVTSUBPT EQU   AVTSUBT                                                  01035000
AVTSUBON EQU   AVTSUBT                                                  01036000
AVTAFE30 EQU   IEDQAVTD+944                                             01037000
AVTAFE20 EQU   IEDQAVTD+940                                             01038000
AVTAFE10 EQU   IEDQAVTD+936                                             01039000
AVTCWEC2 EQU   IEDQAVTD+932                                             01040000
AVTCWPM2 EQU   IEDQAVTD+928                                             01041000
AVTCWTS2 EQU   IEDQAVTD+927                                             01042000
AVTCWTS1 EQU   IEDQAVTD+926                                             01043000
AVTCWCLD EQU   AVTCWFL2                                                 01044000
AVTCWRAP EQU   AVTCWFL2                                                 01045000
@NM00064 EQU   AVTCWFL2                                                 01046000
@NM00063 EQU   AVTCWFL2                                                 01047000
@NM00062 EQU   AVTCWFL2                                                 01048000
@NM00061 EQU   AVTCWFL2                                                 01049000
@NM00060 EQU   AVTCWFL2                                                 01050000
AVTCWACT EQU   AVTCWFL2                                                 01051000
@NM00059 EQU   AVTCWFL1                                                 01052000
@NM00058 EQU   AVTCWFL1                                                 01053000
@NM00057 EQU   AVTCWFL1                                                 01054000
@NM00056 EQU   AVTCWFL1                                                 01055000
@NM00055 EQU   AVTCWFL1                                                 01056000
@NM00054 EQU   AVTCWFL1                                                 01057000
@NM00053 EQU   AVTCWFL1                                                 01058000
AVTCOMWN EQU   AVTCWFL1                                                 01059000
AVTCWEC1 EQU   IEDQAVTD+920                                             01060000
AVTCWPM1 EQU   IEDQAVTD+916                                             01061000
AVTCAREA EQU   IEDQAVTD+912                                             01062000
AVTFZERO EQU   IEDQAVTD+908                                             01063000
AVTCADDR EQU   IEDQAVTD+904                                             01064000
AVTCOREC EQU   IEDQAVTD+900                                             01065000
@NM00052 EQU   IEDQAVTD+892                                             01066000
AVTCPBCB EQU   IEDQAVTD+888                                             01067000
@NM00051 EQU   IEDQAVTD+880                                             01068000
AVTDSIOB EQU   IEDQAVTD+876                                             01069000
@NM00050 EQU   IEDQAVTD+868                                             01070000
AVTCPRMB EQU   IEDQAVTD+864                                             01071000
@NM00049 EQU   IEDQAVTD+856                                             01072000
AVTCLOSB EQU   IEDQAVTD+852                                             01073000
@NM00048 EQU   IEDQAVTD+844                                             01074000
AVTACTIB EQU   IEDQAVTD+840                                             01075000
@NM00047 EQU   IEDQAVTD+836                                             01076000
AVTOLTEB EQU   IEDQAVTD+832                                             01077000
AVTOLTCH EQU   AVTOLTQB+1                                               01078000
AVTOLTVT EQU   AVTOLTQB                                                 01079000
@NM00046 EQU   AVTOPCQB+8                                               01080000
@NM00045 EQU   AVTOPCEC+1                                               01081000
@NM00044 EQU   AVTOPCCC                                                 01082000
AVTOPCPO EQU   AVTOPCCC                                                 01083000
AVTOPCWA EQU   AVTOPCCC                                                 01084000
AVTOPCCH EQU   AVTOPCOB+1                                               01085000
AVTOPCVT EQU   AVTOPCOB                                                 01086000
@NM00043 EQU   AVTCKPQB+9                                               01087000
AVTCKPTS EQU   AVTCKPQB+8                                               01088000
@NM00042 EQU   AVTCKPEC+1                                               01089000
@NM00041 EQU   AVTCKPCC                                                 01090000
AVTCKPPO EQU   AVTCKPCC                                                 01091000
AVTCKPWA EQU   AVTCKPCC                                                 01092000
AVTCKPCH EQU   AVTCKPTB+1                                               01093000
AVTCKPVT EQU   AVTCKPTB                                                 01094000
@NM00040 EQU   IEDQAVTD+796                                             01095000
AVTBFRTB EQU   IEDQAVTD+792                                             01096000
@NM00039 EQU   IEDQAVTD+788                                             01097000
AVTSELCH EQU   IEDQAVTD+785                                             01098000
AVTBFRTN EQU   AVTBFRFG                                                 01099000
AVTBFREB EQU   IEDQAVTD+780                                             01100000
AVTTIMQ  EQU   IEDQAVTD+776                                             01101000
@NM00038 EQU   IEDQAVTD+772                                             01102000
AVTIMQPS EQU   IEDQAVTD+768                                             01103000
AVTINOUT EQU   IEDQAVTD+766                                             01104000
AVTREFTM EQU   IEDQAVTD+764                                             01105000
@NM00037 EQU   IEDQAVTD+752                                             01106000
AVTDELYB EQU   IEDQAVTD+748                                             01107000
AVTOCQPT EQU   IEDQAVTD+744                                             01108000
AVTTSOPT EQU   IEDQAVTD+740                                             01109000
AVTSUPPT EQU   IEDQAVTD+736                                             01110000
AVTCBQCB EQU   IEDQAVTD+732                                             01111000
AVTMSGS  EQU   IEDQAVTD+729                                             01112000
@NM00036 EQU   AVTSYSER                                                 01113000
@NM00035 EQU   AVTSYSER                                                 01114000
@NM00034 EQU   AVTSYSER                                                 01115000
@NM00033 EQU   AVTSYSER                                                 01116000
@NM00032 EQU   AVTSYSER                                                 01117000
@NM00031 EQU   AVTSYSER                                                 01118000
AVTCMAXN EQU   AVTSYSER                                                 01119000
AVTCMINN EQU   AVTSYSER                                                 01120000
AVT2260L EQU   IEDQAVTD+724                                             01121000
AVTABEPL EQU   AVTADBUF                                                 01122000
AVTHFF   EQU   AVTCLRHI+2                                               01123000
@NM00030 EQU   AVTCLRHI                                                 01124000
AVTCCLNK EQU   AVTCRELE+5                                               01125000
AVTCCPRI EQU   AVTCRELE+4                                               01126000
AVTCCQCB EQU   AVTCCELE+1                                               01127000
AVTCCKEY EQU   AVTCCELE                                                 01128000
AVTDELAD EQU   IEDQAVTD+704                                             01129000
AVTDELEM EQU   IEDQAVTD+700                                             01130000
AVTBSX   EQU   AVTCKLNK                                                 01131000
AVTOPETR EQU   AVTHG01                                                  01132000
@NM00029 EQU   AVTCKBYT                                                 01133000
AVTCKONQ EQU   AVTCKBYT                                                 01134000
@NM00028 EQU   AVTCKBYT                                                 01135000
@NM00027 EQU   AVTCKBYT                                                 01136000
@NM00026 EQU   AVTCKBYT                                                 01137000
@NM00025 EQU   AVTCKBYT                                                 01138000
@NM00024 EQU   AVTCKBYT                                                 01139000
@NM00023 EQU   AVTCKBYT                                                 01140000
AVTOPERT EQU   IEDQAVTD+690                                             01141000
AVTOPXCL EQU   IEDQAVTD+688                                             01142000
AVTOPERL EQU   IEDQAVTD+687                                             01143000
@NM00022 EQU   IEDQAVTD+686                                             01144000
AVTCKTIM EQU   IEDQAVTD+684                                             01145000
AVTCKELV EQU   IEDQAVTD+682                                             01146000
AVTCPRCD EQU   IEDQAVTD+681                                             01147000
AVTWARMN EQU   AVTCKELF                                                 01148000
AVTCRTLN EQU   AVTCKELF                                                 01149000
AVTCPIPN EQU   AVTCKELF                                                 01150000
AVTCCLCN EQU   AVTCKELF                                                 01151000
AVTCINCN EQU   AVTCKELF                                                 01152000
@NM00021 EQU   AVTCKELF                                                 01153000
AVTCMCPN EQU   AVTCKELF                                                 01154000
AVTNQBCK EQU   AVTCKELF                                                 01155000
AVTCKQAD EQU   IEDQAVTD+677                                             01156000
AVTSCBSZ EQU   IEDQAVTD+676                                             01157000
@NM00020 EQU   IEDQAVTD+672                                             01158000
AVTCKELE EQU   IEDQAVTD+668                                             01159000
@NM00019 EQU   AVTCKPEL+8                                               01160000
AVTCKRLK EQU   AVTCKPEL+5                                               01161000
AVTCKRPR EQU   AVTCKPEL+4                                               01162000
AVTCKRMQ EQU   AVTCKRMV+1                                               01163000
AVTCKRKY EQU   AVTCKRMV                                                 01164000
AVTHK    EQU   IEDQAVTD+648                                             01165000
AVTHI    EQU   IEDQAVTD+644                                             01166000
AVTIOT   EQU   IEDQAVTD+640                                             01167000
AVTNX    EQU   IEDQAVTD+636                                             01168000
AVTTONE  EQU   IEDQAVTD+632                                             01169000
AVTA3TL  EQU   IEDQAVTD+628                                             01170000
AVTDMECB EQU   IEDQAVTD+624                                             01171000
AVTABEND EQU   IEDQAVTD+618                                             01172000
AVTPLCBN EQU   IEDQAVTD+616                                             01173000
@NM00018 EQU   AVTSAVTP+1                                               01174000
@NM00017 EQU   AVTSAVTF                                                 01175000
AVTSNA   EQU   AVTSAVTF                                                 01176000
AVTONSNA EQU   AVTSAVTF                                                 01177000
AVTVTMCP EQU   AVTSAVTF                                                 01178000
@NM00016 EQU   IEDQAVTD+608                                             01179000
AVTCMBSS EQU   IEDQAVTD+604                                             01180000
AVTRCV   EQU   IEDQAVTD+600                                             01181000
AVTSEND  EQU   IEDQAVTD+596                                             01182000
AVTCSCH  EQU   IEDQAVTD+592                                             01183000
AVTQ1    EQU   IEDQAVTD+588                                             01184000
AVTE7    EQU   IEDQAVTD+584                                             01185000
AVTHB    EQU   IEDQAVTD+580                                             01186000
AVTR1    EQU   IEDQAVTD+576                                             01187000
AVTBZ    EQU   IEDQAVTD+572                                             01188000
AVTEZ    EQU   IEDQAVTD+568                                             01189000
AVTEC    EQU   IEDQAVTD+564                                             01190000
AVTEW    EQU   IEDQAVTD+560                                             01191000
AVTNDIAL EQU   AVTSCOPT                                                 01192000
AVTN2741 EQU   AVTSCOPT                                                 01193000
AVTCONCO EQU   AVTSCOPT                                                 01194000
AVTCONC  EQU   AVTSCOPT                                                 01195000
AVTCMBUF EQU   AVTSCOPT                                                 01196000
AVTAPDMP EQU   AVTSCOPT                                                 01197000
@NM00015 EQU   AVTSCOPT                                                 01198000
AVTHA    EQU   AVTDISP                                                  01199000
AVTEA    EQU   IEDQAVTD+548                                             01200000
AVTAX    EQU   IEDQAVTD+544                                             01201000
AVTA3    EQU   IEDQAVTD+540                                             01202000
AVTGD    EQU   IEDQAVTD+536                                             01203000
AVTAL    EQU   IEDQAVTD+532                                             01204000
AVTOLTST EQU   AVTHG02                                                  01205000
AVTE8    EQU   IEDQAVTD+524                                             01206000
AVTUI    EQU   IEDQAVTD+520                                             01207000
AVTCOMPT EQU   IEDQAVTD+516                                             01208000
AVTCRSRF EQU   IEDQAVTD+512                                             01209000
@NM00014 EQU   IEDQAVTD+508                                             01210000
AVTKA02  EQU   IEDQAVTD+504                                             01211000
AVTOPTPT EQU   IEDQAVTD+500                                             01212000
AVTPCBPT EQU   IEDQAVTD+496                                             01213000
@NM00013 EQU   AVTECB1                                                  01214000
AVTCOMP  EQU   AVTECB1                                                  01215000
@NM00012 EQU   AVTECB1                                                  01216000
AVTOPECA EQU   IEDQAVTD+488                                             01217000
AVTOLECA EQU   IEDQAVTD+484                                             01218000
AVTCKECA EQU   IEDQAVTD+480                                             01219000
AVTCWECA EQU   IEDQAVTD+476                                             01220000
AVTCWTCB EQU   IEDQAVTD+472                                             01221000
AVTOLTCB EQU   IEDQAVTD+468                                             01222000
AVTOCTCB EQU   IEDQAVTD+464                                             01223000
AVTCKTCB EQU   IEDQAVTD+460                                             01224000
AVTAS    EQU   IEDQAVTD+456                                             01225000
AVTNCKPR EQU   IEDQAVTD+453                                             01226000
AVTCIB   EQU   IEDQAVTD+452                                             01227000
AVTSPLPT EQU   IEDQAVTD+448                                             01228000
AVTMVBFR EQU   IEDQAVTD+444                                             01229000
AVTSBTA  EQU   IEDQAVTD+440                                             01230000
AVTRARTN EQU   IEDQAVTD+436                                             01231000
AVTBSCAN EQU   IEDQAVTD+432                                             01232000
AVTRDYA  EQU   IEDQAVTD+428                                             01233000
AVTRNMPT EQU   IEDQAVTD+424                                             01234000
AVTDISTR EQU   IEDQAVTD+420                                             01235000
AVTPARM3 EQU   IEDQAVTD+416                                             01236000
@NM00011 EQU   AVTPKF                                                   01237000
@NM00010 EQU   AVTPKF                                                   01238000
@NM00009 EQU   AVTPKF                                                   01239000
AVTFTCHF EQU   AVTPKF                                                   01240000
@NM00008 EQU   AVTPKF                                                   01241000
@NM00007 EQU   AVTPKF                                                   01242000
@NM00006 EQU   AVTPKF                                                   01243000
@NM00005 EQU   AVTPKF                                                   01244000
AVTPARM  EQU   IEDQAVTD+408                                             01245000
AVTEXS2A EQU   IEDQAVTD+402                                             01246000
AVTEXA2S EQU   IEDQAVTD+396                                             01247000
AVTOCGET EQU   IEDQAVTD+392                                             01248000
AVTCKAVT EQU   @NM00003+1                                               01249000
@NM00004 EQU   AVTCKFLG                                                 01250000
AVTCKHLT EQU   AVTCKFLG                                                 01251000
AVTCKREQ EQU   AVTCKFLG                                                 01252000
AVTCKENV EQU   AVTCKFLG                                                 01253000
AVTCKNAC EQU   AVTCKFLG                                                 01254000
AVTCKTAC EQU   AVTCKFLG                                                 01255000
@NM00002 EQU   IEDQAVTD+384                                             01256000
AVTREADD EQU   IEDQAVTD+380                                             01257000
AVTREADY EQU   IEDQAVTD+376                                             01258000
AVTRACE  EQU   IEDQAVTD+372                                             01259000
AVTTCB   EQU   IEDQAVTD+368                                             01260000
AVTPASWD EQU   IEDQAVTD+360                                             01261000
AVTCTLCH EQU   IEDQAVTD+352                                             01262000
AVTDOUBL EQU   IEDQAVTD+344                                             01263000
AVTDOUBX EQU   IEDQAVTD+336                                             01264000
AVTDPARM EQU   IEDQAVTD+332                                             01265000
AVTCSTCS EQU   IEDQAVTD+328                                             01266000
AVTDLQ   EQU   AVTSAVEX+32                                              01267000
@NM00001 EQU   AVTSAVEX                                                 01268000
AVTSAVE4 EQU   IEDQAVTD+216                                             01269000
AVTSAVE3 EQU   IEDQAVTD+144                                             01270000
AVTSAVE2 EQU   IEDQAVTD+72                                              01271000
AVTSAVE1 EQU   IEDQAVTD                                                 01272000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01273000
@ENDDATA EQU   *                                                        01274000
         END   IGCFK10D,(C'PLS0922',0701,77356)                         01275000
