         TITLE 'IGCFQ10D - COPY/REPLACE DEVICE SESSION INFO.           *00001000
                        '                                               00002000
IGCFQ10D CSECT ,                                                01S0001 00003000
@PROLOG  BALR  @12,0                                            01S0001 00004000
@PSTART  DS    0H                                               01S0001 00005000
         USING @PSTART,@12                                      01S0001 00006000
*                                   /*                                  00007000
IGCFQ10D IEDHJN AFTERHJN,HJN                                            00008000
*                                                               01S0462 00009000
*   /*****************************************************************/ 00010000
*   /*                                                               */ 00011000
*   /* INITIALIZATION                                                */ 00012000
*   /*                                                               */ 00013000
*   /*****************************************************************/ 00014000
*                                                               01S0462 00015000
*   ROPCAVT=RPARM;                  /* SET POINTER TO OP. CTL. AVT   */ 00016000
         LR    ROPCAVT,RPARM                                    01S0462 00017000
*   ROPCE=OPCCOPCE;                 /* SET POINTER TO CURRENT OPCE   */ 00018000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         01S0463 00019000
*   RAVT=OPCAVTPT;                  /* SET POINTER TO TCAM AVT       */ 00020000
         L     RAVT,OPCAVTPT(,ROPCAVT)                          01S0464 00021000
*   RSAVE=ADDR(OPCSAVE);            /* SET POINTER TO SAVE AREA      */ 00022000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          01S0465 00023000
*   RWRKAREA=OPCWORK;               /* OP. CTL. WORKAREA BASE - USED    00024000
*                                      FOR TEMPORARY STORAGE         */ 00025000
*                                                               01S0466 00026000
         L     RWRKAREA,OPCWORK(,ROPCAVT)                       01S0466 00027000
*   /*****************************************************************/ 00028000
*   /*                                                               */ 00029000
*   /* BASE COMPILER GENERATED DSECT (CREATED BY REENTRANT OPTION)   */ 00030000
*   /* FOR TEMPORARY STORAGE ON WORK AREA BASE.                      */ 00031000
*   /*                                                               */ 00032000
*   /*****************************************************************/ 00033000
*                                                               01S0467 00034000
*   GEN REFS(RWRKAREA);                                         01S0467 00035000
*                        /*                                             00036000
         USING @DATD,RWRKAREA    */                                     00037000
*   FLAGS=''B;                      /* INIT FLAGS FIELD              */ 00038000
*                                                               01S0468 00039000
         MVI   FLAGS,X'00'                                      01S0468 00040000
*   /*****************************************************************/ 00041000
*   /*                                                               */ 00042000
*   /* CALCULATE 50% OF TCAM'S LINE UNITS                            */ 00043000
*   /*                                                               */ 00044000
*   /*****************************************************************/ 00045000
*                                                               01S0469 00046000
*   HALFUNIT=AVTNOLBF;              /* # OF TCAM'S LINE UNITS        */ 00047000
         LH    @14,AVTNOLBF(,RAVT)                              01S0469 00048000
         STH   @14,HALFUNIT                                     01S0469 00049000
*   SRL(HALFUNIT,1);                /* DIVIDE BY TWO FOR 50%         */ 00050000
*                                                               01S0470 00051000
         SRL   @14,1                                            01S0470 00052000
         STH   @14,HALFUNIT                                     01S0470 00053000
*   /*****************************************************************/ 00054000
*   /*                                                               */ 00055000
*   /* OBTAIN ADDR. OF NEG. PREFIX OF ORIG. OPCE                     */ 00056000
*   /*                                                               */ 00057000
*   /*****************************************************************/ 00058000
*                                                               01S0471 00059000
*   ORGNOPCE=OCPTRSAV-LENGTH(IEDQOPCN);/* OBTAIN THE ADDR. OF THE       00060000
*                                      START OF THE NEG. PREFIX IN      00061000
*                                      THE ORIG. OPCE                */ 00062000
         L     ORGNOPCE,OCPTRSAV(,ROPCE)                        01S0471 00063000
         SH    ORGNOPCE,@CH00045                                01S0471 00064000
*                                                               01S0472 00065000
*   /*****************************************************************/ 00066000
*   /*                                                               */ 00067000
*   /* MAIN PROCDURE                                                 */ 00068000
*   /*                                                               */ 00069000
*   /*****************************************************************/ 00070000
*                                                               01S0472 00071000
*   IF OCREDRVE=ON THEN             /* IF THIS IS A REDRIVE OPCE     */ 00072000
*                                                               01S0472 00073000
         TM    OCREDRVE(ROPCE),B'00010000'                      01S0472 00074000
         BNO   @RF00472                                         01S0472 00075000
*     /***************************************************************/ 00076000
*     /*                                                             */ 00077000
*     /* THIS IS A REDRIVE OPCE WITH ATTACHED UNITS.                 */ 00078000
*     /*                                                             */ 00079000
*     /***************************************************************/ 00080000
*                                                               01S0473 00081000
*     CALL REDRIVE;                                             01S0473 00082000
         BAL   @14,REDRIVE                                      01S0473 00083000
*   ELSE                                                        01S0474 00084000
*     DO;                                                       01S0474 00085000
*                                                               01S0474 00086000
         B     @RC00472                                         01S0474 00087000
@RF00472 DS    0H                                               01S0475 00088000
*       /*************************************************************/ 00089000
*       /*                                                           */ 00090000
*       /* THIS IS A RESPONSE OPCE OR A REQUEST FROM IGCFL10D.       */ 00091000
*       /*                                                           */ 00092000
*       /*************************************************************/ 00093000
*                                                               01S0475 00094000
*       ORGNOPCE->OCRESPCT=ORGNOPCE->OCRESPCT-1;/* DECREMENT RSP. CT.*/ 00095000
         SLR   @14,@14                                          01S0475 00096000
         ICM   @14,3,OCRESPCT(ORGNOPCE)                         01S0475 00097000
         BCTR  @14,0                                            01S0475 00098000
         STH   @14,OCRESPCT(,ORGNOPCE)                          01S0475 00099000
*                                                               02S0476 00100000
*       /*************************************************************/ 00101000
*       /*                                                           */ 00102000
*       /* ---------- THIS SEGMENT PROCESSES RESPONSES --------      */ 00103000
*       /*                                                           */ 00104000
*       /*************************************************************/ 00105000
*                                                               02S0476 00106000
*       IF OCSWITCH=OCRPLDSI THEN   /* IF REPLACE RESPONSE           */ 00107000
         CLI   OCSWITCH(ROPCE),X'E4'                            02S0476 00108000
         BNE   @RF00476                                         02S0476 00109000
*         FREUTFLG=ON;              /* SET FLAG TO FREE UNITS        */ 00110000
         OI    FREUTFLG,B'10000000'                             02S0477 00111000
*       ELSE                                                    02S0478 00112000
*         IF OCSWITCH=OCOPYDSI THEN /* IF COPY RESPONSE              */ 00113000
         B     @RC00476                                         02S0478 00114000
@RF00476 CLI   OCSWITCH(ROPCE),X'E3'                            02S0478 00115000
         BNE   @RF00478                                         02S0478 00116000
*           DO;                                                 02S0479 00117000
*                                                               02S0479 00118000
*             /*******************************************************/ 00119000
*             /*                                                     */ 00120000
*             /* DETERMINE IF REPLACE SHOULD BE DONE.                */ 00121000
*             /*                                                     */ 00122000
*             /*******************************************************/ 00123000
*                                                               02S0480 00124000
*                                                               03S0480 00125000
*             /*******************************************************/ 00126000
*             /*                                                     */ 00127000
*             /* --- THIS SEGMENT PROCESSES "COPY DEVICE SESSION     */ 00128000
*             /* INFO." RESPONSES                                    */ 00129000
*             /*                                                     */ 00130000
*             /*******************************************************/ 00131000
*                                                               03S0480 00132000
*             RFY                                               03S0480 00133000
*               IEDDSI1 BASED(ADDR(PRUDATA)+LENGTH(IEDBDU));    03S0480 00134000
*             RFY                                               03S0481 00135000
*               IEDQTRM BASED(RPARM);                           03S0481 00136000
*             IF BDUSYRSP=GOODRSP THEN/* IF GOOD RESPONSE ON COPY    */ 00137000
         L     @14,OCUNIT(,ROPCE)                               03S0482 00138000
         CLI   BDUSYRSP+12(@14),X'60'                           03S0482 00139000
         BNE   @RF00482                                         03S0482 00140000
*               DO;                                             03S0483 00141000
*                 RPARM=OCTRMTBL;   /* OBTAIN TTE .....              */ 00142000
         SLR   RPARM,RPARM                                      03S0484 00143000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                          03S0484 00144000
*                 CALL IEDQTNT;     /* .... ADDR.                    */ 00145000
         L     @15,AVTRNMPT(,RAVT)                              03S0485 00146000
         BALR  @14,@15                                          03S0485 00147000
*                 RZERO=TRMDDIGA;   /* OBTAIN ADDR. .....            */ 00148000
         LH    RZERO,@CH01535                                   03S0486 00149000
*                 CALL IEDQTL;      /* .... OF DEVICE DEPENDENT FIELD*/ 00150000
         L     @15,AVTDDFT(,RAVT)                               03S0487 00151000
         BALR  @14,@15                                          03S0487 00152000
*                 DEVDPADR=RTNCODE; /* ADDR. OF DIAL DIGITS FIELD    */ 00153000
         LR    DEVDPADR,RTNCODE                                 03S0488 00154000
*                                                               04S0489 00155000
*                 /***************************************************/ 00156000
*                 /*                                                 */ 00157000
*                 /* ------ PLACE RU DIAL DATA IN CONTIGUOUS STORAGE */ 00158000
*                 /* IN OP. CTL. WORK AREA. SAVE POINTERS TO THE UNIT*/ 00159000
*                 /* ADDR. AND STARTING ADDR. OF DIAL DATA IN RU FOR */ 00160000
*                 /* MOVE BACK.-------                               */ 00161000
*                 /*                                                 */ 00162000
*                 /***************************************************/ 00163000
*                                                               04S0489 00164000
*                 RFY                                           04S0489 00165000
*                   IEDDSI1 BASED(PLMVSD);/* BASE ON PARM LIST SOURCE   00166000
*                                      DATA                          */ 00167000
*                 RFY                                           04S0490 00168000
*                   IEDDSI2 BASED(PLMVSD);/* ADDR.                   */ 00169000
*                 RFY                                           04S0491 00170000
*                   IEDDSI3 BASED(PLMVSD);                      04S0491 00171000
*                 RFY                                           04S0492 00172000
*                   IEDDSI4 BASED(PLMVSD);                      04S0492 00173000
*                                                               04S0492 00174000
*                 /***************************************************/ 00175000
*                 /*                                                 */ 00176000
*                 /* INIT. PARM. LIST FOR IEDMVBFR. THIS ROUTINE IS  */ 00177000
*                 /* USED TO FIND ADDR. OF DIAL DATA BY MOVING BYTES */ 00178000
*                 /* INTO THEMSELVES THUS MOVING POINTER.            */ 00179000
*                 /*                                                 */ 00180000
*                 /***************************************************/ 00181000
*                                                               04S0493 00182000
*                 IEDPLMV=''B;      /* CLEAR PARM. LIST AREA         */ 00183000
         LA    @14,PARMLSP                                      04S0493 00184000
         XC    IEDPLMV(24,@14),IEDPLMV(@14)                     04S0493 00185000
*                 PLMVSU=OCUNIT;    /* SOURCE UNIT ADDR.             */ 00186000
         L     @05,OCUNIT(,ROPCE)                               04S0494 00187000
         ST    @05,PLMVSU(,@14)                                 04S0494 00188000
*                 PLMVTU=OCUNIT;    /* TARGET UNIT ADDR.             */ 00189000
         ST    @05,PLMVTU(,@14)                                 04S0495 00190000
*                 PLMVSD=ADDR(PRUDATA)+LENGTH(IEDBDU);/* SOURCE DATA    00191000
*                                      ADDR.                         */ 00192000
         LA    @05,PRUDATA(,@05)                                04S0496 00193000
         AH    @05,@CH00071                                     04S0496 00194000
         ST    @05,PLMVSD(,@14)                                 04S0496 00195000
*                 PLMVTD=ADDR(PRUDATA)+LENGTH(IEDBDU);/* TARGET DATA    00196000
*                                      ADDR.                         */ 00197000
         ST    @05,PLMVTD(,@14)                                 04S0497 00198000
*                 PLMVLNTH=DSIPOLNM+LENGTH(IEDDSI1);/* NUMBER OF        00199000
*                                      POLLING CHARACTERS            */ 00200000
*                                                               04S0498 00201000
         LA    @07,4                                            04S0498 00202000
         SLR   @06,@06                                          04S0498 00203000
         IC    @06,DSIPOLNM(,@05)                               04S0498 00204000
         ALR   @07,@06                                          04S0498 00205000
         STH   @07,PLMVLNTH(,@14)                               04S0498 00206000
*                 /***************************************************/ 00207000
*                 /*                                                 */ 00208000
*                 /* LOCATE START OF ADDR. CHARS. FIELD              */ 00209000
*                 /*                                                 */ 00210000
*                 /***************************************************/ 00211000
*                                                               04S0499 00212000
*                 RPARM=ADDR(PARMLSP);/* ADDR. OF PARM LIST  @YM05982*/ 00213000
         LR    RPARM,@14                                        04S0499 00214000
*                 CALL IEDMVBFR;                                04S0500 00215000
         L     @05,AVTSAVTP(,RAVT)                              04S0500 00216000
         L     @15,SAVTMVBF(,@05)                               04S0500 00217000
         BALR  @14,@15                                          04S0500 00218000
*                 PLMVLNTH=DSIADRNM+LENGTH(IEDDSI2);/* NUMBER OF        00219000
*                                      ADDRESSING CHARACTERS         */ 00220000
*                                                               04S0501 00221000
         LA    @14,PARMLSP                                      04S0501 00222000
         L     @05,PLMVSD(,@14)                                 04S0501 00223000
         LA    @07,1                                            04S0501 00224000
         SLR   @06,@06                                          04S0501 00225000
         IC    @06,DSIADRNM(,@05)                               04S0501 00226000
         ALR   @07,@06                                          04S0501 00227000
         STH   @07,PLMVLNTH(,@14)                               04S0501 00228000
*                 /***************************************************/ 00229000
*                 /*                                                 */ 00230000
*                 /* LOCATE INPUT IDENTIFIER FIELD.                  */ 00231000
*                 /*                                                 */ 00232000
*                 /***************************************************/ 00233000
*                                                               04S0502 00234000
*                 CALL IEDMVBFR;                                04S0502 00235000
*                                                               04S0502 00236000
         L     @05,AVTSAVTP(,RAVT)                              04S0502 00237000
         L     @15,SAVTMVBF(,@05)                               04S0502 00238000
         BALR  @14,@15                                          04S0502 00239000
*                 /***************************************************/ 00240000
*                 /*                                                 */ 00241000
*                 /* IF INPUT ID IS 0 REMAINING FIELDS IN IEDDSI3 ARE*/ 00242000
*                 /* NOT PRESENT                                     */ 00243000
*                 /*                                                 */ 00244000
*                 /***************************************************/ 00245000
*                                                               04S0503 00246000
*                 IF DSINPTID='00'X THEN/* IF 0                      */ 00247000
         LA    @14,PARMLSP                                      04S0503 00248000
         L     @14,PLMVSD(,@14)                                 04S0503 00249000
         CLI   DSINPTID(@14),X'00'                              04S0503 00250000
         BNE   @RF00503                                         04S0503 00251000
*                   FREUTFLG=ON;    /* THEN SET FLAG         @YM07670*/ 00252000
         OI    FREUTFLG,B'10000000'                             04S0504 00253000
*                 ELSE                                          04S0505 00254000
*                   DO;             /*                       @YM07430*/ 00255000
         B     @RC00503                                         04S0505 00256000
@RF00503 DS    0H                                               04S0506 00257000
*                     PLMVLNTH=LENGTH(IEDDSI3);/* MOVE LENGTH OF        00258000
*                                      IEDDSI3                       */ 00259000
*                                                               04S0506 00260000
         LA    @14,PARMLSP                                      04S0506 00261000
         MVC   PLMVLNTH(2,@14),@CH00331                         04S0506 00262000
*                     /***********************************************/ 00263000
*                     /*                                             */ 00264000
*                     /* LOCATE BEGINNING OF DIAL DATA FIELDS        */ 00265000
*                     /*                                             */ 00266000
*                     /***********************************************/ 00267000
*                                                               04S0507 00268000
*                     CALL IEDMVBFR;                            04S0507 00269000
*                                                               04S0507 00270000
         L     @05,AVTSAVTP(,RAVT)                              04S0507 00271000
         L     @15,SAVTMVBF(,@05)                               04S0507 00272000
         BALR  @14,@15                                          04S0507 00273000
*                     /***********************************************/ 00274000
*                     /*                                             */ 00275000
*                     /* SAVE POINTERS FOR UNIT AND START OF DIAL    */ 00276000
*                     /* DATA                                        */ 00277000
*                     /*                                             */ 00278000
*                     /***********************************************/ 00279000
*                                                               04S0508 00280000
*                     UNITSAVE=PLMVTU;                          04S0508 00281000
         LA    @14,PARMLSP                                      04S0508 00282000
         MVC   UNITSAVE(4),PLMVTU(@14)                          04S0508 00283000
*                     DATASAVE=PLMVTD;                          04S0509 00284000
*                                                               04S0509 00285000
         MVC   DATASAVE(4),PLMVTD(@14)                          04S0509 00286000
*                     /***********************************************/ 00287000
*                     /*                                             */ 00288000
*                     /* MOVE DIAL DATA INTO CONTIGUOUS STORAGE IN   */ 00289000
*                     /* WORK AREA.                                  */ 00290000
*                     /*                                             */ 00291000
*                     /***********************************************/ 00292000
*                                                               04S0510 00293000
*                     PLMVTU=ADDR(DIALDATA);/* ADDR. IN WRK AREA     */ 00294000
         LA    @05,DIALSP                                       04S0510 00295000
         ST    @05,PLMVTU(,@14)                                 04S0510 00296000
*                     PLMVTD=ADDR(DIALDATA);/* ADDR. IN WRK AREA     */ 00297000
         ST    @05,PLMVTD(,@14)                                 04S0511 00298000
*                     PLMVTCTG=ON;  /* FLAG FOR CONTIGUOUS TARGET    */ 00299000
         OI    PLMVTCTG(@14),B'00100000'                        04S0512 00300000
*                     PLMVLNTH=DSIDLCNT+LENCTFLD;/* LENGTH OF DIAL      00301000
*                                      DATA                          */ 00302000
         L     @05,PLMVSD(,@14)                                 04S0513 00303000
         LA    @07,1                                            04S0513 00304000
         SLR   @06,@06                                          04S0513 00305000
         IC    @06,DSIDLCNT(,@05)                               04S0513 00306000
         ALR   @07,@06                                          04S0513 00307000
         STH   @07,PLMVLNTH(,@14)                               04S0513 00308000
*                     CALL IEDMVBFR;                            04S0514 00309000
         L     @05,AVTSAVTP(,RAVT)                              04S0514 00310000
         L     @15,SAVTMVBF(,@05)                               04S0514 00311000
         BALR  @14,@15                                          04S0514 00312000
*                     RFY                                       04S0515 00313000
*                       IEDDSI1 BASED(ADDR(PRUDATA)+LENGTH(IEDBDU));    00314000
*                                   /* RESET BASE FOR START OF DATA     00315000
*                                      RECORD                        */ 00316000
*                   END;            /*                       @YM07430*/ 00317000
*                                   /* ... WORK AREA FOR EASY   03S0517 00318000
*                                      HANDLING ADDR. OF DIAL FIELD     00319000
*                                      IN RU PLACED IN RUDIALAD      */ 00320000
*                 IF FREUTFLG=OFF THEN/*                     @YM07670*/ 00321000
@RC00503 TM    FREUTFLG,B'10000000'                             03S0517 00322000
         BNZ   @RF00517                                         03S0517 00323000
*                   DO;             /*                       @YM07430*/ 00324000
*                     IF TTEDIALN>MAXIMUM THEN/* IF TTE DIAL DATA >     00325000
*                                      MAX. ALLOWED                  */ 00326000
         LA    @14,DIALSP                                       03S0519 00327000
         CLC   TTEDIALN(1,DEVDPADR),MAXIMUM(@14)                03S0519 00328000
         BNH   @RF00519                                         03S0519 00329000
*                       FREUTFLG=ON;/* SET TO FREE OPCE AND RU       */ 00330000
         OI    FREUTFLG,B'10000000'                             03S0520 00331000
*                     ELSE                                      03S0521 00332000
*                                                               03S0521 00333000
*                       /*********************************************/ 00334000
*                       /*                                           */ 00335000
*                       /* REPLACE CAN BE DONE IF DIAL DIGITS DO NOT */ 00336000
*                       /* MATCH.                                    */ 00337000
*                       /*                                           */ 00338000
*                       /*********************************************/ 00339000
*                                                               03S0521 00340000
*                       IF TTEDIALN=ACTUAL THEN/* IF NUMBER OF TTE      00341000
*                                      DIAL DIGITS IS SAME AS NO. OF    00342000
*                                      RU DIGITS                     */ 00343000
         B     @RC00519                                         03S0521 00344000
@RF00519 LA    @14,DIALSP                                       03S0521 00345000
         CLC   TTEDIALN(1,DEVDPADR),ACTUAL(@14)                 03S0521 00346000
         BNE   @RF00521                                         03S0521 00347000
*                         DO;       /* CONVERT NCP'S DIGITS TO BINARY   00348000
*                                      AND COMPARE WITH TCAM'S  03S0522 00349000
*                                                            @YM06517*/ 00350000
*                           DIGITS(1:1)=DIGITS(1:1)&CLEARHI;/*  03S0523 00351000
*                                      CONVERT FIRST BYTE    @YM06517*/ 00352000
         NI    DIGITS(@14),X'0F'                                03S0523 00353000
*                           IF ACTUAL>1 THEN/* IF MORE THAN 1 DIGIT     00354000
*                                                            @YM06875*/ 00355000
         CLI   ACTUAL(@14),1                                    03S0524 00356000
         BNH   @RF00524                                         03S0524 00357000
*                             MVZ(DIGITS(2:ACTUAL),DIGITS(1:ACTUAL-1)); 00358000
         LA    @05,DIALSP                                       03S0525 00359000
         SLR   @07,@07                                          03S0525 00360000
         IC    @07,ACTUAL(,@05)                                 03S0525 00361000
         BCTR  @07,0                                            03S0525 00362000
         BCTR  @07,0                                            03S0525 00363000
         EX    @07,@SB01711                                     03S0525 00364000
*                                   /* CONVERT REST OF DIGITS   03S0526 00365000
*                                                            @YM06517*/ 00366000
*                           ELSE                                03S0526 00367000
*                             ;     /*                       @YM06875*/ 00368000
@RF00524 DS    0H                                               03S0527 00369000
*                           IF TTEDIALD(1:TTEDIALN)=DIGITS(1:TTEDIALN)  00370000
*                             THEN  /* IF MATCH                      */ 00371000
         LA    @14,DIALSP                                       03S0527 00372000
         SLR   @05,@05                                          03S0527 00373000
         IC    @05,TTEDIALN(,DEVDPADR)                          03S0527 00374000
         BCTR  @05,0                                            03S0527 00375000
         EX    @05,@SC01713                                     03S0527 00376000
         BNE   @RF00527                                         03S0527 00377000
*                             FREUTFLG=ON;/* REPLACE DOES NOT NEED TO   00378000
*                                      BE DONE - FREE OPCE AND RU    */ 00379000
         OI    FREUTFLG,B'10000000'                             03S0528 00380000
*                           ELSE                                03S0529 00381000
*                             BLRPLFLG=ON;/* SET FLAG TO BUILD  03S0529 00382000
*                                      REPLACE                       */ 00383000
         B     @RC00527                                         03S0529 00384000
@RF00527 OI    BLRPLFLG,B'01000000'                             03S0529 00385000
*                         END;      /*                       @YM06517*/ 00386000
*                       ELSE                                    03S0531 00387000
*                         DO;                                   03S0531 00388000
         B     @RC00521                                         03S0531 00389000
@RF00521 DS    0H                                               03S0532 00390000
*                           RFY                                 03S0532 00391000
*                             RTNCODE UNRSTD;                   03S0532 00392000
*                           RFY                                 03S0533 00393000
*                             IEDPRUQD BASED(UNITSAVE);         03S0533 00394000
*                           RFY                                 03S0534 00395000
*                             TICFLD BASED(ADDR(PRUTIC));       03S0534 00396000
*                                                               03S0534 00397000
*                           /*****************************************/ 00398000
*                           /*                                       */ 00399000
*                           /* IF THE NUMBER OF DIAL DIGITS IN THE   */ 00400000
*                           /* TTE IS TOO LARGE FOR CURRENT RU, GET  */ 00401000
*                           /* ANOTHER UNIT.                         */ 00402000
*                           /*                                       */ 00403000
*                           /*****************************************/ 00404000
*                                                               03S0535 00405000
*                           IF TIC^=VALTIC THEN/* IF START OF DIAL      00406000
*                                      DATA IS IN THE LAST UNIT      */ 00407000
         L     @05,UNITSAVE                                     03S0535 00408000
         TM    TIC+8(@05),B'00000011'                           03S0535 00409000
         BZ    @RF00535                                         03S0535 00410000
*                             IF(DATASAVE-UNITSAVE)+(COUNT+1)+(TTEDIALN 00411000
*                                 -ACTUAL)>(AVTKEYLE+12) THEN/* IS      00412000
*                                      ANOTHER UNIT NEEDED           */ 00413000
         LCR   @05,@05                                          03S0536 00414000
         AL    @05,DATASAVE                                     03S0536 00415000
         LA    @15,1                                            03S0536 00416000
         LA    @14,DIALSP                                       03S0536 00417000
         SLR   @07,@07                                          03S0536 00418000
         IC    @07,COUNT(,@14)                                  03S0536 00419000
         ALR   @07,@15                                          03S0536 00420000
         ALR   @05,@07                                          03S0536 00421000
         SLR   @07,@07                                          03S0536 00422000
         IC    @07,TTEDIALN(,DEVDPADR)                          03S0536 00423000
         SLR   @06,@06                                          03S0536 00424000
         IC    @06,ACTUAL(,@14)                                 03S0536 00425000
         SLR   @07,@06                                          03S0536 00426000
         ALR   @05,@07                                          03S0536 00427000
         LA    @14,12                                           03S0536 00428000
         AH    @14,AVTKEYLE(,RAVT)                              03S0536 00429000
         CR    @05,@14                                          03S0536 00430000
         BNH   @RF00536                                         03S0536 00431000
*                               DO;                             03S0537 00432000
*                                 RPARM=1;/* GET ANOTHER ....        */ 00433000
         LR    RPARM,@15                                        03S0538 00434000
*                                 CALL ALLOCBUF;/* .... UNIT         */ 00435000
         L     @15,OPCGETBF(,ROPCAVT)                           03S0539 00436000
         BALR  @14,@15                                          03S0539 00437000
*                                 PRUNUNIT=RPARM;/* SET TIC FIELD OF    00438000
*                                      LAST UNIT TO POINT TO NEW UNIT*/ 00439000
         L     @05,UNITSAVE                                     03S0540 00440000
         STCM  RPARM,7,PRUNUNIT(@05)                            03S0540 00441000
*                               END;                            03S0541 00442000
*                             ELSE                              03S0542 00443000
*                               ;                               03S0542 00444000
@RF00536 DS    0H                                               03S0543 00445000
*                           ELSE                                03S0543 00446000
*                             ;                                 03S0543 00447000
@RF00535 DS    0H                                               03S0544 00448000
*                           RFY                                 03S0544 00449000
*                             TICFLD BASED;                     03S0544 00450000
*                           RFY                                 03S0545 00451000
*                             IEDPRUQD BASED(OCUNIT);           03S0545 00452000
*                                                               03S0545 00453000
*                           /*****************************************/ 00454000
*                           /*                                       */ 00455000
*                           /* RESET COUNT FIELDS FOR PACKED RU AND  */ 00456000
*                           /* GO BUILD REPLACE DSI                  */ 00457000
*                           /*                                       */ 00458000
*                           /*****************************************/ 00459000
*                                                               03S0546 00460000
*                           PRUDATCT=PRUDATCT+(TTEDIALN-ACTUAL);/*      00461000
*                                      DATA COUNT IN PACKED RU       */ 00462000
         L     @05,OCUNIT(,ROPCE)                               03S0546 00463000
         LA    @15,DIALSP                                       03S0546 00464000
         SLR   @14,@14                                          03S0546 00465000
         IC    @14,TTEDIALN(,DEVDPADR)                          03S0546 00466000
         SLR   @07,@07                                          03S0546 00467000
         IC    @07,ACTUAL(,@15)                                 03S0546 00468000
         SLR   @14,@07                                          03S0546 00469000
         LH    @07,PRUDATCT(,@05)                               03S0546 00470000
         ALR   @07,@14                                          03S0546 00471000
         STH   @07,PRUDATCT(,@05)                               03S0546 00472000
*                           DSITOTNM=DSITOTNM+(TTEDIALN-ACTUAL);/*      00473000
*                                      COUNT IN DATA RECORD          */ 00474000
         LA    @05,PRUDATA(,@05)                                03S0547 00475000
         AH    @05,@CH00071                                     03S0547 00476000
         SLR   @07,@07                                          03S0547 00477000
         IC    @07,DSITOTNM(,@05)                               03S0547 00478000
         ALR   @07,@14                                          03S0547 00479000
         STC   @07,DSITOTNM(,@05)                               03S0547 00480000
*                           COUNT=COUNT+(TTEDIALN-ACTUAL);/* DIAL       00481000
*                                      DATA COUNT FIELD IN WRK AREA  */ 00482000
         SLR   @05,@05                                          03S0548 00483000
         IC    @05,COUNT(,@15)                                  03S0548 00484000
         ALR   @14,@05                                          03S0548 00485000
         STC   @14,COUNT(,@15)                                  03S0548 00486000
*                           BLRPLFLG=ON;/* SET FLAG TO BUILD REPLACE */ 00487000
         OI    BLRPLFLG,B'01000000'                             03S0549 00488000
*                           RFY                                 03S0550 00489000
*                             RTNCODE RSTD;                     03S0550 00490000
*                         END;                                  03S0551 00491000
*                   END;            /*                       @YM07430*/ 00492000
*                 ELSE                                          03S0553 00493000
*                   ;               /*                       @YM07430*/ 00494000
@RF00517 DS    0H                                               03S0554 00495000
*               END;                                            03S0554 00496000
*             ELSE                                              03S0555 00497000
*               FREUTFLG=ON;        /* FREE OPCE AND RU              */ 00498000
         B     @RC00482                                         03S0555 00499000
@RF00482 OI    FREUTFLG,B'10000000'                             03S0555 00500000
*             IF BLRPLFLG=ON THEN   /* IF FLAG INDICATING REPLACE TO    00501000
*                                      BE BUILT                      */ 00502000
@RC00482 TM    BLRPLFLG,B'01000000'                             03S0556 00503000
         BNO   @RF00556                                         03S0556 00504000
*               DO;                                             03S0557 00505000
*                                                               04S0558 00506000
*                 /***************************************************/ 00507000
*                 /*                                                 */ 00508000
*                 /* --- THIS SEGMENT BUILDS REPLACE DEV. SESSION    */ 00509000
*                 /* INFO. OPCE- PACKED RU PAIRS ----                */ 00510000
*                 /*                                                 */ 00511000
*                 /***************************************************/ 00512000
*                                                               04S0558 00513000
*                 TRMTBLSV=OCTRMTBL;/* SAVE OCTRMTBL                 */ 00514000
         SLR   TRMTBLSV,TRMTBLSV                                04S0558 00515000
         ICM   TRMTBLSV,3,OCTRMTBL(ROPCE)                       04S0558 00516000
*                 PTRSAVSV=OCPTRSAV;/* SAVE                          */ 00517000
         L     @14,OCPTRSAV(,ROPCE)                             04S0559 00518000
         ST    @14,PTRSAVSV                                     04S0559 00519000
*                 UNITSV=OCUNIT;    /* SAVE                          */ 00520000
         L     @07,OCUNIT(,ROPCE)                               04S0560 00521000
         ST    @07,UNITSV                                       04S0560 00522000
*                 IEDQOPCN=''B;     /* CLEAR NEG. PREFIX             */ 00523000
         LA    @05,8                                            04S0561 00524000
         LR    @14,ROPCE                                        04S0561 00525000
         SLR   @14,@05                                          04S0561 00526000
         XC    IEDQOPCN(8,@14),IEDQOPCN(@14)                    04S0561 00527000
*                 IEDQOPCE=''B;     /* CLEAR OPCE                    */ 00528000
         XC    IEDQOPCE(56,ROPCE),IEDQOPCE(ROPCE)               04S0562 00529000
*                 OCTRMTBL=TRMTBLSV;/* RESOURCE TTCIN                */ 00530000
         STH   TRMTBLSV,OCTRMTBL(,ROPCE)                        04S0563 00531000
*                 OCPTRSAV=PTRSAVSV;/* POINTER TO ORIG OPCE          */ 00532000
         L     @14,PTRSAVSV                                     04S0564 00533000
         ST    @14,OCPTRSAV(,ROPCE)                             04S0564 00534000
*                 OCUNIT=UNITSV;    /* POINTER TO ATTACHED PACKED RU */ 00535000
         ST    @07,OCUNIT(,ROPCE)                               04S0565 00536000
*                 OCSWITCH=OCRPLDSI;/* REPLACE CMND.                 */ 00537000
         MVI   OCSWITCH(ROPCE),X'E4'                            04S0566 00538000
*                 OCELMPRI=PRIMEDFG;                            04S0567 00539000
         MVI   OCELMPRI(ROPCE),X'DF'                            04S0567 00540000
*                 OCPRIFLG=OPR02;                               04S0568 00541000
         MVI   OCPRIFLG(ROPCE),X'08'                            04S0568 00542000
*                 OCWTG=THISMOD;    /* SET TO RETURN TO THIS MODULE  */ 00543000
         MVC   OCWTG(2,ROPCE),THISMOD                           04S0569 00544000
*                 OCACTREQ=ON;      /* SET FOR ACTIVATE REQUEST      */ 00545000
         OI    OCACTREQ(ROPCE),B'00001000'                      04S0570 00546000
*                 PRUTTCIN=OCTRMTBL;/* COPY DEVICE TTCIN     @YM06512*/ 00547000
         SLR   @14,@14                                          04S0571 00548000
         ICM   @14,3,OCTRMTBL(ROPCE)                            04S0571 00549000
         STH   @14,PRUTTCIN(,@07)                               04S0571 00550000
*                 PRURHTH(1:3)=TRHFID0;/* SET FID0 RH FLAGS          */ 00551000
         LCR   @05,@05                                          04S0572 00552000
         ALR   @05,@07                                          04S0572 00553000
         MVC   PRURHTH(3,@05),@CB01378                          04S0572 00554000
*                 PRURHTH(4:4)=TTH0BYT0;/* SET FID0 TH FLAGS         */ 00555000
         MVI   PRURHTH+3(@05),X'0C'                             04S0573 00556000
*                 BDUMODIF=CD0CRDSI;/* BDU MODIFIER FOR "REPLACE"    */ 00557000
         AH    @07,@CH00239                                     04S0574 00558000
         MVI   BDUMODIF(@07),X'22'                              04S0574 00559000
*                 BDUFNFLG=''B;     /* CLEAR FUNCTION FLAGS          */ 00560000
         MVI   BDUFNFLG(@07),X'00'                              04S0575 00561000
*                 BDUHEADR=ON;      /* SET HEADER FLAG       @YM06147*/ 00562000
         OI    BDUHEADR(@07),B'01000000'                        04S0576 00563000
*                 BDUBDUFG=''B;     /* CLEAR BDU FLAGS               */ 00564000
         MVI   BDUBDUFG(@07),X'00'                              04S0577 00565000
*                 BDUSYRSP=''B;     /* CLEAR SYSTEM RESPONSE         */ 00566000
         MVI   BDUSYRSP(@07),X'00'                              04S0578 00567000
*                 BDUEXRSP=''B;     /* CLEAR EXTENDED RESPONSE       */ 00568000
         MVI   BDUEXRSP(@07),X'00'                              04S0579 00569000
*                 TTEDIALR(1:TTEDIALN+1)=TTEDIAL(1:TTEDIALN+1);/*       00570000
*                                      MOVE DIAL DIGITS AND LENGTH      00571000
*                                      INTO WORK AREA                */ 00572000
         LA    @14,DIALSP                                       04S0580 00573000
         SLR   @05,@05                                          04S0580 00574000
         IC    @05,TTEDIALN(,DEVDPADR)                          04S0580 00575000
         EX    @05,@SM01717                                     04S0580 00576000
*                 DIGITS(1:1)=DIGITS(1:1)|SETHI;/* CONVERT DIGIT TO     00577000
*                                      EBCDIC                @YM06517*/ 00578000
         OI    DIGITS(@14),X'F0'                                04S0581 00579000
*                 IF ACTUAL>1 THEN  /* IF MORE THAN 1 DIGIT  @YM06875*/ 00580000
         CLI   ACTUAL(@14),1                                    04S0582 00581000
         BNH   @RF00582                                         04S0582 00582000
*                   MVZ(DIGITS(2:ACTUAL),DIGITS(1:ACTUAL-1));/* 04S0583 00583000
*                                      CONVERT REST TO EBCDIC @YM6517*/ 00584000
         LA    @09,DIALSP                                       04S0583 00585000
         SLR   @05,@05                                          04S0583 00586000
         IC    @05,ACTUAL(,@09)                                 04S0583 00587000
         BCTR  @05,0                                            04S0583 00588000
         BCTR  @05,0                                            04S0583 00589000
         EX    @05,@SB01711                                     04S0583 00590000
*                 ELSE                                          04S0584 00591000
*                   ;               /*                       @YM06875*/ 00592000
@RF00582 DS    0H                                               04S0585 00593000
*                 IEDPLMV=''B;      /* CLEAR IEDMVBFR PARM. LIST     */ 00594000
         LA    @14,PARMLSP                                      04S0585 00595000
         XC    IEDPLMV(24,@14),IEDPLMV(@14)                     04S0585 00596000
*                 PLMVTU=UNITSAVE;  /* UNIT WHERE RU DIAL DATA STARTS*/ 00597000
         MVC   PLMVTU(4,@14),UNITSAVE                           04S0586 00598000
*                 PLMVTD=DATASAVE;  /* ADDR. OF DIAL DATA IN RU      */ 00599000
         MVC   PLMVTD(4,@14),DATASAVE                           04S0587 00600000
*                 PLMVSU=ADDR(DIALDATA);/* ADDR. OF DIAL DATA IN WRK    00601000
*                                      AREA                          */ 00602000
         LA    @09,DIALSP                                       04S0588 00603000
         ST    @09,PLMVSU(,@14)                                 04S0588 00604000
*                 PLMVSD=ADDR(DIALDATA);/* DUPLICATE                 */ 00605000
         ST    @09,PLMVSD(,@14)                                 04S0589 00606000
*                 PLMVLNTH=COUNT+1; /* NO. BYTES TO MOVE             */ 00607000
         LA    @05,1                                            04S0590 00608000
         SLR   @07,@07                                          04S0590 00609000
         IC    @07,COUNT(,@09)                                  04S0590 00610000
         ALR   @05,@07                                          04S0590 00611000
         STH   @05,PLMVLNTH(,@14)                               04S0590 00612000
*                 PLMVSCTG=ON;      /* 'SOURCE CONTIGUOUS' FLAG      */ 00613000
         OI    PLMVSCTG(@14),B'01000000'                        04S0591 00614000
*                 RPARM=ADDR(PARMLSP);/* ADDR OF PARM LIST   @YM05982*/ 00615000
         LR    RPARM,@14                                        04S0592 00616000
*                 CALL IEDMVBFR;    /* MOVE NEW DIAL DATA INTO RU    */ 00617000
         L     @09,AVTSAVTP(,RAVT)                              04S0593 00618000
         L     @15,SAVTMVBF(,@09)                               04S0593 00619000
         BALR  @14,@15                                          04S0593 00620000
*                 ORGNOPCE->OCRESPCT=ORGNOPCE->OCRESPCT+1;/* UPDATE     00621000
*                                      RESPONSE COUNT                */ 00622000
         LA    @14,1                                            04S0594 00623000
         SLR   @09,@09                                          04S0594 00624000
         ICM   @09,3,OCRESPCT(ORGNOPCE)                         04S0594 00625000
         ALR   @14,@09                                          04S0594 00626000
         STH   @14,OCRESPCT(,ORGNOPCE)                          04S0594 00627000
*                 OPCMODID=RUDSPMOD;/* SET TO XCTL TO RU DISPATCHER  */ 00628000
         MVC   OPCMODID(2,ROPCAVT),RUDSPMOD                     04S0595 00629000
*               END;                                            03S0596 00630000
*             RFY                                               03S0597 00631000
*               IEDDSI1 BASED;                                  03S0597 00632000
@RF00556 DS    0H                                               03S0598 00633000
*           END;                                                02S0598 00634000
*         ELSE                                                  02S0599 00635000
*           ;                       /* A REQUEST FROM IGCFL10D, NO      00636000
*                                      RESPONSE PROCESSING NEEDED, NO   00637000
*                                      ATTACHED UNIT TO FREE.        */ 00638000
@RF00478 DS    0H                                               02S0600 00639000
*       IF FREUTFLG=ON THEN         /* IF UNITS ARE TO BE FREED      */ 00640000
@RC00476 TM    FREUTFLG,B'10000000'                             02S0600 00641000
         BNO   @RF00600                                         02S0600 00642000
*         IF ORGNOPCE->OCRESPCT=0 THEN/* IF END OF STEP              */ 00643000
         ICM   @14,3,OCRESPCT(ORGNOPCE)                         02S0601 00644000
         BNZ   @RF00601                                         02S0601 00645000
*           DO;                                                 02S0602 00646000
*                                                               02S0602 00647000
*             /*******************************************************/ 00648000
*             /*                                                     */ 00649000
*             /* FREE ONLY ATTACHED RU KEEPING THE OPCE TO INITIATE  */ 00650000
*             /* NEXT STEP IN PROCESSING.                            */ 00651000
*             /*                                                     */ 00652000
*             /*******************************************************/ 00653000
*                                                               02S0603 00654000
*             RZERO=1;              /* DECREMENT OPCADGOT BY 1 ....  */ 00655000
         LA    RZERO,1                                          02S0603 00656000
*             CALL DECRCT;          /* .... AND PRIME R/D ELEMENT    */ 00657000
         L     @15,OPCDECR(,ROPCAVT)                            02S0604 00658000
         BALR  @14,@15                                          02S0604 00659000
*             RPARM=OCUNIT;         /* GO FREE ....                  */ 00660000
         L     RPARM,OCUNIT(,ROPCE)                             02S0605 00661000
*             CALL FREEBUFF;        /* .... ATTACHED RU              */ 00662000
         L     @15,OPCFREBF(,ROPCAVT)                           02S0606 00663000
         BALR  @14,@15                                          02S0606 00664000
*             OCUNIT=PRUINTIC;      /* SET INVALID TIC IN OPCE       */ 00665000
         MVC   OCUNIT(4,ROPCE),@CF01345                         02S0607 00666000
*           END;                                                02S0608 00667000
*         ELSE                                                  02S0609 00668000
*           DO;                                                 02S0609 00669000
*                                                               02S0609 00670000
         B     @RC00601                                         02S0609 00671000
@RF00601 DS    0H                                               02S0610 00672000
*             /*******************************************************/ 00673000
*             /*                                                     */ 00674000
*             /* FREE BOTH OPCE AND RU SINCE NO "REPLACE" MUST BE    */ 00675000
*             /* DONE.                                               */ 00676000
*             /*                                                     */ 00677000
*             /*******************************************************/ 00678000
*                                                               02S0610 00679000
*             RZERO=2;              /* DECREMENT OPCADGOT BY 2 ....  */ 00680000
         LA    RZERO,2                                          02S0610 00681000
*             CALL DECRCT;          /* .... AND PRIME R/D ELEMENT    */ 00682000
         L     @15,OPCDECR(,ROPCAVT)                            02S0611 00683000
         BALR  @14,@15                                          02S0611 00684000
*             RPARM=ROPCE;          /* FREE OPCE AND ....            */ 00685000
         LR    RPARM,ROPCE                                      02S0612 00686000
*             CALL FREEBUFF;        /* .... ATTACHED RU              */ 00687000
         L     @15,OPCFREBF(,ROPCAVT)                           02S0613 00688000
         BALR  @14,@15                                          02S0613 00689000
*             OPCMODID=CNTLMOD;     /* SET TO XCTL TO CONTROL MOD.   */ 00690000
         MVC   OPCMODID(2,ROPCAVT),CNTLMOD                      02S0614 00691000
*           END;                                                02S0615 00692000
*       ELSE                                                    02S0616 00693000
*         ;                                                     02S0616 00694000
@RF00600 DS    0H                                               02S0617 00695000
*       DO WHILE(ORGNOPCE->OCRESPCT=0);/* IF THE RESPONSE COUNT IS 0    00696000
*                                      INDICATING THAT NEXT STEP        00697000
*                                      SHOULD BE DONE                */ 00698000
*                                                               01S0617 00699000
@RC00600 B     @DE00617                                         01S0617 00700000
@DL00617 DS    0H                                               01S0618 00701000
*         /***********************************************************/ 00702000
*         /*                                                         */ 00703000
*         /* DETERMINE WHAT TO DO NEXT                               */ 00704000
*         /*                                                         */ 00705000
*         /***********************************************************/ 00706000
*                                                               01S0618 00707000
*                                                               02S0618 00708000
*         /***********************************************************/ 00709000
*         /*                                                         */ 00710000
*         /* --------- THIS SEGMENT CHECKS THE NEXT STEP TO BE DONE  */ 00711000
*         /* -----                                                   */ 00712000
*         /*                                                         */ 00713000
*         /***********************************************************/ 00714000
*                                                               02S0618 00715000
*         IF OCSWITCH=OCOPYDSI|OCSWITCH=OCRPLDSI THEN/* IF CURRENT      00716000
*                                      OPCE IS FOR COPY/REPLACE 02S0618 00717000
*                                      DEVICE SESSION INFORMATION    */ 00718000
         CLI   OCSWITCH(ROPCE),X'E3'                            02S0618 00719000
         BE    @RT00618                                         02S0618 00720000
         CLI   OCSWITCH(ROPCE),X'E4'                            02S0618 00721000
         BNE   @RF00618                                         02S0618 00722000
@RT00618 DS    0H                                               02S0619 00723000
*           DO;                                                 02S0619 00724000
*                                                               02S0619 00725000
*             /*******************************************************/ 00726000
*             /*                                                     */ 00727000
*             /* DIAL DIGIT PROCESSING COMPLETE FOR ALL AUTOCALL     */ 00728000
*             /* RESOURCES UNDER THE NCP, SET TO XCTL TO IGCFJ10D TO */ 00729000
*             /* START ACTLINK PROCESSING.                           */ 00730000
*             /*                                                     */ 00731000
*             /*******************************************************/ 00732000
*                                                               02S0620 00733000
*             OCSWITCH=OCACTLK;     /* SET COMMAND AS ACTLINK        */ 00734000
         MVI   OCSWITCH(ROPCE),X'50'                            02S0620 00735000
*             OPCMODID=RPNCPMOD;    /* SET TO XCTL                   */ 00736000
         MVC   OPCMODID(2,ROPCAVT),RPNCPMOD                     02S0621 00737000
*             ORGNOPCE->OCRESPCT=1; /* SET RESPONSE COUNT            */ 00738000
         MVC   OCRESPCT(2,ORGNOPCE),@CH00060                    02S0622 00739000
*             OCREDRVE=OFF;         /* RESET REDRIVE FLAG            */ 00740000
         NI    OCREDRVE(ROPCE),B'11101111'                      02S0623 00741000
*           END;                                                02S0624 00742000
*         ELSE                                                  02S0625 00743000
*           DO;                                                 02S0625 00744000
*                                                               02S0625 00745000
         B     @RC00618                                         02S0625 00746000
@RF00618 DS    0H                                               02S0626 00747000
*             /*******************************************************/ 00748000
*             /*                                                     */ 00749000
*             /* CHECK IF ANY DIAL BSC-SS TERMS WITH AUTODIAL        */ 00750000
*             /* SPECIFIED. REFORMAT CURRENT OPCE INTO REDRIVE OPCE  */ 00751000
*             /* FOR COPY DSI                                        */ 00752000
*             /*                                                     */ 00753000
*             /*******************************************************/ 00754000
*                                                               02S0626 00755000
*                                                               03S0626 00756000
*             /*******************************************************/ 00757000
*             /*                                                     */ 00758000
*             /* ------ THIS SEGMENT REFORMATS AN OPCE INTO A REDRIVE*/ 00759000
*             /* OPCE---                                             */ 00760000
*             /*                                                     */ 00761000
*             /*******************************************************/ 00762000
*                                                               03S0626 00763000
*             RFY                                               03S0626 00764000
*               IEDSATD BASED(ENTRYPTR);/* SAT BASE FOR LOOP         */ 00765000
*             RFY                                               03S0627 00766000
*               IEDRVTD BASED(SATRNRVT);/* BASE FOR RVT              */ 00767000
*             OCREDRVE=ON;          /* SET FLAG                      */ 00768000
         OI    OCREDRVE(ROPCE),B'00010000'                      03S0628 00769000
*             OCBUFNED=''B;         /* INIT. BUFFER UNITS NEEDED     */ 00770000
         SLR   @14,@14                                          03S0629 00771000
         STH   @14,OCBUFNED(,ROPCE)                             03S0629 00772000
*             OCBUFGOT=''B;         /* INIT. BUFFER UNITS GOT        */ 00773000
         STH   @14,OCBUFGOT(,ROPCE)                             03S0630 00774000
*             OCSWITCH=OCOPYDSI;    /* COPY DEV. SESSION INFO. CODE  */ 00775000
*                                                               03S0631 00776000
         MVI   OCSWITCH(ROPCE),X'E3'                            03S0631 00777000
*             /*******************************************************/ 00778000
*             /*                                                     */ 00779000
*             /* LOOP THROUGH SAT UNTIL CORRECT RVT FOUND            */ 00780000
*             /*                                                     */ 00781000
*             /*******************************************************/ 00782000
*                                                               03S0632 00783000
*             ENTRYPTR=SAVTSAT;     /* ADDR. OF SAT - FIRST ENTRY    */ 00784000
         L     @14,AVTSAVTP(,RAVT)                              03S0632 00785000
         MVC   ENTRYPTR(4),SAVTSAT(@14)                         03S0632 00786000
*             DO UNTIL(FDRVTFLG=ON);                            03S0633 00787000
@DL00633 DS    0H                                               03S0634 00788000
*               IF SATRNRVT^=0 THEN /* IF THIS SUBAREA ACTIVE   03S0634 00789000
*                                                            @YM05702*/ 00790000
         L     @14,ENTRYPTR                                     03S0634 00791000
         L     @14,SATRNRVT(,@14)                               03S0634 00792000
         LTR   @14,@14                                          03S0634 00793000
         BZ    @RF00634                                         03S0634 00794000
*                 IF RVTINDEX=OCPTRSAV->OCTRMTBL THEN/* IF THIS IS      00795000
*                                      CORRECT RVT                   */ 00796000
         L     @09,OCPTRSAV(,ROPCE)                             03S0635 00797000
         SLR   @05,@05                                          03S0635 00798000
         ICM   @05,3,OCTRMTBL(@09)                              03S0635 00799000
         CH    @05,RVTINDEX(,@14)                               03S0635 00800000
         BNE   @RF00635                                         03S0635 00801000
*                   FDRVTFLG=ON;    /* SET FLAG TO GET OUT OF LOOP   */ 00802000
         OI    FDRVTFLG,B'00100000'                             03S0636 00803000
*                 ELSE                                          03S0637 00804000
*                   ENTRYPTR=ENTRYPTR+LENGTH(IEDSATD);/* UPDATE PTR.    00805000
*                                      TO NEXT SAT ENTRY             */ 00806000
         B     @RC00635                                         03S0637 00807000
@RF00635 LA    @14,8                                            03S0637 00808000
         AL    @14,ENTRYPTR                                     03S0637 00809000
         ST    @14,ENTRYPTR                                     03S0637 00810000
*               ELSE                /*                       @YM05702*/ 00811000
*                 ENTRYPTR=ENTRYPTR+LENGTH(IEDSATD);/* UPDATE PTR. TO   00812000
*                                      NEXT SAT ENTRY        @YM06014*/ 00813000
         B     @RC00634                                         03S0638 00814000
@RF00634 LA    @14,8                                            03S0638 00815000
         AL    @14,ENTRYPTR                                     03S0638 00816000
         ST    @14,ENTRYPTR                                     03S0638 00817000
*             END;                                              03S0639 00818000
@RC00634 DS    0H                                               03S0639 00819000
@DE00633 TM    FDRVTFLG,B'00100000'                             03S0639 00820000
         BNO   @DL00633                                         03S0639 00821000
*             ENTRYCT=RVTNUM-1;     /* NO. OF RVT ENTRIES - NCP ENTRY*/ 00822000
         L     @14,ENTRYPTR                                     03S0640 00823000
         L     @14,SATRNRVT(,@14)                               03S0640 00824000
         LH    @09,RVTNUM(,@14)                                 03S0640 00825000
         BCTR  @09,0                                            03S0640 00826000
         STH   @09,ENTRYCT                                      03S0640 00827000
*             ENTRYRVT=SATRNRVT+LENGTH(RVTINDEX);/* SET PTR. IN R/D     00828000
*                                      OPCE TO SECOND ENTRY IN THE      00829000
*                                      RVT                           */ 00830000
         AH    @14,@CH00131                                     03S0641 00831000
         ST    @14,ENTRYRVT(,ROPCE)                             03S0641 00832000
*             RFY                                               03S0642 00833000
*               IEDSATD BASED;                                  03S0642 00834000
*             RFY                                               03S0643 00835000
*               IEDRVTD BASED(ENTRYRVT);                        03S0643 00836000
*             ENTRYPTR=ENTRYRVT;    /* POINT TO SECOND ENTRY         */ 00837000
         ST    @14,ENTRYPTR                                     02S0644 00838000
*             DO WHILE(ENTRYCT^=0); /* SET TO LOOP THROUGH RVT       */ 00839000
         B     @DE00645                                         02S0645 00840000
@DL00645 DS    0H                                               02S0646 00841000
*               RFY                                             02S0646 00842000
*                 IEDRVTD BASED(ENTRYPTR);/* BASE FOR DURATION OF       00843000
*                                      LOOP                          */ 00844000
*               RFY                                             02S0647 00845000
*                 IEDQTRM BASED(RPARM);/* BASE FOR DURATION OF LOOP  */ 00846000
*               IF RVTINDEX^=0 THEN /* IF VALID INDEX                */ 00847000
         L     @14,ENTRYPTR                                     02S0648 00848000
         LH    @14,RVTINDEX(,@14)                               02S0648 00849000
         LTR   @14,@14                                          02S0648 00850000
         BZ    @RF00648                                         02S0648 00851000
*                 DO;                                           02S0649 00852000
*                   RPARM=RVTINDEX; /* OBTAIN TTE ....               */ 00853000
         LR    RPARM,@14                                        02S0650 00854000
*                   CALL IEDQTNT;   /* .... ADDR. OF RESOURCE        */ 00855000
         L     @15,AVTRNMPT(,RAVT)                              02S0651 00856000
         BALR  @14,@15                                          02S0651 00857000
*                   IF TRMTYPE=TRMPSNA THEN/* IF PRE-SNA 3705   02S0652 00858000
*                                      TERMINAL                      */ 00859000
*                                                               02S0652 00860000
         LR    @14,RPARM                                        02S0652 00861000
         SH    @14,@CH01700                                     02S0652 00862000
         CLI   TRMTYPE(@14),X'4F'                               02S0652 00863000
         BNE   @RF00652                                         02S0652 00864000
*                     /***********************************************/ 00865000
*                     /*                                             */ 00866000
*                     /* GO SEE IF AUTOCALL WITH VALID DIAL DIGITS   */ 00867000
*                     /* SPECIFIED                                   */ 00868000
*                     /*                                             */ 00869000
*                     /***********************************************/ 00870000
*                                                               02S0653 00871000
*                                                               03S0653 00872000
*                     /***********************************************/ 00873000
*                     /*                                             */ 00874000
*                     /* ---- THIS SEGMENT CHECKS IF COPY DSI CMND IS*/ 00875000
*                     /* NEEDED FOR THIS TERM. -----                 */ 00876000
*                     /*                                             */ 00877000
*                     /***********************************************/ 00878000
*                                                               03S0653 00879000
*                     IF TRMAUTOC=ON&TRMDDIG=ON THEN/* IF AUTOCALL      00880000
*                                      WITH DIAL DIGITS              */ 00881000
         TM    TRMAUTOC(@14),B'00100000'                        03S0653 00882000
         BNO   @RF00653                                         03S0653 00883000
         TM    TRMDDIG(RPARM),B'01000000'                       03S0653 00884000
         BNO   @RF00653                                         03S0653 00885000
*                       DO;                                     03S0654 00886000
*                         RZERO=TRMDDIGA;/* CODE FOR IEDQTL          */ 00887000
         LH    RZERO,@CH01535                                   03S0655 00888000
*                         CALL IEDQTL;/* GET ADDR. OF DIAL DIGITS       00889000
*                                      FIELD                         */ 00890000
         L     @15,AVTDDFT(,RAVT)                               03S0656 00891000
         BALR  @14,@15                                          03S0656 00892000
*                         DEVDPADR=RTNCODE;/* SAVE ADDR.             */ 00893000
         LR    DEVDPADR,RTNCODE                                 03S0657 00894000
*                         IF TTEDIALN=LENCTFLD&TTEDIALD(1:1)='0F'X THEN 00895000
         CLI   TTEDIALN(DEVDPADR),1                             03S0658 00896000
         BNE   @RF00658                                         03S0658 00897000
         CLI   TTEDIALD(DEVDPADR),X'0F'                         03S0658 00898000
         BE    @RT00658                                         03S0658 00899000
*                           ;       /* IF INVALID DIAL DATA THEN DO     00900000
*                                      NOTHING                       */ 00901000
*                         ELSE                                  03S0660 00902000
*                           DO;                                 03S0660 00903000
@RF00658 DS    0H                                               03S0661 00904000
*                             ORGNOPCE->OCRESPCT=ORGNOPCE->OCRESPCT+1;  00905000
         LA    @14,1                                            03S0661 00906000
         SLR   @09,@09                                          03S0661 00907000
         ICM   @09,3,OCRESPCT(ORGNOPCE)                         03S0661 00908000
         ALR   @14,@09                                          03S0661 00909000
         STH   @14,OCRESPCT(,ORGNOPCE)                          03S0661 00910000
*                                   /* INCREMENT RESP. COUNT         */ 00911000
*                             OCBUFNED=OCBUFNED+2;/* UPDATE UNITS       00912000
*                                      NEEDED BY 2                   */ 00913000
         LA    @14,2                                            03S0662 00914000
         SLR   @09,@09                                          03S0662 00915000
         ICM   @09,3,OCBUFNED(ROPCE)                            03S0662 00916000
         ALR   @14,@09                                          03S0662 00917000
         STH   @14,OCBUFNED(,ROPCE)                             03S0662 00918000
*                           END;                                03S0663 00919000
*                       END;                                    03S0664 00920000
*                     ELSE                                      03S0665 00921000
*                       ;                                       03S0665 00922000
@RF00653 DS    0H                                               03S0666 00923000
*                   ELSE                                        02S0666 00924000
*                     ;                                         02S0666 00925000
@RF00652 DS    0H                                               02S0667 00926000
*                 END;                                          02S0667 00927000
*               ELSE                                            02S0668 00928000
*                 ;                                             02S0668 00929000
@RF00648 DS    0H                                               02S0669 00930000
*               ENTRYCT=ENTRYCT-1;  /* DECREMENT LOOP CTR.           */ 00931000
@RC00648 LH    @14,ENTRYCT                                      02S0669 00932000
         BCTR  @14,0                                            02S0669 00933000
         STH   @14,ENTRYCT                                      02S0669 00934000
*               ENTRYPTR=ENTRYPTR+LENGTH(RVTINDEX);/* OBTAIN NEXT RVT   00935000
*                                      ENTRY                         */ 00936000
         LA    @14,2                                            02S0670 00937000
         AL    @14,ENTRYPTR                                     02S0670 00938000
         ST    @14,ENTRYPTR                                     02S0670 00939000
*               RFY                                             02S0671 00940000
*                 IEDQTRM BASED(RTRM);/* RESTORE BASE                */ 00941000
*               RFY                                             02S0672 00942000
*                 IEDRVTD BASED(ENTRYRVT);/* RESET BASE              */ 00943000
*             END;                                              02S0673 00944000
@DE00645 ICM   @14,3,ENTRYCT                                    02S0673 00945000
         BNZ   @DL00645                                         02S0673 00946000
*           END;                                                02S0674 00947000
*       END;                                                    01S0675 00948000
@RC00618 DS    0H                                               01S0675 00949000
@DE00617 ICM   @14,3,OCRESPCT(ORGNOPCE)                         01S0675 00950000
         BZ    @DL00617                                         01S0675 00951000
*       IF OCREDRVE=ON THEN         /* IF CHKSTEP CREATED REDRIVE       00952000
*                                      OPCE                          */ 00953000
         TM    OCREDRVE(ROPCE),B'00010000'                      01S0676 00954000
         BNO   @RF00676                                         01S0676 00955000
*         DO;                                                   01S0677 00956000
*                                                               01S0677 00957000
*           /*********************************************************/ 00958000
*           /*                                                       */ 00959000
*           /* A REDRIVE OPCE HAS BEEN CREATED FOR COPY DEVICE       */ 00960000
*           /* SESSION INFORMATION COMMANDS. OBTAIN AS MANY UNITS AS */ 00961000
*           /* ALLOWABLE UP TO THE NUMBER OF UNITS NEEDED TO SEND OUT*/ 00962000
*           /* ALL COMMANDS AND THEN ENTER REDRIVE PROCESSING WHICH  */ 00963000
*           /* BUILDS COPY DEVICE SESSION INFORMATION OPCE- PACKED RU*/ 00964000
*           /* PAIRS FOR EACH RESOURCE.                              */ 00965000
*           /*                                                       */ 00966000
*           /*********************************************************/ 00967000
*                                                               01S0678 00968000
*                                                               02S0678 00969000
*           /*********************************************************/ 00970000
*           /*                                                       */ 00971000
*           /* OBTAIN AS MANY BUFFER UNITS AS THE OPCE NEEDS UP TO   */ 00972000
*           /* 50% OF TCAM'S UNITS. CHAIN THEM OFF OCUNIT FIELD OF   */ 00973000
*           /* THE OPCE.                                             */ 00974000
*           /*                                                       */ 00975000
*           /*********************************************************/ 00976000
*                                                               02S0678 00977000
*           UNITPTR=ROPCE;          /* SET TO POINT TO R/D OPCE      */ 00978000
         LR    UNITPTR,ROPCE                                    02S0678 00979000
*           IF OPCADGOT+OCBUFNED>HALFUNIT THEN/* IF TOTAL OF UNITS      00980000
*                                      A/D HAS AND UNITS NEEDED 02S0679 00981000
*                                      EXCEEDS THE 50% LEVEL         */ 00982000
         LH    @14,HALFUNIT                                     02S0679 00983000
         SLR   @11,@11                                          02S0679 00984000
         ICM   @11,3,OPCADGOT(ROPCAVT)                          02S0679 00985000
         SLR   @09,@09                                          02S0679 00986000
         ICM   @09,3,OCBUFNED(ROPCE)                            02S0679 00987000
         ALR   @09,@11                                          02S0679 00988000
         CR    @09,@14                                          02S0679 00989000
         BNH   @RF00679                                         02S0679 00990000
*             UNITSGET=HALFUNIT-OPCADGOT;/* GET UNITS UP TO 50% LEVEL*/ 00991000
         SLR   @14,@11                                          02S0680 00992000
         STH   @14,UNITSGET                                     02S0680 00993000
*           ELSE                                                02S0681 00994000
*             UNITSGET=OCBUFNED;    /* GET AS MANY UNITS AS NEEDED   */ 00995000
         B     @RC00679                                         02S0681 00996000
@RF00679 MVC   UNITSGET(2),OCBUFNED(ROPCE)                      02S0681 00997000
*           DO WHILE(UNITSGET^=0);  /* GO TO ALLOCBUF AS MANY TIMES     00998000
*                                      AS NECESSAY TO OBTAIN UNITS   */ 00999000
@RC00679 B     @DE00682                                         02S0682 01000000
@DL00682 DS    0H                                               02S0683 01001000
*             IF UNITSGET>MAXUNTGT THEN/* IF FK IS TO GET MORE THAN     01002000
*                                      THE # OF UNITS ALLOCBUF CAN      01003000
*                                      GIVE PER CALL                 */ 01004000
         LA    @14,255                                          02S0683 01005000
         CH    @14,UNITSGET                                     02S0683 01006000
         BNL   @RF00683                                         02S0683 01007000
*               RPARM=MAXUNTGT;     /* GET THE MAXIMUM               */ 01008000
         LR    RPARM,@14                                        02S0684 01009000
*             ELSE                                              02S0685 01010000
*               RPARM=UNITSGET;     /* GET # TO GET                  */ 01011000
         B     @RC00683                                         02S0685 01012000
@RF00683 LH    RPARM,UNITSGET                                   02S0685 01013000
*             CALL ALLOCBUF;        /* GET BUFFER UNITS              */ 01014000
*                                                               02S0686 01015000
@RC00683 L     @15,OPCGETBF(,ROPCAVT)                           02S0686 01016000
         BALR  @14,@15                                          02S0686 01017000
*             /*******************************************************/ 01018000
*             /*                                                     */ 01019000
*             /* LINK UNITS JUST GOTTEN OFF OF OCLINK AT END OF      */ 01020000
*             /* CURRENT CHAIN OF BUFFERS                            */ 01021000
*             /*                                                     */ 01022000
*             /*******************************************************/ 01023000
*                                                               02S0687 01024000
*             RFY                                               02S0687 01025000
*               IEDQOPCE BASED(UNITPTR);                        02S0687 01026000
*             RFY                                               02S0688 01027000
*               TICFLD BASED(ADDR(OCUNIT));                     02S0688 01028000
*             DO WHILE(TIC=VALTIC); /* LOOP TO FIND END OF CURRENT      01029000
*                                      CHAIN                         */ 01030000
         B     @DE00689                                         02S0689 01031000
@DL00689 DS    0H                                               02S0690 01032000
*               UNITPTR=OCUNIT;     /* POINT TO NEXT UNIT            */ 01033000
         L     UNITPTR,OCUNIT(,UNITPTR)                         02S0690 01034000
*             END;                                              02S0691 01035000
@DE00689 TM    TIC+8(UNITPTR),B'00000011'                       02S0691 01036000
         BZ    @DL00689                                         02S0691 01037000
*             OCUNIT=RPARM;         /* POINT TO UNITS JUST GOTTEN    */ 01038000
         ST    RPARM,OCUNIT(,UNITPTR)                           02S0692 01039000
*             RFY                                               02S0693 01040000
*               TICFLD BASED;                                   02S0693 01041000
*             RFY                                               02S0694 01042000
*               IEDQOPCE BASED(ROPCE);                          02S0694 01043000
*             UNITSGET=UNITSGET-RZERO;/* UPDATE # OF UNITS TO GET    */ 01044000
         LH    @14,UNITSGET                                     02S0695 01045000
         SLR   @14,RZERO                                        02S0695 01046000
         STH   @14,UNITSGET                                     02S0695 01047000
*             OCBUFNED=OCBUFNED-RZERO;/* UPDATE # OF UNITS OPCE NEEDS*/ 01048000
         SLR   @14,@14                                          02S0696 01049000
         ICM   @14,3,OCBUFNED(ROPCE)                            02S0696 01050000
         SLR   @14,RZERO                                        02S0696 01051000
         STH   @14,OCBUFNED(,ROPCE)                             02S0696 01052000
*             OCBUFGOT=OCBUFGOT+RZERO;/* UPDATE # OF UNITS OPCE HAS  */ 01053000
         SLR   @14,@14                                          02S0697 01054000
         ICM   @14,3,OCBUFGOT(ROPCE)                            02S0697 01055000
         ALR   @14,RZERO                                        02S0697 01056000
         STH   @14,OCBUFGOT(,ROPCE)                             02S0697 01057000
*             OPCADGOT=OPCADGOT+RZERO;/* UPDATE OPCADGOT             */ 01058000
         SLR   @14,@14                                          02S0698 01059000
         ICM   @14,3,OPCADGOT(ROPCAVT)                          02S0698 01060000
         ALR   @14,RZERO                                        02S0698 01061000
         STH   @14,OPCADGOT(,ROPCAVT)                           02S0698 01062000
*           END;                                                02S0699 01063000
@DE00682 ICM   @14,3,UNITSGET                                   02S0699 01064000
         BNZ   @DL00682                                         02S0699 01065000
*           CALL REDRIVE;                                       01S0700 01066000
         BAL   @14,REDRIVE                                      01S0700 01067000
*         END;                                                  01S0701 01068000
*       ELSE                                                    01S0702 01069000
*         ;                         /* EITHER OPCE IS A ACTLINK 01S0702 01070000
*                                      REQUEST OPCE OR IS A REPLACE     01071000
*                                      DSI COMMAND OPCE. IN EITHER      01072000
*                                      CASE, EXIT.                   */ 01073000
@RF00676 DS    0H                                               01S0703 01074000
*     END;                                                      01S0703 01075000
*                                                               01S0703 01076000
*   /*****************************************************************/ 01077000
*   /*                                                               */ 01078000
*   /* EXIT CODE                                                     */ 01079000
*   /*                                                               */ 01080000
*   /*****************************************************************/ 01081000
*                                                               01S0704 01082000
*   IF OPCMODID=CNTLMOD THEN        /* IF XCTL IS TO IGC0010D        */ 01083000
@RC00472 CLC   OPCMODID(2,ROPCAVT),CNTLMOD                      01S0704 01084000
         BNE   @RF00704                                         01S0704 01085000
*     RZERO=''B;                    /* CLEAR                         */ 01086000
         SLR   RZERO,RZERO                                      01S0705 01087000
*   RPARM=ROPCAVT;                                              01S0706 01088000
@RF00704 LR    RPARM,ROPCAVT                                    01S0706 01089000
*   GEN REFS(ROPCAVT,OPCXCTL) EXIT;                             01S0707 01090000
*                                                               01S0707 01091000
         XCTL  SF=(E,OPCXCTL(ROPCAVT))                                  01092000
*   /*****************************************************************/ 01093000
*   /*                                                               */ 01094000
*   /* END OF MAIN PROCEDURE                                         */ 01095000
*   /*                                                               */ 01096000
*   /*****************************************************************/ 01097000
*                                                               01S0708 01098000
*                                                               01S0708 01099000
*/********************************************************************/ 01100000
*/*              REDRIVE SUBROUTINE                                  */ 01101000
*/********************************************************************/ 01102000
*/*                                                                  */ 01103000
*/* THIS ROUTINE PERFORMS THE REDRIVE PROCESSING:                    */ 01104000
*/* 1. THE RVT IS SCANNED STARTING WITH THE ENTRY ADDR. (ENTRYRVT)   */ 01105000
*/*    CONTAINED IN OCMODNME OF THE REDRIVE OPCE. ON THE FIRST PASS, */ 01106000
*/*    THIS IS SET UP WITH THE 2ND ENTRY IN THE RVT.                 */ 01107000
*/* 2. USING RVTINDEX, THE TTE IS OBTAINED AND THE TERMINAL IS       */ 01108000
*/*    VERIFIED AS A BSC-SS DIAL TERM. WITH AUTOCALL SPECIFIED.      */ 01109000
*/* 3. IF SO, A COPY DEVICE SESSION INFORMATION OPCE IS BUILT IN     */ 01110000
*/*    THE UNIT POINTED TO BY OCUNIT OF THE REDRIVE OPCE. THE NEXT   */ 01111000
*/*    UNIT HAS A PACKED RU BUILT IN IT. OCUNIT OF THE REDRIVE OPCE  */ 01112000
*/*    IS SET TO THE UNIT FOLLOWING THE SECOND UNIT.                 */ 01113000
*/* 4. THE OPCE=RU PAIR JUST BUILT IS PUT INTO THE CHAIN FOR THE     */ 01114000
*/*    POST TO AVTOPCOB.                                             */ 01115000
*/* 5. IF THERE ARE 2 OR MORE UNITS LEFT, THE RVT SCAN IS CONTINED   */ 01116000
*/*    AND STEPS 2-4 REPEATED.                                       */ 01117000
*/*                                                                  */ 01118000
*/********************************************************************/ 01119000
*                                                               01S0708 01120000
*REDRIVE:                                                       01S0708 01121000
*   PROC OPTIONS(RETREG,SAVE(14));                              01S0708 01122000
REDRIVE  ST    @14,@SA00002                                     01S0708 01123000
*   IF OCBUFGOT>=2 THEN             /* IF TWO OR MORE UNITS ATTACHED */ 01124000
         CLC   OCBUFGOT(2,ROPCE),@CH00131                       01S0709 01125000
         BL    @RF00709                                         01S0709 01126000
*     DO;                                                       01S0710 01127000
*                                                               01S0710 01128000
*       /*************************************************************/ 01129000
*       /*                                                           */ 01130000
*       /* THERE ARE ENOUGH UNITS                                    */ 01131000
*       /*                                                           */ 01132000
*       /*************************************************************/ 01133000
*                                                               01S0711 01134000
*       OPCAQWD1=OCUNIT;            /* SET FIRST WORD OF AQCTL PARM.    01135000
*                                      LIST TO POINT TO FIRST UNIT   */ 01136000
         MVC   OPCAQWD1(4,ROPCAVT),OCUNIT(ROPCE)                01S0711 01137000
*       DO WHILE(OCBUFGOT>=2);      /* LOOP WHILE ENOUGH UNITS REMAIN*/ 01138000
         B     @DE00712                                         01S0712 01139000
@DL00712 DS    0H                                               01S0713 01140000
*         RFY                                                   01S0713 01141000
*           IEDQOPCE BASED(UNITPTR);/* REDEFINE BASE FOR LOOP        */ 01142000
*         UNITPTR=ROPCE->OCUNIT;    /* POINT TO FIRST UNIT           */ 01143000
         L     UNITPTR,OCUNIT(,ROPCE)                           01S0714 01144000
*         ROPCE->OCUNIT=OCUNIT->OCUNIT;/* SET OCUNIT OF REDRIVE TO      01145000
*                                      POINT TO UNIT FOLLOWING UNIT     01146000
*                                      FOLLOWING UNIT POINTED TO BY     01147000
*                                      UNITPTR                       */ 01148000
         L     @14,OCUNIT(,UNITPTR)                             01S0715 01149000
         L     @11,OCUNIT(,@14)                                 01S0715 01150000
         ST    @11,OCUNIT(,ROPCE)                               01S0715 01151000
*         OCELEM=ROPCE->OCUNIT;     /* MOVE LINK FOR POST TO AVTOPCOB*/ 01152000
         ST    @11,OCELEM(,UNITPTR)                             01S0716 01153000
*         PRUTIC=PRUINTIC;          /* SET TIC FIELD OF RU INVALID   */ 01154000
*                                                               01S0717 01155000
         MVC   PRUTIC(4,@14),@CB01345                           01S0717 01156000
*         /***********************************************************/ 01157000
*         /*                                                         */ 01158000
*         /* SET COMMON FIELDS IN OPCE                               */ 01159000
*         /*                                                         */ 01160000
*         /***********************************************************/ 01161000
*                                                               01S0718 01162000
*         OCPTRSAV=ROPCE->OCPTRSAV; /* SET ADDR. OF ORIG. OPCE       */ 01163000
         MVC   OCPTRSAV(4,UNITPTR),OCPTRSAV(ROPCE)              01S0718 01164000
*         OCSWITCH=OCOPYDSI;        /* SET COMMAND CODE              */ 01165000
         MVI   OCSWITCH(UNITPTR),X'E3'                          01S0719 01166000
*         OCLINK=ADDR(AVTOPCOB);    /* SET QCB ADDR.                 */ 01167000
         LA    @14,AVTOPCOB(,RAVT)                              01S0720 01168000
         ST    @14,OCLINK(,UNITPTR)                             01S0720 01169000
*         OCELMPRI=PRIMEDFG;        /* SET UP POST PRIORITY          */ 01170000
         MVI   OCELMPRI(UNITPTR),X'DF'                          01S0721 01171000
*         OCPRIFLG=OPR02;           /* SET TO ROUTE TO RU DISPATCHER */ 01172000
         MVI   OCPRIFLG(UNITPTR),X'08'                          01S0722 01173000
*         OCWTG=THISMOD;            /* SET TO RETURN TO THIS MOD.    */ 01174000
         MVC   OCWTG(2,UNITPTR),THISMOD                         01S0723 01175000
*         OCACTREQ=ON;              /* ACTIVATE REQUEST              */ 01176000
         OI    OCACTREQ(UNITPTR),B'00001000'                    01S0724 01177000
*         OPCAQWD2=UNITPTR;         /* 'END OF CHAIN' ADDR. IN AQCTL    01178000
*                                      PARM. LIST                    */ 01179000
*                                                               01S0725 01180000
         ST    UNITPTR,OPCAQWD2(,ROPCAVT)                       01S0725 01181000
*         /***********************************************************/ 01182000
*         /*                                                         */ 01183000
*         /* SCAN RVT UNTIL THE TTE OF A DIAL TERM. WITH AUTOCALL AND*/ 01184000
*         /* VALID DIAL DIGITS IS FOUND. FINISH BUILDING OPCE AND    */ 01185000
*         /* PACKED RU.                                              */ 01186000
*         /*                                                         */ 01187000
*         /***********************************************************/ 01188000
*                                                               01S0726 01189000
*                                                               02S0726 01190000
*         /***********************************************************/ 01191000
*         /*                                                         */ 01192000
*         /* ------- THIS SEGMENT BUILDS "COPY DEVICE SESSION        */ 01193000
*         /* INFORMATION" OPCE- PACKED RU PAIRS. -----               */ 01194000
*         /*                                                         */ 01195000
*         /***********************************************************/ 01196000
*                                                               02S0726 01197000
*         RFY                                                   02S0726 01198000
*           IEDQTRM BASED(RPARM);   /* SET TTE BASE                  */ 01199000
*         RFY                                                   02S0727 01200000
*           IEDQOPCE BASED(ROPCE);  /* SET BASE AS REDRIVE OPCE      */ 01201000
*         DO UNTIL(BUILTFLG=ON);    /* DO UNTIL CMND. BUILT          */ 01202000
*                                                               02S0728 01203000
@DL00728 DS    0H                                               02S0729 01204000
*           /*********************************************************/ 01205000
*           /*                                                       */ 01206000
*           /* OBTAIN NEXT RVT ENTRY ADDR. FROM REDRIVE OPCE AND SET */ 01207000
*           /* OCTRMTBL OF OPCE BEING BUILT TO TTCIN CONTAINED IN RVT*/ 01208000
*           /* ENTRY.                                                */ 01209000
*           /*                                                       */ 01210000
*           /*********************************************************/ 01211000
*                                                               02S0729 01212000
*           UNITPTR->OCTRMTBL=RVTINDEX;/* SET TTCIN FOR OPCE BEING      01213000
*                                      BUILT                         */ 01214000
         L     @14,ENTRYRVT(,ROPCE)                             02S0729 01215000
         LH    @11,RVTINDEX(,@14)                               02S0729 01216000
         STH   @11,OCTRMTBL(,UNITPTR)                           02S0729 01217000
*           ENTRYRVT=ENTRYRVT+LENGTH(RVTINDEX);/* UPDATE RVT ENTRY      01218000
*                                      PTR. IN R/D OPCE TO POINT TO     01219000
*                                      NEXT ENTRY                    */ 01220000
         AH    @14,@CH00131                                     02S0730 01221000
         ST    @14,ENTRYRVT(,ROPCE)                             02S0730 01222000
*           RPARM=UNITPTR->OCTRMTBL;/* OBTAIN ADDR. OF ....          */ 01223000
         LR    RPARM,@11                                        02S0731 01224000
*           CALL IEDQTNT;           /* .... TTE                      */ 01225000
         L     @15,AVTRNMPT(,RAVT)                              02S0732 01226000
         BALR  @14,@15                                          02S0732 01227000
*           IF TRMTYPE=TRMPSNA&TRMAUTOC=ON&TRMDDIG=ON THEN/* IF 02S0733 01228000
*                                      PRE-SNA TERM. WITH AUTOCALL      01229000
*                                      AND DIAL DIGITS               */ 01230000
         LR    @14,RPARM                                        02S0733 01231000
         SH    @14,@CH01700                                     02S0733 01232000
         CLI   TRMTYPE(@14),X'4F'                               02S0733 01233000
         BNE   @RF00733                                         02S0733 01234000
         TM    TRMAUTOC(@14),B'00100000'                        02S0733 01235000
         BNO   @RF00733                                         02S0733 01236000
         TM    TRMDDIG(RPARM),B'01000000'                       02S0733 01237000
         BNO   @RF00733                                         02S0733 01238000
*             DO;                                               02S0734 01239000
*                                                               02S0734 01240000
*               /*****************************************************/ 01241000
*               /*                                                   */ 01242000
*               /* BUILD COPY DEVICE SESSION INFO. CMND. IF THIS     */ 01243000
*               /* TERMINAL HAS VALID DIAL DIGITS.                   */ 01244000
*               /*                                                   */ 01245000
*               /*****************************************************/ 01246000
*                                                               02S0735 01247000
*               RZERO=TRMDDIGA;     /* OBTAIN ADDR. OF ....          */ 01248000
         LH    RZERO,@CH01535                                   02S0735 01249000
*               CALL IEDQTL;        /* .... DEVICE DEPENDENT FIELD   */ 01250000
         L     @15,AVTDDFT(,RAVT)                               02S0736 01251000
         BALR  @14,@15                                          02S0736 01252000
*               DEVDPADR=RTNCODE;   /* COPY ADDR. OF FIELD           */ 01253000
         LR    DEVDPADR,RTNCODE                                 02S0737 01254000
*               IF TTEDIALN=1&TTEDIALD(1:1)='0F'X THEN/* IF INVALID  */ 01255000
         CLI   TTEDIALN(DEVDPADR),1                             02S0738 01256000
         BNE   @RF00738                                         02S0738 01257000
         CLI   TTEDIALD(DEVDPADR),X'0F'                         02S0738 01258000
         BNE   @RF00738                                         02S0738 01259000
*                 BUILTFLG=OFF;     /* CMND. NOT BUILT FOR THIS TERM.   01260000
*                                      - CHECK NEXT RVT ENTRY        */ 01261000
         NI    BUILTFLG,B'11101111'                             02S0739 01262000
*               ELSE                                            02S0740 01263000
*                 DO;                                           02S0740 01264000
*                                                               02S0740 01265000
         B     @RC00738                                         02S0740 01266000
@RF00738 DS    0H                                               02S0741 01267000
*                   /*************************************************/ 01268000
*                   /*                                               */ 01269000
*                   /* BUILD PACKED RU                               */ 01270000
*                   /*                                               */ 01271000
*                   /*************************************************/ 01272000
*                                                               02S0741 01273000
*                   RFY                                         02S0741 01274000
*                     IEDQOPCE BASED(UNITPTR);/* RESET BASE AS OPCE     01275000
*                                      BEING BUILT                   */ 01276000
*                   PRUTTCIN=OCTRMTBL;/* SET RESOURCE TTCIN          */ 01277000
         L     @14,OCUNIT(,UNITPTR)                             02S0742 01278000
         MVC   PRUTTCIN(2,@14),OCTRMTBL(UNITPTR)                02S0742 01279000
*                   PRUDATCT=LENGTH(IEDBDU);/* DATA LENGTH IS BDU       01280000
*                                      LENGTH                        */ 01281000
         MVC   PRUDATCT(2,@14),@CH00071                         02S0743 01282000
*                   BDUCMND=CD0CTRL;/* CONTROL BDU                   */ 01283000
         LA    @11,12                                           02S0744 01284000
         ALR   @11,@14                                          02S0744 01285000
         MVI   BDUCMND(@11),X'08'                               02S0744 01286000
*                   BDUMODIF=CD0CCDSI;/* COPY DSI MODIFIER           */ 01287000
         MVI   BDUMODIF(@11),X'21'                              02S0745 01288000
*                   BDUHEADR=ON;    /* TURN ON HEADER FLAG   @YM06147*/ 01289000
         OI    BDUHEADR(@11),B'01000000'                        02S0746 01290000
*                   PRURHTH(1:3)=TRHFID0;/* SET FID0 RH FLAGS        */ 01291000
         SH    @14,@CH00045                                     02S0747 01292000
         MVC   PRURHTH(3,@14),@CB01378                          02S0747 01293000
*                   PRURHTH(4:4)=TTH0BYT0;/* SET FID0 TH FLAGS       */ 01294000
         MVI   PRURHTH+3(@14),X'0C'                             02S0748 01295000
*                   BUILTFLG=ON;    /* RU BUILT, RETURN TO REDRIVE   */ 01296000
         OI    BUILTFLG,B'00010000'                             02S0749 01297000
*                 END;                                          02S0750 01298000
*             END;                                              02S0751 01299000
*           ELSE                                                02S0752 01300000
*             BUILTFLG=OFF;         /* CMND. NOT BUILT FOR THIS TERM.   01301000
*                                      - CHECK NEXT RVT ENTRY        */ 01302000
         B     @RC00733                                         02S0752 01303000
@RF00733 NI    BUILTFLG,B'11101111'                             02S0752 01304000
*         END;                                                  02S0753 01305000
@RC00733 DS    0H                                               02S0753 01306000
@DE00728 TM    BUILTFLG,B'00010000'                             02S0753 01307000
         BNO   @DL00728                                         02S0753 01308000
*         RFY                                                   02S0754 01309000
*           IEDQTRM BASED(RTRM);    /* RESET BASE FOR TTE            */ 01310000
*         ROPCE->OCBUFGOT=ROPCE->OCBUFGOT-2;/* DECREMENT # UNITS GOT */ 01311000
         SLR   @14,@14                                          01S0755 01312000
         ICM   @14,3,OCBUFGOT(ROPCE)                            01S0755 01313000
         BCTR  @14,0                                            01S0755 01314000
         BCTR  @14,0                                            01S0755 01315000
         STH   @14,OCBUFGOT(,ROPCE)                             01S0755 01316000
*         RFY                                                   01S0756 01317000
*           IEDQOPCE BASED(ROPCE);  /* RESET BASE AS REDRIVE OPCE    */ 01318000
*       END;                                                    01S0757 01319000
*                                                               01S0757 01320000
@DE00712 CLC   OCBUFGOT(2,ROPCE),@CH00131                       01S0757 01321000
         BNL   @DL00712                                         01S0757 01322000
*       /*************************************************************/ 01323000
*       /*                                                           */ 01324000
*       /* POST OPCE'S TO AVTOPCOB                                   */ 01325000
*       /*                                                           */ 01326000
*       /*************************************************************/ 01327000
*                                                               01S0758 01328000
*       OPCAQREQ=CHAINFLG;          /* FINISH BUILDING PARM. LIST BY    01329000
*                                      SETTING FLAG FOR CHAIN POST   */ 01330000
         MVI   OPCAQREQ(ROPCAVT),X'B4'                          01S0758 01331000
*       RPARM=ADDR(OPCAQCTL);       /* SET REG 1 TO POINT TO PARM.      01332000
*                                      LIST                          */ 01333000
         LA    RPARM,OPCAQCTL(,ROPCAVT)                         01S0759 01334000
*       SVC(102);                   /* POST IT                       */ 01335000
         SVC   102                                              01S0760 01336000
*     END;                          /* END OF REDRIVE PROCESSING     */ 01337000
*   ELSE                                                        01S0762 01338000
*     ;                             /* NOT ENOUGH UNITS, DON'T DO       01339000
*                                      REDRIVE                       */ 01340000
*                                                               01S0762 01341000
@RF00709 DS    0H                                               01S0763 01342000
*   /*****************************************************************/ 01343000
*   /*                                                               */ 01344000
*   /* IF STILL MORE OPCE - RU'S TO BUILD, PLACE REDRIVE ELEMENT BACK*/ 01345000
*   /* ON WAIT CHAIN                                                 */ 01346000
*   /*                                                               */ 01347000
*   /*****************************************************************/ 01348000
*                                                               01S0763 01349000
*   IF OCBUFNED=0 THEN              /* IF PROCESSING DONE            */ 01350000
         ICM   @14,3,OCBUFNED(ROPCE)                            01S0763 01351000
         BNZ   @RF00763                                         01S0763 01352000
*     DO;                                                       01S0764 01353000
*       RPARM=ROPCE;                /* FREE REDRIVE ....             */ 01354000
         LR    RPARM,ROPCE                                      01S0765 01355000
*       CALL FREEBUFF;              /* .... OPCE                     */ 01356000
         L     @15,OPCFREBF(,ROPCAVT)                           01S0766 01357000
         BALR  @14,@15                                          01S0766 01358000
*       RZERO=1;                    /* DECREMENT OPCADGOT AND ....   */ 01359000
         LA    RZERO,1                                          01S0767 01360000
*       CALL DECRCT;                /* .... INITIATE REDRIVE    01S0768 01361000
*                                      PROCESSING FOR ANOTHER REDRIVE   01362000
*                                      OPCE                          */ 01363000
         L     @15,OPCDECR(,ROPCAVT)                            01S0768 01364000
         BALR  @14,@15                                          01S0768 01365000
*     END;                                                      01S0769 01366000
*   ELSE                            /* PROCESSING NOT FINISHED       */ 01367000
*     DO;                                                       01S0770 01368000
         B     @RC00763                                         01S0770 01369000
@RF00763 DS    0H                                               01S0771 01370000
*       OCWTG=THISMOD;              /* SET TO RETURN                 */ 01371000
         MVC   OCWTG(2,ROPCE),THISMOD                           01S0771 01372000
*       OCLINK=OPCBUFWT;            /* PLACE REDRIVE OPCE ....       */ 01373000
         MVC   OCLINK(4,ROPCE),OPCBUFWT(ROPCAVT)                01S0772 01374000
*       OPCBUFWT=ROPCE;             /* .... BACK ON WAIT CHAIN       */ 01375000
         ST    ROPCE,OPCBUFWT(,ROPCAVT)                         01S0773 01376000
*     END;                                                      01S0774 01377000
*                                                               01S0774 01378000
*   /*****************************************************************/ 01379000
*   /*                                                               */ 01380000
*   /* SET TO XCTL TO THE CONTROL MOD. - IGC0010D                    */ 01381000
*   /*                                                               */ 01382000
*   /*****************************************************************/ 01383000
*                                                               01S0775 01384000
*   OPCMODID=CNTLMOD;                                           01S0775 01385000
@RC00763 MVC   OPCMODID(2,ROPCAVT),CNTLMOD                      01S0775 01386000
*   END REDRIVE;                                                01S0776 01387000
@EL00002 DS    0H                                               01S0776 01388000
@EF00002 DS    0H                                               01S0776 01389000
@ER00002 L     @14,@SA00002                                     01S0776 01390000
         BR    @14                                              01S0776 01391000
*   END IGCFQ10D                                                01S0777 01392000
*                                                               01S0777 01393000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01394000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 01395000
*/*%INCLUDE SYSLIB  (TBDUD   )                                       */ 01396000
*/*%INCLUDE SYSLIB  (TCD0D   )                                       */ 01397000
*/*%INCLUDE SYSLIB  (TDSID   )                                       */ 01398000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 01399000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 01400000
*/*%INCLUDE SYSLIB  (TOPRED  )                                       */ 01401000
*/*%INCLUDE SYSLIB  (TPLMVD  )                                       */ 01402000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 01403000
*/*%INCLUDE SYSLIB  (TPRUD   )                                       */ 01404000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 01405000
*/*%INCLUDE SYSLIB  (TRVTD   )                                       */ 01406000
*/*%INCLUDE SYSLIB  (TSATD   )                                       */ 01407000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 01408000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 01409000
*/*%INCLUDE SYSUT5  (RSPPROC )                                       */ 01410000
*/*%INCLUDE SYSUT5  (CPYDSIR )                                       */ 01411000
*/*%INCLUDE SYSUT5  (GETDIAL )                                       */ 01412000
*/*%INCLUDE SYSUT5  (BLDREPL )                                       */ 01413000
*/*%INCLUDE SYSUT5  (CHKSTEP )                                       */ 01414000
*/*%INCLUDE SYSUT5  (REFORMAT)                                       */ 01415000
*/*%INCLUDE SYSUT5  (CPYDSICK)                                       */ 01416000
*/*%INCLUDE SYSUT5  (GETBUFUT)                                       */ 01417000
*/*%INCLUDE SYSUT5  (BLDOPCE )                                       */ 01418000
*                                                               01S0777 01419000
*       ;                                                       01S0777 01420000
@DATA    DS    0H                                                       01421000
@CH00060 DC    H'1'                                                     01422000
@CH00131 DC    H'2'                                                     01423000
@CH00331 DC    H'4'                                                     01424000
@CH00071 DC    H'6'                                                     01425000
@CH00045 DC    H'8'                                                     01426000
@CH00239 DC    H'12'                                                    01427000
@CH01700 DC    H'14'                                                    01428000
@CH01535 DC    XL2'4000'                                                01429000
@SB01711 MVZ   DIGITS+1(0,@14),DIGITS(@14)                              01430000
@SC01713 CLC   TTEDIALD(0,DEVDPADR),DIGITS(@14)                         01431000
@SM01717 MVC   TTEDIALR(0,@14),TTEDIAL(DEVDPADR)                        01432000
@DATD    DSECT                                                          01433000
         DS    0F                                                       01434000
@SA00002 DS    1F                                                       01435000
IGCFQ10D CSECT                                                          01436000
         DS    0F                                                       01437000
@CF01345 DC    XL4'08000002'                                            01438000
@DATD    DSECT                                                          01439000
         DS    0D                                                       01440000
ENTRYPTR DS    A                                                        01441000
DATASAVE DS    A                                                        01442000
UNITSAVE DS    A                                                        01443000
PTRSAVSV DS    A                                                        01444000
UNITSV   DS    A                                                        01445000
UNITSGET DS    H                                                        01446000
HALFUNIT DS    H                                                        01447000
DIALSP   DS    CL35                                                     01448000
         DS    CL1                                                      01449000
PARMLSP  DS    CL24                                                     01450000
FLAGS    DS    BL1                                                      01451000
         ORG   FLAGS                                                    01452000
FREUTFLG DS    BL1                                                      01453000
BLRPLFLG EQU   FLAGS+0                                                  01454000
FDRVTFLG EQU   FLAGS+0                                                  01455000
BUILTFLG EQU   FLAGS+0                                                  01456000
         ORG   FLAGS+1                                                  01457000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01458000
@ENDDATD EQU   *                                                        01459000
IGCFQ10D CSECT                                                          01460000
         DS    0F                                                       01461000
@SIZDATD DC    AL1(0)                                                   01462000
         DC    AL3(@ENDDATD-@DATD)                                      01463000
         DS    0D                                                       01464000
@CB01345 DC    X'08000002'                                              01465000
@CB01378 DC    X'0B8000'                                                01466000
CNTLMOD  DC    CL2'00'                                                  01467000
RPNCPMOD DC    CL2'FJ'                                                  01468000
RUDSPMOD DC    CL2'02'                                                  01469000
THISMOD  DC    CL2'FQ'                                                  01470000
         DS    CL1                                                      01471000
ADPATCH  DC    XL100'0'                                                 01472000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01473000
@01      EQU   01                                                       01474000
@02      EQU   02                                                       01475000
@03      EQU   03                                                       01476000
@04      EQU   04                                                       01477000
@05      EQU   05                                                       01478000
@06      EQU   06                                                       01479000
@07      EQU   07                                                       01480000
@08      EQU   08                                                       01481000
@09      EQU   09                                                       01482000
@10      EQU   10                                                       01483000
@11      EQU   11                                                       01484000
@12      EQU   12                                                       01485000
@13      EQU   13                                                       01486000
@14      EQU   14                                                       01487000
@15      EQU   15                                                       01488000
TRMTBLSV EQU   @06                                                      01489000
UNITPTR  EQU   @06                                                      01490000
ORGNOPCE EQU   @11                                                      01491000
DEVDPADR EQU   @09                                                      01492000
IEDQAPTR EQU   @04                                                      01493000
ROPCAVT  EQU   @02                                                      01494000
ROPCE    EQU   @03                                                      01495000
IEDPLMVP EQU   @10                                                      01496000
IEDQTPTR EQU   @08                                                      01497000
RZERO    EQU   @00                                                      01498000
RPARM    EQU   @01                                                      01499000
RAVT     EQU   @04                                                      01500000
RTRM     EQU   @08                                                      01501000
RWRKAREA EQU   @10                                                      01502000
RSAVE    EQU   @13                                                      01503000
RRET     EQU   @14                                                      01504000
RBRNCH   EQU   @15                                                      01505000
RTNCODE  EQU   @15                                                      01506000
RCL14SAV EQU   @11                                                      01507000
IEDQAVTD EQU   0                                                        01508000
AVTSAVEX EQU   IEDQAVTD+288                                             01509000
@NM00003 EQU   IEDQAVTD+388                                             01510000
AVTCKFLG EQU   @NM00003                                                 01511000
AVTBASE  EQU   IEDQAVTD+412                                             01512000
AVTPKF   EQU   AVTBASE                                                  01513000
AVTRNMPT EQU   IEDQAVTD+424                                             01514000
AVTNOLBF EQU   IEDQAVTD+454                                             01515000
AVTOSECB EQU   IEDQAVTD+492                                             01516000
AVTECB1  EQU   AVTOSECB                                                 01517000
AVTHG02  EQU   IEDQAVTD+528                                             01518000
AVTDISP  EQU   IEDQAVTD+552                                             01519000
AVTHD    EQU   IEDQAVTD+556                                             01520000
AVTSCOPT EQU   AVTHD                                                    01521000
AVTSAVTP EQU   IEDQAVTD+612                                             01522000
AVTSAVTF EQU   AVTSAVTP                                                 01523000
AVTCKPEL EQU   IEDQAVTD+652                                             01524000
AVTCKRMV EQU   AVTCKPEL                                                 01525000
AVTCKELF EQU   IEDQAVTD+680                                             01526000
AVTCKBYT EQU   IEDQAVTD+691                                             01527000
AVTHG01  EQU   IEDQAVTD+692                                             01528000
AVTCKLNK EQU   IEDQAVTD+696                                             01529000
AVTCRELE EQU   IEDQAVTD+708                                             01530000
AVTCCELE EQU   AVTCRELE                                                 01531000
AVTCLRHI EQU   IEDQAVTD+716                                             01532000
AVTADBUF EQU   IEDQAVTD+720                                             01533000
AVTSYSER EQU   IEDQAVTD+728                                             01534000
AVTCKPQB EQU   IEDQAVTD+804                                             01535000
AVTCKPTB EQU   AVTCKPQB                                                 01536000
AVTCKPEC EQU   AVTCKPQB+4                                               01537000
AVTCKPCC EQU   AVTCKPEC                                                 01538000
AVTOPCQB EQU   IEDQAVTD+816                                             01539000
AVTOPCOB EQU   AVTOPCQB                                                 01540000
AVTOPCEC EQU   AVTOPCQB+4                                               01541000
AVTOPCCC EQU   AVTOPCEC                                                 01542000
AVTOLTQB EQU   IEDQAVTD+828                                             01543000
AVTCWFL1 EQU   IEDQAVTD+924                                             01544000
AVTCWFL2 EQU   IEDQAVTD+925                                             01545000
AVTSUBT  EQU   IEDQAVTD+948                                             01546000
AVTIOTR  EQU   IEDQAVTD+949                                             01547000
AVTKEYLE EQU   IEDQAVTD+1032                                            01548000
AVTBIT1  EQU   IEDQAVTD+1050                                            01549000
AVTBIT2  EQU   IEDQAVTD+1051                                            01550000
AVTBIT3  EQU   IEDQAVTD+1052                                            01551000
AVTDDFT  EQU   IEDQAVTD+1064                                            01552000
AVTBIT4  EQU   IEDQAVTD+1136                                            01553000
@NM00085 EQU   IEDQAVTD+1232                                            01554000
IEDNSVTD EQU   0                                                        01555000
SAVTDIAG EQU   IEDNSVTD                                                 01556000
SAVTDIAF EQU   SAVTDIAG                                                 01557000
SAVTSAT  EQU   IEDNSVTD+80                                              01558000
SAVTLUSQ EQU   IEDNSVTD+88                                              01559000
SAVTMVBF EQU   IEDNSVTD+160                                             01560000
SAVTTCPU EQU   IEDNSVTD+238                                             01561000
SAVTZELM EQU   IEDNSVTD+270                                             01562000
SAVTRDRV EQU   IEDNSVTD+284                                             01563000
SAVTCKQB EQU   IEDNSVTD+300                                             01564000
SAVTCKTB EQU   SAVTCKQB                                                 01565000
SAVTCKEC EQU   SAVTCKQB+4                                               01566000
SAVTCKCC EQU   SAVTCKEC                                                 01567000
IEDBDU   EQU   0                                                        01568000
BDUCMND  EQU   IEDBDU                                                   01569000
BDUMODIF EQU   IEDBDU+1                                                 01570000
BDUFNFLG EQU   IEDBDU+2                                                 01571000
BDUHEADR EQU   BDUFNFLG                                                 01572000
BDUBDUFG EQU   IEDBDU+3                                                 01573000
BDURSP   EQU   IEDBDU+4                                                 01574000
BDUSYRSP EQU   BDURSP                                                   01575000
BDUEXRSP EQU   BDURSP+1                                                 01576000
BDUEND   EQU   IEDBDU+6                                                 01577000
IEDDSI1  EQU   0                                                        01578000
DSITOTNM EQU   IEDDSI1                                                  01579000
DSIPOLL  EQU   IEDDSI1+3                                                01580000
DSIPOLNM EQU   DSIPOLL                                                  01581000
IEDDSI2  EQU   0                                                        01582000
DSIADRNM EQU   IEDDSI2                                                  01583000
IEDDSI3  EQU   0                                                        01584000
DSINPTID EQU   IEDDSI3                                                  01585000
IEDDSI4  EQU   0                                                        01586000
DSIDIAL  EQU   IEDDSI4                                                  01587000
DSIDLCNT EQU   DSIDIAL                                                  01588000
IEDQOPCD EQU   0                                                        01589000
OPCAVTPT EQU   IEDQOPCD+8                                               01590000
OPCCOPCE EQU   IEDQOPCD+12                                              01591000
OPCPGCK  EQU   IEDQOPCD+40                                              01592000
OPCSAVE  EQU   IEDQOPCD+56                                              01593000
OPCWORK  EQU   IEDQOPCD+140                                             01594000
OPCAQCTL EQU   IEDQOPCD+180                                             01595000
OPCXCTL  EQU   IEDQOPCD+204                                             01596000
OPCLDNME EQU   IEDQOPCD+212                                             01597000
OPCMODID EQU   OPCLDNME+3                                               01598000
OPCGETBF EQU   IEDQOPCD+276                                             01599000
OPCFREBF EQU   IEDQOPCD+280                                             01600000
OPCSPEC  EQU   IEDQOPCD+300                                             01601000
OPCADGOT EQU   IEDQOPCD+318                                             01602000
OPCBUFWT EQU   IEDQOPCD+348                                             01603000
OPCDECR  EQU   IEDQOPCD+352                                             01604000
OPCPWCOB EQU   IEDQOPCD+368                                             01605000
OPCPWQCB EQU   OPCPWCOB                                                 01606000
OPCPWECB EQU   OPCPWCOB+4                                               01607000
IEDQOPCE EQU   0                                                        01608000
OCLINK   EQU   IEDQOPCE                                                 01609000
OCELEM   EQU   IEDQOPCE+4                                               01610000
OCELMPRI EQU   OCELEM                                                   01611000
OCUNIT   EQU   IEDQOPCE+8                                               01612000
OCRUDEST EQU   OCUNIT                                                   01613000
OCCKPKEY EQU   OCRUDEST                                                 01614000
OCSCAN   EQU   OCCKPKEY                                                 01615000
OCOPTCDE EQU   IEDQOPCE+12                                              01616000
OCPRIFLG EQU   OCOPTCDE                                                 01617000
OCSWITCH EQU   IEDQOPCE+13                                              01618000
OCFLAG   EQU   IEDQOPCE+14                                              01619000
@NM00122 EQU   IEDQOPCE+16                                              01620000
OCDEST   EQU   @NM00122                                                 01621000
OCREQVAL EQU   OCDEST+1                                                 01622000
OCTRMTBL EQU   IEDQOPCE+20                                              01623000
OCLINENO EQU   IEDQOPCE+22                                              01624000
OCTIOT   EQU   OCLINENO                                                 01625000
OCTRUNIT EQU   IEDQOPCE+24                                              01626000
OCRSID   EQU   OCTRUNIT                                                 01627000
OCALSTAT EQU   OCRSID                                                   01628000
OCREDRVE EQU   OCALSTAT                                                 01629000
OCACTREQ EQU   OCALSTAT                                                 01630000
OCPARM   EQU   IEDQOPCE+28                                              01631000
OCWTG    EQU   IEDQOPCE+30                                              01632000
OCBACKUP EQU   IEDQOPCE+32                                              01633000
OCBUFNED EQU   OCBACKUP                                                 01634000
OCBUFGOT EQU   OCBACKUP+2                                               01635000
OCMODNME EQU   IEDQOPCE+40                                              01636000
OCIPLWA  EQU   OCMODNME                                                 01637000
OCPTRSAV EQU   OCMODNME+4                                               01638000
OCCKDATA EQU   IEDQOPCE+48                                              01639000
OCRSTGTM EQU   OCCKDATA                                                 01640000
IEDQOPCN EQU   0                                                        01641000
OCLDNME  EQU   IEDQOPCN                                                 01642000
OCLINTTE EQU   OCLDNME                                                  01643000
OCRESPCT EQU   OCLINTTE                                                 01644000
OCREQFLG EQU   OCLINTTE+2                                               01645000
OCPREFLG EQU   OCLINTTE+3                                               01646000
IEDOPRED EQU   0                                                        01647000
OPRESAVE EQU   IEDOPRED+8                                               01648000
OPREFLG3 EQU   IEDOPRED+14                                              01649000
IEDPLMV  EQU   0                                                        01650000
PLMVTU   EQU   IEDPLMV                                                  01651000
PLMVTD   EQU   IEDPLMV+4                                                01652000
PLMVSU   EQU   IEDPLMV+8                                                01653000
PLMVSD   EQU   IEDPLMV+12                                               01654000
PLMVLNTH EQU   IEDPLMV+16                                               01655000
PLMVFLG1 EQU   IEDPLMV+18                                               01656000
PLMVSCTG EQU   PLMVFLG1                                                 01657000
PLMVTCTG EQU   PLMVFLG1                                                 01658000
IEDPRUQD EQU   0                                                        01659000
PRUTTCIN EQU   IEDPRUQD                                                 01660000
PRUDATCT EQU   IEDPRUQD+2                                               01661000
PRUTIC   EQU   IEDPRUQD+8                                               01662000
PRUNUNIT EQU   PRUTIC+1                                                 01663000
PRUDATA  EQU   IEDPRUQD+12                                              01664000
IEDPRUND EQU   0                                                        01665000
PRURHTH  EQU   IEDPRUND                                                 01666000
PRURH    EQU   PRURHTH                                                  01667000
PRURHFG0 EQU   PRURH                                                    01668000
PRURHFG1 EQU   PRURH+1                                                  01669000
PRURHFG2 EQU   PRURH+2                                                  01670000
PRUTH    EQU   PRURHTH+3                                                01671000
PRUFIDN  EQU   PRUTH                                                    01672000
IEDRH    EQU   0                                                        01673000
TRHBYTE0 EQU   IEDRH                                                    01674000
TRHBYTE1 EQU   IEDRH+1                                                  01675000
TRHBYTE2 EQU   IEDRH+2                                                  01676000
IEDRVTD  EQU   0                                                        01677000
RVTNUM   EQU   IEDRVTD                                                  01678000
RVTINDEX EQU   IEDRVTD+2                                                01679000
IEDSATD  EQU   0                                                        01680000
SATRNRVT EQU   IEDSATD+4                                                01681000
IEDTH    EQU   0                                                        01682000
TTHBYTE0 EQU   IEDTH                                                    01683000
TTHSNF   EQU   IEDTH+6                                                  01684000
TTHTAG   EQU   TTHSNF                                                   01685000
TTHTAG1  EQU   TTHTAG                                                   01686000
IEDQTRM  EQU   0                                                        01687000
TRMSTATE EQU   IEDQTRM                                                  01688000
TRMLOG   EQU   TRMSTATE                                                 01689000
TRMINSEQ EQU   IEDQTRM+4                                                01690000
TLISTCNT EQU   TRMINSEQ                                                 01691000
TRMOUTSQ EQU   IEDQTRM+6                                                01692000
TLISTEN  EQU   TRMOUTSQ                                                 01693000
TRMDSORG EQU   TLISTEN                                                  01694000
TRMALTD  EQU   IEDQTRM+8                                                01695000
TRMDEVFL EQU   IEDQTRM+10                                               01696000
TRMDDIG  EQU   TRMDEVFL                                                 01697000
TRMSTAT  EQU   IEDQTRM+12                                               01698000
IEDNTRM  EQU   0                                                        01699000
TRMBYTE4 EQU   IEDNTRM                                                  01700000
TRMBYTE3 EQU   IEDNTRM+1                                                01701000
TRMBYTE2 EQU   IEDNTRM+2                                                01702000
TRMINPG  EQU   TRMBYTE2                                                 01703000
TRMBYTE1 EQU   IEDNTRM+3                                                01704000
TRMSCPRQ EQU   TRMBYTE1                                                 01705000
TRMAUTOC EQU   TRMBYTE1                                                 01706000
TRMBYTE0 EQU   IEDNTRM+6                                                01707000
TRMSIBPT EQU   IEDNTRM+7                                                01708000
TRMTYPE  EQU   IEDNTRM+11                                               01709000
TTEDIAL  EQU   0                                                        01710000
TTEDIALN EQU   TTEDIAL                                                  01711000
TTEDIALD EQU   TTEDIAL+1                                                01712000
DIALDATA EQU   0                                                        01713000
COUNT    EQU   DIALDATA                                                 01714000
MAXIMUM  EQU   DIALDATA+1                                               01715000
TTEDIALR EQU   DIALDATA+2                                               01716000
ACTUAL   EQU   TTEDIALR                                                 01717000
DIGITS   EQU   TTEDIALR+1                                               01718000
TICFLD   EQU   0                                                        01719000
TIC      EQU   TICFLD+3                                                 01720000
ALLOCBUF EQU   0                                                        01721000
FREEBUFF EQU   0                                                        01722000
IEDQTNT  EQU   0                                                        01723000
IEDQTL   EQU   0                                                        01724000
DECRCT   EQU   0                                                        01725000
IEDMVBFR EQU   0                                                        01726000
PROGRTNE EQU   0                                                        01727000
RDSI1    EQU   PLMVSD                                                   01728000
RDSI2    EQU   PLMVSD                                                   01729000
RDSI3    EQU   PLMVSD                                                   01730000
RDSI4    EQU   PLMVSD                                                   01731000
OPCAQWD  EQU   OPCAQCTL                                                 01732000
OPCAQWD1 EQU   OPCAQWD                                                  01733000
OPCAQREQ EQU   OPCAQWD1                                                 01734000
OPCAQWD2 EQU   OPCAQWD+4                                                01735000
OPCAQWD3 EQU   OPCAQWD+8                                                01736000
OCCKPKY1 EQU   OCCKPKEY                                                 01737000
OCCKPTYP EQU   OCCKPKY1                                                 01738000
OCICACTN EQU   OCMODNME                                                 01739000
OCICDADR EQU   OCICACTN                                                 01740000
OCICSW   EQU   OCICDADR+3                                               01741000
IEDPRUQP EQU   OCUNIT                                                   01742000
ENTRYRVT EQU   OCMODNME                                                 01743000
IEDQRVTP EQU   ENTRYRVT                                                 01744000
IEDQSATP EQU   ENTRYPTR                                                 01745000
TRMPRE1  EQU   TRMBYTE4                                                 01746000
TRMNCP1  EQU   TRMBYTE4                                                 01747000
TRMPRE   EQU   TRMBYTE3                                                 01748000
TRMNCP   EQU   TRMBYTE3                                                 01749000
TRMPU    EQU   TRMBYTE3                                                 01750000
TRMLU    EQU   TRMBYTE3                                                 01751000
TRMLINK  EQU   TRMBYTE3                                                 01752000
ENTRYCT  EQU   UNITSGET                                                 01753000
BDUTEXT  EQU   BDUEND                                                   01754000
OCCIB    EQU   OCREQVAL                                                 01755000
TRMOPT   EQU   IEDQTRM+20                                               01756000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01757000
@NM00160 EQU   TRMLINK                                                  01758000
TRMLSTAT EQU   TRMLINK                                                  01759000
TRMLINT  EQU   TRMLINK                                                  01760000
TRMEPMOD EQU   TRMLINK                                                  01761000
TRMLULOG EQU   TRMLU                                                    01762000
TRMINERR EQU   TRMLU                                                    01763000
TRMLUREQ EQU   TRMLU                                                    01764000
TRMSESRQ EQU   TRMLU                                                    01765000
TRMTDIFF EQU   TRMLU                                                    01766000
TRMLUTM  EQU   TRMLU                                                    01767000
TRMLUIT  EQU   TRMLU                                                    01768000
TRMAUTO  EQU   TRMLU                                                    01769000
TRMPCONT EQU   TRMPU                                                    01770000
@NM00159 EQU   TRMPU                                                    01771000
TRMNCONT EQU   TRMNCP                                                   01772000
TRMQUCKN EQU   TRMNCP                                                   01773000
TRMSLOWN EQU   TRMNCP                                                   01774000
TRMSYGEN EQU   TRMNCP                                                   01775000
TRMNCPCL EQU   TRMNCP                                                   01776000
TRMIPLDM EQU   TRMNCP                                                   01777000
TRMINOUT EQU   TRMPRE                                                   01778000
TRMRDOUT EQU   TRMPRE                                                   01779000
TRMNLOUT EQU   TRMPRE                                                   01780000
TRMWROUT EQU   TRMPRE                                                   01781000
TRMASNXI EQU   TRMPRE                                                   01782000
TRMSTMM  EQU   TRMPRE                                                   01783000
TRMCMODE EQU   TRMPRE                                                   01784000
TRMSTPND EQU   TRMPRE                                                   01785000
@NM00158 EQU   TRMNCP1                                                  01786000
TRMINOP  EQU   TRMNCP1                                                  01787000
TRMLYNCH EQU   TRMPRE1                                                  01788000
TRMSPOUT EQU   TRMPRE1                                                  01789000
TRMERLCK EQU   TRMPRE1                                                  01790000
TRMQNPL  EQU   TRMPRE1                                                  01791000
TRMSPACT EQU   TRMPRE1                                                  01792000
TRMOCNI  EQU   TRMPRE1                                                  01793000
TRMSESSN EQU   TRMPRE1                                                  01794000
TRMCONT  EQU   TRMPRE1                                                  01795000
OCICINAC EQU   OCICSW                                                   01796000
@NM00128 EQU   OCICSW                                                   01797000
OCICATST EQU   OCICDADR+1                                               01798000
OCICTYPE EQU   OCICDADR                                                 01799000
@NM00127 EQU   OCCKPKY1                                                 01800000
OCCKPENV EQU   OCCKPKY1                                                 01801000
OCCKPRST EQU   OCCKPTYP                                                 01802000
OCCKPNCP EQU   OCCKPTYP                                                 01803000
OCCKPINC EQU   OCCKPTYP                                                 01804000
OPCAQLST EQU   OPCAQWD3+1                                               01805000
OPCAQRQ3 EQU   OPCAQWD3                                                 01806000
OPCAQSEC EQU   OPCAQWD2+1                                               01807000
OPCAQRQ2 EQU   OPCAQWD2                                                 01808000
OPCAQFST EQU   OPCAQWD1+1                                               01809000
@NM00161 EQU   TICFLD                                                   01810000
TRMSUBST EQU   IEDNTRM+12                                               01811000
TRMRLMCT EQU   IEDNTRM+10                                               01812000
TRMCOHTG EQU   TRMSIBPT+1                                               01813000
TRMGPCNT EQU   TRMSIBPT                                                 01814000
TRMBUFRD EQU   TRMBYTE0                                                 01815000
TRMSNA   EQU   TRMBYTE0                                                 01816000
TRMGP    EQU   TRMBYTE0                                                 01817000
TRMDIAL  EQU   TRMBYTE0                                                 01818000
@NM00157 EQU   TRMBYTE0                                                 01819000
TRMOUTPT EQU   TRMBYTE0                                                 01820000
TRMINPUT EQU   TRMBYTE0                                                 01821000
TRMUDEF  EQU   TRMBYTE0                                                 01822000
TRMCOHRT EQU   IEDNTRM+4                                                01823000
TRMSTOTE EQU   TRMBYTE1                                                 01824000
TRMCKPRN EQU   TRMBYTE1                                                 01825000
TRMTSATN EQU   TRMBYTE1                                                 01826000
TRMTRACE EQU   TRMBYTE1                                                 01827000
TRMSWBCK EQU   TRMBYTE1                                                 01828000
TRMINPTP EQU   TRMBYTE1                                                 01829000
TRMWTNEG EQU   TRMSCPRQ                                                 01830000
TRMWRBRK EQU   TRMBYTE2                                                 01831000
TRMNOSND EQU   TRMBYTE2                                                 01832000
TRMPREP  EQU   TRMBYTE2                                                 01833000
TRMGPACT EQU   TRMBYTE2                                                 01834000
TRMANDL  EQU   TRMBYTE2                                                 01835000
TRMCLOSN EQU   TRMINPG                                                  01836000
TRMREMB  EQU   TRMBYTE2                                                 01837000
TRMRSACT EQU   TRMBYTE2                                                 01838000
TRMOPTBL EQU   IEDQTRM+18                                               01839000
TRMOPNO  EQU   IEDQTRM+17                                               01840000
TRMCHCIN EQU   IEDQTRM+16                                               01841000
TRMSENSE EQU   TRMSTAT+3                                                01842000
TRMTEMPR EQU   TRMSTAT+2                                                01843000
TRMSIO   EQU   TRMSTAT                                                  01844000
@NM00156 EQU   TRMDEVFL+1                                               01845000
TRMTPIN  EQU   TRMDEVFL+1                                               01846000
TRMNCPI  EQU   TRMDEVFL+1                                               01847000
TRMRNTRM EQU   TRMDEVFL+1                                               01848000
@NM00155 EQU   TRMDEVFL+1                                               01849000
TRMLMD   EQU   TRMDEVFL+1                                               01850000
TRMCONC  EQU   TRMDEVFL+1                                               01851000
TRMTSOB  EQU   TRMDEVFL                                                 01852000
TRMBFDY  EQU   TRMDEVFL                                                 01853000
TRMTBLK  EQU   TRMDEVFL                                                 01854000
TRMSBLK  EQU   TRMDEVFL                                                 01855000
TRMBLKS  EQU   TRMDEVFL                                                 01856000
TRMADDC  EQU   TRMDEVFL                                                 01857000
TRMBUFS  EQU   TRMDEVFL                                                 01858000
TRMPRILK EQU   TRMALTD                                                  01859000
TRMLGB   EQU   TRMDSORG                                                 01860000
TRMUTERM EQU   TLISTCNT                                                 01861000
TRMDESTQ EQU   IEDQTRM+1                                                01862000
TRMSCNYN EQU   TRMSTATE                                                 01863000
TRMOPTFN EQU   TRMSTATE                                                 01864000
TRMHELDN EQU   TRMSTATE                                                 01865000
TRMACPTN EQU   TRMSTATE                                                 01866000
TRMPREF  EQU   TRMSTATE                                                 01867000
TRMPROC  EQU   TRMLOG                                                   01868000
TRMLIST  EQU   TRMLOG                                                   01869000
TRMLINE  EQU   TRMSTATE                                                 01870000
TTHDCF   EQU   IEDTH+8                                                  01871000
TTHTAG2  EQU   TTHTAG+1                                                 01872000
@NM00154 EQU   TTHTAG1                                                  01873000
TTHTAGS  EQU   TTHTAG1                                                  01874000
TTHOAF   EQU   IEDTH+4                                                  01875000
TTHDAF   EQU   IEDTH+2                                                  01876000
TTHBYTE1 EQU   IEDTH+1                                                  01877000
TTHEFI   EQU   TTHBYTE0                                                 01878000
@NM00153 EQU   TTHBYTE0                                                 01879000
TTHEBIU  EQU   TTHBYTE0                                                 01880000
TTHBBIU  EQU   TTHBYTE0                                                 01881000
TTHFTYPE EQU   TTHBYTE0                                                 01882000
SATRNLCB EQU   IEDSATD                                                  01883000
@NM00152 EQU   TRHBYTE2                                                 01884000
@NM00151 EQU   TRHBYTE2                                                 01885000
@NM00150 EQU   TRHBYTE2                                                 01886000
TRHCSI   EQU   TRHBYTE2                                                 01887000
@NM00149 EQU   TRHBYTE2                                                 01888000
TRHCDI   EQU   TRHBYTE2                                                 01889000
TRHEB    EQU   TRHBYTE2                                                 01890000
TRHBB    EQU   TRHBYTE2                                                 01891000
TRHPI    EQU   TRHBYTE1                                                 01892000
@NM00148 EQU   TRHBYTE1                                                 01893000
@NM00147 EQU   TRHBYTE1                                                 01894000
@NM00146 EQU   TRHBYTE1                                                 01895000
TRHER    EQU   TRHBYTE1                                                 01896000
TRHDR2   EQU   TRHBYTE1                                                 01897000
@NM00145 EQU   TRHBYTE1                                                 01898000
TRHDR1   EQU   TRHBYTE1                                                 01899000
TRHEC    EQU   TRHBYTE0                                                 01900000
TRHBC    EQU   TRHBYTE0                                                 01901000
TRHSDI   EQU   TRHBYTE0                                                 01902000
TRHFI    EQU   TRHBYTE0                                                 01903000
@NM00144 EQU   TRHBYTE0                                                 01904000
TRHRUCAT EQU   TRHBYTE0                                                 01905000
TRHTYPE  EQU   TRHBYTE0                                                 01906000
@NM00143 EQU   IEDPRUND+4                                               01907000
PRUTHEFI EQU   PRUFIDN                                                  01908000
PRUTHUSS EQU   PRUFIDN                                                  01909000
PRUTHEIU EQU   PRUFIDN                                                  01910000
PRUTHBIU EQU   PRUFIDN                                                  01911000
PRUTHTYE EQU   PRUFIDN                                                  01912000
@NM00142 EQU   PRURHFG2                                                 01913000
PRURHCSI EQU   PRURHFG2                                                 01914000
@NM00141 EQU   PRURHFG2                                                 01915000
PRURHCDI EQU   PRURHFG2                                                 01916000
PRURHEB  EQU   PRURHFG2                                                 01917000
PRURHBB  EQU   PRURHFG2                                                 01918000
PRURHPI  EQU   PRURHFG1                                                 01919000
@NM00140 EQU   PRURHFG1                                                 01920000
PRURHER  EQU   PRURHFG1                                                 01921000
PRURHDR2 EQU   PRURHFG1                                                 01922000
@NM00139 EQU   PRURHFG1                                                 01923000
PRURHDR1 EQU   PRURHFG1                                                 01924000
PRURHEC  EQU   PRURHFG0                                                 01925000
PRURHBC  EQU   PRURHFG0                                                 01926000
PRURHSDI EQU   PRURHFG0                                                 01927000
PRURHFI  EQU   PRURHFG0                                                 01928000
@NM00138 EQU   PRURHFG0                                                 01929000
PRURUCAT EQU   PRURHFG0                                                 01930000
PRURHTYP EQU   PRURHFG0                                                 01931000
@NM00137 EQU   PRUTIC                                                   01932000
@NM00136 EQU   IEDPRUQD+4                                               01933000
PLMVUNCA EQU   IEDPLMV+20                                               01934000
PLMVFLG2 EQU   IEDPLMV+19                                               01935000
@NM00135 EQU   PLMVFLG1                                                 01936000
PLMVUNCF EQU   PLMVFLG1                                                 01937000
@NM00134 EQU   OPREFLG3                                                 01938000
OPREATCH EQU   OPREFLG3                                                 01939000
@NM00133 EQU   OPREFLG3                                                 01940000
OPREFLG2 EQU   IEDOPRED+13                                              01941000
OPREFLG1 EQU   IEDOPRED+12                                              01942000
OPRETIC  EQU   OPRESAVE                                                 01943000
OPRELINK EQU   IEDOPRED+5                                               01944000
OPREPRI  EQU   IEDOPRED+4                                               01945000
OPREQCB  EQU   IEDOPRED+1                                               01946000
OPREKEY  EQU   IEDOPRED                                                 01947000
@NM00132 EQU   OCLDNME+4                                                01948000
@NM00131 EQU   OCPREFLG                                                 01949000
OCTOTEP  EQU   OCPREFLG                                                 01950000
OCREPOST EQU   OCPREFLG                                                 01951000
OCRSPSNT EQU   OCPREFLG                                                 01952000
OCBFREQ  EQU   OCPREFLG                                                 01953000
OCIDLE   EQU   OCREQFLG                                                 01954000
OCFORCE  EQU   OCREQFLG                                                 01955000
OCDCARD  EQU   OCREQFLG                                                 01956000
OCPARTAL EQU   OCREQFLG                                                 01957000
OCADNCP  EQU   OCREQFLG                                                 01958000
@NM00130 EQU   OCREQFLG                                                 01959000
@NM00129 EQU   OCREQFLG                                                 01960000
OCFLUSHZ EQU   OCREQFLG                                                 01961000
OCCKPTWA EQU   OCCKDATA+4                                               01962000
@NM00126 EQU   OCRSTGTM+2                                               01963000
OCCKDAT2 EQU   OCRSTGTM+1                                               01964000
OCCKDAT1 EQU   OCRSTGTM                                                 01965000
OCPUADR  EQU   OCIPLWA+2                                                01966000
OCWTGSAV EQU   OCIPLWA                                                  01967000
OCDVRDCT EQU   OCBACKUP+6                                               01968000
OCNCP    EQU   OCBACKUP+4                                               01969000
OCRESNUM EQU   OCPARM                                                   01970000
OCSEQ    EQU   OCTRUNIT+2                                               01971000
@NM00125 EQU   OCRSID+1                                                 01972000
OCNONE   EQU   OCALSTAT                                                 01973000
OCSOME   EQU   OCALSTAT                                                 01974000
OCALLFLG EQU   OCALSTAT                                                 01975000
OCSEQIND EQU   OCALSTAT                                                 01976000
@NM00124 EQU   OCALSTAT                                                 01977000
OCRENTRD EQU   OCALSTAT                                                 01978000
OCWTGB   EQU   OCTIOT                                                   01979000
@NM00123 EQU   @NM00122+2                                               01980000
OCCONID  EQU   OCDEST                                                   01981000
OCRLN    EQU   IEDQOPCE+15                                              01982000
OCRESP   EQU   OCFLAG                                                   01983000
OCATTACH EQU   OCFLAG                                                   01984000
OCSSCP   EQU   OCFLAG                                                   01985000
OCOUTPUT EQU   OCFLAG                                                   01986000
OCLINE   EQU   OCFLAG                                                   01987000
OCMPP    EQU   OCFLAG                                                   01988000
OCTOTE   EQU   OCFLAG                                                   01989000
OCCONSOL EQU   OCFLAG                                                   01990000
@NM00121 EQU   OCSWITCH                                                 01991000
OCQUCKN  EQU   OCSWITCH                                                 01992000
@NM00120 EQU   OCRUDEST+1                                               01993000
@NM00119 EQU   OCSCAN                                                   01994000
OCNOTUCB EQU   OCSCAN                                                   01995000
OCNONAME EQU   OCSCAN                                                   01996000
OCALLRLN EQU   OCSCAN                                                   01997000
OCDDNAME EQU   OCSCAN                                                   01998000
OCDDNRLN EQU   OCSCAN                                                   01999000
OCADDR   EQU   OCSCAN                                                   02000000
OCELMPTR EQU   OCELEM+1                                                 02001000
OPCBOTTM EQU   IEDQOPCD+1184                                            02002000
@NM00118 EQU   IEDQOPCD+1100                                            02003000
@NM00117 EQU   IEDQOPCD+948                                             02004000
@NM00116 EQU   IEDQOPCD+940                                             02005000
@NM00115 EQU   IEDQOPCD+380                                             02006000
@NM00114 EQU   OPCPWCOB+9                                               02007000
@NM00113 EQU   OPCPWCOB+8                                               02008000
@NM00112 EQU   OPCPWECB+1                                               02009000
OPCPWCCC EQU   OPCPWECB                                                 02010000
OPCPWCHN EQU   OPCPWQCB+1                                               02011000
OPCPWVTO EQU   OPCPWQCB                                                 02012000
OPCWAITV EQU   IEDQOPCD+364                                             02013000
OPCTOTCK EQU   IEDQOPCD+360                                             02014000
OPCAPXTL EQU   IEDQOPCD+356                                             02015000
OPCWRKSP EQU   IEDQOPCD+320                                             02016000
OPCRQCNT EQU   IEDQOPCD+316                                             02017000
OPPOLSTP EQU   IEDQOPCD+312                                             02018000
OPCCKCIB EQU   IEDQOPCD+308                                             02019000
OPCEND   EQU   IEDQOPCD+307                                             02020000
OPCSTCBS EQU   IEDQOPCD+306                                             02021000
OPCHNEND EQU   IEDQOPCD+302                                             02022000
OPCOQSW  EQU   IEDQOPCD+301                                             02023000
@NM00111 EQU   OPCSPEC                                                  02024000
@NM00110 EQU   OPCSPEC                                                  02025000
@NM00109 EQU   OPCSPEC                                                  02026000
@NM00108 EQU   OPCSPEC                                                  02027000
OPCFRMCA EQU   OPCSPEC                                                  02028000
OPCRSTRT EQU   OPCSPEC                                                  02029000
OPCPART  EQU   OPCSPEC                                                  02030000
OPCALTD  EQU   OPCSPEC                                                  02031000
OPCBFEND EQU   IEDQOPCD+296                                             02032000
OPCBFIRS EQU   IEDQOPCD+292                                             02033000
OPCAVBUF EQU   IEDQOPCD+290                                             02034000
OPCIPLCT EQU   IEDQOPCD+289                                             02035000
OPCCLNTS EQU   IEDQOPCD+288                                             02036000
OPCHA8   EQU   IEDQOPCD+286                                             02037000
OPCBFREQ EQU   IEDQOPCD+284                                             02038000
OPCNEXT  EQU   IEDQOPCD+272                                             02039000
OPCFMDFC EQU   IEDQOPCD+268                                             02040000
OPCSCNC  EQU   IEDQOPCD+264                                             02041000
OPCHORTG EQU   IEDQOPCD+260                                             02042000
OPCHORT  EQU   IEDQOPCD+256                                             02043000
OPCCKPTL EQU   IEDQOPCD+252                                             02044000
OPCCKPTF EQU   IEDQOPCD+248                                             02045000
OPCWAITA EQU   IEDQOPCD+244                                             02046000
OPCWAITR EQU   IEDQOPCD+240                                             02047000
OPCWAITP EQU   IEDQOPCD+236                                             02048000
OPCWAITO EQU   IEDQOPCD+232                                             02049000
OPCWAITN EQU   IEDQOPCD+228                                             02050000
OPCWAITL EQU   IEDQOPCD+224                                             02051000
OPCWAITC EQU   IEDQOPCD+220                                             02052000
@NM00107 EQU   OPCLDNME+5                                               02053000
@NM00106 EQU   OPCLDNME                                                 02054000
OPCWAIT  EQU   IEDQOPCD+192                                             02055000
OPCCKERB EQU   IEDQOPCD+164                                             02056000
OPCBFERB EQU   IEDQOPCD+148                                             02057000
OPCFLAG2 EQU   IEDQOPCD+147                                             02058000
OPCFLAG1 EQU   IEDQOPCD+146                                             02059000
OPCWRKSZ EQU   IEDQOPCD+144                                             02060000
OPCRSAVE EQU   IEDQOPCD+132                                             02061000
OPCQCBAD EQU   IEDQOPCD+128                                             02062000
OPCTRMWA EQU   IEDQOPCD+52                                              02063000
OPCPSTWT EQU   IEDQOPCD+48                                              02064000
OPCTNTEA EQU   IEDQOPCD+44                                              02065000
OPCLCB   EQU   IEDQOPCD+36                                              02066000
@NM00105 EQU   IEDQOPCD+32                                              02067000
OPCIPLAD EQU   IEDQOPCD+28                                              02068000
OPCTOFLK EQU   IEDQOPCD+24                                              02069000
OPCOPTLK EQU   IEDQOPCD+20                                              02070000
OPCDCBLK EQU   IEDQOPCD+16                                              02071000
OPCDOUBL EQU   IEDQOPCD                                                 02072000
DSIDLDIG EQU   DSIDIAL+3                                                02073000
DSISLACT EQU   DSIDIAL+2                                                02074000
DSIDLMAX EQU   DSIDIAL+1                                                02075000
DSIMODID EQU   IEDDSI3+3                                                02076000
DSISEQNO EQU   IEDDSI3+1                                                02077000
DSIADDR  EQU   IEDDSI2+1                                                02078000
DSIPOLCH EQU   DSIPOLL+1                                                02079000
DSINETAD EQU   IEDDSI1+1                                                02080000
BDUXGRPH EQU   BDUEXRSP                                                 02081000
BDUXFINL EQU   BDUEXRSP                                                 02082000
BDUXINIT EQU   BDUEXRSP                                                 02083000
BDURESP  EQU   BDUSYRSP                                                 02084000
BDUPHASE EQU   BDUSYRSP                                                 02085000
BDUERROR EQU   BDUSYRSP                                                 02086000
BDUXERLK EQU   BDUBDUFG                                                 02087000
BDUALTAK EQU   BDUFNFLG                                                 02088000
BDUNEGAK EQU   BDUFNFLG                                                 02089000
BDUPOSAK EQU   BDUFNFLG                                                 02090000
BDUTPTX  EQU   BDUFNFLG                                                 02091000
BDUFRSTB EQU   BDUFNFLG                                                 02092000
BDULEADG EQU   BDUFNFLG                                                 02093000
BDUSTHDR EQU   BDUFNFLG                                                 02094000
SAVTBITN EQU   IEDNSVTD+312                                             02095000
@NM00104 EQU   SAVTCKQB+8                                               02096000
@NM00103 EQU   SAVTCKEC+1                                               02097000
@NM00102 EQU   SAVTCKCC                                                 02098000
SAVTCKPO EQU   SAVTCKCC                                                 02099000
SAVTCKWA EQU   SAVTCKCC                                                 02100000
SAVTCKCH EQU   SAVTCKTB+1                                               02101000
SAVTCKVT EQU   SAVTCKTB                                                 02102000
@NM00101 EQU   IEDNSVTD+297                                             02103000
SAVTRDFG EQU   SAVTRDRV+12                                              02104000
@NM00100 EQU   SAVTRDRV+5                                               02105000
SAVTRDPY EQU   SAVTRDRV+4                                               02106000
SAVTRDQB EQU   SAVTRDRV+1                                               02107000
SAVTRDKY EQU   SAVTRDRV                                                 02108000
SAVTNID  EQU   IEDNSVTD+280                                             02109000
SAVTDVAS EQU   IEDNSVTD+276                                             02110000
SAVTPLSZ EQU   IEDNSVTD+274                                             02111000
@NM00099 EQU   IEDNSVTD+273                                             02112000
SAVTSUBL EQU   IEDNSVTD+272                                             02113000
@NM00098 EQU   SAVTZELM+1                                               02114000
SAVTSUBM EQU   SAVTZELM                                                 02115000
SAVTMHDX EQU   IEDNSVTD+268                                             02116000
SAVTNAT1 EQU   IEDNSVTD+266                                             02117000
SAVTSH20 EQU   IEDNSVTD+264                                             02118000
SAVTLCBS EQU   IEDNSVTD+260                                             02119000
SAVTRNMP EQU   IEDNSVTD+256                                             02120000
SAVTTNTX EQU   IEDNSVTD+252                                             02121000
SAVTNAX  EQU   IEDNSVTD+248                                             02122000
SAVTSUBV EQU   IEDNSVTD+247                                             02123000
SAVTSUBA EQU   IEDNSVTD+246                                             02124000
SAVTSIBC EQU   IEDNSVTD+244                                             02125000
SAVTBSM  EQU   IEDNSVTD+240                                             02126000
SAVTSCPT EQU   SAVTTCPU                                                 02127000
SAVTRQTG EQU   IEDNSVTD+236                                             02128000
SAVTRQCH EQU   IEDNSVTD+232                                             02129000
SAVTMAND EQU   IEDNSVTD+228                                             02130000
SAVTSPLN EQU   IEDNSVTD+224                                             02131000
SAVTNADL EQU   IEDNSVTD+222                                             02132000
SAVTNATL EQU   IEDNSVTD+220                                             02133000
SAVTMHTB EQU   IEDNSVTD+216                                             02134000
SAVTSSMH EQU   IEDNSVTD+212                                             02135000
SAVTQRS  EQU   IEDNSVTD+208                                             02136000
SAVTRQIN EQU   IEDNSVTD+204                                             02137000
SAVTDFCO EQU   IEDNSVTD+200                                             02138000
SAVTSAO  EQU   IEDNSVTD+196                                             02139000
SAVTSARI EQU   IEDNSVTD+192                                             02140000
SAVTSAC  EQU   IEDNSVTD+188                                             02141000
SAVTSAI  EQU   IEDNSVTD+184                                             02142000
SAVTCSCI EQU   IEDNSVTD+180                                             02143000
SAVTSSRP EQU   IEDNSVTD+176                                             02144000
SAVTSSRQ EQU   IEDNSVTD+172                                             02145000
SAVTSCLU EQU   IEDNSVTD+168                                             02146000
SAVTXTRQ EQU   IEDNSVTD+164                                             02147000
@NM00097 EQU   IEDNSVTD+148                                             02148000
SAVTIPCQ EQU   IEDNSVTD+144                                             02149000
@NM00096 EQU   IEDNSVTD+136                                             02150000
SAVTXFMI EQU   IEDNSVTD+132                                             02151000
@NM00095 EQU   IEDNSVTD+124                                             02152000
SAVTXFMO EQU   IEDNSVTD+120                                             02153000
@NM00094 EQU   IEDNSVTD+116                                             02154000
SAVTSSSR EQU   IEDNSVTD+112                                             02155000
SAVTSCPQ EQU   IEDNSVTD+108                                             02156000
SAVTSLCB EQU   IEDNSVTD+104                                             02157000
SAVTLUSR EQU   IEDNSVTD+100                                             02158000
@NM00093 EQU   SAVTLUSQ+8                                               02159000
SAVTLUSP EQU   SAVTLUSQ+4                                               02160000
SAVTLUSB EQU   SAVTLUSQ                                                 02161000
@NM00092 EQU   IEDNSVTD+84                                              02162000
SAVTNAT  EQU   IEDNSVTD+76                                              02163000
SAVTCLUP EQU   IEDNSVTD+72                                              02164000
SAVTPIUT EQU   IEDNSVTD+68                                              02165000
SAVTRNTA EQU   IEDNSVTD+64                                              02166000
SAVTDNIR EQU   IEDNSVTD+60                                              02167000
SAVTCNIR EQU   IEDNSVTD+56                                              02168000
SAVTFLDH EQU   IEDNSVTD+52                                              02169000
SAVTSRTN EQU   IEDNSVTD+48                                              02170000
SAVTSREQ EQU   IEDNSVTD+44                                              02171000
SAVTFAIL EQU   IEDNSVTD+42                                              02172000
SAVTSUSE EQU   IEDNSVTD+40                                              02173000
SAVTSIB  EQU   IEDNSVTD+36                                              02174000
SAVTPRTN EQU   IEDNSVTD+32                                              02175000
@NM00091 EQU   IEDNSVTD+28                                              02176000
SAVTWH20 EQU   IEDNSVTD+26                                              02177000
SAVTPWT  EQU   IEDNSVTD+24                                              02178000
SAVTPRTQ EQU   IEDNSVTD+20                                              02179000
SAVTPREQ EQU   IEDNSVTD+16                                              02180000
SAVTPH20 EQU   IEDNSVTD+14                                              02181000
SAVTPUSE EQU   IEDNSVTD+12                                              02182000
SAVTPLCB EQU   IEDNSVTD+8                                               02183000
SAVTPOOL EQU   IEDNSVTD+4                                               02184000
SAVTPRMT EQU   SAVTDIAF                                                 02185000
SAVTVIRT EQU   SAVTDIAF                                                 02186000
AVTCPBNO EQU   IEDQAVTD+1244                                            02187000
AVTHRESS EQU   IEDQAVTD+1243                                            02188000
@NM00090 EQU   IEDQAVTD+1242                                            02189000
@NM00089 EQU   IEDQAVTD+1241                                            02190000
@NM00088 EQU   IEDQAVTD+1240                                            02191000
@NM00087 EQU   IEDQAVTD+1237                                            02192000
@NM00086 EQU   IEDQAVTD+1236                                            02193000
AVTHRESE EQU   @NM00085                                                 02194000
AVTRADDR EQU   IEDQAVTD+1228                                            02195000
AVTNADDR EQU   IEDQAVTD+1224                                            02196000
AVTHRESN EQU   IEDQAVTD+1220                                            02197000
AVTVOLRN EQU   IEDQAVTD+1216                                            02198000
AVTTOTNN EQU   IEDQAVTD+1212                                            02199000
AVTTRCYN EQU   IEDQAVTD+1208                                            02200000
AVTRCTRN EQU   IEDQAVTD+1204                                            02201000
AVTNOVON EQU   IEDQAVTD+1200                                            02202000
AVTADEBN EQU   IEDQAVTD+1196                                            02203000
AVTVOLRR EQU   IEDQAVTD+1192                                            02204000
AVTTOTNR EQU   IEDQAVTD+1188                                            02205000
AVTTRCYR EQU   IEDQAVTD+1184                                            02206000
AVTRCTRR EQU   IEDQAVTD+1180                                            02207000
AVTNOVOR EQU   IEDQAVTD+1176                                            02208000
AVTADEBR EQU   IEDQAVTD+1172                                            02209000
AVTLODPT EQU   IEDQAVTD+1168                                            02210000
AVTIOBN  EQU   IEDQAVTD+1164                                            02211000
AVTIOBR  EQU   IEDQAVTD+1160                                            02212000
AVTCPBPT EQU   IEDQAVTD+1156                                            02213000
AVTFCPB  EQU   IEDQAVTD+1152                                            02214000
@NM00084 EQU   IEDQAVTD+1148                                            02215000
AVTINCPQ EQU   IEDQAVTD+1144                                            02216000
@NM00083 EQU   IEDQAVTD+1140                                            02217000
@NM00082 EQU   IEDQAVTD+1137                                            02218000
@NM00081 EQU   AVTBIT4                                                  02219000
@NM00080 EQU   AVTBIT4                                                  02220000
@NM00079 EQU   AVTBIT4                                                  02221000
@NM00078 EQU   AVTBIT4                                                  02222000
@NM00077 EQU   AVTBIT4                                                  02223000
@NM00076 EQU   AVTBIT4                                                  02224000
@NM00075 EQU   AVTBIT4                                                  02225000
AVTRUFTN EQU   AVTBIT4                                                  02226000
@NM00074 EQU   IEDQAVTD+1132                                            02227000
AVTNOBFQ EQU   IEDQAVTD+1128                                            02228000
@NM00073 EQU   IEDQAVTD+1124                                            02229000
AVTDKENQ EQU   IEDQAVTD+1120                                            02230000
@NM00072 EQU   IEDQAVTD+1116                                            02231000
AVTDKAPQ EQU   IEDQAVTD+1112                                            02232000
AVTCOPY  EQU   IEDQAVTD+1108                                            02233000
AVTIA    EQU   IEDQAVTD+1104                                            02234000
AVTFL    EQU   IEDQAVTD+1100                                            02235000
@NM00071 EQU   IEDQAVTD+1096                                            02236000
AVTNCPBQ EQU   IEDQAVTD+1092                                            02237000
AVTTOTNC EQU   IEDQAVTD+1088                                            02238000
AVTCMAX  EQU   IEDQAVTD+1084                                            02239000
AVTCMIN  EQU   IEDQAVTD+1080                                            02240000
AVTHM02  EQU   IEDQAVTD+1076                                            02241000
AVTOPCIN EQU   IEDQAVTD+1074                                            02242000
AVTDCTLN EQU   IEDQAVTD+1072                                            02243000
AVTOPMSK EQU   IEDQAVTD+1068                                            02244000
AVTSTEAL EQU   IEDQAVTD+1060                                            02245000
AVTOPTN  EQU   IEDQAVTD+1056                                            02246000
AVTDSKCT EQU   IEDQAVTD+1054                                            02247000
AVTCKRST EQU   IEDQAVTD+1053                                            02248000
AVTSTAN  EQU   AVTBIT3                                                  02249000
AVTSTACN EQU   AVTBIT3                                                  02250000
AVTSTAIN EQU   AVTBIT3                                                  02251000
AVTSTAYN EQU   AVTBIT3                                                  02252000
AVTOLTBN EQU   AVTBIT3                                                  02253000
AVTTSAB  EQU   AVTBIT3                                                  02254000
AVTRFULN EQU   AVTBIT3                                                  02255000
AVTRECVN EQU   AVTBIT3                                                  02256000
@NM00070 EQU   AVTBIT2                                                  02257000
@NM00069 EQU   AVTBIT2                                                  02258000
AVTOPEIN EQU   AVTBIT2                                                  02259000
AVTSTRTN EQU   AVTBIT2                                                  02260000
AVTTOPOL EQU   AVTBIT2                                                  02261000
AVTCOPYN EQU   AVTBIT2                                                  02262000
AVTREUSN EQU   AVTBIT2                                                  02263000
AVTEXTSC EQU   AVTBIT2                                                  02264000
AVTDISKN EQU   AVTBIT1                                                  02265000
AVTQUCKN EQU   AVTBIT1                                                  02266000
AVTCLOSN EQU   AVTBIT1                                                  02267000
AVTREADN EQU   AVTBIT1                                                  02268000
AVTDLAYN EQU   AVTBIT1                                                  02269000
AVTAQTAN EQU   AVTBIT1                                                  02270000
AVTTSON  EQU   AVTBIT1                                                  02271000
AVTAPLKN EQU   AVTBIT1                                                  02272000
AVTDUMBR EQU   IEDQAVTD+1048                                            02273000
AVTDLQX  EQU   IEDQAVTD+1046                                            02274000
AVTINTLV EQU   IEDQAVTD+1044                                            02275000
AVTSMCNT EQU   IEDQAVTD+1042                                            02276000
AVTAVFCT EQU   IEDQAVTD+1040                                            02277000
AVTOPCON EQU   IEDQAVTD+1038                                            02278000
AVTOPCNT EQU   IEDQAVTD+1036                                            02279000
AVTLNCNT EQU   IEDQAVTD+1034                                            02280000
AVTHA16  EQU   IEDQAVTD+1030                                            02281000
AVTHA7   EQU   IEDQAVTD+1028                                            02282000
AVTHA4   EQU   IEDQAVTD+1026                                            02283000
AVTHA3   EQU   IEDQAVTD+1024                                            02284000
AVTHA2   EQU   IEDQAVTD+1022                                            02285000
AVTGETMS EQU   IEDQAVTD+1021                                            02286000
@NM00068 EQU   IEDQAVTD+1020                                            02287000
AVTGETMD EQU   IEDQAVTD+1016                                            02288000
AVTGETMN EQU   IEDQAVTD+1012                                            02289000
AVTCWTOT EQU   IEDQAVTD+1008                                            02290000
AVTCWINT EQU   IEDQAVTD+956                                             02291000
AVTDTRAP EQU   IEDQAVTD+952                                             02292000
@NM00067 EQU   IEDQAVTD+950                                             02293000
@NM00066 EQU   AVTIOTR                                                  02294000
AVTIOTRH EQU   AVTIOTR                                                  02295000
AVTIOTRE EQU   AVTIOTR                                                  02296000
@NM00065 EQU   AVTSUBT                                                  02297000
AVTSUBPT EQU   AVTSUBT                                                  02298000
AVTSUBON EQU   AVTSUBT                                                  02299000
AVTAFE30 EQU   IEDQAVTD+944                                             02300000
AVTAFE20 EQU   IEDQAVTD+940                                             02301000
AVTAFE10 EQU   IEDQAVTD+936                                             02302000
AVTCWEC2 EQU   IEDQAVTD+932                                             02303000
AVTCWPM2 EQU   IEDQAVTD+928                                             02304000
AVTCWTS2 EQU   IEDQAVTD+927                                             02305000
AVTCWTS1 EQU   IEDQAVTD+926                                             02306000
AVTCWCLD EQU   AVTCWFL2                                                 02307000
AVTCWRAP EQU   AVTCWFL2                                                 02308000
@NM00064 EQU   AVTCWFL2                                                 02309000
@NM00063 EQU   AVTCWFL2                                                 02310000
@NM00062 EQU   AVTCWFL2                                                 02311000
@NM00061 EQU   AVTCWFL2                                                 02312000
@NM00060 EQU   AVTCWFL2                                                 02313000
AVTCWACT EQU   AVTCWFL2                                                 02314000
@NM00059 EQU   AVTCWFL1                                                 02315000
@NM00058 EQU   AVTCWFL1                                                 02316000
@NM00057 EQU   AVTCWFL1                                                 02317000
@NM00056 EQU   AVTCWFL1                                                 02318000
@NM00055 EQU   AVTCWFL1                                                 02319000
@NM00054 EQU   AVTCWFL1                                                 02320000
@NM00053 EQU   AVTCWFL1                                                 02321000
AVTCOMWN EQU   AVTCWFL1                                                 02322000
AVTCWEC1 EQU   IEDQAVTD+920                                             02323000
AVTCWPM1 EQU   IEDQAVTD+916                                             02324000
AVTCAREA EQU   IEDQAVTD+912                                             02325000
AVTFZERO EQU   IEDQAVTD+908                                             02326000
AVTCADDR EQU   IEDQAVTD+904                                             02327000
AVTCOREC EQU   IEDQAVTD+900                                             02328000
@NM00052 EQU   IEDQAVTD+892                                             02329000
AVTCPBCB EQU   IEDQAVTD+888                                             02330000
@NM00051 EQU   IEDQAVTD+880                                             02331000
AVTDSIOB EQU   IEDQAVTD+876                                             02332000
@NM00050 EQU   IEDQAVTD+868                                             02333000
AVTCPRMB EQU   IEDQAVTD+864                                             02334000
@NM00049 EQU   IEDQAVTD+856                                             02335000
AVTCLOSB EQU   IEDQAVTD+852                                             02336000
@NM00048 EQU   IEDQAVTD+844                                             02337000
AVTACTIB EQU   IEDQAVTD+840                                             02338000
@NM00047 EQU   IEDQAVTD+836                                             02339000
AVTOLTEB EQU   IEDQAVTD+832                                             02340000
AVTOLTCH EQU   AVTOLTQB+1                                               02341000
AVTOLTVT EQU   AVTOLTQB                                                 02342000
@NM00046 EQU   AVTOPCQB+8                                               02343000
@NM00045 EQU   AVTOPCEC+1                                               02344000
@NM00044 EQU   AVTOPCCC                                                 02345000
AVTOPCPO EQU   AVTOPCCC                                                 02346000
AVTOPCWA EQU   AVTOPCCC                                                 02347000
AVTOPCCH EQU   AVTOPCOB+1                                               02348000
AVTOPCVT EQU   AVTOPCOB                                                 02349000
@NM00043 EQU   AVTCKPQB+9                                               02350000
AVTCKPTS EQU   AVTCKPQB+8                                               02351000
@NM00042 EQU   AVTCKPEC+1                                               02352000
@NM00041 EQU   AVTCKPCC                                                 02353000
AVTCKPPO EQU   AVTCKPCC                                                 02354000
AVTCKPWA EQU   AVTCKPCC                                                 02355000
AVTCKPCH EQU   AVTCKPTB+1                                               02356000
AVTCKPVT EQU   AVTCKPTB                                                 02357000
@NM00040 EQU   IEDQAVTD+796                                             02358000
AVTBFRTB EQU   IEDQAVTD+792                                             02359000
@NM00039 EQU   IEDQAVTD+784                                             02360000
AVTBFREB EQU   IEDQAVTD+780                                             02361000
AVTTIMQ  EQU   IEDQAVTD+776                                             02362000
@NM00038 EQU   IEDQAVTD+772                                             02363000
AVTIMQPS EQU   IEDQAVTD+768                                             02364000
AVTINOUT EQU   IEDQAVTD+766                                             02365000
AVTREFTM EQU   IEDQAVTD+764                                             02366000
@NM00037 EQU   IEDQAVTD+752                                             02367000
AVTDELYB EQU   IEDQAVTD+748                                             02368000
AVTOCQPT EQU   IEDQAVTD+744                                             02369000
AVTTSOPT EQU   IEDQAVTD+740                                             02370000
AVTSUPPT EQU   IEDQAVTD+736                                             02371000
AVTCBQCB EQU   IEDQAVTD+732                                             02372000
AVTMSGS  EQU   IEDQAVTD+729                                             02373000
@NM00036 EQU   AVTSYSER                                                 02374000
@NM00035 EQU   AVTSYSER                                                 02375000
@NM00034 EQU   AVTSYSER                                                 02376000
@NM00033 EQU   AVTSYSER                                                 02377000
@NM00032 EQU   AVTSYSER                                                 02378000
@NM00031 EQU   AVTSYSER                                                 02379000
AVTCMAXN EQU   AVTSYSER                                                 02380000
AVTCMINN EQU   AVTSYSER                                                 02381000
AVT2260L EQU   IEDQAVTD+724                                             02382000
AVTABEPL EQU   AVTADBUF                                                 02383000
AVTHFF   EQU   AVTCLRHI+2                                               02384000
@NM00030 EQU   AVTCLRHI                                                 02385000
AVTCCLNK EQU   AVTCRELE+5                                               02386000
AVTCCPRI EQU   AVTCRELE+4                                               02387000
AVTCCQCB EQU   AVTCCELE+1                                               02388000
AVTCCKEY EQU   AVTCCELE                                                 02389000
AVTDELAD EQU   IEDQAVTD+704                                             02390000
AVTDELEM EQU   IEDQAVTD+700                                             02391000
AVTBSX   EQU   AVTCKLNK                                                 02392000
AVTOPETR EQU   AVTHG01                                                  02393000
@NM00029 EQU   AVTCKBYT                                                 02394000
AVTCKONQ EQU   AVTCKBYT                                                 02395000
@NM00028 EQU   AVTCKBYT                                                 02396000
@NM00027 EQU   AVTCKBYT                                                 02397000
@NM00026 EQU   AVTCKBYT                                                 02398000
@NM00025 EQU   AVTCKBYT                                                 02399000
@NM00024 EQU   AVTCKBYT                                                 02400000
@NM00023 EQU   AVTCKBYT                                                 02401000
AVTOPERT EQU   IEDQAVTD+690                                             02402000
AVTOPXCL EQU   IEDQAVTD+688                                             02403000
AVTOPERL EQU   IEDQAVTD+687                                             02404000
@NM00022 EQU   IEDQAVTD+686                                             02405000
AVTCKTIM EQU   IEDQAVTD+684                                             02406000
AVTCKELV EQU   IEDQAVTD+682                                             02407000
AVTCPRCD EQU   IEDQAVTD+681                                             02408000
AVTWARMN EQU   AVTCKELF                                                 02409000
AVTCRTLN EQU   AVTCKELF                                                 02410000
AVTCPIPN EQU   AVTCKELF                                                 02411000
AVTCCLCN EQU   AVTCKELF                                                 02412000
AVTCINCN EQU   AVTCKELF                                                 02413000
@NM00021 EQU   AVTCKELF                                                 02414000
AVTCMCPN EQU   AVTCKELF                                                 02415000
AVTCRDYN EQU   AVTCKELF                                                 02416000
AVTCKQAD EQU   IEDQAVTD+677                                             02417000
AVTSCBSZ EQU   IEDQAVTD+676                                             02418000
@NM00020 EQU   IEDQAVTD+672                                             02419000
AVTCKELE EQU   IEDQAVTD+668                                             02420000
@NM00019 EQU   AVTCKPEL+8                                               02421000
AVTCKRLK EQU   AVTCKPEL+5                                               02422000
AVTCKRPR EQU   AVTCKPEL+4                                               02423000
AVTCKRMQ EQU   AVTCKRMV+1                                               02424000
AVTCKRKY EQU   AVTCKRMV                                                 02425000
AVTHK    EQU   IEDQAVTD+648                                             02426000
AVTHI    EQU   IEDQAVTD+644                                             02427000
AVTIOT   EQU   IEDQAVTD+640                                             02428000
AVTNX    EQU   IEDQAVTD+636                                             02429000
AVTTONE  EQU   IEDQAVTD+632                                             02430000
AVTA3TL  EQU   IEDQAVTD+628                                             02431000
AVTDMECB EQU   IEDQAVTD+624                                             02432000
AVTABEND EQU   IEDQAVTD+618                                             02433000
AVTPLCBN EQU   IEDQAVTD+616                                             02434000
@NM00018 EQU   AVTSAVTP+1                                               02435000
@NM00017 EQU   AVTSAVTF                                                 02436000
AVTSNA   EQU   AVTSAVTF                                                 02437000
AVTONSNA EQU   AVTSAVTF                                                 02438000
AVTVTMCP EQU   AVTSAVTF                                                 02439000
@NM00016 EQU   IEDQAVTD+608                                             02440000
AVTCMBSS EQU   IEDQAVTD+604                                             02441000
AVTRCV   EQU   IEDQAVTD+600                                             02442000
AVTSEND  EQU   IEDQAVTD+596                                             02443000
AVTCSCH  EQU   IEDQAVTD+592                                             02444000
AVTQ1    EQU   IEDQAVTD+588                                             02445000
AVTE7    EQU   IEDQAVTD+584                                             02446000
AVTHB    EQU   IEDQAVTD+580                                             02447000
AVTR1    EQU   IEDQAVTD+576                                             02448000
AVTBZ    EQU   IEDQAVTD+572                                             02449000
AVTEZ    EQU   IEDQAVTD+568                                             02450000
AVTEC    EQU   IEDQAVTD+564                                             02451000
AVTEW    EQU   IEDQAVTD+560                                             02452000
AVTNDIAL EQU   AVTSCOPT                                                 02453000
AVTN2741 EQU   AVTSCOPT                                                 02454000
AVTCONCO EQU   AVTSCOPT                                                 02455000
AVTCONC  EQU   AVTSCOPT                                                 02456000
AVTCMBUF EQU   AVTSCOPT                                                 02457000
AVTAPDMP EQU   AVTSCOPT                                                 02458000
@NM00015 EQU   AVTSCOPT                                                 02459000
AVTHA    EQU   AVTDISP                                                  02460000
AVTEA    EQU   IEDQAVTD+548                                             02461000
AVTAX    EQU   IEDQAVTD+544                                             02462000
AVTA3    EQU   IEDQAVTD+540                                             02463000
AVTGD    EQU   IEDQAVTD+536                                             02464000
AVTAL    EQU   IEDQAVTD+532                                             02465000
AVTOLTST EQU   AVTHG02                                                  02466000
AVTE8    EQU   IEDQAVTD+524                                             02467000
AVTUI    EQU   IEDQAVTD+520                                             02468000
AVTCOMPT EQU   IEDQAVTD+516                                             02469000
AVTCRSRF EQU   IEDQAVTD+512                                             02470000
@NM00014 EQU   IEDQAVTD+508                                             02471000
AVTKA02  EQU   IEDQAVTD+504                                             02472000
AVTOPTPT EQU   IEDQAVTD+500                                             02473000
AVTPCBPT EQU   IEDQAVTD+496                                             02474000
@NM00013 EQU   AVTECB1                                                  02475000
AVTCOMP  EQU   AVTECB1                                                  02476000
@NM00012 EQU   AVTECB1                                                  02477000
AVTOPECA EQU   IEDQAVTD+488                                             02478000
AVTOLECA EQU   IEDQAVTD+484                                             02479000
AVTCKECA EQU   IEDQAVTD+480                                             02480000
AVTCWECA EQU   IEDQAVTD+476                                             02481000
AVTCWTCB EQU   IEDQAVTD+472                                             02482000
AVTOLTCB EQU   IEDQAVTD+468                                             02483000
AVTOCTCB EQU   IEDQAVTD+464                                             02484000
AVTCKTCB EQU   IEDQAVTD+460                                             02485000
AVTAS    EQU   IEDQAVTD+456                                             02486000
AVTNCKPR EQU   IEDQAVTD+453                                             02487000
AVTCIB   EQU   IEDQAVTD+452                                             02488000
AVTSPLPT EQU   IEDQAVTD+448                                             02489000
AVTMVBFR EQU   IEDQAVTD+444                                             02490000
AVTSBTA  EQU   IEDQAVTD+440                                             02491000
AVTRARTN EQU   IEDQAVTD+436                                             02492000
AVTBSCAN EQU   IEDQAVTD+432                                             02493000
AVTRDYA  EQU   IEDQAVTD+428                                             02494000
AVTDISTR EQU   IEDQAVTD+420                                             02495000
AVTPARM3 EQU   IEDQAVTD+416                                             02496000
@NM00011 EQU   AVTPKF                                                   02497000
@NM00010 EQU   AVTPKF                                                   02498000
@NM00009 EQU   AVTPKF                                                   02499000
AVTFTCHF EQU   AVTPKF                                                   02500000
@NM00008 EQU   AVTPKF                                                   02501000
@NM00007 EQU   AVTPKF                                                   02502000
@NM00006 EQU   AVTPKF                                                   02503000
@NM00005 EQU   AVTPKF                                                   02504000
AVTPARM  EQU   IEDQAVTD+408                                             02505000
AVTEXS2A EQU   IEDQAVTD+402                                             02506000
AVTEXA2S EQU   IEDQAVTD+396                                             02507000
AVTOCGET EQU   IEDQAVTD+392                                             02508000
AVTCKAVT EQU   @NM00003+1                                               02509000
@NM00004 EQU   AVTCKFLG                                                 02510000
AVTCKHLT EQU   AVTCKFLG                                                 02511000
AVTCKREQ EQU   AVTCKFLG                                                 02512000
AVTCKENV EQU   AVTCKFLG                                                 02513000
AVTCKNAC EQU   AVTCKFLG                                                 02514000
AVTCKTAC EQU   AVTCKFLG                                                 02515000
@NM00002 EQU   IEDQAVTD+384                                             02516000
AVTREADD EQU   IEDQAVTD+380                                             02517000
AVTREADY EQU   IEDQAVTD+376                                             02518000
AVTRACE  EQU   IEDQAVTD+372                                             02519000
AVTTCB   EQU   IEDQAVTD+368                                             02520000
AVTPASWD EQU   IEDQAVTD+360                                             02521000
AVTCTLCH EQU   IEDQAVTD+352                                             02522000
AVTDOUBL EQU   IEDQAVTD+344                                             02523000
AVTDOUBX EQU   IEDQAVTD+336                                             02524000
AVTDPARM EQU   IEDQAVTD+332                                             02525000
AVTCSTCS EQU   IEDQAVTD+328                                             02526000
AVTDLQ   EQU   AVTSAVEX+32                                              02527000
@NM00001 EQU   AVTSAVEX                                                 02528000
AVTSAVE4 EQU   IEDQAVTD+216                                             02529000
AVTSAVE3 EQU   IEDQAVTD+144                                             02530000
AVTSAVE2 EQU   IEDQAVTD+72                                              02531000
AVTSAVE1 EQU   IEDQAVTD                                                 02532000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02533000
@RC00517 EQU   @RC00482                                                 02534000
@RC00601 EQU   @RC00600                                                 02535000
@RC00635 EQU   @RC00634                                                 02536000
@RC00652 EQU   @RC00648                                                 02537000
@RC00738 EQU   @RC00733                                                 02538000
@RC00521 EQU   @RC00517                                                 02539000
@RC00519 EQU   @RC00517                                                 02540000
@RC00653 EQU   @RC00652                                                 02541000
@RC00527 EQU   @RC00521                                                 02542000
@RT00658 EQU   @RC00653                                                 02543000
@ENDDATA EQU   *                                                        02544000
         END   IGCFQ10D,(C'PLS1746',0701,77112)                         02545000
