         TITLE 'IGCI310D, ICHNG FOR SWITCHED ID                        *00001000
                        '                                               00002000
IGCI310D CSECT ,                                                   0001 00003000
@PROLOG  BALR  @11,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@11                                         0001 00006000
*                                  /*                        @Y17XAR5*/ 00007000
IGCI310D IEDHJN AFTERHJN,HJN       /*                        @Y17XAR5*/ 00008000
*   ROPCAVT=REG1;                   /* SET PTR TO OPCTL AVT  @Y17XAR5*/ 00009000
         LR    ROPCAVT,REG1                                        0332 00010000
*   ELMNT=OCCIB;                    /* ADDR OF CIB           @Y17XAR5*/ 00011000
         L     @12,OPCWORK(,ROPCAVT)                               0333 00012000
         L     @08,ROPCE(,ROPCAVT)                                 0333 00013000
         L     @06,OCCIB-1(,@08)                                   0333 00014000
         LA    @06,0(,@06)                                         0333 00015000
         ST    @06,ELMNT(,@12)                                     0333 00016000
*   UNIT=OCUNIT;                    /* ADDR OF RESPONSE UNIT @Y17XAR5*/ 00017000
         L     UNIT,OCUNIT(,@08)                                   0334 00018000
*   RWRK1=UNIT;                     /* EST. THE FIRST UNIT   @YM07777*/ 00019000
         LR    RWRK1,UNIT                                          0335 00020000
*   RAVT=OPCAVTPT;                  /* ADDR OF TCAM AVT      @Y17XAR5*/ 00021000
         L     RAVT,OPCAVTPT(,ROPCAVT)                             0336 00022000
*   IF OPCRSTRT='1'B THEN           /* IF RESTART, BRANCH    @Y17XAR5*/ 00023000
         TM    OPCRSTRT(ROPCAVT),B'00100000'                       0337 00024000
         BO    @RT00337                                            0337 00025000
*     GO TO RESTART;                /*                       @Y17XAR5*/ 00026000
*   DATA=ADDR(IEDBDU)+LENGTH(IEDBDU)+LVLBYTE;/* ADDR OF RESPONSE DATA   00027000
*                                                            @Y17XAR5*/ 00028000
         LA    DATA,19(,UNIT)                                      0339 00029000
*   RAREA=ELMNT->WFROM;             /* ADDR OF USER WORK AREA      0340 00030000
*                                                            @Y17XAR5*/ 00031000
         L     RAREA,WFROM(,@06)                                   0340 00032000
*   RFY                                                            0341 00033000
*     RFROM RSTD;                   /*                       @Y17XAR5*/ 00034000
*   RFROM=RAREA+8;                  /* ADDR OF FIRST ENTRY   @Y17XAR5*/ 00035000
         LA    RFROM,8(,RAREA)                                     0342 00036000
*   GENERATE;                                                      0343 00037000
         BAL   REG12,CHKUNIT       /* CHECK END OF UNIT EXCEEDED     */ 00038000
*   GO TO SWTCHID;                  /* GO PROCESS                    */ 00039000
         B     SWTCHID                                             0344 00040000
*   RFY                                                            0345 00041000
*     REG12 RSTD;                   /*                       @Y17XAR5*/ 00042000
*   RFY                                                            0346 00043000
*     RWRK1 RSTD;                   /*                       @Y17XAR5*/ 00044000
*CHKUNIT:                                                          0347 00045000
*   IF DATA>=ENDUNIT                /* PAST END OF UNIT?     @Y17XAR5*/ 00046000
*     THEN                                                         0347 00047000
CHKUNIT  L     @06,OPCWORK(,ROPCAVT)                               0347 00048000
         L     @15,ENDUNIT(,@06)                                   0347 00049000
         CR    DATA,@15                                            0347 00050000
         BL    @RF00347                                            0347 00051000
*     DO;                           /* YES,                          */ 00052000
*       DATA=RWRK1->PRFTIC+12+DATA-ENDUNIT;/* DATA ADDRESS FOR NEW 0349 00053000
*                                      UNIT                  @Y17XAR5*/ 00054000
         LA    @14,12                                              0349 00055000
         L     @01,PRFTIC(,RWRK1)                                  0349 00056000
         LR    @00,@01                                             0349 00057000
         ALR   @00,@14                                             0349 00058000
         ALR   @00,DATA                                            0349 00059000
         SLR   @00,@15                                             0349 00060000
         LR    DATA,@00                                            0349 00061000
*       ENDUNIT=RWRK1->PRFTIC+AVTKEYLE+12;/* END OF NEXT UNIT ADDRESS   00062000
*                                                            @Y17XAR5*/ 00063000
         LH    @15,AVTKEYLE(,RAVT)                                 0350 00064000
         ALR   @15,@01                                             0350 00065000
         ALR   @15,@14                                             0350 00066000
         ST    @15,ENDUNIT(,@06)                                   0350 00067000
*       RWRK1=RWRK1->PRFTIC;        /* NEXT UNIT ADDRESS             */ 00068000
         LR    RWRK1,@01                                           0351 00069000
*       GO TO CHKUNIT;                                             0352 00070000
         B     CHKUNIT                                             0352 00071000
*     END;                                                         0353 00072000
*   GENERATE;                                                      0354 00073000
@RF00347 DS    0H                                                  0354 00074000
         BR    REG12               /* RETURN TO CALLER               */ 00075000
*   RFY                                                            0355 00076000
*     REG12 UNRSTD;                 /*                       @Y17XAR5*/ 00077000
*SWTCHID:                                                          0356 00078000
*   OCICTYPE=OCICSID;               /* SET SWITCHID INDICATOR      0356 00079000
*                                                            @Y17XAR5*/ 00080000
SWTCHID  L     @12,ROPCE(,ROPCAVT)                                 0356 00081000
         MVI   OCICTYPE(@12),X'00'                                 0356 00082000
*   DATA=DATA+1;                    /* SKIP DESCRIPTOR BYTE  @Y17XAR5*/ 00083000
         LA    DATA,1(,DATA)                                       0357 00084000
*   GEN;                                                           0358 00085000
*                                  /*                        @Y17XAR5*/ 00086000
         BAL   REG12,CHKUNIT       /* CK END OF UNIT EXCEEDED@Y17XAR5*/ 00087000
*   DATA=DATA+DATA->FCOUNT+2;       /* SKIP DEVICE RECORD            */ 00088000
         LR    @12,DATA                                            0359 00089000
         SLR   @06,@06                                             0359 00090000
         IC    @06,FCOUNT(,DATA)                                   0359 00091000
         ALR   @12,@06                                             0359 00092000
         LA    @12,2(,@12)                                         0359 00093000
         LR    DATA,@12                                            0359 00094000
*   GENERATE;                                                      0360 00095000
         BAL   REG12,CHKUNIT       /* CHECK END OF UNIT EXCEEDED     */ 00096000
*MOVENTRY:                                                         0361 00097000
*   RLNGTH=RAREA->FIELD(3)-1;       /* DATA LENGTH MINUS INDEX BYTE     00098000
*                                                            @Y17XAR5*/ 00099000
MOVENTRY SLR   RLNGTH,RLNGTH                                       0361 00100000
         IC    RLNGTH,FIELD+2(,RAREA)                              0361 00101000
         BCTR  RLNGTH,0                                            0361 00102000
*   DATA=DATA+1;                    /* POINT TO ENTRY FLAGS          */ 00103000
         LA    DATA,1(,DATA)                                       0362 00104000
*   GEN;                                                           0363 00105000
*                                  /*                        @Y17XAR5*/ 00106000
         BAL   REG12,CHKUNIT       /* CK END OF UNIT EXCEEDED@Y17XAR5*/ 00107000
*   IF DATA->DEVASSO='1'B THEN                                     0364 00108000
         TM    DEVASSO(DATA),B'10000000'                           0364 00109000
         BNO   @RF00364                                            0364 00110000
*     DO;                           /* IS RSID IN DATA?      @Y17XAR5*/ 00111000
*       DATA=DATA+2;                /* MOVE PTR PAST RSID    @Y17XAR5*/ 00112000
         LA    DATA,2(,DATA)                                       0366 00113000
*       GEN;                                                       0367 00114000
*                                  /*                        @Y17XAR5*/ 00115000
         BAL   REG12,CHKUNIT       /* CK END OF UNIT EXCEEDED@Y17XAR5*/ 00116000
*     END;                          /*                       @Y17XAR5*/ 00117000
*MOVID:                                                            0369 00118000
*   DATA=DATA+1;                    /* UPDATE POINTER                */ 00119000
@RF00364 DS    0H                                                  0369 00120000
MOVID    LA    DATA,1(,DATA)                                       0369 00121000
*   GENERATE;                                                      0370 00122000
         BAL   REG12,CHKUNIT       /* CHECK END OF UNIT EXCEEDED     */ 00123000
*   DATA->FIELD(1)=RFROM->FIELD(1); /* MOVE ONE BYTE OF DATA         */ 00124000
         MVC   FIELD(1,DATA),FIELD(RFROM)                          0371 00125000
*   RFROM=RFROM+1;                  /* UPDATE POINTER                */ 00126000
         LA    @12,1                                               0372 00127000
         ALR   RFROM,@12                                           0372 00128000
*   RLNGTH=RLNGTH-1;                /* REDUCE AMOUNT TO MOVE         */ 00129000
         BCTR  RLNGTH,0                                            0373 00130000
*   IF RLNGTH^=0                    /* HAS ALL DATA BEEN MOVED       */ 00131000
*     THEN                                                         0374 00132000
         LTR   RLNGTH,RLNGTH                                       0374 00133000
         BNZ   @RT00374                                            0374 00134000
*     GO TO MOVID;                  /* NO, GO MOVE MORE              */ 00135000
*   RFROM=RFROM+1;                  /* BYPASS INDEX BYTE     @Y17XAR5*/ 00136000
         ALR   RFROM,@12                                           0376 00137000
*   IF RFROM->FIELD(1)='FE'X        /* END OF ACTIVE ENTRIES         */ 00138000
*     THEN                                                         0377 00139000
         CLI   FIELD(RFROM),X'FE'                                  0377 00140000
         BE    @RT00377                                            0377 00141000
*     GO TO ALLDONE;                /* YES-PROCESSING COMPLETE     0378 00142000
*                                                            @Y17XARL*/ 00143000
*   DATA=DATA+1;                    /* UPDATE POINTER                */ 00144000
         ALR   DATA,@12                                            0379 00145000
*   GENERATE;                                                      0380 00146000
         BAL   REG12,CHKUNIT       /* CHECK END OF UNIT EXCEEDED     */ 00147000
*   GO TO MOVENTRY;                 /* MOVE NEXT ENTRY               */ 00148000
         B     MOVENTRY                                            0381 00149000
*   RFY                                                            0382 00150000
*     RFROM UNRSTD;                 /*                       @Y17XAR5*/ 00151000
*ALLDONE:                                                          0383 00152000
*   ELMNT->WANSCD='14'X;            /* SET ENTRY CODE FOR ANSWER     */ 00153000
ALLDONE  L     @12,OPCWORK(,ROPCAVT)                               0383 00154000
         L     @12,ELMNT(,@12)                                     0383 00155000
         MVI   WANSCD(@12),X'14'                                   0383 00156000
*/* SET UP FOR EXIT TO '02'                                  @Y17XAR5*/ 00157000
*                                                                  0384 00158000
*   OCPARM=0;                       /* CLEAR OCPARM          @Y17XAR5*/ 00159000
         L     @08,ROPCE(,ROPCAVT)                                 0384 00160000
         SLR   @06,@06                                             0384 00161000
         STH   @06,OCPARM(,@08)                                    0384 00162000
*   OCRESP='0'B;                    /* RESET RESPONSE INDICATOR    0385 00163000
*                                                            @Y17XARL*/ 00164000
         NI    OCRESP(@08),B'11111110'                             0385 00165000
*   OCWTG=MODT0;                    /* NEXT MODULE IS T0     @Y17XAR5*/ 00166000
         MVC   OCWTG(2,@08),MODT0                                  0386 00167000
*   OCACTREQ='1'B;                  /* RETURN ON ERROR       @Y17XAR5*/ 00168000
         OI    OCACTREQ(@08),B'00001000'                           0387 00169000
*   PRURH=TRHFID0;                  /* SET RH                @Y17XAR5*/ 00170000
         LR    @08,UNIT                                            0388 00171000
         SL    @08,@CF00071                                        0388 00172000
         MVC   PRURH(3,@08),@CB01036                               0388 00173000
*   PRUTH=TTH0BYT0;                 /* SET TH                @Y17XAR5*/ 00174000
         MVI   PRUTH(@08),X'0C'                                    0389 00175000
*   BDUMODIF=CD0CRSII;              /* REPLACE SESSION INFO  @Y17XAR5*/ 00176000
         LA    @08,12                                              0390 00177000
         ALR   @08,UNIT                                            0390 00178000
         MVI   BDUMODIF(@08),X'02'                                 0390 00179000
*   BDUHEADR='1'B;                  /* HEADER                @Y17XAR5*/ 00180000
         OI    BDUHEADR(@08),B'01000000'                           0391 00181000
*   BDUSYRSP=''B;                   /* CLEAR RESPOSE         @Y17XAR5*/ 00182000
         MVI   BDUSYRSP(@08),X'00'                                 0392 00183000
*   OPCMODID=MODID02;               /* GO TO IGC0210D        @Y17XAR5*/ 00184000
         MVC   OPCMODID(2,ROPCAVT),MODID02                         0393 00185000
*   IF AVTSTAIN='1'B THEN           /* CAN CHKPT BE TAKEN?   @Y17XAR5*/ 00186000
         TM    AVTSTAIN(RAVT),B'00000100'                          0394 00187000
         BNO   @RF00394                                            0394 00188000
*     IF ELMNT->WRTCD='00'X THEN    /* YES, GOOD RETURN CODE?      0395 00189000
*                                                            @Y17XAR5*/ 00190000
         CLI   WRTCD(@12),X'00'                                    0395 00191000
         BNE   @RF00395                                            0395 00192000
*       CALL CHKPT;                 /* YES, SET UP FOR CHKPT @Y17XAR5*/ 00193000
         BAL   @14,CHKPT                                           0396 00194000
*XCTL:                              /*                       @Y17XAR5*/ 00195000
*   REG1=ROPCAVT;                   /* RETURN PARAMETER      @Y17XAR5*/ 00196000
@RF00395 DS    0H                                                  0397 00197000
@RF00394 DS    0H                                                  0397 00198000
XCTL     LR    REG1,ROPCAVT                                        0397 00199000
*   GEN REFS(OPCXCTL);                                             0398 00200000
*                                  /*                        @Y17XAR5*/ 00201000
         XCTL  SF=(E,OPCXCTL(ROPCAVT)) /*                    @Y17XAR5*/ 00202000
*ERREXIT:                                                          0399 00203000
*   ELMNT->WRTCD='1C'X;             /* SET RETURN CODE               */ 00204000
ERREXIT  L     @12,OPCWORK(,ROPCAVT)                               0399 00205000
         L     @12,ELMNT(,@12)                                     0399 00206000
         MVI   WRTCD(@12),X'1C'                                    0399 00207000
*   GO TO ALLDONE;                  /* TELL APPLICATION PROGRAM      */ 00208000
         B     ALLDONE                                             0400 00209000
*   RFY                                                            0401 00210000
*     REG1 RSTD;                    /*                       @Y17XAR5*/ 00211000
*CHKPT:                             /*                       @Y17XAR5*/ 00212000
*   SAVE14=REG14;                   /* SAVE RETURN REG       @Y17XARL*/ 00213000
CHKPT    ST    REG14,SAVE14(,ROPCAVT)                              0402 00214000
*   RWRK1=UNIT;                     /*                       @Y17XAR5*/ 00215000
         LR    RWRK1,UNIT                                          0403 00216000
*   REG1=0;                         /*                       @Y17XAR5*/ 00217000
         SLR   REG1,REG1                                           0404 00218000
*VALIDCHK:                          /*                       @Y17XAR5*/ 00219000
*   GEN REFS(RWRK1,OPCHNEND);                                      0405 00220000
VALIDCHK DS    0H                                                  0405 00221000
*                                  /*                        @Y17XAR5*/ 00222000
         EX    RWRK1,OPCHNEND(,ROPCAVT) /* RWRK1 VALID ADDR? @Y17XAR5*/ 00223000
         BC    7,GETBUF            /* NO                     @Y17XAR5*/ 00224000
*   REG1=REG1+1;                    /* YES- INCREMENT        @Y17XAR5*/ 00225000
         LA    REG1,1(,REG1)                                       0406 00226000
*   RWRK1=RWRK1->PRFTIC;            /* GET NXT UNIT ADDR     @Y17XAR5*/ 00227000
         L     RWRK1,PRFTIC(,RWRK1)                                0407 00228000
*   GO TO VALIDCHK;                 /* VALIDATE IT           @Y17XAR5*/ 00229000
         B     VALIDCHK                                            0408 00230000
*   RFY                                                            0409 00231000
*     RWRK1 UNRSTD;                 /*                       @Y17XAR5*/ 00232000
*GETBUF:                            /*                       @Y17XAR5*/ 00233000
*   CALL ALLOCBUF;                  /*                       @Y17XAR5*/ 00234000
GETBUF   L     @15,OPCGETBF(,ROPCAVT)                              0410 00235000
         BALR  @14,@15                                             0410 00236000
*   UNITADDR=REG1;                  /* SAVE 1ST UNIT ADDR    @Y17XAR5*/ 00237000
         L     @12,OPCWORK(,ROPCAVT)                               0411 00238000
         ST    REG1,UNITADDR(,@12)                                 0411 00239000
*   REG1=ADDR(MVPARAMS);            /* REF WORK AREA         @Y17XAR5*/ 00240000
         LA    REG1,MVPARAMS(,@12)                                 0412 00241000
*   IEDPLMV=''B;                    /* CLEAR WORK AREA       @Y17XAR5*/ 00242000
         XC    IEDPLMV(24,REG1),IEDPLMV(REG1)                      0413 00243000
*   PLMVTU=UNITADDR;                /* SET UP PARAMS FOR CALL      0414 00244000
*                                                            @Y17XAR5*/ 00245000
         L     @12,OPCWORK(,ROPCAVT)                               0414 00246000
         L     @12,UNITADDR(,@12)                                  0414 00247000
         ST    @12,PLMVTU(,REG1)                                   0414 00248000
*   PLMVTD=UNITADDR+12;             /* TO IEDMVBFR           @Y17XAR5*/ 00249000
         LA    @08,12                                              0415 00250000
         ALR   @12,@08                                             0415 00251000
         ST    @12,PLMVTD(,REG1)                                   0415 00252000
*   PLMVSU=UNIT;                    /*                       @Y17XAR5*/ 00253000
         ST    UNIT,PLMVSU(,REG1)                                  0416 00254000
*   PLMVSD=UNIT+12;                 /*                       @Y17XAR5*/ 00255000
         ALR   @08,UNIT                                            0417 00256000
         ST    @08,PLMVSD(,REG1)                                   0417 00257000
*   PLMVLNTH=PRUDATCT;              /*                       @Y17XAR5*/ 00258000
         LH    @12,PRUDATCT(,UNIT)                                 0418 00259000
         STH   @12,PLMVLNTH(,REG1)                                 0418 00260000
*   RSAVE=ADDR(OPCSAVE);            /* SET SAVEAREA ADDR     @Y17XAR5*/ 00261000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0419 00262000
*   CALL IEDMVBFR;                  /* NOW CALL IT           @Y17XAR5*/ 00263000
         L     @12,AVTSAVTP(,RAVT)                                 0420 00264000
         L     @15,SAVTMVBF(,@12)                                  0420 00265000
         BALR  @14,@15                                             0420 00266000
*   OCPTRSAV=UNITADDR;              /* 1ST UNIT ADDR IN OPCE @Y17XAR5*/ 00267000
         L     @12,ROPCE(,ROPCAVT)                                 0421 00268000
         L     @08,OPCWORK(,ROPCAVT)                               0421 00269000
         L     @08,UNITADDR(,@08)                                  0421 00270000
         ST    @08,OCPTRSAV(,@12)                                  0421 00271000
*   REG15=UNITADDR;                 /* REF 1ST UNIT          @Y17XAR5*/ 00272000
         LR    REG15,@08                                           0422 00273000
*   REG15->PRUTTCIN=PRUTTCIN;       /* MOVE FIELDS TO COPIED @Y17XAR5*/ 00274000
         LH    @14,PRUTTCIN(,UNIT)                                 0423 00275000
         N     @14,@CF01636                                        0423 00276000
         STH   @14,PRUTTCIN(,REG15)                                0423 00277000
*   REG15->PRUDATCT=PRUDATCT;       /* UNIT                  @Y17XAR5*/ 00278000
         LH    @14,PRUDATCT(,UNIT)                                 0424 00279000
         STH   @14,PRUDATCT(,REG15)                                0424 00280000
*   REG14=SAVE14;                   /* RESTORE RETURN REG    @Y17XARL*/ 00281000
         L     REG14,SAVE14(,ROPCAVT)                              0425 00282000
*   RETURN;                         /* RETURN                @Y17XARL*/ 00283000
@EL00001 DS    0H                                                  0426 00284000
@EF00001 DS    0H                                                  0426 00285000
@ER00001 BR    @14                                                 0426 00286000
*RESTART:                           /*                       @Y17XARW*/ 00287000
*   IF OCICTYPE=OCICLES THEN                                       0427 00288000
RESTART  L     @12,ROPCE(,ROPCAVT)                                 0427 00289000
         CLI   OCICTYPE(@12),1                                     0427 00290000
         BNE   @RF00427                                            0427 00291000
*     DO;                           /* IS THIS A LEASED LINE @Y17XARW*/ 00292000
*       RFY                                                        0429 00293000
*         REG0 RSTD;                /*                       @YM07394*/ 00294000
*       REG1=OCTRMTBL;              /* SETUP TTCIN           @Y17XARW*/ 00295000
         LH    REG1,OCTRMTBL(,@12)                                 0430 00296000
         N     REG1,@CF01636                                       0430 00297000
*       CALL IEDQTNT;               /* GET TNT               @Y17XARW*/ 00298000
         L     @15,AVTRNMPT(,RAVT)                                 0431 00299000
         BALR  @14,@15                                             0431 00300000
*       RTRM=REG1-LENGTH(IEDNTRM);  /* ADJUST TTE POINTER    @Y17XARW*/ 00301000
         LR    @12,REG1                                            0432 00302000
         SL    @12,@CF00617                                        0432 00303000
         ST    @12,RTRM(,ROPCAVT)                                  0432 00304000
*       IF OCICINAC='1'B THEN       /* IS THIS A DEACT REQUEST     0433 00305000
*                                                            @Y17XARW*/ 00306000
         L     @08,ROPCE(,ROPCAVT)                                 0433 00307000
         TM    OCICINAC(@08),B'00000001'                           0433 00308000
         BNO   @RF00433                                            0433 00309000
*         TRMRSACT='0'B;            /* MARK RESOURCE INACTIVE      0434 00310000
*                                                            @Y17XARW*/ 00311000
         LA    @03,TRMRSACT(,@12)                                  0434 00312000
         LR    @15,@03                                             0434 00313000
         LA    @08,3                                               0434 00314000
         NR    @15,@08                                             0434 00315000
         LCR   @15,@15                                             0434 00316000
         ALR   @03,@15                                             0434 00317000
         L     @08,0(,@03)                                         0434 00318000
@GL00001 LR    @06,@08                                             0434 00319000
         N     @06,@CB01637+3(@15)                                 0434 00320000
         CS    @08,@06,0(@03)                                      0434 00321000
         BNE   @GL00001                                            0434 00322000
*       ELSE                        /* INACT REQUEST                 */ 00323000
*         TRMRSACT='1'B;            /* MARK RESOURCE ACTIVE  @Y17XARW*/ 00324000
         B     @RC00433                                            0435 00325000
@RF00433 L     @15,RTRM(,ROPCAVT)                                  0435 00326000
         LA    @06,TRMRSACT(,@15)                                  0435 00327000
         LR    @03,@06                                             0435 00328000
         LA    @12,3                                               0435 00329000
         NR    @03,@12                                             0435 00330000
         LCR   @03,@03                                             0435 00331000
         ALR   @06,@03                                             0435 00332000
         L     @12,0(,@06)                                         0435 00333000
@GL00002 LR    @08,@12                                             0435 00334000
         O     @08,@CB01641+3(@03)                                 0435 00335000
         CS    @12,@08,0(@06)                                      0435 00336000
         BNE   @GL00002                                            0435 00337000
*       RFY                                                        0436 00338000
*         REG0 UNRSTD;              /*                       @YM07394*/ 00339000
@RC00433 DS    0H                                                  0437 00340000
*     END;                          /*                       @Y17XARW*/ 00341000
*   ELSE                                                           0438 00342000
*     DO;                           /* NOT A LEASED LINE     @Y17XARW*/ 00343000
         B     @RC00427                                            0438 00344000
@RF00427 DS    0H                                                  0439 00345000
*       TNTOUNT=OCUNIT;             /* SETUP UNIT PTR        @Y17XARW*/ 00346000
         L     @12,OPCWORK(,ROPCAVT)                               0439 00347000
         L     @08,ROPCE(,ROPCAVT)                                 0439 00348000
         L     @08,OCUNIT(,@08)                                    0439 00349000
         ST    @08,TNTOUNT(,@12)                                   0439 00350000
*       TNTOPTR=ADDR(CPINFO);       /* POINT TO IST TNT OFFSET     0440 00351000
*                                                            @Y17XARW*/ 00352000
         LA    @06,CPINFO(,@08)                                    0440 00353000
         ST    @06,TNTOPTR(,@12)                                   0440 00354000
*       TNTOLEN=CPLEN-3;            /* SETUP LENGTH OF DATA  @Y17XARW*/ 00355000
         SLR   @06,@06                                             0441 00356000
         IC    @06,CPLEN(,@08)                                     0441 00357000
         SL    @06,@CF00092                                        0441 00358000
         STH   @06,TNTOLEN(,@12)                                   0441 00359000
*       RCOUNT=CPNUMOFF;            /* SETUP NUMBER OF TNT OFFSETS 0442 00360000
*                                                            @Y17XARW*/ 00361000
         SLR   @06,@06                                             0442 00362000
         ICM   @06,3,CPNUMOFF(@08)                                 0442 00363000
         ST    @06,RCOUNT(,@12)                                    0442 00364000
*       DO UNTIL RCOUNT=0;          /* DO UNTIL NO MORE OFFSETS    0443 00365000
*                                                            @Y17XARW*/ 00366000
@DL00443 DS    0H                                                  0444 00367000
*         LENDATA=3;                /* SETUP MAX LENGTH      @Y17XARW*/ 00368000
         L     @12,OPCWORK(,ROPCAVT)                               0444 00369000
         MVI   LENDATA(@12),X'03'                                  0444 00370000
*         EPTR=ADDR(OFFSET);        /* SETUP TARGET POINTER  @Y17XARW*/ 00371000
         LA    @08,OFFSET(,@12)                                    0445 00372000
         ST    @08,EPTR(,ROPCAVT)                                  0445 00373000
*         LENMOVE=TNTOLEN;          /* SETUP LENGTH TO MOVE  @Y17XARW*/ 00374000
         LH    @08,TNTOLEN(,@12)                                   0446 00375000
         STC   @08,LENMOVE(,@12)                                   0446 00376000
*         IF LENMOVE>LENDATA THEN   /* IF TOTAL LENGTH > MAX LENGTH     00377000
*                                      THEN                  @Y17XARW*/ 00378000
         CLC   LENMOVE(1,@12),LENDATA(@12)                         0447 00379000
         BNH   @RF00447                                            0447 00380000
*           LENMOVE=LENDATA;        /* SETUP DATA LENGTH TO MAX    0448 00381000
*                                                            @Y17XARW*/ 00382000
         IC    @08,LENDATA(,@12)                                   0448 00383000
         STC   @08,LENMOVE(,@12)                                   0448 00384000
*         DO WHILE(LENMOVE>0);      /* MOVE ALL DATA         @Y17XARW*/ 00385000
@RF00447 B     @DE00449                                            0449 00386000
@DL00449 DS    0H                                                  0450 00387000
*           EPTR->MOVCHARS(1:LENMOVE)=TNTOPTR->MOVCHARS(1:LENMOVE);/*   00388000
*                                      MOVE DATA             @Y17XARW*/ 00389000
         L     @12,EPTR(,ROPCAVT)                                  0450 00390000
         L     @08,OPCWORK(,ROPCAVT)                               0450 00391000
         SLR   @06,@06                                             0450 00392000
         IC    @06,LENMOVE(,@08)                                   0450 00393000
         LR    @03,@06                                             0450 00394000
         BCTR  @03,0                                               0450 00395000
         L     @15,TNTOPTR(,@08)                                   0450 00396000
         EX    @03,@SM01645                                        0450 00397000
*           EPTR=EPTR+LENMOVE;      /* BUMP PTR              @Y17XARW*/ 00398000
         ALR   @12,@06                                             0451 00399000
         ST    @12,EPTR(,ROPCAVT)                                  0451 00400000
*           TNTOPTR=TNTOPTR+LENMOVE;/* BUMP PTR              @Y17XARW*/ 00401000
         ALR   @15,@06                                             0452 00402000
         ST    @15,TNTOPTR(,@08)                                   0452 00403000
*           TNTOLEN=TNTOLEN-LENMOVE;/* DECREMENT TOTAL LENGTH      0453 00404000
*                                                            @Y17XARW*/ 00405000
         LCR   @06,@06                                             0453 00406000
         AH    @06,TNTOLEN(,@08)                                   0453 00407000
         STH   @06,TNTOLEN(,@08)                                   0453 00408000
*           IF TNTOLEN<=0 THEN                                     0454 00409000
         LTR   @06,@06                                             0454 00410000
         BP    @RF00454                                            0454 00411000
*             DO;                   /* IF NO MORE DATA, CONTINUE   0455 00412000
*                                                            @Y17XARW*/ 00413000
*               TNTOUNT=CPTIC;      /* GET NEXT UNIT         @Y17XARW*/ 00414000
         L     @12,TNTOUNT(,@08)                                   0456 00415000
         L     @12,CPTIC(,@12)                                     0456 00416000
         ST    @12,TNTOUNT(,@08)                                   0456 00417000
*               TNTOPTR=ADDR(CPDATA)-TNTOLEN;/* GET DATA SOURCE PTR     00418000
*                                                            @Y17XARW*/ 00419000
         LA    @03,CPDATA(,@12)                                    0457 00420000
         SLR   @03,@06                                             0457 00421000
         ST    @03,TNTOPTR(,@08)                                   0457 00422000
*               TNTOLEN=CPLEN+TNTOLEN;/* RESET LENGTH        @Y17XARW*/ 00423000
         SLR   @03,@03                                             0458 00424000
         IC    @03,CPLEN(,@12)                                     0458 00425000
         ALR   @06,@03                                             0458 00426000
         STH   @06,TNTOLEN(,@08)                                   0458 00427000
*             END;                  /*                       @Y17XARW*/ 00428000
*           LENDATA=LENDATA-LENMOVE;/* RESET MOVE LENGTH     @Y17XARW*/ 00429000
@RF00454 L     @12,OPCWORK(,ROPCAVT)                               0460 00430000
         SLR   @08,@08                                             0460 00431000
         IC    @08,LENDATA(,@12)                                   0460 00432000
         SLR   @06,@06                                             0460 00433000
         IC    @06,LENMOVE(,@12)                                   0460 00434000
         SLR   @08,@06                                             0460 00435000
         STC   @08,LENDATA(,@12)                                   0460 00436000
*           LENMOVE=LENDATA;        /*                       @Y17XARW*/ 00437000
         STC   @08,LENMOVE(,@12)                                   0461 00438000
*         END;                      /*                       @Y17XARW*/ 00439000
@DE00449 L     @12,OPCWORK(,ROPCAVT)                               0462 00440000
         CLI   LENMOVE(@12),0                                      0462 00441000
         BH    @DL00449                                            0462 00442000
*         IF OFFSET^=0 THEN                                        0463 00443000
         LH    @12,OFFSET(,@12)                                    0463 00444000
         N     @12,@CF01636                                        0463 00445000
         LTR   @12,@12                                             0463 00446000
         BZ    @RF00463                                            0463 00447000
*           DO;                     /* ZERO TNT OFFSET       @Y17XARW*/ 00448000
*             RFY                                                  0465 00449000
*               REG0 RSTD;          /*                       @YM07394*/ 00450000
*             REG1=OFFSET;          /* SETUP OFFSET          @Y17XARW*/ 00451000
         LR    REG1,@12                                            0466 00452000
*             CALL IEDQTNT;         /* GET TTE ADDRESS       @Y17XARW*/ 00453000
         L     @15,AVTRNMPT(,RAVT)                                 0467 00454000
         BALR  @14,@15                                             0467 00455000
*             RTRM=REG1-LENGTH(IEDNTRM);/* ADJUST TTE POINTER      0468 00456000
*                                                            @Y17XARW*/ 00457000
         LR    @12,REG1                                            0468 00458000
         SL    @12,@CF00617                                        0468 00459000
         ST    @12,RTRM(,ROPCAVT)                                  0468 00460000
*             IF STATUS=TNTOINAC THEN                              0469 00461000
         L     @08,OPCWORK(,ROPCAVT)                               0469 00462000
         CLI   STATUS(@08),1                                       0469 00463000
         BNE   @RF00469                                            0469 00464000
*               TRMRSACT='0'B;      /* IF REQUEST IS INACTIVE MARK 0470 00465000
*                                      RESOURCE INACTIVE     @Y17XARW*/ 00466000
         LA    @03,TRMRSACT(,@12)                                  0470 00467000
         LR    @15,@03                                             0470 00468000
         LA    @08,3                                               0470 00469000
         NR    @15,@08                                             0470 00470000
         LCR   @15,@15                                             0470 00471000
         ALR   @03,@15                                             0470 00472000
         L     @08,0(,@03)                                         0470 00473000
@GL00003 LR    @06,@08                                             0470 00474000
         N     @06,@CB01637+3(@15)                                 0470 00475000
         CS    @08,@06,0(@03)                                      0470 00476000
         BNE   @GL00003                                            0470 00477000
*             ELSE                                                 0471 00478000
*               TRMRSACT='1'B;      /* MARK RESOURCE ACTIVE  @Y17XARW*/ 00479000
         B     @RC00469                                            0471 00480000
@RF00469 L     @15,RTRM(,ROPCAVT)                                  0471 00481000
         LA    @06,TRMRSACT(,@15)                                  0471 00482000
         LR    @03,@06                                             0471 00483000
         LA    @12,3                                               0471 00484000
         NR    @03,@12                                             0471 00485000
         LCR   @03,@03                                             0471 00486000
         ALR   @06,@03                                             0471 00487000
         L     @12,0(,@06)                                         0471 00488000
@GL00004 LR    @08,@12                                             0471 00489000
         O     @08,@CB01641+3(@03)                                 0471 00490000
         CS    @12,@08,0(@06)                                      0471 00491000
         BNE   @GL00004                                            0471 00492000
*             RFY                                                  0472 00493000
*               REG0 UNRSTD;        /*                       @YM07394*/ 00494000
@RC00469 DS    0H                                                  0473 00495000
*           END;                    /*                       @Y17XARW*/ 00496000
*         RCOUNT=RCOUNT-1;          /* DECREMENT COUNT       @Y17XARW*/ 00497000
@RF00463 L     @12,OPCWORK(,ROPCAVT)                               0474 00498000
         L     @08,RCOUNT(,@12)                                    0474 00499000
         BCTR  @08,0                                               0474 00500000
         ST    @08,RCOUNT(,@12)                                    0474 00501000
*       END;                        /*                       @Y17XARW*/ 00502000
@DE00443 L     @12,OPCWORK(,ROPCAVT)                               0475 00503000
         L     @12,RCOUNT(,@12)                                    0475 00504000
         LTR   @12,@12                                             0475 00505000
         BNZ   @DL00443                                            0475 00506000
*     END;                          /*                       @Y17XARW*/ 00507000
*   OPCMODID=MODNAME3;              /* SETUP MODID           @Y17XARW*/ 00508000
@RC00427 MVC   OPCMODID(2,ROPCAVT),MODNAME3                        0477 00509000
*   GOTO XCTL;                      /* XCTL TO NEXT MOD      @Y17XARW*/ 00510000
         B     XCTL                                                0478 00511000
*   RFY                                                            0479 00512000
*     REG1 UNRSTD;                  /*                       @Y17XAR5*/ 00513000
*   END IGCI310D                    /*                       @Y17XAR5*/ 00514000
*                                                                  0480 00515000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00516000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00517000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00518000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 00519000
*/*%INCLUDE SYSLIB  (TPRUD   )                                       */ 00520000
*/*%INCLUDE SYSLIB  (TBDUD   )                                       */ 00521000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 00522000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 00523000
*/*%INCLUDE SYSLIB  (TCD0D   )                                       */ 00524000
*/*%INCLUDE SYSLIB  (TPLMVD  )                                       */ 00525000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00526000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00527000
*                                                                  0480 00528000
*       ;                                                          0480 00529000
         B     @EL00001                                            0480 00530000
@DATA    DS    0H                                                       00531000
@SM01645 MVC   MOVCHARS(0,@12),MOVCHARS(@15)                            00532000
         DS    0F                                                       00533000
         DS    0F                                                       00534000
@CF00092 DC    F'3'                                                     00535000
@CF00071 DC    F'8'                                                     00536000
@CF00617 DC    F'14'                                                    00537000
@CF01636 DC    XL4'0000FFFF'                                            00538000
         DS    0D                                                       00539000
@CB01036 DC    X'0B8000'                                                00540000
@CB01637 DC    B'111111111111111111111111011111111111111111111111111111C00541000
               11'                                                      00542000
@CB01641 DC    B'000000000000000000000000100000000000000000000000000000C00543000
               00'                                                      00544000
PATCH    DC    XL104'0'                                                 00545000
MODT0    DC    CL2'T0'                                                  00546000
MODID02  DC    CL2'02'                                                  00547000
MODNAME3 DC    CL2'06'                                                  00548000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00549000
@01      EQU   01                                                       00550000
@02      EQU   02                                                       00551000
@03      EQU   03                                                       00552000
@04      EQU   04                                                       00553000
@05      EQU   05                                                       00554000
@06      EQU   06                                                       00555000
@07      EQU   07                                                       00556000
@08      EQU   08                                                       00557000
@09      EQU   09                                                       00558000
@10      EQU   10                                                       00559000
@11      EQU   11                                                       00560000
@12      EQU   12                                                       00561000
@13      EQU   13                                                       00562000
@14      EQU   14                                                       00563000
@15      EQU   15                                                       00564000
@0       EQU   00                                                       00565000
@1       EQU   01                                                       00566000
@2       EQU   02                                                       00567000
@3       EQU   03                                                       00568000
@4       EQU   04                                                       00569000
@5       EQU   05                                                       00570000
@6       EQU   06                                                       00571000
@7       EQU   07                                                       00572000
@8       EQU   08                                                       00573000
@9       EQU   09                                                       00574000
@A       EQU   10                                                       00575000
@B       EQU   11                                                       00576000
@C       EQU   12                                                       00577000
@D       EQU   13                                                       00578000
@E       EQU   14                                                       00579000
@F       EQU   15                                                       00580000
REG0     EQU   @00                                                      00581000
REG1     EQU   @01                                                      00582000
ROPCAVT  EQU   @02                                                      00583000
RWRK1    EQU   @03                                                      00584000
RAVT     EQU   @04                                                      00585000
UNIT     EQU   @05                                                      00586000
DATA     EQU   @07                                                      00587000
PARAM    EQU   @08                                                      00588000
RFROM    EQU   @08                                                      00589000
RAREA    EQU   @09                                                      00590000
RLNGTH   EQU   @10                                                      00591000
RBASE    EQU   @11                                                      00592000
REG12    EQU   @12                                                      00593000
RSAVE    EQU   @13                                                      00594000
REG14    EQU   @14                                                      00595000
REG15    EQU   @15                                                      00596000
IEDQAPTR EQU   0                                                        00597000
IEDQPPTR EQU   0                                                        00598000
IEDPRUQP EQU   0                                                        00599000
IEDPLMVP EQU   0                                                        00600000
IEDQAVTD EQU   0                                                        00601000
AVTSAVEX EQU   IEDQAVTD+288                                             00602000
@NM00003 EQU   IEDQAVTD+388                                             00603000
AVTCKFLG EQU   @NM00003                                                 00604000
AVTBASE  EQU   IEDQAVTD+412                                             00605000
AVTPKF   EQU   AVTBASE                                                  00606000
AVTRNMPT EQU   IEDQAVTD+424                                             00607000
AVTOSECB EQU   IEDQAVTD+492                                             00608000
AVTHG02  EQU   IEDQAVTD+528                                             00609000
AVTDISP  EQU   IEDQAVTD+552                                             00610000
AVTHD    EQU   IEDQAVTD+556                                             00611000
AVTSCOPT EQU   AVTHD                                                    00612000
AVTSAVTP EQU   IEDQAVTD+612                                             00613000
AVTSAVTF EQU   AVTSAVTP                                                 00614000
AVTCKPEL EQU   IEDQAVTD+652                                             00615000
AVTCKRMV EQU   AVTCKPEL                                                 00616000
AVTCKELF EQU   IEDQAVTD+680                                             00617000
AVTCKBYT EQU   IEDQAVTD+691                                             00618000
AVTHG01  EQU   IEDQAVTD+692                                             00619000
AVTCKLNK EQU   IEDQAVTD+696                                             00620000
AVTCRELE EQU   IEDQAVTD+708                                             00621000
AVTCCELE EQU   AVTCRELE                                                 00622000
AVTCLRHI EQU   IEDQAVTD+716                                             00623000
AVTADBUF EQU   IEDQAVTD+720                                             00624000
AVTSYSER EQU   IEDQAVTD+728                                             00625000
AVTCKPQB EQU   IEDQAVTD+804                                             00626000
AVTCKPTB EQU   AVTCKPQB                                                 00627000
AVTCKPEC EQU   AVTCKPQB+4                                               00628000
AVTCKPCC EQU   AVTCKPEC                                                 00629000
AVTOPCQB EQU   IEDQAVTD+816                                             00630000
AVTOPCOB EQU   AVTOPCQB                                                 00631000
AVTOPCEC EQU   AVTOPCQB+4                                               00632000
AVTOPCCC EQU   AVTOPCEC                                                 00633000
AVTOLTQB EQU   IEDQAVTD+828                                             00634000
AVTCWFL1 EQU   IEDQAVTD+924                                             00635000
AVTCWFL2 EQU   IEDQAVTD+925                                             00636000
AVTSUBT  EQU   IEDQAVTD+948                                             00637000
AVTIOTR  EQU   IEDQAVTD+949                                             00638000
AVTKEYLE EQU   IEDQAVTD+1032                                            00639000
AVTBIT1  EQU   IEDQAVTD+1050                                            00640000
AVTBIT2  EQU   IEDQAVTD+1051                                            00641000
AVTBIT3  EQU   IEDQAVTD+1052                                            00642000
AVTSTAIN EQU   AVTBIT3                                                  00643000
AVTBIT4  EQU   IEDQAVTD+1136                                            00644000
@NM00083 EQU   IEDQAVTD+1232                                            00645000
IEDNSVTD EQU   0                                                        00646000
SAVTDIAG EQU   IEDNSVTD                                                 00647000
SAVTDIAF EQU   SAVTDIAG                                                 00648000
SAVTLUSQ EQU   IEDNSVTD+88                                              00649000
SAVTMVBF EQU   IEDNSVTD+160                                             00650000
SAVTTCPU EQU   IEDNSVTD+238                                             00651000
SAVTZELM EQU   IEDNSVTD+270                                             00652000
SAVTRDRV EQU   IEDNSVTD+284                                             00653000
SAVTCKQB EQU   IEDNSVTD+300                                             00654000
SAVTCKTB EQU   SAVTCKQB                                                 00655000
SAVTCKEC EQU   SAVTCKQB+4                                               00656000
SAVTCKCC EQU   SAVTCKEC                                                 00657000
IEDTRM   EQU   0                                                        00658000
IEDNTRM  EQU   IEDTRM                                                   00659000
TRMBYTE4 EQU   IEDNTRM                                                  00660000
TRMBYTE3 EQU   IEDNTRM+1                                                00661000
TRMBYTE2 EQU   IEDNTRM+2                                                00662000
TRMRSACT EQU   TRMBYTE2                                                 00663000
TRMINPG  EQU   TRMBYTE2                                                 00664000
TRMBYTE1 EQU   IEDNTRM+3                                                00665000
TRMSCPRQ EQU   TRMBYTE1                                                 00666000
TRMBYTE0 EQU   IEDNTRM+6                                                00667000
TRMSIBPT EQU   IEDNTRM+7                                                00668000
IEDQTRM  EQU   IEDTRM+14                                                00669000
TRMSTATE EQU   IEDQTRM                                                  00670000
TRMLOG   EQU   TRMSTATE                                                 00671000
TRMINSEQ EQU   IEDQTRM+4                                                00672000
TLISTCNT EQU   TRMINSEQ                                                 00673000
TRMOUTSQ EQU   IEDQTRM+6                                                00674000
TLISTEN  EQU   TRMOUTSQ                                                 00675000
TRMDSORG EQU   TLISTEN                                                  00676000
TRMALTD  EQU   IEDQTRM+8                                                00677000
TRMDEVFL EQU   IEDQTRM+10                                               00678000
TRMSTAT  EQU   IEDQTRM+12                                               00679000
IEDQPRF  EQU   0                                                        00680000
PRFRCB   EQU   IEDQPRF                                                  00681000
PRFKEY   EQU   PRFRCB                                                   00682000
PRFQCBA  EQU   PRFRCB+1                                                 00683000
PRFPRI   EQU   PRFRCB+4                                                 00684000
PRFLINK  EQU   PRFRCB+5                                                 00685000
PRFTIC   EQU   IEDQPRF+8                                                00686000
PRFTICC  EQU   PRFTIC                                                   00687000
PRFNBUNT EQU   IEDQPRF+12                                               00688000
PRFSUNIT EQU   PRFNBUNT                                                 00689000
PRFPLQCB EQU   PRFSUNIT                                                 00690000
@NM00115 EQU   IEDQPRF+16                                               00691000
PRFSVFFO EQU   @NM00115                                                 00692000
PRFSRCE  EQU   PRFSVFFO                                                 00693000
PRFSTAT1 EQU   IEDQPRF+20                                               00694000
PRFEOFN  EQU   PRFSTAT1                                                 00695000
PRFCORE  EQU   IEDQPRF+21                                               00696000
PRFXTRA  EQU   PRFCORE                                                  00697000
PRFSCAN  EQU   IEDQPRF+24                                               00698000
PRFTQBCK EQU   IEDQPRF+26                                               00699000
PRFNTXT  EQU   PRFTQBCK                                                 00700000
PRFEOBOF EQU   PRFNTXT                                                  00701000
PRFCHDR  EQU   IEDQPRF+32                                               00702000
PRFHQBCK EQU   IEDQPRF+35                                               00703000
IEDPF1   EQU   0                                                        00704000
PRF1FLG1 EQU   IEDPF1+3                                                 00705000
PRF1WD2  EQU   IEDPF1+4                                                 00706000
PRF1SEQP EQU   PRF1WD2                                                  00707000
PRF1SQID EQU   PRF1SEQP                                                 00708000
PRF1TAG1 EQU   PRF1SQID                                                 00709000
IEDPF2   EQU   0                                                        00710000
PRF2FLG2 EQU   IEDPF2                                                   00711000
PRF2WD2  EQU   IEDPF2+4                                                 00712000
IEDPRUQD EQU   0                                                        00713000
PRUTTCIN EQU   IEDPRUQD                                                 00714000
PRUDATCT EQU   IEDPRUQD+2                                               00715000
PRUTIC   EQU   IEDPRUQD+8                                               00716000
PRUDATA  EQU   IEDPRUQD+12                                              00717000
IEDPRUND EQU   0                                                        00718000
PRURHTH  EQU   IEDPRUND                                                 00719000
PRURH    EQU   PRURHTH                                                  00720000
PRURHFG0 EQU   PRURH                                                    00721000
PRURHFG1 EQU   PRURH+1                                                  00722000
PRURHFG2 EQU   PRURH+2                                                  00723000
PRUTH    EQU   PRURHTH+3                                                00724000
PRUFIDN  EQU   PRUTH                                                    00725000
IEDBDU   EQU   0                                                        00726000
BDUMODIF EQU   IEDBDU+1                                                 00727000
BDUFNFLG EQU   IEDBDU+2                                                 00728000
BDUHEADR EQU   BDUFNFLG                                                 00729000
BDUBDUFG EQU   IEDBDU+3                                                 00730000
BDURSP   EQU   IEDBDU+4                                                 00731000
BDUSYRSP EQU   BDURSP                                                   00732000
BDUEXRSP EQU   BDURSP+1                                                 00733000
BDUEND   EQU   IEDBDU+6                                                 00734000
IEDTH    EQU   0                                                        00735000
TTHBYTE0 EQU   IEDTH                                                    00736000
TTHSNF   EQU   IEDTH+6                                                  00737000
TTHTAG   EQU   TTHSNF                                                   00738000
TTHTAG1  EQU   TTHTAG                                                   00739000
IEDRH    EQU   0                                                        00740000
TRHBYTE0 EQU   IEDRH                                                    00741000
TRHBYTE1 EQU   IEDRH+1                                                  00742000
TRHBYTE2 EQU   IEDRH+2                                                  00743000
IEDPLMV  EQU   0                                                        00744000
PLMVTU   EQU   IEDPLMV                                                  00745000
PLMVTD   EQU   IEDPLMV+4                                                00746000
PLMVSU   EQU   IEDPLMV+8                                                00747000
PLMVSD   EQU   IEDPLMV+12                                               00748000
PLMVLNTH EQU   IEDPLMV+16                                               00749000
PLMVFLG1 EQU   IEDPLMV+18                                               00750000
IEDNTNTD EQU   0                                                        00751000
WORKAREA EQU   0                                                        00752000
WANSCD   EQU   WORKAREA+10                                              00753000
WRTCD    EQU   WORKAREA+11                                              00754000
WFROM    EQU   WORKAREA+20                                              00755000
IEDQOPCD EQU   0                                                        00756000
OPCAVTPT EQU   IEDQOPCD+8                                               00757000
OPCCOPCE EQU   IEDQOPCD+12                                              00758000
OPCSAVE  EQU   IEDQOPCD+56                                              00759000
OPCWORK  EQU   IEDQOPCD+140                                             00760000
OPCAQCTL EQU   IEDQOPCD+180                                             00761000
OPCXCTL  EQU   IEDQOPCD+204                                             00762000
OPCLDNME EQU   IEDQOPCD+212                                             00763000
OPCMODID EQU   OPCLDNME+3                                               00764000
OPCGETBF EQU   IEDQOPCD+276                                             00765000
OPCSPEC  EQU   IEDQOPCD+300                                             00766000
OPCRSTRT EQU   OPCSPEC                                                  00767000
OPCHNEND EQU   IEDQOPCD+302                                             00768000
OPCWRKSP EQU   IEDQOPCD+320                                             00769000
IEDQOPCE EQU   0                                                        00770000
OCELEM   EQU   IEDQOPCE+4                                               00771000
OCUNIT   EQU   IEDQOPCE+8                                               00772000
OCRUDEST EQU   OCUNIT                                                   00773000
OCCKPKEY EQU   OCRUDEST                                                 00774000
OCSCAN   EQU   OCCKPKEY                                                 00775000
OCOPTCDE EQU   IEDQOPCE+12                                              00776000
OCSWITCH EQU   IEDQOPCE+13                                              00777000
OCFLAG   EQU   IEDQOPCE+14                                              00778000
OCRESP   EQU   OCFLAG                                                   00779000
@NM00158 EQU   IEDQOPCE+16                                              00780000
OCDEST   EQU   @NM00158                                                 00781000
OCREQVAL EQU   OCDEST+1                                                 00782000
OCTRMTBL EQU   IEDQOPCE+20                                              00783000
OCLINENO EQU   IEDQOPCE+22                                              00784000
OCTIOT   EQU   OCLINENO                                                 00785000
OCTRUNIT EQU   IEDQOPCE+24                                              00786000
OCRSID   EQU   OCTRUNIT                                                 00787000
OCALSTAT EQU   OCRSID                                                   00788000
OCACTREQ EQU   OCALSTAT                                                 00789000
OCPARM   EQU   IEDQOPCE+28                                              00790000
OCWTG    EQU   IEDQOPCE+30                                              00791000
OCBACKUP EQU   IEDQOPCE+32                                              00792000
OCMODNME EQU   IEDQOPCE+40                                              00793000
OCIPLWA  EQU   OCMODNME                                                 00794000
OCPTRSAV EQU   OCMODNME+4                                               00795000
OCCKDATA EQU   IEDQOPCE+48                                              00796000
OCRSTGTM EQU   OCCKDATA                                                 00797000
IEDQOPCN EQU   0                                                        00798000
OCLDNME  EQU   IEDQOPCN                                                 00799000
OCLINTTE EQU   OCLDNME                                                  00800000
OCREQFLG EQU   OCLINTTE+2                                               00801000
OCPREFLG EQU   OCLINTTE+3                                               00802000
FIELD    EQU   0                                                        00803000
FCOUNT   EQU   FIELD                                                    00804000
FLAGS    EQU   FCOUNT                                                   00805000
DEVASSO  EQU   FLAGS                                                    00806000
LASTID   EQU   FLAGS                                                    00807000
WA       EQU   0                                                        00808000
ELMNT    EQU   WA                                                       00809000
UNITADDR EQU   WA+8                                                     00810000
RCOUNT   EQU   WA+24                                                    00811000
TNTDATA  EQU   WA+32                                                    00812000
OFFSET   EQU   TNTDATA                                                  00813000
STATUS   EQU   TNTDATA+2                                                00814000
ENDUNIT  EQU   WA+40                                                    00815000
TNTOPTR  EQU   WA+44                                                    00816000
TNTOUNT  EQU   WA+48                                                    00817000
TNTOLEN  EQU   WA+52                                                    00818000
LENMOVE  EQU   WA+54                                                    00819000
LENDATA  EQU   WA+55                                                    00820000
MVPARAMS EQU   WA+56                                                    00821000
IEDMVBFR EQU   0                                                        00822000
ALLOCBUF EQU   0                                                        00823000
IEDQTNT  EQU   0                                                        00824000
CPUNIT   EQU   0                                                        00825000
CPTIC    EQU   CPUNIT+8                                                 00826000
CPLEN    EQU   CPUNIT+16                                                00827000
CPDATA   EQU   CPUNIT+17                                                00828000
CPCNTL   EQU   CPDATA                                                   00829000
CPNUMOFF EQU   CPCNTL                                                   00830000
CPINFO   EQU   CPDATA+3                                                 00831000
MOVCHARS EQU   0                                                        00832000
IEDNBPTR EQU   0                                                        00833000
IEDNLPTR EQU   0                                                        00834000
IEDQLPTR EQU   0                                                        00835000
IEDQQPTR EQU   0                                                        00836000
IEDQTPTR EQU   0                                                        00837000
AVTECBCC EQU   AVTOSECB                                                 00838000
TRMPRE1  EQU   TRMBYTE4                                                 00839000
TRMPRE   EQU   TRMBYTE3                                                 00840000
TRMNCP   EQU   TRMBYTE3                                                 00841000
TRMPU    EQU   TRMBYTE3                                                 00842000
TRMLU    EQU   TRMBYTE3                                                 00843000
TRMLINK  EQU   TRMBYTE3                                                 00844000
OPCAQWD  EQU   OPCAQCTL                                                 00845000
OPCAQWD1 EQU   OPCAQWD                                                  00846000
OPCAQWD2 EQU   OPCAQWD+4                                                00847000
OPCAQWD3 EQU   OPCAQWD+8                                                00848000
ROPCE    EQU   OPCCOPCE                                                 00849000
OCCIB    EQU   OCREQVAL                                                 00850000
OCCKPKY1 EQU   OCCKPKEY                                                 00851000
OCCKPTYP EQU   OCCKPKY1                                                 00852000
OCICACTN EQU   OCMODNME                                                 00853000
OCICDADR EQU   OCICACTN                                                 00854000
OCICTYPE EQU   OCICDADR                                                 00855000
OCICSW   EQU   OCICDADR+3                                               00856000
OCICINAC EQU   OCICSW                                                   00857000
COUNTS   EQU   PRFSRCE                                                  00858000
FLAGSN   EQU   COUNTS+2                                                 00859000
PTRS     EQU   OPCWRKSP                                                 00860000
RTRM     EQU   PTRS                                                     00861000
EPTR     EQU   PTRS+4                                                   00862000
SAVE14   EQU   PTRS+8                                                   00863000
BDUTEXT  EQU   BDUEND                                                   00864000
PRFSHDR  EQU   IEDQPRF+42                                               00865000
*                                      START UNREFERENCED COMPONENTS    00866000
NOTACT   EQU   FLAGSN                                                   00867000
NUMPROC  EQU   COUNTS+1                                                 00868000
NMBENT   EQU   COUNTS                                                   00869000
@NM00164 EQU   OCICSW                                                   00870000
OCICATST EQU   OCICDADR+1                                               00871000
@NM00163 EQU   OCCKPKY1                                                 00872000
OCCKPENV EQU   OCCKPKY1                                                 00873000
OCCKPRST EQU   OCCKPTYP                                                 00874000
OCCKPNCP EQU   OCCKPTYP                                                 00875000
OCCKPINC EQU   OCCKPTYP                                                 00876000
OPCAQLST EQU   OPCAQWD3+1                                               00877000
OPCAQRQ3 EQU   OPCAQWD3                                                 00878000
OPCAQSEC EQU   OPCAQWD2+1                                               00879000
OPCAQRQ2 EQU   OPCAQWD2                                                 00880000
OPCAQFST EQU   OPCAQWD1+1                                               00881000
OPCAQREQ EQU   OPCAQWD1                                                 00882000
@NM00108 EQU   TRMLINK                                                  00883000
TRMLSTAT EQU   TRMLINK                                                  00884000
TRMLINT  EQU   TRMLINK                                                  00885000
TRMEPMOD EQU   TRMLINK                                                  00886000
TRMLULOG EQU   TRMLU                                                    00887000
TRMINERR EQU   TRMLU                                                    00888000
TRMLUREQ EQU   TRMLU                                                    00889000
TRMSESRQ EQU   TRMLU                                                    00890000
TRMTDIFF EQU   TRMLU                                                    00891000
TRMLUTM  EQU   TRMLU                                                    00892000
TRMLUIT  EQU   TRMLU                                                    00893000
TRMAUTO  EQU   TRMLU                                                    00894000
TRMPCONT EQU   TRMPU                                                    00895000
@NM00107 EQU   TRMPU                                                    00896000
TRMNCONT EQU   TRMNCP                                                   00897000
TRMQUCKN EQU   TRMNCP                                                   00898000
TRMSLOWN EQU   TRMNCP                                                   00899000
TRMSYGEN EQU   TRMNCP                                                   00900000
TRMNCPCL EQU   TRMNCP                                                   00901000
TRMIPLDM EQU   TRMNCP                                                   00902000
TRMINOUT EQU   TRMPRE                                                   00903000
TRMRDOUT EQU   TRMPRE                                                   00904000
TRMNLOUT EQU   TRMPRE                                                   00905000
TRMWROUT EQU   TRMPRE                                                   00906000
TRMASNXI EQU   TRMPRE                                                   00907000
TRMSTMM  EQU   TRMPRE                                                   00908000
TRMCMODE EQU   TRMPRE                                                   00909000
TRMSTPND EQU   TRMPRE                                                   00910000
TRMLYNCH EQU   TRMPRE1                                                  00911000
TRMSPOUT EQU   TRMPRE1                                                  00912000
TRMERLCK EQU   TRMPRE1                                                  00913000
TRMQNPL  EQU   TRMPRE1                                                  00914000
TRMSPACT EQU   TRMPRE1                                                  00915000
TRMOCNI  EQU   TRMPRE1                                                  00916000
TRMSESSN EQU   TRMPRE1                                                  00917000
TRMCONT  EQU   TRMPRE1                                                  00918000
AVTECBCP EQU   AVTECBCC                                                 00919000
@NM00103 EQU   AVTECBCC                                                 00920000
CPNUUNT  EQU   CPCNTL+2                                                 00921000
@NM00179 EQU   CPUNIT+13                                                00922000
CPICCODE EQU   CPUNIT+12                                                00923000
@NM00178 EQU   CPUNIT+4                                                 00924000
@NM00177 EQU   CPUNIT                                                   00925000
@NM00176 EQU   WA+36                                                    00926000
@NM00175 EQU   TNTDATA+3                                                00927000
@NM00174 EQU   WA+28                                                    00928000
@NM00173 EQU   WA+20                                                    00929000
@NM00172 EQU   WA+16                                                    00930000
@NM00171 EQU   WA+12                                                    00931000
SAVR14   EQU   WA+4                                                     00932000
FLDLNG   EQU   FIELD+2                                                  00933000
@NM00170 EQU   FIELD+1                                                  00934000
INVSTAT  EQU   FLAGS                                                    00935000
@NM00169 EQU   FLAGS                                                    00936000
CHNGSTAT EQU   LASTID                                                   00937000
@NM00168 EQU   OCLDNME+4                                                00938000
@NM00167 EQU   OCPREFLG                                                 00939000
OCTOTEP  EQU   OCPREFLG                                                 00940000
OCREPOST EQU   OCPREFLG                                                 00941000
OCRSPSNT EQU   OCPREFLG                                                 00942000
OCBFREQ  EQU   OCPREFLG                                                 00943000
OCIDLE   EQU   OCREQFLG                                                 00944000
OCFORCE  EQU   OCREQFLG                                                 00945000
OCDCARD  EQU   OCREQFLG                                                 00946000
OCPARTAL EQU   OCREQFLG                                                 00947000
OCADNCP  EQU   OCREQFLG                                                 00948000
@NM00166 EQU   OCREQFLG                                                 00949000
@NM00165 EQU   OCREQFLG                                                 00950000
OCFLUSHZ EQU   OCREQFLG                                                 00951000
OCRESPCT EQU   OCLINTTE                                                 00952000
OCCKPTWA EQU   OCCKDATA+4                                               00953000
@NM00162 EQU   OCRSTGTM+2                                               00954000
OCCKDAT2 EQU   OCRSTGTM+1                                               00955000
OCCKDAT1 EQU   OCRSTGTM                                                 00956000
OCPUADR  EQU   OCIPLWA+2                                                00957000
OCWTGSAV EQU   OCIPLWA                                                  00958000
OCDVRDCT EQU   OCBACKUP+6                                               00959000
OCNCP    EQU   OCBACKUP+4                                               00960000
OCBUFGOT EQU   OCBACKUP+2                                               00961000
OCBUFNED EQU   OCBACKUP                                                 00962000
OCRESNUM EQU   OCPARM                                                   00963000
OCSEQ    EQU   OCTRUNIT+2                                               00964000
@NM00161 EQU   OCRSID+1                                                 00965000
OCNONE   EQU   OCALSTAT                                                 00966000
OCSOME   EQU   OCALSTAT                                                 00967000
OCALLFLG EQU   OCALSTAT                                                 00968000
OCREDRVE EQU   OCALSTAT                                                 00969000
OCSEQIND EQU   OCALSTAT                                                 00970000
@NM00160 EQU   OCALSTAT                                                 00971000
OCRENTRD EQU   OCALSTAT                                                 00972000
OCWTGB   EQU   OCTIOT                                                   00973000
@NM00159 EQU   @NM00158+2                                               00974000
OCCONID  EQU   OCDEST                                                   00975000
OCRLN    EQU   IEDQOPCE+15                                              00976000
OCATTACH EQU   OCFLAG                                                   00977000
OCSSCP   EQU   OCFLAG                                                   00978000
OCOUTPUT EQU   OCFLAG                                                   00979000
OCLINE   EQU   OCFLAG                                                   00980000
OCMPP    EQU   OCFLAG                                                   00981000
OCTOTE   EQU   OCFLAG                                                   00982000
OCCONSOL EQU   OCFLAG                                                   00983000
@NM00157 EQU   OCSWITCH                                                 00984000
OCQUCKN  EQU   OCSWITCH                                                 00985000
OCPRIFLG EQU   OCOPTCDE                                                 00986000
@NM00156 EQU   OCRUDEST+1                                               00987000
@NM00155 EQU   OCSCAN                                                   00988000
OCNOTUCB EQU   OCSCAN                                                   00989000
OCNONAME EQU   OCSCAN                                                   00990000
OCALLRLN EQU   OCSCAN                                                   00991000
OCDDNAME EQU   OCSCAN                                                   00992000
OCDDNRLN EQU   OCSCAN                                                   00993000
OCADDR   EQU   OCSCAN                                                   00994000
OCELMPTR EQU   OCELEM+1                                                 00995000
OCELMPRI EQU   OCELEM                                                   00996000
OCLINK   EQU   IEDQOPCE                                                 00997000
OPCBOTTM EQU   IEDQOPCD+1172                                            00998000
@NM00154 EQU   IEDQOPCD+1088                                            00999000
@NM00153 EQU   IEDQOPCD+936                                             01000000
@NM00152 EQU   IEDQOPCD+928                                             01001000
@NM00151 EQU   IEDQOPCD+368                                             01002000
OPCWAITV EQU   IEDQOPCD+364                                             01003000
OPCTOTCK EQU   IEDQOPCD+360                                             01004000
OPCAPXTL EQU   IEDQOPCD+356                                             01005000
OPCDECR  EQU   IEDQOPCD+352                                             01006000
OPCBUFWT EQU   IEDQOPCD+348                                             01007000
OPCADGOT EQU   IEDQOPCD+318                                             01008000
OPCRQCNT EQU   IEDQOPCD+316                                             01009000
OPPOLSTP EQU   IEDQOPCD+312                                             01010000
OPCCKCIB EQU   IEDQOPCD+308                                             01011000
OPCEND   EQU   IEDQOPCD+307                                             01012000
OPCSTCBS EQU   IEDQOPCD+306                                             01013000
OPCOQSW  EQU   IEDQOPCD+301                                             01014000
@NM00150 EQU   OPCSPEC                                                  01015000
@NM00149 EQU   OPCSPEC                                                  01016000
@NM00148 EQU   OPCSPEC                                                  01017000
@NM00147 EQU   OPCSPEC                                                  01018000
OPCFRMCA EQU   OPCSPEC                                                  01019000
OPCPART  EQU   OPCSPEC                                                  01020000
OPCALTD  EQU   OPCSPEC                                                  01021000
OPCBFEND EQU   IEDQOPCD+296                                             01022000
OPCBFIRS EQU   IEDQOPCD+292                                             01023000
OPCAVBUF EQU   IEDQOPCD+290                                             01024000
@NM00146 EQU   IEDQOPCD+289                                             01025000
OPCCLNTS EQU   IEDQOPCD+288                                             01026000
OPCHA8   EQU   IEDQOPCD+286                                             01027000
OPCBFREQ EQU   IEDQOPCD+284                                             01028000
OPCFREBF EQU   IEDQOPCD+280                                             01029000
OPCNEXT  EQU   IEDQOPCD+272                                             01030000
OPCFMDFC EQU   IEDQOPCD+268                                             01031000
OPCSCNC  EQU   IEDQOPCD+264                                             01032000
OPCHORTG EQU   IEDQOPCD+260                                             01033000
OPCHORT  EQU   IEDQOPCD+256                                             01034000
OPCCKPTL EQU   IEDQOPCD+252                                             01035000
OPCCKPTF EQU   IEDQOPCD+248                                             01036000
OPCWAITA EQU   IEDQOPCD+244                                             01037000
OPCWAITR EQU   IEDQOPCD+240                                             01038000
OPCWAITP EQU   IEDQOPCD+236                                             01039000
OPCWAITO EQU   IEDQOPCD+232                                             01040000
OPCWAITN EQU   IEDQOPCD+228                                             01041000
OPCWAITL EQU   IEDQOPCD+224                                             01042000
OPCWAITC EQU   IEDQOPCD+220                                             01043000
@NM00145 EQU   OPCLDNME+5                                               01044000
@NM00144 EQU   OPCLDNME                                                 01045000
OPCWAIT  EQU   IEDQOPCD+192                                             01046000
OPCCKERB EQU   IEDQOPCD+164                                             01047000
OPCBFERB EQU   IEDQOPCD+148                                             01048000
OPCFLAG2 EQU   IEDQOPCD+147                                             01049000
OPCFLAG1 EQU   IEDQOPCD+146                                             01050000
OPCWRKSZ EQU   IEDQOPCD+144                                             01051000
OPCRSAVE EQU   IEDQOPCD+132                                             01052000
OPCQCBAD EQU   IEDQOPCD+128                                             01053000
OPCTRMWA EQU   IEDQOPCD+52                                              01054000
OPCPSTWT EQU   IEDQOPCD+48                                              01055000
OPCTNTEA EQU   IEDQOPCD+44                                              01056000
OPCPGCK  EQU   IEDQOPCD+40                                              01057000
OPCLCB   EQU   IEDQOPCD+36                                              01058000
@NM00143 EQU   IEDQOPCD+32                                              01059000
OPCIPLAD EQU   IEDQOPCD+28                                              01060000
OPCTOFLK EQU   IEDQOPCD+24                                              01061000
OPCOPTLK EQU   IEDQOPCD+20                                              01062000
OPCDCBLK EQU   IEDQOPCD+16                                              01063000
OPCDOUBL EQU   IEDQOPCD                                                 01064000
WRQTG    EQU   WORKAREA+26                                              01065000
WTNTNDX  EQU   WORKAREA+24                                              01066000
WTO      EQU   WORKAREA+16                                              01067000
WECBA    EQU   WORKAREA+12                                              01068000
WENTCD   EQU   WORKAREA+9                                               01069000
WVERB    EQU   WORKAREA+8                                               01070000
WLINK    EQU   WORKAREA+5                                               01071000
WPRI     EQU   WORKAREA+4                                               01072000
WQCBADR  EQU   WORKAREA                                                 01073000
TNTFIRST EQU   IEDNTNTD+82                                              01074000
@NM00142 EQU   IEDNTNTD+41                                              01075000
TNTENLEN EQU   IEDNTNTD+40                                              01076000
@NM00141 EQU   IEDNTNTD                                                 01077000
PLMVUNCA EQU   IEDPLMV+20                                               01078000
PLMVFLG2 EQU   IEDPLMV+19                                               01079000
@NM00140 EQU   PLMVFLG1                                                 01080000
PLMVTCTG EQU   PLMVFLG1                                                 01081000
PLMVSCTG EQU   PLMVFLG1                                                 01082000
PLMVUNCF EQU   PLMVFLG1                                                 01083000
@NM00139 EQU   TRHBYTE2                                                 01084000
@NM00138 EQU   TRHBYTE2                                                 01085000
@NM00137 EQU   TRHBYTE2                                                 01086000
TRHCSI   EQU   TRHBYTE2                                                 01087000
@NM00136 EQU   TRHBYTE2                                                 01088000
TRHCDI   EQU   TRHBYTE2                                                 01089000
TRHEB    EQU   TRHBYTE2                                                 01090000
TRHBB    EQU   TRHBYTE2                                                 01091000
TRHPI    EQU   TRHBYTE1                                                 01092000
@NM00135 EQU   TRHBYTE1                                                 01093000
@NM00134 EQU   TRHBYTE1                                                 01094000
@NM00133 EQU   TRHBYTE1                                                 01095000
TRHER    EQU   TRHBYTE1                                                 01096000
TRHDR2   EQU   TRHBYTE1                                                 01097000
@NM00132 EQU   TRHBYTE1                                                 01098000
TRHDR1   EQU   TRHBYTE1                                                 01099000
TRHEC    EQU   TRHBYTE0                                                 01100000
TRHBC    EQU   TRHBYTE0                                                 01101000
TRHSDI   EQU   TRHBYTE0                                                 01102000
TRHFI    EQU   TRHBYTE0                                                 01103000
@NM00131 EQU   TRHBYTE0                                                 01104000
TRHRUCAT EQU   TRHBYTE0                                                 01105000
TRHTYPE  EQU   TRHBYTE0                                                 01106000
TTHDCF   EQU   IEDTH+8                                                  01107000
TTHTAG2  EQU   TTHTAG+1                                                 01108000
@NM00130 EQU   TTHTAG1                                                  01109000
TTHTAGS  EQU   TTHTAG1                                                  01110000
TTHOAF   EQU   IEDTH+4                                                  01111000
TTHDAF   EQU   IEDTH+2                                                  01112000
TTHBYTE1 EQU   IEDTH+1                                                  01113000
TTHEFI   EQU   TTHBYTE0                                                 01114000
@NM00129 EQU   TTHBYTE0                                                 01115000
TTHEBIU  EQU   TTHBYTE0                                                 01116000
TTHBBIU  EQU   TTHBYTE0                                                 01117000
TTHFTYPE EQU   TTHBYTE0                                                 01118000
BDUXGRPH EQU   BDUEXRSP                                                 01119000
BDUXFINL EQU   BDUEXRSP                                                 01120000
BDUXINIT EQU   BDUEXRSP                                                 01121000
BDURESP  EQU   BDUSYRSP                                                 01122000
BDUPHASE EQU   BDUSYRSP                                                 01123000
BDUERROR EQU   BDUSYRSP                                                 01124000
BDUXERLK EQU   BDUBDUFG                                                 01125000
BDUALTAK EQU   BDUFNFLG                                                 01126000
BDUNEGAK EQU   BDUFNFLG                                                 01127000
BDUPOSAK EQU   BDUFNFLG                                                 01128000
BDUTPTX  EQU   BDUFNFLG                                                 01129000
BDUFRSTB EQU   BDUFNFLG                                                 01130000
BDULEADG EQU   BDUFNFLG                                                 01131000
BDUSTHDR EQU   BDUFNFLG                                                 01132000
BDUCMND  EQU   IEDBDU                                                   01133000
@NM00128 EQU   IEDPRUND+4                                               01134000
PRUTHEFI EQU   PRUFIDN                                                  01135000
PRUTHUSS EQU   PRUFIDN                                                  01136000
PRUTHEIU EQU   PRUFIDN                                                  01137000
PRUTHBIU EQU   PRUFIDN                                                  01138000
PRUTHTYE EQU   PRUFIDN                                                  01139000
@NM00127 EQU   PRURHFG2                                                 01140000
PRURHCSI EQU   PRURHFG2                                                 01141000
@NM00126 EQU   PRURHFG2                                                 01142000
PRURHCDI EQU   PRURHFG2                                                 01143000
PRURHEB  EQU   PRURHFG2                                                 01144000
PRURHBB  EQU   PRURHFG2                                                 01145000
PRURHPI  EQU   PRURHFG1                                                 01146000
@NM00125 EQU   PRURHFG1                                                 01147000
PRURHER  EQU   PRURHFG1                                                 01148000
PRURHDR2 EQU   PRURHFG1                                                 01149000
@NM00124 EQU   PRURHFG1                                                 01150000
PRURHDR1 EQU   PRURHFG1                                                 01151000
PRURHEC  EQU   PRURHFG0                                                 01152000
PRURHBC  EQU   PRURHFG0                                                 01153000
PRURHSDI EQU   PRURHFG0                                                 01154000
PRURHFI  EQU   PRURHFG0                                                 01155000
@NM00123 EQU   PRURHFG0                                                 01156000
PRURUCAT EQU   PRURHFG0                                                 01157000
PRURHTYP EQU   PRURHFG0                                                 01158000
PRUNUNIT EQU   PRUTIC+1                                                 01159000
@NM00122 EQU   PRUTIC                                                   01160000
@NM00121 EQU   IEDPRUQD+4                                               01161000
PRF2SEQP EQU   PRF2WD2                                                  01162000
@NM00120 EQU   IEDPF2+1                                                 01163000
@NM00119 EQU   PRF2FLG2                                                 01164000
PRF2SMI  EQU   PRF2FLG2                                                 01165000
PRF2FORM EQU   PRF2FLG2                                                 01166000
PRF2TNTI EQU   PRF2FLG2                                                 01167000
PRF1RULN EQU   PRF1SEQP+2                                               01168000
PRF1TAG2 EQU   PRF1SQID+1                                               01169000
@NM00118 EQU   PRF1TAG1                                                 01170000
PRF1TAGS EQU   PRF1TAG1                                                 01171000
@NM00117 EQU   PRF1FLG1                                                 01172000
PRF1LOGD EQU   PRF1FLG1                                                 01173000
PRF1USS  EQU   PRF1FLG1                                                 01174000
PRF1FORM EQU   PRF1FLG1                                                 01175000
PRF1EXPI EQU   PRF1FLG1                                                 01176000
PRF1FIDI EQU   PRF1FLG1                                                 01177000
PRF1RH   EQU   IEDPF1                                                   01178000
PRFDEST  EQU   IEDQPRF+40                                               01179000
PRFISEQ  EQU   IEDQPRF+38                                               01180000
PRFSTXT  EQU   PRFHQBCK                                                 01181000
PRFNHDR  EQU   PRFCHDR                                                  01182000
PRFCRCD  EQU   IEDQPRF+29                                               01183000
PRFSVSEQ EQU   PRFNTXT+1                                                01184000
PRFSVPRI EQU   PRFEOBOF                                                 01185000
PRFISIZE EQU   PRFSCAN+1                                                01186000
@NM00116 EQU   PRFSCAN                                                  01187000
PRFEOB   EQU   PRFXTRA+1                                                01188000
PRFSTSO  EQU   PRFXTRA                                                  01189000
PRFNHDRN EQU   PRFSTAT1                                                 01190000
PRFNLSTN EQU   PRFSTAT1                                                 01191000
PRFLOCK  EQU   PRFEOFN                                                  01192000
PRFDUPLN EQU   PRFSTAT1                                                 01193000
PRFTSMSG EQU   PRFSTAT1                                                 01194000
PRFITCPN EQU   PRFSTAT1                                                 01195000
PRFERMGN EQU   PRFSTAT1                                                 01196000
PRFCNCLN EQU   PRFSTAT1                                                 01197000
PRFSVFLG EQU   @NM00115+3                                               01198000
PRFSIZE  EQU   PRFSVFFO+2                                               01199000
PRFLCB   EQU   IEDQPRF+13                                               01200000
PRFPIUO  EQU   PRFPLQCB                                                 01201000
PRFTI0   EQU   PRFTIC+1                                                 01202000
@NM00114 EQU   PRFTICC                                                  01203000
@NM00113 EQU   PRFTICC                                                  01204000
@NM00112 EQU   PRFTICC                                                  01205000
PRFTICON EQU   PRFTICC                                                  01206000
@NM00111 EQU   PRFTICC                                                  01207000
@NM00110 EQU   PRFTICC                                                  01208000
PRFBFMM  EQU   PRFTICC                                                  01209000
PRFEOMSG EQU   PRFTICC                                                  01210000
PRFCOUNT EQU   PRFLINK+1                                                01211000
@NM00109 EQU   PRFLINK                                                  01212000
PRFFLAGS EQU   PRFPRI                                                   01213000
PRFIOADR EQU   PRFQCBA                                                  01214000
PRFOPCDE EQU   PRFKEY                                                   01215000
TRMOPT   EQU   IEDTRM+34                                                01216000
TRMOPTBL EQU   IEDQTRM+18                                               01217000
TRMOPNO  EQU   IEDQTRM+17                                               01218000
TRMCHCIN EQU   IEDQTRM+16                                               01219000
TRMSENSE EQU   TRMSTAT+3                                                01220000
TRMTEMPR EQU   TRMSTAT+2                                                01221000
TRMSIO   EQU   TRMSTAT                                                  01222000
@NM00106 EQU   TRMDEVFL+1                                               01223000
TRMTPIN  EQU   TRMDEVFL+1                                               01224000
TRMNCPI  EQU   TRMDEVFL+1                                               01225000
TRMRNTRM EQU   TRMDEVFL+1                                               01226000
@NM00105 EQU   TRMDEVFL+1                                               01227000
TRMLMD   EQU   TRMDEVFL+1                                               01228000
TRMCONC  EQU   TRMDEVFL+1                                               01229000
TRMTSOB  EQU   TRMDEVFL                                                 01230000
TRMBFDY  EQU   TRMDEVFL                                                 01231000
TRMTBLK  EQU   TRMDEVFL                                                 01232000
TRMSBLK  EQU   TRMDEVFL                                                 01233000
TRMBLKS  EQU   TRMDEVFL                                                 01234000
TRMADDC  EQU   TRMDEVFL                                                 01235000
TRMDDIG  EQU   TRMDEVFL                                                 01236000
TRMBUFS  EQU   TRMDEVFL                                                 01237000
TRMPRILK EQU   TRMALTD                                                  01238000
TRMLGB   EQU   TRMDSORG                                                 01239000
TRMUTERM EQU   TLISTCNT                                                 01240000
TRMDESTQ EQU   IEDQTRM+1                                                01241000
TRMSCNYN EQU   TRMSTATE                                                 01242000
TRMOPTFN EQU   TRMSTATE                                                 01243000
TRMHELDN EQU   TRMSTATE                                                 01244000
TRMACPTN EQU   TRMSTATE                                                 01245000
TRMPREF  EQU   TRMSTATE                                                 01246000
TRMPROC  EQU   TRMLOG                                                   01247000
TRMLIST  EQU   TRMLOG                                                   01248000
TRMLINE  EQU   TRMSTATE                                                 01249000
TRMSUBST EQU   IEDNTRM+12                                               01250000
TRMTYPE  EQU   IEDNTRM+11                                               01251000
TRMRLMCT EQU   IEDNTRM+10                                               01252000
TRMCOHTG EQU   TRMSIBPT+1                                               01253000
TRMGPCNT EQU   TRMSIBPT                                                 01254000
TRMBUFRD EQU   TRMBYTE0                                                 01255000
TRMSNA   EQU   TRMBYTE0                                                 01256000
TRMGP    EQU   TRMBYTE0                                                 01257000
TRMDIAL  EQU   TRMBYTE0                                                 01258000
@NM00104 EQU   TRMBYTE0                                                 01259000
TRMOUTPT EQU   TRMBYTE0                                                 01260000
TRMINPUT EQU   TRMBYTE0                                                 01261000
TRMUDEF  EQU   TRMBYTE0                                                 01262000
TRMCOHRT EQU   IEDNTRM+4                                                01263000
TRMSTOTE EQU   TRMBYTE1                                                 01264000
TRMCKPRN EQU   TRMBYTE1                                                 01265000
TRMTSATN EQU   TRMBYTE1                                                 01266000
TRMTRACE EQU   TRMBYTE1                                                 01267000
TRMSWBCK EQU   TRMBYTE1                                                 01268000
TRMAUTOC EQU   TRMBYTE1                                                 01269000
TRMINPTP EQU   TRMBYTE1                                                 01270000
TRMWTNEG EQU   TRMSCPRQ                                                 01271000
TRMWRBRK EQU   TRMBYTE2                                                 01272000
TRMNOSND EQU   TRMBYTE2                                                 01273000
TRMPREP  EQU   TRMBYTE2                                                 01274000
TRMGPACT EQU   TRMBYTE2                                                 01275000
TRMANDL  EQU   TRMBYTE2                                                 01276000
TRMCLOSN EQU   TRMINPG                                                  01277000
TRMREMB  EQU   TRMBYTE2                                                 01278000
SAVTBITN EQU   IEDNSVTD+312                                             01279000
@NM00102 EQU   SAVTCKQB+8                                               01280000
@NM00101 EQU   SAVTCKEC+1                                               01281000
@NM00100 EQU   SAVTCKCC                                                 01282000
SAVTCKPO EQU   SAVTCKCC                                                 01283000
SAVTCKWA EQU   SAVTCKCC                                                 01284000
SAVTCKCH EQU   SAVTCKTB+1                                               01285000
SAVTCKVT EQU   SAVTCKTB                                                 01286000
@NM00099 EQU   IEDNSVTD+297                                             01287000
SAVTRDFG EQU   SAVTRDRV+12                                              01288000
@NM00098 EQU   SAVTRDRV+5                                               01289000
SAVTRDPY EQU   SAVTRDRV+4                                               01290000
SAVTRDQB EQU   SAVTRDRV+1                                               01291000
SAVTRDKY EQU   SAVTRDRV                                                 01292000
SAVTNID  EQU   IEDNSVTD+280                                             01293000
SAVTDVAS EQU   IEDNSVTD+276                                             01294000
SAVTPLSZ EQU   IEDNSVTD+274                                             01295000
@NM00097 EQU   IEDNSVTD+273                                             01296000
SAVTSUBL EQU   IEDNSVTD+272                                             01297000
@NM00096 EQU   SAVTZELM+1                                               01298000
SAVTSUBM EQU   SAVTZELM                                                 01299000
SAVTMHDX EQU   IEDNSVTD+268                                             01300000
SAVTNAT1 EQU   IEDNSVTD+266                                             01301000
SAVTSH20 EQU   IEDNSVTD+264                                             01302000
SAVTLCBS EQU   IEDNSVTD+260                                             01303000
SAVTRNMP EQU   IEDNSVTD+256                                             01304000
SAVTTNTX EQU   IEDNSVTD+252                                             01305000
SAVTNAX  EQU   IEDNSVTD+248                                             01306000
SAVTSUBV EQU   IEDNSVTD+247                                             01307000
SAVTSUBA EQU   IEDNSVTD+246                                             01308000
SAVTSIBC EQU   IEDNSVTD+244                                             01309000
SAVTBSM  EQU   IEDNSVTD+240                                             01310000
SAVTSCPT EQU   SAVTTCPU                                                 01311000
SAVTRQTG EQU   IEDNSVTD+236                                             01312000
SAVTRQCH EQU   IEDNSVTD+232                                             01313000
SAVTMAND EQU   IEDNSVTD+228                                             01314000
SAVTSPLN EQU   IEDNSVTD+224                                             01315000
SAVTNADL EQU   IEDNSVTD+222                                             01316000
SAVTNATL EQU   IEDNSVTD+220                                             01317000
SAVTMHTB EQU   IEDNSVTD+216                                             01318000
SAVTSSMH EQU   IEDNSVTD+212                                             01319000
SAVTQRS  EQU   IEDNSVTD+208                                             01320000
SAVTRQIN EQU   IEDNSVTD+204                                             01321000
SAVTDFCO EQU   IEDNSVTD+200                                             01322000
SAVTSAO  EQU   IEDNSVTD+196                                             01323000
SAVTSARI EQU   IEDNSVTD+192                                             01324000
SAVTSAC  EQU   IEDNSVTD+188                                             01325000
SAVTSAI  EQU   IEDNSVTD+184                                             01326000
SAVTCSCI EQU   IEDNSVTD+180                                             01327000
SAVTSSRP EQU   IEDNSVTD+176                                             01328000
SAVTSSRQ EQU   IEDNSVTD+172                                             01329000
SAVTSCLU EQU   IEDNSVTD+168                                             01330000
SAVTXTRQ EQU   IEDNSVTD+164                                             01331000
@NM00095 EQU   IEDNSVTD+148                                             01332000
SAVTIPCQ EQU   IEDNSVTD+144                                             01333000
@NM00094 EQU   IEDNSVTD+136                                             01334000
SAVTXFMI EQU   IEDNSVTD+132                                             01335000
@NM00093 EQU   IEDNSVTD+124                                             01336000
SAVTXFMO EQU   IEDNSVTD+120                                             01337000
@NM00092 EQU   IEDNSVTD+116                                             01338000
SAVTSSSR EQU   IEDNSVTD+112                                             01339000
SAVTSCPQ EQU   IEDNSVTD+108                                             01340000
SAVTSLCB EQU   IEDNSVTD+104                                             01341000
SAVTLUSR EQU   IEDNSVTD+100                                             01342000
@NM00091 EQU   SAVTLUSQ+8                                               01343000
SAVTLUSP EQU   SAVTLUSQ+4                                               01344000
SAVTLUSB EQU   SAVTLUSQ                                                 01345000
@NM00090 EQU   IEDNSVTD+84                                              01346000
SAVTSAT  EQU   IEDNSVTD+80                                              01347000
SAVTNAT  EQU   IEDNSVTD+76                                              01348000
SAVTCLUP EQU   IEDNSVTD+72                                              01349000
SAVTPIUT EQU   IEDNSVTD+68                                              01350000
SAVTRNTA EQU   IEDNSVTD+64                                              01351000
SAVTDNIR EQU   IEDNSVTD+60                                              01352000
SAVTCNIR EQU   IEDNSVTD+56                                              01353000
SAVTFLDH EQU   IEDNSVTD+52                                              01354000
SAVTSRTN EQU   IEDNSVTD+48                                              01355000
SAVTSREQ EQU   IEDNSVTD+44                                              01356000
SAVTFAIL EQU   IEDNSVTD+42                                              01357000
SAVTSUSE EQU   IEDNSVTD+40                                              01358000
SAVTSIB  EQU   IEDNSVTD+36                                              01359000
SAVTPRTN EQU   IEDNSVTD+32                                              01360000
@NM00089 EQU   IEDNSVTD+28                                              01361000
SAVTWH20 EQU   IEDNSVTD+26                                              01362000
SAVTPWT  EQU   IEDNSVTD+24                                              01363000
SAVTPRTQ EQU   IEDNSVTD+20                                              01364000
SAVTPREQ EQU   IEDNSVTD+16                                              01365000
SAVTPH20 EQU   IEDNSVTD+14                                              01366000
SAVTPUSE EQU   IEDNSVTD+12                                              01367000
SAVTPLCB EQU   IEDNSVTD+8                                               01368000
SAVTPOOL EQU   IEDNSVTD+4                                               01369000
SAVTPRMT EQU   SAVTDIAF                                                 01370000
SAVTVIRT EQU   SAVTDIAF                                                 01371000
AVTCPBNO EQU   IEDQAVTD+1244                                            01372000
AVTHRESS EQU   IEDQAVTD+1243                                            01373000
@NM00088 EQU   IEDQAVTD+1242                                            01374000
@NM00087 EQU   IEDQAVTD+1241                                            01375000
@NM00086 EQU   IEDQAVTD+1240                                            01376000
@NM00085 EQU   IEDQAVTD+1237                                            01377000
@NM00084 EQU   IEDQAVTD+1236                                            01378000
AVTHRESE EQU   @NM00083                                                 01379000
AVTRADDR EQU   IEDQAVTD+1228                                            01380000
AVTNADDR EQU   IEDQAVTD+1224                                            01381000
AVTHRESN EQU   IEDQAVTD+1220                                            01382000
AVTVOLRN EQU   IEDQAVTD+1216                                            01383000
AVTTOTNN EQU   IEDQAVTD+1212                                            01384000
AVTTRCYN EQU   IEDQAVTD+1208                                            01385000
AVTRCTRN EQU   IEDQAVTD+1204                                            01386000
AVTNOVON EQU   IEDQAVTD+1200                                            01387000
AVTADEBN EQU   IEDQAVTD+1196                                            01388000
AVTVOLRR EQU   IEDQAVTD+1192                                            01389000
AVTTOTNR EQU   IEDQAVTD+1188                                            01390000
AVTTRCYR EQU   IEDQAVTD+1184                                            01391000
AVTRCTRR EQU   IEDQAVTD+1180                                            01392000
AVTNOVOR EQU   IEDQAVTD+1176                                            01393000
AVTADEBR EQU   IEDQAVTD+1172                                            01394000
AVTLODPT EQU   IEDQAVTD+1168                                            01395000
AVTIOBN  EQU   IEDQAVTD+1164                                            01396000
AVTIOBR  EQU   IEDQAVTD+1160                                            01397000
AVTCPBPT EQU   IEDQAVTD+1156                                            01398000
AVTFCPB  EQU   IEDQAVTD+1152                                            01399000
@NM00082 EQU   IEDQAVTD+1148                                            01400000
AVTINCPQ EQU   IEDQAVTD+1144                                            01401000
@NM00081 EQU   IEDQAVTD+1140                                            01402000
@NM00080 EQU   IEDQAVTD+1137                                            01403000
@NM00079 EQU   AVTBIT4                                                  01404000
@NM00078 EQU   AVTBIT4                                                  01405000
@NM00077 EQU   AVTBIT4                                                  01406000
@NM00076 EQU   AVTBIT4                                                  01407000
@NM00075 EQU   AVTBIT4                                                  01408000
@NM00074 EQU   AVTBIT4                                                  01409000
@NM00073 EQU   AVTBIT4                                                  01410000
AVTRUFTN EQU   AVTBIT4                                                  01411000
@NM00072 EQU   IEDQAVTD+1132                                            01412000
AVTNOBFQ EQU   IEDQAVTD+1128                                            01413000
@NM00071 EQU   IEDQAVTD+1124                                            01414000
AVTDKENQ EQU   IEDQAVTD+1120                                            01415000
@NM00070 EQU   IEDQAVTD+1116                                            01416000
AVTDKAPQ EQU   IEDQAVTD+1112                                            01417000
AVTCOPY  EQU   IEDQAVTD+1108                                            01418000
AVTIA    EQU   IEDQAVTD+1104                                            01419000
AVTFL    EQU   IEDQAVTD+1100                                            01420000
@NM00069 EQU   IEDQAVTD+1096                                            01421000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01422000
AVTTOTNC EQU   IEDQAVTD+1088                                            01423000
AVTCMAX  EQU   IEDQAVTD+1084                                            01424000
AVTCMIN  EQU   IEDQAVTD+1080                                            01425000
AVTHM02  EQU   IEDQAVTD+1076                                            01426000
AVTOPCIN EQU   IEDQAVTD+1074                                            01427000
AVTDCTLN EQU   IEDQAVTD+1072                                            01428000
AVTOPMSK EQU   IEDQAVTD+1068                                            01429000
AVTDDFT  EQU   IEDQAVTD+1064                                            01430000
AVTSTEAL EQU   IEDQAVTD+1060                                            01431000
AVTOPTN  EQU   IEDQAVTD+1056                                            01432000
AVTDSKCT EQU   IEDQAVTD+1054                                            01433000
AVTCKRST EQU   IEDQAVTD+1053                                            01434000
AVTSTAN  EQU   AVTBIT3                                                  01435000
AVTSTACN EQU   AVTBIT3                                                  01436000
AVTSTAYN EQU   AVTBIT3                                                  01437000
AVTOLTBN EQU   AVTBIT3                                                  01438000
AVTTSAB  EQU   AVTBIT3                                                  01439000
AVTRFULN EQU   AVTBIT3                                                  01440000
AVTRECVN EQU   AVTBIT3                                                  01441000
@NM00068 EQU   AVTBIT2                                                  01442000
@NM00067 EQU   AVTBIT2                                                  01443000
AVTOPEIN EQU   AVTBIT2                                                  01444000
AVTSTRTN EQU   AVTBIT2                                                  01445000
AVTTOPOL EQU   AVTBIT2                                                  01446000
AVTCOPYN EQU   AVTBIT2                                                  01447000
AVTREUSN EQU   AVTBIT2                                                  01448000
AVTEXTSC EQU   AVTBIT2                                                  01449000
AVTDISKN EQU   AVTBIT1                                                  01450000
AVTQUCKN EQU   AVTBIT1                                                  01451000
AVTCLOSN EQU   AVTBIT1                                                  01452000
AVTREADN EQU   AVTBIT1                                                  01453000
AVTDLAYN EQU   AVTBIT1                                                  01454000
AVTAQTAN EQU   AVTBIT1                                                  01455000
AVTTSON  EQU   AVTBIT1                                                  01456000
AVTAPLKN EQU   AVTBIT1                                                  01457000
AVTDUMBR EQU   IEDQAVTD+1048                                            01458000
AVTDLQX  EQU   IEDQAVTD+1046                                            01459000
AVTINTLV EQU   IEDQAVTD+1044                                            01460000
AVTSMCNT EQU   IEDQAVTD+1042                                            01461000
AVTAVFCT EQU   IEDQAVTD+1040                                            01462000
AVTOPCON EQU   IEDQAVTD+1038                                            01463000
AVTOPCNT EQU   IEDQAVTD+1036                                            01464000
AVTLNCNT EQU   IEDQAVTD+1034                                            01465000
AVTHA16  EQU   IEDQAVTD+1030                                            01466000
AVTHA7   EQU   IEDQAVTD+1028                                            01467000
AVTHA4   EQU   IEDQAVTD+1026                                            01468000
AVTHA3   EQU   IEDQAVTD+1024                                            01469000
AVTHA2   EQU   IEDQAVTD+1022                                            01470000
AVTGETMS EQU   IEDQAVTD+1021                                            01471000
@NM00066 EQU   IEDQAVTD+1020                                            01472000
AVTGETMD EQU   IEDQAVTD+1016                                            01473000
AVTGETMN EQU   IEDQAVTD+1012                                            01474000
AVTCWTOT EQU   IEDQAVTD+1008                                            01475000
AVTCWINT EQU   IEDQAVTD+956                                             01476000
AVTDTRAP EQU   IEDQAVTD+952                                             01477000
@NM00065 EQU   IEDQAVTD+950                                             01478000
@NM00064 EQU   AVTIOTR                                                  01479000
AVTIOTRH EQU   AVTIOTR                                                  01480000
AVTIOTRE EQU   AVTIOTR                                                  01481000
@NM00063 EQU   AVTSUBT                                                  01482000
AVTSUBPT EQU   AVTSUBT                                                  01483000
AVTSUBON EQU   AVTSUBT                                                  01484000
AVTAFE30 EQU   IEDQAVTD+944                                             01485000
AVTAFE20 EQU   IEDQAVTD+940                                             01486000
AVTAFE10 EQU   IEDQAVTD+936                                             01487000
AVTCWEC2 EQU   IEDQAVTD+932                                             01488000
AVTCWPM2 EQU   IEDQAVTD+928                                             01489000
AVTCWTS2 EQU   IEDQAVTD+927                                             01490000
AVTCWTS1 EQU   IEDQAVTD+926                                             01491000
AVTCWCLD EQU   AVTCWFL2                                                 01492000
AVTCWRAP EQU   AVTCWFL2                                                 01493000
@NM00062 EQU   AVTCWFL2                                                 01494000
@NM00061 EQU   AVTCWFL2                                                 01495000
@NM00060 EQU   AVTCWFL2                                                 01496000
@NM00059 EQU   AVTCWFL2                                                 01497000
@NM00058 EQU   AVTCWFL2                                                 01498000
AVTCWACT EQU   AVTCWFL2                                                 01499000
@NM00057 EQU   AVTCWFL1                                                 01500000
@NM00056 EQU   AVTCWFL1                                                 01501000
@NM00055 EQU   AVTCWFL1                                                 01502000
@NM00054 EQU   AVTCWFL1                                                 01503000
@NM00053 EQU   AVTCWFL1                                                 01504000
@NM00052 EQU   AVTCWFL1                                                 01505000
@NM00051 EQU   AVTCWFL1                                                 01506000
AVTCOMWN EQU   AVTCWFL1                                                 01507000
AVTCWEC1 EQU   IEDQAVTD+920                                             01508000
AVTCWPM1 EQU   IEDQAVTD+916                                             01509000
AVTCAREA EQU   IEDQAVTD+912                                             01510000
AVTFZERO EQU   IEDQAVTD+908                                             01511000
AVTCADDR EQU   IEDQAVTD+904                                             01512000
AVTCOREC EQU   IEDQAVTD+900                                             01513000
@NM00050 EQU   IEDQAVTD+892                                             01514000
AVTCPBCB EQU   IEDQAVTD+888                                             01515000
@NM00049 EQU   IEDQAVTD+880                                             01516000
AVTDSIOB EQU   IEDQAVTD+876                                             01517000
@NM00048 EQU   IEDQAVTD+868                                             01518000
AVTCPRMB EQU   IEDQAVTD+864                                             01519000
@NM00047 EQU   IEDQAVTD+856                                             01520000
AVTCLOSB EQU   IEDQAVTD+852                                             01521000
@NM00046 EQU   IEDQAVTD+844                                             01522000
AVTACTIB EQU   IEDQAVTD+840                                             01523000
@NM00045 EQU   IEDQAVTD+836                                             01524000
AVTOLTEB EQU   IEDQAVTD+832                                             01525000
AVTOLTCH EQU   AVTOLTQB+1                                               01526000
AVTOLTVT EQU   AVTOLTQB                                                 01527000
@NM00044 EQU   AVTOPCQB+8                                               01528000
@NM00043 EQU   AVTOPCEC+1                                               01529000
@NM00042 EQU   AVTOPCCC                                                 01530000
AVTOPCPO EQU   AVTOPCCC                                                 01531000
AVTOPCWA EQU   AVTOPCCC                                                 01532000
AVTOPCCH EQU   AVTOPCOB+1                                               01533000
AVTOPCVT EQU   AVTOPCOB                                                 01534000
@NM00041 EQU   AVTCKPQB+9                                               01535000
AVTCKPTS EQU   AVTCKPQB+8                                               01536000
@NM00040 EQU   AVTCKPEC+1                                               01537000
@NM00039 EQU   AVTCKPCC                                                 01538000
AVTCKPPO EQU   AVTCKPCC                                                 01539000
AVTCKPWA EQU   AVTCKPCC                                                 01540000
AVTCKPCH EQU   AVTCKPTB+1                                               01541000
AVTCKPVT EQU   AVTCKPTB                                                 01542000
@NM00038 EQU   IEDQAVTD+796                                             01543000
AVTBFRTB EQU   IEDQAVTD+792                                             01544000
@NM00037 EQU   IEDQAVTD+784                                             01545000
AVTBFREB EQU   IEDQAVTD+780                                             01546000
AVTTIMQ  EQU   IEDQAVTD+776                                             01547000
@NM00036 EQU   IEDQAVTD+772                                             01548000
AVTIMQPS EQU   IEDQAVTD+768                                             01549000
AVTINOUT EQU   IEDQAVTD+766                                             01550000
AVTREFTM EQU   IEDQAVTD+764                                             01551000
@NM00035 EQU   IEDQAVTD+752                                             01552000
AVTDELYB EQU   IEDQAVTD+748                                             01553000
AVTOCQPT EQU   IEDQAVTD+744                                             01554000
AVTTSOPT EQU   IEDQAVTD+740                                             01555000
AVTSUPPT EQU   IEDQAVTD+736                                             01556000
AVTCBQCB EQU   IEDQAVTD+732                                             01557000
AVTMSGS  EQU   IEDQAVTD+729                                             01558000
@NM00034 EQU   AVTSYSER                                                 01559000
@NM00033 EQU   AVTSYSER                                                 01560000
@NM00032 EQU   AVTSYSER                                                 01561000
@NM00031 EQU   AVTSYSER                                                 01562000
@NM00030 EQU   AVTSYSER                                                 01563000
@NM00029 EQU   AVTSYSER                                                 01564000
AVTCMAXN EQU   AVTSYSER                                                 01565000
AVTCMINN EQU   AVTSYSER                                                 01566000
AVT2260L EQU   IEDQAVTD+724                                             01567000
AVTABEPL EQU   AVTADBUF                                                 01568000
AVTHFF   EQU   AVTCLRHI+2                                               01569000
@NM00028 EQU   AVTCLRHI                                                 01570000
AVTCCLNK EQU   AVTCRELE+5                                               01571000
AVTCCPRI EQU   AVTCRELE+4                                               01572000
AVTCCQCB EQU   AVTCCELE+1                                               01573000
AVTCCKEY EQU   AVTCCELE                                                 01574000
AVTDELAD EQU   IEDQAVTD+704                                             01575000
AVTDELEM EQU   IEDQAVTD+700                                             01576000
AVTBSX   EQU   AVTCKLNK                                                 01577000
AVTOPETR EQU   AVTHG01                                                  01578000
@NM00027 EQU   AVTCKBYT                                                 01579000
AVTCKONQ EQU   AVTCKBYT                                                 01580000
@NM00026 EQU   AVTCKBYT                                                 01581000
@NM00025 EQU   AVTCKBYT                                                 01582000
@NM00024 EQU   AVTCKBYT                                                 01583000
@NM00023 EQU   AVTCKBYT                                                 01584000
@NM00022 EQU   AVTCKBYT                                                 01585000
@NM00021 EQU   AVTCKBYT                                                 01586000
AVTOPERT EQU   IEDQAVTD+690                                             01587000
AVTOPXCL EQU   IEDQAVTD+688                                             01588000
AVTOPERL EQU   IEDQAVTD+687                                             01589000
@NM00020 EQU   IEDQAVTD+686                                             01590000
AVTCKTIM EQU   IEDQAVTD+684                                             01591000
AVTCKELV EQU   IEDQAVTD+682                                             01592000
AVTCPRCD EQU   IEDQAVTD+681                                             01593000
AVTWARMN EQU   AVTCKELF                                                 01594000
AVTCRTLN EQU   AVTCKELF                                                 01595000
AVTCPIPN EQU   AVTCKELF                                                 01596000
AVTCCLCN EQU   AVTCKELF                                                 01597000
AVTCINCN EQU   AVTCKELF                                                 01598000
@NM00019 EQU   AVTCKELF                                                 01599000
AVTCMCPN EQU   AVTCKELF                                                 01600000
AVTCRDYN EQU   AVTCKELF                                                 01601000
AVTCKQAD EQU   IEDQAVTD+677                                             01602000
AVTSCBSZ EQU   IEDQAVTD+676                                             01603000
@NM00018 EQU   IEDQAVTD+672                                             01604000
AVTCKELE EQU   IEDQAVTD+668                                             01605000
@NM00017 EQU   AVTCKPEL+8                                               01606000
AVTCKRLK EQU   AVTCKPEL+5                                               01607000
AVTCKRPR EQU   AVTCKPEL+4                                               01608000
AVTCKRMQ EQU   AVTCKRMV+1                                               01609000
AVTCKRKY EQU   AVTCKRMV                                                 01610000
AVTHK    EQU   IEDQAVTD+648                                             01611000
AVTHI    EQU   IEDQAVTD+644                                             01612000
AVTIOT   EQU   IEDQAVTD+640                                             01613000
AVTNX    EQU   IEDQAVTD+636                                             01614000
AVTTONE  EQU   IEDQAVTD+632                                             01615000
AVTA3TL  EQU   IEDQAVTD+628                                             01616000
AVTDMECB EQU   IEDQAVTD+624                                             01617000
AVTABEND EQU   IEDQAVTD+618                                             01618000
AVTPLCBN EQU   IEDQAVTD+616                                             01619000
@NM00016 EQU   AVTSAVTP+1                                               01620000
@NM00015 EQU   AVTSAVTF                                                 01621000
AVTSNA   EQU   AVTSAVTF                                                 01622000
AVTONSNA EQU   AVTSAVTF                                                 01623000
AVTVTMCP EQU   AVTSAVTF                                                 01624000
@NM00014 EQU   IEDQAVTD+608                                             01625000
AVTCMBSS EQU   IEDQAVTD+604                                             01626000
AVTRCV   EQU   IEDQAVTD+600                                             01627000
AVTSEND  EQU   IEDQAVTD+596                                             01628000
AVTCSCH  EQU   IEDQAVTD+592                                             01629000
AVTQ1    EQU   IEDQAVTD+588                                             01630000
AVTE7    EQU   IEDQAVTD+584                                             01631000
AVTHB    EQU   IEDQAVTD+580                                             01632000
AVTR1    EQU   IEDQAVTD+576                                             01633000
AVTBZ    EQU   IEDQAVTD+572                                             01634000
AVTEZ    EQU   IEDQAVTD+568                                             01635000
AVTEC    EQU   IEDQAVTD+564                                             01636000
AVTEW    EQU   IEDQAVTD+560                                             01637000
AVTNDIAL EQU   AVTSCOPT                                                 01638000
AVTN2741 EQU   AVTSCOPT                                                 01639000
AVTCONCO EQU   AVTSCOPT                                                 01640000
AVTCONC  EQU   AVTSCOPT                                                 01641000
AVTCMBUF EQU   AVTSCOPT                                                 01642000
AVTAPDMP EQU   AVTSCOPT                                                 01643000
@NM00013 EQU   AVTSCOPT                                                 01644000
AVTHA    EQU   AVTDISP                                                  01645000
AVTEA    EQU   IEDQAVTD+548                                             01646000
AVTAX    EQU   IEDQAVTD+544                                             01647000
AVTA3    EQU   IEDQAVTD+540                                             01648000
AVTGD    EQU   IEDQAVTD+536                                             01649000
AVTAL    EQU   IEDQAVTD+532                                             01650000
AVTOLTST EQU   AVTHG02                                                  01651000
AVTE8    EQU   IEDQAVTD+524                                             01652000
AVTUI    EQU   IEDQAVTD+520                                             01653000
AVTCOMPT EQU   IEDQAVTD+516                                             01654000
AVTCRSRF EQU   IEDQAVTD+512                                             01655000
@NM00012 EQU   IEDQAVTD+508                                             01656000
AVTKA02  EQU   IEDQAVTD+504                                             01657000
AVTOPTPT EQU   IEDQAVTD+500                                             01658000
AVTPCBPT EQU   IEDQAVTD+496                                             01659000
AVTOPECA EQU   IEDQAVTD+488                                             01660000
AVTOLECA EQU   IEDQAVTD+484                                             01661000
AVTCKECA EQU   IEDQAVTD+480                                             01662000
AVTCWECA EQU   IEDQAVTD+476                                             01663000
AVTCWTCB EQU   IEDQAVTD+472                                             01664000
AVTOLTCB EQU   IEDQAVTD+468                                             01665000
AVTOCTCB EQU   IEDQAVTD+464                                             01666000
AVTCKTCB EQU   IEDQAVTD+460                                             01667000
AVTAS    EQU   IEDQAVTD+456                                             01668000
AVTNOLBF EQU   IEDQAVTD+454                                             01669000
AVTNCKPR EQU   IEDQAVTD+453                                             01670000
AVTCIB   EQU   IEDQAVTD+452                                             01671000
AVTSPLPT EQU   IEDQAVTD+448                                             01672000
AVTMVBFR EQU   IEDQAVTD+444                                             01673000
AVTSBTA  EQU   IEDQAVTD+440                                             01674000
AVTRARTN EQU   IEDQAVTD+436                                             01675000
AVTBSCAN EQU   IEDQAVTD+432                                             01676000
AVTRDYA  EQU   IEDQAVTD+428                                             01677000
AVTDISTR EQU   IEDQAVTD+420                                             01678000
AVTPARM3 EQU   IEDQAVTD+416                                             01679000
@NM00011 EQU   AVTPKF                                                   01680000
@NM00010 EQU   AVTPKF                                                   01681000
@NM00009 EQU   AVTPKF                                                   01682000
AVTFTCHF EQU   AVTPKF                                                   01683000
@NM00008 EQU   AVTPKF                                                   01684000
@NM00007 EQU   AVTPKF                                                   01685000
@NM00006 EQU   AVTPKF                                                   01686000
@NM00005 EQU   AVTPKF                                                   01687000
AVTPARM  EQU   IEDQAVTD+408                                             01688000
AVTEXS2A EQU   IEDQAVTD+402                                             01689000
AVTEXA2S EQU   IEDQAVTD+396                                             01690000
AVTOCGET EQU   IEDQAVTD+392                                             01691000
AVTCKAVT EQU   @NM00003+1                                               01692000
@NM00004 EQU   AVTCKFLG                                                 01693000
AVTCKHLT EQU   AVTCKFLG                                                 01694000
AVTCKREQ EQU   AVTCKFLG                                                 01695000
AVTCKENV EQU   AVTCKFLG                                                 01696000
AVTCKNAC EQU   AVTCKFLG                                                 01697000
AVTCKTAC EQU   AVTCKFLG                                                 01698000
@NM00002 EQU   IEDQAVTD+384                                             01699000
AVTREADD EQU   IEDQAVTD+380                                             01700000
AVTREADY EQU   IEDQAVTD+376                                             01701000
AVTRACE  EQU   IEDQAVTD+372                                             01702000
AVTTCB   EQU   IEDQAVTD+368                                             01703000
AVTPASWD EQU   IEDQAVTD+360                                             01704000
AVTCTLCH EQU   IEDQAVTD+352                                             01705000
AVTDOUBL EQU   IEDQAVTD+344                                             01706000
AVTDOUBX EQU   IEDQAVTD+336                                             01707000
AVTDPARM EQU   IEDQAVTD+332                                             01708000
AVTCSTCS EQU   IEDQAVTD+328                                             01709000
AVTDLQ   EQU   AVTSAVEX+32                                              01710000
@NM00001 EQU   AVTSAVEX                                                 01711000
AVTSAVE4 EQU   IEDQAVTD+216                                             01712000
AVTSAVE3 EQU   IEDQAVTD+144                                             01713000
AVTSAVE2 EQU   IEDQAVTD+72                                              01714000
AVTSAVE1 EQU   IEDQAVTD                                                 01715000
*                                      END UNREFERENCED COMPONENTS      01716000
@RT00337 EQU   RESTART                                                  01717000
@RT00374 EQU   MOVID                                                    01718000
@RT00377 EQU   ALLDONE                                                  01719000
@EL01    EQU   @EL00001                                                 01720000
@ENDDATA EQU   *                                                        01721000
@DATEND  EQU   *                                                        01722000
         END   IGCI310D,(C'PLS0312',0701,76364)                         01723000
