         TITLE 'IGCMU10D, MODEM SPEED SELECT                           *00001000
                        '                                               00002000
IGCMU10D CSECT ,                                                   0001 00003000
@PROLOG  DS    0H                                                  0002 00004000
*                                                                  0309 00005000
*                                                            @Y17XARN*/ 00006000
         USING *,RBASE                                       @Y17XARN*/ 00007000
         LR    RBASE,RBRANCH                                 @Y17XARN*/ 00008000
IGCMU10D IEDHJN AFTERHJN,HJN                                 @Y17XARN*/ 00009000
*/********************************************************************/ 00010000
*/* INITIALIZE CONTROL BLOCK REGISTERS.                              */ 00011000
*/********************************************************************/ 00012000
*                                                                  0310 00013000
*   ROPCAVT=RPARM;                  /* SET BASE FOR OP CTL AVT       */ 00014000
         LR    ROPCAVT,RPARM                                       0310 00015000
*   IEDQAPTR=OPCAVTPT;              /* SET BASE FOR TCAM AVT         */ 00016000
         L     IEDQAPTR,OPCAVTPT(,ROPCAVT)                         0311 00017000
*   ROPCE=OPCCOPCE;                 /* PICK UP ELEMENT POINTER       */ 00018000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                            0312 00019000
*   RSAVE=ADDR(OPCSAVE);            /* GET SAVE AREA ADDRESS         */ 00020000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0313 00021000
*/********************************************************************/ 00022000
*/* IF OCRESP FLAG IS SET TO 0, THEN THE ELEMENT IS ASSOCIATED       */ 00023000
*/* WITH A SPEED SELECT COMMAND WHICH NEEDS OPERAND CHECKING         */ 00024000
*/* AND A BDU SENT. IF OCRESP IS SET TO 1, THEN THE ELEMENT          */ 00025000
*/* IS ASSOCIATED WITH A RESPONSE TO A BDU SENT ON A PREVIOUS        */ 00026000
*/* ENTRY INTO THIS MODULE.                                  @Y17XARN*/ 00027000
*/********************************************************************/ 00028000
*                                                                  0314 00029000
*   IF OCRESP='1'B THEN             /* DOES ELEMENT POINT TO A     0314 00030000
*                                      RESPONSE BDU ?        @Y17XARN*/ 00031000
         TM    OCRESP(ROPCE),B'00000001'                           0314 00032000
         BO    @RT00314                                            0314 00033000
*     GOTO PRORESP;                 /* YES, PROCESS THE RESPONSE     */ 00034000
*   IF RLEN=0 THEN                  /* ANOTHER OPERAND ?             */ 00035000
         LTR   RLEN,RLEN                                           0316 00036000
         BZ    @RT00316                                            0316 00037000
*     GOTO CMDINV;                  /* NO, COMMAND INVALID           */ 00038000
*   OCBACKUP=OPCDOUBL;              /* SAVE LINE OR GROUP NAME       */ 00039000
         MVC   OCBACKUP(8,ROPCE),OPCDOUBL(ROPCAVT)                 0318 00040000
*   IF SCANBYTE<'0' THEN            /* IS FIRST SCAN BYTE NUMERIC?   */ 00041000
         CLI   SCANBYTE(RAPTR),C'0'                                0319 00042000
         BL    @RT00319                                            0319 00043000
*     GOTO CMDINV;                  /* MUST SPECIFY GRPNAME,RLN      */ 00044000
*                                                                  0321 00045000
*/********************************************************************/ 00046000
*/* SCAN THE FIRST OPERAND FOR VALID NUMERIC OF ONE TO THREE DIGITS. */ 00047000
*/* IF THE OPERAND IS A VALID NUMERIC, PUT THE RLN INTO RPARM AND    */ 00048000
*/* CALL THE 'GRPNAME,RLN' CODE TO FIND THE LINE ENTRY. 'GRPNAME'    */ 00049000
*/* IS IN OPCDOUBL AT ENTRY.                                         */ 00050000
*/********************************************************************/ 00051000
*                                                                  0321 00052000
*   RRPTR=RAPTR;                    /* SAVE POINTER TO RLN           */ 00053000
         LR    RRPTR,RAPTR                                         0321 00054000
*   RBYSCN=0;                       /* INITIALIZE BYTES SCANNED TO 0322 00055000
*                                      ZERO                          */ 00056000
         SLR   RBYSCN,RBYSCN                                       0322 00057000
*SCAN:                                                             0323 00058000
*   IF RLEN^=0 THEN                 /* END OF SCAN ?                 */ 00059000
SCAN     LTR   RLEN,RLEN                                           0323 00060000
         BZ    @RF00323                                            0323 00061000
*     DO;                           /* NO, SCAN OPERAND              */ 00062000
*       IF SCANBYTE=',' THEN        /* SCAN BYTE A COMMA ?           */ 00063000
         CLI   SCANBYTE(RAPTR),C','                                0325 00064000
         BNE   @RF00325                                            0325 00065000
*         DO;                       /* YES                           */ 00066000
*           RLEN=RLEN-1;            /* REDUCE BYTES LEFT TO SCAN     */ 00067000
         BCTR  RLEN,0                                              0327 00068000
*           RAPTR=RAPTR+1;          /* INCREMENT PAST COMMA          */ 00069000
         AL    RAPTR,@CF00053                                      0328 00070000
*         END;                                                     0329 00071000
*       ELSE                                                       0330 00072000
*         IF SCANBYTE>='0'&         /* IS DIGIT A VALID NUMERIC ?    */ 00073000
*             SCANBYTE<=CNINE THEN                                 0330 00074000
         B     @RC00325                                            0330 00075000
@RF00325 CLI   SCANBYTE(RAPTR),C'0'                                0330 00076000
         BL    @RF00330                                            0330 00077000
         CLI   SCANBYTE(RAPTR),C'9'                                0330 00078000
         BH    @RF00330                                            0330 00079000
*           DO;                     /* YES                           */ 00080000
*             RBYSCN=RBYSCN+1;      /* INCREMENT BYTES SCANNED       */ 00081000
         LA    @11,1                                               0332 00082000
         ALR   RBYSCN,@11                                          0332 00083000
*             RAPTR=RAPTR+1;        /* INCREMENT TO NEXT BYTE        */ 00084000
         ALR   RAPTR,@11                                           0333 00085000
*             RLEN=RLEN-1;          /* REDUCE BYTES LEFT TO SCAN     */ 00086000
         BCTR  RLEN,0                                              0334 00087000
*             GOTO SCAN;            /* CONTINUE SCAN                 */ 00088000
         B     SCAN                                                0335 00089000
*           END;                                                   0336 00090000
*         ELSE                      /* NO                            */ 00091000
*           GOTO CMDINV;            /* COMMAND INVALID               */ 00092000
*     END;                                                         0338 00093000
*   ELSE                                                           0339 00094000
*     GOTO CMDINV;                  /* INVALID COMMAND               */ 00095000
*   IF RBYSCN=0|                    /* NO BYTES SCANNED OR           */ 00096000
*       RBYSCN>AVTHA3 THEN          /* MORE THAN 3 BYTES SCANNED?    */ 00097000
@RC00323 LTR   RBYSCN,RBYSCN                                       0340 00098000
         BZ    @RT00340                                            0340 00099000
         CH    RBYSCN,AVTHA3(,IEDQAPTR)                            0340 00100000
         BH    @RT00340                                            0340 00101000
*     GOTO CMDINV;                  /* YES, COMMAND INVALID          */ 00102000
*/********************************************************************/ 00103000
*/* CONVERT RLN FROM EBCDIC TO BINARY AND TEST FOR VALID RLN --      */ 00104000
*/*               0 < RLN =< 255                                     */ 00105000
*/********************************************************************/ 00106000
*                                                                  0342 00107000
*   RBYSCN=RBYSCN-1;                /* GET RLN LENGTH LESS 1 FOR   0342 00108000
*                                      EXECUTE INSTRUCTION           */ 00109000
         BCTR  RBYSCN,0                                            0342 00110000
*   GEN REFS(RBYSCN,ROPCE) SETS(RPARM) NOEXIT SEQFLOW;             0343 00111000
*                                                            @Y17XARN*/ 00112000
Y@       EX    RBYSCN,MOVE              PUT RLN IN WORK AREA            00113000
         EX    RBYSCN,PACK              PACK RLN IN WORK AREA           00114000
         XC    OCBACKUP(EQU6,ROPCE),OCBACKUP(ROPCE)                     00115000
         CVB   RPARM,OCBACKUP(ROPCE)    CONVERT RLN TO BINARY           00116000
*   OCRLN=RPARM;                    /* SAVE RLN FOR MESSAGE          */ 00117000
         STC   RPARM,OCRLN(,ROPCE)                                 0344 00118000
*   IF RPARM=0|                     /* RLN=0 OR                      */ 00119000
*       RPARM>255 THEN              /* RLN GREATER THAN MAXIMUM ?    */ 00120000
         LTR   RPARM,RPARM                                         0345 00121000
         BZ    @RT00345                                            0345 00122000
         C     RPARM,@CF01508                                      0345 00123000
         BH    @RT00345                                            0345 00124000
*     GOTO CMDINV;                  /* YES, COMMAND INVALID          */ 00125000
*                                                                  0347 00126000
*/********************************************************************/ 00127000
*/* CALL IEDQCA AT ENTRY POINT FOR 'GRPNAME,RLN' LOOKUP. RETURN WILL */ 00128000
*/* BE THE FOLLOWING:                                                */ 00129000
*/*                     RRETURN+0 -- SUCCESSFUL                      */ 00130000
*/*                     RRETURN+4 -- UNSUCCESSFUL                    */ 00131000
*/* IF UNSUCCESSFUL, ONE OF THE FOLLOWING RETURN CODES WILL BE IN    */ 00132000
*/* RZERO:                                                           */ 00133000
*/*                  X'01' - LGB NOT OPEN (NOTOPEN)                  */ 00134000
*/*                  X'04' - NAME NOT FOUND (NONAME)                 */ 00135000
*/*                  X'08' - INVALID RLN (INVRLN)                    */ 00136000
*/*                  X'20' - NOT A 3705 LINE (NOT3705L)              */ 00137000
*/*                  X'02' - NCP NOT ACTIVE (NCPINACT)       @Y17XARN*/ 00138000
*/********************************************************************/ 00139000
*                                                                  0347 00140000
*   RBRANCH=OPCDCBLK;               /* GET ADDR OF LOOKUP ROUTINE    */ 00141000
         L     RBRANCH,OPCDCBLK(,ROPCAVT)                          0347 00142000
*   GEN REFS(RRETURN,RBRANCH,SAVELINE) NOSETS FLOWS(SAVELINE);     0348 00143000
         BALR  RRETURN,RBRANCH          /*CALL LOOKUP ROUTINE        */ 00144000
         B     SAVELINE                 /*GOOD RETURN - SAVE LINE    */ 00145000
*                                       /*ENTRY ADDRESS              */ 00146000
*   OCBACKUP=OPCDOUBL;              /* MOVE LGBNAME FOR MSG          */ 00147000
         MVC   OCBACKUP(8,ROPCE),OPCDOUBL(ROPCAVT)                 0349 00148000
*   IF RZERO=1|                     /* LGB NOT OPEN OR               */ 00149000
*       RZERO=8 THEN                /* RLN IS INVALID ?              */ 00150000
         C     RZERO,@CF00053                                      0350 00151000
         BE    @RT00350                                            0350 00152000
         C     RZERO,@CF00058                                      0350 00153000
         BNE   @RF00350                                            0350 00154000
@RT00350 DS    0H                                                  0351 00155000
*     RMSGNO=17;                    /* SET 'LINE NOT OPEN' MSG       */ 00156000
         LA    RMSGNO,17                                           0351 00157000
*   ELSE                                                           0352 00158000
*     IF RZERO=32 THEN              /* LINE NOT ON 3705 ?            */ 00159000
         B     @RC00350                                            0352 00160000
@RF00350 C     RZERO,@CF00080                                      0352 00161000
         BNE   @RF00352                                            0352 00162000
*       RMSGNO=173;                 /* SET 'NOT 3705 LINE' MSG       */ 00163000
         LA    RMSGNO,173                                          0353 00164000
*     ELSE                                                         0354 00165000
*       IF RZERO=NCPINACT THEN      /* NCP NOT ACTIVE ?              */ 00166000
         B     @RC00352                                            0354 00167000
@RF00352 C     RZERO,@CF00059                                      0354 00168000
         BNE   @RF00354                                            0354 00169000
*         RMSGNO=MSG400;            /* SET 'NCP NOT ACTIVE' MSG      */ 00170000
         LA    RMSGNO,400                                          0355 00171000
*       ELSE                                                       0356 00172000
*         RMSGNO=173;               /* ASSUME NONAME - SET 'NAME NOT    00173000
*                                      FOUND' MSG            @Y17XARN*/ 00174000
         B     @RC00354                                            0356 00175000
@RF00354 LA    RMSGNO,173                                          0356 00176000
*   GOTO WRITE;                     /* WRITE THE MESSAGE             */ 00177000
         B     WRITE                                               0357 00178000
*                                                                  0358 00179000
*/********************************************************************/ 00180000
*/* CHECK LAST OPERAND OF SPEED SELECT COMMAND FOR AN L (LOW)        */ 00181000
*/* OR AN H (HIGH).                                                  */ 00182000
*/********************************************************************/ 00183000
*                                                                  0358 00184000
*SAVELINE:                                                         0358 00185000
*   RPARM=RZERO;                    /* SAVE LINE ENTRY ADDRESS       */ 00186000
SAVELINE LR    RPARM,RZERO                                         0358 00187000
*   OCBACKUP=OPCDOUBL;              /* MOVE LGBNAME FOR MSG          */ 00188000
         MVC   OCBACKUP(8,ROPCE),OPCDOUBL(ROPCAVT)                 0359 00189000
*   IF RLEN=1 THEN                  /* ONE BYTE REMAINING ?          */ 00190000
         C     RLEN,@CF00053                                       0360 00191000
         BNE   @RF00360                                            0360 00192000
*     DO;                           /* YES, CHECK IT FOR L OR H      */ 00193000
*       IF SCANBYTE='L' THEN        /* SWITCH TO LOW SPEED ?         */ 00194000
         CLI   SCANBYTE(RAPTR),C'L'                                0362 00195000
         BNE   @RF00362                                            0362 00196000
*         OCWTG(1)='00'X;           /* YES, USE OCWTG AS TEMPORARY 0363 00197000
*                                      SWITCH FOR LOW SPEED INDICATOR*/ 00198000
         MVI   OCWTG(ROPCE),X'00'                                  0363 00199000
*       ELSE                                                       0364 00200000
*         IF SCANBYTE='H' THEN      /* SWITCH TO HIGH SPEED ?        */ 00201000
         B     @RC00362                                            0364 00202000
@RF00362 CLI   SCANBYTE(RAPTR),C'H'                                0364 00203000
         BNE   @RF00364                                            0364 00204000
*           OCWTG(1)='01'X;         /* YES, USE OCWTG AS TEMPORARY 0365 00205000
*                                      SWITCH FOR HIGH SPEED       0365 00206000
*                                      INDICATOR                     */ 00207000
         MVI   OCWTG(ROPCE),X'01'                                  0365 00208000
*         ELSE                      /* NO                            */ 00209000
*           GOTO CMDINV;            /* COMMAND INVALID               */ 00210000
*     END;                                                         0367 00211000
*   ELSE                                                           0368 00212000
*     GOTO CMDINV;                  /* COMMAND INVALID               */ 00213000
*/********************************************************************/ 00214000
*/* CHECK LINE ENTRY TO DETERMINE THAT IT IS VALID LINE ENTRY        */ 00215000
*/* ATTACHED TO A 3705.                                      @Y17XARN*/ 00216000
*/********************************************************************/ 00217000
*                                                                  0369 00218000
*   IEDQTPTR=RPARM;                 /* SET LINE ENTRY BASE           */ 00219000
@RC00360 LR    IEDQTPTR,RPARM                                      0369 00220000
*   IF TRMPREF='1'B&                /* 3705 RESOURCE?                */ 00221000
*       TRMTYPE=TRMNSDLC THEN                                      0370 00222000
         TM    TRMPREF(IEDQTPTR),B'00010000'                       0370 00223000
         BNO   @RF00370                                            0370 00224000
         LR    @11,IEDQTPTR                                        0370 00225000
         AL    @11,@CF01122                                        0370 00226000
         CLI   TRMTYPE-11(@11),X'20'                               0370 00227000
         BNE   @RF00370                                            0370 00228000
*     DO;                           /* BYSC/SS LINE?                 */ 00229000
*     END;                          /* YES, CONTINUE                 */ 00230000
*   ELSE                                                           0373 00231000
*     DO;                                                          0373 00232000
         B     @RC00370                                            0373 00233000
@RF00370 DS    0H                                                  0374 00234000
*       RMSGNO=173;                 /* SET 'INVALID ENTRY' MSG       */ 00235000
         LA    RMSGNO,173                                          0374 00236000
*       GOTO WRITE;                 /* WRITE THE MESSAGE             */ 00237000
         B     WRITE                                               0375 00238000
*     END;                                                         0376 00239000
*                                                                  0377 00240000
*/********************************************************************/ 00241000
*/* GET BUFFER UNIT INTO WHICH THE SPEED SELECT BDU COMMAND WILL     */ 00242000
*/* BE BUILT                                                         */ 00243000
*/********************************************************************/ 00244000
*                                                                  0377 00245000
*   RPARM=1;                        /* GET ONE BUFFER UNIT           */ 00246000
@RC00370 LA    RPARM,1                                             0377 00247000
*   RBRANCH=OPCGETBF;               /* GET ADDRESS OF BUFFER       0378 00248000
*                                      ALLOCATION ROUTINE            */ 00249000
         L     RBRANCH,OPCGETBF(,ROPCAVT)                          0378 00250000
*   GEN( BALR RRETURN,RBRANCH );    /* CALL ALLOCATION ROUTINE       */ 00251000
          BALR RRETURN,RBRANCH                                          00252000
*   OCUNIT=RPARM;                   /* PUT BUFFER UNIT ADDR INTO OPCE*/ 00253000
         ST    RPARM,OCUNIT(,ROPCE)                                0380 00254000
*/********************************************************************/ 00255000
*/* BUILD PACKED RU FOR SPEED SELECT COMMAND                 @Y17XARN*/ 00256000
*/********************************************************************/ 00257000
*                                                                  0381 00258000
*   IEDPRUQP=RPARM;                 /* SET UP BUFFER ADDRESSABILITY  */ 00259000
         LR    IEDPRUQP,RPARM                                      0381 00260000
*   PRURH=TRHFID0;                  /* SETUP RH AND TH BYTES         */ 00261000
         LR    @11,IEDPRUQP                                        0382 00262000
         SL    @11,@CF00058                                        0382 00263000
         MVC   PRURH(3,@11),@CB01310                               0382 00264000
*   PRUFIDN=TTH0BYT0;               /* FOR FID0                      */ 00265000
         MVI   PRUFIDN(@11),X'0C'                                  0383 00266000
*   PRUTTCIN=OCTRMTBL;              /* GET TTCIN FROM OC TERM TABLE  */ 00267000
         LH    @11,OCTRMTBL(,ROPCE)                                0384 00268000
         N     @11,@CF01533                                        0384 00269000
         STH   @11,PRUTTCIN(,IEDPRUQP)                             0384 00270000
*   PRUDATCT=SPDDATCN;              /* GET DATA COUNT                */ 00271000
         MVC   PRUDATCT(2,IEDPRUQP),@CH00056                       0385 00272000
*   PRUTIC=PRUINTIC;                /* SETUP TIC                     */ 00273000
         MVC   PRUTIC(4,IEDPRUQP),@CB01221                         0386 00274000
*   RUDATA1=CD0CTRL;                /* BDU COMMAND                   */ 00275000
         MVI   RUDATA1(IEDPRUQP),X'08'                             0387 00276000
*   RUDATA2=CD0CCMS;                /* BDU MODIFIER                  */ 00277000
         MVI   RUDATA2(IEDPRUQP),X'12'                             0388 00278000
*   RUDATA7=OCWTG;                  /* SPEED HIGH OR LOW             */ 00279000
         MVC   RUDATA7(1,IEDPRUQP),OCWTG(ROPCE)                    0389 00280000
*/********************************************************************/ 00281000
*/* SET UP TO CALL PACKED RU DISPATCHER                              */ 00282000
*/********************************************************************/ 00283000
*                                                                  0390 00284000
*   OCCKDAT1=OCWTG;                 /* SAVE DATA BYTE IN OPCE FOR  0390 00285000
*                                      CHECKPOINT                    */ 00286000
         MVC   OCCKDAT1(1,ROPCE),OCWTG(ROPCE)                      0390 00287000
*   OCWTG='MU';                     /* WTG IS THIS MODULE - MU       */ 00288000
         MVC   OCWTG(2,ROPCE),@CC01516                             0391 00289000
*   OCRESP='1'B;                    /* INDICATE RESPONSE FOR NEXT  0392 00290000
*                                      ENTRY                         */ 00291000
         OI    OCRESP(ROPCE),B'00000001'                           0392 00292000
*   OPCMODID='02';                  /* SET NEXT LOAD TO PACKED RU  0393 00293000
*                                      DISPATCHER            @Y17XARN*/ 00294000
         MVC   OPCMODID(2,ROPCAVT),@CC01517                        0393 00295000
*   RPARM=ROPCAVT;                  /* PASS @OP CTL AVT              */ 00296000
         LR    RPARM,ROPCAVT                                       0394 00297000
*   GEN REFS(OPCXCTL,ROPCAVT);                                     0395 00298000
*                                                            @Y17XARN*/ 00299000
         XCTL  SF=(E,OPCXCTL(ROPCAVT))                                  00300000
*                                   /* XCTL TO BDU DISPATCHER        */ 00301000
*                                                                  0396 00302000
*/********************************************************************/ 00303000
*/* PROCESS THE RESPONSE BDU FROM THE SPEED SELECT COMMAND.  @Y17XARN*/ 00304000
*/********************************************************************/ 00305000
*                                                                  0396 00306000
*PRORESP:                                                          0396 00307000
*   RFY                                                            0396 00308000
*     IEDBDU BASED(RBDU);           /* BASE FOR IEDBDU DSECT         */ 00309000
PRORESP  DS    0H                                                  0397 00310000
*   RBDU=OCUNIT;                    /* SET ADDR OF BUFFER UNIT       */ 00311000
         L     RBDU,OCUNIT(,ROPCE)                                 0397 00312000
*   IF BDUSYRSP='60'X THEN          /* NORMAL COMPLETION ?           */ 00313000
         CLI   BDUSYRSP(RBDU),X'60'                                0398 00314000
         BNE   @RF00398                                            0398 00315000
*     RMSGNO=387;                   /* YES, SET MESSAGE FOR NORMAL 0399 00316000
*                                      COMPLETION                    */ 00317000
         LA    RMSGNO,387                                          0399 00318000
*   ELSE                                                           0400 00319000
*     IF BDUSYRSP='99'X THEN        /* ALREADY AT REQUESTED    SPEED?*/ 00320000
         B     @RC00398                                            0400 00321000
@RF00398 CLI   BDUSYRSP(RBDU),X'99'                                0400 00322000
         BNE   @RF00400                                            0400 00323000
*       RMSGNO=385;                 /* YES, SET ALREADY MESSAGE      */ 00324000
         LA    RMSGNO,385                                          0401 00325000
*     ELSE                                                         0402 00326000
*       IF BDUSYRSP='9F'X&BDUEXRSP='82'X THEN/* MODEM CANNOT CHANGE     00327000
*                                      SPEED                         */ 00328000
         B     @RC00400                                            0402 00329000
@RF00400 CLI   BDUSYRSP(RBDU),X'9F'                                0402 00330000
         BNE   @RF00402                                            0402 00331000
         CLI   BDUEXRSP(RBDU),X'82'                                0402 00332000
         BNE   @RF00402                                            0402 00333000
*         RMSGNO=386;               /* YES, SET NO SPEED CHANGE    0403 00334000
*                                      MESSAGE                       */ 00335000
         LA    RMSGNO,386                                          0403 00336000
*       ELSE                                                       0404 00337000
*         RMSGNO=199;               /* NO, SET MESSAGE FOR REQUEST 0404 00338000
*                                      NOT HONORED                   */ 00339000
         B     @RC00402                                            0404 00340000
@RF00402 LA    RMSGNO,199                                          0404 00341000
*   IF BDUSYRSP='60'X THEN          /* NORMAL MSG TO WRITE ?         */ 00342000
@RC00402 DS    0H                                                  0405 00343000
@RC00400 DS    0H                                                  0405 00344000
@RC00398 CLI   BDUSYRSP(RBDU),X'60'                                0405 00345000
         BNE   @RF00405                                            0405 00346000
*     DO;                           /* SET UP FOR EXIT               */ 00347000
*       OPCMODID='M3';              /* GOOD MSG WRITE RTN            */ 00348000
         MVC   OPCMODID(2,ROPCAVT),@CC01525                        0407 00349000
*       GO TO WRITE1;               /* EXIT                          */ 00350000
         B     WRITE1                                              0408 00351000
*     END;                                                         0409 00352000
*   GOTO WRITE;                     /* WRITE THE MESSAGE             */ 00353000
         B     WRITE                                               0410 00354000
*/********************************************************************/ 00355000
*/* COMMAND INVALID MESSAGE                                          */ 00356000
*/********************************************************************/ 00357000
*                                                                  0411 00358000
*CMDINV:                                                           0411 00359000
*   RMSGNO=18;                      /* SET 'COMMAND INVALID' MSG     */ 00360000
CMDINV   LA    RMSGNO,18                                           0411 00361000
*/********************************************************************/ 00362000
*/* CALL THE MESSAGE WRITER MODULE TO WRITE THE MESSAGE              */ 00363000
*/* SPECIFIED IN RMSGNO.                                             */ 00364000
*/********************************************************************/ 00365000
*                                                                  0412 00366000
*WRITE:                                                            0412 00367000
*   OPCMODID='03';                  /* SET UP TO GO TO THE MSG WRITER   00368000
*                                      MODULE                        */ 00369000
WRITE    MVC   OPCMODID(2,ROPCAVT),@CC01528                        0412 00370000
*WRITE1:                                                           0413 00371000
*   OCRESP='0'B;                    /* RESET RESPONSE INDICATOR      */ 00372000
WRITE1   NI    OCRESP(ROPCE),B'11111110'                           0413 00373000
*   RPARM=ROPCAVT;                  /* PASS OP CTL AVT               */ 00374000
         LR    RPARM,ROPCAVT                                       0414 00375000
*   GEN REFS(OPCXCTL,ROPCAVT);                                     0415 00376000
*                                                            @Y17XARN*/ 00377000
         XCTL SF=(E,OPCXCTL(ROPCAVT))   /*CALL MSG WRITER            */ 00378000
*   GEN;                                                           0416 00379000
MOVE     MVC   OCBACKUP(EQU0,ROPCE),EQU0(RRPTR)                         00380000
PACK     PACK  OCBACKUP+EQU6(EQU2,ROPCE),OCBACKUP(EQU0,ROPCE)           00381000
EQU0     EQU   0                                                        00382000
EQU2     EQU   2                                                        00383000
EQU6     EQU   6                                                        00384000
*   END IGCMU10D                                                   0417 00385000
*                                                                  0417 00386000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00387000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00388000
*/*%INCLUDE SYSLIB  (TBDUD   )                                       */ 00389000
*/*%INCLUDE SYSLIB  (TCD0D   )                                       */ 00390000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00391000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00392000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 00393000
*/*%INCLUDE SYSLIB  (TPRUD   )                                       */ 00394000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 00395000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 00396000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00397000
*                                                                  0417 00398000
*       ;                                                          0417 00399000
@EL00001 DS    0H                                                  0417 00400000
@EF00001 DS    0H                                                  0417 00401000
@ER00001 BR    @14                                                 0417 00402000
@DATA    DS    0H                                                       00403000
@CH00056 DC    H'7'                                                     00404000
@DATD    DSECT                                                          00405000
         DS    0F                                                       00406000
@ZTEMPS  DS    C                                                        00407000
@ZTEMPND EQU   *                                                        00408000
@ZLEN    EQU   @ZTEMPND-@ZTEMPS                                         00409000
@TEMPS   EQU   @ZTEMPS                                                  00410000
@L       EQU   @ZLEN                                                    00411000
IGCMU10D CSECT                                                          00412000
         DS    0F                                                       00413000
@CF00053 DC    F'1'                                                     00414000
@CF00059 DC    F'2'                                                     00415000
@CF00058 DC    F'8'                                                     00416000
@CF00080 DC    F'32'                                                    00417000
@CF01508 DC    F'255'                                                   00418000
@CF01122 DC    F'-3'                                                    00419000
@CF01533 DC    XL4'0000FFFF'                                            00420000
@DATD    DSECT                                                          00421000
         DS    0D                                                       00422000
IEDQPPTR DS    A                                                        00423000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00424000
@ENDDATD EQU   *                                                        00425000
@DATEND  EQU   *                                                        00426000
IGCMU10D CSECT                                                          00427000
         DS    0F                                                       00428000
@SIZDATD DC    AL1(0)                                                   00429000
         DC    AL3(@ENDDATD-@DATD)                                      00430000
@SIZ001  EQU   @SIZDATD                                                 00431000
         DS    0D                                                       00432000
@CC01516 DC    C'MU'                                                    00433000
@CC01517 DC    C'02'                                                    00434000
@CC01525 DC    C'M3'                                                    00435000
@CC01528 DC    C'03'                                                    00436000
@CB01221 DC    X'08000002'                                              00437000
@CB01310 DC    X'0B8000'                                                00438000
         DS    CL1                                                      00439000
ZAPAREA  DC    XL50'0'                                                  00440000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00441000
@01      EQU   01                                                       00442000
@02      EQU   02                                                       00443000
@03      EQU   03                                                       00444000
@04      EQU   04                                                       00445000
@05      EQU   05                                                       00446000
@06      EQU   06                                                       00447000
@07      EQU   07                                                       00448000
@08      EQU   08                                                       00449000
@09      EQU   09                                                       00450000
@10      EQU   10                                                       00451000
@11      EQU   11                                                       00452000
@12      EQU   12                                                       00453000
@13      EQU   13                                                       00454000
@14      EQU   14                                                       00455000
@15      EQU   15                                                       00456000
@0       EQU   00                                                       00457000
@1       EQU   01                                                       00458000
@2       EQU   02                                                       00459000
@3       EQU   03                                                       00460000
@4       EQU   04                                                       00461000
@5       EQU   05                                                       00462000
@6       EQU   06                                                       00463000
@7       EQU   07                                                       00464000
@8       EQU   08                                                       00465000
@9       EQU   09                                                       00466000
@A       EQU   10                                                       00467000
@B       EQU   11                                                       00468000
@C       EQU   12                                                       00469000
@D       EQU   13                                                       00470000
@E       EQU   14                                                       00471000
@F       EQU   15                                                       00472000
RMSGNO   EQU   @00                                                      00473000
RZERO    EQU   @00                                                      00474000
RPARM    EQU   @01                                                      00475000
ROPCAVT  EQU   @02                                                      00476000
ROPCE    EQU   @03                                                      00477000
IEDQAPTR EQU   @04                                                      00478000
RWORKA   EQU   @05                                                      00479000
RLEN     EQU   @06                                                      00480000
IEDQTPTR EQU   @07                                                      00481000
RAPTR    EQU   @07                                                      00482000
RRPTR    EQU   @08                                                      00483000
RBYSCN   EQU   @09                                                      00484000
RBASE    EQU   @12                                                      00485000
RSAVE    EQU   @13                                                      00486000
RRETURN  EQU   @14                                                      00487000
RBRANCH  EQU   @15                                                      00488000
IEDPRUQP EQU   @06                                                      00489000
RBDU     EQU   @06                                                      00490000
SCANBYTE EQU   0                                                        00491000
IEDQAVTD EQU   0                                                        00492000
AVTSAVEX EQU   IEDQAVTD+288                                             00493000
@NM00003 EQU   IEDQAVTD+388                                             00494000
AVTCKFLG EQU   @NM00003                                                 00495000
AVTBASE  EQU   IEDQAVTD+412                                             00496000
AVTPKF   EQU   AVTBASE                                                  00497000
AVTHG02  EQU   IEDQAVTD+528                                             00498000
AVTDISP  EQU   IEDQAVTD+552                                             00499000
AVTHD    EQU   IEDQAVTD+556                                             00500000
AVTSCOPT EQU   AVTHD                                                    00501000
AVTSAVTP EQU   IEDQAVTD+612                                             00502000
AVTSAVTF EQU   AVTSAVTP                                                 00503000
AVTCKPEL EQU   IEDQAVTD+652                                             00504000
AVTCKRMV EQU   AVTCKPEL                                                 00505000
AVTCKELF EQU   IEDQAVTD+680                                             00506000
AVTCKBYT EQU   IEDQAVTD+691                                             00507000
AVTHG01  EQU   IEDQAVTD+692                                             00508000
AVTCKLNK EQU   IEDQAVTD+696                                             00509000
AVTCRELE EQU   IEDQAVTD+708                                             00510000
AVTCCELE EQU   AVTCRELE                                                 00511000
AVTCLRHI EQU   IEDQAVTD+716                                             00512000
AVTADBUF EQU   IEDQAVTD+720                                             00513000
AVTSYSER EQU   IEDQAVTD+728                                             00514000
AVTCKPQB EQU   IEDQAVTD+804                                             00515000
AVTCKPTB EQU   AVTCKPQB                                                 00516000
AVTCKPEC EQU   AVTCKPQB+4                                               00517000
AVTCKPCC EQU   AVTCKPEC                                                 00518000
AVTOPCQB EQU   IEDQAVTD+816                                             00519000
AVTOPCOB EQU   AVTOPCQB                                                 00520000
AVTOPCEC EQU   AVTOPCQB+4                                               00521000
AVTOPCCC EQU   AVTOPCEC                                                 00522000
AVTOLTQB EQU   IEDQAVTD+828                                             00523000
AVTCWFL1 EQU   IEDQAVTD+924                                             00524000
AVTCWFL2 EQU   IEDQAVTD+925                                             00525000
AVTSUBT  EQU   IEDQAVTD+948                                             00526000
AVTIOTR  EQU   IEDQAVTD+949                                             00527000
AVTHA3   EQU   IEDQAVTD+1024                                            00528000
AVTBIT1  EQU   IEDQAVTD+1050                                            00529000
AVTBIT2  EQU   IEDQAVTD+1051                                            00530000
AVTBIT3  EQU   IEDQAVTD+1052                                            00531000
AVTBIT4  EQU   IEDQAVTD+1136                                            00532000
@NM00083 EQU   IEDQAVTD+1232                                            00533000
IEDNSVTD EQU   0                                                        00534000
SAVTDIAG EQU   IEDNSVTD                                                 00535000
SAVTDIAF EQU   SAVTDIAG                                                 00536000
SAVTLUSQ EQU   IEDNSVTD+88                                              00537000
SAVTTCPU EQU   IEDNSVTD+238                                             00538000
SAVTZELM EQU   IEDNSVTD+270                                             00539000
SAVTRDRV EQU   IEDNSVTD+284                                             00540000
SAVTCKQB EQU   IEDNSVTD+300                                             00541000
SAVTCKTB EQU   SAVTCKQB                                                 00542000
SAVTCKEC EQU   SAVTCKQB+4                                               00543000
SAVTCKCC EQU   SAVTCKEC                                                 00544000
IEDBDU   EQU   0                                                        00545000
BDUFNFLG EQU   IEDBDU+2                                                 00546000
BDUBDUFG EQU   IEDBDU+3                                                 00547000
BDURSP   EQU   IEDBDU+4                                                 00548000
BDUSYRSP EQU   BDURSP                                                   00549000
BDUEXRSP EQU   BDURSP+1                                                 00550000
BDUEND   EQU   IEDBDU+6                                                 00551000
IEDQOPCD EQU   0                                                        00552000
OPCDOUBL EQU   IEDQOPCD                                                 00553000
OPCAVTPT EQU   IEDQOPCD+8                                               00554000
OPCCOPCE EQU   IEDQOPCD+12                                              00555000
OPCDCBLK EQU   IEDQOPCD+16                                              00556000
OPCSAVE  EQU   IEDQOPCD+56                                              00557000
OPCAQCTL EQU   IEDQOPCD+180                                             00558000
OPCXCTL  EQU   IEDQOPCD+204                                             00559000
OPCLDNME EQU   IEDQOPCD+212                                             00560000
OPCMODID EQU   OPCLDNME+3                                               00561000
OPCGETBF EQU   IEDQOPCD+276                                             00562000
OPCSPEC  EQU   IEDQOPCD+300                                             00563000
IEDQOPCE EQU   0                                                        00564000
OCELEM   EQU   IEDQOPCE+4                                               00565000
OCUNIT   EQU   IEDQOPCE+8                                               00566000
OCRUDEST EQU   OCUNIT                                                   00567000
OCCKPKEY EQU   OCRUDEST                                                 00568000
OCSCAN   EQU   OCCKPKEY                                                 00569000
OCOPTCDE EQU   IEDQOPCE+12                                              00570000
OCSWITCH EQU   IEDQOPCE+13                                              00571000
OCFLAG   EQU   IEDQOPCE+14                                              00572000
OCRESP   EQU   OCFLAG                                                   00573000
OCRLN    EQU   IEDQOPCE+15                                              00574000
@NM00118 EQU   IEDQOPCE+16                                              00575000
OCDEST   EQU   @NM00118                                                 00576000
OCREQVAL EQU   OCDEST+1                                                 00577000
OCTRMTBL EQU   IEDQOPCE+20                                              00578000
OCLINENO EQU   IEDQOPCE+22                                              00579000
OCTIOT   EQU   OCLINENO                                                 00580000
OCTRUNIT EQU   IEDQOPCE+24                                              00581000
OCRSID   EQU   OCTRUNIT                                                 00582000
OCALSTAT EQU   OCRSID                                                   00583000
OCPARM   EQU   IEDQOPCE+28                                              00584000
OCWTG    EQU   IEDQOPCE+30                                              00585000
OCBACKUP EQU   IEDQOPCE+32                                              00586000
OCMODNME EQU   IEDQOPCE+40                                              00587000
OCIPLWA  EQU   OCMODNME                                                 00588000
OCCKDATA EQU   IEDQOPCE+48                                              00589000
OCRSTGTM EQU   OCCKDATA                                                 00590000
OCCKDAT1 EQU   OCRSTGTM                                                 00591000
IEDQOPCN EQU   0                                                        00592000
OCLDNME  EQU   IEDQOPCN                                                 00593000
OCLINTTE EQU   OCLDNME                                                  00594000
OCREQFLG EQU   OCLINTTE+2                                               00595000
OCPREFLG EQU   OCLINTTE+3                                               00596000
IEDQPRF  EQU   0                                                        00597000
PRFRCB   EQU   IEDQPRF                                                  00598000
PRFKEY   EQU   PRFRCB                                                   00599000
PRFQCBA  EQU   PRFRCB+1                                                 00600000
PRFPRI   EQU   PRFRCB+4                                                 00601000
PRFLINK  EQU   PRFRCB+5                                                 00602000
PRFTIC   EQU   IEDQPRF+8                                                00603000
PRFTICC  EQU   PRFTIC                                                   00604000
PRFNBUNT EQU   IEDQPRF+12                                               00605000
PRFSUNIT EQU   PRFNBUNT                                                 00606000
PRFPLQCB EQU   PRFSUNIT                                                 00607000
@NM00135 EQU   IEDQPRF+16                                               00608000
PRFSVFFO EQU   @NM00135                                                 00609000
PRFSTAT1 EQU   IEDQPRF+20                                               00610000
PRFEOFN  EQU   PRFSTAT1                                                 00611000
PRFCORE  EQU   IEDQPRF+21                                               00612000
PRFXTRA  EQU   PRFCORE                                                  00613000
PRFSCAN  EQU   IEDQPRF+24                                               00614000
PRFTQBCK EQU   IEDQPRF+26                                               00615000
PRFNTXT  EQU   PRFTQBCK                                                 00616000
PRFEOBOF EQU   PRFNTXT                                                  00617000
PRFCHDR  EQU   IEDQPRF+32                                               00618000
PRFHQBCK EQU   IEDQPRF+35                                               00619000
IEDPF1   EQU   0                                                        00620000
PRF1FLG1 EQU   IEDPF1+3                                                 00621000
PRF1WD2  EQU   IEDPF1+4                                                 00622000
PRF1SEQP EQU   PRF1WD2                                                  00623000
PRF1SQID EQU   PRF1SEQP                                                 00624000
PRF1TAG1 EQU   PRF1SQID                                                 00625000
IEDPF2   EQU   0                                                        00626000
PRF2FLG2 EQU   IEDPF2                                                   00627000
PRF2WD2  EQU   IEDPF2+4                                                 00628000
IEDPRUQD EQU   0                                                        00629000
PRUTTCIN EQU   IEDPRUQD                                                 00630000
PRUDATCT EQU   IEDPRUQD+2                                               00631000
PRUTIC   EQU   IEDPRUQD+8                                               00632000
PRUDATA  EQU   IEDPRUQD+12                                              00633000
IEDPRUND EQU   0                                                        00634000
PRURHTH  EQU   IEDPRUND                                                 00635000
PRURH    EQU   PRURHTH                                                  00636000
PRURHFG0 EQU   PRURH                                                    00637000
PRURHFG1 EQU   PRURH+1                                                  00638000
PRURHFG2 EQU   PRURH+2                                                  00639000
PRUTH    EQU   PRURHTH+3                                                00640000
PRUFIDN  EQU   PRUTH                                                    00641000
IEDRH    EQU   0                                                        00642000
TRHBYTE0 EQU   IEDRH                                                    00643000
TRHBYTE1 EQU   IEDRH+1                                                  00644000
TRHBYTE2 EQU   IEDRH+2                                                  00645000
IEDTH    EQU   0                                                        00646000
TTHBYTE0 EQU   IEDTH                                                    00647000
TTHSNF   EQU   IEDTH+6                                                  00648000
TTHTAG   EQU   TTHSNF                                                   00649000
TTHTAG1  EQU   TTHTAG                                                   00650000
IEDQTRM  EQU   0                                                        00651000
TRMSTATE EQU   IEDQTRM                                                  00652000
TRMLOG   EQU   TRMSTATE                                                 00653000
TRMPREF  EQU   TRMSTATE                                                 00654000
TRMINSEQ EQU   IEDQTRM+4                                                00655000
TLISTCNT EQU   TRMINSEQ                                                 00656000
TRMOUTSQ EQU   IEDQTRM+6                                                00657000
TLISTEN  EQU   TRMOUTSQ                                                 00658000
TRMDSORG EQU   TLISTEN                                                  00659000
TRMALTD  EQU   IEDQTRM+8                                                00660000
TRMDEVFL EQU   IEDQTRM+10                                               00661000
TRMSTAT  EQU   IEDQTRM+12                                               00662000
IEDNTRM  EQU   0                                                        00663000
TRMBYTE4 EQU   IEDNTRM                                                  00664000
TRMBYTE3 EQU   IEDNTRM+1                                                00665000
TRMBYTE2 EQU   IEDNTRM+2                                                00666000
TRMINPG  EQU   TRMBYTE2                                                 00667000
TRMBYTE1 EQU   IEDNTRM+3                                                00668000
TRMSCPRQ EQU   TRMBYTE1                                                 00669000
TRMBYTE0 EQU   IEDNTRM+6                                                00670000
TRMSIBPT EQU   IEDNTRM+7                                                00671000
TRMTYPE  EQU   IEDNTRM+11                                               00672000
RUDATA1  EQU   PRUDATA                                                  00673000
RUDATA2  EQU   PRUDATA+1                                                00674000
RUDATA7  EQU   PRUDATA+6                                                00675000
OPCAQWD  EQU   OPCAQCTL                                                 00676000
OPCAQWD1 EQU   OPCAQWD                                                  00677000
OPCAQWD2 EQU   OPCAQWD+4                                                00678000
OPCAQWD3 EQU   OPCAQWD+8                                                00679000
OCCKPKY1 EQU   OCCKPKEY                                                 00680000
OCCKPTYP EQU   OCCKPKY1                                                 00681000
OCICACTN EQU   OCMODNME                                                 00682000
OCICDADR EQU   OCICACTN                                                 00683000
OCICSW   EQU   OCICDADR+3                                               00684000
TRMPRE1  EQU   TRMBYTE4                                                 00685000
TRMPRE   EQU   TRMBYTE3                                                 00686000
TRMNCP   EQU   TRMBYTE3                                                 00687000
TRMPU    EQU   TRMBYTE3                                                 00688000
TRMLU    EQU   TRMBYTE3                                                 00689000
TRMLINK  EQU   TRMBYTE3                                                 00690000
BDUTEXT  EQU   BDUEND                                                   00691000
OCCIB    EQU   OCREQVAL                                                 00692000
PRFSHDR  EQU   IEDQPRF+42                                               00693000
TRMOPT   EQU   IEDQTRM+20                                               00694000
*                                      START UNREFERENCED COMPONENTS    00695000
@NM00164 EQU   TRMLINK                                                  00696000
TRMLSTAT EQU   TRMLINK                                                  00697000
TRMLINT  EQU   TRMLINK                                                  00698000
TRMEPMOD EQU   TRMLINK                                                  00699000
TRMLULOG EQU   TRMLU                                                    00700000
TRMINERR EQU   TRMLU                                                    00701000
TRMLUREQ EQU   TRMLU                                                    00702000
TRMSESRQ EQU   TRMLU                                                    00703000
TRMTDIFF EQU   TRMLU                                                    00704000
TRMLUTM  EQU   TRMLU                                                    00705000
TRMLUIT  EQU   TRMLU                                                    00706000
TRMAUTO  EQU   TRMLU                                                    00707000
TRMPCONT EQU   TRMPU                                                    00708000
@NM00163 EQU   TRMPU                                                    00709000
TRMNCONT EQU   TRMNCP                                                   00710000
TRMQUCKN EQU   TRMNCP                                                   00711000
TRMSLOWN EQU   TRMNCP                                                   00712000
TRMSYGEN EQU   TRMNCP                                                   00713000
TRMNCPCL EQU   TRMNCP                                                   00714000
TRMIPLDM EQU   TRMNCP                                                   00715000
TRMINOUT EQU   TRMPRE                                                   00716000
TRMRDOUT EQU   TRMPRE                                                   00717000
TRMNLOUT EQU   TRMPRE                                                   00718000
TRMWROUT EQU   TRMPRE                                                   00719000
TRMASNXI EQU   TRMPRE                                                   00720000
TRMSTMM  EQU   TRMPRE                                                   00721000
TRMCMODE EQU   TRMPRE                                                   00722000
TRMSTPND EQU   TRMPRE                                                   00723000
TRMLYNCH EQU   TRMPRE1                                                  00724000
TRMSPOUT EQU   TRMPRE1                                                  00725000
TRMERLCK EQU   TRMPRE1                                                  00726000
TRMQNPL  EQU   TRMPRE1                                                  00727000
TRMSPACT EQU   TRMPRE1                                                  00728000
TRMOCNI  EQU   TRMPRE1                                                  00729000
TRMSESSN EQU   TRMPRE1                                                  00730000
TRMCONT  EQU   TRMPRE1                                                  00731000
OCICINAC EQU   OCICSW                                                   00732000
@NM00124 EQU   OCICSW                                                   00733000
OCICATST EQU   OCICDADR+1                                               00734000
OCICTYPE EQU   OCICDADR                                                 00735000
@NM00123 EQU   OCCKPKY1                                                 00736000
OCCKPENV EQU   OCCKPKY1                                                 00737000
OCCKPRST EQU   OCCKPTYP                                                 00738000
OCCKPNCP EQU   OCCKPTYP                                                 00739000
OCCKPINC EQU   OCCKPTYP                                                 00740000
OPCAQLST EQU   OPCAQWD3+1                                               00741000
OPCAQRQ3 EQU   OPCAQWD3                                                 00742000
OPCAQSEC EQU   OPCAQWD2+1                                               00743000
OPCAQRQ2 EQU   OPCAQWD2                                                 00744000
OPCAQFST EQU   OPCAQWD1+1                                               00745000
OPCAQREQ EQU   OPCAQWD1                                                 00746000
TRMSUBST EQU   IEDNTRM+12                                               00747000
TRMRLMCT EQU   IEDNTRM+10                                               00748000
TRMCOHTG EQU   TRMSIBPT+1                                               00749000
TRMGPCNT EQU   TRMSIBPT                                                 00750000
TRMBUFRD EQU   TRMBYTE0                                                 00751000
TRMSNA   EQU   TRMBYTE0                                                 00752000
TRMGP    EQU   TRMBYTE0                                                 00753000
TRMDIAL  EQU   TRMBYTE0                                                 00754000
@NM00162 EQU   TRMBYTE0                                                 00755000
TRMOUTPT EQU   TRMBYTE0                                                 00756000
TRMINPUT EQU   TRMBYTE0                                                 00757000
TRMUDEF  EQU   TRMBYTE0                                                 00758000
TRMCOHRT EQU   IEDNTRM+4                                                00759000
TRMSTOTE EQU   TRMBYTE1                                                 00760000
TRMCKPRN EQU   TRMBYTE1                                                 00761000
TRMTSATN EQU   TRMBYTE1                                                 00762000
TRMTRACE EQU   TRMBYTE1                                                 00763000
TRMSWBCK EQU   TRMBYTE1                                                 00764000
TRMAUTOC EQU   TRMBYTE1                                                 00765000
TRMINPTP EQU   TRMBYTE1                                                 00766000
TRMWTNEG EQU   TRMSCPRQ                                                 00767000
TRMWRBRK EQU   TRMBYTE2                                                 00768000
TRMNOSND EQU   TRMBYTE2                                                 00769000
TRMPREP  EQU   TRMBYTE2                                                 00770000
TRMGPACT EQU   TRMBYTE2                                                 00771000
TRMANDL  EQU   TRMBYTE2                                                 00772000
TRMCLOSN EQU   TRMINPG                                                  00773000
TRMREMB  EQU   TRMBYTE2                                                 00774000
TRMRSACT EQU   TRMBYTE2                                                 00775000
TRMOPTBL EQU   IEDQTRM+18                                               00776000
TRMOPNO  EQU   IEDQTRM+17                                               00777000
TRMCHCIN EQU   IEDQTRM+16                                               00778000
TRMSENSE EQU   TRMSTAT+3                                                00779000
TRMTEMPR EQU   TRMSTAT+2                                                00780000
TRMSIO   EQU   TRMSTAT                                                  00781000
@NM00161 EQU   TRMDEVFL+1                                               00782000
TRMTPIN  EQU   TRMDEVFL+1                                               00783000
TRMNCPI  EQU   TRMDEVFL+1                                               00784000
TRMRNTRM EQU   TRMDEVFL+1                                               00785000
@NM00160 EQU   TRMDEVFL+1                                               00786000
TRMLMD   EQU   TRMDEVFL+1                                               00787000
TRMCONC  EQU   TRMDEVFL+1                                               00788000
TRMTSOB  EQU   TRMDEVFL                                                 00789000
TRMBFDY  EQU   TRMDEVFL                                                 00790000
TRMTBLK  EQU   TRMDEVFL                                                 00791000
TRMSBLK  EQU   TRMDEVFL                                                 00792000
TRMBLKS  EQU   TRMDEVFL                                                 00793000
TRMADDC  EQU   TRMDEVFL                                                 00794000
TRMDDIG  EQU   TRMDEVFL                                                 00795000
TRMBUFS  EQU   TRMDEVFL                                                 00796000
TRMPRILK EQU   TRMALTD                                                  00797000
TRMLGB   EQU   TRMDSORG                                                 00798000
TRMUTERM EQU   TLISTCNT                                                 00799000
TRMDESTQ EQU   IEDQTRM+1                                                00800000
TRMSCNYN EQU   TRMSTATE                                                 00801000
TRMOPTFN EQU   TRMSTATE                                                 00802000
TRMHELDN EQU   TRMSTATE                                                 00803000
TRMACPTN EQU   TRMSTATE                                                 00804000
TRMPROC  EQU   TRMLOG                                                   00805000
TRMLIST  EQU   TRMLOG                                                   00806000
TRMLINE  EQU   TRMSTATE                                                 00807000
TTHDCF   EQU   IEDTH+8                                                  00808000
TTHTAG2  EQU   TTHTAG+1                                                 00809000
@NM00159 EQU   TTHTAG1                                                  00810000
TTHTAGS  EQU   TTHTAG1                                                  00811000
TTHOAF   EQU   IEDTH+4                                                  00812000
TTHDAF   EQU   IEDTH+2                                                  00813000
TTHBYTE1 EQU   IEDTH+1                                                  00814000
TTHEFI   EQU   TTHBYTE0                                                 00815000
@NM00158 EQU   TTHBYTE0                                                 00816000
TTHEBIU  EQU   TTHBYTE0                                                 00817000
TTHBBIU  EQU   TTHBYTE0                                                 00818000
TTHFTYPE EQU   TTHBYTE0                                                 00819000
@NM00157 EQU   TRHBYTE2                                                 00820000
@NM00156 EQU   TRHBYTE2                                                 00821000
@NM00155 EQU   TRHBYTE2                                                 00822000
TRHCSI   EQU   TRHBYTE2                                                 00823000
@NM00154 EQU   TRHBYTE2                                                 00824000
TRHCDI   EQU   TRHBYTE2                                                 00825000
TRHEB    EQU   TRHBYTE2                                                 00826000
TRHBB    EQU   TRHBYTE2                                                 00827000
TRHPI    EQU   TRHBYTE1                                                 00828000
@NM00153 EQU   TRHBYTE1                                                 00829000
@NM00152 EQU   TRHBYTE1                                                 00830000
@NM00151 EQU   TRHBYTE1                                                 00831000
TRHER    EQU   TRHBYTE1                                                 00832000
TRHDR2   EQU   TRHBYTE1                                                 00833000
@NM00150 EQU   TRHBYTE1                                                 00834000
TRHDR1   EQU   TRHBYTE1                                                 00835000
TRHEC    EQU   TRHBYTE0                                                 00836000
TRHBC    EQU   TRHBYTE0                                                 00837000
TRHSDI   EQU   TRHBYTE0                                                 00838000
TRHFI    EQU   TRHBYTE0                                                 00839000
@NM00149 EQU   TRHBYTE0                                                 00840000
TRHRUCAT EQU   TRHBYTE0                                                 00841000
TRHTYPE  EQU   TRHBYTE0                                                 00842000
@NM00148 EQU   IEDPRUND+4                                               00843000
PRUTHEFI EQU   PRUFIDN                                                  00844000
PRUTHUSS EQU   PRUFIDN                                                  00845000
PRUTHEIU EQU   PRUFIDN                                                  00846000
PRUTHBIU EQU   PRUFIDN                                                  00847000
PRUTHTYE EQU   PRUFIDN                                                  00848000
@NM00147 EQU   PRURHFG2                                                 00849000
PRURHCSI EQU   PRURHFG2                                                 00850000
@NM00146 EQU   PRURHFG2                                                 00851000
PRURHCDI EQU   PRURHFG2                                                 00852000
PRURHEB  EQU   PRURHFG2                                                 00853000
PRURHBB  EQU   PRURHFG2                                                 00854000
PRURHPI  EQU   PRURHFG1                                                 00855000
@NM00145 EQU   PRURHFG1                                                 00856000
PRURHER  EQU   PRURHFG1                                                 00857000
PRURHDR2 EQU   PRURHFG1                                                 00858000
@NM00144 EQU   PRURHFG1                                                 00859000
PRURHDR1 EQU   PRURHFG1                                                 00860000
PRURHEC  EQU   PRURHFG0                                                 00861000
PRURHBC  EQU   PRURHFG0                                                 00862000
PRURHSDI EQU   PRURHFG0                                                 00863000
PRURHFI  EQU   PRURHFG0                                                 00864000
@NM00143 EQU   PRURHFG0                                                 00865000
PRURUCAT EQU   PRURHFG0                                                 00866000
PRURHTYP EQU   PRURHFG0                                                 00867000
PRUNUNIT EQU   PRUTIC+1                                                 00868000
@NM00142 EQU   PRUTIC                                                   00869000
@NM00141 EQU   IEDPRUQD+4                                               00870000
PRF2SEQP EQU   PRF2WD2                                                  00871000
@NM00140 EQU   IEDPF2+1                                                 00872000
@NM00139 EQU   PRF2FLG2                                                 00873000
PRF2SMI  EQU   PRF2FLG2                                                 00874000
PRF2FORM EQU   PRF2FLG2                                                 00875000
PRF2TNTI EQU   PRF2FLG2                                                 00876000
PRF1RULN EQU   PRF1SEQP+2                                               00877000
PRF1TAG2 EQU   PRF1SQID+1                                               00878000
@NM00138 EQU   PRF1TAG1                                                 00879000
PRF1TAGS EQU   PRF1TAG1                                                 00880000
@NM00137 EQU   PRF1FLG1                                                 00881000
PRF1LOGD EQU   PRF1FLG1                                                 00882000
PRF1USS  EQU   PRF1FLG1                                                 00883000
PRF1FORM EQU   PRF1FLG1                                                 00884000
PRF1EXPI EQU   PRF1FLG1                                                 00885000
PRF1FIDI EQU   PRF1FLG1                                                 00886000
PRF1RH   EQU   IEDPF1                                                   00887000
PRFDEST  EQU   IEDQPRF+40                                               00888000
PRFISEQ  EQU   IEDQPRF+38                                               00889000
PRFSTXT  EQU   PRFHQBCK                                                 00890000
PRFNHDR  EQU   PRFCHDR                                                  00891000
PRFCRCD  EQU   IEDQPRF+29                                               00892000
PRFSVSEQ EQU   PRFNTXT+1                                                00893000
PRFSVPRI EQU   PRFEOBOF                                                 00894000
PRFISIZE EQU   PRFSCAN+1                                                00895000
@NM00136 EQU   PRFSCAN                                                  00896000
PRFEOB   EQU   PRFXTRA+1                                                00897000
PRFSTSO  EQU   PRFXTRA                                                  00898000
PRFNHDRN EQU   PRFSTAT1                                                 00899000
PRFNLSTN EQU   PRFSTAT1                                                 00900000
PRFLOCK  EQU   PRFEOFN                                                  00901000
PRFDUPLN EQU   PRFSTAT1                                                 00902000
PRFTSMSG EQU   PRFSTAT1                                                 00903000
PRFITCPN EQU   PRFSTAT1                                                 00904000
PRFERMGN EQU   PRFSTAT1                                                 00905000
PRFCNCLN EQU   PRFSTAT1                                                 00906000
PRFSVFLG EQU   @NM00135+3                                               00907000
PRFSIZE  EQU   PRFSVFFO+2                                               00908000
PRFSRCE  EQU   PRFSVFFO                                                 00909000
PRFLCB   EQU   IEDQPRF+13                                               00910000
PRFPIUO  EQU   PRFPLQCB                                                 00911000
PRFTI0   EQU   PRFTIC+1                                                 00912000
@NM00134 EQU   PRFTICC                                                  00913000
@NM00133 EQU   PRFTICC                                                  00914000
@NM00132 EQU   PRFTICC                                                  00915000
PRFTICON EQU   PRFTICC                                                  00916000
@NM00131 EQU   PRFTICC                                                  00917000
@NM00130 EQU   PRFTICC                                                  00918000
PRFBFMM  EQU   PRFTICC                                                  00919000
PRFEOMSG EQU   PRFTICC                                                  00920000
PRFCOUNT EQU   PRFLINK+1                                                00921000
@NM00129 EQU   PRFLINK                                                  00922000
PRFFLAGS EQU   PRFPRI                                                   00923000
PRFIOADR EQU   PRFQCBA                                                  00924000
PRFOPCDE EQU   PRFKEY                                                   00925000
@NM00128 EQU   OCLDNME+4                                                00926000
@NM00127 EQU   OCPREFLG                                                 00927000
OCTOTEP  EQU   OCPREFLG                                                 00928000
OCREPOST EQU   OCPREFLG                                                 00929000
OCRSPSNT EQU   OCPREFLG                                                 00930000
OCBFREQ  EQU   OCPREFLG                                                 00931000
OCIDLE   EQU   OCREQFLG                                                 00932000
OCFORCE  EQU   OCREQFLG                                                 00933000
OCDCARD  EQU   OCREQFLG                                                 00934000
OCPARTAL EQU   OCREQFLG                                                 00935000
OCADNCP  EQU   OCREQFLG                                                 00936000
@NM00126 EQU   OCREQFLG                                                 00937000
@NM00125 EQU   OCREQFLG                                                 00938000
OCFLUSHZ EQU   OCREQFLG                                                 00939000
OCRESPCT EQU   OCLINTTE                                                 00940000
OCCKPTWA EQU   OCCKDATA+4                                               00941000
@NM00122 EQU   OCRSTGTM+2                                               00942000
OCCKDAT2 EQU   OCRSTGTM+1                                               00943000
OCPTRSAV EQU   OCMODNME+4                                               00944000
OCPUADR  EQU   OCIPLWA+2                                                00945000
OCWTGSAV EQU   OCIPLWA                                                  00946000
OCDVRDCT EQU   OCBACKUP+6                                               00947000
OCNCP    EQU   OCBACKUP+4                                               00948000
OCBUFGOT EQU   OCBACKUP+2                                               00949000
OCBUFNED EQU   OCBACKUP                                                 00950000
OCRESNUM EQU   OCPARM                                                   00951000
OCSEQ    EQU   OCTRUNIT+2                                               00952000
@NM00121 EQU   OCRSID+1                                                 00953000
OCNONE   EQU   OCALSTAT                                                 00954000
OCSOME   EQU   OCALSTAT                                                 00955000
OCALLFLG EQU   OCALSTAT                                                 00956000
OCACTREQ EQU   OCALSTAT                                                 00957000
OCREDRVE EQU   OCALSTAT                                                 00958000
OCSEQIND EQU   OCALSTAT                                                 00959000
@NM00120 EQU   OCALSTAT                                                 00960000
OCRENTRD EQU   OCALSTAT                                                 00961000
OCWTGB   EQU   OCTIOT                                                   00962000
@NM00119 EQU   @NM00118+2                                               00963000
OCCONID  EQU   OCDEST                                                   00964000
OCATTACH EQU   OCFLAG                                                   00965000
OCSSCP   EQU   OCFLAG                                                   00966000
OCOUTPUT EQU   OCFLAG                                                   00967000
OCLINE   EQU   OCFLAG                                                   00968000
OCMPP    EQU   OCFLAG                                                   00969000
OCTOTE   EQU   OCFLAG                                                   00970000
OCCONSOL EQU   OCFLAG                                                   00971000
@NM00117 EQU   OCSWITCH                                                 00972000
OCQUCKN  EQU   OCSWITCH                                                 00973000
OCPRIFLG EQU   OCOPTCDE                                                 00974000
@NM00116 EQU   OCRUDEST+1                                               00975000
@NM00115 EQU   OCSCAN                                                   00976000
OCNOTUCB EQU   OCSCAN                                                   00977000
OCNONAME EQU   OCSCAN                                                   00978000
OCALLRLN EQU   OCSCAN                                                   00979000
OCDDNAME EQU   OCSCAN                                                   00980000
OCDDNRLN EQU   OCSCAN                                                   00981000
OCADDR   EQU   OCSCAN                                                   00982000
OCELMPTR EQU   OCELEM+1                                                 00983000
OCELMPRI EQU   OCELEM                                                   00984000
OCLINK   EQU   IEDQOPCE                                                 00985000
OPCBOTTM EQU   IEDQOPCD+1172                                            00986000
@NM00114 EQU   IEDQOPCD+1088                                            00987000
@NM00113 EQU   IEDQOPCD+936                                             00988000
@NM00112 EQU   IEDQOPCD+928                                             00989000
@NM00111 EQU   IEDQOPCD+368                                             00990000
OPCWAITV EQU   IEDQOPCD+364                                             00991000
OPCTOTCK EQU   IEDQOPCD+360                                             00992000
OPCAPXTL EQU   IEDQOPCD+356                                             00993000
OPCDECR  EQU   IEDQOPCD+352                                             00994000
OPCBUFWT EQU   IEDQOPCD+348                                             00995000
OPCWRKSP EQU   IEDQOPCD+320                                             00996000
OPCADGOT EQU   IEDQOPCD+318                                             00997000
OPCRQCNT EQU   IEDQOPCD+316                                             00998000
OPPOLSTP EQU   IEDQOPCD+312                                             00999000
OPCCKCIB EQU   IEDQOPCD+308                                             01000000
OPCEND   EQU   IEDQOPCD+307                                             01001000
OPCSTCBS EQU   IEDQOPCD+306                                             01002000
OPCHNEND EQU   IEDQOPCD+302                                             01003000
OPCOQSW  EQU   IEDQOPCD+301                                             01004000
@NM00110 EQU   OPCSPEC                                                  01005000
@NM00109 EQU   OPCSPEC                                                  01006000
@NM00108 EQU   OPCSPEC                                                  01007000
@NM00107 EQU   OPCSPEC                                                  01008000
OPCFRMCA EQU   OPCSPEC                                                  01009000
OPCRSTRT EQU   OPCSPEC                                                  01010000
OPCPART  EQU   OPCSPEC                                                  01011000
OPCALTD  EQU   OPCSPEC                                                  01012000
OPCBFEND EQU   IEDQOPCD+296                                             01013000
OPCBFIRS EQU   IEDQOPCD+292                                             01014000
OPCAVBUF EQU   IEDQOPCD+290                                             01015000
@NM00106 EQU   IEDQOPCD+289                                             01016000
OPCCLNTS EQU   IEDQOPCD+288                                             01017000
OPCHA8   EQU   IEDQOPCD+286                                             01018000
OPCBFREQ EQU   IEDQOPCD+284                                             01019000
OPCFREBF EQU   IEDQOPCD+280                                             01020000
OPCNEXT  EQU   IEDQOPCD+272                                             01021000
OPCFMDFC EQU   IEDQOPCD+268                                             01022000
OPCSCNC  EQU   IEDQOPCD+264                                             01023000
OPCHORTG EQU   IEDQOPCD+260                                             01024000
OPCHORT  EQU   IEDQOPCD+256                                             01025000
OPCCKPTL EQU   IEDQOPCD+252                                             01026000
OPCCKPTF EQU   IEDQOPCD+248                                             01027000
OPCWAITA EQU   IEDQOPCD+244                                             01028000
OPCWAITR EQU   IEDQOPCD+240                                             01029000
OPCWAITP EQU   IEDQOPCD+236                                             01030000
OPCWAITO EQU   IEDQOPCD+232                                             01031000
OPCWAITN EQU   IEDQOPCD+228                                             01032000
OPCWAITL EQU   IEDQOPCD+224                                             01033000
OPCWAITC EQU   IEDQOPCD+220                                             01034000
@NM00105 EQU   OPCLDNME+5                                               01035000
@NM00104 EQU   OPCLDNME                                                 01036000
OPCWAIT  EQU   IEDQOPCD+192                                             01037000
OPCCKERB EQU   IEDQOPCD+164                                             01038000
OPCBFERB EQU   IEDQOPCD+148                                             01039000
OPCFLAG2 EQU   IEDQOPCD+147                                             01040000
OPCFLAG1 EQU   IEDQOPCD+146                                             01041000
OPCWRKSZ EQU   IEDQOPCD+144                                             01042000
OPCWORK  EQU   IEDQOPCD+140                                             01043000
OPCRSAVE EQU   IEDQOPCD+132                                             01044000
OPCQCBAD EQU   IEDQOPCD+128                                             01045000
OPCTRMWA EQU   IEDQOPCD+52                                              01046000
OPCPSTWT EQU   IEDQOPCD+48                                              01047000
OPCTNTEA EQU   IEDQOPCD+44                                              01048000
OPCPGCK  EQU   IEDQOPCD+40                                              01049000
OPCLCB   EQU   IEDQOPCD+36                                              01050000
@NM00103 EQU   IEDQOPCD+32                                              01051000
OPCIPLAD EQU   IEDQOPCD+28                                              01052000
OPCTOFLK EQU   IEDQOPCD+24                                              01053000
OPCOPTLK EQU   IEDQOPCD+20                                              01054000
BDUXGRPH EQU   BDUEXRSP                                                 01055000
BDUXFINL EQU   BDUEXRSP                                                 01056000
BDUXINIT EQU   BDUEXRSP                                                 01057000
BDURESP  EQU   BDUSYRSP                                                 01058000
BDUPHASE EQU   BDUSYRSP                                                 01059000
BDUERROR EQU   BDUSYRSP                                                 01060000
BDUXERLK EQU   BDUBDUFG                                                 01061000
BDUALTAK EQU   BDUFNFLG                                                 01062000
BDUNEGAK EQU   BDUFNFLG                                                 01063000
BDUPOSAK EQU   BDUFNFLG                                                 01064000
BDUTPTX  EQU   BDUFNFLG                                                 01065000
BDUFRSTB EQU   BDUFNFLG                                                 01066000
BDULEADG EQU   BDUFNFLG                                                 01067000
BDUHEADR EQU   BDUFNFLG                                                 01068000
BDUSTHDR EQU   BDUFNFLG                                                 01069000
BDUMODIF EQU   IEDBDU+1                                                 01070000
BDUCMND  EQU   IEDBDU                                                   01071000
SAVTBITN EQU   IEDNSVTD+312                                             01072000
@NM00102 EQU   SAVTCKQB+8                                               01073000
@NM00101 EQU   SAVTCKEC+1                                               01074000
@NM00100 EQU   SAVTCKCC                                                 01075000
SAVTCKPO EQU   SAVTCKCC                                                 01076000
SAVTCKWA EQU   SAVTCKCC                                                 01077000
SAVTCKCH EQU   SAVTCKTB+1                                               01078000
SAVTCKVT EQU   SAVTCKTB                                                 01079000
@NM00099 EQU   IEDNSVTD+297                                             01080000
SAVTRDFG EQU   SAVTRDRV+12                                              01081000
@NM00098 EQU   SAVTRDRV+5                                               01082000
SAVTRDPY EQU   SAVTRDRV+4                                               01083000
SAVTRDQB EQU   SAVTRDRV+1                                               01084000
SAVTRDKY EQU   SAVTRDRV                                                 01085000
SAVTNID  EQU   IEDNSVTD+280                                             01086000
SAVTDVAS EQU   IEDNSVTD+276                                             01087000
SAVTPLSZ EQU   IEDNSVTD+274                                             01088000
@NM00097 EQU   IEDNSVTD+273                                             01089000
SAVTSUBL EQU   IEDNSVTD+272                                             01090000
@NM00096 EQU   SAVTZELM+1                                               01091000
SAVTSUBM EQU   SAVTZELM                                                 01092000
SAVTMHDX EQU   IEDNSVTD+268                                             01093000
SAVTNAT1 EQU   IEDNSVTD+266                                             01094000
SAVTSH20 EQU   IEDNSVTD+264                                             01095000
SAVTLCBS EQU   IEDNSVTD+260                                             01096000
SAVTRNMP EQU   IEDNSVTD+256                                             01097000
SAVTTNTX EQU   IEDNSVTD+252                                             01098000
SAVTNAX  EQU   IEDNSVTD+248                                             01099000
SAVTSUBV EQU   IEDNSVTD+247                                             01100000
SAVTSUBA EQU   IEDNSVTD+246                                             01101000
SAVTSIBC EQU   IEDNSVTD+244                                             01102000
SAVTBSM  EQU   IEDNSVTD+240                                             01103000
SAVTSCPT EQU   SAVTTCPU                                                 01104000
SAVTRQTG EQU   IEDNSVTD+236                                             01105000
SAVTRQCH EQU   IEDNSVTD+232                                             01106000
SAVTMAND EQU   IEDNSVTD+228                                             01107000
SAVTSPLN EQU   IEDNSVTD+224                                             01108000
SAVTNADL EQU   IEDNSVTD+222                                             01109000
SAVTNATL EQU   IEDNSVTD+220                                             01110000
SAVTMHTB EQU   IEDNSVTD+216                                             01111000
SAVTSSMH EQU   IEDNSVTD+212                                             01112000
SAVTQRS  EQU   IEDNSVTD+208                                             01113000
SAVTRQIN EQU   IEDNSVTD+204                                             01114000
SAVTDFCO EQU   IEDNSVTD+200                                             01115000
SAVTSAO  EQU   IEDNSVTD+196                                             01116000
SAVTSARI EQU   IEDNSVTD+192                                             01117000
SAVTSAC  EQU   IEDNSVTD+188                                             01118000
SAVTSAI  EQU   IEDNSVTD+184                                             01119000
SAVTCSCI EQU   IEDNSVTD+180                                             01120000
SAVTSSRP EQU   IEDNSVTD+176                                             01121000
SAVTSSRQ EQU   IEDNSVTD+172                                             01122000
SAVTSCLU EQU   IEDNSVTD+168                                             01123000
SAVTXTRQ EQU   IEDNSVTD+164                                             01124000
SAVTMVBF EQU   IEDNSVTD+160                                             01125000
@NM00095 EQU   IEDNSVTD+148                                             01126000
SAVTIPCQ EQU   IEDNSVTD+144                                             01127000
@NM00094 EQU   IEDNSVTD+136                                             01128000
SAVTXFMI EQU   IEDNSVTD+132                                             01129000
@NM00093 EQU   IEDNSVTD+124                                             01130000
SAVTXFMO EQU   IEDNSVTD+120                                             01131000
@NM00092 EQU   IEDNSVTD+116                                             01132000
SAVTSSSR EQU   IEDNSVTD+112                                             01133000
SAVTSCPQ EQU   IEDNSVTD+108                                             01134000
SAVTSLCB EQU   IEDNSVTD+104                                             01135000
SAVTLUSR EQU   IEDNSVTD+100                                             01136000
@NM00091 EQU   SAVTLUSQ+8                                               01137000
SAVTLUSP EQU   SAVTLUSQ+4                                               01138000
SAVTLUSB EQU   SAVTLUSQ                                                 01139000
@NM00090 EQU   IEDNSVTD+84                                              01140000
SAVTSAT  EQU   IEDNSVTD+80                                              01141000
SAVTNAT  EQU   IEDNSVTD+76                                              01142000
SAVTCLUP EQU   IEDNSVTD+72                                              01143000
SAVTPIUT EQU   IEDNSVTD+68                                              01144000
SAVTRNTA EQU   IEDNSVTD+64                                              01145000
SAVTDNIR EQU   IEDNSVTD+60                                              01146000
SAVTCNIR EQU   IEDNSVTD+56                                              01147000
SAVTFLDH EQU   IEDNSVTD+52                                              01148000
SAVTSRTN EQU   IEDNSVTD+48                                              01149000
SAVTSREQ EQU   IEDNSVTD+44                                              01150000
SAVTFAIL EQU   IEDNSVTD+42                                              01151000
SAVTSUSE EQU   IEDNSVTD+40                                              01152000
SAVTSIB  EQU   IEDNSVTD+36                                              01153000
SAVTPRTN EQU   IEDNSVTD+32                                              01154000
@NM00089 EQU   IEDNSVTD+28                                              01155000
SAVTWH20 EQU   IEDNSVTD+26                                              01156000
SAVTPWT  EQU   IEDNSVTD+24                                              01157000
SAVTPRTQ EQU   IEDNSVTD+20                                              01158000
SAVTPREQ EQU   IEDNSVTD+16                                              01159000
SAVTPH20 EQU   IEDNSVTD+14                                              01160000
SAVTPUSE EQU   IEDNSVTD+12                                              01161000
SAVTPLCB EQU   IEDNSVTD+8                                               01162000
SAVTPOOL EQU   IEDNSVTD+4                                               01163000
SAVTPRMT EQU   SAVTDIAF                                                 01164000
SAVTVIRT EQU   SAVTDIAF                                                 01165000
AVTCPBNO EQU   IEDQAVTD+1244                                            01166000
AVTHRESS EQU   IEDQAVTD+1243                                            01167000
@NM00088 EQU   IEDQAVTD+1242                                            01168000
@NM00087 EQU   IEDQAVTD+1241                                            01169000
@NM00086 EQU   IEDQAVTD+1240                                            01170000
@NM00085 EQU   IEDQAVTD+1237                                            01171000
@NM00084 EQU   IEDQAVTD+1236                                            01172000
AVTHRESE EQU   @NM00083                                                 01173000
AVTRADDR EQU   IEDQAVTD+1228                                            01174000
AVTNADDR EQU   IEDQAVTD+1224                                            01175000
AVTHRESN EQU   IEDQAVTD+1220                                            01176000
AVTVOLRN EQU   IEDQAVTD+1216                                            01177000
AVTTOTNN EQU   IEDQAVTD+1212                                            01178000
AVTTRCYN EQU   IEDQAVTD+1208                                            01179000
AVTRCTRN EQU   IEDQAVTD+1204                                            01180000
AVTNOVON EQU   IEDQAVTD+1200                                            01181000
AVTADEBN EQU   IEDQAVTD+1196                                            01182000
AVTVOLRR EQU   IEDQAVTD+1192                                            01183000
AVTTOTNR EQU   IEDQAVTD+1188                                            01184000
AVTTRCYR EQU   IEDQAVTD+1184                                            01185000
AVTRCTRR EQU   IEDQAVTD+1180                                            01186000
AVTNOVOR EQU   IEDQAVTD+1176                                            01187000
AVTADEBR EQU   IEDQAVTD+1172                                            01188000
AVTLODPT EQU   IEDQAVTD+1168                                            01189000
AVTIOBN  EQU   IEDQAVTD+1164                                            01190000
AVTIOBR  EQU   IEDQAVTD+1160                                            01191000
AVTCPBPT EQU   IEDQAVTD+1156                                            01192000
AVTFCPB  EQU   IEDQAVTD+1152                                            01193000
@NM00082 EQU   IEDQAVTD+1148                                            01194000
AVTINCPQ EQU   IEDQAVTD+1144                                            01195000
@NM00081 EQU   IEDQAVTD+1140                                            01196000
@NM00080 EQU   IEDQAVTD+1137                                            01197000
@NM00079 EQU   AVTBIT4                                                  01198000
@NM00078 EQU   AVTBIT4                                                  01199000
@NM00077 EQU   AVTBIT4                                                  01200000
@NM00076 EQU   AVTBIT4                                                  01201000
@NM00075 EQU   AVTBIT4                                                  01202000
@NM00074 EQU   AVTBIT4                                                  01203000
@NM00073 EQU   AVTBIT4                                                  01204000
AVTRUFTN EQU   AVTBIT4                                                  01205000
@NM00072 EQU   IEDQAVTD+1132                                            01206000
AVTNOBFQ EQU   IEDQAVTD+1128                                            01207000
@NM00071 EQU   IEDQAVTD+1124                                            01208000
AVTDKENQ EQU   IEDQAVTD+1120                                            01209000
@NM00070 EQU   IEDQAVTD+1116                                            01210000
AVTDKAPQ EQU   IEDQAVTD+1112                                            01211000
AVTCOPY  EQU   IEDQAVTD+1108                                            01212000
AVTIA    EQU   IEDQAVTD+1104                                            01213000
AVTFL    EQU   IEDQAVTD+1100                                            01214000
@NM00069 EQU   IEDQAVTD+1096                                            01215000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01216000
AVTTOTNC EQU   IEDQAVTD+1088                                            01217000
AVTCMAX  EQU   IEDQAVTD+1084                                            01218000
AVTCMIN  EQU   IEDQAVTD+1080                                            01219000
AVTHM02  EQU   IEDQAVTD+1076                                            01220000
AVTOPCIN EQU   IEDQAVTD+1074                                            01221000
AVTDCTLN EQU   IEDQAVTD+1072                                            01222000
AVTOPMSK EQU   IEDQAVTD+1068                                            01223000
AVTDDFT  EQU   IEDQAVTD+1064                                            01224000
AVTSTEAL EQU   IEDQAVTD+1060                                            01225000
AVTOPTN  EQU   IEDQAVTD+1056                                            01226000
AVTDSKCT EQU   IEDQAVTD+1054                                            01227000
AVTCKRST EQU   IEDQAVTD+1053                                            01228000
AVTSTAN  EQU   AVTBIT3                                                  01229000
AVTSTACN EQU   AVTBIT3                                                  01230000
AVTSTAIN EQU   AVTBIT3                                                  01231000
AVTSTAYN EQU   AVTBIT3                                                  01232000
AVTOLTBN EQU   AVTBIT3                                                  01233000
AVTTSAB  EQU   AVTBIT3                                                  01234000
AVTRFULN EQU   AVTBIT3                                                  01235000
AVTRECVN EQU   AVTBIT3                                                  01236000
@NM00068 EQU   AVTBIT2                                                  01237000
@NM00067 EQU   AVTBIT2                                                  01238000
AVTOPEIN EQU   AVTBIT2                                                  01239000
AVTSTRTN EQU   AVTBIT2                                                  01240000
AVTTOPOL EQU   AVTBIT2                                                  01241000
AVTCOPYN EQU   AVTBIT2                                                  01242000
AVTREUSN EQU   AVTBIT2                                                  01243000
AVTEXTSC EQU   AVTBIT2                                                  01244000
AVTDISKN EQU   AVTBIT1                                                  01245000
AVTQUCKN EQU   AVTBIT1                                                  01246000
AVTCLOSN EQU   AVTBIT1                                                  01247000
AVTREADN EQU   AVTBIT1                                                  01248000
AVTDLAYN EQU   AVTBIT1                                                  01249000
AVTAQTAN EQU   AVTBIT1                                                  01250000
AVTTSON  EQU   AVTBIT1                                                  01251000
AVTAPLKN EQU   AVTBIT1                                                  01252000
AVTDUMBR EQU   IEDQAVTD+1048                                            01253000
AVTDLQX  EQU   IEDQAVTD+1046                                            01254000
AVTINTLV EQU   IEDQAVTD+1044                                            01255000
AVTSMCNT EQU   IEDQAVTD+1042                                            01256000
AVTAVFCT EQU   IEDQAVTD+1040                                            01257000
AVTOPCON EQU   IEDQAVTD+1038                                            01258000
AVTOPCNT EQU   IEDQAVTD+1036                                            01259000
AVTLNCNT EQU   IEDQAVTD+1034                                            01260000
AVTKEYLE EQU   IEDQAVTD+1032                                            01261000
AVTHA16  EQU   IEDQAVTD+1030                                            01262000
AVTHA7   EQU   IEDQAVTD+1028                                            01263000
AVTHA4   EQU   IEDQAVTD+1026                                            01264000
AVTHA2   EQU   IEDQAVTD+1022                                            01265000
AVTGETMS EQU   IEDQAVTD+1021                                            01266000
@NM00066 EQU   IEDQAVTD+1020                                            01267000
AVTGETMD EQU   IEDQAVTD+1016                                            01268000
AVTGETMN EQU   IEDQAVTD+1012                                            01269000
AVTCWTOT EQU   IEDQAVTD+1008                                            01270000
AVTCWINT EQU   IEDQAVTD+956                                             01271000
AVTDTRAP EQU   IEDQAVTD+952                                             01272000
@NM00065 EQU   IEDQAVTD+950                                             01273000
@NM00064 EQU   AVTIOTR                                                  01274000
AVTIOTRH EQU   AVTIOTR                                                  01275000
AVTIOTRE EQU   AVTIOTR                                                  01276000
@NM00063 EQU   AVTSUBT                                                  01277000
AVTSUBPT EQU   AVTSUBT                                                  01278000
AVTSUBON EQU   AVTSUBT                                                  01279000
AVTAFE30 EQU   IEDQAVTD+944                                             01280000
AVTAFE20 EQU   IEDQAVTD+940                                             01281000
AVTAFE10 EQU   IEDQAVTD+936                                             01282000
AVTCWEC2 EQU   IEDQAVTD+932                                             01283000
AVTCWPM2 EQU   IEDQAVTD+928                                             01284000
AVTCWTS2 EQU   IEDQAVTD+927                                             01285000
AVTCWTS1 EQU   IEDQAVTD+926                                             01286000
AVTCWCLD EQU   AVTCWFL2                                                 01287000
AVTCWRAP EQU   AVTCWFL2                                                 01288000
@NM00062 EQU   AVTCWFL2                                                 01289000
@NM00061 EQU   AVTCWFL2                                                 01290000
@NM00060 EQU   AVTCWFL2                                                 01291000
@NM00059 EQU   AVTCWFL2                                                 01292000
@NM00058 EQU   AVTCWFL2                                                 01293000
AVTCWACT EQU   AVTCWFL2                                                 01294000
@NM00057 EQU   AVTCWFL1                                                 01295000
@NM00056 EQU   AVTCWFL1                                                 01296000
@NM00055 EQU   AVTCWFL1                                                 01297000
@NM00054 EQU   AVTCWFL1                                                 01298000
@NM00053 EQU   AVTCWFL1                                                 01299000
@NM00052 EQU   AVTCWFL1                                                 01300000
@NM00051 EQU   AVTCWFL1                                                 01301000
AVTCOMWN EQU   AVTCWFL1                                                 01302000
AVTCWEC1 EQU   IEDQAVTD+920                                             01303000
AVTCWPM1 EQU   IEDQAVTD+916                                             01304000
AVTCAREA EQU   IEDQAVTD+912                                             01305000
AVTFZERO EQU   IEDQAVTD+908                                             01306000
AVTCADDR EQU   IEDQAVTD+904                                             01307000
AVTCOREC EQU   IEDQAVTD+900                                             01308000
@NM00050 EQU   IEDQAVTD+892                                             01309000
AVTCPBCB EQU   IEDQAVTD+888                                             01310000
@NM00049 EQU   IEDQAVTD+880                                             01311000
AVTDSIOB EQU   IEDQAVTD+876                                             01312000
@NM00048 EQU   IEDQAVTD+868                                             01313000
AVTCPRMB EQU   IEDQAVTD+864                                             01314000
@NM00047 EQU   IEDQAVTD+856                                             01315000
AVTCLOSB EQU   IEDQAVTD+852                                             01316000
@NM00046 EQU   IEDQAVTD+844                                             01317000
AVTACTIB EQU   IEDQAVTD+840                                             01318000
@NM00045 EQU   IEDQAVTD+836                                             01319000
AVTOLTEB EQU   IEDQAVTD+832                                             01320000
AVTOLTCH EQU   AVTOLTQB+1                                               01321000
AVTOLTVT EQU   AVTOLTQB                                                 01322000
@NM00044 EQU   AVTOPCQB+8                                               01323000
@NM00043 EQU   AVTOPCEC+1                                               01324000
@NM00042 EQU   AVTOPCCC                                                 01325000
AVTOPCPO EQU   AVTOPCCC                                                 01326000
AVTOPCWA EQU   AVTOPCCC                                                 01327000
AVTOPCCH EQU   AVTOPCOB+1                                               01328000
AVTOPCVT EQU   AVTOPCOB                                                 01329000
@NM00041 EQU   AVTCKPQB+9                                               01330000
AVTCKPTS EQU   AVTCKPQB+8                                               01331000
@NM00040 EQU   AVTCKPEC+1                                               01332000
@NM00039 EQU   AVTCKPCC                                                 01333000
AVTCKPPO EQU   AVTCKPCC                                                 01334000
AVTCKPWA EQU   AVTCKPCC                                                 01335000
AVTCKPCH EQU   AVTCKPTB+1                                               01336000
AVTCKPVT EQU   AVTCKPTB                                                 01337000
@NM00038 EQU   IEDQAVTD+796                                             01338000
AVTBFRTB EQU   IEDQAVTD+792                                             01339000
@NM00037 EQU   IEDQAVTD+784                                             01340000
AVTBFREB EQU   IEDQAVTD+780                                             01341000
AVTTIMQ  EQU   IEDQAVTD+776                                             01342000
@NM00036 EQU   IEDQAVTD+772                                             01343000
AVTIMQPS EQU   IEDQAVTD+768                                             01344000
AVTINOUT EQU   IEDQAVTD+766                                             01345000
AVTREFTM EQU   IEDQAVTD+764                                             01346000
@NM00035 EQU   IEDQAVTD+752                                             01347000
AVTDELYB EQU   IEDQAVTD+748                                             01348000
AVTOCQPT EQU   IEDQAVTD+744                                             01349000
AVTTSOPT EQU   IEDQAVTD+740                                             01350000
AVTSUPPT EQU   IEDQAVTD+736                                             01351000
AVTCBQCB EQU   IEDQAVTD+732                                             01352000
AVTMSGS  EQU   IEDQAVTD+729                                             01353000
@NM00034 EQU   AVTSYSER                                                 01354000
@NM00033 EQU   AVTSYSER                                                 01355000
@NM00032 EQU   AVTSYSER                                                 01356000
@NM00031 EQU   AVTSYSER                                                 01357000
@NM00030 EQU   AVTSYSER                                                 01358000
@NM00029 EQU   AVTSYSER                                                 01359000
AVTCMAXN EQU   AVTSYSER                                                 01360000
AVTCMINN EQU   AVTSYSER                                                 01361000
AVT2260L EQU   IEDQAVTD+724                                             01362000
AVTABEPL EQU   AVTADBUF                                                 01363000
AVTHFF   EQU   AVTCLRHI+2                                               01364000
@NM00028 EQU   AVTCLRHI                                                 01365000
AVTCCLNK EQU   AVTCRELE+5                                               01366000
AVTCCPRI EQU   AVTCRELE+4                                               01367000
AVTCCQCB EQU   AVTCCELE+1                                               01368000
AVTCCKEY EQU   AVTCCELE                                                 01369000
AVTDELAD EQU   IEDQAVTD+704                                             01370000
AVTDELEM EQU   IEDQAVTD+700                                             01371000
AVTBSX   EQU   AVTCKLNK                                                 01372000
AVTOPETR EQU   AVTHG01                                                  01373000
@NM00027 EQU   AVTCKBYT                                                 01374000
AVTCKONQ EQU   AVTCKBYT                                                 01375000
@NM00026 EQU   AVTCKBYT                                                 01376000
@NM00025 EQU   AVTCKBYT                                                 01377000
@NM00024 EQU   AVTCKBYT                                                 01378000
@NM00023 EQU   AVTCKBYT                                                 01379000
@NM00022 EQU   AVTCKBYT                                                 01380000
@NM00021 EQU   AVTCKBYT                                                 01381000
AVTOPERT EQU   IEDQAVTD+690                                             01382000
AVTOPXCL EQU   IEDQAVTD+688                                             01383000
AVTOPERL EQU   IEDQAVTD+687                                             01384000
@NM00020 EQU   IEDQAVTD+686                                             01385000
AVTCKTIM EQU   IEDQAVTD+684                                             01386000
AVTCKELV EQU   IEDQAVTD+682                                             01387000
AVTCPRCD EQU   IEDQAVTD+681                                             01388000
AVTWARMN EQU   AVTCKELF                                                 01389000
AVTCRTLN EQU   AVTCKELF                                                 01390000
AVTCPIPN EQU   AVTCKELF                                                 01391000
AVTCCLCN EQU   AVTCKELF                                                 01392000
AVTCINCN EQU   AVTCKELF                                                 01393000
@NM00019 EQU   AVTCKELF                                                 01394000
AVTCMCPN EQU   AVTCKELF                                                 01395000
AVTCRDYN EQU   AVTCKELF                                                 01396000
AVTCKQAD EQU   IEDQAVTD+677                                             01397000
AVTSCBSZ EQU   IEDQAVTD+676                                             01398000
@NM00018 EQU   IEDQAVTD+672                                             01399000
AVTCKELE EQU   IEDQAVTD+668                                             01400000
@NM00017 EQU   AVTCKPEL+8                                               01401000
AVTCKRLK EQU   AVTCKPEL+5                                               01402000
AVTCKRPR EQU   AVTCKPEL+4                                               01403000
AVTCKRMQ EQU   AVTCKRMV+1                                               01404000
AVTCKRKY EQU   AVTCKRMV                                                 01405000
AVTHK    EQU   IEDQAVTD+648                                             01406000
AVTHI    EQU   IEDQAVTD+644                                             01407000
AVTIOT   EQU   IEDQAVTD+640                                             01408000
AVTNX    EQU   IEDQAVTD+636                                             01409000
AVTTONE  EQU   IEDQAVTD+632                                             01410000
AVTA3TL  EQU   IEDQAVTD+628                                             01411000
AVTDMECB EQU   IEDQAVTD+624                                             01412000
AVTABEND EQU   IEDQAVTD+618                                             01413000
AVTPLCBN EQU   IEDQAVTD+616                                             01414000
@NM00016 EQU   AVTSAVTP+1                                               01415000
@NM00015 EQU   AVTSAVTF                                                 01416000
AVTSNA   EQU   AVTSAVTF                                                 01417000
AVTONSNA EQU   AVTSAVTF                                                 01418000
AVTVTMCP EQU   AVTSAVTF                                                 01419000
@NM00014 EQU   IEDQAVTD+608                                             01420000
AVTCMBSS EQU   IEDQAVTD+604                                             01421000
AVTRCV   EQU   IEDQAVTD+600                                             01422000
AVTSEND  EQU   IEDQAVTD+596                                             01423000
AVTCSCH  EQU   IEDQAVTD+592                                             01424000
AVTQ1    EQU   IEDQAVTD+588                                             01425000
AVTE7    EQU   IEDQAVTD+584                                             01426000
AVTHB    EQU   IEDQAVTD+580                                             01427000
AVTR1    EQU   IEDQAVTD+576                                             01428000
AVTBZ    EQU   IEDQAVTD+572                                             01429000
AVTEZ    EQU   IEDQAVTD+568                                             01430000
AVTEC    EQU   IEDQAVTD+564                                             01431000
AVTEW    EQU   IEDQAVTD+560                                             01432000
AVTNDIAL EQU   AVTSCOPT                                                 01433000
AVTN2741 EQU   AVTSCOPT                                                 01434000
AVTCONCO EQU   AVTSCOPT                                                 01435000
AVTCONC  EQU   AVTSCOPT                                                 01436000
AVTCMBUF EQU   AVTSCOPT                                                 01437000
AVTAPDMP EQU   AVTSCOPT                                                 01438000
@NM00013 EQU   AVTSCOPT                                                 01439000
AVTHA    EQU   AVTDISP                                                  01440000
AVTEA    EQU   IEDQAVTD+548                                             01441000
AVTAX    EQU   IEDQAVTD+544                                             01442000
AVTA3    EQU   IEDQAVTD+540                                             01443000
AVTGD    EQU   IEDQAVTD+536                                             01444000
AVTAL    EQU   IEDQAVTD+532                                             01445000
AVTOLTST EQU   AVTHG02                                                  01446000
AVTE8    EQU   IEDQAVTD+524                                             01447000
AVTUI    EQU   IEDQAVTD+520                                             01448000
AVTCOMPT EQU   IEDQAVTD+516                                             01449000
AVTCRSRF EQU   IEDQAVTD+512                                             01450000
@NM00012 EQU   IEDQAVTD+508                                             01451000
AVTKA02  EQU   IEDQAVTD+504                                             01452000
AVTOPTPT EQU   IEDQAVTD+500                                             01453000
AVTPCBPT EQU   IEDQAVTD+496                                             01454000
AVTOSECB EQU   IEDQAVTD+492                                             01455000
AVTOPECA EQU   IEDQAVTD+488                                             01456000
AVTOLECA EQU   IEDQAVTD+484                                             01457000
AVTCKECA EQU   IEDQAVTD+480                                             01458000
AVTCWECA EQU   IEDQAVTD+476                                             01459000
AVTCWTCB EQU   IEDQAVTD+472                                             01460000
AVTOLTCB EQU   IEDQAVTD+468                                             01461000
AVTOCTCB EQU   IEDQAVTD+464                                             01462000
AVTCKTCB EQU   IEDQAVTD+460                                             01463000
AVTAS    EQU   IEDQAVTD+456                                             01464000
AVTNOLBF EQU   IEDQAVTD+454                                             01465000
AVTNCKPR EQU   IEDQAVTD+453                                             01466000
AVTCIB   EQU   IEDQAVTD+452                                             01467000
AVTSPLPT EQU   IEDQAVTD+448                                             01468000
AVTMVBFR EQU   IEDQAVTD+444                                             01469000
AVTSBTA  EQU   IEDQAVTD+440                                             01470000
AVTRARTN EQU   IEDQAVTD+436                                             01471000
AVTBSCAN EQU   IEDQAVTD+432                                             01472000
AVTRDYA  EQU   IEDQAVTD+428                                             01473000
AVTRNMPT EQU   IEDQAVTD+424                                             01474000
AVTDISTR EQU   IEDQAVTD+420                                             01475000
AVTPARM3 EQU   IEDQAVTD+416                                             01476000
@NM00011 EQU   AVTPKF                                                   01477000
@NM00010 EQU   AVTPKF                                                   01478000
@NM00009 EQU   AVTPKF                                                   01479000
AVTFTCHF EQU   AVTPKF                                                   01480000
@NM00008 EQU   AVTPKF                                                   01481000
@NM00007 EQU   AVTPKF                                                   01482000
@NM00006 EQU   AVTPKF                                                   01483000
@NM00005 EQU   AVTPKF                                                   01484000
AVTPARM  EQU   IEDQAVTD+408                                             01485000
AVTEXS2A EQU   IEDQAVTD+402                                             01486000
AVTEXA2S EQU   IEDQAVTD+396                                             01487000
AVTOCGET EQU   IEDQAVTD+392                                             01488000
AVTCKAVT EQU   @NM00003+1                                               01489000
@NM00004 EQU   AVTCKFLG                                                 01490000
AVTCKHLT EQU   AVTCKFLG                                                 01491000
AVTCKREQ EQU   AVTCKFLG                                                 01492000
AVTCKENV EQU   AVTCKFLG                                                 01493000
AVTCKNAC EQU   AVTCKFLG                                                 01494000
AVTCKTAC EQU   AVTCKFLG                                                 01495000
@NM00002 EQU   IEDQAVTD+384                                             01496000
AVTREADD EQU   IEDQAVTD+380                                             01497000
AVTREADY EQU   IEDQAVTD+376                                             01498000
AVTRACE  EQU   IEDQAVTD+372                                             01499000
AVTTCB   EQU   IEDQAVTD+368                                             01500000
AVTPASWD EQU   IEDQAVTD+360                                             01501000
AVTCTLCH EQU   IEDQAVTD+352                                             01502000
AVTDOUBL EQU   IEDQAVTD+344                                             01503000
AVTDOUBX EQU   IEDQAVTD+336                                             01504000
AVTDPARM EQU   IEDQAVTD+332                                             01505000
AVTCSTCS EQU   IEDQAVTD+328                                             01506000
AVTDLQ   EQU   AVTSAVEX+32                                              01507000
@NM00001 EQU   AVTSAVEX                                                 01508000
AVTSAVE4 EQU   IEDQAVTD+216                                             01509000
AVTSAVE3 EQU   IEDQAVTD+144                                             01510000
AVTSAVE2 EQU   IEDQAVTD+72                                              01511000
AVTSAVE1 EQU   IEDQAVTD                                                 01512000
*                                      END UNREFERENCED COMPONENTS      01513000
@RT00314 EQU   PRORESP                                                  01514000
@RT00316 EQU   CMDINV                                                   01515000
@RT00319 EQU   CMDINV                                                   01516000
@RF00330 EQU   CMDINV                                                   01517000
@RC00325 EQU   @RC00323                                                 01518000
@RF00323 EQU   CMDINV                                                   01519000
@RT00340 EQU   CMDINV                                                   01520000
@RT00345 EQU   CMDINV                                                   01521000
@RC00354 EQU   WRITE                                                    01522000
@RC00352 EQU   WRITE                                                    01523000
@RC00350 EQU   WRITE                                                    01524000
@RF00364 EQU   CMDINV                                                   01525000
@RC00362 EQU   @RC00360                                                 01526000
@RF00360 EQU   CMDINV                                                   01527000
@RF00405 EQU   WRITE                                                    01528000
@EL01    EQU   @EL00001                                                 01529000
@ENDDATA EQU   *                                                        01530000
         END   IGCMU10D,(C'PLS0412',0701,76364)                         01531000
