         TITLE 'IGCMR10D-SWAP DEVICE ID                                *00001000
                        '                                               00002000
IGCMR10D CSECT ,                                                   0001 00003000
@PROLOG  DS    0H                                                  0002 00004000
         BALR  RBASE,0                  BASE REGISTER                   00005000
         USING *,RBASE                                                  00006000
IGCMR10D IEDHJN  SKIPID                                                 00007000
*   ROPCAVT=RPARM;                  /* SET OP CTL AVT BASE           */ 00008000
         LR    ROPCAVT,RPARM                                       0208 00009000
*   RESPECIFY                                                      0209 00010000
*     RPARM UNRSTD;                 /*                       @Y17XART*/ 00011000
*   ROPCE=OPCCOPCE;                 /* ELEMENT ADDRESS               */ 00012000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                            0210 00013000
*   GEN;                                                           0211 00014000
         LM    ROPCE,RWORK9,OPCSAVE(ROPCAVT) PARMS FROM SCAN MODULE     00015000
*   IF RLEN<=MAXLEN THEN            /* IS REMNDER OF CMD     @XA06346   00016000
*                                      LESS THAN OR EQUAL@XA06346 TO    00017000
*                                      MAX LNG ALLOWED@XA06346       */ 00018000
         CH    RLEN,MAXLEN                                         0212 00019000
         BH    @RF00212                                            0212 00020000
*     DO;                           /* YES                   @XA06346*/ 00021000
*       RSPTR=RSCAN+RLEN;           /* BUMP TO END OF CMD@XA06346    */ 00022000
         LR    RSPTR,RSCAN                                         0214 00023000
         ALR   RSPTR,RLEN                                          0214 00024000
*       DIGIT=' ';                  /* DELIMIT WITH BLANK@XA06346    */ 00025000
         MVI   DIGIT(RSPTR),C' '                                   0215 00026000
*     END;                          /* END OF DO GROUP       @XA06346*/ 00027000
*   RELEASE(RLEN,RSPTR);            /* RELEASE TO COMPILEROX06346    */ 00028000
@RF00212 DS    0H                                                  0218 00029000
*   OCBACKUP=OPCDOUBL;              /* CONC TRM NAME                 */ 00030000
         MVC   OCBACKUP(8,ROPCE),OPCDOUBL(ROPCAVT)                 0218 00031000
*   OPCLDNME(4:5)=ERRMOD;           /* ERROR EXIT MOD ID             */ 00032000
         MVC   OPCLDNME+3(2,ROPCAVT),ERRMOD                        0219 00033000
*   RSAVE=ADDR(OPCSAVE);            /* SAVE AREA ADDRESS             */ 00034000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0220 00035000
*   CALL TRMLKUP;                   /* GOTO TRM LOOKUP RTN           */ 00036000
         L     @15,OPCTOFLK(,ROPCAVT)                              0221 00037000
         BALR  @14,@15                                             0221 00038000
*   GOTO GOODTRM1;                  /* GOOD RETURN                   */ 00039000
         B     GOODTRM1                                            0222 00040000
*   RESPECIFY                                                      0223 00041000
*     RERR RSTD;                    /*                       @Y17XART*/ 00042000
*RETURN1:                                                          0224 00043000
*   RERR=16;                        /* ERROR MESSAGE                 */ 00044000
RETURN1  LA    RERR,16                                             0224 00045000
*   GOTO ERREXIT;                   /* GOTO ERROR MSG MODULE         */ 00046000
         B     ERREXIT                                             0225 00047000
*   RESPECIFY                                                      0226 00048000
*     RERR UNRSTD;                  /*                       @Y17XART*/ 00049000
*   RESPECIFY                                                      0227 00050000
*     IEDQTRM BASED(RPARM);                                        0227 00051000
*   RESPECIFY                                                      0228 00052000
*    (RPARM) RESTRICTED;                                           0228 00053000
*   RESTRICT(RQCB);                                                0229 00054000
*GOODTRM1:                                                         0230 00055000
*   OCMODNME=OCBACKUP;              /* SAVE CONC TRM NAME            */ 00056000
GOODTRM1 MVC   OCMODNME(8,ROPCE),OCBACKUP(ROPCE)                   0230 00057000
*   GEN(L     RQCB,TRMDESTQ-1(RPARM));/* GET QCB ADDRESS             */ 00058000
         L     RQCB,TRMDESTQ-1(RPARM)                                   00059000
*   IF TRMCONC^='1'B|               /* CONCENTRATOR                  */ 00060000
*       QCBDRQQ^='1'B THEN                                         0232 00061000
         TM    TRMCONC(RPARM),B'10000000'                          0232 00062000
         BNO   @RT00232                                            0232 00063000
         TM    QCBDRQQ(IEDQQPTR),B'00000100'                       0232 00064000
         BO    @RF00232                                            0232 00065000
@RT00232 DS    0H                                                  0233 00066000
*     DO;                           /* TRM A CONCENTRATOR            */ 00067000
*       RESPECIFY                                                  0234 00068000
*         RERR RSTD;                /*                       @Y17XART*/ 00069000
*       RERR=391;                   /* NO, ERROR MSG                 */ 00070000
         LA    RERR,391                                            0235 00071000
*       GOTO ERREXIT;               /* EXIT                          */ 00072000
         B     ERREXIT                                             0236 00073000
*       RESPECIFY                                                  0237 00074000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00075000
*     END;                                                         0238 00076000
*   RESTRICT(RCONC);                                               0239 00077000
@RF00232 DS    0H                                                  0240 00078000
*   RELEASE(RQCB);                                                 0240 00079000
*   RCONC=RPARM;                    /* YES, SAVE CONC TRM ADDR       */ 00080000
         LR    RCONC,RPARM                                         0241 00081000
*   CALL SCAN;                      /* SCAN FOR NEXT TRM NAME        */ 00082000
         BAL   @14,SCAN                                            0242 00083000
*   CALL TRMLKUP;                   /* LOOK UP TRM NAME              */ 00084000
         L     @15,OPCTOFLK(,ROPCAVT)                              0243 00085000
         BALR  @14,@15                                             0243 00086000
*   GOTO GOODTRM2;                  /* TRM NAME FOUND                */ 00087000
         B     GOODTRM2                                            0244 00088000
*   RESPECIFY                                                      0245 00089000
*     RERR RSTD;                    /*                       @Y17XART*/ 00090000
*RETURN2:                                                          0246 00091000
*   RERR=16;                        /* ERROR MSG                     */ 00092000
RETURN2  LA    RERR,16                                             0246 00093000
*   GOTO ERREXIT;                   /* EXIT                          */ 00094000
         B     ERREXIT                                             0247 00095000
*   RESPECIFY                                                      0248 00096000
*     RERR UNRSTD;                  /*                       @Y17XART*/ 00097000
*GOODTRM2:                                                         0249 00098000
*   CALL CONCTEST;                  /* CHECK VALIDITY OF TRM         */ 00099000
GOODTRM2 BAL   @14,CONCTEST                                        0249 00100000
*   IDSAVE=OCBACKUP;                /* SAVE TRM NAME TEMP            */ 00101000
         MVC   IDSAVE(8,RWORKA),OCBACKUP(ROPCE)                    0250 00102000
*   GEN(ST    RPARM,OCLINK(ROPCE)); /* SAVE TRM ENTRY ADDRESS        */ 00103000
         ST    RPARM,OCLINK(ROPCE)                                      00104000
*   CALL SCAN;                      /* SCAN FOR NEXT TRM NAME        */ 00105000
         BAL   @14,SCAN                                            0252 00106000
*   CALL TRMLKUP;                   /* GET TRM ENTR ADDR             */ 00107000
         L     @15,OPCTOFLK(,ROPCAVT)                              0253 00108000
         BALR  @14,@15                                             0253 00109000
*   GOTO GOODTRM3;                  /* TRM NAME FOUND                */ 00110000
         B     GOODTRM3                                            0254 00111000
*   RESPECIFY                                                      0255 00112000
*     RERR RSTD;                    /*                       @Y17XART*/ 00113000
*RETURN3:                                                          0256 00114000
*   RERR=16;                        /* ERROR MSG                     */ 00115000
RETURN3  LA    RERR,16                                             0256 00116000
*   GOTO ERREXIT;                   /* EXIT                          */ 00117000
         B     ERREXIT                                             0257 00118000
*   RESPECIFY                                                      0258 00119000
*     RERR UNRSTD;                  /*                       @Y17XART*/ 00120000
*GOODTRM3:                                                         0259 00121000
*   CALL CONCTEST;                  /* VALID TERMINAL                */ 00122000
GOODTRM3 BAL   @14,CONCTEST                                        0259 00123000
*   OCMODNME=IDSAVE;                /* RESTORE SAVED TRM NAME        */ 00124000
         MVC   OCMODNME(8,ROPCE),IDSAVE(RWORKA)                    0260 00125000
*   OCELEM=RPARM;                   /* SAVE TRM ENTRY ADDRESS        */ 00126000
         ST    RPARM,OCELEM(,ROPCE)                                0261 00127000
*   RELEASE(RCONC);                                                0262 00128000
*   RESTRICT(RDCT1,RDCT2);                                         0263 00129000
*   RDCT1=AVTCSTCS+(OCLINK->TRMCHCIN*AVTDCTLN);/* DCT TBL P  @Y17XART*/ 00130000
         L     @10,AVTCSTCS(,IEDQAPTR)                             0264 00131000
         L     @06,OCLINK(,ROPCE)                                  0264 00132000
         LH    @15,AVTDCTLN(,IEDQAPTR)                             0264 00133000
         SLR   RDCT1,RDCT1                                         0264 00134000
         IC    RDCT1,TRMCHCIN(,@06)                                0264 00135000
         MR    @08,@15                                             0264 00136000
         ALR   RDCT1,@10                                           0264 00137000
*   RDCT2=AVTCSTCS+(OCELEM->TRMCHCIN*AVTDCTLN);/* DCT TBL P  @Y17XART*/ 00138000
         L     @08,OCELEM(,ROPCE)                                  0265 00139000
         SLR   RDCT2,RDCT2                                         0265 00140000
         IC    RDCT2,TRMCHCIN(,@08)                                0265 00141000
         MR    @14,RDCT2                                           0265 00142000
         ALR   @10,@15                                             0265 00143000
         LR    RDCT2,@10                                           0265 00144000
*   IF RDCT1^=RDCT2 THEN                                           0266 00145000
         CR    RDCT1,RDCT2                                         0266 00146000
         BE    @RF00266                                            0266 00147000
*     DO;                           /* ARE DEVICE CHAR SIMILAR       */ 00148000
*       RESPECIFY                                                  0268 00149000
*         RERR RSTD;                /*                       @Y17XART*/ 00150000
*       RERR=393;                   /* NO, ERROR MSG                 */ 00151000
         LA    RERR,393                                            0269 00152000
*       GOTO ERREXIT;               /* EXIT                          */ 00153000
         B     ERREXIT                                             0270 00154000
*       RESPECIFY                                                  0271 00155000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00156000
*     END;                                                         0272 00157000
*   RELEASE(RDCT1,RDCT2);                                          0273 00158000
@RF00266 DS    0H                                                  0274 00159000
*   RESTRICT(RIDPTR);                                              0274 00160000
*   GEN(L     RPARM,OCLINK(ROPCE)); /* GET TRM ENTRY ADDRESS         */ 00161000
         L     RPARM,OCLINK(ROPCE)                                      00162000
*   CALL FLDLKUP;                   /* GET PTR TO DVC ID TBL ENT     */ 00163000
         BAL   @14,FLDLKUP                                         0276 00164000
*   GEN(ST    RIDPTR,OCLINK(ROPCE));/* SAVE DVC ID TBL ENTRY ADD     */ 00165000
         ST    RIDPTR,OCLINK(ROPCE)                                     00166000
*   RPARM=OCELEM;                   /* GET SECOND TRM ENTRY ADDR     */ 00167000
         L     RPARM,OCELEM(,ROPCE)                                0278 00168000
*   CALL FLDLKUP;                   /* GET DVC ID TBL ENTRY PTR      */ 00169000
         BAL   @14,FLDLKUP                                         0279 00170000
*   OCELEM=RIDPTR;                  /* SAVE DVC ID TBL ENTRY ADDR    */ 00171000
         ST    RIDPTR,OCELEM(,ROPCE)                               0280 00172000
*/* ARE DEVICE IDS EQUAL                                             */ 00173000
*                                                                  0281 00174000
*   IF OCELEM->DVCIDLTH^=OCLINK->DVCIDLTH THEN                     0281 00175000
         L     @06,OCELEM(,ROPCE)                                  0281 00176000
         L     @15,OCLINK(,ROPCE)                                  0281 00177000
         CLC   DVCIDLTH(1,@06),DVCIDLTH(@15)                       0281 00178000
         BE    @RF00281                                            0281 00179000
*     DO;                                                          0282 00180000
*       RESPECIFY                                                  0283 00181000
*         RERR RSTD;                /*                       @Y17XART*/ 00182000
*       RERR=393;                   /* NO, ERROR MSG                 */ 00183000
         LA    RERR,393                                            0284 00184000
*       GOTO ERREXIT;               /* EXIT                          */ 00185000
         B     ERREXIT                                             0285 00186000
*       RESPECIFY                                                  0286 00187000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00188000
*     END;                                                         0287 00189000
*   IF OCELEM->DVCIDLTH=1&          /* DVC ID CHAR LENGTH ONE        */ 00190000
*       OCELEM->DVCCHAR='FF'X|      /* TRM1 DVC ID = X'FF'           */ 00191000
*       OCLINK->DVCIDLTH=1&         /* DVC ID CHAR LENGTH ONE        */ 00192000
*       OCLINK->DVCCHAR='FF'X THEN                                 0288 00193000
@RF00281 L     @06,OCELEM(,ROPCE)                                  0288 00194000
         CLI   DVCIDLTH(@06),1                                     0288 00195000
         BNE   @GL00002                                            0288 00196000
         CLI   DVCCHAR(@06),X'FF'                                  0288 00197000
         BE    @RT00288                                            0288 00198000
@GL00002 L     @06,OCLINK(,ROPCE)                                  0288 00199000
         CLI   DVCIDLTH(@06),1                                     0288 00200000
         BNE   @RF00288                                            0288 00201000
         CLI   DVCCHAR(@06),X'FF'                                  0288 00202000
         BNE   @RF00288                                            0288 00203000
@RT00288 DS    0H                                                  0289 00204000
*     DO;                           /* TRM2 DVC ID = X'FF'           */ 00205000
*       RESPECIFY                                                  0290 00206000
*         RERR RSTD;                /*                       @Y17XART*/ 00207000
*       RERR=393;                   /* YES, PUT OUT ERROR MSG        */ 00208000
         LA    RERR,393                                            0291 00209000
*       GOTO ERREXIT;               /* EXIT                          */ 00210000
         B     ERREXIT                                             0292 00211000
*       RESPECIFY                                                  0293 00212000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00213000
*     END;                                                         0294 00214000
*   RESTRICT(RCNT);                                                0295 00215000
@RF00288 DS    0H                                                  0296 00216000
*   RCNT=OCLINK->DVCIDLTH;          /* LENGTH OF DVCIDS TO SWAP      */ 00217000
         L     @06,OCLINK(,ROPCE)                                  0296 00218000
         SLR   RCNT,RCNT                                           0296 00219000
         IC    RCNT,DVCIDLTH(,@06)                                 0296 00220000
*                                                                  0297 00221000
*/* ALL VALIDITY CHECKING HAS NOW BEEN DONE. WE MUST NOW FIND THE    */ 00222000
*/* DEVICE ID ENTRY FOR THE ATTACHED TERMINLS AND SWAP THEIR DEVICE  */ 00223000
*/* ID'S.                                                            */ 00224000
*                                                                  0297 00225000
*   GEN(SPACE 2);                                                  0297 00226000
         SPACE 2                                                        00227000
*   IDSAVE(1:RCNT)=OCELEM->TEMPDVC(1:RCNT);/* SAVID          @Y17XART*/ 00228000
         LR    @10,RCNT                                            0298 00229000
         BCTR  @10,0                                               0298 00230000
         L     @06,OCELEM(,ROPCE)                                  0298 00231000
         EX    @10,@SM01360                                        0298 00232000
*/* SWAP THE DEVICE IDS                                              */ 00233000
*                                                                  0299 00234000
*   OCELEM->TEMPDVC(1:RCNT)=OCLINK->TEMPDVC(1:RCNT);/*       @Y17XART*/ 00235000
         L     @15,OCLINK(,ROPCE)                                  0299 00236000
         EX    @10,@SM01362                                        0299 00237000
*   OCLINK->TEMPDVC(1:RCNT)=IDSAVE(1:RCNT);/*                @Y17XART*/ 00238000
         EX    @10,@SM01364                                        0300 00239000
*   RELEASE(RCNT);                                                 0301 00240000
*   RESPECIFY                                                      0302 00241000
*     RMSG RSTD;                    /*                       @Y17XART*/ 00242000
*   RMSG=394;                       /* SWAP COMPLETE MESSAGE         */ 00243000
         LA    RMSG,394                                            0303 00244000
*                                                                  0304 00245000
*/* EXIT LINKAGE                                                     */ 00246000
*                                                                  0304 00247000
*   GEN(SPACE 2) ;                                                 0304 00248000
         SPACE 2                                                        00249000
*   OPCLDNME(4:5)=WTGMOD;           /* ERROR MSG MODULE ID           */ 00250000
         MVC   OPCLDNME+3(2,ROPCAVT),WTGMOD                        0305 00251000
*ERREXIT:                                                          0306 00252000
*   RESPECIFY                                                      0306 00253000
*    (RPARM,                                                       0306 00254000
*     RERR) RSTD;                   /*                       @Y17XART*/ 00255000
ERREXIT  DS    0H                                                  0307 00256000
*   RPARM=ROPCAVT;                  /* PASS OP CTL AVT POINTER       */ 00257000
         LR    RPARM,ROPCAVT                                       0307 00258000
*   GEN EXIT;                                                      0308 00259000
*                                                          /*@Y17XART*/ 00260000
         XCTL  SF=(E,OPCXCTL(ROPCAVT))                         @Y17XART 00261000
*   RESPECIFY                                                      0309 00262000
*    (RPARM,                                                       0309 00263000
*     RERR,                                                        0309 00264000
*     RMSG) UNRSTD;                 /*                       @Y17XART*/ 00265000
*FLDLKUP:                                                          0310 00266000
*   PROC OPTIONS(DONTSAVE,NOSAVEAREA);                             0310 00267000
@EL00001 DS    0H                                                  0310 00268000
@EF00001 DS    0H                                                  0310 00269000
@ER00001 BR    @14                                                 0310 00270000
FLDLKUP  DS    0H                                                  0311 00271000
*   DCL                                                            0311 00272000
*     RFLD REG(11) PTR(24);                                        0311 00273000
*   DCL                                                            0312 00274000
*     RWORK2 REG(7) PTR(24);                                       0312 00275000
*   RESTRICT(RFLD,RWORK9,RWORK2,RIDPTR);                           0313 00276000
*   RESTRICT(ROPCE,ROPCAVT);                                       0314 00277000
*   RESPECIFY                                                      0315 00278000
*    (RPARM,                                                       0315 00279000
*     RLINK) RSTD;                  /*                       @Y17XART*/ 00280000
*   OPCSAVE=RLINK;                  /* SAVE RETURN REG               */ 00281000
         ST    RLINK,OPCSAVE(,ROPCAVT)                             0316 00282000
*   RFLD=ADDR(TRMOPT);              /* START OF DEVICE DEP FLD IF NO    00283000
*                                      OPTION FIELDS                 */ 00284000
         LA    RFLD,TRMOPT(,RPARM)                                 0317 00285000
*   IF TRMOPTFN='1'B THEN                                          0318 00286000
         TM    TRMOPTFN(RPARM),B'00000010'                         0318 00287000
         BNO   @RF00318                                            0318 00288000
*     DO;                           /* OPTION FIELDS USED            */ 00289000
*       RFLD=RFLD+TRMOPNO;          /* YES, SKIP OPTION FIELDS       */ 00290000
         SLR   @15,@15                                             0320 00291000
         IC    @15,TRMOPNO(,RPARM)                                 0320 00292000
         ALR   RFLD,@15                                            0320 00293000
*     END;                                                         0321 00294000
*   GEN(LH    RWORK9,TRMDEVFL(RPARM));/* GET DVC DEP FLD BITS        */ 00295000
@RF00318 DS    0H                                                  0322 00296000
         LH    RWORK9,TRMDEVFL(RPARM)                                   00297000
*   RESPECIFY                                                      0323 00298000
*     RPARM UNRSTD;                 /*                       @Y17XART*/ 00299000
*   GEN(SLL   RWORK9,15                SHIFT BITS TO HIGH ORDER);  0324 00300000
         SLL   RWORK9,15                SHIFT BITS TO HIGH ORDER        00301000
*   DO RCNT=9 TO 1 BY-1;            /* FIND DEVICE ID ENTRY ADDR     */ 00302000
         LA    RCNT,9                                              0325 00303000
@DL00325 DS    0H                                                  0326 00304000
*     GEN(SLL   RWORK9,1               SHIFT BIT OUT) ;            0326 00305000
         SLL   RWORK9,1               SHIFT BIT OUT                     00306000
*     IF RWORK9<0 THEN                                             0327 00307000
         LTR   RWORK9,RWORK9                                       0327 00308000
         BNM   @RF00327                                            0327 00309000
*       DO;                         /* IS THIS FIELD PRESENT         */ 00310000
*         RWORK2=RFLD->TRMOPT;      /* GET LENGTH OF THIS FIELD      */ 00311000
         SLR   RWORK2,RWORK2                                       0329 00312000
         IC    RWORK2,TRMOPT(,RFLD)                                0329 00313000
*         RFLD=RFLD+RWORK2+1;       /* BUMP TO NEXT FIELD            */ 00314000
         LR    @15,RFLD                                            0330 00315000
         ALR   @15,RWORK2                                          0330 00316000
         LA    @15,1(,@15)                                         0330 00317000
         LR    RFLD,@15                                            0330 00318000
*       END;                                                       0331 00319000
*   END;                                                           0332 00320000
@RF00327 BCTR  RCNT,0                                              0332 00321000
         LTR   RCNT,RCNT                                           0332 00322000
         BP    @DL00325                                            0332 00323000
*   RESPECIFY                                                      0333 00324000
*     RWORKA RSTD;                  /*                       @Y17XART*/ 00325000
*   DVCIDPSV=DVCIDPTR;              /* SAVE DVC ID PTR               */ 00326000
         ICM   @15,15,DVCIDPTR(IEDQDPTR)                           0334 00327000
         ST    @15,DVCIDPSV(,RWORKA)                               0334 00328000
*   RIDPTR=DVCIDPSV;                /* DVC ID PTR                    */ 00329000
         LR    RIDPTR,@15                                          0335 00330000
*   RELEASE(RFLD,RWORK9,RWORK2);                                   0336 00331000
*   RLINK=OPCSAVE;                  /* RESTORE RETURN ADDRESS        */ 00332000
         L     RLINK,OPCSAVE(,ROPCAVT)                             0337 00333000
*   RETURN;                         /* RETURN TO CALLER              */ 00334000
@EL00002 DS    0H                                                  0338 00335000
@EF00002 DS    0H                                                  0338 00336000
@ER00002 BR    @14                                                 0338 00337000
*   RESPECIFY                                                      0339 00338000
*     RLINK UNRSTD;                 /*                       @Y17XART*/ 00339000
*   END FLDLKUP;                                                   0340 00340000
*SCAN:                                                             0341 00341000
*   PROC OPTIONS(DONTSAVE,NOSAVEAREA);                             0341 00342000
SCAN     DS    0H                                                  0342 00343000
*   GEN(EJECT) ;                                                   0342 00344000
*                                                                  0342 00345000
         EJECT                                                          00346000
*/* THIS ROUTINE SCANS FOR A COMMA OR A BLANK FROM WHERE THE SCAN    */ 00347000
*/* POINTER (REG 7) IS POINTING. IF FOUND, IT INITIALIZES OCBACKUP   */ 00348000
*/* WITH THE TERMINAL NAME. OTHERWISE AN ERROR MSG IS ISSUED.        */ 00349000
*                                                                  0343 00350000
*   RESTRICT(ROPCE,ROPCAVT);                                       0343 00351000
*   RESTRICT(RSPTR,RSCAN,RCNT);                                    0344 00352000
*   GEN(SPACE 2) ;                                                 0345 00353000
         SPACE 2                                                        00354000
*   RESPECIFY                                                      0346 00355000
*     RLINK RSTD;                   /*                       @Y17XART*/ 00356000
*   OPCSAVE=RLINK;                  /* SAVE RETURN REG               */ 00357000
         ST    RLINK,OPCSAVE(,ROPCAVT)                             0347 00358000
*   RESPECIFY                                                      0348 00359000
*     RLINK UNRSTD;                 /*                       @Y17XART*/ 00360000
*   RSPTR=RSCAN;                    /* INIT SCAN PTR                 */ 00361000
         LR    RSPTR,RSCAN                                         0349 00362000
*   DO RCNT=0 TO 8 BY 1;            /* SCAN FOR A COMMA              */ 00363000
         SLR   RCNT,RCNT                                           0350 00364000
@DL00350 DS    0H                                                  0351 00365000
*     RSPTR=RSCAN+RCNT;             /* UPDATE SCAN PTR               */ 00366000
         LR    RSPTR,RSCAN                                         0351 00367000
         ALR   RSPTR,RCNT                                          0351 00368000
*     IF DIGIT=','|                 /* IS THIS CHARACTER A COMMA     */ 00369000
*         DIGIT=' ' THEN                                           0352 00370000
         CLI   DIGIT(RSPTR),C','                                   0352 00371000
         BE    @RT00352                                            0352 00372000
         CLI   DIGIT(RSPTR),C' '                                   0352 00373000
         BNE   @RF00352                                            0352 00374000
@RT00352 DS    0H                                                  0353 00375000
*       DO;                         /* OR A BLANK                    */ 00376000
*         OCBACKUP=' ';             /* YES, BLANK RCVING FIELD       */ 00377000
         MVI   OCBACKUP+1(ROPCE),C' '                              0354 00378000
         MVC   OCBACKUP+2(6,ROPCE),OCBACKUP+1(ROPCE)               0354 00379000
         MVI   OCBACKUP(ROPCE),C' '                                0354 00380000
*         OCBACKUP=FIELD(1:RCNT);   /* MOVE TERMINAL NAME            */ 00381000
         MVI   OCBACKUP+1(ROPCE),C' '                              0355 00382000
         MVC   OCBACKUP+2(6,ROPCE),OCBACKUP+1(ROPCE)               0355 00383000
         LR    @12,RCNT                                            0355 00384000
         BCTR  @12,0                                               0355 00385000
         EX    @12,@SM01366                                        0355 00386000
*         OPCDOUBL=OCBACKUP;        /* SET FOR TRMLKUP       @XA06345*/ 00387000
         MVC   OPCDOUBL(8,ROPCAVT),OCBACKUP(ROPCE)                 0356 00388000
*         RSCAN=RSCAN+RCNT+1;       /* UPDATE SCAN POINTER           */ 00389000
         LR    @12,RSCAN                                           0357 00390000
         ALR   @12,RCNT                                            0357 00391000
         LA    @12,1(,@12)                                         0357 00392000
         LR    RSCAN,@12                                           0357 00393000
*         RESPECIFY                                                0358 00394000
*           RLINK RSTD;             /*                       @Y17XART*/ 00395000
*         RLINK=OPCSAVE;            /* RESTORE RETURN ADDRESS        */ 00396000
         L     RLINK,OPCSAVE(,ROPCAVT)                             0359 00397000
*         RETURN;                   /* RETURN TO CALLER              */ 00398000
@EL00003 DS    0H                                                  0360 00399000
@EF00003 DS    0H                                                  0360 00400000
@ER00003 BR    @14                                                 0360 00401000
*         RESPECIFY                                                0361 00402000
*           RLINK UNRSTD;           /*                       @Y17XART*/ 00403000
*       END;                                                       0362 00404000
*   END;                                                           0363 00405000
@RF00352 AL    RCNT,@CF00086                                       0363 00406000
         C     RCNT,@CF00071                                       0363 00407000
         BNH   @DL00350                                            0363 00408000
*   RESPECIFY                                                      0364 00409000
*     RERR RSTD;                    /*                       @Y17XART*/ 00410000
*   RERR=18;                        /* ERROR MSG NUMBER              */ 00411000
         LA    RERR,18                                             0365 00412000
*   GOTO ERREXIT;                   /* EXIT                          */ 00413000
         B     ERREXIT                                             0366 00414000
*   RESPECIFY                                                      0367 00415000
*     RERR UNRSTD;                  /*                       @Y17XART*/ 00416000
*   RELEASE(RSPTR,RCNT);                                           0368 00417000
*   END SCAN;                                                      0369 00418000
*CONCTEST:                                                         0370 00419000
*   PROC OPTIONS(DONTSAVE,NOSAVEAREA);                             0370 00420000
CONCTEST DS    0H                                                  0371 00421000
*   GEN(EJECT) ;                                                   0371 00422000
*                                                                  0371 00423000
         EJECT                                                          00424000
*/* THIS ROUTINE TEST THE TERMINALS VALIDITY. IT INSURES THAT THE    */ 00425000
*/* TERMINAL IS NOT ANOTHER CONCENTRATOR AND ALSO CHECKS TO BE SURE  */ 00426000
*/* THAT THE TERMINAL IS ATTACHED TO THE CORRECT CONCENTRATOR. IF    */ 00427000
*/* THE TESTS FAIL AN ERROR MESSAGE IS ISSUED AND THE COMMAND IS     */ 00428000
*/* ABORTED.                                                         */ 00429000
*                                                                  0372 00430000
*   RESTRICT(ROPCE,ROPCAVT);                                       0372 00431000
*   RESTRICT(RQCB,RCONC);                                          0373 00432000
*   RESPECIFY                                                      0374 00433000
*     RLINK RSTD;                   /*                       @Y17XART*/ 00434000
*   OPCSAVE=RLINK;                  /* SAVE RETURN REG               */ 00435000
         ST    RLINK,OPCSAVE(,ROPCAVT)                             0375 00436000
*   RESPECIFY                                                      0376 00437000
*     RLINK UNRSTD;                 /*                       @Y17XART*/ 00438000
*   RESPECIFY                                                      0377 00439000
*     RPARM RSTD;                   /*                       @Y17XART*/ 00440000
*   IF TRMSTATE(1:3)^='000'B THEN                                  0378 00441000
         TM    TRMSTATE(RPARM),B'11100000'                         0378 00442000
         BZ    @RF00378                                            0378 00443000
*     DO;                           /* SINGLE ENTRY                  */ 00444000
*       RESPECIFY                                                  0380 00445000
*         RERR RSTD;                /*                       @Y17XART*/ 00446000
*       RERR=90;                    /* SET ERR MSG NUMBER            */ 00447000
         LA    RERR,90                                             0381 00448000
*       GOTO ERREXIT;               /* EXIT                          */ 00449000
         B     ERREXIT                                             0382 00450000
*       RESPECIFY                                                  0383 00451000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00452000
*     END;                                                         0384 00453000
*   IF TRMCONC^='1'B THEN                                          0385 00454000
@RF00378 TM    TRMCONC(RPARM),B'10000000'                          0385 00455000
         BO    @RF00385                                            0385 00456000
*     DO;                           /* CONCENTRATOR                  */ 00457000
*       RESPECIFY                                                  0387 00458000
*         RERR RSTD;                /*                       @Y17XART*/ 00459000
*       RERR=391;                   /* ERROR MSG NUMBER              */ 00460000
         LA    RERR,391                                            0388 00461000
*       GOTO ERREXIT;               /* EXIT                          */ 00462000
         B     ERREXIT                                             0389 00463000
*       RESPECIFY                                                  0390 00464000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00465000
*     END;                                                         0391 00466000
*   RESTRICT(RQCBE);                                               0392 00467000
@RF00385 DS    0H                                                  0393 00468000
*   GEN(L     RQCB,TRMDESTQ-1(RPARM));/* QCB ADDRESS                 */ 00469000
         L     RQCB,TRMDESTQ-1(RPARM)                                   00470000
*   RESPECIFY                                                      0394 00471000
*     RPARM UNRSTD;                 /*                       @Y17XART*/ 00472000
*   RQCBE=RQCB+QCBEXTO;             /* EXTENSION ADDRESS             */ 00473000
         LR    RQCBE,RQCB                                          0395 00474000
         AH    RQCBE,QCBEXTO(,IEDQQPTR)                            0395 00475000
*   RCONC=RCONC+0;                  /* CLEAR HIGH ORDER              */ 00476000
*   GEN(L     RQCBE,QCBECONC-1(RQCBE));/* EXTENSION PTR              */ 00477000
         L     RQCBE,QCBECONC-1(RQCBE)                                  00478000
*   RQCBE=RQCBE+0;                  /* CLEAR HIGH ORDER              */ 00479000
*   IF QCBDRQQ='1'B|                /* CONCENTRATOR OR               */ 00480000
*       RCONC^=RQCBE THEN                                          0399 00481000
         TM    QCBDRQQ(IEDQQPTR),B'00000100'                       0399 00482000
         BO    @RT00399                                            0399 00483000
         CR    RCONC,RQCBE                                         0399 00484000
         BE    @RF00399                                            0399 00485000
@RT00399 DS    0H                                                  0400 00486000
*     DO;                           /* NOT ATTACHED TO RIGHT CONC    */ 00487000
*       RELEASE(RQCBE);                                            0401 00488000
*       RESPECIFY                                                  0402 00489000
*         RERR RSTD;                /*                       @Y17XART*/ 00490000
*       RERR=392;                   /* ERROR MSG NUMBER              */ 00491000
         LA    RERR,392                                            0403 00492000
*       GOTO ERREXIT;               /* EXIT                          */ 00493000
         B     ERREXIT                                             0404 00494000
*       RESPECIFY                                                  0405 00495000
*         RERR UNRSTD;              /*                       @Y17XART*/ 00496000
*     END;                                                         0406 00497000
*   RESPECIFY                                                      0407 00498000
*     RLINK RSTD;                   /*                       @Y17XART*/ 00499000
@RF00399 DS    0H                                                  0408 00500000
*   RLINK=OPCSAVE;                  /* RESTORE RETURN ADDRESS        */ 00501000
         L     RLINK,OPCSAVE(,ROPCAVT)                             0408 00502000
*   RETURN;                                                        0409 00503000
@EL00004 DS    0H                                                  0409 00504000
@EF00004 DS    0H                                                  0409 00505000
@ER00004 BR    @14                                                 0409 00506000
*   RESPECIFY                                                      0410 00507000
*     RLINK UNRSTD;                 /*                       @Y17XART*/ 00508000
*   RELEASE(RQCB);                                                 0411 00509000
*   END CONCTEST;                                                  0412 00510000
*   END IGCMR10D                                                   0413 00511000
*                                                                  0413 00512000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00513000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00514000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00515000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00516000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00517000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 00518000
*/*%INCLUDE SYSLIB  (TQCBED  )                                       */ 00519000
*/*%INCLUDE SYSLIB  (TDVCIDTD)                                       */ 00520000
*                                                                  0413 00521000
*       ;                                                          0413 00522000
@DATA    DS    0H                                                       00523000
@SM01360 MVC   IDSAVE(0,RWORKA),TEMPDVC(@06)                            00524000
@SM01362 MVC   TEMPDVC(0,@06),TEMPDVC(@15)                              00525000
@SM01364 MVC   TEMPDVC(0,@15),IDSAVE(RWORKA)                            00526000
@SM01366 MVC   OCBACKUP(0,ROPCE),FIELD(RSCAN)                           00527000
         DS    0F                                                       00528000
         DS    0F                                                       00529000
@CF00086 DC    F'1'                                                     00530000
@CF00071 DC    F'8'                                                     00531000
         DS    0D                                                       00532000
MAXLEN   DC    H'17'                                                    00533000
ENABLE   DC    XL1'FF'                                                  00534000
DISABLE  DC    XL1'00'                                                  00535000
ERRMOD   DC    CL2'03'                                                  00536000
WTGMOD   DC    CL2'M3'                                                  00537000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00538000
@01      EQU   01                                                       00539000
@02      EQU   02                                                       00540000
@03      EQU   03                                                       00541000
@04      EQU   04                                                       00542000
@05      EQU   05                                                       00543000
@06      EQU   06                                                       00544000
@07      EQU   07                                                       00545000
@08      EQU   08                                                       00546000
@09      EQU   09                                                       00547000
@10      EQU   10                                                       00548000
@11      EQU   11                                                       00549000
@12      EQU   12                                                       00550000
@13      EQU   13                                                       00551000
@14      EQU   14                                                       00552000
@15      EQU   15                                                       00553000
@0       EQU   00                                                       00554000
@1       EQU   01                                                       00555000
@2       EQU   02                                                       00556000
@3       EQU   03                                                       00557000
@4       EQU   04                                                       00558000
@5       EQU   05                                                       00559000
@6       EQU   06                                                       00560000
@7       EQU   07                                                       00561000
@8       EQU   08                                                       00562000
@9       EQU   09                                                       00563000
@A       EQU   10                                                       00564000
@B       EQU   11                                                       00565000
@C       EQU   12                                                       00566000
@D       EQU   13                                                       00567000
@E       EQU   14                                                       00568000
@F       EQU   15                                                       00569000
RMSG     EQU   @00                                                      00570000
RERR     EQU   @00                                                      00571000
RPARM    EQU   @01                                                      00572000
IEDQTPTR EQU   @01                                                      00573000
ROPCAVT  EQU   @02                                                      00574000
ROPCE    EQU   @03                                                      00575000
IEDQAPTR EQU   @04                                                      00576000
RWORKA   EQU   @05                                                      00577000
RCONC    EQU   @06                                                      00578000
RLEN     EQU   @06                                                      00579000
RIDPTR   EQU   @07                                                      00580000
RQCB     EQU   @08                                                      00581000
IEDQDPTR EQU   @07                                                      00582000
IEDQQPTR EQU   @08                                                      00583000
RSCAN    EQU   @07                                                      00584000
IEDQEPTR EQU   @09                                                      00585000
RQCBE    EQU   @09                                                      00586000
RDCT1    EQU   @09                                                      00587000
RSPTR    EQU   @09                                                      00588000
RWORK9   EQU   @09                                                      00589000
RCNT     EQU   @11                                                      00590000
RDCT2    EQU   @11                                                      00591000
RBASE    EQU   @12                                                      00592000
RSAVE    EQU   @13                                                      00593000
RLINK    EQU   @14                                                      00594000
RFLD     EQU   @11                                                      00595000
RWORK2   EQU   @07                                                      00596000
IEDQAVTD EQU   0                                                        00597000
AVTSAVEX EQU   IEDQAVTD+288                                             00598000
AVTCSTCS EQU   IEDQAVTD+328                                             00599000
@NM00003 EQU   IEDQAVTD+388                                             00600000
AVTCKFLG EQU   @NM00003                                                 00601000
AVTBASE  EQU   IEDQAVTD+412                                             00602000
AVTPKF   EQU   AVTBASE                                                  00603000
AVTHG02  EQU   IEDQAVTD+528                                             00604000
AVTDISP  EQU   IEDQAVTD+552                                             00605000
AVTHD    EQU   IEDQAVTD+556                                             00606000
AVTSCOPT EQU   AVTHD                                                    00607000
AVTSAVTP EQU   IEDQAVTD+612                                             00608000
AVTSAVTF EQU   AVTSAVTP                                                 00609000
AVTCKPEL EQU   IEDQAVTD+652                                             00610000
AVTCKRMV EQU   AVTCKPEL                                                 00611000
AVTCKELF EQU   IEDQAVTD+680                                             00612000
AVTCKBYT EQU   IEDQAVTD+691                                             00613000
AVTHG01  EQU   IEDQAVTD+692                                             00614000
AVTCKLNK EQU   IEDQAVTD+696                                             00615000
AVTCRELE EQU   IEDQAVTD+708                                             00616000
AVTCCELE EQU   AVTCRELE                                                 00617000
AVTCLRHI EQU   IEDQAVTD+716                                             00618000
AVTADBUF EQU   IEDQAVTD+720                                             00619000
AVTSYSER EQU   IEDQAVTD+728                                             00620000
AVTCKPQB EQU   IEDQAVTD+804                                             00621000
AVTCKPTB EQU   AVTCKPQB                                                 00622000
AVTCKPEC EQU   AVTCKPQB+4                                               00623000
AVTCKPCC EQU   AVTCKPEC                                                 00624000
AVTOPCQB EQU   IEDQAVTD+816                                             00625000
AVTOPCOB EQU   AVTOPCQB                                                 00626000
AVTOPCEC EQU   AVTOPCQB+4                                               00627000
AVTOPCCC EQU   AVTOPCEC                                                 00628000
AVTOLTQB EQU   IEDQAVTD+828                                             00629000
AVTCWFL1 EQU   IEDQAVTD+924                                             00630000
AVTCWFL2 EQU   IEDQAVTD+925                                             00631000
AVTSUBT  EQU   IEDQAVTD+948                                             00632000
AVTIOTR  EQU   IEDQAVTD+949                                             00633000
AVTBIT1  EQU   IEDQAVTD+1050                                            00634000
AVTBIT2  EQU   IEDQAVTD+1051                                            00635000
AVTBIT3  EQU   IEDQAVTD+1052                                            00636000
AVTDCTLN EQU   IEDQAVTD+1072                                            00637000
AVTBIT4  EQU   IEDQAVTD+1136                                            00638000
@NM00083 EQU   IEDQAVTD+1232                                            00639000
IEDNSVTD EQU   0                                                        00640000
SAVTDIAG EQU   IEDNSVTD                                                 00641000
SAVTDIAF EQU   SAVTDIAG                                                 00642000
SAVTLUSQ EQU   IEDNSVTD+88                                              00643000
SAVTTCPU EQU   IEDNSVTD+238                                             00644000
SAVTZELM EQU   IEDNSVTD+270                                             00645000
SAVTRDRV EQU   IEDNSVTD+284                                             00646000
SAVTCKQB EQU   IEDNSVTD+300                                             00647000
SAVTCKTB EQU   SAVTCKQB                                                 00648000
SAVTCKEC EQU   SAVTCKQB+4                                               00649000
SAVTCKCC EQU   SAVTCKEC                                                 00650000
IEDQOPCD EQU   0                                                        00651000
OPCDOUBL EQU   IEDQOPCD                                                 00652000
OPCCOPCE EQU   IEDQOPCD+12                                              00653000
OPCTOFLK EQU   IEDQOPCD+24                                              00654000
OPCSAVE  EQU   IEDQOPCD+56                                              00655000
OPCAQCTL EQU   IEDQOPCD+180                                             00656000
OPCLDNME EQU   IEDQOPCD+212                                             00657000
OPCSPEC  EQU   IEDQOPCD+300                                             00658000
IEDQOPCE EQU   0                                                        00659000
OCLINK   EQU   IEDQOPCE                                                 00660000
OCELEM   EQU   IEDQOPCE+4                                               00661000
OCUNIT   EQU   IEDQOPCE+8                                               00662000
OCRUDEST EQU   OCUNIT                                                   00663000
OCCKPKEY EQU   OCRUDEST                                                 00664000
OCSCAN   EQU   OCCKPKEY                                                 00665000
OCOPTCDE EQU   IEDQOPCE+12                                              00666000
OCSWITCH EQU   IEDQOPCE+13                                              00667000
OCFLAG   EQU   IEDQOPCE+14                                              00668000
@NM00118 EQU   IEDQOPCE+16                                              00669000
OCDEST   EQU   @NM00118                                                 00670000
OCREQVAL EQU   OCDEST+1                                                 00671000
OCLINENO EQU   IEDQOPCE+22                                              00672000
OCTIOT   EQU   OCLINENO                                                 00673000
OCTRUNIT EQU   IEDQOPCE+24                                              00674000
OCRSID   EQU   OCTRUNIT                                                 00675000
OCALSTAT EQU   OCRSID                                                   00676000
OCPARM   EQU   IEDQOPCE+28                                              00677000
OCBACKUP EQU   IEDQOPCE+32                                              00678000
OCMODNME EQU   IEDQOPCE+40                                              00679000
OCIPLWA  EQU   OCMODNME                                                 00680000
OCCKDATA EQU   IEDQOPCE+48                                              00681000
OCRSTGTM EQU   OCCKDATA                                                 00682000
IEDQOPCN EQU   0                                                        00683000
OCLDNME  EQU   IEDQOPCN                                                 00684000
OCLINTTE EQU   OCLDNME                                                  00685000
OCREQFLG EQU   OCLINTTE+2                                               00686000
OCPREFLG EQU   OCLINTTE+3                                               00687000
IEDQTRM  EQU   0                                                        00688000
TRMSTATE EQU   IEDQTRM                                                  00689000
TRMLOG   EQU   TRMSTATE                                                 00690000
TRMOPTFN EQU   TRMSTATE                                                 00691000
TRMINSEQ EQU   IEDQTRM+4                                                00692000
TLISTCNT EQU   TRMINSEQ                                                 00693000
TRMOUTSQ EQU   IEDQTRM+6                                                00694000
TLISTEN  EQU   TRMOUTSQ                                                 00695000
TRMDSORG EQU   TLISTEN                                                  00696000
TRMALTD  EQU   IEDQTRM+8                                                00697000
TRMDEVFL EQU   IEDQTRM+10                                               00698000
TRMCONC  EQU   TRMDEVFL+1                                               00699000
TRMSTAT  EQU   IEDQTRM+12                                               00700000
TRMCHCIN EQU   IEDQTRM+16                                               00701000
TRMOPNO  EQU   IEDQTRM+17                                               00702000
IEDNTRM  EQU   0                                                        00703000
TRMBYTE4 EQU   IEDNTRM                                                  00704000
TRMBYTE3 EQU   IEDNTRM+1                                                00705000
TRMBYTE2 EQU   IEDNTRM+2                                                00706000
TRMINPG  EQU   TRMBYTE2                                                 00707000
TRMBYTE1 EQU   IEDNTRM+3                                                00708000
TRMSCPRQ EQU   TRMBYTE1                                                 00709000
TRMBYTE0 EQU   IEDNTRM+6                                                00710000
TRMSIBPT EQU   IEDNTRM+7                                                00711000
IEDQQCB  EQU   0                                                        00712000
QCBDSFLG EQU   IEDQQCB                                                  00713000
QCBDISK  EQU   QCBDSFLG                                                 00714000
QCBDRQQ  EQU   QCBDSFLG                                                 00715000
QCBEOLDT EQU   IEDQQCB+16                                               00716000
QCBBYTE1 EQU   QCBEOLDT+1                                               00717000
QCBLKRLN EQU   IEDQQCB+18                                               00718000
QCBRETCT EQU   QCBLKRLN                                                 00719000
QCBSTAT  EQU   IEDQQCB+19                                               00720000
QCBINSRC EQU   IEDQQCB+21                                               00721000
@NM00136 EQU   QCBINSRC                                                 00722000
QCBTSOF2 EQU   @NM00136+1                                               00723000
QCBTSOF1 EQU   @NM00136+2                                               00724000
QCBINTVL EQU   IEDQQCB+24                                               00725000
QCBEXTO  EQU   QCBINTVL                                                 00726000
QCBPREN  EQU   IEDQQCB+28                                               00727000
QCBLKRRN EQU   QCBPREN+1                                                00728000
QCBDCBAD EQU   IEDQQCB+33                                               00729000
QCBFLAG  EQU   IEDQQCB+36                                               00730000
IEDQPQCB EQU   40                                                       00731000
QCBFHDLZ EQU   IEDQPQCB+3                                               00732000
QCBPFEFO EQU   QCBFHDLZ+1                                               00733000
QCBFHDTZ EQU   IEDQPQCB+6                                               00734000
QCBINTLF EQU   IEDQPQCB+12                                              00735000
IEDNQCB  EQU   0                                                        00736000
QCBSTAT1 EQU   IEDNQCB+4                                                00737000
QCBPLCBA EQU   IEDNQCB+5                                                00738000
IEDQQCBE EQU   0                                                        00739000
QCBEFLG  EQU   IEDQQCBE                                                 00740000
QCBECONC EQU   IEDQQCBE+1                                               00741000
QCBEDAMT EQU   IEDQQCBE+4                                               00742000
QCBESAVE EQU   IEDQQCBE+10                                              00743000
QCBEDEOB EQU   IEDQQCBE+15                                              00744000
IEDQDVCT EQU   0                                                        00745000
DVCIDLTH EQU   IEDQDVCT                                                 00746000
DVCCHAR  EQU   IEDQDVCT+1                                               00747000
DVCSTAT  EQU   IEDQDVCT+2                                               00748000
DIGIT    EQU   0                                                        00749000
IDSAVE   EQU   100                                                      00750000
TRMLKUP  EQU   0                                                        00751000
FIELD    EQU   0                                                        00752000
DVCIDPSV EQU   108                                                      00753000
DVCIDPTR EQU   1                                                        00754000
OPCAQWD  EQU   OPCAQCTL                                                 00755000
OPCAQWD1 EQU   OPCAQWD                                                  00756000
OPCAQWD2 EQU   OPCAQWD+4                                                00757000
OPCAQWD3 EQU   OPCAQWD+8                                                00758000
OCCKPKY1 EQU   OCCKPKEY                                                 00759000
OCCKPTYP EQU   OCCKPKY1                                                 00760000
OCICACTN EQU   OCMODNME                                                 00761000
OCICDADR EQU   OCICACTN                                                 00762000
OCICSW   EQU   OCICDADR+3                                               00763000
TRMOPT   EQU   IEDQTRM+20                                               00764000
TRMPRE1  EQU   TRMBYTE4                                                 00765000
TRMPRE   EQU   TRMBYTE3                                                 00766000
TRMNCP   EQU   TRMBYTE3                                                 00767000
TRMPU    EQU   TRMBYTE3                                                 00768000
TRMLU    EQU   TRMBYTE3                                                 00769000
TRMLINK  EQU   TRMBYTE3                                                 00770000
@NM00141 EQU   QCBESAVE                                                 00771000
QCBEQTYP EQU   @NM00141+4                                               00772000
TEMPDVC  EQU   DVCCHAR                                                  00773000
DVCECW   EQU   IEDQDVCT+3                                               00774000
OCCIB    EQU   OCREQVAL                                                 00775000
*                                      START UNREFERENCED COMPONENTS    00776000
QCBEMM   EQU   QCBEQTYP                                                 00777000
@NM00142 EQU   QCBEQTYP                                                 00778000
QCBEFEFO EQU   @NM00141+1                                               00779000
QCBEPRI  EQU   @NM00141                                                 00780000
@NM00133 EQU   TRMLINK                                                  00781000
TRMLSTAT EQU   TRMLINK                                                  00782000
TRMLINT  EQU   TRMLINK                                                  00783000
TRMEPMOD EQU   TRMLINK                                                  00784000
TRMLULOG EQU   TRMLU                                                    00785000
TRMINERR EQU   TRMLU                                                    00786000
TRMLUREQ EQU   TRMLU                                                    00787000
TRMSESRQ EQU   TRMLU                                                    00788000
TRMTDIFF EQU   TRMLU                                                    00789000
TRMLUTM  EQU   TRMLU                                                    00790000
TRMLUIT  EQU   TRMLU                                                    00791000
TRMAUTO  EQU   TRMLU                                                    00792000
TRMPCONT EQU   TRMPU                                                    00793000
@NM00132 EQU   TRMPU                                                    00794000
TRMNCONT EQU   TRMNCP                                                   00795000
TRMQUCKN EQU   TRMNCP                                                   00796000
TRMSLOWN EQU   TRMNCP                                                   00797000
TRMSYGEN EQU   TRMNCP                                                   00798000
TRMNCPCL EQU   TRMNCP                                                   00799000
TRMIPLDM EQU   TRMNCP                                                   00800000
TRMINOUT EQU   TRMPRE                                                   00801000
TRMRDOUT EQU   TRMPRE                                                   00802000
TRMNLOUT EQU   TRMPRE                                                   00803000
TRMWROUT EQU   TRMPRE                                                   00804000
TRMASNXI EQU   TRMPRE                                                   00805000
TRMSTMM  EQU   TRMPRE                                                   00806000
TRMCMODE EQU   TRMPRE                                                   00807000
TRMSTPND EQU   TRMPRE                                                   00808000
TRMLYNCH EQU   TRMPRE1                                                  00809000
TRMSPOUT EQU   TRMPRE1                                                  00810000
TRMERLCK EQU   TRMPRE1                                                  00811000
TRMQNPL  EQU   TRMPRE1                                                  00812000
TRMSPACT EQU   TRMPRE1                                                  00813000
TRMOCNI  EQU   TRMPRE1                                                  00814000
TRMSESSN EQU   TRMPRE1                                                  00815000
TRMCONT  EQU   TRMPRE1                                                  00816000
OCICINAC EQU   OCICSW                                                   00817000
@NM00124 EQU   OCICSW                                                   00818000
OCICATST EQU   OCICDADR+1                                               00819000
OCICTYPE EQU   OCICDADR                                                 00820000
@NM00123 EQU   OCCKPKY1                                                 00821000
OCCKPENV EQU   OCCKPKY1                                                 00822000
OCCKPRST EQU   OCCKPTYP                                                 00823000
OCCKPNCP EQU   OCCKPTYP                                                 00824000
OCCKPINC EQU   OCCKPTYP                                                 00825000
OPCAQLST EQU   OPCAQWD3+1                                               00826000
OPCAQRQ3 EQU   OPCAQWD3                                                 00827000
OPCAQSEC EQU   OPCAQWD2+1                                               00828000
OPCAQRQ2 EQU   OPCAQWD2                                                 00829000
OPCAQFST EQU   OPCAQWD1+1                                               00830000
OPCAQREQ EQU   OPCAQWD1                                                 00831000
DVCSORTD EQU   DVCSTAT                                                  00832000
@NM00143 EQU   DVCSTAT                                                  00833000
DVCENLTH EQU   IEDQDVCT+1                                               00834000
DVCRSV   EQU   DVCCHAR                                                  00835000
DVCNO    EQU   DVCIDLTH                                                 00836000
QCBERS   EQU   IEDQQCBE+20                                              00837000
QCBELRS  EQU   IEDQQCBE+19                                              00838000
QCBELCB  EQU   QCBEDEOB                                                 00839000
QCBEEOB  EQU   QCBESAVE+3                                               00840000
QCBEMACR EQU   QCBESAVE                                                 00841000
QCBENPLV EQU   IEDQQCBE+9                                               00842000
QCBELGTH EQU   IEDQQCBE+8                                               00843000
QCBETCIN EQU   IEDQQCBE+6                                               00844000
QCBEOSEQ EQU   QCBEDAMT                                                 00845000
QCBEHDR  EQU   QCBECONC                                                 00846000
QCBEPEND EQU   QCBEFLG                                                  00847000
QCBEDATA EQU   QCBEFLG                                                  00848000
QCBEOMSG EQU   QCBEFLG                                                  00849000
QCBESRVC EQU   QCBEFLG                                                  00850000
QCBEHELD EQU   QCBEFLG                                                  00851000
QCBEOPL  EQU   QCBEFLG                                                  00852000
QCBECNT  EQU   QCBEFLG                                                  00853000
QCBESTAT EQU   QCBEFLG                                                  00854000
QCBTTCIN EQU   QCBPLCBA+1                                               00855000
@NM00140 EQU   QCBPLCBA                                                 00856000
@NM00139 EQU   QCBSTAT1                                                 00857000
QCBFLUSH EQU   QCBSTAT1                                                 00858000
QCBNDXRQ EQU   QCBSTAT1                                                 00859000
QCBESIG  EQU   QCBSTAT1                                                 00860000
QCBRCVRQ EQU   QCBSTAT1                                                 00861000
QCBSNDRQ EQU   QCBSTAT1                                                 00862000
QCBWAITC EQU   QCBSTAT1                                                 00863000
QCBPLCBN EQU   QCBSTAT1                                                 00864000
QCBCHAIN EQU   IEDNQCB                                                  00865000
QCBPQBCK EQU   IEDQPQCB+25                                              00866000
QCBPRIPQ EQU   IEDQPQCB+24                                              00867000
QCBCFHDR EQU   IEDQPQCB+21                                              00868000
QCBLFEFO EQU   IEDQPQCB+18                                              00869000
QCBFFEFO EQU   IEDQPQCB+15                                              00870000
QCBPREVF EQU   QCBINTLF                                                 00871000
QCBINTFF EQU   IEDQPQCB+9                                               00872000
QCBDATSQ EQU   QCBFHDTZ+1                                               00873000
@NM00138 EQU   QCBFHDTZ                                                 00874000
@NM00137 EQU   QCBPFEFO                                                 00875000
QCBDATFL EQU   QCBFHDLZ                                                 00876000
QCBDNHDR EQU   IEDQPQCB                                                 00877000
QCBQBACK EQU   IEDQQCB+37                                               00878000
QCBCKPT  EQU   QCBFLAG                                                  00879000
QCBPROC  EQU   QCBFLAG                                                  00880000
QCBSDFFO EQU   QCBFLAG                                                  00881000
QCBTERMQ EQU   QCBFLAG                                                  00882000
QCBRSRV  EQU   QCBFLAG                                                  00883000
QCBREAD  EQU   QCBFLAG                                                  00884000
QCBNOBRK EQU   QCBFLAG                                                  00885000
QCBTSSES EQU   QCBFLAG                                                  00886000
QCBLGBAD EQU   QCBDCBAD                                                 00887000
QCBRELLN EQU   IEDQQCB+32                                               00888000
QCBTJID  EQU   QCBLKRRN+1                                               00889000
QCBCARCT EQU   QCBLKRRN                                                 00890000
QCBPRLVL EQU   QCBPREN                                                  00891000
QCBMSGCT EQU   IEDQQCB+26                                               00892000
QCBDISC  EQU   QCBTSOF1                                                 00893000
QCBDELAY EQU   QCBTSOF1                                                 00894000
QCBPARTO EQU   QCBTSOF1                                                 00895000
QCBSATRD EQU   QCBTSOF1                                                 00896000
QCBNOBUF EQU   QCBTSOF1                                                 00897000
QCBTPUT  EQU   QCBTSOF1                                                 00898000
QCBTGET  EQU   QCBTSOF1                                                 00899000
QCBWRBRK EQU   QCBTSOF1                                                 00900000
QCBSATLC EQU   QCBTSOF2                                                 00901000
QCBSATTI EQU   QCBTSOF2                                                 00902000
QCBSATCH EQU   QCBTSOF2                                                 00903000
QCBSIMRD EQU   QCBTSOF2                                                 00904000
QCBDSSMI EQU   QCBTSOF2                                                 00905000
QCBPOSTO EQU   QCBTSOF2                                                 00906000
QCBBUFQ  EQU   QCBTSOF2                                                 00907000
QCBINHBN EQU   QCBTSOF2                                                 00908000
QCBSATCT EQU   @NM00136                                                 00909000
QCBSCBOF EQU   IEDQQCB+20                                               00910000
QCBTIME  EQU   QCBSTAT                                                  00911000
QCBCLOCK EQU   QCBSTAT                                                  00912000
QCBSCHDL EQU   QCBSTAT                                                  00913000
QCBSMODE EQU   QCBSTAT                                                  00914000
QCBSEND  EQU   QCBSTAT                                                  00915000
QCBBUFRD EQU   QCBSTAT                                                  00916000
QCBTRMHO EQU   QCBSTAT                                                  00917000
QCBEOM   EQU   QCBSTAT                                                  00918000
QCBHUCT  EQU   QCBRETCT                                                 00919000
QCBIEND  EQU   QCBRETCT                                                 00920000
QCBEND   EQU   QCBRETCT                                                 00921000
QCBNL    EQU   QCBRETCT                                                 00922000
QCBLOGCT EQU   QCBRETCT                                                 00923000
@NM00135 EQU   QCBBYTE1                                                 00924000
QCBRITRM EQU   QCBBYTE1                                                 00925000
@NM00134 EQU   QCBEOLDT                                                 00926000
QCBSLINK EQU   IEDQQCB+13                                               00927000
QCBSTPRI EQU   IEDQQCB+12                                               00928000
QCBSTCHN EQU   IEDQQCB+9                                                00929000
QCBSTVTO EQU   IEDQQCB+8                                                00930000
QCBLINK  EQU   IEDQQCB+5                                                00931000
QCBPRI   EQU   IEDQQCB+4                                                00932000
QCBELCHN EQU   IEDQQCB+1                                                00933000
QCBHELD  EQU   QCBDSFLG                                                 00934000
QCBFQCB  EQU   QCBDSFLG                                                 00935000
QCBALTMH EQU   QCBDSFLG                                                 00936000
QCBREUS  EQU   QCBDISK                                                  00937000
QCBNREUS EQU   QCBDISK                                                  00938000
QCBCORE  EQU   QCBDSFLG                                                 00939000
QCBTSQ   EQU   QCBDSFLG                                                 00940000
TRMSUBST EQU   IEDNTRM+12                                               00941000
TRMTYPE  EQU   IEDNTRM+11                                               00942000
TRMRLMCT EQU   IEDNTRM+10                                               00943000
TRMCOHTG EQU   TRMSIBPT+1                                               00944000
TRMGPCNT EQU   TRMSIBPT                                                 00945000
TRMBUFRD EQU   TRMBYTE0                                                 00946000
TRMSNA   EQU   TRMBYTE0                                                 00947000
TRMGP    EQU   TRMBYTE0                                                 00948000
TRMDIAL  EQU   TRMBYTE0                                                 00949000
@NM00131 EQU   TRMBYTE0                                                 00950000
TRMOUTPT EQU   TRMBYTE0                                                 00951000
TRMINPUT EQU   TRMBYTE0                                                 00952000
TRMUDEF  EQU   TRMBYTE0                                                 00953000
TRMCOHRT EQU   IEDNTRM+4                                                00954000
TRMSTOTE EQU   TRMBYTE1                                                 00955000
TRMCKPRN EQU   TRMBYTE1                                                 00956000
TRMTSATN EQU   TRMBYTE1                                                 00957000
TRMTRACE EQU   TRMBYTE1                                                 00958000
TRMSWBCK EQU   TRMBYTE1                                                 00959000
TRMAUTOC EQU   TRMBYTE1                                                 00960000
TRMINPTP EQU   TRMBYTE1                                                 00961000
TRMWTNEG EQU   TRMSCPRQ                                                 00962000
TRMWRBRK EQU   TRMBYTE2                                                 00963000
TRMNOSND EQU   TRMBYTE2                                                 00964000
TRMPREP  EQU   TRMBYTE2                                                 00965000
TRMGPACT EQU   TRMBYTE2                                                 00966000
TRMANDL  EQU   TRMBYTE2                                                 00967000
TRMCLOSN EQU   TRMINPG                                                  00968000
TRMREMB  EQU   TRMBYTE2                                                 00969000
TRMRSACT EQU   TRMBYTE2                                                 00970000
TRMOPTBL EQU   IEDQTRM+18                                               00971000
TRMSENSE EQU   TRMSTAT+3                                                00972000
TRMTEMPR EQU   TRMSTAT+2                                                00973000
TRMSIO   EQU   TRMSTAT                                                  00974000
@NM00130 EQU   TRMDEVFL+1                                               00975000
TRMTPIN  EQU   TRMDEVFL+1                                               00976000
TRMNCPI  EQU   TRMDEVFL+1                                               00977000
TRMRNTRM EQU   TRMDEVFL+1                                               00978000
@NM00129 EQU   TRMDEVFL+1                                               00979000
TRMLMD   EQU   TRMDEVFL+1                                               00980000
TRMTSOB  EQU   TRMDEVFL                                                 00981000
TRMBFDY  EQU   TRMDEVFL                                                 00982000
TRMTBLK  EQU   TRMDEVFL                                                 00983000
TRMSBLK  EQU   TRMDEVFL                                                 00984000
TRMBLKS  EQU   TRMDEVFL                                                 00985000
TRMADDC  EQU   TRMDEVFL                                                 00986000
TRMDDIG  EQU   TRMDEVFL                                                 00987000
TRMBUFS  EQU   TRMDEVFL                                                 00988000
TRMPRILK EQU   TRMALTD                                                  00989000
TRMLGB   EQU   TRMDSORG                                                 00990000
TRMUTERM EQU   TLISTCNT                                                 00991000
TRMDESTQ EQU   IEDQTRM+1                                                00992000
TRMSCNYN EQU   TRMSTATE                                                 00993000
TRMHELDN EQU   TRMSTATE                                                 00994000
TRMACPTN EQU   TRMSTATE                                                 00995000
TRMPREF  EQU   TRMSTATE                                                 00996000
TRMPROC  EQU   TRMLOG                                                   00997000
TRMLIST  EQU   TRMLOG                                                   00998000
TRMLINE  EQU   TRMSTATE                                                 00999000
@NM00128 EQU   OCLDNME+4                                                01000000
@NM00127 EQU   OCPREFLG                                                 01001000
OCTOTEP  EQU   OCPREFLG                                                 01002000
OCREPOST EQU   OCPREFLG                                                 01003000
OCRSPSNT EQU   OCPREFLG                                                 01004000
OCBFREQ  EQU   OCPREFLG                                                 01005000
OCIDLE   EQU   OCREQFLG                                                 01006000
OCFORCE  EQU   OCREQFLG                                                 01007000
OCDCARD  EQU   OCREQFLG                                                 01008000
OCPARTAL EQU   OCREQFLG                                                 01009000
OCADNCP  EQU   OCREQFLG                                                 01010000
@NM00126 EQU   OCREQFLG                                                 01011000
@NM00125 EQU   OCREQFLG                                                 01012000
OCFLUSHZ EQU   OCREQFLG                                                 01013000
OCRESPCT EQU   OCLINTTE                                                 01014000
OCCKPTWA EQU   OCCKDATA+4                                               01015000
@NM00122 EQU   OCRSTGTM+2                                               01016000
OCCKDAT2 EQU   OCRSTGTM+1                                               01017000
OCCKDAT1 EQU   OCRSTGTM                                                 01018000
OCPTRSAV EQU   OCMODNME+4                                               01019000
OCPUADR  EQU   OCIPLWA+2                                                01020000
OCWTGSAV EQU   OCIPLWA                                                  01021000
OCDVRDCT EQU   OCBACKUP+6                                               01022000
OCNCP    EQU   OCBACKUP+4                                               01023000
OCBUFGOT EQU   OCBACKUP+2                                               01024000
OCBUFNED EQU   OCBACKUP                                                 01025000
OCWTG    EQU   IEDQOPCE+30                                              01026000
OCRESNUM EQU   OCPARM                                                   01027000
OCSEQ    EQU   OCTRUNIT+2                                               01028000
@NM00121 EQU   OCRSID+1                                                 01029000
OCNONE   EQU   OCALSTAT                                                 01030000
OCSOME   EQU   OCALSTAT                                                 01031000
OCALLFLG EQU   OCALSTAT                                                 01032000
OCACTREQ EQU   OCALSTAT                                                 01033000
OCREDRVE EQU   OCALSTAT                                                 01034000
OCSEQIND EQU   OCALSTAT                                                 01035000
@NM00120 EQU   OCALSTAT                                                 01036000
OCRENTRD EQU   OCALSTAT                                                 01037000
OCWTGB   EQU   OCTIOT                                                   01038000
OCTRMTBL EQU   IEDQOPCE+20                                              01039000
@NM00119 EQU   @NM00118+2                                               01040000
OCCONID  EQU   OCDEST                                                   01041000
OCRLN    EQU   IEDQOPCE+15                                              01042000
OCRESP   EQU   OCFLAG                                                   01043000
OCATTACH EQU   OCFLAG                                                   01044000
OCSSCP   EQU   OCFLAG                                                   01045000
OCOUTPUT EQU   OCFLAG                                                   01046000
OCLINE   EQU   OCFLAG                                                   01047000
OCMPP    EQU   OCFLAG                                                   01048000
OCTOTE   EQU   OCFLAG                                                   01049000
OCCONSOL EQU   OCFLAG                                                   01050000
@NM00117 EQU   OCSWITCH                                                 01051000
OCQUCKN  EQU   OCSWITCH                                                 01052000
OCPRIFLG EQU   OCOPTCDE                                                 01053000
@NM00116 EQU   OCRUDEST+1                                               01054000
@NM00115 EQU   OCSCAN                                                   01055000
OCNOTUCB EQU   OCSCAN                                                   01056000
OCNONAME EQU   OCSCAN                                                   01057000
OCALLRLN EQU   OCSCAN                                                   01058000
OCDDNAME EQU   OCSCAN                                                   01059000
OCDDNRLN EQU   OCSCAN                                                   01060000
OCADDR   EQU   OCSCAN                                                   01061000
OCELMPTR EQU   OCELEM+1                                                 01062000
OCELMPRI EQU   OCELEM                                                   01063000
OPCBOTTM EQU   IEDQOPCD+1172                                            01064000
@NM00114 EQU   IEDQOPCD+1088                                            01065000
@NM00113 EQU   IEDQOPCD+936                                             01066000
@NM00112 EQU   IEDQOPCD+928                                             01067000
@NM00111 EQU   IEDQOPCD+368                                             01068000
OPCWAITV EQU   IEDQOPCD+364                                             01069000
OPCTOTCK EQU   IEDQOPCD+360                                             01070000
OPCAPXTL EQU   IEDQOPCD+356                                             01071000
OPCDECR  EQU   IEDQOPCD+352                                             01072000
OPCBUFWT EQU   IEDQOPCD+348                                             01073000
OPCWRKSP EQU   IEDQOPCD+320                                             01074000
OPCADGOT EQU   IEDQOPCD+318                                             01075000
OPCRQCNT EQU   IEDQOPCD+316                                             01076000
OPPOLSTP EQU   IEDQOPCD+312                                             01077000
OPCCKCIB EQU   IEDQOPCD+308                                             01078000
OPCEND   EQU   IEDQOPCD+307                                             01079000
OPCSTCBS EQU   IEDQOPCD+306                                             01080000
OPCHNEND EQU   IEDQOPCD+302                                             01081000
OPCOQSW  EQU   IEDQOPCD+301                                             01082000
@NM00110 EQU   OPCSPEC                                                  01083000
@NM00109 EQU   OPCSPEC                                                  01084000
@NM00108 EQU   OPCSPEC                                                  01085000
@NM00107 EQU   OPCSPEC                                                  01086000
OPCFRMCA EQU   OPCSPEC                                                  01087000
OPCRSTRT EQU   OPCSPEC                                                  01088000
OPCPART  EQU   OPCSPEC                                                  01089000
OPCALTD  EQU   OPCSPEC                                                  01090000
OPCBFEND EQU   IEDQOPCD+296                                             01091000
OPCBFIRS EQU   IEDQOPCD+292                                             01092000
OPCAVBUF EQU   IEDQOPCD+290                                             01093000
@NM00106 EQU   IEDQOPCD+289                                             01094000
OPCCLNTS EQU   IEDQOPCD+288                                             01095000
OPCHA8   EQU   IEDQOPCD+286                                             01096000
OPCBFREQ EQU   IEDQOPCD+284                                             01097000
OPCFREBF EQU   IEDQOPCD+280                                             01098000
OPCGETBF EQU   IEDQOPCD+276                                             01099000
OPCNEXT  EQU   IEDQOPCD+272                                             01100000
OPCFMDFC EQU   IEDQOPCD+268                                             01101000
OPCSCNC  EQU   IEDQOPCD+264                                             01102000
OPCHORTG EQU   IEDQOPCD+260                                             01103000
OPCHORT  EQU   IEDQOPCD+256                                             01104000
OPCCKPTL EQU   IEDQOPCD+252                                             01105000
OPCCKPTF EQU   IEDQOPCD+248                                             01106000
OPCWAITA EQU   IEDQOPCD+244                                             01107000
OPCWAITR EQU   IEDQOPCD+240                                             01108000
OPCWAITP EQU   IEDQOPCD+236                                             01109000
OPCWAITO EQU   IEDQOPCD+232                                             01110000
OPCWAITN EQU   IEDQOPCD+228                                             01111000
OPCWAITL EQU   IEDQOPCD+224                                             01112000
OPCWAITC EQU   IEDQOPCD+220                                             01113000
@NM00105 EQU   OPCLDNME+5                                               01114000
OPCMODID EQU   OPCLDNME+3                                               01115000
@NM00104 EQU   OPCLDNME                                                 01116000
OPCXCTL  EQU   IEDQOPCD+204                                             01117000
OPCWAIT  EQU   IEDQOPCD+192                                             01118000
OPCCKERB EQU   IEDQOPCD+164                                             01119000
OPCBFERB EQU   IEDQOPCD+148                                             01120000
OPCFLAG2 EQU   IEDQOPCD+147                                             01121000
OPCFLAG1 EQU   IEDQOPCD+146                                             01122000
OPCWRKSZ EQU   IEDQOPCD+144                                             01123000
OPCWORK  EQU   IEDQOPCD+140                                             01124000
OPCRSAVE EQU   IEDQOPCD+132                                             01125000
OPCQCBAD EQU   IEDQOPCD+128                                             01126000
OPCTRMWA EQU   IEDQOPCD+52                                              01127000
OPCPSTWT EQU   IEDQOPCD+48                                              01128000
OPCTNTEA EQU   IEDQOPCD+44                                              01129000
OPCPGCK  EQU   IEDQOPCD+40                                              01130000
OPCLCB   EQU   IEDQOPCD+36                                              01131000
@NM00103 EQU   IEDQOPCD+32                                              01132000
OPCIPLAD EQU   IEDQOPCD+28                                              01133000
OPCOPTLK EQU   IEDQOPCD+20                                              01134000
OPCDCBLK EQU   IEDQOPCD+16                                              01135000
OPCAVTPT EQU   IEDQOPCD+8                                               01136000
SAVTBITN EQU   IEDNSVTD+312                                             01137000
@NM00102 EQU   SAVTCKQB+8                                               01138000
@NM00101 EQU   SAVTCKEC+1                                               01139000
@NM00100 EQU   SAVTCKCC                                                 01140000
SAVTCKPO EQU   SAVTCKCC                                                 01141000
SAVTCKWA EQU   SAVTCKCC                                                 01142000
SAVTCKCH EQU   SAVTCKTB+1                                               01143000
SAVTCKVT EQU   SAVTCKTB                                                 01144000
@NM00099 EQU   IEDNSVTD+297                                             01145000
SAVTRDFG EQU   SAVTRDRV+12                                              01146000
@NM00098 EQU   SAVTRDRV+5                                               01147000
SAVTRDPY EQU   SAVTRDRV+4                                               01148000
SAVTRDQB EQU   SAVTRDRV+1                                               01149000
SAVTRDKY EQU   SAVTRDRV                                                 01150000
SAVTNID  EQU   IEDNSVTD+280                                             01151000
SAVTDVAS EQU   IEDNSVTD+276                                             01152000
SAVTPLSZ EQU   IEDNSVTD+274                                             01153000
@NM00097 EQU   IEDNSVTD+273                                             01154000
SAVTSUBL EQU   IEDNSVTD+272                                             01155000
@NM00096 EQU   SAVTZELM+1                                               01156000
SAVTSUBM EQU   SAVTZELM                                                 01157000
SAVTMHDX EQU   IEDNSVTD+268                                             01158000
SAVTNAT1 EQU   IEDNSVTD+266                                             01159000
SAVTSH20 EQU   IEDNSVTD+264                                             01160000
SAVTLCBS EQU   IEDNSVTD+260                                             01161000
SAVTRNMP EQU   IEDNSVTD+256                                             01162000
SAVTTNTX EQU   IEDNSVTD+252                                             01163000
SAVTNAX  EQU   IEDNSVTD+248                                             01164000
SAVTSUBV EQU   IEDNSVTD+247                                             01165000
SAVTSUBA EQU   IEDNSVTD+246                                             01166000
SAVTSIBC EQU   IEDNSVTD+244                                             01167000
SAVTBSM  EQU   IEDNSVTD+240                                             01168000
SAVTSCPT EQU   SAVTTCPU                                                 01169000
SAVTRQTG EQU   IEDNSVTD+236                                             01170000
SAVTRQCH EQU   IEDNSVTD+232                                             01171000
SAVTMAND EQU   IEDNSVTD+228                                             01172000
SAVTSPLN EQU   IEDNSVTD+224                                             01173000
SAVTNADL EQU   IEDNSVTD+222                                             01174000
SAVTNATL EQU   IEDNSVTD+220                                             01175000
SAVTMHTB EQU   IEDNSVTD+216                                             01176000
SAVTSSMH EQU   IEDNSVTD+212                                             01177000
SAVTQRS  EQU   IEDNSVTD+208                                             01178000
SAVTRQIN EQU   IEDNSVTD+204                                             01179000
SAVTDFCO EQU   IEDNSVTD+200                                             01180000
SAVTSAO  EQU   IEDNSVTD+196                                             01181000
SAVTSARI EQU   IEDNSVTD+192                                             01182000
SAVTSAC  EQU   IEDNSVTD+188                                             01183000
SAVTSAI  EQU   IEDNSVTD+184                                             01184000
SAVTCSCI EQU   IEDNSVTD+180                                             01185000
SAVTSSRP EQU   IEDNSVTD+176                                             01186000
SAVTSSRQ EQU   IEDNSVTD+172                                             01187000
SAVTSCLU EQU   IEDNSVTD+168                                             01188000
SAVTXTRQ EQU   IEDNSVTD+164                                             01189000
SAVTMVBF EQU   IEDNSVTD+160                                             01190000
@NM00095 EQU   IEDNSVTD+148                                             01191000
SAVTIPCQ EQU   IEDNSVTD+144                                             01192000
@NM00094 EQU   IEDNSVTD+136                                             01193000
SAVTXFMI EQU   IEDNSVTD+132                                             01194000
@NM00093 EQU   IEDNSVTD+124                                             01195000
SAVTXFMO EQU   IEDNSVTD+120                                             01196000
@NM00092 EQU   IEDNSVTD+116                                             01197000
SAVTSSSR EQU   IEDNSVTD+112                                             01198000
SAVTSCPQ EQU   IEDNSVTD+108                                             01199000
SAVTSLCB EQU   IEDNSVTD+104                                             01200000
SAVTLUSR EQU   IEDNSVTD+100                                             01201000
@NM00091 EQU   SAVTLUSQ+8                                               01202000
SAVTLUSP EQU   SAVTLUSQ+4                                               01203000
SAVTLUSB EQU   SAVTLUSQ                                                 01204000
@NM00090 EQU   IEDNSVTD+84                                              01205000
SAVTSAT  EQU   IEDNSVTD+80                                              01206000
SAVTNAT  EQU   IEDNSVTD+76                                              01207000
SAVTCLUP EQU   IEDNSVTD+72                                              01208000
SAVTPIUT EQU   IEDNSVTD+68                                              01209000
SAVTRNTA EQU   IEDNSVTD+64                                              01210000
SAVTDNIR EQU   IEDNSVTD+60                                              01211000
SAVTCNIR EQU   IEDNSVTD+56                                              01212000
SAVTFLDH EQU   IEDNSVTD+52                                              01213000
SAVTSRTN EQU   IEDNSVTD+48                                              01214000
SAVTSREQ EQU   IEDNSVTD+44                                              01215000
SAVTFAIL EQU   IEDNSVTD+42                                              01216000
SAVTSUSE EQU   IEDNSVTD+40                                              01217000
SAVTSIB  EQU   IEDNSVTD+36                                              01218000
SAVTPRTN EQU   IEDNSVTD+32                                              01219000
@NM00089 EQU   IEDNSVTD+28                                              01220000
SAVTWH20 EQU   IEDNSVTD+26                                              01221000
SAVTPWT  EQU   IEDNSVTD+24                                              01222000
SAVTPRTQ EQU   IEDNSVTD+20                                              01223000
SAVTPREQ EQU   IEDNSVTD+16                                              01224000
SAVTPH20 EQU   IEDNSVTD+14                                              01225000
SAVTPUSE EQU   IEDNSVTD+12                                              01226000
SAVTPLCB EQU   IEDNSVTD+8                                               01227000
SAVTPOOL EQU   IEDNSVTD+4                                               01228000
SAVTPRMT EQU   SAVTDIAF                                                 01229000
SAVTVIRT EQU   SAVTDIAF                                                 01230000
AVTCPBNO EQU   IEDQAVTD+1244                                            01231000
AVTHRESS EQU   IEDQAVTD+1243                                            01232000
@NM00088 EQU   IEDQAVTD+1242                                            01233000
@NM00087 EQU   IEDQAVTD+1241                                            01234000
@NM00086 EQU   IEDQAVTD+1240                                            01235000
@NM00085 EQU   IEDQAVTD+1237                                            01236000
@NM00084 EQU   IEDQAVTD+1236                                            01237000
AVTHRESE EQU   @NM00083                                                 01238000
AVTRADDR EQU   IEDQAVTD+1228                                            01239000
AVTNADDR EQU   IEDQAVTD+1224                                            01240000
AVTHRESN EQU   IEDQAVTD+1220                                            01241000
AVTVOLRN EQU   IEDQAVTD+1216                                            01242000
AVTTOTNN EQU   IEDQAVTD+1212                                            01243000
AVTTRCYN EQU   IEDQAVTD+1208                                            01244000
AVTRCTRN EQU   IEDQAVTD+1204                                            01245000
AVTNOVON EQU   IEDQAVTD+1200                                            01246000
AVTADEBN EQU   IEDQAVTD+1196                                            01247000
AVTVOLRR EQU   IEDQAVTD+1192                                            01248000
AVTTOTNR EQU   IEDQAVTD+1188                                            01249000
AVTTRCYR EQU   IEDQAVTD+1184                                            01250000
AVTRCTRR EQU   IEDQAVTD+1180                                            01251000
AVTNOVOR EQU   IEDQAVTD+1176                                            01252000
AVTADEBR EQU   IEDQAVTD+1172                                            01253000
AVTLODPT EQU   IEDQAVTD+1168                                            01254000
AVTIOBN  EQU   IEDQAVTD+1164                                            01255000
AVTIOBR  EQU   IEDQAVTD+1160                                            01256000
AVTCPBPT EQU   IEDQAVTD+1156                                            01257000
AVTFCPB  EQU   IEDQAVTD+1152                                            01258000
@NM00082 EQU   IEDQAVTD+1148                                            01259000
AVTINCPQ EQU   IEDQAVTD+1144                                            01260000
@NM00081 EQU   IEDQAVTD+1140                                            01261000
@NM00080 EQU   IEDQAVTD+1137                                            01262000
@NM00079 EQU   AVTBIT4                                                  01263000
@NM00078 EQU   AVTBIT4                                                  01264000
@NM00077 EQU   AVTBIT4                                                  01265000
@NM00076 EQU   AVTBIT4                                                  01266000
@NM00075 EQU   AVTBIT4                                                  01267000
@NM00074 EQU   AVTBIT4                                                  01268000
@NM00073 EQU   AVTBIT4                                                  01269000
AVTRUFTN EQU   AVTBIT4                                                  01270000
@NM00072 EQU   IEDQAVTD+1132                                            01271000
AVTNOBFQ EQU   IEDQAVTD+1128                                            01272000
@NM00071 EQU   IEDQAVTD+1124                                            01273000
AVTDKENQ EQU   IEDQAVTD+1120                                            01274000
@NM00070 EQU   IEDQAVTD+1116                                            01275000
AVTDKAPQ EQU   IEDQAVTD+1112                                            01276000
AVTCOPY  EQU   IEDQAVTD+1108                                            01277000
AVTIA    EQU   IEDQAVTD+1104                                            01278000
AVTFL    EQU   IEDQAVTD+1100                                            01279000
@NM00069 EQU   IEDQAVTD+1096                                            01280000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01281000
AVTTOTNC EQU   IEDQAVTD+1088                                            01282000
AVTCMAX  EQU   IEDQAVTD+1084                                            01283000
AVTCMIN  EQU   IEDQAVTD+1080                                            01284000
AVTHM02  EQU   IEDQAVTD+1076                                            01285000
AVTOPCIN EQU   IEDQAVTD+1074                                            01286000
AVTOPMSK EQU   IEDQAVTD+1068                                            01287000
AVTDDFT  EQU   IEDQAVTD+1064                                            01288000
AVTSTEAL EQU   IEDQAVTD+1060                                            01289000
AVTOPTN  EQU   IEDQAVTD+1056                                            01290000
AVTDSKCT EQU   IEDQAVTD+1054                                            01291000
AVTCKRST EQU   IEDQAVTD+1053                                            01292000
AVTSTAN  EQU   AVTBIT3                                                  01293000
AVTSTACN EQU   AVTBIT3                                                  01294000
AVTSTAIN EQU   AVTBIT3                                                  01295000
AVTSTAYN EQU   AVTBIT3                                                  01296000
AVTOLTBN EQU   AVTBIT3                                                  01297000
AVTTSAB  EQU   AVTBIT3                                                  01298000
AVTRFULN EQU   AVTBIT3                                                  01299000
AVTRECVN EQU   AVTBIT3                                                  01300000
@NM00068 EQU   AVTBIT2                                                  01301000
@NM00067 EQU   AVTBIT2                                                  01302000
AVTOPEIN EQU   AVTBIT2                                                  01303000
AVTSTRTN EQU   AVTBIT2                                                  01304000
AVTTOPOL EQU   AVTBIT2                                                  01305000
AVTCOPYN EQU   AVTBIT2                                                  01306000
AVTREUSN EQU   AVTBIT2                                                  01307000
AVTEXTSC EQU   AVTBIT2                                                  01308000
AVTDISKN EQU   AVTBIT1                                                  01309000
AVTQUCKN EQU   AVTBIT1                                                  01310000
AVTCLOSN EQU   AVTBIT1                                                  01311000
AVTREADN EQU   AVTBIT1                                                  01312000
AVTDLAYN EQU   AVTBIT1                                                  01313000
AVTAQTAN EQU   AVTBIT1                                                  01314000
AVTTSON  EQU   AVTBIT1                                                  01315000
AVTAPLKN EQU   AVTBIT1                                                  01316000
AVTDUMBR EQU   IEDQAVTD+1048                                            01317000
AVTDLQX  EQU   IEDQAVTD+1046                                            01318000
AVTINTLV EQU   IEDQAVTD+1044                                            01319000
AVTSMCNT EQU   IEDQAVTD+1042                                            01320000
AVTAVFCT EQU   IEDQAVTD+1040                                            01321000
AVTOPCON EQU   IEDQAVTD+1038                                            01322000
AVTOPCNT EQU   IEDQAVTD+1036                                            01323000
AVTLNCNT EQU   IEDQAVTD+1034                                            01324000
AVTKEYLE EQU   IEDQAVTD+1032                                            01325000
AVTHA16  EQU   IEDQAVTD+1030                                            01326000
AVTHA7   EQU   IEDQAVTD+1028                                            01327000
AVTHA4   EQU   IEDQAVTD+1026                                            01328000
AVTHA3   EQU   IEDQAVTD+1024                                            01329000
AVTHA2   EQU   IEDQAVTD+1022                                            01330000
AVTGETMS EQU   IEDQAVTD+1021                                            01331000
@NM00066 EQU   IEDQAVTD+1020                                            01332000
AVTGETMD EQU   IEDQAVTD+1016                                            01333000
AVTGETMN EQU   IEDQAVTD+1012                                            01334000
AVTCWTOT EQU   IEDQAVTD+1008                                            01335000
AVTCWINT EQU   IEDQAVTD+956                                             01336000
AVTDTRAP EQU   IEDQAVTD+952                                             01337000
@NM00065 EQU   IEDQAVTD+950                                             01338000
@NM00064 EQU   AVTIOTR                                                  01339000
AVTIOTRH EQU   AVTIOTR                                                  01340000
AVTIOTRE EQU   AVTIOTR                                                  01341000
@NM00063 EQU   AVTSUBT                                                  01342000
AVTSUBPT EQU   AVTSUBT                                                  01343000
AVTSUBON EQU   AVTSUBT                                                  01344000
AVTAFE30 EQU   IEDQAVTD+944                                             01345000
AVTAFE20 EQU   IEDQAVTD+940                                             01346000
AVTAFE10 EQU   IEDQAVTD+936                                             01347000
AVTCWEC2 EQU   IEDQAVTD+932                                             01348000
AVTCWPM2 EQU   IEDQAVTD+928                                             01349000
AVTCWTS2 EQU   IEDQAVTD+927                                             01350000
AVTCWTS1 EQU   IEDQAVTD+926                                             01351000
AVTCWCLD EQU   AVTCWFL2                                                 01352000
AVTCWRAP EQU   AVTCWFL2                                                 01353000
@NM00062 EQU   AVTCWFL2                                                 01354000
@NM00061 EQU   AVTCWFL2                                                 01355000
@NM00060 EQU   AVTCWFL2                                                 01356000
@NM00059 EQU   AVTCWFL2                                                 01357000
@NM00058 EQU   AVTCWFL2                                                 01358000
AVTCWACT EQU   AVTCWFL2                                                 01359000
@NM00057 EQU   AVTCWFL1                                                 01360000
@NM00056 EQU   AVTCWFL1                                                 01361000
@NM00055 EQU   AVTCWFL1                                                 01362000
@NM00054 EQU   AVTCWFL1                                                 01363000
@NM00053 EQU   AVTCWFL1                                                 01364000
@NM00052 EQU   AVTCWFL1                                                 01365000
@NM00051 EQU   AVTCWFL1                                                 01366000
AVTCOMWN EQU   AVTCWFL1                                                 01367000
AVTCWEC1 EQU   IEDQAVTD+920                                             01368000
AVTCWPM1 EQU   IEDQAVTD+916                                             01369000
AVTCAREA EQU   IEDQAVTD+912                                             01370000
AVTFZERO EQU   IEDQAVTD+908                                             01371000
AVTCADDR EQU   IEDQAVTD+904                                             01372000
AVTCOREC EQU   IEDQAVTD+900                                             01373000
@NM00050 EQU   IEDQAVTD+892                                             01374000
AVTCPBCB EQU   IEDQAVTD+888                                             01375000
@NM00049 EQU   IEDQAVTD+880                                             01376000
AVTDSIOB EQU   IEDQAVTD+876                                             01377000
@NM00048 EQU   IEDQAVTD+868                                             01378000
AVTCPRMB EQU   IEDQAVTD+864                                             01379000
@NM00047 EQU   IEDQAVTD+856                                             01380000
AVTCLOSB EQU   IEDQAVTD+852                                             01381000
@NM00046 EQU   IEDQAVTD+844                                             01382000
AVTACTIB EQU   IEDQAVTD+840                                             01383000
@NM00045 EQU   IEDQAVTD+836                                             01384000
AVTOLTEB EQU   IEDQAVTD+832                                             01385000
AVTOLTCH EQU   AVTOLTQB+1                                               01386000
AVTOLTVT EQU   AVTOLTQB                                                 01387000
@NM00044 EQU   AVTOPCQB+8                                               01388000
@NM00043 EQU   AVTOPCEC+1                                               01389000
@NM00042 EQU   AVTOPCCC                                                 01390000
AVTOPCPO EQU   AVTOPCCC                                                 01391000
AVTOPCWA EQU   AVTOPCCC                                                 01392000
AVTOPCCH EQU   AVTOPCOB+1                                               01393000
AVTOPCVT EQU   AVTOPCOB                                                 01394000
@NM00041 EQU   AVTCKPQB+9                                               01395000
AVTCKPTS EQU   AVTCKPQB+8                                               01396000
@NM00040 EQU   AVTCKPEC+1                                               01397000
@NM00039 EQU   AVTCKPCC                                                 01398000
AVTCKPPO EQU   AVTCKPCC                                                 01399000
AVTCKPWA EQU   AVTCKPCC                                                 01400000
AVTCKPCH EQU   AVTCKPTB+1                                               01401000
AVTCKPVT EQU   AVTCKPTB                                                 01402000
@NM00038 EQU   IEDQAVTD+796                                             01403000
AVTBFRTB EQU   IEDQAVTD+792                                             01404000
@NM00037 EQU   IEDQAVTD+784                                             01405000
AVTBFREB EQU   IEDQAVTD+780                                             01406000
AVTTIMQ  EQU   IEDQAVTD+776                                             01407000
@NM00036 EQU   IEDQAVTD+772                                             01408000
AVTIMQPS EQU   IEDQAVTD+768                                             01409000
AVTINOUT EQU   IEDQAVTD+766                                             01410000
AVTREFTM EQU   IEDQAVTD+764                                             01411000
@NM00035 EQU   IEDQAVTD+752                                             01412000
AVTDELYB EQU   IEDQAVTD+748                                             01413000
AVTOCQPT EQU   IEDQAVTD+744                                             01414000
AVTTSOPT EQU   IEDQAVTD+740                                             01415000
AVTSUPPT EQU   IEDQAVTD+736                                             01416000
AVTCBQCB EQU   IEDQAVTD+732                                             01417000
AVTMSGS  EQU   IEDQAVTD+729                                             01418000
@NM00034 EQU   AVTSYSER                                                 01419000
@NM00033 EQU   AVTSYSER                                                 01420000
@NM00032 EQU   AVTSYSER                                                 01421000
@NM00031 EQU   AVTSYSER                                                 01422000
@NM00030 EQU   AVTSYSER                                                 01423000
@NM00029 EQU   AVTSYSER                                                 01424000
AVTCMAXN EQU   AVTSYSER                                                 01425000
AVTCMINN EQU   AVTSYSER                                                 01426000
AVT2260L EQU   IEDQAVTD+724                                             01427000
AVTABEPL EQU   AVTADBUF                                                 01428000
AVTHFF   EQU   AVTCLRHI+2                                               01429000
@NM00028 EQU   AVTCLRHI                                                 01430000
AVTCCLNK EQU   AVTCRELE+5                                               01431000
AVTCCPRI EQU   AVTCRELE+4                                               01432000
AVTCCQCB EQU   AVTCCELE+1                                               01433000
AVTCCKEY EQU   AVTCCELE                                                 01434000
AVTDELAD EQU   IEDQAVTD+704                                             01435000
AVTDELEM EQU   IEDQAVTD+700                                             01436000
AVTBSX   EQU   AVTCKLNK                                                 01437000
AVTOPETR EQU   AVTHG01                                                  01438000
@NM00027 EQU   AVTCKBYT                                                 01439000
AVTCKONQ EQU   AVTCKBYT                                                 01440000
@NM00026 EQU   AVTCKBYT                                                 01441000
@NM00025 EQU   AVTCKBYT                                                 01442000
@NM00024 EQU   AVTCKBYT                                                 01443000
@NM00023 EQU   AVTCKBYT                                                 01444000
@NM00022 EQU   AVTCKBYT                                                 01445000
@NM00021 EQU   AVTCKBYT                                                 01446000
AVTOPERT EQU   IEDQAVTD+690                                             01447000
AVTOPXCL EQU   IEDQAVTD+688                                             01448000
AVTOPERL EQU   IEDQAVTD+687                                             01449000
@NM00020 EQU   IEDQAVTD+686                                             01450000
AVTCKTIM EQU   IEDQAVTD+684                                             01451000
AVTCKELV EQU   IEDQAVTD+682                                             01452000
AVTCPRCD EQU   IEDQAVTD+681                                             01453000
AVTWARMN EQU   AVTCKELF                                                 01454000
AVTCRTLN EQU   AVTCKELF                                                 01455000
AVTCPIPN EQU   AVTCKELF                                                 01456000
AVTCCLCN EQU   AVTCKELF                                                 01457000
AVTCINCN EQU   AVTCKELF                                                 01458000
@NM00019 EQU   AVTCKELF                                                 01459000
AVTCMCPN EQU   AVTCKELF                                                 01460000
AVTCRDYN EQU   AVTCKELF                                                 01461000
AVTCKQAD EQU   IEDQAVTD+677                                             01462000
AVTSCBSZ EQU   IEDQAVTD+676                                             01463000
@NM00018 EQU   IEDQAVTD+672                                             01464000
AVTCKELE EQU   IEDQAVTD+668                                             01465000
@NM00017 EQU   AVTCKPEL+8                                               01466000
AVTCKRLK EQU   AVTCKPEL+5                                               01467000
AVTCKRPR EQU   AVTCKPEL+4                                               01468000
AVTCKRMQ EQU   AVTCKRMV+1                                               01469000
AVTCKRKY EQU   AVTCKRMV                                                 01470000
AVTHK    EQU   IEDQAVTD+648                                             01471000
AVTHI    EQU   IEDQAVTD+644                                             01472000
AVTIOT   EQU   IEDQAVTD+640                                             01473000
AVTNX    EQU   IEDQAVTD+636                                             01474000
AVTTONE  EQU   IEDQAVTD+632                                             01475000
AVTA3TL  EQU   IEDQAVTD+628                                             01476000
AVTDMECB EQU   IEDQAVTD+624                                             01477000
AVTABEND EQU   IEDQAVTD+618                                             01478000
AVTPLCBN EQU   IEDQAVTD+616                                             01479000
@NM00016 EQU   AVTSAVTP+1                                               01480000
@NM00015 EQU   AVTSAVTF                                                 01481000
AVTSNA   EQU   AVTSAVTF                                                 01482000
AVTONSNA EQU   AVTSAVTF                                                 01483000
AVTVTMCP EQU   AVTSAVTF                                                 01484000
@NM00014 EQU   IEDQAVTD+608                                             01485000
AVTCMBSS EQU   IEDQAVTD+604                                             01486000
AVTRCV   EQU   IEDQAVTD+600                                             01487000
AVTSEND  EQU   IEDQAVTD+596                                             01488000
AVTCSCH  EQU   IEDQAVTD+592                                             01489000
AVTQ1    EQU   IEDQAVTD+588                                             01490000
AVTE7    EQU   IEDQAVTD+584                                             01491000
AVTHB    EQU   IEDQAVTD+580                                             01492000
AVTR1    EQU   IEDQAVTD+576                                             01493000
AVTBZ    EQU   IEDQAVTD+572                                             01494000
AVTEZ    EQU   IEDQAVTD+568                                             01495000
AVTEC    EQU   IEDQAVTD+564                                             01496000
AVTEW    EQU   IEDQAVTD+560                                             01497000
AVTNDIAL EQU   AVTSCOPT                                                 01498000
AVTN2741 EQU   AVTSCOPT                                                 01499000
AVTCONCO EQU   AVTSCOPT                                                 01500000
AVTCONC  EQU   AVTSCOPT                                                 01501000
AVTCMBUF EQU   AVTSCOPT                                                 01502000
AVTAPDMP EQU   AVTSCOPT                                                 01503000
@NM00013 EQU   AVTSCOPT                                                 01504000
AVTHA    EQU   AVTDISP                                                  01505000
AVTEA    EQU   IEDQAVTD+548                                             01506000
AVTAX    EQU   IEDQAVTD+544                                             01507000
AVTA3    EQU   IEDQAVTD+540                                             01508000
AVTGD    EQU   IEDQAVTD+536                                             01509000
AVTAL    EQU   IEDQAVTD+532                                             01510000
AVTOLTST EQU   AVTHG02                                                  01511000
AVTE8    EQU   IEDQAVTD+524                                             01512000
AVTUI    EQU   IEDQAVTD+520                                             01513000
AVTCOMPT EQU   IEDQAVTD+516                                             01514000
AVTCRSRF EQU   IEDQAVTD+512                                             01515000
@NM00012 EQU   IEDQAVTD+508                                             01516000
AVTKA02  EQU   IEDQAVTD+504                                             01517000
AVTOPTPT EQU   IEDQAVTD+500                                             01518000
AVTPCBPT EQU   IEDQAVTD+496                                             01519000
AVTOSECB EQU   IEDQAVTD+492                                             01520000
AVTOPECA EQU   IEDQAVTD+488                                             01521000
AVTOLECA EQU   IEDQAVTD+484                                             01522000
AVTCKECA EQU   IEDQAVTD+480                                             01523000
AVTCWECA EQU   IEDQAVTD+476                                             01524000
AVTCWTCB EQU   IEDQAVTD+472                                             01525000
AVTOLTCB EQU   IEDQAVTD+468                                             01526000
AVTOCTCB EQU   IEDQAVTD+464                                             01527000
AVTCKTCB EQU   IEDQAVTD+460                                             01528000
AVTAS    EQU   IEDQAVTD+456                                             01529000
AVTNOLBF EQU   IEDQAVTD+454                                             01530000
AVTNCKPR EQU   IEDQAVTD+453                                             01531000
AVTCIB   EQU   IEDQAVTD+452                                             01532000
AVTSPLPT EQU   IEDQAVTD+448                                             01533000
AVTMVBFR EQU   IEDQAVTD+444                                             01534000
AVTSBTA  EQU   IEDQAVTD+440                                             01535000
AVTRARTN EQU   IEDQAVTD+436                                             01536000
AVTBSCAN EQU   IEDQAVTD+432                                             01537000
AVTRDYA  EQU   IEDQAVTD+428                                             01538000
AVTRNMPT EQU   IEDQAVTD+424                                             01539000
AVTDISTR EQU   IEDQAVTD+420                                             01540000
AVTPARM3 EQU   IEDQAVTD+416                                             01541000
@NM00011 EQU   AVTPKF                                                   01542000
@NM00010 EQU   AVTPKF                                                   01543000
@NM00009 EQU   AVTPKF                                                   01544000
AVTFTCHF EQU   AVTPKF                                                   01545000
@NM00008 EQU   AVTPKF                                                   01546000
@NM00007 EQU   AVTPKF                                                   01547000
@NM00006 EQU   AVTPKF                                                   01548000
@NM00005 EQU   AVTPKF                                                   01549000
AVTPARM  EQU   IEDQAVTD+408                                             01550000
AVTEXS2A EQU   IEDQAVTD+402                                             01551000
AVTEXA2S EQU   IEDQAVTD+396                                             01552000
AVTOCGET EQU   IEDQAVTD+392                                             01553000
AVTCKAVT EQU   @NM00003+1                                               01554000
@NM00004 EQU   AVTCKFLG                                                 01555000
AVTCKHLT EQU   AVTCKFLG                                                 01556000
AVTCKREQ EQU   AVTCKFLG                                                 01557000
AVTCKENV EQU   AVTCKFLG                                                 01558000
AVTCKNAC EQU   AVTCKFLG                                                 01559000
AVTCKTAC EQU   AVTCKFLG                                                 01560000
@NM00002 EQU   IEDQAVTD+384                                             01561000
AVTREADD EQU   IEDQAVTD+380                                             01562000
AVTREADY EQU   IEDQAVTD+376                                             01563000
AVTRACE  EQU   IEDQAVTD+372                                             01564000
AVTTCB   EQU   IEDQAVTD+368                                             01565000
AVTPASWD EQU   IEDQAVTD+360                                             01566000
AVTCTLCH EQU   IEDQAVTD+352                                             01567000
AVTDOUBL EQU   IEDQAVTD+344                                             01568000
AVTDOUBX EQU   IEDQAVTD+336                                             01569000
AVTDPARM EQU   IEDQAVTD+332                                             01570000
AVTDLQ   EQU   AVTSAVEX+32                                              01571000
@NM00001 EQU   AVTSAVEX                                                 01572000
AVTSAVE4 EQU   IEDQAVTD+216                                             01573000
AVTSAVE3 EQU   IEDQAVTD+144                                             01574000
AVTSAVE2 EQU   IEDQAVTD+72                                              01575000
AVTSAVE1 EQU   IEDQAVTD                                                 01576000
*                                      END UNREFERENCED COMPONENTS      01577000
@PB00004 EQU   @EL00001                                                 01578000
@PB00003 EQU   @PB00004                                                 01579000
@PB00002 EQU   @PB00003                                                 01580000
@EL01    EQU   @EL00001                                                 01581000
@ENDDATA EQU   *                                                        01582000
@DATEND  EQU   *                                                        01583000
         END   IGCMR10D,(C'PLS2121',0701,77007)                         01584000
