         TITLE 'IGCT110D - TCHNG, TCOPY SERVICE ROUTINE                *00001000
                        '                                               00002000
IGCT110D CSECT ,                                                   0001 00003000
@PROLOG  BALR  @11,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@11                                         0001 00006000
IGCT110D  IEDHJN  AFTERHJN,HJN     MODULE IDENTIFICATION                00007000
*   ROPCAVT=REG1;                   /* ADDR OF OP CNTRL AVT  @Y17XARW*/ 00008000
         LR    ROPCAVT,REG1                                        0244 00009000
*   AVT=OPCAVTPT;                   /* ADDRESS OF AVT        @Y17XARW*/ 00010000
         L     AVT,OPCAVTPT(,ROPCAVT)                              0245 00011000
*   ELMNT=OCCIB;                    /* ADDR OF PARAM LIST    @Y17XARW*/ 00012000
         L     @10,OPCCOPCE(,ROPCAVT)                              0246 00013000
         L     @10,OCCIB-1(,@10)                                   0246 00014000
         LA    @10,0(,@10)                                         0246 00015000
         ST    @10,ELMNT(,ROPCAVT)                                 0246 00016000
*   IF ELMNT->WENTCD>='08'X         /* IS THIS FOR TCHNG     @YM08051*/ 00017000
*     THEN                                                         0247 00018000
         CLI   WENTCD(@10),8                                       0247 00019000
         BL    @RF00247                                            0247 00020000
*     TCHNG='1'B;                   /* PRESERVE TCHNG INDIC  @YM08051*/ 00021000
         OI    TCHNG(ROPCAVT),B'01000000'                          0248 00022000
*   ELSE                                                           0249 00023000
*     TCHNG='0'B;                   /* INDIC NOT TCHNG       @YM08051*/ 00024000
         B     @RC00247                                            0249 00025000
@RF00247 NI    TCHNG(ROPCAVT),B'10111111'                          0249 00026000
*   RPRU=OCUNIT;                    /* ADDR OF RESPONSE UNIT @Y17XARW*/ 00027000
@RC00247 L     @10,OPCCOPCE(,ROPCAVT)                              0250 00028000
         L     RPRU,OCUNIT(,@10)                                   0250 00029000
*   ENDUNIT=RPRU+12+AVTKEYLE;       /* SETUP END OF UNIT ADDR      0251 00030000
*                                                            @Y17XARW*/ 00031000
         LA    @10,12                                              0251 00032000
         LR    @03,RPRU                                            0251 00033000
         ALR   @03,@10                                             0251 00034000
         AH    @03,AVTKEYLE(,AVT)                                  0251 00035000
         ST    @03,ENDUNIT(,ROPCAVT)                               0251 00036000
*   IF BDUSYRSP^='60'X|             /* IS BTU RESPONSE GOOD  @Y17XARW*/ 00037000
*       PRURHSDI='1'B THEN                                         0252 00038000
         ALR   @10,IEDPRUQP                                        0252 00039000
         CLI   BDUSYRSP(@10),X'60'                                 0252 00040000
         BNE   @RT00252                                            0252 00041000
         LR    @10,IEDPRUQP                                        0252 00042000
         AL    @10,@CF01538                                        0252 00043000
         TM    PRURHSDI(@10),B'00000100'                           0252 00044000
         BNO   @RF00252                                            0252 00045000
@RT00252 DS    0H                                                  0253 00046000
*     DO;                           /* NO,                           */ 00047000
*       ELMNT->WRTCD='1C'X;         /* SET RETURN CODE               */ 00048000
         L     @10,ELMNT(,ROPCAVT)                                 0254 00049000
         MVI   WRTCD(@10),X'1C'                                    0254 00050000
*       GO TO POSTAPP1;             /* TELL APPLICATION PROGRAM      */ 00051000
         B     POSTAPP1                                            0255 00052000
*     END;                                                         0256 00053000
*   RDATA=ADDR(IEDBDU)+LENGTH(IEDBDU)+3;/* POINT TO POLLING CHARS  0257 00054000
*                                                            @Y17XARW*/ 00055000
@RF00252 LA    @10,21                                              0257 00056000
         ALR   @10,IEDPRUQP                                        0257 00057000
         STCM  @10,7,RDATA(ROPCAVT)                                0257 00058000
*   RWORK=RPRU;                     /* SETUP TEMP PTR TO RU  @Y17XARW*/ 00059000
         LR    RWORK,RPRU                                          0258 00060000
*   GENERATE;                                                      0259 00061000
         BAL   REG12,CHKUNIT       /* CHECK END OF UNIT EXCEEDED     */ 00062000
*   RDATA=RDATA+RDATA->FCOUNT+1;    /* POINT TO ADDRESSING CHARS     */ 00063000
         L     @10,RDATA-1(,ROPCAVT)                               0260 00064000
         LA    @10,0(,@10)                                         0260 00065000
         SLR   @03,@03                                             0260 00066000
         IC    @03,FCOUNT(,@10)                                    0260 00067000
         ALR   @03,@10                                             0260 00068000
         AL    @03,@CF00083                                        0260 00069000
         STCM  @03,7,RDATA(ROPCAVT)                                0260 00070000
*   GENERATE;                                                      0261 00071000
         BAL   REG12,CHKUNIT       /* CHECK END OF UNIT EXCEEDED     */ 00072000
*   ADDRCHR=RDATA;                  /* SAVE ADDRESS OF ADDR CHARS    */ 00073000
         L     @10,OPCWORK(,ROPCAVT)                               0262 00074000
         L     @03,RDATA-1(,ROPCAVT)                               0262 00075000
         LA    @03,0(,@03)                                         0262 00076000
         ST    @03,ADDRCHR(,@10)                                   0262 00077000
*   RDATA=RDATA+RDATA->FCOUNT+1;    /* POINT TO INPUT IDENTIFIER     */ 00078000
         SLR   @10,@10                                             0263 00079000
         IC    @10,FCOUNT(,@03)                                    0263 00080000
         ALR   @10,@03                                             0263 00081000
         AL    @10,@CF00083                                        0263 00082000
         STCM  @10,7,RDATA(ROPCAVT)                                0263 00083000
*   GENERATE;                                                      0264 00084000
         BAL   REG12,CHKUNIT       /* CHECK END OF UNIT EXCEEDED     */ 00085000
*   IF RDATA->FCOUNT=0              /* IS INPUT IDENTIFIER PRESENT   */ 00086000
*     THEN                                                         0265 00087000
         L     @10,RDATA-1(,ROPCAVT)                               0265 00088000
         LA    @10,0(,@10)                                         0265 00089000
         CLI   FCOUNT(@10),0                                       0265 00090000
         BNE   @RF00265                                            0265 00091000
*     RDATA=RDATA+1;                /* NO, SKIP ID BYTE              */ 00092000
         AL    @10,@CF00083                                        0266 00093000
         STCM  @10,7,RDATA(ROPCAVT)                                0266 00094000
*   ELSE                                                           0267 00095000
*     RDATA=RDATA+4;                /* YES, SKIP NEXT THREE FIELDS   */ 00096000
         B     @RC00265                                            0267 00097000
@RF00265 LA    @10,4                                               0267 00098000
         L     @03,RDATA-1(,ROPCAVT)                               0267 00099000
         LA    @03,0(,@03)                                         0267 00100000
         ALR   @10,@03                                             0267 00101000
         STCM  @10,7,RDATA(ROPCAVT)                                0267 00102000
*   GENERATE;                                                      0268 00103000
@RC00265 DS    0H                                                  0268 00104000
         BAL   REG12,CHKUNIT       /* CHECK END OF UNIT EXCEEDED     */ 00105000
*   IF RDATA->FCOUNT=0              /* IS DIAL DATA PRESENT  @Y17XARW*/ 00106000
*     THEN                                                         0269 00107000
         L     @10,RDATA-1(,ROPCAVT)                               0269 00108000
         CLI   FCOUNT(@10),0                                       0269 00109000
         BNE   @RF00269                                            0269 00110000
*     DIALCHAR=0;                   /* NO, INDICATE NO DIAL DATA     */ 00111000
         L     @10,OPCWORK(,ROPCAVT)                               0270 00112000
         SLR   @03,@03                                             0270 00113000
         ST    @03,DIALCHAR(,@10)                                  0270 00114000
*   ELSE                                                           0271 00115000
*     DO;                           /* YES,                          */ 00116000
         B     @RC00269                                            0271 00117000
@RF00269 DS    0H                                                  0272 00118000
*       RDATA=RDATA+2;              /* POINT TO DIAL DIGITS  @Y17XARW*/ 00119000
         LA    @10,2                                               0272 00120000
         L     @03,RDATA-1(,ROPCAVT)                               0272 00121000
         LA    @03,0(,@03)                                         0272 00122000
         ALR   @10,@03                                             0272 00123000
         STCM  @10,7,RDATA(ROPCAVT)                                0272 00124000
*       GENERATE;                                                  0273 00125000
         BAL   REG12,CHKUNIT       /* CHECK END OF UNIT EXCEEDED     */ 00126000
*       DIALCHAR=RDATA;             /* SAVE PTR TO DIAL DIGS @Y17XARW*/ 00127000
         L     @10,OPCWORK(,ROPCAVT)                               0274 00128000
         L     @03,RDATA-1(,ROPCAVT)                               0274 00129000
         LA    @03,0(,@03)                                         0274 00130000
         ST    @03,DIALCHAR(,@10)                                  0274 00131000
*     END;                                                         0275 00132000
*   RTO=ELMNT->WTO;                 /* ADDRESS OF 'TO' AREA          */ 00133000
@RC00269 L     @10,ELMNT(,ROPCAVT)                                 0276 00134000
         L     RTO,WTO-1(,@10)                                     0276 00135000
         LA    RTO,0(,RTO)                                         0276 00136000
*   RESTRICT(RFROM);                                               0277 00137000
*   RESPECIFY                                                      0278 00138000
*     IEDQTRM BASED(RFROM);                                        0278 00139000
*   RFROM=ELMNT->WFROM;             /* ADDRESS OF 'FROM' AREA        */ 00140000
         L     RFROM,WFROM-1(,@10)                                 0279 00141000
         LA    RFROM,0(,RFROM)                                     0279 00142000
*   RFLDS=RFROM+17;                 /* ADDR OF 'FROM' DEV DEP FIELDS */ 00143000
         LA    RFLDS,17(,RFROM)                                    0280 00144000
*   IF TRMOPTFN='1'B                /* ARE OPTION FIELDS PRESENT     */ 00145000
*     THEN                                                         0281 00146000
         TM    TRMOPTFN(RFROM),B'00000010'                         0281 00147000
         BNO   @RF00281                                            0281 00148000
*     RFLDS=RFLDS+3+RFLDS->FCOUNT;  /* SKIP OPT OFFSET               */ 00149000
         LA    @10,3                                               0282 00150000
         ALR   @10,RFLDS                                           0282 00151000
         SLR   @03,@03                                             0282 00152000
         IC    @03,FCOUNT(,RFLDS)                                  0282 00153000
         ALR   @10,@03                                             0282 00154000
         LR    RFLDS,@10                                           0282 00155000
*   RESTRICT(RMASK,RLNGTH);                                        0283 00156000
@RF00281 DS    0H                                                  0284 00157000
*   RTO=RTO+(RFLDS-RFROM);          /* ADDRESS OF 'TO' DEV DEP FLDS  */ 00158000
         LR    @03,RFLDS                                           0284 00159000
         SLR   @03,RFROM                                           0284 00160000
         ALR   RTO,@03                                             0284 00161000
*   GENERATE;                                                      0285 00162000
         LA    RMASK,X'80'             GET MASK FOR EXECUTED INST       00163000
LOOP1    EQU   *                                                        00164000
         CH    RMASK,DIALMSK            IS THIS MASK FOR DIAL DIGITS    00165000
         BE    DIALDIGS                 BRANCH ON YES                   00166000
         CH    RMASK,ADDRMSK            IS THIS MASK FOR ADDR CHARS     00167000
         BE    ADDRCHAR                 BRANCH ON YES                   00168000
         EX    RMASK,TM1                IS THERE A DEV DEP FIELD        00169000
         BNO   SHIFT1                   BRANCH ON NO                    00170000
MOVFLD   EQU   *                                                        00171000
         SR    RLNGTH,RLNGTH            0 LENGTH REGISTER @OZ15650      00172000
         IC    RLNGTH,0(RFLDS)          GET LENGTH OF DATA FIELD        00173000
         BAL   REG12,CHECKAIB           CHECK FOR END OF AIB @G36XRRU*/ 00174000
         EX    RLNGTH,MVC1              MOVE DATA TO USER WORKAREA      00175000
         LA    RTO,1(RLNGTH,RTO)        UPDATE TO AREA POINTER          00176000
         LA    RFLDS,1(RLNGTH,RFLDS)    UPDATE FROM AREA POINTER        00177000
SHIFT1   EQU   *                                                        00178000
         SRL   RMASK,1                  SHIFT MASK 1 POSITION           00179000
         LTR   RMASK,RMASK              ARE THER ANY MORE TO CHECK      00180000
         BNZ   LOOP1                    BRANCH ON YES                   00181000
         LA    RMASK,X'80'             GET MASK FOR EXECUTED INST       00182000
LOOP2    EQU   *                                                        00183000
         EX    RMASK,TM2                EXECUTE TEST UNDER MASK         00184000
         BNO   SHIFT2                   BRANCH IF BIT NOT ON            00185000
MOVFLD2  EQU   *                                                        00186000
         SR    RLNGTH,RLNGTH            0 LENGTH REGISTER @OZ15650      00187000
         IC    RLNGTH,0(RFLDS)          PICK UP FIELD LENGTH            00188000
         BAL   REG12,CHECKAIB           CHECK FOR END OF AIB @G36XRRU   00189000
         EX    RLNGTH,MVC1              MOVE FIELD                      00190000
         LA    RTO,1(RLNGTH,RTO)        UPDATE TO AREA POINTER          00191000
         LA    RFLDS,1(RLNGTH,RFLDS)    UPDATE FROM AREA POINTER        00192000
SHIFT2   EQU   *                                                        00193000
         SRL   RMASK,1                  SHIFT TO NEXT MASK BIT          00194000
         LTR   RMASK,RMASK              ANY MORE BITS TO CHECK          00195000
         BNZ   LOOP2                    BRANCH ON NO                    00196000
         B     SKIP1                                                    00197000
TM1      TM    TRMDEVFL(RFROM),0                                        00198000
TM2      TM    TRMDEVFL+1(RFROM),0                                      00199000
MVC1     MVC   0(0,RTO),0(RFLDS)                                        00200000
SKIP1    EQU   *                                                        00201000
*   IF ELMNT->WENTCD<'08'X          /* IS THIS FOR TCHNG             */ 00202000
*     THEN                                                         0286 00203000
         L     @03,ELMNT(,ROPCAVT)                                 0286 00204000
         CLI   WENTCD(@03),8                                       0286 00205000
         BL    @RT00286                                            0286 00206000
*     GO TO POSTAPPL;               /* NO, POST APPLICATION COMPLETE */ 00207000
*   RPRU=OCUNIT;                    /* SETUP PRU ADDRESS     @Y17XARW*/ 00208000
         L     @15,OPCCOPCE(,ROPCAVT)                              0288 00209000
         L     RPRU,OCUNIT(,@15)                                   0288 00210000
*   ELMNT->WANSCD='0C'X;            /* SET ENTRY CODE FOR ANSWER     */ 00211000
         MVI   WANSCD(@03),X'0C'                                   0289 00212000
*   IF CHANGE='1'B THEN                                            0290 00213000
         TM    CHANGE(ROPCAVT),B'10000000'                         0290 00214000
         BNO   @RF00290                                            0290 00215000
*     DO;                           /* IF ADDR CHARS CHANGED @Y17XARW*/ 00216000
*       PRURH=TRHFID0;              /* SETUP RH FLAGS        @Y17XARW*/ 00217000
         LR    @03,IEDPRUQP                                        0292 00218000
         SL    @03,@CF00068                                        0292 00219000
         MVC   PRURH(3,@03),@CB01248                               0292 00220000
*       PRUTH=TTH0BYT0;             /* SETUP TH FLAGS        @Y17XARW*/ 00221000
         MVI   PRUTH(@03),X'0C'                                    0293 00222000
*       BDUSYRSP=BDUSYRSP&&BDUSYRSP;/* CLEAR BDU RESPONSE    @Y17XARW*/ 00223000
         LA    @03,12                                              0294 00224000
         ALR   @03,IEDPRUQP                                        0294 00225000
         XC    BDUSYRSP(1,@03),BDUSYRSP(@03)                       0294 00226000
*       BDUMODIF='22'X;             /* SET MODIFIER TO REPLACE DEVICE   00227000
*                                      SESSION INITIATION INFO     0295 00228000
*                                                            @Y17XARW*/ 00229000
         MVI   BDUMODIF(@03),X'22'                                 0295 00230000
*       BDUHEADR='1'B;              /* INDICATE THIS IS HEADER     0296 00231000
*                                                            @Y17XARW*/ 00232000
         OI    BDUHEADR(@03),B'01000000'                           0296 00233000
*       CALL SAVEBUFF;              /* SAVE COPIED BUFFERS   @Y17XARW*/ 00234000
         BAL   @14,SAVEBUFF                                        0297 00235000
*       OCRESP='0'B;                /* TURN RESPONSE FLAG OFF      0298 00236000
*                                                            @Y17XARW*/ 00237000
         L     @03,OPCCOPCE(,ROPCAVT)                              0298 00238000
         NI    OCRESP(@03),B'11111110'                             0298 00239000
*       OCWTG=MODT0;                /* SETUP WHERE-TO-GO FLD @Y17XARW*/ 00240000
         MVC   OCWTG(2,@03),MODT0                                  0299 00241000
*       OPCMODID=MOD02;             /* SETUP NEXT MOD ID     @Y17XARW*/ 00242000
         MVC   OPCMODID(2,ROPCAVT),MOD02                           0300 00243000
*     END;                          /*                       @Y17XARW*/ 00244000
*   ELSE                                                           0302 00245000
*     OPCMODID=MODT0;               /* SETUP FOR NEXT MOD    @Y17XARW*/ 00246000
         B     @RC00290                                            0302 00247000
@RF00290 MVC   OPCMODID(2,ROPCAVT),MODT0                           0302 00248000
*EXIT:                                                             0303 00249000
*   OPCFLAG1=0;                     /* CLEAR FLAG FIELDS     @Y17XARW*/ 00250000
@RC00290 DS    0H                                                  0303 00251000
EXIT     MVI   OPCFLAG1(ROPCAVT),X'00'                             0303 00252000
*   REG1=ROPCAVT;                   /* SETUP OP CONTROL AVT  @Y17XARW*/ 00253000
         LR    REG1,ROPCAVT                                        0304 00254000
*   GEN EXIT REFS(OPCXCTL,ROPCAVT);                                0305 00255000
     XCTL    SF=(E,OPCXCTL(ROPCAVT))                           @Y17XARW 00256000
*DIALDIGS:                                                         0306 00257000
*   IF TRMDEVFL(2)='1'B THEN        /* ARE DIAL DIGITS SPECIFIED     */ 00258000
*                                                                  0306 00259000
DIALDIGS TM    TRMDEVFL(RFROM),B'01000000'                         0306 00260000
         BNO   @RF00306                                            0306 00261000
*     /***************************************************************/ 00262000
*     /*                                                             */ 00263000
*     /* WHEN DIAL DIGITS ARE SPECIFIED THE FOLLOWING ACTION IS TAKEN*/ 00264000
*     /* BY THIS MODULE: TCOPY DIGITS IN TTE- DIAL DIGITS TRANSFERRED*/ 00265000
*     /* TO THE USER WORKARE FROM THE TTE DIGITS IN NCP- DIAL DIGITS */ 00266000
*     /* TRANSFERRED TO THE USER WORKAREA FROM THE RESPONSE RU TCHNG */ 00267000
*     /* DIGITS IN TTE- DIAL DIGITS TRANSFERRED TO THE TTE FROM THE  */ 00268000
*     /* USER WORKAREA DIGITS IN NCP- DIAL DIGITS TRANSFERRED TO THE */ 00269000
*     /* RU FROM THE USER WORKAREA AND A REPLACE RU IS SENT TO THE   */ 00270000
*     /* NCP                                                 @YM08051*/ 00271000
*     /*                                                             */ 00272000
*     /***************************************************************/ 00273000
*                                                                  0307 00274000
*     IF TCHNG='1'B THEN            /* IS IT TCHNG?          @YM08051*/ 00275000
*                                                                  0307 00276000
         TM    TCHNG(ROPCAVT),B'01000000'                          0307 00277000
         BNO   @RF00307                                            0307 00278000
*       /*************************************************************/ 00279000
*       /*                                                           */ 00280000
*       /* TCHNG                                             @YM08051*/ 00281000
*       /*                                                           */ 00282000
*       /*************************************************************/ 00283000
*                                                                  0308 00284000
*       IF RTO->FDATA='0F'X THEN    /* AND DIGITS IN NCP     @YM08051*/ 00285000
         CLI   FDATA(RTO),X'0F'                                    0308 00286000
         BE    @RT00308                                            0308 00287000
*         GO TO GETDIAL0;           /* GO TRANSFER DIGITS    @YM08081*/ 00288000
*       ELSE                                                       0310 00289000
*         GO TO MOVFLD;             /* DIGITS IN TTE         @YM08051*/ 00290000
*                                                                  0310 00291000
         B     MOVFLD                                              0310 00292000
*   /*****************************************************************/ 00293000
*   /*                                                               */ 00294000
*   /* TCOPY                                                 @YM08051*/ 00295000
*   /*                                                               */ 00296000
*   /*****************************************************************/ 00297000
*                                                                  0311 00298000
*     ELSE                                                         0311 00299000
*       IF RFLDS->FDATA='0F'X       /* NO ARE DIGITS IN NCP  @YM08051*/ 00300000
*         THEN                                                     0311 00301000
@RF00307 CLI   FDATA(RFLDS),X'0F'                                  0311 00302000
         BE    @RT00311                                            0311 00303000
*         GO TO GETDIAL;            /* YES, DIGITS ARE IN RESPONSE   */ 00304000
*       ELSE                                                       0313 00305000
*         GO TO MOVFLD;             /* NO, DIGITS ARE IN TERM ENTRY  */ 00306000
         B     MOVFLD                                              0313 00307000
*   GO TO SHIFT1;                   /* GO CHECK NEXT BIT             */ 00308000
         B     SHIFT1                                              0314 00309000
*GETDIAL0:                                                         0315 00310000
*   RTO=RTO+2;                      /* INCREMENT TTE REG     @YM08081*/ 00311000
GETDIAL0 LA    RTO,2(,RTO)                                         0315 00312000
*   GO TO GETDIAL1;                 /* GO MOVE DATA          @YM08081*/ 00313000
         B     GETDIAL1                                            0316 00314000
*GETDIAL:                                                          0317 00315000
*   RFLDS=RFLDS+2;                  /* UPDATE 'FROM' DEV DEP PTR     */ 00316000
GETDIAL  LA    RFLDS,2(,RFLDS)                                     0317 00317000
*GETDIAL1:                                                         0318 00318000
*   IF DIALCHAR=0                   /* IS THERE ANY DIAL DATA        */ 00319000
*     THEN                                                         0318 00320000
GETDIAL1 L     @03,OPCWORK(,ROPCAVT)                               0318 00321000
         L     @03,DIALCHAR(,@03)                                  0318 00322000
         LTR   @03,@03                                             0318 00323000
         BZ    @RT00318                                            0318 00324000
*     GO TO SHIFT1;                 /* NO, GO CHECK NEXT BIT         */ 00325000
*   CHANGE='1'B;                    /* INDICATE DIAL DIGITS MUST   0320 00326000
*                                      CHANGE IN NCP         @Y17XARW*/ 00327000
         OI    CHANGE(ROPCAVT),B'10000000'                         0320 00328000
*   RDATA=DIALCHAR;                 /* ADDRESS OF DIAL DIGITS      0321 00329000
*                                                            @Y17XARW*/ 00330000
         STCM  @03,7,RDATA(ROPCAVT)                                0321 00331000
*   IF TCHNG='1'B THEN              /* IS IT TCHNG           @YM08051*/ 00332000
         TM    TCHNG(ROPCAVT),B'01000000'                          0322 00333000
         BO    @RT00322                                            0322 00334000
*     GO TO MOVIT0;                 /* YES GO MOVE DIGITS TO RU    0323 00335000
*                                                            @YM08051*/ 00336000
*MOVDATA:                                                          0324 00337000
*   RLNGTH=RDATA->FCOUNT+1;         /* LENGTH OF FLD TO MOVE @Y17XARW*/ 00338000
MOVDATA  L     @03,RDATA-1(,ROPCAVT)                               0324 00339000
         SLR   @15,@15                                             0324 00340000
         IC    @15,FCOUNT(,@03)                                    0324 00341000
         LA    @15,1(,@15)                                         0324 00342000
         LR    RLNGTH,@15                                          0324 00343000
*MOVIT1:                                                           0325 00344000
*   GENERATE;                                                      0325 00345000
MOVIT1   DS    0H                                                  0325 00346000
*                                  /*                        @G36XRRU*/ 00347000
         BAL   REG12,CHECKAIB      /* CHECK FOR END OF AIB   @G36XRRU*/ 00348000
*   RTO->FIELD=RDATA->FIELD;        /* MOVE ONE BYTE OF DATA @Y17XARW*/ 00349000
         L     @03,RDATA-1(,ROPCAVT)                               0326 00350000
         LA    @03,0(,@03)                                         0326 00351000
         MVC   FIELD(1,RTO),FIELD(@03)                             0326 00352000
*   RLNGTH=RLNGTH-1;                /* REDUCE COUNT TO MOVE          */ 00353000
         BCTR  RLNGTH,0                                            0327 00354000
*   RTO=RTO+1;                      /* UPDATE 'TO' AREA POINTER      */ 00355000
         LA    @15,1                                               0328 00356000
         ALR   RTO,@15                                             0328 00357000
*   RDATA=RDATA+1;                  /* UPDATE 'FROM' AREA PTR      0329 00358000
*                                                            @Y17XARW*/ 00359000
         ALR   @03,@15                                             0329 00360000
         STCM  @03,7,RDATA(ROPCAVT)                                0329 00361000
*   GENERATE;                                                      0330 00362000
         BAL   REG12,CHKUNIT       /* CHECK END OF UNIT EXCEEDED     */ 00363000
*   IF RLNGTH=0                     /* HAS ALL DATA BEEN MOVED       */ 00364000
*     THEN                                                         0331 00365000
         LTR   RLNGTH,RLNGTH                                       0331 00366000
         BZ    @RT00331                                            0331 00367000
*     GO TO SHIFT1;                 /* YES, GO CHECK NEXT BIT        */ 00368000
*   GO TO MOVIT1;                   /* NO, GO TO MOVE MORE           */ 00369000
         B     MOVIT1                                              0333 00370000
*ADDRCHAR:                                                         0334 00371000
*   RDATA=ADDRCHR;                  /* ADDRESS OF ADDR CHARS @Y17XARW*/ 00372000
ADDRCHAR L     @03,OPCWORK(,ROPCAVT)                               0334 00373000
         L     @03,ADDRCHR(,@03)                                   0334 00374000
         STCM  @03,7,RDATA(ROPCAVT)                                0334 00375000
*   IF ELMNT->WENTCD>='08'X         /* IS THIS FOR TCHNG             */ 00376000
*     THEN                                                         0335 00377000
         L     @15,ELMNT(,ROPCAVT)                                 0335 00378000
         CLI   WENTCD(@15),8                                       0335 00379000
         BNL   @RT00335                                            0335 00380000
*     GO TO CHANG1;                 /* YES, GO PROCESS CHANGE        */ 00381000
*   IF RDATA->FCOUNT=0              /* ANY ADDR CHARS PRESENT      0337 00382000
*                                                            @Y17XARW*/ 00383000
*     THEN                                                         0337 00384000
         CLI   FCOUNT(@03),0                                       0337 00385000
         BNE   @RF00337                                            0337 00386000
*     IF TRMDEVFL(3)='1'B           /* YES, AND ARE ADDR CHARS SPECD */ 00387000
*       THEN                                                       0338 00388000
         TM    TRMDEVFL(RFROM),B'00100000'                         0338 00389000
         BO    @RT00338                                            0338 00390000
*       GO TO MOVFLD;               /* GO MOVE ADDR CHARS FROM TERM  */ 00391000
*     ELSE                                                         0340 00392000
*       GO TO SHIFT1;               /* NO, NO ADDR CHARS TO MOVE     */ 00393000
         B     SHIFT1                                              0340 00394000
*   ELMNT->WTO->TRMDEVFL(3)='1'B;   /* INDICATE ADDR CHARS SPECIFIED */ 00395000
@RF00337 L     @03,ELMNT(,ROPCAVT)                                 0341 00396000
         L     @03,WTO-1(,@03)                                     0341 00397000
         OI    TRMDEVFL(@03),B'00100000'                           0341 00398000
*   GO TO MOVDATA;                  /* MOVE ADDR CHARS FROM RESPONSE */ 00399000
         B     MOVDATA                                             0342 00400000
*CHANG1:                                                           0343 00401000
*   IF ELMNT->WADRCH='1'B           /* ARE ADDR CHARS IN 'TO' AREA   */ 00402000
*     THEN                                                         0343 00403000
CHANG1   L     @03,ELMNT(,ROPCAVT)                                 0343 00404000
         TM    WADRCH(@03),B'00000010'                             0343 00405000
         BNO   @RF00343                                            0343 00406000
*     IF TRMDEVFL(3)='1'B           /* AND AREA ADDR CHARS IN 'FROM' */ 00407000
*       THEN                                                       0344 00408000
         TM    TRMDEVFL(RFROM),B'00100000'                         0344 00409000
         BO    @RT00344                                            0344 00410000
*       GO TO MOVFLD;               /* YES, MOVE CHARS FROM 'FROM'   */ 00411000
*     ELSE                                                         0346 00412000
*       DO;                         /* NO NOTHING TO MOVE            */ 00413000
*         ELMNT->WTO->TRMDEVFL(3)='0'B;/* INDICATE NO ADDRESSING   0347 00414000
*                                      CHARACTERS                    */ 00415000
         L     @03,WTO-1(,@03)                                     0347 00416000
         NI    TRMDEVFL(@03),B'11011111'                           0347 00417000
*         GO TO SHIFT1;             /* GO CHECK NEXT                 */ 00418000
         B     SHIFT1                                              0348 00419000
*       END;                                                       0349 00420000
*   ELSE                                                           0350 00421000
*     IF TRMDEVFL(3)='1'B           /* ARE ADDR CHARS IN 'FROM' AREA */ 00422000
*       THEN                                                       0350 00423000
@RF00343 TM    TRMDEVFL(RFROM),B'00100000'                         0350 00424000
         BNO   @RF00350                                            0350 00425000
*       DO;                         /* YES,                          */ 00426000
*         ELMNT->WTO->TRMDEVFL(3)='0'B;/* INDICATE NO ADDRESSING   0352 00427000
*                                      CHARACTERS                    */ 00428000
         L     @03,ELMNT(,ROPCAVT)                                 0352 00429000
         L     @03,WTO-1(,@03)                                     0352 00430000
         NI    TRMDEVFL(@03),B'11011111'                           0352 00431000
*         GO TO MOVDATA2;           /* MOVE CHARS TO DATA            */ 00432000
         B     MOVDATA2                                            0353 00433000
*       END;                                                       0354 00434000
*   GO TO SHIFT1;                   /* GO CHECK NEXT FIELD           */ 00435000
         B     SHIFT1                                              0355 00436000
*MOVDATA2:                                                         0356 00437000
*   IF RFLDS->FCOUNT^=RDATA->FCOUNT /* ARE COUNTS EQUAL      @Y17XARW*/ 00438000
*     THEN                                                         0356 00439000
MOVDATA2 L     @03,RDATA-1(,ROPCAVT)                               0356 00440000
         CLC   FCOUNT(1,RFLDS),FCOUNT(@03)                         0356 00441000
         BNE   @RT00356                                            0356 00442000
*     GO TO ERREXIT;                /* NO, ERROR, EXIT               */ 00443000
*   CHANGE='1'B;                    /* INDICATE ADDR CHARS CHANGED 0358 00444000
*                                                            @Y17XARW*/ 00445000
         OI    CHANGE(ROPCAVT),B'10000000'                         0358 00446000
*MOVIT0:                            /*                       @YM08051*/ 00447000
*   RLNGTH=RDATA->FCOUNT+1;         /* LENGTH OF DATA TO MOVE      0359 00448000
*                                                            @Y17XARW*/ 00449000
MOVIT0   L     @03,RDATA-1(,ROPCAVT)                               0359 00450000
         SLR   @15,@15                                             0359 00451000
         IC    @15,FCOUNT(,@03)                                    0359 00452000
         LA    @15,1(,@15)                                         0359 00453000
         LR    RLNGTH,@15                                          0359 00454000
*MOVIT2:                                                           0360 00455000
*   RDATA->FIELD=RFLDS->FIELD;      /* MOVE ONE BYTE OF DATA @Y17XARW*/ 00456000
MOVIT2   L     @03,RDATA-1(,ROPCAVT)                               0360 00457000
         LA    @03,0(,@03)                                         0360 00458000
         MVC   FIELD(1,@03),FIELD(RFLDS)                           0360 00459000
*   RLNGTH=RLNGTH-1;                /* REDUCE COUNT TO MOVE          */ 00460000
         BCTR  RLNGTH,0                                            0361 00461000
*   RFLDS=RFLDS+1;                  /* UPDATE 'FROM' AREA POINTER    */ 00462000
         LA    @15,1                                               0362 00463000
         ALR   RFLDS,@15                                           0362 00464000
*   RDATA=RDATA+1;                  /* UPDATE 'TO' AREA PTR  @Y17XARW*/ 00465000
         ALR   @03,@15                                             0363 00466000
         STCM  @03,7,RDATA(ROPCAVT)                                0363 00467000
*   GENERATE;                                                      0364 00468000
         BAL   REG12,CHKUNIT       /* CHECK END OF UNIT EXCEEDED     */ 00469000
*   IF RLNGTH=0                     /* HAS ALL DATA BEEN MOVED       */ 00470000
*     THEN                                                         0365 00471000
         LTR   RLNGTH,RLNGTH                                       0365 00472000
         BZ    @RT00365                                            0365 00473000
*     GO TO SHIFT1;                 /* YES, GO CHECK NEXT BIT        */ 00474000
*   GO TO MOVIT2;                   /* NO, GO TO MOVE MORE           */ 00475000
         B     MOVIT2                                              0367 00476000
*CHKUNIT:                                                          0368 00477000
*   IF RDATA>=ENDUNIT               /* ARE WE PAST END OF UNIT       */ 00478000
*     THEN                                                         0368 00479000
CHKUNIT  L     @03,RDATA-1(,ROPCAVT)                               0368 00480000
         LA    @03,0(,@03)                                         0368 00481000
         L     @15,ENDUNIT(,ROPCAVT)                               0368 00482000
         CR    @03,@15                                             0368 00483000
         BL    @RF00368                                            0368 00484000
*     DO;                           /* YES,                          */ 00485000
*       RWORK=RWORK->PRFTIC;        /* NEXT UNIT ADDRESS     @Y17XARW*/ 00486000
         L     RWORK,PRFTIC(,RWORK)                                0370 00487000
*       RDATA=RWORK+12+(RDATA-ENDUNIT);/* POINT TO START OF DATA   0371 00488000
*                                                            @Y17XARW*/ 00489000
         LA    @14,12                                              0371 00490000
         LR    @00,RWORK                                           0371 00491000
         ALR   @00,@14                                             0371 00492000
         SLR   @03,@15                                             0371 00493000
         ALR   @00,@03                                             0371 00494000
         STCM  @00,7,RDATA(ROPCAVT)                                0371 00495000
*       ENDUNIT=RWORK+AVTKEYLE+12;  /* END OF NEXT UNIT ADDRESS    0372 00496000
*                                                            @Y17XARW*/ 00497000
         LR    @03,RWORK                                           0372 00498000
         AH    @03,AVTKEYLE(,AVT)                                  0372 00499000
         ALR   @03,@14                                             0372 00500000
         ST    @03,ENDUNIT(,ROPCAVT)                               0372 00501000
*       GO TO CHKUNIT;                                             0373 00502000
         B     CHKUNIT                                             0373 00503000
*     END;                                                         0374 00504000
*   GENERATE;                                                      0375 00505000
@RF00368 DS    0H                                                  0375 00506000
         BR    REG12               /* RETURN TO CALLER               */ 00507000
*CHECKAIB:                          /*                       @G36XRRU*/ 00508000
*   IF ELMNT->WENTCD>='08'X         /* IF TCHNG REQUEST      @G36XRRU*/ 00509000
*     THEN                                                         0376 00510000
CHECKAIB L     @03,ELMNT(,ROPCAVT)                                 0376 00511000
         CLI   WENTCD(@03),8                                       0376 00512000
         BL    @RF00376                                            0376 00513000
*     GENERATE;                                                    0377 00514000
*                                  /*                        @G36XRRU*/ 00515000
         BR    REG12               /* THEN RETURN TO CALLER  @G36XRRU*/ 00516000
*   ELSE                            /* CONTINUE TCOPY CHECK  @G36XRRU*/ 00517000
*     REG1=RTO+RLNGTH;              /* CURRENT AREA PTR PLUS LENGTH     00518000
*                                      FOR MOVE              @G36XRRU*/ 00519000
         B     @RC00376                                            0378 00520000
@RF00376 LR    REG1,RTO                                            0378 00521000
         ALR   REG1,RLNGTH                                         0378 00522000
*   IF ELMNT->WAIBEND2<REG1         /* IF AIB SIZE EXECEEDED @G36XRRU*/ 00523000
*     THEN                                                         0379 00524000
@RC00376 L     @03,ELMNT(,ROPCAVT)                                 0379 00525000
         L     @03,WAIBEND2-1(,@03)                                0379 00526000
         LA    @03,0(,@03)                                         0379 00527000
         CR    REG1,@03                                            0379 00528000
         BH    @RT00379                                            0379 00529000
*     GO TO SIZERR;                 /* TAKE ERROR EXIT       @G36XRRU*/ 00530000
*   ELSE                            /* AIB SIZE ENOUGH       @G36XRRU*/ 00531000
*     GENERATE;                                                    0381 00532000
         BR    REG12               /* RETURN TO CALLER       @G36XRRU*/ 00533000
*SIZERR:                            /* AIB SIZE EXCEEDED ERR @G36XRRU*/ 00534000
*     ELMNT->WRTCD='18'X;           /* RC=DATA>AIB AREA      @G36XRRU*/ 00535000
SIZERR   L     @03,ELMNT(,ROPCAVT)                                 0382 00536000
         MVI   WRTCD(@03),X'18'                                    0382 00537000
*   GO TO POSTAPP1;                 /* PREPARE TO EXIT       @G36XRRU*/ 00538000
         B     POSTAPP1                                            0383 00539000
*POSTAPPL:                          /* PREPARE TO GOTO 0A10D @G36XRRU*/ 00540000
*   ELMNT->WTO=RTO;                 /* UPDATE 'TO' AREA PTR  @G36XRRU*/ 00541000
POSTAPPL L     @03,ELMNT(,ROPCAVT)                                 0384 00542000
         STCM  RTO,7,WTO(@03)                                      0384 00543000
*POSTAPP1:                          /*                       @G36XRRU*/ 00544000
*   ELMNT->WVERB='FF'X;             /* SET FLAG FOR 'RETURN FROM 3705   00545000
*                                      SERVICE ROUTINE'      @G36XRRU*/ 00546000
POSTAPP1 L     @03,ELMNT(,ROPCAVT)                                 0385 00547000
         MVI   WVERB(@03),X'FF'                                    0385 00548000
*   OPCMODID=MOD0A;                 /* EXIT TO IGC0A10D      @G36XRRU*/ 00549000
         MVC   OPCMODID(2,ROPCAVT),MOD0A                           0386 00550000
*   OPCFLAG1=0;                     /* CLEAR CTL FLAG        @G36XRRU*/ 00551000
         MVI   OPCFLAG1(ROPCAVT),X'00'                             0387 00552000
*   REG1=ROPCAVT;                   /* PASS OP CTL AVT ADDR  @G36XRRU*/ 00553000
         LR    REG1,ROPCAVT                                        0388 00554000
*   GEN EXIT REFS(OPCXCTL,ROPCAVT);                                0389 00555000
*                                 /*                         @G36XRRU*/ 00556000
 XCTL SF=(E,OPCXCTL(ROPCAVT))     /* EXIT TO IGC0A10D        @G36XRRU*/ 00557000
*ERREXIT:                                                          0390 00558000
*   ELMNT->WRTCD='1C'X;             /* BAD RETURN CODE       @G36XRRU*/ 00559000
ERREXIT  L     @03,ELMNT(,ROPCAVT)                                 0390 00560000
         MVI   WRTCD(@03),X'1C'                                    0390 00561000
*   GO TO POSTAPP1;                 /* RETURN TO IGC0A10D    @G36XRRU*/ 00562000
         B     POSTAPP1                                            0391 00563000
*SAVEBUFF:                                                         0392 00564000
*   RFY                                                            0392 00565000
*    (RSAVE,                                                       0392 00566000
*     REG14) RSTD;                  /*                       @Y17XARW*/ 00567000
SAVEBUFF DS    0H                                                  0393 00568000
*   SAVERET=REG14;                  /* SAVE RETURN REG       @Y17XARW*/ 00569000
         L     @15,OPCWORK(,ROPCAVT)                               0393 00570000
         ST    REG14,SAVERET(,@15)                                 0393 00571000
*   BUFCOUNT=1;                     /* SET BUFFER CNT TO ONE @Y17XARW*/ 00572000
         MVC   BUFCOUNT(4,@15),@CF00083                            0394 00573000
*   DO RSAVE=PRUDATCT BY-AVTKEYLE WHILE RSAVE>AVTKEYLE;/* DETERMINE     00574000
*                                      NUMBER OF BUFFS NEEDED      0395 00575000
*                                                            @Y17XARW*/ 00576000
         LH    RSAVE,PRUDATCT(,IEDPRUQP)                           0395 00577000
         B     @DE00395                                            0395 00578000
@DL00395 DS    0H                                                  0396 00579000
*     BUFCOUNT=BUFCOUNT+1;          /* INCREMENT BUFFER COUNT      0396 00580000
*                                                            @Y17XARW*/ 00581000
         L     @15,OPCWORK(,ROPCAVT)                               0396 00582000
         LA    @03,1                                               0396 00583000
         AL    @03,BUFCOUNT(,@15)                                  0396 00584000
         ST    @03,BUFCOUNT(,@15)                                  0396 00585000
*   END;                            /*                       @Y17XARW*/ 00586000
         LH    @15,AVTKEYLE(,AVT)                                  0397 00587000
         LCR   @15,@15                                             0397 00588000
         ALR   RSAVE,@15                                           0397 00589000
@DE00395 CH    RSAVE,AVTKEYLE(,AVT)                                0397 00590000
         BH    @DL00395                                            0397 00591000
*   REG1=BUFCOUNT;                  /* SETUP BUFFER COUNT    @Y17XARW*/ 00592000
         L     @15,OPCWORK(,ROPCAVT)                               0398 00593000
         L     REG1,BUFCOUNT(,@15)                                 0398 00594000
*   RSAVE=ADDR(OPCSAVE);            /* SETUP A SAVEAREA      @Y17XARW*/ 00595000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0399 00596000
*   CALL GETBUFF;                   /* GET BUFFERS FOR DATA  @Y17XARW*/ 00597000
         L     @15,OPCGETBF(,ROPCAVT)                              0400 00598000
         BALR  @14,@15                                             0400 00599000
*   TTCIN=PRUTTCIN;                 /* TTCIN, AND DATA COUNT @Y71XARW*/ 00600000
         LH    @15,PRUTTCIN(,IEDPRUQP)                             0401 00601000
         N     @15,@CF01543                                        0401 00602000
         STH   @15,TTCIN(,REG1)                                    0401 00603000
*   DATCT=PRUDATCT;                 /* FOR CHECKPOINT        @Y17XARW*/ 00604000
         LH    @15,PRUDATCT(,IEDPRUQP)                             0402 00605000
         STH   @15,DATCT(,REG1)                                    0402 00606000
*   PLMVFLG1=0;                     /* CLEAR FLAG BYTES      @Y17XARW*/ 00607000
         L     @03,OPCWORK(,ROPCAVT)                               0403 00608000
         MVI   PLMVFLG1(@03),X'00'                                 0403 00609000
*   PLMVFLG2=0;                     /*                       @Y17XARW*/ 00610000
         MVI   PLMVFLG2(@03),X'00'                                 0404 00611000
*   PLMVUNCA=0;                     /* @Y17XARW&                     */ 00612000
         SLR   @00,@00                                             0405 00613000
         ST    @00,PLMVUNCA(,@03)                                  0405 00614000
*   PLMVTU=REG1;                    /* SETUP TARGET UNIT     @Y17XARW*/ 00615000
         ST    REG1,PLMVTU(,@03)                                   0406 00616000
*   PLMVTD=ADDR(PRFSUNIT);          /* ADDR OF TARGET DATA   @Y17XARW*/ 00617000
         LA    @00,PRFSUNIT(,REG1)                                 0407 00618000
         ST    @00,PLMVTD(,@03)                                    0407 00619000
*   PLMVSU=RPRU;                    /* ADDRESS OF SOURCE UNIT      0408 00620000
*                                                            @Y17XARW*/ 00621000
         ST    RPRU,PLMVSU(,@03)                                   0408 00622000
*   PLMVSD=ADDR(PRUDATA);           /* ADDRESS OF SOURCE DATA      0409 00623000
*                                                            @Y17XARW*/ 00624000
         LA    @00,PRUDATA(,IEDPRUQP)                              0409 00625000
         ST    @00,PLMVSD(,@03)                                    0409 00626000
*   PLMVLNTH=PRUDATCT;              /* LENGTH OF DATA TO MOVE      0410 00627000
*                                                            @Y17XARW*/ 00628000
         STH   @15,PLMVLNTH(,@03)                                  0410 00629000
*   OCPTRSAV=REG1;                  /* SAVE BUFFERS IN OPCE  @Y17XARW*/ 00630000
         L     @15,OPCCOPCE(,ROPCAVT)                              0411 00631000
         ST    REG1,OCPTRSAV(,@15)                                 0411 00632000
*   REG1=ADDR(IEDPLMV);             /* SETUP PARM LIST       @Y17XARW*/ 00633000
         LR    REG1,@03                                            0412 00634000
*   CALL IEDMVBFR;                  /* MOVE COPY DATA        @Y17XARW*/ 00635000
         L     @03,AVTSAVTP(,AVT)                                  0413 00636000
         L     @15,SAVTMVBF(,@03)                                  0413 00637000
         BALR  @14,@15                                             0413 00638000
*   REG14=SAVERET;                  /* RESTORE RETURN REG    @Y17XARW*/ 00639000
         L     @03,OPCWORK(,ROPCAVT)                               0414 00640000
         L     REG14,SAVERET(,@03)                                 0414 00641000
*   RFY                                                            0415 00642000
*    (RSAVE,                                                       0415 00643000
*     REG14) UNRSTD;                /*                       @Y17XARW*/ 00644000
*   RETURN;                         /*                       @Y17XARW*/ 00645000
@EL00001 DS    0H                                                  0416 00646000
@EF00001 DS    0H                                                  0416 00647000
@ER00001 BR    @14                                                 0416 00648000
*   END IGCT110D                                                   0417 00649000
*                                                                  0417 00650000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00651000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00652000
*/*%INCLUDE SYSLIB  (TBDUD   )                                       */ 00653000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00654000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00655000
*/*%INCLUDE SYSLIB  (TPLMVD  )                                       */ 00656000
*/*%INCLUDE SYSLIB  (TPRFD   )                                       */ 00657000
*/*%INCLUDE SYSLIB  (TPRUD   )                                       */ 00658000
*/*%INCLUDE SYSLIB  (TRHD    )                                       */ 00659000
*/*%INCLUDE SYSLIB  (TTHD    )                                       */ 00660000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00661000
*                                                                  0417 00662000
*       ;                                                          0417 00663000
         B     @EL00001                                            0417 00664000
@DATA    DS    0H                                                       00665000
         DS    0F                                                       00666000
         DS    0F                                                       00667000
@CF00083 DC    F'1'                                                     00668000
@CF00068 DC    F'8'                                                     00669000
@CF01538 DC    F'-8'                                                    00670000
@CF01543 DC    XL4'0000FFFF'                                            00671000
         DS    0D                                                       00672000
DIALMSK  DC    H'64'                                                    00673000
ADDRMSK  DC    H'32'                                                    00674000
@CB01248 DC    X'0B8000'                                                00675000
MOD0A    DC    CL2'0A'                                                  00676000
MODT0    DC    CL2'T0'                                                  00677000
MOD00    DC    CL2'00'                                                  00678000
MOD02    DC    CL2'02'                                                  00679000
MOD07    DC    CL2'07'                                                  00680000
         DS    CL1                                                      00681000
ZAPAREA  DC    XL104'0'                                                 00682000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00683000
@01      EQU   01                                                       00684000
@02      EQU   02                                                       00685000
@03      EQU   03                                                       00686000
@04      EQU   04                                                       00687000
@05      EQU   05                                                       00688000
@06      EQU   06                                                       00689000
@07      EQU   07                                                       00690000
@08      EQU   08                                                       00691000
@09      EQU   09                                                       00692000
@10      EQU   10                                                       00693000
@11      EQU   11                                                       00694000
@12      EQU   12                                                       00695000
@13      EQU   13                                                       00696000
@14      EQU   14                                                       00697000
@15      EQU   15                                                       00698000
@0       EQU   00                                                       00699000
@1       EQU   01                                                       00700000
@2       EQU   02                                                       00701000
@3       EQU   03                                                       00702000
@4       EQU   04                                                       00703000
@5       EQU   05                                                       00704000
@6       EQU   06                                                       00705000
@7       EQU   07                                                       00706000
@8       EQU   08                                                       00707000
@9       EQU   09                                                       00708000
@A       EQU   10                                                       00709000
@B       EQU   11                                                       00710000
@C       EQU   12                                                       00711000
@D       EQU   13                                                       00712000
@E       EQU   14                                                       00713000
@F       EQU   15                                                       00714000
REG0     EQU   @00                                                      00715000
REG1     EQU   @01                                                      00716000
ROPCAVT  EQU   @02                                                      00717000
AVT      EQU   @04                                                      00718000
RFLDS    EQU   @05                                                      00719000
RWORK    EQU   @06                                                      00720000
RTO      EQU   @07                                                      00721000
RFROM    EQU   @08                                                      00722000
IEDPRUQP EQU   @09                                                      00723000
RPRU     EQU   @09                                                      00724000
RMASK    EQU   @09                                                      00725000
RLNGTH   EQU   @10                                                      00726000
RBASE    EQU   @11                                                      00727000
REG12    EQU   @12                                                      00728000
RSAVE    EQU   @13                                                      00729000
REG14    EQU   @14                                                      00730000
REG15    EQU   @15                                                      00731000
IEDQAPTR EQU   0                                                        00732000
IEDQTPTR EQU   0                                                        00733000
IEDQPPTR EQU   0                                                        00734000
IEDPLMVP EQU   0                                                        00735000
ROPCE    EQU   0                                                        00736000
IEDQAVTD EQU   0                                                        00737000
AVTSAVEX EQU   IEDQAVTD+288                                             00738000
@NM00003 EQU   IEDQAVTD+388                                             00739000
AVTCKFLG EQU   @NM00003                                                 00740000
AVTBASE  EQU   IEDQAVTD+412                                             00741000
AVTPKF   EQU   AVTBASE                                                  00742000
AVTOSECB EQU   IEDQAVTD+492                                             00743000
AVTECB1  EQU   AVTOSECB                                                 00744000
AVTHG02  EQU   IEDQAVTD+528                                             00745000
AVTDISP  EQU   IEDQAVTD+552                                             00746000
AVTHD    EQU   IEDQAVTD+556                                             00747000
AVTSCOPT EQU   AVTHD                                                    00748000
AVTSAVTP EQU   IEDQAVTD+612                                             00749000
AVTSAVTF EQU   AVTSAVTP                                                 00750000
AVTCKPEL EQU   IEDQAVTD+652                                             00751000
AVTCKRMV EQU   AVTCKPEL                                                 00752000
AVTCKELF EQU   IEDQAVTD+680                                             00753000
AVTCKBYT EQU   IEDQAVTD+691                                             00754000
AVTHG01  EQU   IEDQAVTD+692                                             00755000
AVTCKLNK EQU   IEDQAVTD+696                                             00756000
AVTCRELE EQU   IEDQAVTD+708                                             00757000
AVTCCELE EQU   AVTCRELE                                                 00758000
AVTCLRHI EQU   IEDQAVTD+716                                             00759000
AVTADBUF EQU   IEDQAVTD+720                                             00760000
AVTSYSER EQU   IEDQAVTD+728                                             00761000
AVTCKPQB EQU   IEDQAVTD+804                                             00762000
AVTCKPTB EQU   AVTCKPQB                                                 00763000
AVTCKPEC EQU   AVTCKPQB+4                                               00764000
AVTCKPCC EQU   AVTCKPEC                                                 00765000
AVTOPCQB EQU   IEDQAVTD+816                                             00766000
AVTOPCOB EQU   AVTOPCQB                                                 00767000
AVTOPCEC EQU   AVTOPCQB+4                                               00768000
AVTOPCCC EQU   AVTOPCEC                                                 00769000
AVTOLTQB EQU   IEDQAVTD+828                                             00770000
AVTCWFL1 EQU   IEDQAVTD+924                                             00771000
AVTCWFL2 EQU   IEDQAVTD+925                                             00772000
AVTSUBT  EQU   IEDQAVTD+948                                             00773000
AVTIOTR  EQU   IEDQAVTD+949                                             00774000
AVTKEYLE EQU   IEDQAVTD+1032                                            00775000
AVTBIT1  EQU   IEDQAVTD+1050                                            00776000
AVTBIT2  EQU   IEDQAVTD+1051                                            00777000
AVTBIT3  EQU   IEDQAVTD+1052                                            00778000
AVTBIT4  EQU   IEDQAVTD+1136                                            00779000
@NM00085 EQU   IEDQAVTD+1232                                            00780000
IEDNSVTD EQU   0                                                        00781000
SAVTDIAG EQU   IEDNSVTD                                                 00782000
SAVTDIAF EQU   SAVTDIAG                                                 00783000
SAVTLUSQ EQU   IEDNSVTD+88                                              00784000
SAVTMVBF EQU   IEDNSVTD+160                                             00785000
SAVTTCPU EQU   IEDNSVTD+238                                             00786000
SAVTZELM EQU   IEDNSVTD+270                                             00787000
SAVTRDRV EQU   IEDNSVTD+284                                             00788000
SAVTCKQB EQU   IEDNSVTD+300                                             00789000
SAVTCKTB EQU   SAVTCKQB                                                 00790000
SAVTCKEC EQU   SAVTCKQB+4                                               00791000
SAVTCKCC EQU   SAVTCKEC                                                 00792000
IEDBDU   EQU   0                                                        00793000
BDUMODIF EQU   IEDBDU+1                                                 00794000
BDUFNFLG EQU   IEDBDU+2                                                 00795000
BDUHEADR EQU   BDUFNFLG                                                 00796000
BDUBDUFG EQU   IEDBDU+3                                                 00797000
BDURSP   EQU   IEDBDU+4                                                 00798000
BDUSYRSP EQU   BDURSP                                                   00799000
BDUEXRSP EQU   BDURSP+1                                                 00800000
BDUEND   EQU   IEDBDU+6                                                 00801000
ADDRESS  EQU   0                                                        00802000
IEDQTRM  EQU   0                                                        00803000
TRMSTATE EQU   IEDQTRM                                                  00804000
TRMLOG   EQU   TRMSTATE                                                 00805000
TRMOPTFN EQU   TRMSTATE                                                 00806000
TRMINSEQ EQU   IEDQTRM+4                                                00807000
TLISTCNT EQU   TRMINSEQ                                                 00808000
TRMOUTSQ EQU   IEDQTRM+6                                                00809000
TLISTEN  EQU   TRMOUTSQ                                                 00810000
TRMDSORG EQU   TLISTEN                                                  00811000
TRMALTD  EQU   IEDQTRM+8                                                00812000
TRMDEVFL EQU   IEDQTRM+10                                               00813000
TRMSTAT  EQU   IEDQTRM+12                                               00814000
IEDNTRM  EQU   0                                                        00815000
TRMBYTE4 EQU   IEDNTRM                                                  00816000
TRMBYTE3 EQU   IEDNTRM+1                                                00817000
TRMBYTE2 EQU   IEDNTRM+2                                                00818000
TRMINPG  EQU   TRMBYTE2                                                 00819000
TRMBYTE1 EQU   IEDNTRM+3                                                00820000
TRMSCPRQ EQU   TRMBYTE1                                                 00821000
TRMBYTE0 EQU   IEDNTRM+6                                                00822000
TRMSIBPT EQU   IEDNTRM+7                                                00823000
IEDQOPCE EQU   0                                                        00824000
OCELEM   EQU   IEDQOPCE+4                                               00825000
OCUNIT   EQU   IEDQOPCE+8                                               00826000
OCRUDEST EQU   OCUNIT                                                   00827000
OCCKPKEY EQU   OCRUDEST                                                 00828000
OCSCAN   EQU   OCCKPKEY                                                 00829000
OCOPTCDE EQU   IEDQOPCE+12                                              00830000
OCSWITCH EQU   IEDQOPCE+13                                              00831000
OCFLAG   EQU   IEDQOPCE+14                                              00832000
OCRESP   EQU   OCFLAG                                                   00833000
@NM00114 EQU   IEDQOPCE+16                                              00834000
OCDEST   EQU   @NM00114                                                 00835000
OCREQVAL EQU   OCDEST+1                                                 00836000
OCLINENO EQU   IEDQOPCE+22                                              00837000
OCTIOT   EQU   OCLINENO                                                 00838000
OCTRUNIT EQU   IEDQOPCE+24                                              00839000
OCRSID   EQU   OCTRUNIT                                                 00840000
OCALSTAT EQU   OCRSID                                                   00841000
OCPARM   EQU   IEDQOPCE+28                                              00842000
OCWTG    EQU   IEDQOPCE+30                                              00843000
OCBACKUP EQU   IEDQOPCE+32                                              00844000
OCMODNME EQU   IEDQOPCE+40                                              00845000
OCIPLWA  EQU   OCMODNME                                                 00846000
OCPTRSAV EQU   OCMODNME+4                                               00847000
OCCKDATA EQU   IEDQOPCE+48                                              00848000
OCRSTGTM EQU   OCCKDATA                                                 00849000
IEDQOPCN EQU   0                                                        00850000
OCLDNME  EQU   IEDQOPCN                                                 00851000
OCLINTTE EQU   OCLDNME                                                  00852000
OCREQFLG EQU   OCLINTTE+2                                               00853000
OCPREFLG EQU   OCLINTTE+3                                               00854000
IEDPLMV  EQU   0                                                        00855000
PLMVTU   EQU   IEDPLMV                                                  00856000
PLMVTD   EQU   IEDPLMV+4                                                00857000
PLMVSU   EQU   IEDPLMV+8                                                00858000
PLMVSD   EQU   IEDPLMV+12                                               00859000
PLMVLNTH EQU   IEDPLMV+16                                               00860000
PLMVFLG1 EQU   IEDPLMV+18                                               00861000
PLMVFLG2 EQU   IEDPLMV+19                                               00862000
PLMVUNCA EQU   IEDPLMV+20                                               00863000
IEDQPRF  EQU   0                                                        00864000
PRFRCB   EQU   IEDQPRF                                                  00865000
PRFKEY   EQU   PRFRCB                                                   00866000
PRFQCBA  EQU   PRFRCB+1                                                 00867000
PRFPRI   EQU   PRFRCB+4                                                 00868000
PRFLINK  EQU   PRFRCB+5                                                 00869000
PRFTIC   EQU   IEDQPRF+8                                                00870000
PRFTICC  EQU   PRFTIC                                                   00871000
PRFNBUNT EQU   IEDQPRF+12                                               00872000
PRFSUNIT EQU   PRFNBUNT                                                 00873000
PRFPLQCB EQU   PRFSUNIT                                                 00874000
@NM00132 EQU   IEDQPRF+16                                               00875000
PRFSVFFO EQU   @NM00132                                                 00876000
PRFSTAT1 EQU   IEDQPRF+20                                               00877000
PRFEOFN  EQU   PRFSTAT1                                                 00878000
PRFCORE  EQU   IEDQPRF+21                                               00879000
PRFXTRA  EQU   PRFCORE                                                  00880000
PRFSCAN  EQU   IEDQPRF+24                                               00881000
PRFTQBCK EQU   IEDQPRF+26                                               00882000
PRFNTXT  EQU   PRFTQBCK                                                 00883000
PRFEOBOF EQU   PRFNTXT                                                  00884000
PRFCHDR  EQU   IEDQPRF+32                                               00885000
PRFHQBCK EQU   IEDQPRF+35                                               00886000
IEDPF1   EQU   0                                                        00887000
PRF1FLG1 EQU   IEDPF1+3                                                 00888000
PRF1WD2  EQU   IEDPF1+4                                                 00889000
PRF1SEQP EQU   PRF1WD2                                                  00890000
PRF1SQID EQU   PRF1SEQP                                                 00891000
PRF1TAG1 EQU   PRF1SQID                                                 00892000
IEDPF2   EQU   0                                                        00893000
PRF2FLG2 EQU   IEDPF2                                                   00894000
PRF2WD2  EQU   IEDPF2+4                                                 00895000
IEDPRUQD EQU   0                                                        00896000
PRUTTCIN EQU   IEDPRUQD                                                 00897000
PRUDATCT EQU   IEDPRUQD+2                                               00898000
PRUTIC   EQU   IEDPRUQD+8                                               00899000
PRUDATA  EQU   IEDPRUQD+12                                              00900000
IEDPRUND EQU   0                                                        00901000
PRURHTH  EQU   IEDPRUND                                                 00902000
PRURH    EQU   PRURHTH                                                  00903000
PRURHFG0 EQU   PRURH                                                    00904000
PRURHSDI EQU   PRURHFG0                                                 00905000
PRURHFG1 EQU   PRURH+1                                                  00906000
PRURHFG2 EQU   PRURH+2                                                  00907000
PRUTH    EQU   PRURHTH+3                                                00908000
PRUFIDN  EQU   PRUTH                                                    00909000
IEDRH    EQU   0                                                        00910000
TRHBYTE0 EQU   IEDRH                                                    00911000
TRHBYTE1 EQU   IEDRH+1                                                  00912000
TRHBYTE2 EQU   IEDRH+2                                                  00913000
IEDTH    EQU   0                                                        00914000
TTHBYTE0 EQU   IEDTH                                                    00915000
TTHSNF   EQU   IEDTH+6                                                  00916000
TTHTAG   EQU   TTHSNF                                                   00917000
TTHTAG1  EQU   TTHTAG                                                   00918000
IEDQOPCD EQU   0                                                        00919000
OPCAVTPT EQU   IEDQOPCD+8                                               00920000
OPCCOPCE EQU   IEDQOPCD+12                                              00921000
OPCSAVE  EQU   IEDQOPCD+56                                              00922000
OPCWORK  EQU   IEDQOPCD+140                                             00923000
OPCFLAG1 EQU   IEDQOPCD+146                                             00924000
OPCAQCTL EQU   IEDQOPCD+180                                             00925000
OPCXCTL  EQU   IEDQOPCD+204                                             00926000
OPCLDNME EQU   IEDQOPCD+212                                             00927000
OPCMODID EQU   OPCLDNME+3                                               00928000
OPCGETBF EQU   IEDQOPCD+276                                             00929000
OPCFREBF EQU   IEDQOPCD+280                                             00930000
OPCSPEC  EQU   IEDQOPCD+300                                             00931000
OPCWRKSP EQU   IEDQOPCD+320                                             00932000
OPCPWCOB EQU   IEDQOPCD+368                                             00933000
OPCPWQCB EQU   OPCPWCOB                                                 00934000
OPCPWECB EQU   OPCPWCOB+4                                               00935000
WORKAREA EQU   0                                                        00936000
WVERB    EQU   WORKAREA+8                                               00937000
WENTCD   EQU   WORKAREA+9                                               00938000
WANSCD   EQU   WORKAREA+10                                              00939000
WADRCH   EQU   WANSCD                                                   00940000
WRTCD    EQU   WORKAREA+11                                              00941000
WPTR1    EQU   WORKAREA+16                                              00942000
WTO      EQU   WPTR1+1                                                  00943000
WPTR2    EQU   WORKAREA+20                                              00944000
WFROM    EQU   WPTR2+1                                                  00945000
WAIBEND  EQU   WORKAREA+36                                              00946000
WAIBEND2 EQU   WAIBEND+1                                                00947000
FIELDS   EQU   0                                                        00948000
FIELD    EQU   FIELDS                                                   00949000
FCOUNT   EQU   FIELD                                                    00950000
FDATA    EQU   FIELDS+1                                                 00951000
POINTERS EQU   0                                                        00952000
SAVERET  EQU   POINTERS+24                                              00953000
BUFCOUNT EQU   POINTERS+28                                              00954000
ADDRCHR  EQU   POINTERS+32                                              00955000
DIALCHAR EQU   POINTERS+36                                              00956000
PRUBUFF  EQU   0                                                        00957000
TTCIN    EQU   PRUBUFF                                                  00958000
DATCT    EQU   PRUBUFF+2                                                00959000
GETBUFF  EQU   0                                                        00960000
IEDMVBFR EQU   0                                                        00961000
FREEBUFF EQU   0                                                        00962000
TRMPRE1  EQU   TRMBYTE4                                                 00963000
TRMNCP1  EQU   TRMBYTE4                                                 00964000
TRMPRE   EQU   TRMBYTE3                                                 00965000
TRMNCP   EQU   TRMBYTE3                                                 00966000
TRMPU    EQU   TRMBYTE3                                                 00967000
TRMLU    EQU   TRMBYTE3                                                 00968000
TRMLINK  EQU   TRMBYTE3                                                 00969000
OCCIB    EQU   OCREQVAL                                                 00970000
OCCKPKY1 EQU   OCCKPKEY                                                 00971000
OCCKPTYP EQU   OCCKPKY1                                                 00972000
OCICACTN EQU   OCMODNME                                                 00973000
OCICDADR EQU   OCICACTN                                                 00974000
OCICSW   EQU   OCICDADR+3                                               00975000
OPCAQWD  EQU   OPCAQCTL                                                 00976000
OPCAQWD1 EQU   OPCAQWD                                                  00977000
OPCAQWD2 EQU   OPCAQWD+4                                                00978000
OPCAQWD3 EQU   OPCAQWD+8                                                00979000
WRKSPACE EQU   OPCWRKSP                                                 00980000
ELMNT    EQU   WRKSPACE                                                 00981000
ENDUNIT  EQU   WRKSPACE+4                                               00982000
RDATA    EQU   WRKSPACE+9                                               00983000
FLAGS    EQU   OPCFLAG1                                                 00984000
CHANGE   EQU   FLAGS                                                    00985000
TCHNG    EQU   FLAGS                                                    00986000
BDUTEXT  EQU   BDUEND                                                   00987000
PRFSHDR  EQU   IEDQPRF+42                                               00988000
TRMOPT   EQU   IEDQTRM+20                                               00989000
*                                      START UNREFERENCED COMPONENTS    00990000
@NM00175 EQU   WRKSPACE+8                                               00991000
OPCAQLST EQU   OPCAQWD3+1                                               00992000
OPCAQRQ3 EQU   OPCAQWD3                                                 00993000
OPCAQSEC EQU   OPCAQWD2+1                                               00994000
OPCAQRQ2 EQU   OPCAQWD2                                                 00995000
OPCAQFST EQU   OPCAQWD1+1                                               00996000
OPCAQREQ EQU   OPCAQWD1                                                 00997000
OCICINAC EQU   OCICSW                                                   00998000
@NM00120 EQU   OCICSW                                                   00999000
OCICATST EQU   OCICDADR+1                                               01000000
OCICTYPE EQU   OCICDADR                                                 01001000
@NM00119 EQU   OCCKPKY1                                                 01002000
OCCKPENV EQU   OCCKPKY1                                                 01003000
OCCKPRST EQU   OCCKPTYP                                                 01004000
OCCKPNCP EQU   OCCKPTYP                                                 01005000
OCCKPINC EQU   OCCKPTYP                                                 01006000
@NM00110 EQU   TRMLINK                                                  01007000
TRMLSTAT EQU   TRMLINK                                                  01008000
TRMLINT  EQU   TRMLINK                                                  01009000
TRMEPMOD EQU   TRMLINK                                                  01010000
TRMLULOG EQU   TRMLU                                                    01011000
TRMINERR EQU   TRMLU                                                    01012000
TRMLUREQ EQU   TRMLU                                                    01013000
TRMSESRQ EQU   TRMLU                                                    01014000
TRMTDIFF EQU   TRMLU                                                    01015000
TRMLUTM  EQU   TRMLU                                                    01016000
TRMLUIT  EQU   TRMLU                                                    01017000
TRMAUTO  EQU   TRMLU                                                    01018000
TRMPCONT EQU   TRMPU                                                    01019000
@NM00109 EQU   TRMPU                                                    01020000
TRMNCONT EQU   TRMNCP                                                   01021000
TRMQUCKN EQU   TRMNCP                                                   01022000
TRMSLOWN EQU   TRMNCP                                                   01023000
TRMSYGEN EQU   TRMNCP                                                   01024000
TRMNCPCL EQU   TRMNCP                                                   01025000
TRMIPLDM EQU   TRMNCP                                                   01026000
TRMINOUT EQU   TRMPRE                                                   01027000
TRMRDOUT EQU   TRMPRE                                                   01028000
TRMNLOUT EQU   TRMPRE                                                   01029000
TRMWROUT EQU   TRMPRE                                                   01030000
TRMASNXI EQU   TRMPRE                                                   01031000
TRMSTMM  EQU   TRMPRE                                                   01032000
TRMCMODE EQU   TRMPRE                                                   01033000
TRMSTPND EQU   TRMPRE                                                   01034000
@NM00108 EQU   TRMNCP1                                                  01035000
TRMINOP  EQU   TRMNCP1                                                  01036000
TRMLYNCH EQU   TRMPRE1                                                  01037000
TRMSPOUT EQU   TRMPRE1                                                  01038000
TRMERLCK EQU   TRMPRE1                                                  01039000
TRMQNPL  EQU   TRMPRE1                                                  01040000
TRMSPACT EQU   TRMPRE1                                                  01041000
TRMOCNI  EQU   TRMPRE1                                                  01042000
TRMSESSN EQU   TRMPRE1                                                  01043000
TRMCONT  EQU   TRMPRE1                                                  01044000
@NM00181 EQU   POINTERS+20                                              01045000
@NM00180 EQU   POINTERS+16                                              01046000
@NM00179 EQU   POINTERS+12                                              01047000
@NM00178 EQU   POINTERS+8                                               01048000
@NM00177 EQU   POINTERS+4                                               01049000
@NM00176 EQU   POINTERS                                                 01050000
WAIBEND1 EQU   WAIBEND                                                  01051000
@NM00174 EQU   WORKAREA+28                                              01052000
WRQTG    EQU   WORKAREA+26                                              01053000
WTNTNDX  EQU   WORKAREA+24                                              01054000
@NM00173 EQU   WPTR2                                                    01055000
@NM00172 EQU   WPTR1                                                    01056000
WECBA    EQU   WORKAREA+12                                              01057000
WDIALD   EQU   WANSCD                                                   01058000
@NM00171 EQU   WANSCD                                                   01059000
WLINK    EQU   WORKAREA+5                                               01060000
WPRI     EQU   WORKAREA+4                                               01061000
WQCBADR  EQU   WORKAREA                                                 01062000
OPCBOTTM EQU   IEDQOPCD+1184                                            01063000
@NM00170 EQU   IEDQOPCD+1100                                            01064000
@NM00169 EQU   IEDQOPCD+948                                             01065000
@NM00168 EQU   IEDQOPCD+940                                             01066000
@NM00167 EQU   IEDQOPCD+380                                             01067000
@NM00166 EQU   OPCPWCOB+9                                               01068000
@NM00165 EQU   OPCPWCOB+8                                               01069000
@NM00164 EQU   OPCPWECB+1                                               01070000
OPCPWCCC EQU   OPCPWECB                                                 01071000
OPCPWCHN EQU   OPCPWQCB+1                                               01072000
OPCPWVTO EQU   OPCPWQCB                                                 01073000
OPCWAITV EQU   IEDQOPCD+364                                             01074000
OPCTOTCK EQU   IEDQOPCD+360                                             01075000
OPCAPXTL EQU   IEDQOPCD+356                                             01076000
OPCDECR  EQU   IEDQOPCD+352                                             01077000
OPCBUFWT EQU   IEDQOPCD+348                                             01078000
OPCADGOT EQU   IEDQOPCD+318                                             01079000
OPCRQCNT EQU   IEDQOPCD+316                                             01080000
OPPOLSTP EQU   IEDQOPCD+312                                             01081000
OPCCKCIB EQU   IEDQOPCD+308                                             01082000
OPCEND   EQU   IEDQOPCD+307                                             01083000
OPCSTCBS EQU   IEDQOPCD+306                                             01084000
OPCHNEND EQU   IEDQOPCD+302                                             01085000
OPCOQSW  EQU   IEDQOPCD+301                                             01086000
@NM00163 EQU   OPCSPEC                                                  01087000
@NM00162 EQU   OPCSPEC                                                  01088000
@NM00161 EQU   OPCSPEC                                                  01089000
@NM00160 EQU   OPCSPEC                                                  01090000
OPCFRMCA EQU   OPCSPEC                                                  01091000
OPCRSTRT EQU   OPCSPEC                                                  01092000
OPCPART  EQU   OPCSPEC                                                  01093000
OPCALTD  EQU   OPCSPEC                                                  01094000
OPCBFEND EQU   IEDQOPCD+296                                             01095000
OPCBFIRS EQU   IEDQOPCD+292                                             01096000
OPCAVBUF EQU   IEDQOPCD+290                                             01097000
OPCIPLCT EQU   IEDQOPCD+289                                             01098000
OPCCLNTS EQU   IEDQOPCD+288                                             01099000
OPCHA8   EQU   IEDQOPCD+286                                             01100000
OPCBFREQ EQU   IEDQOPCD+284                                             01101000
OPCNEXT  EQU   IEDQOPCD+272                                             01102000
OPCFMDFC EQU   IEDQOPCD+268                                             01103000
OPCSCNC  EQU   IEDQOPCD+264                                             01104000
OPCHORTG EQU   IEDQOPCD+260                                             01105000
OPCHORT  EQU   IEDQOPCD+256                                             01106000
OPCCKPTL EQU   IEDQOPCD+252                                             01107000
OPCCKPTF EQU   IEDQOPCD+248                                             01108000
OPCWAITA EQU   IEDQOPCD+244                                             01109000
OPCWAITR EQU   IEDQOPCD+240                                             01110000
OPCWAITP EQU   IEDQOPCD+236                                             01111000
OPCWAITO EQU   IEDQOPCD+232                                             01112000
OPCWAITN EQU   IEDQOPCD+228                                             01113000
OPCWAITL EQU   IEDQOPCD+224                                             01114000
OPCWAITC EQU   IEDQOPCD+220                                             01115000
@NM00159 EQU   OPCLDNME+5                                               01116000
@NM00158 EQU   OPCLDNME                                                 01117000
OPCWAIT  EQU   IEDQOPCD+192                                             01118000
OPCCKERB EQU   IEDQOPCD+164                                             01119000
OPCBFERB EQU   IEDQOPCD+148                                             01120000
OPCFLAG2 EQU   IEDQOPCD+147                                             01121000
OPCWRKSZ EQU   IEDQOPCD+144                                             01122000
OPCRSAVE EQU   IEDQOPCD+132                                             01123000
OPCQCBAD EQU   IEDQOPCD+128                                             01124000
OPCTRMWA EQU   IEDQOPCD+52                                              01125000
OPCPSTWT EQU   IEDQOPCD+48                                              01126000
OPCTNTEA EQU   IEDQOPCD+44                                              01127000
OPCPGCK  EQU   IEDQOPCD+40                                              01128000
OPCLCB   EQU   IEDQOPCD+36                                              01129000
@NM00157 EQU   IEDQOPCD+32                                              01130000
OPCIPLAD EQU   IEDQOPCD+28                                              01131000
OPCTOFLK EQU   IEDQOPCD+24                                              01132000
OPCOPTLK EQU   IEDQOPCD+20                                              01133000
OPCDCBLK EQU   IEDQOPCD+16                                              01134000
OPCDOUBL EQU   IEDQOPCD                                                 01135000
TTHDCF   EQU   IEDTH+8                                                  01136000
TTHTAG2  EQU   TTHTAG+1                                                 01137000
@NM00156 EQU   TTHTAG1                                                  01138000
TTHTAGS  EQU   TTHTAG1                                                  01139000
TTHOAF   EQU   IEDTH+4                                                  01140000
TTHDAF   EQU   IEDTH+2                                                  01141000
TTHBYTE1 EQU   IEDTH+1                                                  01142000
TTHEFI   EQU   TTHBYTE0                                                 01143000
@NM00155 EQU   TTHBYTE0                                                 01144000
TTHEBIU  EQU   TTHBYTE0                                                 01145000
TTHBBIU  EQU   TTHBYTE0                                                 01146000
TTHFTYPE EQU   TTHBYTE0                                                 01147000
@NM00154 EQU   TRHBYTE2                                                 01148000
@NM00153 EQU   TRHBYTE2                                                 01149000
@NM00152 EQU   TRHBYTE2                                                 01150000
TRHCSI   EQU   TRHBYTE2                                                 01151000
@NM00151 EQU   TRHBYTE2                                                 01152000
TRHCDI   EQU   TRHBYTE2                                                 01153000
TRHEB    EQU   TRHBYTE2                                                 01154000
TRHBB    EQU   TRHBYTE2                                                 01155000
TRHPI    EQU   TRHBYTE1                                                 01156000
@NM00150 EQU   TRHBYTE1                                                 01157000
@NM00149 EQU   TRHBYTE1                                                 01158000
@NM00148 EQU   TRHBYTE1                                                 01159000
TRHER    EQU   TRHBYTE1                                                 01160000
TRHDR2   EQU   TRHBYTE1                                                 01161000
@NM00147 EQU   TRHBYTE1                                                 01162000
TRHDR1   EQU   TRHBYTE1                                                 01163000
TRHEC    EQU   TRHBYTE0                                                 01164000
TRHBC    EQU   TRHBYTE0                                                 01165000
TRHSDI   EQU   TRHBYTE0                                                 01166000
TRHFI    EQU   TRHBYTE0                                                 01167000
@NM00146 EQU   TRHBYTE0                                                 01168000
TRHRUCAT EQU   TRHBYTE0                                                 01169000
TRHTYPE  EQU   TRHBYTE0                                                 01170000
@NM00145 EQU   IEDPRUND+4                                               01171000
PRUTHEFI EQU   PRUFIDN                                                  01172000
PRUTHUSS EQU   PRUFIDN                                                  01173000
PRUTHEIU EQU   PRUFIDN                                                  01174000
PRUTHBIU EQU   PRUFIDN                                                  01175000
PRUTHTYE EQU   PRUFIDN                                                  01176000
@NM00144 EQU   PRURHFG2                                                 01177000
PRURHCSI EQU   PRURHFG2                                                 01178000
@NM00143 EQU   PRURHFG2                                                 01179000
PRURHCDI EQU   PRURHFG2                                                 01180000
PRURHEB  EQU   PRURHFG2                                                 01181000
PRURHBB  EQU   PRURHFG2                                                 01182000
PRURHPI  EQU   PRURHFG1                                                 01183000
@NM00142 EQU   PRURHFG1                                                 01184000
PRURHER  EQU   PRURHFG1                                                 01185000
PRURHDR2 EQU   PRURHFG1                                                 01186000
@NM00141 EQU   PRURHFG1                                                 01187000
PRURHDR1 EQU   PRURHFG1                                                 01188000
PRURHEC  EQU   PRURHFG0                                                 01189000
PRURHBC  EQU   PRURHFG0                                                 01190000
PRURHFI  EQU   PRURHFG0                                                 01191000
@NM00140 EQU   PRURHFG0                                                 01192000
PRURUCAT EQU   PRURHFG0                                                 01193000
PRURHTYP EQU   PRURHFG0                                                 01194000
PRUNUNIT EQU   PRUTIC+1                                                 01195000
@NM00139 EQU   PRUTIC                                                   01196000
@NM00138 EQU   IEDPRUQD+4                                               01197000
PRF2SEQP EQU   PRF2WD2                                                  01198000
@NM00137 EQU   IEDPF2+1                                                 01199000
@NM00136 EQU   PRF2FLG2                                                 01200000
PRF2TERM EQU   PRF2FLG2                                                 01201000
PRF2SMI  EQU   PRF2FLG2                                                 01202000
PRF2FORM EQU   PRF2FLG2                                                 01203000
PRF2TNTI EQU   PRF2FLG2                                                 01204000
PRF1RULN EQU   PRF1SEQP+2                                               01205000
PRF1TAG2 EQU   PRF1SQID+1                                               01206000
@NM00135 EQU   PRF1TAG1                                                 01207000
PRF1TAGS EQU   PRF1TAG1                                                 01208000
@NM00134 EQU   PRF1FLG1                                                 01209000
PRF1LOGD EQU   PRF1FLG1                                                 01210000
PRF1USS  EQU   PRF1FLG1                                                 01211000
PRF1FORM EQU   PRF1FLG1                                                 01212000
PRF1EXPI EQU   PRF1FLG1                                                 01213000
PRF1FIDI EQU   PRF1FLG1                                                 01214000
PRF1RH   EQU   IEDPF1                                                   01215000
PRFDEST  EQU   IEDQPRF+40                                               01216000
PRFISEQ  EQU   IEDQPRF+38                                               01217000
PRFSTXT  EQU   PRFHQBCK                                                 01218000
PRFNHDR  EQU   PRFCHDR                                                  01219000
PRFCRCD  EQU   IEDQPRF+29                                               01220000
PRFSVSEQ EQU   PRFNTXT+1                                                01221000
PRFSVPRI EQU   PRFEOBOF                                                 01222000
PRFISIZE EQU   PRFSCAN+1                                                01223000
@NM00133 EQU   PRFSCAN                                                  01224000
PRFEOB   EQU   PRFXTRA+1                                                01225000
PRFSTSO  EQU   PRFXTRA                                                  01226000
PRFNHDRN EQU   PRFSTAT1                                                 01227000
PRFNLSTN EQU   PRFSTAT1                                                 01228000
PRFLOCK  EQU   PRFEOFN                                                  01229000
PRFDUPLN EQU   PRFSTAT1                                                 01230000
PRFTSMSG EQU   PRFSTAT1                                                 01231000
PRFITCPN EQU   PRFSTAT1                                                 01232000
PRFERMGN EQU   PRFSTAT1                                                 01233000
PRFCNCLN EQU   PRFSTAT1                                                 01234000
PRFSVFLG EQU   @NM00132+3                                               01235000
PRFSIZE  EQU   PRFSVFFO+2                                               01236000
PRFSRCE  EQU   PRFSVFFO                                                 01237000
PRFLCB   EQU   IEDQPRF+13                                               01238000
PRFPIUO  EQU   PRFPLQCB                                                 01239000
PRFTI0   EQU   PRFTIC+1                                                 01240000
@NM00131 EQU   PRFTICC                                                  01241000
@NM00130 EQU   PRFTICC                                                  01242000
@NM00129 EQU   PRFTICC                                                  01243000
PRFTICON EQU   PRFTICC                                                  01244000
@NM00128 EQU   PRFTICC                                                  01245000
@NM00127 EQU   PRFTICC                                                  01246000
PRFBFMM  EQU   PRFTICC                                                  01247000
PRFEOMSG EQU   PRFTICC                                                  01248000
PRFCOUNT EQU   PRFLINK+1                                                01249000
@NM00126 EQU   PRFLINK                                                  01250000
PRFFLAGS EQU   PRFPRI                                                   01251000
PRFIOADR EQU   PRFQCBA                                                  01252000
PRFOPCDE EQU   PRFKEY                                                   01253000
@NM00125 EQU   PLMVFLG1                                                 01254000
PLMVTCTG EQU   PLMVFLG1                                                 01255000
PLMVSCTG EQU   PLMVFLG1                                                 01256000
PLMVUNCF EQU   PLMVFLG1                                                 01257000
@NM00124 EQU   OCLDNME+4                                                01258000
@NM00123 EQU   OCPREFLG                                                 01259000
OCTOTEP  EQU   OCPREFLG                                                 01260000
OCREPOST EQU   OCPREFLG                                                 01261000
OCRSPSNT EQU   OCPREFLG                                                 01262000
OCBFREQ  EQU   OCPREFLG                                                 01263000
OCIDLE   EQU   OCREQFLG                                                 01264000
OCFORCE  EQU   OCREQFLG                                                 01265000
OCDCARD  EQU   OCREQFLG                                                 01266000
OCPARTAL EQU   OCREQFLG                                                 01267000
OCADNCP  EQU   OCREQFLG                                                 01268000
@NM00122 EQU   OCREQFLG                                                 01269000
@NM00121 EQU   OCREQFLG                                                 01270000
OCFLUSHZ EQU   OCREQFLG                                                 01271000
OCRESPCT EQU   OCLINTTE                                                 01272000
OCCKPTWA EQU   OCCKDATA+4                                               01273000
@NM00118 EQU   OCRSTGTM+2                                               01274000
OCCKDAT2 EQU   OCRSTGTM+1                                               01275000
OCCKDAT1 EQU   OCRSTGTM                                                 01276000
OCPUADR  EQU   OCIPLWA+2                                                01277000
OCWTGSAV EQU   OCIPLWA                                                  01278000
OCDVRDCT EQU   OCBACKUP+6                                               01279000
OCNCP    EQU   OCBACKUP+4                                               01280000
OCBUFGOT EQU   OCBACKUP+2                                               01281000
OCBUFNED EQU   OCBACKUP                                                 01282000
OCRESNUM EQU   OCPARM                                                   01283000
OCSEQ    EQU   OCTRUNIT+2                                               01284000
@NM00117 EQU   OCRSID+1                                                 01285000
OCNONE   EQU   OCALSTAT                                                 01286000
OCSOME   EQU   OCALSTAT                                                 01287000
OCALLFLG EQU   OCALSTAT                                                 01288000
OCACTREQ EQU   OCALSTAT                                                 01289000
OCREDRVE EQU   OCALSTAT                                                 01290000
OCSEQIND EQU   OCALSTAT                                                 01291000
@NM00116 EQU   OCALSTAT                                                 01292000
OCRENTRD EQU   OCALSTAT                                                 01293000
OCWTGB   EQU   OCTIOT                                                   01294000
OCTRMTBL EQU   IEDQOPCE+20                                              01295000
@NM00115 EQU   @NM00114+2                                               01296000
OCCONID  EQU   OCDEST                                                   01297000
OCRLN    EQU   IEDQOPCE+15                                              01298000
OCATTACH EQU   OCFLAG                                                   01299000
OCSSCP   EQU   OCFLAG                                                   01300000
OCOUTPUT EQU   OCFLAG                                                   01301000
OCLINE   EQU   OCFLAG                                                   01302000
OCMPP    EQU   OCFLAG                                                   01303000
OCTOTE   EQU   OCFLAG                                                   01304000
OCCONSOL EQU   OCFLAG                                                   01305000
@NM00113 EQU   OCSWITCH                                                 01306000
OCQUCKN  EQU   OCSWITCH                                                 01307000
OCPRIFLG EQU   OCOPTCDE                                                 01308000
@NM00112 EQU   OCRUDEST+1                                               01309000
@NM00111 EQU   OCSCAN                                                   01310000
OCNOTUCB EQU   OCSCAN                                                   01311000
OCNONAME EQU   OCSCAN                                                   01312000
OCALLRLN EQU   OCSCAN                                                   01313000
OCDDNAME EQU   OCSCAN                                                   01314000
OCDDNRLN EQU   OCSCAN                                                   01315000
OCADDR   EQU   OCSCAN                                                   01316000
OCELMPTR EQU   OCELEM+1                                                 01317000
OCELMPRI EQU   OCELEM                                                   01318000
OCLINK   EQU   IEDQOPCE                                                 01319000
TRMSUBST EQU   IEDNTRM+12                                               01320000
TRMTYPE  EQU   IEDNTRM+11                                               01321000
TRMRLMCT EQU   IEDNTRM+10                                               01322000
TRMCOHTG EQU   TRMSIBPT+1                                               01323000
TRMGPCNT EQU   TRMSIBPT                                                 01324000
TRMBUFRD EQU   TRMBYTE0                                                 01325000
TRMSNA   EQU   TRMBYTE0                                                 01326000
TRMGP    EQU   TRMBYTE0                                                 01327000
TRMDIAL  EQU   TRMBYTE0                                                 01328000
@NM00107 EQU   TRMBYTE0                                                 01329000
TRMOUTPT EQU   TRMBYTE0                                                 01330000
TRMINPUT EQU   TRMBYTE0                                                 01331000
TRMUDEF  EQU   TRMBYTE0                                                 01332000
TRMCOHRT EQU   IEDNTRM+4                                                01333000
TRMSTOTE EQU   TRMBYTE1                                                 01334000
TRMCKPRN EQU   TRMBYTE1                                                 01335000
TRMTSATN EQU   TRMBYTE1                                                 01336000
TRMTRACE EQU   TRMBYTE1                                                 01337000
TRMSWBCK EQU   TRMBYTE1                                                 01338000
TRMAUTOC EQU   TRMBYTE1                                                 01339000
TRMINPTP EQU   TRMBYTE1                                                 01340000
TRMWTNEG EQU   TRMSCPRQ                                                 01341000
TRMWRBRK EQU   TRMBYTE2                                                 01342000
TRMNOSND EQU   TRMBYTE2                                                 01343000
TRMPREP  EQU   TRMBYTE2                                                 01344000
TRMGPACT EQU   TRMBYTE2                                                 01345000
TRMANDL  EQU   TRMBYTE2                                                 01346000
TRMCLOSN EQU   TRMINPG                                                  01347000
TRMREMB  EQU   TRMBYTE2                                                 01348000
TRMRSACT EQU   TRMBYTE2                                                 01349000
TRMOPTBL EQU   IEDQTRM+18                                               01350000
TRMOPNO  EQU   IEDQTRM+17                                               01351000
TRMCHCIN EQU   IEDQTRM+16                                               01352000
TRMSENSE EQU   TRMSTAT+3                                                01353000
TRMTEMPR EQU   TRMSTAT+2                                                01354000
TRMSIO   EQU   TRMSTAT                                                  01355000
@NM00106 EQU   TRMDEVFL+1                                               01356000
TRMTPIN  EQU   TRMDEVFL+1                                               01357000
TRMNCPI  EQU   TRMDEVFL+1                                               01358000
TRMRNTRM EQU   TRMDEVFL+1                                               01359000
@NM00105 EQU   TRMDEVFL+1                                               01360000
TRMLMD   EQU   TRMDEVFL+1                                               01361000
TRMCONC  EQU   TRMDEVFL+1                                               01362000
TRMTSOB  EQU   TRMDEVFL                                                 01363000
TRMBFDY  EQU   TRMDEVFL                                                 01364000
TRMTBLK  EQU   TRMDEVFL                                                 01365000
TRMSBLK  EQU   TRMDEVFL                                                 01366000
TRMBLKS  EQU   TRMDEVFL                                                 01367000
TRMADDC  EQU   TRMDEVFL                                                 01368000
TRMDDIG  EQU   TRMDEVFL                                                 01369000
TRMBUFS  EQU   TRMDEVFL                                                 01370000
TRMPRILK EQU   TRMALTD                                                  01371000
TRMLGB   EQU   TRMDSORG                                                 01372000
TRMUTERM EQU   TLISTCNT                                                 01373000
TRMDESTQ EQU   IEDQTRM+1                                                01374000
TRMSCNYN EQU   TRMSTATE                                                 01375000
TRMHELDN EQU   TRMSTATE                                                 01376000
TRMACPTN EQU   TRMSTATE                                                 01377000
TRMPREF  EQU   TRMSTATE                                                 01378000
TRMPROC  EQU   TRMLOG                                                   01379000
TRMLIST  EQU   TRMLOG                                                   01380000
TRMLINE  EQU   TRMSTATE                                                 01381000
BDUXGRPH EQU   BDUEXRSP                                                 01382000
BDUXFINL EQU   BDUEXRSP                                                 01383000
BDUXINIT EQU   BDUEXRSP                                                 01384000
BDURESP  EQU   BDUSYRSP                                                 01385000
BDUPHASE EQU   BDUSYRSP                                                 01386000
BDUERROR EQU   BDUSYRSP                                                 01387000
BDUXERLK EQU   BDUBDUFG                                                 01388000
BDUALTAK EQU   BDUFNFLG                                                 01389000
BDUNEGAK EQU   BDUFNFLG                                                 01390000
BDUPOSAK EQU   BDUFNFLG                                                 01391000
BDUTPTX  EQU   BDUFNFLG                                                 01392000
BDUFRSTB EQU   BDUFNFLG                                                 01393000
BDULEADG EQU   BDUFNFLG                                                 01394000
BDUSTHDR EQU   BDUFNFLG                                                 01395000
BDUCMND  EQU   IEDBDU                                                   01396000
SAVTBITN EQU   IEDNSVTD+312                                             01397000
@NM00104 EQU   SAVTCKQB+8                                               01398000
@NM00103 EQU   SAVTCKEC+1                                               01399000
@NM00102 EQU   SAVTCKCC                                                 01400000
SAVTCKPO EQU   SAVTCKCC                                                 01401000
SAVTCKWA EQU   SAVTCKCC                                                 01402000
SAVTCKCH EQU   SAVTCKTB+1                                               01403000
SAVTCKVT EQU   SAVTCKTB                                                 01404000
@NM00101 EQU   IEDNSVTD+297                                             01405000
SAVTRDFG EQU   SAVTRDRV+12                                              01406000
@NM00100 EQU   SAVTRDRV+5                                               01407000
SAVTRDPY EQU   SAVTRDRV+4                                               01408000
SAVTRDQB EQU   SAVTRDRV+1                                               01409000
SAVTRDKY EQU   SAVTRDRV                                                 01410000
SAVTNID  EQU   IEDNSVTD+280                                             01411000
SAVTDVAS EQU   IEDNSVTD+276                                             01412000
SAVTPLSZ EQU   IEDNSVTD+274                                             01413000
@NM00099 EQU   IEDNSVTD+273                                             01414000
SAVTSUBL EQU   IEDNSVTD+272                                             01415000
@NM00098 EQU   SAVTZELM+1                                               01416000
SAVTSUBM EQU   SAVTZELM                                                 01417000
SAVTMHDX EQU   IEDNSVTD+268                                             01418000
SAVTNAT1 EQU   IEDNSVTD+266                                             01419000
SAVTSH20 EQU   IEDNSVTD+264                                             01420000
SAVTLCBS EQU   IEDNSVTD+260                                             01421000
SAVTRNMP EQU   IEDNSVTD+256                                             01422000
SAVTTNTX EQU   IEDNSVTD+252                                             01423000
SAVTNAX  EQU   IEDNSVTD+248                                             01424000
SAVTSUBV EQU   IEDNSVTD+247                                             01425000
SAVTSUBA EQU   IEDNSVTD+246                                             01426000
SAVTSIBC EQU   IEDNSVTD+244                                             01427000
SAVTBSM  EQU   IEDNSVTD+240                                             01428000
SAVTSCPT EQU   SAVTTCPU                                                 01429000
SAVTRQTG EQU   IEDNSVTD+236                                             01430000
SAVTRQCH EQU   IEDNSVTD+232                                             01431000
SAVTMAND EQU   IEDNSVTD+228                                             01432000
SAVTSPLN EQU   IEDNSVTD+224                                             01433000
SAVTNADL EQU   IEDNSVTD+222                                             01434000
SAVTNATL EQU   IEDNSVTD+220                                             01435000
SAVTMHTB EQU   IEDNSVTD+216                                             01436000
SAVTSSMH EQU   IEDNSVTD+212                                             01437000
SAVTQRS  EQU   IEDNSVTD+208                                             01438000
SAVTRQIN EQU   IEDNSVTD+204                                             01439000
SAVTDFCO EQU   IEDNSVTD+200                                             01440000
SAVTSAO  EQU   IEDNSVTD+196                                             01441000
SAVTSARI EQU   IEDNSVTD+192                                             01442000
SAVTSAC  EQU   IEDNSVTD+188                                             01443000
SAVTSAI  EQU   IEDNSVTD+184                                             01444000
SAVTCSCI EQU   IEDNSVTD+180                                             01445000
SAVTSSRP EQU   IEDNSVTD+176                                             01446000
SAVTSSRQ EQU   IEDNSVTD+172                                             01447000
SAVTSCLU EQU   IEDNSVTD+168                                             01448000
SAVTXTRQ EQU   IEDNSVTD+164                                             01449000
@NM00097 EQU   IEDNSVTD+148                                             01450000
SAVTIPCQ EQU   IEDNSVTD+144                                             01451000
@NM00096 EQU   IEDNSVTD+136                                             01452000
SAVTXFMI EQU   IEDNSVTD+132                                             01453000
@NM00095 EQU   IEDNSVTD+124                                             01454000
SAVTXFMO EQU   IEDNSVTD+120                                             01455000
@NM00094 EQU   IEDNSVTD+116                                             01456000
SAVTSSSR EQU   IEDNSVTD+112                                             01457000
SAVTSCPQ EQU   IEDNSVTD+108                                             01458000
SAVTSLCB EQU   IEDNSVTD+104                                             01459000
SAVTLUSR EQU   IEDNSVTD+100                                             01460000
@NM00093 EQU   SAVTLUSQ+8                                               01461000
SAVTLUSP EQU   SAVTLUSQ+4                                               01462000
SAVTLUSB EQU   SAVTLUSQ                                                 01463000
@NM00092 EQU   IEDNSVTD+84                                              01464000
SAVTSAT  EQU   IEDNSVTD+80                                              01465000
SAVTNAT  EQU   IEDNSVTD+76                                              01466000
SAVTCLUP EQU   IEDNSVTD+72                                              01467000
SAVTPIUT EQU   IEDNSVTD+68                                              01468000
SAVTRNTA EQU   IEDNSVTD+64                                              01469000
SAVTDNIR EQU   IEDNSVTD+60                                              01470000
SAVTCNIR EQU   IEDNSVTD+56                                              01471000
SAVTFLDH EQU   IEDNSVTD+52                                              01472000
SAVTSRTN EQU   IEDNSVTD+48                                              01473000
SAVTSREQ EQU   IEDNSVTD+44                                              01474000
SAVTFAIL EQU   IEDNSVTD+42                                              01475000
SAVTSUSE EQU   IEDNSVTD+40                                              01476000
SAVTSIB  EQU   IEDNSVTD+36                                              01477000
SAVTPRTN EQU   IEDNSVTD+32                                              01478000
@NM00091 EQU   IEDNSVTD+28                                              01479000
SAVTWH20 EQU   IEDNSVTD+26                                              01480000
SAVTPWT  EQU   IEDNSVTD+24                                              01481000
SAVTPRTQ EQU   IEDNSVTD+20                                              01482000
SAVTPREQ EQU   IEDNSVTD+16                                              01483000
SAVTPH20 EQU   IEDNSVTD+14                                              01484000
SAVTPUSE EQU   IEDNSVTD+12                                              01485000
SAVTPLCB EQU   IEDNSVTD+8                                               01486000
SAVTPOOL EQU   IEDNSVTD+4                                               01487000
SAVTPRMT EQU   SAVTDIAF                                                 01488000
SAVTVIRT EQU   SAVTDIAF                                                 01489000
AVTCPBNO EQU   IEDQAVTD+1244                                            01490000
AVTHRESS EQU   IEDQAVTD+1243                                            01491000
@NM00090 EQU   IEDQAVTD+1242                                            01492000
@NM00089 EQU   IEDQAVTD+1241                                            01493000
@NM00088 EQU   IEDQAVTD+1240                                            01494000
@NM00087 EQU   IEDQAVTD+1237                                            01495000
@NM00086 EQU   IEDQAVTD+1236                                            01496000
AVTHRESE EQU   @NM00085                                                 01497000
AVTRADDR EQU   IEDQAVTD+1228                                            01498000
AVTNADDR EQU   IEDQAVTD+1224                                            01499000
AVTHRESN EQU   IEDQAVTD+1220                                            01500000
AVTVOLRN EQU   IEDQAVTD+1216                                            01501000
AVTTOTNN EQU   IEDQAVTD+1212                                            01502000
AVTTRCYN EQU   IEDQAVTD+1208                                            01503000
AVTRCTRN EQU   IEDQAVTD+1204                                            01504000
AVTNOVON EQU   IEDQAVTD+1200                                            01505000
AVTADEBN EQU   IEDQAVTD+1196                                            01506000
AVTVOLRR EQU   IEDQAVTD+1192                                            01507000
AVTTOTNR EQU   IEDQAVTD+1188                                            01508000
AVTTRCYR EQU   IEDQAVTD+1184                                            01509000
AVTRCTRR EQU   IEDQAVTD+1180                                            01510000
AVTNOVOR EQU   IEDQAVTD+1176                                            01511000
AVTADEBR EQU   IEDQAVTD+1172                                            01512000
AVTLODPT EQU   IEDQAVTD+1168                                            01513000
AVTIOBN  EQU   IEDQAVTD+1164                                            01514000
AVTIOBR  EQU   IEDQAVTD+1160                                            01515000
AVTCPBPT EQU   IEDQAVTD+1156                                            01516000
AVTFCPB  EQU   IEDQAVTD+1152                                            01517000
@NM00084 EQU   IEDQAVTD+1148                                            01518000
AVTINCPQ EQU   IEDQAVTD+1144                                            01519000
@NM00083 EQU   IEDQAVTD+1140                                            01520000
@NM00082 EQU   IEDQAVTD+1137                                            01521000
@NM00081 EQU   AVTBIT4                                                  01522000
@NM00080 EQU   AVTBIT4                                                  01523000
@NM00079 EQU   AVTBIT4                                                  01524000
@NM00078 EQU   AVTBIT4                                                  01525000
@NM00077 EQU   AVTBIT4                                                  01526000
@NM00076 EQU   AVTBIT4                                                  01527000
@NM00075 EQU   AVTBIT4                                                  01528000
AVTRUFTN EQU   AVTBIT4                                                  01529000
@NM00074 EQU   IEDQAVTD+1132                                            01530000
AVTNOBFQ EQU   IEDQAVTD+1128                                            01531000
@NM00073 EQU   IEDQAVTD+1124                                            01532000
AVTDKENQ EQU   IEDQAVTD+1120                                            01533000
@NM00072 EQU   IEDQAVTD+1116                                            01534000
AVTDKAPQ EQU   IEDQAVTD+1112                                            01535000
AVTCOPY  EQU   IEDQAVTD+1108                                            01536000
AVTIA    EQU   IEDQAVTD+1104                                            01537000
AVTFL    EQU   IEDQAVTD+1100                                            01538000
@NM00071 EQU   IEDQAVTD+1096                                            01539000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01540000
AVTTOTNC EQU   IEDQAVTD+1088                                            01541000
AVTCMAX  EQU   IEDQAVTD+1084                                            01542000
AVTCMIN  EQU   IEDQAVTD+1080                                            01543000
AVTHM02  EQU   IEDQAVTD+1076                                            01544000
AVTOPCIN EQU   IEDQAVTD+1074                                            01545000
AVTDCTLN EQU   IEDQAVTD+1072                                            01546000
AVTOPMSK EQU   IEDQAVTD+1068                                            01547000
AVTDDFT  EQU   IEDQAVTD+1064                                            01548000
AVTSTEAL EQU   IEDQAVTD+1060                                            01549000
AVTOPTN  EQU   IEDQAVTD+1056                                            01550000
AVTDSKCT EQU   IEDQAVTD+1054                                            01551000
AVTCKRST EQU   IEDQAVTD+1053                                            01552000
AVTSTAN  EQU   AVTBIT3                                                  01553000
AVTSTACN EQU   AVTBIT3                                                  01554000
AVTSTAIN EQU   AVTBIT3                                                  01555000
AVTSTAYN EQU   AVTBIT3                                                  01556000
AVTOLTBN EQU   AVTBIT3                                                  01557000
AVTTSAB  EQU   AVTBIT3                                                  01558000
AVTRFULN EQU   AVTBIT3                                                  01559000
AVTRECVN EQU   AVTBIT3                                                  01560000
@NM00070 EQU   AVTBIT2                                                  01561000
@NM00069 EQU   AVTBIT2                                                  01562000
AVTOPEIN EQU   AVTBIT2                                                  01563000
AVTSTRTN EQU   AVTBIT2                                                  01564000
AVTTOPOL EQU   AVTBIT2                                                  01565000
AVTCOPYN EQU   AVTBIT2                                                  01566000
AVTREUSN EQU   AVTBIT2                                                  01567000
AVTEXTSC EQU   AVTBIT2                                                  01568000
AVTDISKN EQU   AVTBIT1                                                  01569000
AVTQUCKN EQU   AVTBIT1                                                  01570000
AVTCLOSN EQU   AVTBIT1                                                  01571000
AVTREADN EQU   AVTBIT1                                                  01572000
AVTDLAYN EQU   AVTBIT1                                                  01573000
AVTAQTAN EQU   AVTBIT1                                                  01574000
AVTTSON  EQU   AVTBIT1                                                  01575000
AVTAPLKN EQU   AVTBIT1                                                  01576000
AVTDUMBR EQU   IEDQAVTD+1048                                            01577000
AVTDLQX  EQU   IEDQAVTD+1046                                            01578000
AVTINTLV EQU   IEDQAVTD+1044                                            01579000
AVTSMCNT EQU   IEDQAVTD+1042                                            01580000
AVTAVFCT EQU   IEDQAVTD+1040                                            01581000
AVTOPCON EQU   IEDQAVTD+1038                                            01582000
AVTOPCNT EQU   IEDQAVTD+1036                                            01583000
AVTLNCNT EQU   IEDQAVTD+1034                                            01584000
AVTHA16  EQU   IEDQAVTD+1030                                            01585000
AVTHA7   EQU   IEDQAVTD+1028                                            01586000
AVTHA4   EQU   IEDQAVTD+1026                                            01587000
AVTHA3   EQU   IEDQAVTD+1024                                            01588000
AVTHA2   EQU   IEDQAVTD+1022                                            01589000
AVTGETMS EQU   IEDQAVTD+1021                                            01590000
@NM00068 EQU   IEDQAVTD+1020                                            01591000
AVTGETMD EQU   IEDQAVTD+1016                                            01592000
AVTGETMN EQU   IEDQAVTD+1012                                            01593000
AVTCWTOT EQU   IEDQAVTD+1008                                            01594000
AVTCWINT EQU   IEDQAVTD+956                                             01595000
AVTDTRAP EQU   IEDQAVTD+952                                             01596000
@NM00067 EQU   IEDQAVTD+950                                             01597000
@NM00066 EQU   AVTIOTR                                                  01598000
AVTIOTRH EQU   AVTIOTR                                                  01599000
AVTIOTRE EQU   AVTIOTR                                                  01600000
@NM00065 EQU   AVTSUBT                                                  01601000
AVTSUBPT EQU   AVTSUBT                                                  01602000
AVTSUBON EQU   AVTSUBT                                                  01603000
AVTAFE30 EQU   IEDQAVTD+944                                             01604000
AVTAFE20 EQU   IEDQAVTD+940                                             01605000
AVTAFE10 EQU   IEDQAVTD+936                                             01606000
AVTCWEC2 EQU   IEDQAVTD+932                                             01607000
AVTCWPM2 EQU   IEDQAVTD+928                                             01608000
AVTCWTS2 EQU   IEDQAVTD+927                                             01609000
AVTCWTS1 EQU   IEDQAVTD+926                                             01610000
AVTCWCLD EQU   AVTCWFL2                                                 01611000
AVTCWRAP EQU   AVTCWFL2                                                 01612000
@NM00064 EQU   AVTCWFL2                                                 01613000
@NM00063 EQU   AVTCWFL2                                                 01614000
@NM00062 EQU   AVTCWFL2                                                 01615000
@NM00061 EQU   AVTCWFL2                                                 01616000
@NM00060 EQU   AVTCWFL2                                                 01617000
AVTCWACT EQU   AVTCWFL2                                                 01618000
@NM00059 EQU   AVTCWFL1                                                 01619000
@NM00058 EQU   AVTCWFL1                                                 01620000
@NM00057 EQU   AVTCWFL1                                                 01621000
@NM00056 EQU   AVTCWFL1                                                 01622000
@NM00055 EQU   AVTCWFL1                                                 01623000
@NM00054 EQU   AVTCWFL1                                                 01624000
@NM00053 EQU   AVTCWFL1                                                 01625000
AVTCOMWN EQU   AVTCWFL1                                                 01626000
AVTCWEC1 EQU   IEDQAVTD+920                                             01627000
AVTCWPM1 EQU   IEDQAVTD+916                                             01628000
AVTCAREA EQU   IEDQAVTD+912                                             01629000
AVTFZERO EQU   IEDQAVTD+908                                             01630000
AVTCADDR EQU   IEDQAVTD+904                                             01631000
AVTCOREC EQU   IEDQAVTD+900                                             01632000
@NM00052 EQU   IEDQAVTD+892                                             01633000
AVTCPBCB EQU   IEDQAVTD+888                                             01634000
@NM00051 EQU   IEDQAVTD+880                                             01635000
AVTDSIOB EQU   IEDQAVTD+876                                             01636000
@NM00050 EQU   IEDQAVTD+868                                             01637000
AVTCPRMB EQU   IEDQAVTD+864                                             01638000
@NM00049 EQU   IEDQAVTD+856                                             01639000
AVTCLOSB EQU   IEDQAVTD+852                                             01640000
@NM00048 EQU   IEDQAVTD+844                                             01641000
AVTACTIB EQU   IEDQAVTD+840                                             01642000
@NM00047 EQU   IEDQAVTD+836                                             01643000
AVTOLTEB EQU   IEDQAVTD+832                                             01644000
AVTOLTCH EQU   AVTOLTQB+1                                               01645000
AVTOLTVT EQU   AVTOLTQB                                                 01646000
@NM00046 EQU   AVTOPCQB+8                                               01647000
@NM00045 EQU   AVTOPCEC+1                                               01648000
@NM00044 EQU   AVTOPCCC                                                 01649000
AVTOPCPO EQU   AVTOPCCC                                                 01650000
AVTOPCWA EQU   AVTOPCCC                                                 01651000
AVTOPCCH EQU   AVTOPCOB+1                                               01652000
AVTOPCVT EQU   AVTOPCOB                                                 01653000
@NM00043 EQU   AVTCKPQB+9                                               01654000
AVTCKPTS EQU   AVTCKPQB+8                                               01655000
@NM00042 EQU   AVTCKPEC+1                                               01656000
@NM00041 EQU   AVTCKPCC                                                 01657000
AVTCKPPO EQU   AVTCKPCC                                                 01658000
AVTCKPWA EQU   AVTCKPCC                                                 01659000
AVTCKPCH EQU   AVTCKPTB+1                                               01660000
AVTCKPVT EQU   AVTCKPTB                                                 01661000
@NM00040 EQU   IEDQAVTD+796                                             01662000
AVTBFRTB EQU   IEDQAVTD+792                                             01663000
@NM00039 EQU   IEDQAVTD+784                                             01664000
AVTBFREB EQU   IEDQAVTD+780                                             01665000
AVTTIMQ  EQU   IEDQAVTD+776                                             01666000
@NM00038 EQU   IEDQAVTD+772                                             01667000
AVTIMQPS EQU   IEDQAVTD+768                                             01668000
AVTINOUT EQU   IEDQAVTD+766                                             01669000
AVTREFTM EQU   IEDQAVTD+764                                             01670000
@NM00037 EQU   IEDQAVTD+752                                             01671000
AVTDELYB EQU   IEDQAVTD+748                                             01672000
AVTOCQPT EQU   IEDQAVTD+744                                             01673000
AVTTSOPT EQU   IEDQAVTD+740                                             01674000
AVTSUPPT EQU   IEDQAVTD+736                                             01675000
AVTCBQCB EQU   IEDQAVTD+732                                             01676000
AVTMSGS  EQU   IEDQAVTD+729                                             01677000
@NM00036 EQU   AVTSYSER                                                 01678000
@NM00035 EQU   AVTSYSER                                                 01679000
@NM00034 EQU   AVTSYSER                                                 01680000
@NM00033 EQU   AVTSYSER                                                 01681000
@NM00032 EQU   AVTSYSER                                                 01682000
@NM00031 EQU   AVTSYSER                                                 01683000
AVTCMAXN EQU   AVTSYSER                                                 01684000
AVTCMINN EQU   AVTSYSER                                                 01685000
AVT2260L EQU   IEDQAVTD+724                                             01686000
AVTABEPL EQU   AVTADBUF                                                 01687000
AVTHFF   EQU   AVTCLRHI+2                                               01688000
@NM00030 EQU   AVTCLRHI                                                 01689000
AVTCCLNK EQU   AVTCRELE+5                                               01690000
AVTCCPRI EQU   AVTCRELE+4                                               01691000
AVTCCQCB EQU   AVTCCELE+1                                               01692000
AVTCCKEY EQU   AVTCCELE                                                 01693000
AVTDELAD EQU   IEDQAVTD+704                                             01694000
AVTDELEM EQU   IEDQAVTD+700                                             01695000
AVTBSX   EQU   AVTCKLNK                                                 01696000
AVTOPETR EQU   AVTHG01                                                  01697000
@NM00029 EQU   AVTCKBYT                                                 01698000
AVTCKONQ EQU   AVTCKBYT                                                 01699000
@NM00028 EQU   AVTCKBYT                                                 01700000
@NM00027 EQU   AVTCKBYT                                                 01701000
@NM00026 EQU   AVTCKBYT                                                 01702000
@NM00025 EQU   AVTCKBYT                                                 01703000
@NM00024 EQU   AVTCKBYT                                                 01704000
@NM00023 EQU   AVTCKBYT                                                 01705000
AVTOPERT EQU   IEDQAVTD+690                                             01706000
AVTOPXCL EQU   IEDQAVTD+688                                             01707000
AVTOPERL EQU   IEDQAVTD+687                                             01708000
@NM00022 EQU   IEDQAVTD+686                                             01709000
AVTCKTIM EQU   IEDQAVTD+684                                             01710000
AVTCKELV EQU   IEDQAVTD+682                                             01711000
AVTCPRCD EQU   IEDQAVTD+681                                             01712000
AVTWARMN EQU   AVTCKELF                                                 01713000
AVTCRTLN EQU   AVTCKELF                                                 01714000
AVTCPIPN EQU   AVTCKELF                                                 01715000
AVTCCLCN EQU   AVTCKELF                                                 01716000
AVTCINCN EQU   AVTCKELF                                                 01717000
@NM00021 EQU   AVTCKELF                                                 01718000
AVTCMCPN EQU   AVTCKELF                                                 01719000
AVTNQBCK EQU   AVTCKELF                                                 01720000
AVTCKQAD EQU   IEDQAVTD+677                                             01721000
AVTSCBSZ EQU   IEDQAVTD+676                                             01722000
@NM00020 EQU   IEDQAVTD+672                                             01723000
AVTCKELE EQU   IEDQAVTD+668                                             01724000
@NM00019 EQU   AVTCKPEL+8                                               01725000
AVTCKRLK EQU   AVTCKPEL+5                                               01726000
AVTCKRPR EQU   AVTCKPEL+4                                               01727000
AVTCKRMQ EQU   AVTCKRMV+1                                               01728000
AVTCKRKY EQU   AVTCKRMV                                                 01729000
AVTHK    EQU   IEDQAVTD+648                                             01730000
AVTHI    EQU   IEDQAVTD+644                                             01731000
AVTIOT   EQU   IEDQAVTD+640                                             01732000
AVTNX    EQU   IEDQAVTD+636                                             01733000
AVTTONE  EQU   IEDQAVTD+632                                             01734000
AVTA3TL  EQU   IEDQAVTD+628                                             01735000
AVTDMECB EQU   IEDQAVTD+624                                             01736000
AVTABEND EQU   IEDQAVTD+618                                             01737000
AVTPLCBN EQU   IEDQAVTD+616                                             01738000
@NM00018 EQU   AVTSAVTP+1                                               01739000
@NM00017 EQU   AVTSAVTF                                                 01740000
AVTSNA   EQU   AVTSAVTF                                                 01741000
AVTONSNA EQU   AVTSAVTF                                                 01742000
AVTVTMCP EQU   AVTSAVTF                                                 01743000
@NM00016 EQU   IEDQAVTD+608                                             01744000
AVTCMBSS EQU   IEDQAVTD+604                                             01745000
AVTRCV   EQU   IEDQAVTD+600                                             01746000
AVTSEND  EQU   IEDQAVTD+596                                             01747000
AVTCSCH  EQU   IEDQAVTD+592                                             01748000
AVTQ1    EQU   IEDQAVTD+588                                             01749000
AVTE7    EQU   IEDQAVTD+584                                             01750000
AVTHB    EQU   IEDQAVTD+580                                             01751000
AVTR1    EQU   IEDQAVTD+576                                             01752000
AVTBZ    EQU   IEDQAVTD+572                                             01753000
AVTEZ    EQU   IEDQAVTD+568                                             01754000
AVTEC    EQU   IEDQAVTD+564                                             01755000
AVTEW    EQU   IEDQAVTD+560                                             01756000
AVTNDIAL EQU   AVTSCOPT                                                 01757000
AVTN2741 EQU   AVTSCOPT                                                 01758000
AVTCONCO EQU   AVTSCOPT                                                 01759000
AVTCONC  EQU   AVTSCOPT                                                 01760000
AVTCMBUF EQU   AVTSCOPT                                                 01761000
AVTAPDMP EQU   AVTSCOPT                                                 01762000
@NM00015 EQU   AVTSCOPT                                                 01763000
AVTHA    EQU   AVTDISP                                                  01764000
AVTEA    EQU   IEDQAVTD+548                                             01765000
AVTAX    EQU   IEDQAVTD+544                                             01766000
AVTA3    EQU   IEDQAVTD+540                                             01767000
AVTGD    EQU   IEDQAVTD+536                                             01768000
AVTAL    EQU   IEDQAVTD+532                                             01769000
AVTOLTST EQU   AVTHG02                                                  01770000
AVTE8    EQU   IEDQAVTD+524                                             01771000
AVTUI    EQU   IEDQAVTD+520                                             01772000
AVTCOMPT EQU   IEDQAVTD+516                                             01773000
AVTCRSRF EQU   IEDQAVTD+512                                             01774000
@NM00014 EQU   IEDQAVTD+508                                             01775000
AVTKA02  EQU   IEDQAVTD+504                                             01776000
AVTOPTPT EQU   IEDQAVTD+500                                             01777000
AVTPCBPT EQU   IEDQAVTD+496                                             01778000
@NM00013 EQU   AVTECB1                                                  01779000
AVTCOMP  EQU   AVTECB1                                                  01780000
@NM00012 EQU   AVTECB1                                                  01781000
AVTOPECA EQU   IEDQAVTD+488                                             01782000
AVTOLECA EQU   IEDQAVTD+484                                             01783000
AVTCKECA EQU   IEDQAVTD+480                                             01784000
AVTCWECA EQU   IEDQAVTD+476                                             01785000
AVTCWTCB EQU   IEDQAVTD+472                                             01786000
AVTOLTCB EQU   IEDQAVTD+468                                             01787000
AVTOCTCB EQU   IEDQAVTD+464                                             01788000
AVTCKTCB EQU   IEDQAVTD+460                                             01789000
AVTAS    EQU   IEDQAVTD+456                                             01790000
AVTNOLBF EQU   IEDQAVTD+454                                             01791000
AVTNCKPR EQU   IEDQAVTD+453                                             01792000
AVTCIB   EQU   IEDQAVTD+452                                             01793000
AVTSPLPT EQU   IEDQAVTD+448                                             01794000
AVTMVBFR EQU   IEDQAVTD+444                                             01795000
AVTSBTA  EQU   IEDQAVTD+440                                             01796000
AVTRARTN EQU   IEDQAVTD+436                                             01797000
AVTBSCAN EQU   IEDQAVTD+432                                             01798000
AVTRDYA  EQU   IEDQAVTD+428                                             01799000
AVTRNMPT EQU   IEDQAVTD+424                                             01800000
AVTDISTR EQU   IEDQAVTD+420                                             01801000
AVTPARM3 EQU   IEDQAVTD+416                                             01802000
@NM00011 EQU   AVTPKF                                                   01803000
@NM00010 EQU   AVTPKF                                                   01804000
@NM00009 EQU   AVTPKF                                                   01805000
AVTFTCHF EQU   AVTPKF                                                   01806000
@NM00008 EQU   AVTPKF                                                   01807000
@NM00007 EQU   AVTPKF                                                   01808000
@NM00006 EQU   AVTPKF                                                   01809000
@NM00005 EQU   AVTPKF                                                   01810000
AVTPARM  EQU   IEDQAVTD+408                                             01811000
AVTEXS2A EQU   IEDQAVTD+402                                             01812000
AVTEXA2S EQU   IEDQAVTD+396                                             01813000
AVTOCGET EQU   IEDQAVTD+392                                             01814000
AVTCKAVT EQU   @NM00003+1                                               01815000
@NM00004 EQU   AVTCKFLG                                                 01816000
AVTCKHLT EQU   AVTCKFLG                                                 01817000
AVTCKREQ EQU   AVTCKFLG                                                 01818000
AVTCKENV EQU   AVTCKFLG                                                 01819000
AVTCKNAC EQU   AVTCKFLG                                                 01820000
AVTCKTAC EQU   AVTCKFLG                                                 01821000
@NM00002 EQU   IEDQAVTD+384                                             01822000
AVTREADD EQU   IEDQAVTD+380                                             01823000
AVTREADY EQU   IEDQAVTD+376                                             01824000
AVTRACE  EQU   IEDQAVTD+372                                             01825000
AVTTCB   EQU   IEDQAVTD+368                                             01826000
AVTPASWD EQU   IEDQAVTD+360                                             01827000
AVTCTLCH EQU   IEDQAVTD+352                                             01828000
AVTDOUBL EQU   IEDQAVTD+344                                             01829000
AVTDOUBX EQU   IEDQAVTD+336                                             01830000
AVTDPARM EQU   IEDQAVTD+332                                             01831000
AVTCSTCS EQU   IEDQAVTD+328                                             01832000
AVTDLQ   EQU   AVTSAVEX+32                                              01833000
@NM00001 EQU   AVTSAVEX                                                 01834000
AVTSAVE4 EQU   IEDQAVTD+216                                             01835000
AVTSAVE3 EQU   IEDQAVTD+144                                             01836000
AVTSAVE2 EQU   IEDQAVTD+72                                              01837000
AVTSAVE1 EQU   IEDQAVTD                                                 01838000
*                                      END UNREFERENCED COMPONENTS      01839000
@RT00286 EQU   POSTAPPL                                                 01840000
@RT00308 EQU   GETDIAL0                                                 01841000
@RF00308 EQU   MOVFLD                                                   01842000
@RT00311 EQU   GETDIAL                                                  01843000
@RF00311 EQU   MOVFLD                                                   01844000
@RF00306 EQU   SHIFT1                                                   01845000
@RT00318 EQU   SHIFT1                                                   01846000
@RT00322 EQU   MOVIT0                                                   01847000
@RT00331 EQU   SHIFT1                                                   01848000
@RT00335 EQU   CHANG1                                                   01849000
@RT00338 EQU   MOVFLD                                                   01850000
@RF00338 EQU   SHIFT1                                                   01851000
@RT00344 EQU   MOVFLD                                                   01852000
@RF00350 EQU   SHIFT1                                                   01853000
@RT00356 EQU   ERREXIT                                                  01854000
@RT00365 EQU   SHIFT1                                                   01855000
@RT00379 EQU   SIZERR                                                   01856000
@EL01    EQU   @EL00001                                                 01857000
@ENDDATA EQU   *                                                        01858000
@DATEND  EQU   *                                                        01859000
         END   IGCT110D,(C'PLS1119',0701,77217)                         01860000
