         TITLE 'IGCVG10D, STOPLINE FOR 3705 LINES                      *00001000
                        '                                               00002000
IGCVG10D CSECT ,                                                01S0001 00003000
@PROLOG  DS    0H                                               01S0002 00004000
         USING *,RBASE                 ESTABLISH A BASE REG             00005000
         LR    RBASE,REG15             SETUP BASE REG                   00006000
IGCVG10D IEDHJN AFTERHJN,HJN           MODULE IDENTIFICATION MACRO      00007000
*   ROPCAVT=RPARM;                  /* SET THE BASE POINTER FOR THE     00008000
*                                      OP CONTROL AVT                */ 00009000
         LR    ROPCAVT,RPARM                                    03S0286 00010000
*   RSAVE=ADDR(OPCSAVE);            /* SET THE SAVE AREA ADDRESS REG    00011000
*                                      WITH THE ADDRESS OF THE OP       00012000
*                                      CONTROL SAVE AREA             */ 00013000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                          03S0287 00014000
*   RAVT=OPCAVTPT;                  /* SET THE BASE POINTER FOR THE     00015000
*                                      TCAM ADDRESS VECTOR TABLE     */ 00016000
         L     RAVT,OPCAVTPT(,ROPCAVT)                          03S0288 00017000
*   ROPCE=OPCCOPCE;                 /* SET THE BASE POINTER FOR THE     00018000
*                                      OPERATOR CONTROL ELEMENT      */ 00019000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                         03S0289 00020000
*   RPARM=OCTRMTBL;                 /* SET TO GET TTE ADDR   @YM08560*/ 00021000
         LH    RPARM,OCTRMTBL(,ROPCE)                           03S0290 00022000
         N     RPARM,@CF01685                                   03S0290 00023000
*   CALL IEDQTNT;                   /* GET TTE ADDRESS       @YM08560*/ 00024000
         L     @15,AVTRNMPT(,RAVT)                              03S0291 00025000
         BALR  @14,@15                                          03S0291 00026000
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* SET UP LINE TTE ADDRESS  03S0292 00027000
*                                                            @YM08560*/ 00028000
         LR    RTRM,RPARM                                       03S0292 00029000
         SL    RTRM,@CF00035                                    03S0292 00030000
*   OPCFLAG1=ZERO;                  /* CLEAR CONTROL SWITCHES        */ 00031000
         MVI   OPCFLAG1(ROPCAVT),X'00'                          03S0293 00032000
*                                                               03S0294 00033000
*   /*****************************************************************/ 00034000
*   /*                                                               */ 00035000
*   /* PROCESS.RENTRY: TO RE-INTIALIZE IF SECOND ENTRY.              */ 00036000
*   /*                                                               */ 00037000
*   /*****************************************************************/ 00038000
*                                                               03S0294 00039000
*   IF OCRENTRD=ON THEN             /* SECOND ENTRY?                 */ 00040000
         TM    OCRENTRD(ROPCE),B'10000000'                      03S0294 00041000
         BNO   @RF00294                                         03S0294 00042000
*     DO;                           /* YES                           */ 00043000
*       RZERO=ADDR(OPCWAITV);       /* INTIALIZE FOR SCAN            */ 00044000
         LA    RZERO,OPCWAITV(,ROPCAVT)                         03S0296 00045000
*       RPARM=OPCWAITV;             /* GET THE FIRST ELEM ON QUE     */ 00046000
         L     RPARM,OPCWAITV(,ROPCAVT)                         03S0297 00047000
*       DO WHILE ROPCE^=RPARM;                                  03S0298 00048000
         B     @DE00298                                         03S0298 00049000
@DL00298 DS    0H                                               03S0299 00050000
*         RZERO=RPARM;              /* LAST OPCE NOT A MATCH         */ 00051000
         LR    RZERO,RPARM                                      03S0299 00052000
*         RPARM=RPARM->OCLINK;      /* GET NEXT TO MATCH             */ 00053000
         L     RPARM,OCLINK(,RPARM)                             03S0300 00054000
*       END;                                                    03S0301 00055000
@DE00298 CR    ROPCE,RPARM                                      03S0301 00056000
         BNE   @DL00298                                         03S0301 00057000
*       RZERO->OCLINK=RPARM->OCLINK;/* DELINK FROM THE CHAIN         */ 00058000
         L     @14,OCLINK(,RPARM)                               03S0302 00059000
         LR    @09,RZERO                                        03S0302 00060000
         ST    @14,OCLINK(,@09)                                 03S0302 00061000
*       OCLINK=''B;                                             03S0303 00062000
         SLR   @14,@14                                          03S0303 00063000
         ST    @14,OCLINK(,ROPCE)                               03S0303 00064000
*       OCRENTRD=OFF;               /* RESET SWITCH                  */ 00065000
         NI    OCRENTRD(ROPCE),B'01111111'                      03S0304 00066000
*     END;                                                      03S0305 00067000
*   ELSE                                                        03S0306 00068000
*     ;                             /* FIRST TIME IN GO AHEAD AND       00069000
*                                      PROCESS                       */ 00070000
@RF00294 DS    0H                                               03S0307 00071000
*   IF ERRFLG=OFF THEN                                          02S0307 00072000
         TM    ERRFLG(ROPCAVT),B'10000000'                      02S0307 00073000
         BNZ   @RF00307                                         02S0307 00074000
*     DO;                           /* IF NO TOTE ERRORS, CONTINUE   */ 00075000
*                                                               03S0309 00076000
*       /*************************************************************/ 00077000
*       /*                                                           */ 00078000
*       /* PROCESS.SRCECHK: IF NOT A CONSOLE OR TOTE REQUEST, CHECK  */ 00079000
*       /* TO SEE IF SOURCE TERMINAL IS ON LINE BEING STOPPED        */ 00080000
*       /*                                                           */ 00081000
*       /*************************************************************/ 00082000
*                                                               03S0309 00083000
*       IF OCCONSOL=OFF&OCTOTE=OFF THEN                         03S0309 00084000
         TM    OCCONSOL(ROPCE),B'11000000'                      03S0309 00085000
         BNZ   @RF00309                                         03S0309 00086000
*         DO;                       /* IF THIS IS NOT A CONSOLE OR      00087000
*                                      TOTE REQUEST CONTINUE VALIDITY   00088000
*                                      CHECK                         */ 00089000
*           RPARM=OCDEST;           /* GET TTCIN OF SOURCE TERMINAL  */ 00090000
         LH    RPARM,OCDEST(,ROPCE)                             03S0311 00091000
         N     RPARM,@CF01685                                   03S0311 00092000
*           IF RPARM^=ZERO THEN                                 03S0312 00093000
         LTR   RPARM,RPARM                                      03S0312 00094000
         BZ    @RF00312                                         03S0312 00095000
*             DO;                   /* IF THIS IS A VALID       03S0313 00096000
*                                      DESTINATION, CONTINUE VALIDITY   00097000
*                                      CHECKING                      */ 00098000
*               CALL IPCHEK;        /* CHECK OUT SOURCE TERMINAL     */ 00099000
         BAL   @14,IPCHEK                                       03S0314 00100000
*               IF ERRFLG=ON THEN                               03S0315 00101000
         TM    ERRFLG(ROPCAVT),B'10000000'                      03S0315 00102000
         BNO   @RF00315                                         03S0315 00103000
*                 DO;               /* IF AN ERROR HAS OCCURRED,        00104000
*                                      PROCESS ERROR                 */ 00105000
*                   RPARM=FOUR;     /* SETUP ERROR RETURN CODE       */ 00106000
         LA    RPARM,4                                          03S0317 00107000
*                   RZERO=MSG13;    /* SETUP MSG ID                  */ 00108000
         LA    RZERO,13                                         03S0318 00109000
*                 END;                                          03S0319 00110000
*             END;                                              03S0320 00111000
@RF00315 DS    0H                                               03S0321 00112000
*         END;                                                  03S0321 00113000
@RF00312 DS    0H                                               03S0322 00114000
*       IF ERRFLG=OFF THEN                                      02S0322 00115000
@RF00309 TM    ERRFLG(ROPCAVT),B'10000000'                      02S0322 00116000
         BNZ   @RF00322                                         02S0322 00117000
*         DO;                       /* IF NO ERRORS ON SOURCE   02S0323 00118000
*                                      TERMINALS, CONTINUE CHECK        00119000
*                                      PRIMARY OP CONTROL TERMINAL   */ 00120000
*                                                               03S0324 00121000
*           /*********************************************************/ 00122000
*           /*                                                       */ 00123000
*           /* PROCESS.PRIMCHK: VERFIFY THAT THE PRIMARY OP CONTROL  */ 00124000
*           /* TERM IS NOT ATTACHED IS NOT ATTACHED TO THE LINE BEING*/ 00125000
*           /* STOPPED                                               */ 00126000
*           /*                                                       */ 00127000
*           /*********************************************************/ 00128000
*                                                               03S0324 00129000
*           RPARM=AVTOPCIN;         /* GET TTCIN OF PRIMARY OP  03S0324 00130000
*                                      CONTROL TERMINAL      @YM06161*/ 00131000
         LH    RPARM,AVTOPCIN(,RAVT)                            03S0324 00132000
         N     RPARM,@CF01685                                   03S0324 00133000
*           IF RPARM^=ZERO THEN                                 03S0325 00134000
         LTR   RPARM,RPARM                                      03S0325 00135000
         BZ    @RF00325                                         03S0325 00136000
*             DO;                   /* IF THERE IS A TTCIN, CONTINUE    00137000
*                                      CHECKING TERMINAL             */ 00138000
*               CALL IPCHEK;        /* CHECK OUT PRIMARY OP CONTROL     00139000
*                                      TERMINAL                      */ 00140000
         BAL   @14,IPCHEK                                       03S0327 00141000
*               IF ERRFLG=ON THEN                               03S0328 00142000
         TM    ERRFLG(ROPCAVT),B'10000000'                      03S0328 00143000
         BNO   @RF00328                                         03S0328 00144000
*                 DO;               /* IF ERROR HAS OCCURRED THEN       00145000
*                                      PROCESS ERROR                 */ 00146000
*                   RPARM=FOUR;     /* SETUP ERROR RETURN CODE       */ 00147000
         LA    RPARM,4                                          03S0330 00148000
*                   RZERO=MSG542;   /* SETUP MSG NUMBER              */ 00149000
         LA    RZERO,542                                        03S0331 00150000
*                 END;                                          03S0332 00151000
*             END;                                              03S0333 00152000
@RF00328 DS    0H                                               03S0334 00153000
*         END;                                                  02S0334 00154000
@RF00325 DS    0H                                               02S0335 00155000
*     END;                                                      02S0335 00156000
@RF00322 DS    0H                                               02S0336 00157000
*   IF ERRFLG=OFF THEN                                          02S0336 00158000
@RF00307 TM    ERRFLG(ROPCAVT),B'10000000'                      02S0336 00159000
         BNZ   @RF00336                                         02S0336 00160000
*     DO;                           /* NO ERRORS OCCURRED    @YM08560*/ 00161000
*                                                               03S0338 00162000
*       /*************************************************************/ 00163000
*       /*                                                           */ 00164000
*       /* PROCESS.TOTECHK: MAKE TOTE CHECKS FOR LINE                */ 00165000
*       /*                                                           */ 00166000
*       /*************************************************************/ 00167000
*                                                               03S0338 00168000
*       IF OCTOTE=OFF THEN          /* IF CMD NOT ISSUED BY TOTE        00169000
*                                                            @ZM46755*/ 00170000
         TM    OCTOTE(ROPCE),B'01000000'                        03S0338 00171000
         BNZ   @RF00338                                         03S0338 00172000
*         DO;                       /* CHECK IF TOTE CONTROLS LINE OR   00173000
*                                      SUBORDINATE RESOURCES @ZM46744*/ 00174000
*           IF OCRLN^=0&TRMSTOTE=ON THEN                        03S0340 00175000
         CLI   OCRLN(ROPCE),0                                   03S0340 00176000
         BE    @RF00340                                         03S0340 00177000
         TM    TRMSTOTE(RTRM),B'00000001'                       03S0340 00178000
         BNO   @RF00340                                         03S0340 00179000
*             DO;                   /* TOTE CONTROL LINE     @YM08560*/ 00180000
*               RPARM=FOUR;         /* SETUP ERROR RETURN CODE       */ 00181000
         LA    RPARM,4                                          03S0342 00182000
*               RZERO=MSG49;        /* SETUP ERROR MSG ID            */ 00183000
         LA    RZERO,49                                         03S0343 00184000
*               IF AVTOLTCB=ZERO THEN                           03S0344 00185000
         L     @14,AVTOLTCB(,RAVT)                              03S0344 00186000
         LTR   @14,@14                                          03S0344 00187000
         BNZ   @RF00344                                         03S0344 00188000
*                 ERRFLG=ON;        /* IF TOTE ISN'T ACTIVE THEN SET    00189000
*                                      ERROR FLAG                    */ 00190000
         OI    ERRFLG(ROPCAVT),B'10000000'                      03S0345 00191000
*             END;                                              03S0346 00192000
*           ELSE                    /* CHECK FOR TOTE OWNED     03S0347 00193000
*                                      SUBORDINATE RESOURCE          */ 00194000
*             DO;                   /* BEFORE CONTINUING THE STOPLINE*/ 00195000
         B     @RC00340                                         03S0347 00196000
@RF00340 DS    0H                                               03S0348 00197000
*               OCPARM=OCTRMTBL;    /* SAVE ORIGINAL TTCIN   @YM08560*/ 00198000
         LH    @14,OCTRMTBL(,ROPCE)                             03S0348 00199000
         N     @14,@CF01685                                     03S0348 00200000
         STH   @14,OCPARM(,ROPCE)                               03S0348 00201000
*               DO UNTIL TRMTYPE=TRMGRP|OCRLN^=ZERO;/* FIND GROUP OF    00202000
*                                      FIRST LINE            @YM08560*/ 00203000
@DL00349 DS    0H                                               03S0350 00204000
*                 RPARM=IGCVG;      /* ID TO RETURN TO AFTER TOTE       00205000
*                                      COMPLETES                     */ 00206000
         L     RPARM,@CF01671                                   03S0350 00207000
*                 CALL CHCKTOTE;    /* VERIFY BEFORE CONTINUING      */ 00208000
         L     @15,OPCTOTCK(,ROPCAVT)                           03S0351 00209000
         BALR  @14,@15                                          03S0351 00210000
*                 IF RZERO=SUSPEND THEN/* TOTE OWNERSHIP?            */ 00211000
         C     RZERO,@CF00060                                   03S0352 00212000
         BNE   @RF00352                                         03S0352 00213000
*                   DO;             /* YES                           */ 00214000
*                     OCRENTRD=ON;  /* SET RENTRY FLAG               */ 00215000
         OI    OCRENTRD(ROPCE),B'10000000'                      03S0354 00216000
*                     OCLINK=OPCWAITV;/* LINK TOP ELEM TO OPCE       */ 00217000
         L     @14,OPCWAITV(,ROPCAVT)                           03S0355 00218000
         ST    @14,OCLINK(,ROPCE)                               03S0355 00219000
*                     OPCWAITV=ROPCE;/* PUT OPCE ON WAIT CHAIN       */ 00220000
         ST    ROPCE,OPCWAITV(,ROPCAVT)                         03S0356 00221000
*                     OPCMODID=IGC00;/* GIVE CONTROL TO 00           */ 00222000
         MVC   OPCMODID(2,ROPCAVT),@CC01673                     03S0357 00223000
*                   END;                                        03S0358 00224000
*                 ELSE                                          03S0359 00225000
*                   ;               /* NO TOTE OWNERSHIP CONTINUE    */ 00226000
@RF00352 DS    0H                                               03S0360 00227000
*                 RPARM=TRMCOHTG;   /* GET COHORTG           @YM08560*/ 00228000
         LH    @14,TRMCOHTG(,RTRM)                              03S0360 00229000
         N     @14,@CF01685                                     03S0360 00230000
         LR    RPARM,@14                                        03S0360 00231000
*                 OCTRMTBL=TRMCOHTG;/* SET OCTRMTBL          @YM08560*/ 00232000
         STH   @14,OCTRMTBL(,ROPCE)                             03S0361 00233000
*                 CALL IEDQTNT;     /* GET TTE ADDRESS       @YM08560*/ 00234000
         L     @15,AVTRNMPT(,RAVT)                              03S0362 00235000
         BALR  @14,@15                                          03S0362 00236000
*                 RTRM=RPARM-LENGTH(IEDNTRM);/* SET UP TERM     03S0363 00237000
*                                      ADDRESSIBILTY         @YM08560*/ 00238000
         LR    RTRM,RPARM                                       03S0363 00239000
         SL    RTRM,@CF00035                                    03S0363 00240000
*               END;                                            03S0364 00241000
@DE00349 CLI   TRMTYPE(RTRM),X'00'                              03S0364 00242000
         BE    @DC00349                                         03S0364 00243000
         CLI   OCRLN(ROPCE),0                                   03S0364 00244000
         BE    @DL00349                                         03S0364 00245000
@DC00349 DS    0H                                               03S0365 00246000
*               OCTRMTBL=OCPARM;    /* RESTORE OCTRMTBL      @YM08560*/ 00247000
         LH    @14,OCPARM(,ROPCE)                               03S0365 00248000
         STH   @14,OCTRMTBL(,ROPCE)                             03S0365 00249000
*               OCPARM=ZERO;        /* CLEAR OCPARM          @YM08560*/ 00250000
         SLR   @14,@14                                          03S0366 00251000
         STH   @14,OCPARM(,ROPCE)                               03S0366 00252000
*               RZERO=''B;          /* CLEAR REG 0 FOR IGC0010D 03S0367 00253000
*                                                            @YM08560*/ 00254000
         SLR   RZERO,RZERO                                      03S0367 00255000
*             END;                                              03S0368 00256000
*         END;                      /*                       @ZM46755*/ 00257000
*       ELSE                                                    03S0370 00258000
*         ;                         /*                       @ZM46755*/ 00259000
@RF00338 DS    0H                                               03S0371 00260000
*     END;                          /*                       @YM08560*/ 00261000
@RC00338 DS    0H                                               02S0372 00262000
*   IF ERRFLG=ON THEN                                           02S0372 00263000
@RF00336 TM    ERRFLG(ROPCAVT),B'10000000'                      02S0372 00264000
         BNO   @RF00372                                         02S0372 00265000
*     DO;                           /* IF ANY ERRORS HAVE OCCURRED,     00266000
*                                      DO ERROR PROCESSING           */ 00267000
*                                                               03S0374 00268000
*       /*************************************************************/ 00269000
*       /*                                                           */ 00270000
*       /* PROCESS.ERRPROC: THIS SEGMENT PERFORMS FINAL ERROR        */ 00271000
*       /* PROCESSING                                                */ 00272000
*       /*                                                           */ 00273000
*       /*************************************************************/ 00274000
*                                                               03S0374 00275000
*       EXITFLG=ON;                 /* INDICATE EXIT                 */ 00276000
         OI    EXITFLG(ROPCAVT),B'01000000'                     03S0374 00277000
*       IF OCTOTE=ON THEN                                       03S0375 00278000
         TM    OCTOTE(ROPCE),B'01000000'                        03S0375 00279000
         BNO   @RF00375                                         03S0375 00280000
*         DO;                       /* IF THIS IS A TOTE REQUEST,    */ 00281000
*           RZERO=RPARM;            /* SETUP ERR RETURN CODE         */ 00282000
         LR    RZERO,RPARM                                      03S0377 00283000
*           OPCMODID=MOD07;         /* SETUP EXIT MODULE             */ 00284000
         MVC   OPCMODID(2,ROPCAVT),MOD07                        03S0378 00285000
*         END;                                                  03S0379 00286000
*       ELSE                                                    03S0380 00287000
*         DO;                       /* IF NOT TOTE REQUEST           */ 00288000
         B     @RC00375                                         03S0380 00289000
@RF00375 DS    0H                                               03S0381 00290000
*           OCUNIT=INVALTIC;        /* INDICATE INVALID TIC          */ 00291000
         MVC   OCUNIT(4,ROPCE),@CF01658                         03S0381 00292000
*           OPCMODID=MOD03;         /* SETUP EXIT MODULE             */ 00293000
         MVC   OPCMODID(2,ROPCAVT),MOD03                        03S0382 00294000
*         END;                                                  03S0383 00295000
*     END;                                                      02S0384 00296000
@RC00375 DS    0H                                               02S0385 00297000
*   IF EXITFLG=OFF THEN                                         02S0385 00298000
@RF00372 TM    EXITFLG(ROPCAVT),B'01000000'                     02S0385 00299000
         BNZ   @RF00385                                         02S0385 00300000
*     DO;                           /* MORE PROCESSING LEFT?         */ 00301000
*                                                               03S0387 00302000
*       /*************************************************************/ 00303000
*       /*                                                           */ 00304000
*       /* PROCESS.EXITPROC: THIS SEGMENT PERFORMS FINAL PROCESSING  */ 00305000
*       /*                                                           */ 00306000
*       /*************************************************************/ 00307000
*                                                               03S0387 00308000
*       OPCMODID=MODV8;             /* SETUP EXIT MODULE             */ 00309000
         MVC   OPCMODID(2,ROPCAVT),MODV8                        03S0387 00310000
*       OCPARM=ZERO;                /* RESET RETURN CODE             */ 00311000
         SLR   @14,@14                                          03S0388 00312000
         STH   @14,OCPARM(,ROPCE)                               03S0388 00313000
*       OCRESP=OFF;                 /* SETUP REST OF INTERFACE TO       00314000
*                                      IGCV810D                      */ 00315000
         NI    OCRESP(ROPCE),B'11111110'                        03S0389 00316000
*       OCALSTAT=ZERO;                                          03S0390 00317000
         MVI   OCALSTAT(ROPCE),X'00'                            03S0390 00318000
*       IF OCRLN=ZERO THEN                                      03S0391 00319000
         CLI   OCRLN(ROPCE),0                                   03S0391 00320000
         BNE   @RF00391                                         03S0391 00321000
*         OCALLFLG=ON;              /* IF THIS IS A STOPLINE,ALL        00322000
*                                      REQUEST THEN INDICATE IN OPCE */ 00323000
         OI    OCALLFLG(ROPCE),B'00000100'                      03S0392 00324000
*     END;                                                      02S0393 00325000
@RF00391 DS    0H                                               02S0394 00326000
*                                                               02S0394 00327000
*   /*****************************************************************/ 00328000
*   /*                                                               */ 00329000
*   /* EPILOGUE: THIS SEGMENT COMPLETES THE EPILOGUE CODE THAT WAS   */ 00330000
*   /* ALTERED BY THE MODULE PROCEDURE STATEMENT. THE XCTL ASSEMBLER */ 00331000
*   /* MACRO INSTRUCTION IS USED BY THIS SEGMENT TO TRANSFER CONTROL */ 00332000
*   /* TO THE NEXT MODULE THAT IS TO BE EXECUTED.                    */ 00333000
*   /*                                                               */ 00334000
*   /*****************************************************************/ 00335000
*                                                               02S0394 00336000
*   OPCFLAG1=ZERO;                  /* CLEAR FLAG FIELD              */ 00337000
@RF00385 MVI   OPCFLAG1(ROPCAVT),X'00'                          02S0394 00338000
*   RPARM=ROPCAVT;                  /* SET THE ARGUMENT REGISTER IN     00339000
*                                      PREPARATION TO TRANSFERRING      00340000
*                                      CONTROL TO THE NEXT MODULE    */ 00341000
         LR    RPARM,ROPCAVT                                    02S0395 00342000
*   GEN EXIT REFS(OPCXCTL,ROPCAVT) NOSEQFLOW SETS(REG15);       02S0396 00343000
*                                   /*                                  00344000
         XCTL  SF=(E,OPCXCTL(ROPCAVT)) TRANSFER CONTROL MACRO           00345000
*                                                               02S0397 00346000
*   /*****************************************************************/ 00347000
*   /*                                                               */ 00348000
*   /* IPCHEK: THIS INTERNAL PROCEDURE ASSURES THAT THE SOURCE       */ 00349000
*   /* TERMINAL AND THE PRIMARY OP CONTROL TERMINAL ARE NOT ON THE   */ 00350000
*   /* SAME LINE AS THE LINE TO BE STOPPED.                          */ 00351000
*   /*                                                               */ 00352000
*   /*****************************************************************/ 00353000
*                                                               02S0397 00354000
*IPCHEK:                                                        02S0397 00355000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                            02S0397 00356000
IPCHEK   DS    0H                                               02S0398 00357000
*   RFY                                                         02S0398 00358000
*    (RQCB,                                                     02S0398 00359000
*     REG14) RSTD;                                              02S0398 00360000
*   OPCWRKSP(1)=REG14;              /* SAVE RETURN REG               */ 00361000
         ST    REG14,OPCWRKSP(,ROPCAVT)                         02S0399 00362000
*   CALL IEDQTNT;                   /* FIND TTE ADDRESS              */ 00363000
         L     @15,AVTRNMPT(,RAVT)                              02S0400 00364000
         BALR  @14,@15                                          02S0400 00365000
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* SETUP TERM BASE               */ 00366000
         LR    RTRM,RPARM                                       02S0401 00367000
         SL    RTRM,@CF00035                                    02S0401 00368000
*   IF TRMPREF=ON THEN                                          02S0402 00369000
         TM    TRMPREF(RTRM),B'00010000'                        02S0402 00370000
         BNO   @RF00402                                         02S0402 00371000
*     DO;                           /* IF THIS IS A 3705 RESOURCE,      00372000
*                                      CONTINUE CHECKING             */ 00373000
*       DO UNTIL(RZERO=ZERO|TRMLINE=ON);/* IF RESOURCE IN HIERARCHY     00374000
*                                      FIND LINE ASSOCIATED WITH IT  */ 00375000
@DL00404 DS    0H                                               02S0405 00376000
*         CALL COHORTLK;            /* FIND NXT HIGHER RESOURCE      */ 00377000
         L     @15,OPCHORT(,ROPCAVT)                            02S0405 00378000
         BALR  @14,@15                                          02S0405 00379000
*         RTRM=RPARM-LENGTH(IEDNTRM);/* SETUP TERM BASE              */ 00380000
         LR    RTRM,RPARM                                       02S0406 00381000
         SL    RTRM,@CF00035                                    02S0406 00382000
*       END;                                                    02S0407 00383000
@DE00404 LTR   RZERO,RZERO                                      02S0407 00384000
         BZ    @DC00404                                         02S0407 00385000
         TM    TRMLINE(RTRM),B'10000000'                        02S0407 00386000
         BNO   @DL00404                                         02S0407 00387000
@DC00404 DS    0H                                               02S0408 00388000
*       IF RZERO^=ZERO THEN                                     02S0408 00389000
         LTR   RZERO,RZERO                                      02S0408 00390000
         BZ    @RF00408                                         02S0408 00391000
*         DO;                       /* IF RESOURCE IS IN THE    02S0409 00392000
*                                      HIERARCHY THEN CHECK IT       */ 00393000
*           RQCB=TRMDESTQ;          /* GET QCB ADDRESS OF SOURCE     */ 00394000
         L     RQCB,TRMDESTQ-1(,RTRM)                           02S0410 00395000
         LA    RQCB,0(,RQCB)                                    02S0410 00396000
*           IF QCBLGBAD=LGBADDR THEN                            02S0411 00397000
         CLC   QCBLGBAD(3,RQCB),LGBADDR+40(ROPCE)               02S0411 00398000
         BNE   @RF00411                                         02S0411 00399000
*             DO;                   /* IF GROUP OF INPUT TTCIN IS       00400000
*                                      SAME AS GROUP BEING STOPPED      00401000
*                                      THEN CHECK RLN                */ 00402000
*               IF OCRLN=ZERO|OCRLN=QCBRELLN THEN               02S0413 00403000
         CLI   OCRLN(ROPCE),0                                   02S0413 00404000
         BE    @RT00413                                         02S0413 00405000
         CLC   OCRLN(1,ROPCE),QCBRELLN(RQCB)                    02S0413 00406000
         BNE   @RF00413                                         02S0413 00407000
@RT00413 DS    0H                                               02S0414 00408000
*                 ERRFLG=ON;        /* CHECK FOR RLN OF 'ALL' OR FOR    00409000
*                                      SAME RLN                      */ 00410000
         OI    ERRFLG(ROPCAVT),B'10000000'                      02S0414 00411000
*             END;                                              02S0415 00412000
*         END;                                                  02S0416 00413000
*     END;                                                      02S0417 00414000
*   ELSE                                                        02S0418 00415000
*     ;                                                         02S0418 00416000
@RF00402 DS    0H                                               02S0419 00417000
*   RPARM=OCTRMTBL;                 /* SET TO GET TTE ADDR   @OY19593*/ 00418000
@RC00402 LH    RPARM,OCTRMTBL(,ROPCE)                           02S0419 00419000
         N     RPARM,@CF01685                                   02S0419 00420000
*   CALL IEDQTNT;                   /* GET TTE ADDRESS       @OY19593*/ 00421000
         L     @15,AVTRNMPT(,RAVT)                              02S0420 00422000
         BALR  @14,@15                                          02S0420 00423000
*   RTRM=RPARM-LENGTH(IEDNTRM);     /* SET UP LINE TTE ADDRESS  02S0421 00424000
*                                                            @OY19593*/ 00425000
         LR    RTRM,RPARM                                       02S0421 00426000
         SL    RTRM,@CF00035                                    02S0421 00427000
*   REG14=OPCWRKSP(1);              /* RESTORE RETURN ADDRESS        */ 00428000
         L     REG14,OPCWRKSP(,ROPCAVT)                         02S0422 00429000
*   RFY                                                         02S0423 00430000
*    (RQCB,                                                     02S0423 00431000
*     REG14) UNRSTD;                                            02S0423 00432000
*   END;                                                        02S0424 00433000
@EL00002 DS    0H                                               02S0424 00434000
@EF00002 DS    0H                                               02S0424 00435000
@ER00002 BR    @14                                              02S0424 00436000
*   END IGCVG10D                                                01S0425 00437000
*                                                               01S0425 00438000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00439000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 00440000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 00441000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 00442000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 00443000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 00444000
*/*%INCLUDE SYSUT5  (RFY     )                                       */ 00445000
*/*%INCLUDE SYSUT5  (DCL     )                                       */ 00446000
*/*%INCLUDE SYSUT5  (PROCESS )                                       */ 00447000
*/*%INCLUDE SYSUT5  (INITIAL )                                       */ 00448000
*/*%INCLUDE SYSUT5  (RENTRY  )                                       */ 00449000
*/*%INCLUDE SYSUT5  (SRCECHK )                                       */ 00450000
*/*%INCLUDE SYSUT5  (PRIMCHK )                                       */ 00451000
*/*%INCLUDE SYSUT5  (TOTECHK )                                       */ 00452000
*/*%INCLUDE SYSUT5  (ERRPROC )                                       */ 00453000
*/*%INCLUDE SYSUT5  (EXITPROC)                                       */ 00454000
*/*%INCLUDE SYSUT5  (EPILOGUE)                                       */ 00455000
*/*%INCLUDE SYSUT5  (IPCHEK  )                                       */ 00456000
*                                                               01S0425 00457000
*       ;                                                       01S0425 00458000
@DATA    DS    0H                                                       00459000
         DS    0F                                                       00460000
         DS    0F                                                       00461000
@CF00060 DC    F'1'                                                     00462000
@CF00035 DC    F'18'                                                    00463000
@CF01658 DC    XL4'08000002'                                            00464000
@CF01685 DC    XL4'0000FFFF'                                            00465000
@CF01671 DC    XL2'0'                                                   00466000
         DC    C'VG'                                                    00467000
         DS    0D                                                       00468000
@CC01673 DC    C'00'                                                    00469000
MOD03    DC    CL2'03'                                                  00470000
MOD07    DC    CL2'07'                                                  00471000
MODV8    DC    CL2'V8'                                                  00472000
ZAPAREA  DC    XL104'0'                                                 00473000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00474000
@01      EQU   01                                                       00475000
@02      EQU   02                                                       00476000
@03      EQU   03                                                       00477000
@04      EQU   04                                                       00478000
@05      EQU   05                                                       00479000
@06      EQU   06                                                       00480000
@07      EQU   07                                                       00481000
@08      EQU   08                                                       00482000
@09      EQU   09                                                       00483000
@10      EQU   10                                                       00484000
@11      EQU   11                                                       00485000
@12      EQU   12                                                       00486000
@13      EQU   13                                                       00487000
@14      EQU   14                                                       00488000
@15      EQU   15                                                       00489000
ROPCE    EQU   @03                                                      00490000
ROPCAVT  EQU   @02                                                      00491000
RTRM     EQU   @08                                                      00492000
RAVT     EQU   @04                                                      00493000
RQCB     EQU   @06                                                      00494000
RZERO    EQU   @00                                                      00495000
RPARM    EQU   @01                                                      00496000
RBASE    EQU   @12                                                      00497000
RSAVE    EQU   @13                                                      00498000
REG14    EQU   @14                                                      00499000
REG15    EQU   @15                                                      00500000
IEDQAVTD EQU   0                                                        00501000
AVTSAVEX EQU   IEDQAVTD+288                                             00502000
@NM00003 EQU   IEDQAVTD+388                                             00503000
AVTCKFLG EQU   @NM00003                                                 00504000
AVTBASE  EQU   IEDQAVTD+412                                             00505000
AVTPKF   EQU   AVTBASE                                                  00506000
AVTRNMPT EQU   IEDQAVTD+424                                             00507000
AVTOLTCB EQU   IEDQAVTD+468                                             00508000
AVTOSECB EQU   IEDQAVTD+492                                             00509000
AVTECB1  EQU   AVTOSECB                                                 00510000
AVTHG02  EQU   IEDQAVTD+528                                             00511000
AVTDISP  EQU   IEDQAVTD+552                                             00512000
AVTHD    EQU   IEDQAVTD+556                                             00513000
AVTSCOPT EQU   AVTHD                                                    00514000
AVTSAVTP EQU   IEDQAVTD+612                                             00515000
AVTSAVTF EQU   AVTSAVTP                                                 00516000
AVTCKPEL EQU   IEDQAVTD+652                                             00517000
AVTCKRMV EQU   AVTCKPEL                                                 00518000
AVTCKELF EQU   IEDQAVTD+680                                             00519000
AVTCKBYT EQU   IEDQAVTD+691                                             00520000
AVTHG01  EQU   IEDQAVTD+692                                             00521000
AVTCKLNK EQU   IEDQAVTD+696                                             00522000
AVTCRELE EQU   IEDQAVTD+708                                             00523000
AVTCCELE EQU   AVTCRELE                                                 00524000
AVTCLRHI EQU   IEDQAVTD+716                                             00525000
AVTADBUF EQU   IEDQAVTD+720                                             00526000
AVTSYSER EQU   IEDQAVTD+728                                             00527000
AVTBFRFG EQU   IEDQAVTD+784                                             00528000
AVTCKPQB EQU   IEDQAVTD+804                                             00529000
AVTCKPTB EQU   AVTCKPQB                                                 00530000
AVTCKPEC EQU   AVTCKPQB+4                                               00531000
AVTCKPCC EQU   AVTCKPEC                                                 00532000
AVTOPCQB EQU   IEDQAVTD+816                                             00533000
AVTOPCOB EQU   AVTOPCQB                                                 00534000
AVTOPCEC EQU   AVTOPCQB+4                                               00535000
AVTOPCCC EQU   AVTOPCEC                                                 00536000
AVTOLTQB EQU   IEDQAVTD+828                                             00537000
AVTCWFL1 EQU   IEDQAVTD+924                                             00538000
AVTCWFL2 EQU   IEDQAVTD+925                                             00539000
AVTSUBT  EQU   IEDQAVTD+948                                             00540000
AVTIOTR  EQU   IEDQAVTD+949                                             00541000
AVTBIT1  EQU   IEDQAVTD+1050                                            00542000
AVTBIT2  EQU   IEDQAVTD+1051                                            00543000
AVTBIT3  EQU   IEDQAVTD+1052                                            00544000
AVTOPCIN EQU   IEDQAVTD+1074                                            00545000
AVTBIT4  EQU   IEDQAVTD+1136                                            00546000
@NM00085 EQU   IEDQAVTD+1232                                            00547000
IEDQAPTR EQU   0                                                        00548000
IEDNSVTD EQU   0                                                        00549000
SAVTDIAG EQU   IEDNSVTD                                                 00550000
SAVTDIAF EQU   SAVTDIAG                                                 00551000
SAVTLUSQ EQU   IEDNSVTD+88                                              00552000
SAVTTCPU EQU   IEDNSVTD+238                                             00553000
SAVTZELM EQU   IEDNSVTD+270                                             00554000
SAVTRDRV EQU   IEDNSVTD+284                                             00555000
SAVTCKQB EQU   IEDNSVTD+300                                             00556000
SAVTCKTB EQU   SAVTCKQB                                                 00557000
SAVTCKEC EQU   SAVTCKQB+4                                               00558000
SAVTCKCC EQU   SAVTCKEC                                                 00559000
SAVTNETF EQU   IEDNSVTD+324                                             00560000
SAVTCDRV EQU   IEDNSVTD+332                                             00561000
IEDQOPCE EQU   0                                                        00562000
OCLINK   EQU   IEDQOPCE                                                 00563000
OCELEM   EQU   IEDQOPCE+4                                               00564000
OCUNIT   EQU   IEDQOPCE+8                                               00565000
OCRUDEST EQU   OCUNIT                                                   00566000
OCCKPKEY EQU   OCRUDEST                                                 00567000
OCSCAN   EQU   OCCKPKEY                                                 00568000
@NM00109 EQU   OCRUDEST+1                                               00569000
OCUNITBF EQU   @NM00109+2                                               00570000
OCOPTCDE EQU   IEDQOPCE+12                                              00571000
OCSWITCH EQU   IEDQOPCE+13                                              00572000
OCFLAG   EQU   IEDQOPCE+14                                              00573000
OCCONSOL EQU   OCFLAG                                                   00574000
OCTOTE   EQU   OCFLAG                                                   00575000
OCRESP   EQU   OCFLAG                                                   00576000
OCRLN    EQU   IEDQOPCE+15                                              00577000
OCCIB    EQU   IEDQOPCE+16                                              00578000
OCMSTSAV EQU   OCCIB                                                    00579000
OCDEST   EQU   OCMSTSAV                                                 00580000
OCTRMTBL EQU   IEDQOPCE+20                                              00581000
OCLINENO EQU   IEDQOPCE+22                                              00582000
OCTIOT   EQU   OCLINENO                                                 00583000
OCWTGB   EQU   OCTIOT                                                   00584000
OCTRUNIT EQU   IEDQOPCE+24                                              00585000
OCRSID   EQU   OCTRUNIT                                                 00586000
OCALSTAT EQU   OCRSID                                                   00587000
OCRENTRD EQU   OCALSTAT                                                 00588000
OCALLFLG EQU   OCALSTAT                                                 00589000
OCPARM   EQU   IEDQOPCE+28                                              00590000
OCBACKUP EQU   IEDQOPCE+32                                              00591000
OCBUFNED EQU   OCBACKUP                                                 00592000
OCBUFGOT EQU   OCBACKUP+2                                               00593000
OCMODNME EQU   IEDQOPCE+40                                              00594000
OCIPLWA  EQU   OCMODNME                                                 00595000
OCCKDATA EQU   IEDQOPCE+48                                              00596000
OCRSTGTM EQU   OCCKDATA                                                 00597000
OC379RRT EQU   OCRSTGTM                                                 00598000
IEDQOPCN EQU   0                                                        00599000
OCLDNME  EQU   IEDQOPCN                                                 00600000
OCLINTTE EQU   OCLDNME                                                  00601000
OCREQFLG EQU   OCLINTTE+2                                               00602000
OCPREFLG EQU   OCLINTTE+3                                               00603000
IEDQOPCD EQU   0                                                        00604000
OPCAVTPT EQU   IEDQOPCD+8                                               00605000
OPCCOPCE EQU   IEDQOPCD+12                                              00606000
OPCSAVE  EQU   IEDQOPCD+56                                              00607000
OPCFLAG1 EQU   IEDQOPCD+146                                             00608000
OPCAQCTL EQU   IEDQOPCD+180                                             00609000
OPCXCTL  EQU   IEDQOPCD+204                                             00610000
OPCLDNME EQU   IEDQOPCD+212                                             00611000
OPCMODID EQU   OPCLDNME+3                                               00612000
OPCHORT  EQU   IEDQOPCD+256                                             00613000
OPCSPEC  EQU   IEDQOPCD+300                                             00614000
OPCWRKSP EQU   IEDQOPCD+320                                             00615000
OPCTOTCK EQU   IEDQOPCD+360                                             00616000
OPCWAITV EQU   IEDQOPCD+364                                             00617000
OPCPWCOB EQU   IEDQOPCD+368                                             00618000
OPCPWQCB EQU   OPCPWCOB                                                 00619000
OPCPWECB EQU   OPCPWCOB+4                                               00620000
OPCSESS  EQU   IEDQOPCD+384                                             00621000
OPCPCID  EQU   IEDQOPCD+456                                             00622000
OPCUNIQP EQU   OPCPCID+2                                                00623000
OPCSESSF EQU   IEDQOPCD+464                                             00624000
OPCBLIN  EQU   OPCSESSF                                                 00625000
IEDQQCB  EQU   0                                                        00626000
QCBDSFLG EQU   IEDQQCB                                                  00627000
QCBDISK  EQU   QCBDSFLG                                                 00628000
QCBELCHN EQU   IEDQQCB+1                                                00629000
QCBEOLDT EQU   IEDQQCB+16                                               00630000
QCBBYTE1 EQU   QCBEOLDT+1                                               00631000
QCBLKRLN EQU   IEDQQCB+18                                               00632000
QCBRETCT EQU   QCBLKRLN                                                 00633000
QCBSTAT  EQU   IEDQQCB+19                                               00634000
QCBINSRC EQU   IEDQQCB+21                                               00635000
QCBTSOF2 EQU   QCBINSRC+1                                               00636000
QCBTSOF1 EQU   QCBINSRC+2                                               00637000
QCBINTVL EQU   IEDQQCB+24                                               00638000
QCBPREN  EQU   IEDQQCB+28                                               00639000
QCBLKRRN EQU   QCBPREN+1                                                00640000
QCBRELLN EQU   IEDQQCB+32                                               00641000
QCBDCBAD EQU   IEDQQCB+33                                               00642000
QCBLGBAD EQU   QCBDCBAD                                                 00643000
QCBFLAG  EQU   IEDQQCB+36                                               00644000
IEDQQPTR EQU   0                                                        00645000
IEDQPQCB EQU   0                                                        00646000
QCBFHDLZ EQU   IEDQPQCB+3                                               00647000
QCBFHDTZ EQU   IEDQPQCB+6                                               00648000
QCBINTLF EQU   IEDQPQCB+12                                              00649000
IEDNQCB  EQU   0                                                        00650000
QCBSTAT1 EQU   IEDNQCB+4                                                00651000
QCBPLCBA EQU   IEDNQCB+5                                                00652000
IEDTRM   EQU   0                                                        00653000
IEDNTRM  EQU   IEDTRM                                                   00654000
TRMINDEX EQU   IEDNTRM                                                  00655000
TRMCOHTG EQU   IEDNTRM+2                                                00656000
TRMBYTE6 EQU   TRMCOHTG                                                 00657000
TRMCDF0  EQU   TRMBYTE6                                                 00658000
TRMBYTE5 EQU   TRMCOHTG+1                                               00659000
TRMBYTE4 EQU   IEDNTRM+4                                                00660000
TRMBYTE3 EQU   IEDNTRM+5                                                00661000
TRMBYTE2 EQU   IEDNTRM+6                                                00662000
TRMINPG  EQU   TRMBYTE2                                                 00663000
TRMBYTE1 EQU   IEDNTRM+7                                                00664000
TRMSCPRQ EQU   TRMBYTE1                                                 00665000
TRMSTOTE EQU   TRMBYTE1                                                 00666000
TRMBYTE0 EQU   IEDNTRM+10                                               00667000
TRMNOWCD EQU   TRMBYTE0                                                 00668000
TRMSIBPT EQU   IEDNTRM+11                                               00669000
TRMLTRAC EQU   TRMSIBPT                                                 00670000
TRMRLMCT EQU   IEDNTRM+14                                               00671000
TRMLGBST EQU   TRMRLMCT                                                 00672000
TRMTYPE  EQU   IEDNTRM+15                                               00673000
IEDQTRM  EQU   IEDTRM+18                                                00674000
TRMSTATE EQU   IEDQTRM                                                  00675000
TRMLINE  EQU   TRMSTATE                                                 00676000
TRMLOG   EQU   TRMSTATE                                                 00677000
TRMPREF  EQU   TRMSTATE                                                 00678000
TRMDESTQ EQU   IEDQTRM+1                                                00679000
TRMRSTRT EQU   TRMDESTQ+2                                               00680000
TRMINSEQ EQU   IEDQTRM+4                                                00681000
TLISTCNT EQU   TRMINSEQ                                                 00682000
TRMSESCT EQU   TLISTCNT                                                 00683000
TRMOUTSQ EQU   IEDQTRM+6                                                00684000
TLISTEN  EQU   TRMOUTSQ                                                 00685000
TRMDSORG EQU   TLISTEN                                                  00686000
TRMPLIM  EQU   TLISTEN+1                                                00687000
TRMALTD  EQU   IEDQTRM+8                                                00688000
TRMPRILK EQU   TRMALTD                                                  00689000
TRMDEVFL EQU   IEDQTRM+10                                               00690000
TRMADDC  EQU   TRMDEVFL                                                 00691000
TRMNCPI  EQU   TRMDEVFL+1                                               00692000
TRMSTAT  EQU   IEDQTRM+12                                               00693000
TRMSIO   EQU   TRMSTAT                                                  00694000
TRMOWNER EQU   TRMSIO                                                   00695000
LGBLINE  EQU   0                                                        00696000
LGBADDR  EQU   LGBLINE+5                                                00697000
IEDQTNT  EQU   0                                                        00698000
COHORTLK EQU   0                                                        00699000
CHCKTOTE EQU   0                                                        00700000
QCBLDCB  EQU   0                                                        00701000
@NM00118 EQU   OCCIB                                                    00702000
@NM00119 EQU   @NM00118+1                                               00703000
OCCKPKY1 EQU   OCCKPKEY                                                 00704000
OCCKPTYP EQU   OCCKPKY1                                                 00705000
OCICACTN EQU   OCMODNME                                                 00706000
OCICDADR EQU   OCICACTN                                                 00707000
OCICSW   EQU   OCICDADR+3                                               00708000
OCFID0   EQU   OCMODNME                                                 00709000
OCFID01  EQU   OCBACKUP                                                 00710000
@NM00124 EQU   OCCKDATA                                                 00711000
OCMSGFLG EQU   OCPREFLG                                                 00712000
OCBKUP1  EQU   OCMODNME                                                 00713000
@NM00129 EQU   OCMODNME                                                 00714000
OCBKUP2  EQU   OCCKDATA                                                 00715000
OCBKUP3  EQU   OCLDNME                                                  00716000
OCRESPTR EQU   OCBKUP3+4                                                00717000
OCDIALLN EQU   OCRESPTR                                                 00718000
OCIPLDMP EQU   OCLDNME+4                                                00719000
OPCAQWD  EQU   OPCAQCTL                                                 00720000
OPCAQWD1 EQU   OPCAQWD                                                  00721000
OPCAQWD2 EQU   OPCAQWD+4                                                00722000
OPCAQWD3 EQU   OPCAQWD+8                                                00723000
@NM00154 EQU   QCBFHDLZ                                                 00724000
TRMDIALQ EQU   TRMPLIM                                                  00725000
@NM00163 EQU   TRMSTATE                                                 00726000
TRMCDFD0 EQU   TRMBYTE5                                                 00727000
TRMPRE1  EQU   TRMBYTE4                                                 00728000
TRMNCP1  EQU   TRMBYTE4                                                 00729000
TRMLU1   EQU   TRMBYTE4                                                 00730000
TRMLINK1 EQU   TRMBYTE4                                                 00731000
TRMDCONS EQU   TRMLINK1                                                 00732000
TRMPRE   EQU   TRMBYTE3                                                 00733000
TRMNCP   EQU   TRMBYTE3                                                 00734000
TRMPU    EQU   TRMBYTE3                                                 00735000
TRMLU    EQU   TRMBYTE3                                                 00736000
TRMCDMGR EQU   TRMBYTE3                                                 00737000
TRMLINK  EQU   TRMBYTE3                                                 00738000
FLAGS    EQU   OPCFLAG1                                                 00739000
ERRFLG   EQU   FLAGS                                                    00740000
EXITFLG  EQU   FLAGS                                                    00741000
OCLINRRT EQU   OCTRUNIT                                                 00742000
OCPCID   EQU   OCBACKUP                                                 00743000
OCRSNCDE EQU   OCALSTAT                                                 00744000
TRMOPT   EQU   IEDQTRM+20                                               00745000
TRMPOOLP EQU   TRMINSEQ                                                 00746000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00747000
TRMLDISC EQU   TRMLINK                                                  00748000
@NM00180 EQU   TRMLINK                                                  00749000
TRMLALOC EQU   TRMLINK                                                  00750000
TRMLSTAT EQU   TRMLINK                                                  00751000
TRMLINT  EQU   TRMLINK                                                  00752000
TRMEPMOD EQU   TRMLINK                                                  00753000
TRMCDLOG EQU   TRMCDMGR                                                 00754000
@NM00179 EQU   TRMCDMGR                                                 00755000
@NM00178 EQU   TRMCDMGR                                                 00756000
@NM00177 EQU   TRMCDMGR                                                 00757000
@NM00176 EQU   TRMCDMGR                                                 00758000
@NM00175 EQU   TRMCDMGR                                                 00759000
TRMBKDUP EQU   TRMCDMGR                                                 00760000
TRMLULOG EQU   TRMLU                                                    00761000
@NM00174 EQU   TRMLU                                                    00762000
@NM00173 EQU   TRMLU                                                    00763000
@NM00172 EQU   TRMLU                                                    00764000
TRMTDIFF EQU   TRMLU                                                    00765000
@NM00171 EQU   TRMLU                                                    00766000
@NM00170 EQU   TRMLU                                                    00767000
TRMAUTO  EQU   TRMLU                                                    00768000
TRMPCONT EQU   TRMPU                                                    00769000
TRMPDOCQ EQU   TRMPU                                                    00770000
TRMPULOC EQU   TRMPU                                                    00771000
TRMPDNAS EQU   TRMPU                                                    00772000
TRMPALOC EQU   TRMPU                                                    00773000
TRMNCONT EQU   TRMNCP                                                   00774000
TRMQUCKN EQU   TRMNCP                                                   00775000
TRMSLOWN EQU   TRMNCP                                                   00776000
TRMSYGEN EQU   TRMNCP                                                   00777000
TRMNCPCL EQU   TRMNCP                                                   00778000
TRMIPLDM EQU   TRMNCP                                                   00779000
TRMINOUT EQU   TRMPRE                                                   00780000
TRMRDOUT EQU   TRMPRE                                                   00781000
TRMNLOUT EQU   TRMPRE                                                   00782000
TRMWROUT EQU   TRMPRE                                                   00783000
TRMASNXI EQU   TRMPRE                                                   00784000
TRMSTMM  EQU   TRMPRE                                                   00785000
TRMCMODE EQU   TRMPRE                                                   00786000
TRMSTPND EQU   TRMPRE                                                   00787000
TRMNCPLK EQU   TRMLINK1                                                 00788000
@NM00169 EQU   TRMLINK1                                                 00789000
TRMDCONN EQU   TRMDCONS                                                 00790000
TRMDCOP  EQU   TRMDCONS                                                 00791000
TRMPMARY EQU   TRMLU1                                                   00792000
@NM00168 EQU   TRMLU1                                                   00793000
@NM00167 EQU   TRMLU1                                                   00794000
TRMCDSRQ EQU   TRMLU1                                                   00795000
TRMLSCVP EQU   TRMLU1                                                   00796000
@NM00166 EQU   TRMLU1                                                   00797000
@NM00165 EQU   TRMNCP1                                                  00798000
TRMANS   EQU   TRMNCP1                                                  00799000
TRMLINOP EQU   TRMNCP1                                                  00800000
TRMINOP  EQU   TRMNCP1                                                  00801000
TRMLYNCH EQU   TRMPRE1                                                  00802000
TRMSPOUT EQU   TRMPRE1                                                  00803000
TRMERLCK EQU   TRMPRE1                                                  00804000
TRMQNPL  EQU   TRMPRE1                                                  00805000
TRMSPACT EQU   TRMPRE1                                                  00806000
TRMOCNI  EQU   TRMPRE1                                                  00807000
TRMSESSN EQU   TRMPRE1                                                  00808000
TRMCONT  EQU   TRMPRE1                                                  00809000
TRMINERR EQU   TRMCDFD0                                                 00810000
TRMLUTM  EQU   TRMCDFD0                                                 00811000
TRMLUIT  EQU   TRMCDFD0                                                 00812000
TRMLUREQ EQU   TRMCDFD0                                                 00813000
TRMCDPRE EQU   TRMCDFD0                                                 00814000
TRMWASCD EQU   TRMCDFD0                                                 00815000
TRMSRPFG EQU   TRMCDFD0                                                 00816000
TRMSESRQ EQU   TRMCDFD0                                                 00817000
@NM00164 EQU   @NM00163                                                 00818000
TRMENTRY EQU   @NM00163                                                 00819000
TRMSRPTR EQU   TRMDIALQ                                                 00820000
QCBPFEFO EQU   @NM00154+1                                               00821000
QCBDATFL EQU   @NM00154                                                 00822000
OPCAQLST EQU   OPCAQWD3+1                                               00823000
OPCAQRQ3 EQU   OPCAQWD3                                                 00824000
OPCAQSEC EQU   OPCAQWD2+1                                               00825000
OPCAQRQ2 EQU   OPCAQWD2                                                 00826000
OPCAQFST EQU   OPCAQWD1+1                                               00827000
OPCAQREQ EQU   OPCAQWD1                                                 00828000
@NM00132 EQU   OCIPLDMP                                                 00829000
OCACTRQ  EQU   OCIPLDMP                                                 00830000
OCDACRQ  EQU   OCIPLDMP                                                 00831000
OCIPLRQ  EQU   OCIPLDMP                                                 00832000
OCDMPRQ  EQU   OCIPLDMP                                                 00833000
@NM00131 EQU   OCRESPTR+2                                               00834000
OCOHNATA EQU   OCDIALLN                                                 00835000
OCRRTPTR EQU   OCBKUP3                                                  00836000
@NM00130 EQU   OCBKUP2+4                                                00837000
OCNHITTC EQU   OCBKUP2+2                                                00838000
OCLINTTC EQU   OCBKUP2                                                  00839000
OCCSIB   EQU   @NM00129                                                 00840000
@NM00128 EQU   OCBKUP1+6                                                00841000
OCTARTTC EQU   OCBKUP1+4                                                00842000
OCSRTTC  EQU   OCBKUP1+2                                                00843000
OCRSTTC  EQU   OCBKUP1                                                  00844000
@NM00127 EQU   OCMSGFLG                                                 00845000
OCRRT    EQU   OCMSGFLG                                                 00846000
OCNAME   EQU   OCMSGFLG                                                 00847000
OCLU1TTE EQU   @NM00124+4                                               00848000
OCLU2TTI EQU   @NM00124+2                                               00849000
OCLU1TTI EQU   @NM00124                                                 00850000
OCSLUTNT EQU   OCFID01+6                                                00851000
OCPLUTNT EQU   OCFID01+4                                                00852000
OCBIADDR EQU   OCFID01                                                  00853000
OCSRCED  EQU   OCFID0+4                                                 00854000
OCSRCEU  EQU   OCFID0                                                   00855000
OCICINAC EQU   OCICSW                                                   00856000
@NM00123 EQU   OCICSW                                                   00857000
OCICATST EQU   OCICDADR+1                                               00858000
OCICTYPE EQU   OCICDADR                                                 00859000
@NM00122 EQU   OCCKPKY1                                                 00860000
OCCKPENV EQU   OCCKPKY1                                                 00861000
OCCKPRST EQU   OCCKPTYP                                                 00862000
OCCKPNCP EQU   OCCKPTYP                                                 00863000
OCCKPINC EQU   OCCKPTYP                                                 00864000
@NM00121 EQU   @NM00118+2                                               00865000
@NM00120 EQU   @NM00119                                                 00866000
OCTSTAT  EQU   @NM00119                                                 00867000
OCREASON EQU   @NM00118                                                 00868000
@NM00181 EQU   LGBLINE+4                                                00869000
LINEADDR EQU   LGBLINE                                                  00870000
TRMOPTBL EQU   IEDQTRM+18                                               00871000
TRMOPNO  EQU   IEDQTRM+17                                               00872000
TRMCHCIN EQU   IEDQTRM+16                                               00873000
TRMSENSE EQU   TRMSTAT+3                                                00874000
TRMTEMPR EQU   TRMSTAT+2                                                00875000
TRMNADDR EQU   TRMOWNER                                                 00876000
@NM00162 EQU   TRMDEVFL+1                                               00877000
TRMTPIN  EQU   TRMDEVFL+1                                               00878000
@NM00161 EQU   TRMNCPI                                                  00879000
TRMRNTRM EQU   TRMDEVFL+1                                               00880000
@NM00160 EQU   TRMDEVFL+1                                               00881000
TRMLMD   EQU   TRMDEVFL+1                                               00882000
TRMCONC  EQU   TRMDEVFL+1                                               00883000
TRMTSOB  EQU   TRMDEVFL                                                 00884000
TRMBFDY  EQU   TRMDEVFL                                                 00885000
TRMTBLK  EQU   TRMDEVFL                                                 00886000
TRMSBLK  EQU   TRMDEVFL                                                 00887000
TRMBLKS  EQU   TRMDEVFL                                                 00888000
TRMSCV   EQU   TRMADDC                                                  00889000
TRMDDIG  EQU   TRMDEVFL                                                 00890000
TRMBUFS  EQU   TRMDEVFL                                                 00891000
TRMSTEAL EQU   TRMPRILK                                                 00892000
TRMLGB   EQU   TRMDSORG                                                 00893000
TRMUTERM EQU   TRMSESCT                                                 00894000
TRMVERIF EQU   TRMRSTRT                                                 00895000
@NM00159 EQU   TRMRSTRT                                                 00896000
@NM00158 EQU   TRMDESTQ                                                 00897000
TRMSCNYN EQU   TRMSTATE                                                 00898000
TRMOPTFN EQU   TRMSTATE                                                 00899000
TRMHELDN EQU   TRMSTATE                                                 00900000
TRMACPTN EQU   TRMSTATE                                                 00901000
TRMPROC  EQU   TRMLOG                                                   00902000
TRMLIST  EQU   TRMLOG                                                   00903000
TRMSUBST EQU   IEDNTRM+16                                               00904000
TRMPRIME EQU   TRMLGBST                                                 00905000
TRMOWNR  EQU   TRMLTRAC+1                                               00906000
TRMGPCNT EQU   TRMLTRAC                                                 00907000
TRMBUFRD EQU   TRMBYTE0                                                 00908000
TRMSNA   EQU   TRMBYTE0                                                 00909000
TRMGP    EQU   TRMBYTE0                                                 00910000
TRMDIAL  EQU   TRMBYTE0                                                 00911000
TRMACDC  EQU   TRMNOWCD                                                 00912000
TRMOUTPT EQU   TRMBYTE0                                                 00913000
TRMINPUT EQU   TRMBYTE0                                                 00914000
TRMUDEF  EQU   TRMBYTE0                                                 00915000
TRMCOHRT EQU   IEDNTRM+8                                                00916000
TRMCKPRN EQU   TRMBYTE1                                                 00917000
TRMTSATN EQU   TRMBYTE1                                                 00918000
TRMTRACE EQU   TRMBYTE1                                                 00919000
TRMSWBCK EQU   TRMBYTE1                                                 00920000
TRMAUTOC EQU   TRMBYTE1                                                 00921000
TRMINPTP EQU   TRMBYTE1                                                 00922000
TRMWTNEG EQU   TRMSCPRQ                                                 00923000
TRMWRBRK EQU   TRMBYTE2                                                 00924000
TRMNOSND EQU   TRMBYTE2                                                 00925000
TRMPREP  EQU   TRMBYTE2                                                 00926000
TRMGPACT EQU   TRMBYTE2                                                 00927000
TRMANDL  EQU   TRMBYTE2                                                 00928000
TRMCLOSN EQU   TRMINPG                                                  00929000
TRMREMB  EQU   TRMBYTE2                                                 00930000
TRMRSACT EQU   TRMBYTE2                                                 00931000
@NM00157 EQU   TRMCDF0                                                  00932000
TRMPURGE EQU   TRMCDF0                                                  00933000
TRMCDST  EQU   TRMINDEX                                                 00934000
QCBTTCIN EQU   QCBPLCBA+1                                               00935000
@NM00156 EQU   QCBPLCBA                                                 00936000
@NM00155 EQU   QCBSTAT1                                                 00937000
QCBFLUSH EQU   QCBSTAT1                                                 00938000
QCBNDXRQ EQU   QCBSTAT1                                                 00939000
QCBESIG  EQU   QCBSTAT1                                                 00940000
QCBRCVRQ EQU   QCBSTAT1                                                 00941000
QCBSNDRQ EQU   QCBSTAT1                                                 00942000
QCBWAITC EQU   QCBSTAT1                                                 00943000
QCBPLCBN EQU   QCBSTAT1                                                 00944000
QCBCHAIN EQU   IEDNQCB                                                  00945000
QCBPQBCK EQU   IEDQPQCB+25                                              00946000
QCBPRIPQ EQU   IEDQPQCB+24                                              00947000
QCBCFHDR EQU   IEDQPQCB+21                                              00948000
QCBLFEFO EQU   IEDQPQCB+18                                              00949000
QCBFFEFO EQU   IEDQPQCB+15                                              00950000
QCBPREVF EQU   QCBINTLF                                                 00951000
QCBINTFF EQU   IEDQPQCB+9                                               00952000
QCBDATSQ EQU   QCBFHDTZ+1                                               00953000
@NM00153 EQU   QCBFHDTZ                                                 00954000
QCBDNHDR EQU   IEDQPQCB                                                 00955000
QCBQBACK EQU   IEDQQCB+37                                               00956000
QCBCKPT  EQU   QCBFLAG                                                  00957000
QCBPROC  EQU   QCBFLAG                                                  00958000
QCBSDFFO EQU   QCBFLAG                                                  00959000
QCBTERMQ EQU   QCBFLAG                                                  00960000
QCBRSRV  EQU   QCBFLAG                                                  00961000
QCBREAD  EQU   QCBFLAG                                                  00962000
QCBNOBRK EQU   QCBFLAG                                                  00963000
QCBTSSES EQU   QCBFLAG                                                  00964000
QCBTJID  EQU   QCBLKRRN+1                                               00965000
QCBCARCT EQU   QCBLKRRN                                                 00966000
QCBPRLVL EQU   QCBPREN                                                  00967000
QCBMSGCT EQU   IEDQQCB+26                                               00968000
QCBEXTO  EQU   QCBINTVL                                                 00969000
QCBDISC  EQU   QCBTSOF1                                                 00970000
QCBDELAY EQU   QCBTSOF1                                                 00971000
QCBPARTO EQU   QCBTSOF1                                                 00972000
QCBSATRD EQU   QCBTSOF1                                                 00973000
QCBNOBUF EQU   QCBTSOF1                                                 00974000
QCBTPUT  EQU   QCBTSOF1                                                 00975000
QCBTGET  EQU   QCBTSOF1                                                 00976000
QCBWRBRK EQU   QCBTSOF1                                                 00977000
QCBSATLC EQU   QCBTSOF2                                                 00978000
QCBSATTI EQU   QCBTSOF2                                                 00979000
QCBSATCH EQU   QCBTSOF2                                                 00980000
QCBSIMRD EQU   QCBTSOF2                                                 00981000
QCBDSSMI EQU   QCBTSOF2                                                 00982000
QCBPOSTO EQU   QCBTSOF2                                                 00983000
QCBBUFQ  EQU   QCBTSOF2                                                 00984000
QCBINHBN EQU   QCBTSOF2                                                 00985000
QCBSATCT EQU   QCBINSRC                                                 00986000
QCBSCBOF EQU   IEDQQCB+20                                               00987000
QCBTIME  EQU   QCBSTAT                                                  00988000
QCBCLOCK EQU   QCBSTAT                                                  00989000
QCBSCHDL EQU   QCBSTAT                                                  00990000
QCBSMODE EQU   QCBSTAT                                                  00991000
QCBSEND  EQU   QCBSTAT                                                  00992000
QCBBUFRD EQU   QCBSTAT                                                  00993000
QCBTRMHO EQU   QCBSTAT                                                  00994000
QCBEOM   EQU   QCBSTAT                                                  00995000
QCBHUCT  EQU   QCBRETCT                                                 00996000
QCBIEND  EQU   QCBRETCT                                                 00997000
QCBEND   EQU   QCBRETCT                                                 00998000
QCBNL    EQU   QCBRETCT                                                 00999000
QCBLOGCT EQU   QCBRETCT                                                 01000000
@NM00152 EQU   QCBBYTE1                                                 01001000
QCBRITRM EQU   QCBBYTE1                                                 01002000
@NM00151 EQU   QCBEOLDT                                                 01003000
QCBSLINK EQU   IEDQQCB+13                                               01004000
QCBSTPRI EQU   IEDQQCB+12                                               01005000
QCBSTCHN EQU   IEDQQCB+9                                                01006000
QCBSTVTO EQU   IEDQQCB+8                                                01007000
QCBLINK  EQU   IEDQQCB+5                                                01008000
QCBPRI   EQU   IEDQQCB+4                                                01009000
QCBCNTEN EQU   QCBELCHN+2                                               01010000
@NM00150 EQU   QCBELCHN+2                                               01011000
@NM00149 EQU   QCBELCHN                                                 01012000
QCBHELD  EQU   QCBDSFLG                                                 01013000
QCBFQCB  EQU   QCBDSFLG                                                 01014000
QCBDRQQ  EQU   QCBDSFLG                                                 01015000
QCBALTMH EQU   QCBDSFLG                                                 01016000
QCBREUS  EQU   QCBDISK                                                  01017000
QCBNREUS EQU   QCBDISK                                                  01018000
QCBCORE  EQU   QCBDSFLG                                                 01019000
QCBTSQ   EQU   QCBDSFLG                                                 01020000
OPCBOTTM EQU   IEDQOPCD+1320                                            01021000
OPCDSRWT EQU   IEDQOPCD+1316                                            01022000
@NM00148 EQU   IEDQOPCD+1232                                            01023000
@NM00147 EQU   IEDQOPCD+1036                                            01024000
@NM00146 EQU   IEDQOPCD+1028                                            01025000
@NM00145 EQU   IEDQOPCD+468                                             01026000
OPCLSABC EQU   IEDQOPCD+466                                             01027000
@NM00144 EQU   IEDQOPCD+465                                             01028000
@NM00143 EQU   OPCBLIN                                                  01029000
OPCBLDSC EQU   OPCBLIN                                                  01030000
OPCUNIQV EQU   OPCUNIQP+2                                               01031000
OPCUNIQU EQU   OPCUNIQP                                                 01032000
OPCOSSCP EQU   OPCPCID                                                  01033000
OPCSDUPU EQU   IEDQOPCD+452                                             01034000
OPCSDULU EQU   IEDQOPCD+448                                             01035000
OPCSDRVT EQU   IEDQOPCD+444                                             01036000
OPCSDRET EQU   IEDQOPCD+440                                             01037000
OPCSDHSY EQU   IEDQOPCD+436                                             01038000
OPCSDENQ EQU   IEDQOPCD+432                                             01039000
OPCSDDIA EQU   IEDQOPCD+428                                             01040000
OPCSDCIS EQU   IEDQOPCD+424                                             01041000
OPCSDBIS EQU   IEDQOPCD+420                                             01042000
OPCSDAPU EQU   IEDQOPCD+416                                             01043000
OPCSDALU EQU   IEDQOPCD+412                                             01044000
OPCCSKEY EQU   IEDQOPCD+408                                             01045000
OPCSSKEY EQU   IEDQOPCD+404                                             01046000
OPCPRTTE EQU   IEDQOPCD+400                                             01047000
OPCLU2TT EQU   OPCSESS+14                                               01048000
OPCLU1TT EQU   OPCSESS+12                                               01049000
OPCSENSE EQU   OPCSESS+8                                                01050000
OPCCSIB  EQU   OPCSESS+4                                                01051000
OPCCTTE  EQU   OPCSESS                                                  01052000
OPCGTSIB EQU   IEDQOPCD+380                                             01053000
@NM00142 EQU   OPCPWCOB+9                                               01054000
@NM00141 EQU   OPCPWCOB+8                                               01055000
@NM00140 EQU   OPCPWECB+1                                               01056000
OPCPWCCC EQU   OPCPWECB                                                 01057000
OPCPWCHN EQU   OPCPWQCB+1                                               01058000
OPCPWVTO EQU   OPCPWQCB                                                 01059000
OPCAPXTL EQU   IEDQOPCD+356                                             01060000
OPCDECR  EQU   IEDQOPCD+352                                             01061000
OPCBUFWT EQU   IEDQOPCD+348                                             01062000
OPCADGOT EQU   IEDQOPCD+318                                             01063000
OPCRQCNT EQU   IEDQOPCD+316                                             01064000
OPPOLSTP EQU   IEDQOPCD+312                                             01065000
OPCCKCIB EQU   IEDQOPCD+308                                             01066000
OPCEND   EQU   IEDQOPCD+307                                             01067000
OPCSTCBS EQU   IEDQOPCD+306                                             01068000
OPCHNEND EQU   IEDQOPCD+302                                             01069000
OPCOQSW  EQU   IEDQOPCD+301                                             01070000
@NM00139 EQU   OPCSPEC                                                  01071000
@NM00138 EQU   OPCSPEC                                                  01072000
@NM00137 EQU   OPCSPEC                                                  01073000
@NM00136 EQU   OPCSPEC                                                  01074000
OPCFRMCA EQU   OPCSPEC                                                  01075000
OPCRSTRT EQU   OPCSPEC                                                  01076000
OPCPART  EQU   OPCSPEC                                                  01077000
OPCALTD  EQU   OPCSPEC                                                  01078000
OPCBFEND EQU   IEDQOPCD+296                                             01079000
OPCBFIRS EQU   IEDQOPCD+292                                             01080000
OPCAVBUF EQU   IEDQOPCD+290                                             01081000
OPCIPLCT EQU   IEDQOPCD+289                                             01082000
OPCCLNTS EQU   IEDQOPCD+288                                             01083000
OPCHA8   EQU   IEDQOPCD+286                                             01084000
OPCBFREQ EQU   IEDQOPCD+284                                             01085000
OPCFREBF EQU   IEDQOPCD+280                                             01086000
OPCGETBF EQU   IEDQOPCD+276                                             01087000
OPCNEXT  EQU   IEDQOPCD+272                                             01088000
OPCFMDFC EQU   IEDQOPCD+268                                             01089000
OPCSCNC  EQU   IEDQOPCD+264                                             01090000
OPCHORTG EQU   IEDQOPCD+260                                             01091000
OPCCKPTL EQU   IEDQOPCD+252                                             01092000
OPCCKPTF EQU   IEDQOPCD+248                                             01093000
OPCWAITA EQU   IEDQOPCD+244                                             01094000
OPCWAITR EQU   IEDQOPCD+240                                             01095000
OPCWAITP EQU   IEDQOPCD+236                                             01096000
OPCWAITO EQU   IEDQOPCD+232                                             01097000
OPCWAITN EQU   IEDQOPCD+228                                             01098000
OPCWAITL EQU   IEDQOPCD+224                                             01099000
OPCWAITC EQU   IEDQOPCD+220                                             01100000
@NM00135 EQU   OPCLDNME+5                                               01101000
@NM00134 EQU   OPCLDNME                                                 01102000
OPCWAIT  EQU   IEDQOPCD+192                                             01103000
OPCCKERB EQU   IEDQOPCD+164                                             01104000
OPCBFERB EQU   IEDQOPCD+148                                             01105000
OPCFLAG2 EQU   IEDQOPCD+147                                             01106000
OPCWRKSZ EQU   IEDQOPCD+144                                             01107000
OPCWORK  EQU   IEDQOPCD+140                                             01108000
OPCRSAVE EQU   IEDQOPCD+132                                             01109000
OPCQCBAD EQU   IEDQOPCD+128                                             01110000
OPCTRMWA EQU   IEDQOPCD+52                                              01111000
OPCPSTWT EQU   IEDQOPCD+48                                              01112000
OPCTNTEA EQU   IEDQOPCD+44                                              01113000
OPCPGCK  EQU   IEDQOPCD+40                                              01114000
OPCLCB   EQU   IEDQOPCD+36                                              01115000
@NM00133 EQU   IEDQOPCD+32                                              01116000
OPCIPLAD EQU   IEDQOPCD+28                                              01117000
OPCTOFLK EQU   IEDQOPCD+24                                              01118000
OPCOPTLK EQU   IEDQOPCD+20                                              01119000
OPCDCBLK EQU   IEDQOPCD+16                                              01120000
OPCDOUBL EQU   IEDQOPCD                                                 01121000
@NM00126 EQU   OCLDNME+4                                                01122000
@NM00125 EQU   OCPREFLG                                                 01123000
OCREMCON EQU   OCPREFLG                                                 01124000
OCCLNUP  EQU   OCPREFLG                                                 01125000
OCTOTEP  EQU   OCPREFLG                                                 01126000
OCREPOST EQU   OCPREFLG                                                 01127000
OCRSPSNT EQU   OCPREFLG                                                 01128000
OCBFREQ  EQU   OCPREFLG                                                 01129000
OCIDLE   EQU   OCREQFLG                                                 01130000
OCFORCE  EQU   OCREQFLG                                                 01131000
OCDCARD  EQU   OCREQFLG                                                 01132000
OCPARTAL EQU   OCREQFLG                                                 01133000
OCADNCP  EQU   OCREQFLG                                                 01134000
OCRMPORQ EQU   OCREQFLG                                                 01135000
OCCDLACT EQU   OCREQFLG                                                 01136000
OCFLUSHZ EQU   OCREQFLG                                                 01137000
OCRESPCT EQU   OCLINTTE                                                 01138000
OCCKPTWA EQU   OCCKDATA+4                                               01139000
OCNCP    EQU   OCRSTGTM+2                                               01140000
OCCKDAT2 EQU   OC379RRT+1                                               01141000
OCCKDAT1 EQU   OC379RRT                                                 01142000
OCPTRSAV EQU   OCMODNME+4                                               01143000
OCPUADR  EQU   OCIPLWA+2                                                01144000
OCWTGSAV EQU   OCIPLWA                                                  01145000
OCDVRDCT EQU   OCBACKUP+6                                               01146000
@NM00117 EQU   OCBACKUP+4                                               01147000
OCBUFRET EQU   OCBUFGOT                                                 01148000
OCBUFUSD EQU   OCBUFNED                                                 01149000
OCWTG    EQU   IEDQOPCE+30                                              01150000
OCRESNUM EQU   OCPARM                                                   01151000
OCSEQ    EQU   OCTRUNIT+2                                               01152000
@NM00116 EQU   OCRSID+1                                                 01153000
OCNONE   EQU   OCALSTAT                                                 01154000
OCSOME   EQU   OCALSTAT                                                 01155000
OCACTREQ EQU   OCALSTAT                                                 01156000
OCREDRVE EQU   OCALSTAT                                                 01157000
OCSEQIND EQU   OCALSTAT                                                 01158000
@NM00115 EQU   OCALSTAT                                                 01159000
OCDIALX  EQU   OCWTGB                                                   01160000
@NM00114 EQU   OCMSTSAV+2                                               01161000
OCREQVAL EQU   OCDEST+1                                                 01162000
OCCONID  EQU   OCDEST                                                   01163000
OCATTACH EQU   OCFLAG                                                   01164000
OCSSCP   EQU   OCFLAG                                                   01165000
OCOUTPUT EQU   OCFLAG                                                   01166000
OCLINE   EQU   OCFLAG                                                   01167000
OCMPP    EQU   OCFLAG                                                   01168000
@NM00113 EQU   OCSWITCH                                                 01169000
OCQUCKN  EQU   OCSWITCH                                                 01170000
OCPRIFLG EQU   OCOPTCDE                                                 01171000
@NM00112 EQU   OCUNITBF                                                 01172000
OCINVTIC EQU   OCUNITBF                                                 01173000
@NM00111 EQU   OCUNITBF                                                 01174000
@NM00110 EQU   @NM00109                                                 01175000
@NM00108 EQU   OCSCAN                                                   01176000
OCNOTUCB EQU   OCSCAN                                                   01177000
OCNONAME EQU   OCSCAN                                                   01178000
OCALLRLN EQU   OCSCAN                                                   01179000
OCDDNAME EQU   OCSCAN                                                   01180000
OCDDNRLN EQU   OCSCAN                                                   01181000
OCADDR   EQU   OCSCAN                                                   01182000
OCELMPTR EQU   OCELEM+1                                                 01183000
OCELMPRI EQU   OCELEM                                                   01184000
SAVTLLCB EQU   IEDNSVTD+380                                             01185000
SAVTSCF0 EQU   IEDNSVTD+376                                             01186000
SAVTLSNY EQU   IEDNSVTD+372                                             01187000
SAVTLSZP EQU   IEDNSVTD+368                                             01188000
SAVTOMSU EQU   IEDNSVTD+364                                             01189000
SAVTGTSB EQU   IEDNSVTD+360                                             01190000
SAVTHIBL EQU   IEDNSVTD+356                                             01191000
SAVTHISY EQU   IEDNSVTD+352                                             01192000
SAVTNAX2 EQU   IEDNSVTD+348                                             01193000
SAVTCDRU EQU   IEDNSVTD+344                                             01194000
SAVTPOLC EQU   IEDNSVTD+342                                             01195000
SAVTPOLM EQU   IEDNSVTD+340                                             01196000
SAVTPOLR EQU   IEDNSVTD+336                                             01197000
SAVTCDRN EQU   SAVTCDRV                                                 01198000
SAVTPOLL EQU   IEDNSVTD+328                                             01199000
SAVTPOLN EQU   IEDNSVTD+326                                             01200000
@NM00107 EQU   IEDNSVTD+325                                             01201000
@NM00106 EQU   SAVTNETF                                                 01202000
SAVTSDIS EQU   SAVTNETF                                                 01203000
SAVTROUT EQU   SAVTNETF                                                 01204000
SAVTNETW EQU   SAVTNETF                                                 01205000
SAVTDIAL EQU   IEDNSVTD+320                                             01206000
SAVTRQUT EQU   IEDNSVTD+316                                             01207000
SAVTBITN EQU   IEDNSVTD+312                                             01208000
@NM00105 EQU   SAVTCKQB+8                                               01209000
@NM00104 EQU   SAVTCKEC+1                                               01210000
@NM00103 EQU   SAVTCKCC                                                 01211000
SAVTCKPO EQU   SAVTCKCC                                                 01212000
SAVTCKWA EQU   SAVTCKCC                                                 01213000
SAVTCKCH EQU   SAVTCKTB+1                                               01214000
SAVTCKVT EQU   SAVTCKTB                                                 01215000
@NM00102 EQU   IEDNSVTD+297                                             01216000
SAVTRDFG EQU   SAVTRDRV+12                                              01217000
@NM00101 EQU   SAVTRDRV+5                                               01218000
SAVTRDPY EQU   SAVTRDRV+4                                               01219000
SAVTRDQB EQU   SAVTRDRV+1                                               01220000
SAVTRDKY EQU   SAVTRDRV                                                 01221000
SAVTNID  EQU   IEDNSVTD+280                                             01222000
SAVTDVAS EQU   IEDNSVTD+276                                             01223000
SAVTPLSZ EQU   IEDNSVTD+274                                             01224000
@NM00100 EQU   IEDNSVTD+273                                             01225000
SAVTSUBL EQU   IEDNSVTD+272                                             01226000
@NM00099 EQU   SAVTZELM+1                                               01227000
SAVTSUBM EQU   SAVTZELM                                                 01228000
SAVTMHDX EQU   IEDNSVTD+268                                             01229000
SAVTNAT1 EQU   IEDNSVTD+266                                             01230000
SAVTSH20 EQU   IEDNSVTD+264                                             01231000
SAVTLCBS EQU   IEDNSVTD+260                                             01232000
SAVTRNMP EQU   IEDNSVTD+256                                             01233000
SAVTTNTX EQU   IEDNSVTD+252                                             01234000
SAVTNAX  EQU   IEDNSVTD+248                                             01235000
SAVTSUBV EQU   IEDNSVTD+247                                             01236000
SAVTSUBA EQU   IEDNSVTD+246                                             01237000
SAVTSIBC EQU   IEDNSVTD+244                                             01238000
SAVTBSM  EQU   IEDNSVTD+240                                             01239000
SAVTSCPT EQU   SAVTTCPU                                                 01240000
SAVTRQTG EQU   IEDNSVTD+236                                             01241000
SAVTRQCH EQU   IEDNSVTD+232                                             01242000
SAVTMAND EQU   IEDNSVTD+228                                             01243000
SAVTSPLN EQU   IEDNSVTD+224                                             01244000
SAVTNADL EQU   IEDNSVTD+222                                             01245000
SAVTNATL EQU   IEDNSVTD+220                                             01246000
SAVTMHTB EQU   IEDNSVTD+216                                             01247000
SAVTSSMH EQU   IEDNSVTD+212                                             01248000
SAVTQRS  EQU   IEDNSVTD+208                                             01249000
SAVTRQIN EQU   IEDNSVTD+204                                             01250000
SAVTDFCO EQU   IEDNSVTD+200                                             01251000
SAVTSAO  EQU   IEDNSVTD+196                                             01252000
SAVTSARI EQU   IEDNSVTD+192                                             01253000
SAVTSAC  EQU   IEDNSVTD+188                                             01254000
SAVTSAI  EQU   IEDNSVTD+184                                             01255000
SAVTCSCI EQU   IEDNSVTD+180                                             01256000
SAVTSSRP EQU   IEDNSVTD+176                                             01257000
SAVTSSRQ EQU   IEDNSVTD+172                                             01258000
SAVTSCLU EQU   IEDNSVTD+168                                             01259000
SAVTXTRQ EQU   IEDNSVTD+164                                             01260000
SAVTMVBF EQU   IEDNSVTD+160                                             01261000
@NM00098 EQU   IEDNSVTD+148                                             01262000
SAVTIPCQ EQU   IEDNSVTD+144                                             01263000
@NM00097 EQU   IEDNSVTD+136                                             01264000
SAVTXFMI EQU   IEDNSVTD+132                                             01265000
@NM00096 EQU   IEDNSVTD+124                                             01266000
SAVTXFMO EQU   IEDNSVTD+120                                             01267000
@NM00095 EQU   IEDNSVTD+116                                             01268000
SAVTSSSR EQU   IEDNSVTD+112                                             01269000
SAVTSCPQ EQU   IEDNSVTD+108                                             01270000
SAVTSLCB EQU   IEDNSVTD+104                                             01271000
SAVTLUSR EQU   IEDNSVTD+100                                             01272000
@NM00094 EQU   SAVTLUSQ+8                                               01273000
SAVTLUSP EQU   SAVTLUSQ+4                                               01274000
SAVTLUSB EQU   SAVTLUSQ                                                 01275000
@NM00093 EQU   IEDNSVTD+84                                              01276000
SAVTSAT  EQU   IEDNSVTD+80                                              01277000
SAVTNAT  EQU   IEDNSVTD+76                                              01278000
SAVTCLUP EQU   IEDNSVTD+72                                              01279000
SAVTPIUT EQU   IEDNSVTD+68                                              01280000
SAVTRNTA EQU   IEDNSVTD+64                                              01281000
SAVTDNIR EQU   IEDNSVTD+60                                              01282000
SAVTCNIR EQU   IEDNSVTD+56                                              01283000
SAVTFLDH EQU   IEDNSVTD+52                                              01284000
SAVTSRTN EQU   IEDNSVTD+48                                              01285000
SAVTSREQ EQU   IEDNSVTD+44                                              01286000
SAVTFAIL EQU   IEDNSVTD+42                                              01287000
SAVTSUSE EQU   IEDNSVTD+40                                              01288000
SAVTSIB  EQU   IEDNSVTD+36                                              01289000
SAVTPRTN EQU   IEDNSVTD+32                                              01290000
@NM00092 EQU   IEDNSVTD+28                                              01291000
SAVTWH20 EQU   IEDNSVTD+26                                              01292000
SAVTPWT  EQU   IEDNSVTD+24                                              01293000
SAVTPRTQ EQU   IEDNSVTD+20                                              01294000
SAVTPREQ EQU   IEDNSVTD+16                                              01295000
SAVTPH20 EQU   IEDNSVTD+14                                              01296000
SAVTPUSE EQU   IEDNSVTD+12                                              01297000
SAVTPLCB EQU   IEDNSVTD+8                                               01298000
SAVTPOOL EQU   IEDNSVTD+4                                               01299000
SAVTPRMT EQU   SAVTDIAF                                                 01300000
SAVTVIRT EQU   SAVTDIAF                                                 01301000
AVTSITS  EQU   IEDQAVTD+1264                                            01302000
AVTMSUHI EQU   IEDQAVTD+1260                                            01303000
AVTSITU  EQU   IEDQAVTD+1256                                            01304000
AVTSITP  EQU   IEDQAVTD+1252                                            01305000
AVTPADDR EQU   IEDQAVTD+1248                                            01306000
@NM00091 EQU   IEDQAVTD+1246                                            01307000
AVTCPBNO EQU   IEDQAVTD+1244                                            01308000
AVTHRESS EQU   IEDQAVTD+1243                                            01309000
@NM00090 EQU   IEDQAVTD+1242                                            01310000
@NM00089 EQU   IEDQAVTD+1241                                            01311000
@NM00088 EQU   IEDQAVTD+1240                                            01312000
@NM00087 EQU   IEDQAVTD+1237                                            01313000
@NM00086 EQU   IEDQAVTD+1236                                            01314000
AVTHRESE EQU   @NM00085                                                 01315000
AVTRADDR EQU   IEDQAVTD+1228                                            01316000
AVTNADDR EQU   IEDQAVTD+1224                                            01317000
AVTHRESN EQU   IEDQAVTD+1220                                            01318000
AVTVOLRN EQU   IEDQAVTD+1216                                            01319000
AVTTOTNN EQU   IEDQAVTD+1212                                            01320000
AVTTRCYN EQU   IEDQAVTD+1208                                            01321000
AVTRCTRN EQU   IEDQAVTD+1204                                            01322000
AVTNOVON EQU   IEDQAVTD+1200                                            01323000
AVTADEBN EQU   IEDQAVTD+1196                                            01324000
AVTVOLRR EQU   IEDQAVTD+1192                                            01325000
AVTTOTNR EQU   IEDQAVTD+1188                                            01326000
AVTTRCYR EQU   IEDQAVTD+1184                                            01327000
AVTRCTRR EQU   IEDQAVTD+1180                                            01328000
AVTNOVOR EQU   IEDQAVTD+1176                                            01329000
AVTADEBR EQU   IEDQAVTD+1172                                            01330000
AVTLODPT EQU   IEDQAVTD+1168                                            01331000
AVTIOBN  EQU   IEDQAVTD+1164                                            01332000
AVTIOBR  EQU   IEDQAVTD+1160                                            01333000
AVTCPBPT EQU   IEDQAVTD+1156                                            01334000
AVTFCPB  EQU   IEDQAVTD+1152                                            01335000
@NM00084 EQU   IEDQAVTD+1148                                            01336000
AVTINCPQ EQU   IEDQAVTD+1144                                            01337000
@NM00083 EQU   IEDQAVTD+1140                                            01338000
@NM00082 EQU   IEDQAVTD+1137                                            01339000
@NM00081 EQU   AVTBIT4                                                  01340000
@NM00080 EQU   AVTBIT4                                                  01341000
@NM00079 EQU   AVTBIT4                                                  01342000
@NM00078 EQU   AVTBIT4                                                  01343000
@NM00077 EQU   AVTBIT4                                                  01344000
@NM00076 EQU   AVTBIT4                                                  01345000
@NM00075 EQU   AVTBIT4                                                  01346000
AVTRUFTN EQU   AVTBIT4                                                  01347000
@NM00074 EQU   IEDQAVTD+1132                                            01348000
AVTNOBFQ EQU   IEDQAVTD+1128                                            01349000
@NM00073 EQU   IEDQAVTD+1124                                            01350000
AVTDKENQ EQU   IEDQAVTD+1120                                            01351000
@NM00072 EQU   IEDQAVTD+1116                                            01352000
AVTDKAPQ EQU   IEDQAVTD+1112                                            01353000
AVTCOPY  EQU   IEDQAVTD+1108                                            01354000
AVTIA    EQU   IEDQAVTD+1104                                            01355000
AVTFL    EQU   IEDQAVTD+1100                                            01356000
@NM00071 EQU   IEDQAVTD+1096                                            01357000
AVTNCPBQ EQU   IEDQAVTD+1092                                            01358000
AVTTOTNC EQU   IEDQAVTD+1088                                            01359000
AVTCMAX  EQU   IEDQAVTD+1084                                            01360000
AVTCMIN  EQU   IEDQAVTD+1080                                            01361000
AVTHM02  EQU   IEDQAVTD+1076                                            01362000
AVTDCTLN EQU   IEDQAVTD+1072                                            01363000
AVTOPMSK EQU   IEDQAVTD+1068                                            01364000
AVTDDFT  EQU   IEDQAVTD+1064                                            01365000
AVTSTEAL EQU   IEDQAVTD+1060                                            01366000
AVTOPTN  EQU   IEDQAVTD+1056                                            01367000
AVTDSKCT EQU   IEDQAVTD+1054                                            01368000
AVTCKRST EQU   IEDQAVTD+1053                                            01369000
AVTSTAN  EQU   AVTBIT3                                                  01370000
AVTSTACN EQU   AVTBIT3                                                  01371000
AVTSTAIN EQU   AVTBIT3                                                  01372000
AVTSTAYN EQU   AVTBIT3                                                  01373000
AVTOLTBN EQU   AVTBIT3                                                  01374000
AVTTSAB  EQU   AVTBIT3                                                  01375000
AVTRFULN EQU   AVTBIT3                                                  01376000
AVTRECVN EQU   AVTBIT3                                                  01377000
@NM00070 EQU   AVTBIT2                                                  01378000
@NM00069 EQU   AVTBIT2                                                  01379000
AVTOPEIN EQU   AVTBIT2                                                  01380000
AVTSTRTN EQU   AVTBIT2                                                  01381000
AVTTOPOL EQU   AVTBIT2                                                  01382000
AVTCOPYN EQU   AVTBIT2                                                  01383000
AVTREUSN EQU   AVTBIT2                                                  01384000
AVTEXTSC EQU   AVTBIT2                                                  01385000
AVTDISKN EQU   AVTBIT1                                                  01386000
AVTQUCKN EQU   AVTBIT1                                                  01387000
AVTCLOSN EQU   AVTBIT1                                                  01388000
AVTREADN EQU   AVTBIT1                                                  01389000
AVTDLAYN EQU   AVTBIT1                                                  01390000
AVTAQTAN EQU   AVTBIT1                                                  01391000
AVTTSON  EQU   AVTBIT1                                                  01392000
AVTAPLKN EQU   AVTBIT1                                                  01393000
AVTDUMBR EQU   IEDQAVTD+1048                                            01394000
AVTDLQX  EQU   IEDQAVTD+1046                                            01395000
AVTINTLV EQU   IEDQAVTD+1044                                            01396000
AVTSMCNT EQU   IEDQAVTD+1042                                            01397000
AVTAVFCT EQU   IEDQAVTD+1040                                            01398000
AVTOPCON EQU   IEDQAVTD+1038                                            01399000
AVTOPCNT EQU   IEDQAVTD+1036                                            01400000
AVTLNCNT EQU   IEDQAVTD+1034                                            01401000
AVTKEYLE EQU   IEDQAVTD+1032                                            01402000
AVTHA16  EQU   IEDQAVTD+1030                                            01403000
AVTHA7   EQU   IEDQAVTD+1028                                            01404000
AVTHA4   EQU   IEDQAVTD+1026                                            01405000
AVTHA3   EQU   IEDQAVTD+1024                                            01406000
AVTHA2   EQU   IEDQAVTD+1022                                            01407000
AVTGETMS EQU   IEDQAVTD+1021                                            01408000
@NM00068 EQU   IEDQAVTD+1020                                            01409000
AVTGETMD EQU   IEDQAVTD+1016                                            01410000
AVTGETMN EQU   IEDQAVTD+1012                                            01411000
AVTCWTOT EQU   IEDQAVTD+1008                                            01412000
AVTCWINT EQU   IEDQAVTD+956                                             01413000
AVTDTRAP EQU   IEDQAVTD+952                                             01414000
@NM00067 EQU   IEDQAVTD+950                                             01415000
@NM00066 EQU   AVTIOTR                                                  01416000
AVTIOTRH EQU   AVTIOTR                                                  01417000
AVTIOTRE EQU   AVTIOTR                                                  01418000
@NM00065 EQU   AVTSUBT                                                  01419000
AVTSUBPT EQU   AVTSUBT                                                  01420000
AVTSUBON EQU   AVTSUBT                                                  01421000
AVTAFE30 EQU   IEDQAVTD+944                                             01422000
AVTAFE20 EQU   IEDQAVTD+940                                             01423000
AVTAFE10 EQU   IEDQAVTD+936                                             01424000
AVTCWEC2 EQU   IEDQAVTD+932                                             01425000
AVTCWPM2 EQU   IEDQAVTD+928                                             01426000
AVTCWTS2 EQU   IEDQAVTD+927                                             01427000
AVTCWTS1 EQU   IEDQAVTD+926                                             01428000
AVTCWCLD EQU   AVTCWFL2                                                 01429000
AVTCWRAP EQU   AVTCWFL2                                                 01430000
@NM00064 EQU   AVTCWFL2                                                 01431000
@NM00063 EQU   AVTCWFL2                                                 01432000
@NM00062 EQU   AVTCWFL2                                                 01433000
@NM00061 EQU   AVTCWFL2                                                 01434000
@NM00060 EQU   AVTCWFL2                                                 01435000
AVTCWACT EQU   AVTCWFL2                                                 01436000
@NM00059 EQU   AVTCWFL1                                                 01437000
@NM00058 EQU   AVTCWFL1                                                 01438000
@NM00057 EQU   AVTCWFL1                                                 01439000
@NM00056 EQU   AVTCWFL1                                                 01440000
@NM00055 EQU   AVTCWFL1                                                 01441000
@NM00054 EQU   AVTCWFL1                                                 01442000
@NM00053 EQU   AVTCWFL1                                                 01443000
AVTCOMWN EQU   AVTCWFL1                                                 01444000
AVTCWEC1 EQU   IEDQAVTD+920                                             01445000
AVTCWPM1 EQU   IEDQAVTD+916                                             01446000
AVTCAREA EQU   IEDQAVTD+912                                             01447000
AVTFZERO EQU   IEDQAVTD+908                                             01448000
AVTCADDR EQU   IEDQAVTD+904                                             01449000
AVTCOREC EQU   IEDQAVTD+900                                             01450000
@NM00052 EQU   IEDQAVTD+892                                             01451000
AVTCPBCB EQU   IEDQAVTD+888                                             01452000
@NM00051 EQU   IEDQAVTD+880                                             01453000
AVTDSIOB EQU   IEDQAVTD+876                                             01454000
@NM00050 EQU   IEDQAVTD+868                                             01455000
AVTCPRMB EQU   IEDQAVTD+864                                             01456000
@NM00049 EQU   IEDQAVTD+856                                             01457000
AVTCLOSB EQU   IEDQAVTD+852                                             01458000
@NM00048 EQU   IEDQAVTD+844                                             01459000
AVTACTIB EQU   IEDQAVTD+840                                             01460000
@NM00047 EQU   IEDQAVTD+836                                             01461000
AVTOLTEB EQU   IEDQAVTD+832                                             01462000
AVTOLTCH EQU   AVTOLTQB+1                                               01463000
AVTOLTVT EQU   AVTOLTQB                                                 01464000
@NM00046 EQU   AVTOPCQB+8                                               01465000
@NM00045 EQU   AVTOPCEC+1                                               01466000
@NM00044 EQU   AVTOPCCC                                                 01467000
AVTOPCPO EQU   AVTOPCCC                                                 01468000
AVTOPCWA EQU   AVTOPCCC                                                 01469000
AVTOPCCH EQU   AVTOPCOB+1                                               01470000
AVTOPCVT EQU   AVTOPCOB                                                 01471000
@NM00043 EQU   AVTCKPQB+9                                               01472000
AVTCKPTS EQU   AVTCKPQB+8                                               01473000
@NM00042 EQU   AVTCKPEC+1                                               01474000
@NM00041 EQU   AVTCKPCC                                                 01475000
AVTCKPPO EQU   AVTCKPCC                                                 01476000
AVTCKPWA EQU   AVTCKPCC                                                 01477000
AVTCKPCH EQU   AVTCKPTB+1                                               01478000
AVTCKPVT EQU   AVTCKPTB                                                 01479000
@NM00040 EQU   IEDQAVTD+796                                             01480000
AVTBFRTB EQU   IEDQAVTD+792                                             01481000
@NM00039 EQU   IEDQAVTD+788                                             01482000
AVTSELCH EQU   IEDQAVTD+785                                             01483000
AVTBFRTN EQU   AVTBFRFG                                                 01484000
AVTBFREB EQU   IEDQAVTD+780                                             01485000
AVTTIMQ  EQU   IEDQAVTD+776                                             01486000
@NM00038 EQU   IEDQAVTD+772                                             01487000
AVTIMQPS EQU   IEDQAVTD+768                                             01488000
AVTINOUT EQU   IEDQAVTD+766                                             01489000
AVTREFTM EQU   IEDQAVTD+764                                             01490000
@NM00037 EQU   IEDQAVTD+752                                             01491000
AVTDELYB EQU   IEDQAVTD+748                                             01492000
AVTOCQPT EQU   IEDQAVTD+744                                             01493000
AVTTSOPT EQU   IEDQAVTD+740                                             01494000
AVTSUPPT EQU   IEDQAVTD+736                                             01495000
AVTCBQCB EQU   IEDQAVTD+732                                             01496000
AVTMSGS  EQU   IEDQAVTD+729                                             01497000
@NM00036 EQU   AVTSYSER                                                 01498000
@NM00035 EQU   AVTSYSER                                                 01499000
@NM00034 EQU   AVTSYSER                                                 01500000
@NM00033 EQU   AVTSYSER                                                 01501000
@NM00032 EQU   AVTSYSER                                                 01502000
@NM00031 EQU   AVTSYSER                                                 01503000
AVTCMAXN EQU   AVTSYSER                                                 01504000
AVTCMINN EQU   AVTSYSER                                                 01505000
AVT2260L EQU   IEDQAVTD+724                                             01506000
AVTABEPL EQU   AVTADBUF                                                 01507000
AVTHFF   EQU   AVTCLRHI+2                                               01508000
@NM00030 EQU   AVTCLRHI                                                 01509000
AVTCCLNK EQU   AVTCRELE+5                                               01510000
AVTCCPRI EQU   AVTCRELE+4                                               01511000
AVTCCQCB EQU   AVTCCELE+1                                               01512000
AVTCCKEY EQU   AVTCCELE                                                 01513000
AVTDELAD EQU   IEDQAVTD+704                                             01514000
AVTDELEM EQU   IEDQAVTD+700                                             01515000
AVTBSX   EQU   AVTCKLNK                                                 01516000
AVTOPETR EQU   AVTHG01                                                  01517000
@NM00029 EQU   AVTCKBYT                                                 01518000
AVTCKONQ EQU   AVTCKBYT                                                 01519000
@NM00028 EQU   AVTCKBYT                                                 01520000
@NM00027 EQU   AVTCKBYT                                                 01521000
@NM00026 EQU   AVTCKBYT                                                 01522000
@NM00025 EQU   AVTCKBYT                                                 01523000
@NM00024 EQU   AVTCKBYT                                                 01524000
@NM00023 EQU   AVTCKBYT                                                 01525000
AVTOPERT EQU   IEDQAVTD+690                                             01526000
AVTOPXCL EQU   IEDQAVTD+688                                             01527000
AVTOPERL EQU   IEDQAVTD+687                                             01528000
@NM00022 EQU   IEDQAVTD+686                                             01529000
AVTCKTIM EQU   IEDQAVTD+684                                             01530000
AVTCKELV EQU   IEDQAVTD+682                                             01531000
AVTCPRCD EQU   IEDQAVTD+681                                             01532000
AVTWARMN EQU   AVTCKELF                                                 01533000
AVTCRTLN EQU   AVTCKELF                                                 01534000
AVTCPIPN EQU   AVTCKELF                                                 01535000
AVTCCLCN EQU   AVTCKELF                                                 01536000
AVTCINCN EQU   AVTCKELF                                                 01537000
@NM00021 EQU   AVTCKELF                                                 01538000
AVTCMCPN EQU   AVTCKELF                                                 01539000
AVTNQBCK EQU   AVTCKELF                                                 01540000
AVTCKQAD EQU   IEDQAVTD+677                                             01541000
AVTSCBSZ EQU   IEDQAVTD+676                                             01542000
@NM00020 EQU   IEDQAVTD+672                                             01543000
AVTCKELE EQU   IEDQAVTD+668                                             01544000
@NM00019 EQU   AVTCKPEL+8                                               01545000
AVTCKRLK EQU   AVTCKPEL+5                                               01546000
AVTCKRPR EQU   AVTCKPEL+4                                               01547000
AVTCKRMQ EQU   AVTCKRMV+1                                               01548000
AVTCKRKY EQU   AVTCKRMV                                                 01549000
AVTHK    EQU   IEDQAVTD+648                                             01550000
AVTHI    EQU   IEDQAVTD+644                                             01551000
AVTIOT   EQU   IEDQAVTD+640                                             01552000
AVTNX    EQU   IEDQAVTD+636                                             01553000
AVTTONE  EQU   IEDQAVTD+632                                             01554000
AVTA3TL  EQU   IEDQAVTD+628                                             01555000
AVTDMECB EQU   IEDQAVTD+624                                             01556000
AVTABEND EQU   IEDQAVTD+618                                             01557000
AVTPLCBN EQU   IEDQAVTD+616                                             01558000
@NM00018 EQU   AVTSAVTP+1                                               01559000
@NM00017 EQU   AVTSAVTF                                                 01560000
AVTSNA   EQU   AVTSAVTF                                                 01561000
AVTONSNA EQU   AVTSAVTF                                                 01562000
AVTVTMCP EQU   AVTSAVTF                                                 01563000
@NM00016 EQU   IEDQAVTD+608                                             01564000
AVTCMBSS EQU   IEDQAVTD+604                                             01565000
AVTRCV   EQU   IEDQAVTD+600                                             01566000
AVTSEND  EQU   IEDQAVTD+596                                             01567000
AVTCSCH  EQU   IEDQAVTD+592                                             01568000
AVTQ1    EQU   IEDQAVTD+588                                             01569000
AVTE7    EQU   IEDQAVTD+584                                             01570000
AVTHB    EQU   IEDQAVTD+580                                             01571000
AVTR1    EQU   IEDQAVTD+576                                             01572000
AVTBZ    EQU   IEDQAVTD+572                                             01573000
AVTEZ    EQU   IEDQAVTD+568                                             01574000
AVTEC    EQU   IEDQAVTD+564                                             01575000
AVTEW    EQU   IEDQAVTD+560                                             01576000
AVTNDIAL EQU   AVTSCOPT                                                 01577000
AVTN2741 EQU   AVTSCOPT                                                 01578000
AVTCONCO EQU   AVTSCOPT                                                 01579000
AVTCONC  EQU   AVTSCOPT                                                 01580000
AVTCMBUF EQU   AVTSCOPT                                                 01581000
AVTAPDMP EQU   AVTSCOPT                                                 01582000
@NM00015 EQU   AVTSCOPT                                                 01583000
AVTHA    EQU   AVTDISP                                                  01584000
AVTEA    EQU   IEDQAVTD+548                                             01585000
AVTAX    EQU   IEDQAVTD+544                                             01586000
AVTA3    EQU   IEDQAVTD+540                                             01587000
AVTGD    EQU   IEDQAVTD+536                                             01588000
AVTAL    EQU   IEDQAVTD+532                                             01589000
AVTOLTST EQU   AVTHG02                                                  01590000
AVTE8    EQU   IEDQAVTD+524                                             01591000
AVTUI    EQU   IEDQAVTD+520                                             01592000
AVTCOMPT EQU   IEDQAVTD+516                                             01593000
AVTCRSRF EQU   IEDQAVTD+512                                             01594000
@NM00014 EQU   IEDQAVTD+508                                             01595000
AVTKA02  EQU   IEDQAVTD+504                                             01596000
AVTOPTPT EQU   IEDQAVTD+500                                             01597000
AVTPCBPT EQU   IEDQAVTD+496                                             01598000
@NM00013 EQU   AVTECB1                                                  01599000
AVTCOMP  EQU   AVTECB1                                                  01600000
@NM00012 EQU   AVTECB1                                                  01601000
AVTOPECA EQU   IEDQAVTD+488                                             01602000
AVTOLECA EQU   IEDQAVTD+484                                             01603000
AVTCKECA EQU   IEDQAVTD+480                                             01604000
AVTCWECA EQU   IEDQAVTD+476                                             01605000
AVTCWTCB EQU   IEDQAVTD+472                                             01606000
AVTOCTCB EQU   IEDQAVTD+464                                             01607000
AVTCKTCB EQU   IEDQAVTD+460                                             01608000
AVTAS    EQU   IEDQAVTD+456                                             01609000
AVTNOLBF EQU   IEDQAVTD+454                                             01610000
AVTNCKPR EQU   IEDQAVTD+453                                             01611000
AVTCIB   EQU   IEDQAVTD+452                                             01612000
AVTSPLPT EQU   IEDQAVTD+448                                             01613000
AVTMVBFR EQU   IEDQAVTD+444                                             01614000
AVTSBTA  EQU   IEDQAVTD+440                                             01615000
AVTRARTN EQU   IEDQAVTD+436                                             01616000
AVTBSCAN EQU   IEDQAVTD+432                                             01617000
AVTRDYA  EQU   IEDQAVTD+428                                             01618000
AVTDISTR EQU   IEDQAVTD+420                                             01619000
AVTPARM3 EQU   IEDQAVTD+416                                             01620000
@NM00011 EQU   AVTPKF                                                   01621000
@NM00010 EQU   AVTPKF                                                   01622000
@NM00009 EQU   AVTPKF                                                   01623000
AVTFTCHF EQU   AVTPKF                                                   01624000
@NM00008 EQU   AVTPKF                                                   01625000
@NM00007 EQU   AVTPKF                                                   01626000
@NM00006 EQU   AVTPKF                                                   01627000
@NM00005 EQU   AVTPKF                                                   01628000
AVTPARM  EQU   IEDQAVTD+408                                             01629000
AVTEXS2A EQU   IEDQAVTD+402                                             01630000
AVTEXA2S EQU   IEDQAVTD+396                                             01631000
AVTOCGET EQU   IEDQAVTD+392                                             01632000
AVTCKAVT EQU   @NM00003+1                                               01633000
@NM00004 EQU   AVTCKFLG                                                 01634000
AVTCKHLT EQU   AVTCKFLG                                                 01635000
AVTCKREQ EQU   AVTCKFLG                                                 01636000
AVTCKENV EQU   AVTCKFLG                                                 01637000
AVTCKNAC EQU   AVTCKFLG                                                 01638000
AVTCKTAC EQU   AVTCKFLG                                                 01639000
@NM00002 EQU   IEDQAVTD+384                                             01640000
AVTREADD EQU   IEDQAVTD+380                                             01641000
AVTREADY EQU   IEDQAVTD+376                                             01642000
AVTRACE  EQU   IEDQAVTD+372                                             01643000
AVTTCB   EQU   IEDQAVTD+368                                             01644000
AVTPASWD EQU   IEDQAVTD+360                                             01645000
AVTCTLCH EQU   IEDQAVTD+352                                             01646000
AVTDOUBL EQU   IEDQAVTD+344                                             01647000
AVTDOUBX EQU   IEDQAVTD+336                                             01648000
AVTDPARM EQU   IEDQAVTD+332                                             01649000
AVTCSTCS EQU   IEDQAVTD+328                                             01650000
AVTDLQ   EQU   AVTSAVEX+32                                              01651000
@NM00001 EQU   AVTSAVEX                                                 01652000
AVTSAVE4 EQU   IEDQAVTD+216                                             01653000
AVTSAVE3 EQU   IEDQAVTD+144                                             01654000
AVTSAVE2 EQU   IEDQAVTD+72                                              01655000
AVTSAVE1 EQU   IEDQAVTD                                                 01656000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01657000
@RC00340 EQU   @RC00338                                                 01658000
@RF00408 EQU   @RC00402                                                 01659000
@RF00411 EQU   @RC00402                                                 01660000
@RF00413 EQU   @RC00402                                                 01661000
@RF00344 EQU   @RC00340                                                 01662000
@ENDDATA EQU   *                                                        01663000
         END   IGCVG10D,(C'PLS0259',0701,78108)                         01664000
