         TITLE 'IGCVI10D,  3705 STARTLINE                              *00001000
                        '                                               00002000
IGCVI10D CSECT ,                                                   0001 00003000
@PROLOG  BALR  @12,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@12                                         0001 00006000
*                                                            @ZM48467   00007000
*                                                            @ZM48484*/ 00008000
*                                                                  0498 00009000
*   /*****************************************************************/ 00010000
*   /*                                                               */ 00011000
*   /* INITIALIZATION                                                */ 00012000
*   /*                                                               */ 00013000
*   /*****************************************************************/ 00014000
*                                                                  0498 00015000
*   ROPCAVT=RPARM;                  /* OPCAVT ADDR                   */ 00016000
         LR    ROPCAVT,RPARM                                       0498 00017000
*   RAVT=OPCAVTPT;                  /* TCAM AVT ADDR                 */ 00018000
         L     RAVT,OPCAVTPT(,ROPCAVT)                             0499 00019000
*   ROPCE=OPCCOPCE;                 /* OPCE ADDR                     */ 00020000
         L     ROPCE,OPCCOPCE(,ROPCAVT)                            0500 00021000
*   OPCFLAG1=0;                     /* CLEAR FLAG                    */ 00022000
         MVI   OPCFLAG1(ROPCAVT),X'00'                             0501 00023000
*   GEN NOREFS NOSETS NOEXIT SEQFLOW;                              0502 00024000
IGCVI10D IEDHJN SKIPID,HJN                                              00025000
*                                                                  0503 00026000
*   /*****************************************************************/ 00027000
*   /*                                                               */ 00028000
*   /* MAIN PROGRAM LOGIC                                            */ 00029000
*   /*                                                               */ 00030000
*   /*****************************************************************/ 00031000
*                                                                  0503 00032000
*   IF OPREPRI=PRIMEDFG&OPREFLG1=OPRVI THEN                        0503 00033000
         CLI   OPREPRI(ROPCE),X'DF'                                0503 00034000
         BNE   @RF00503                                            0503 00035000
         CLI   OPREFLG1(ROPCE),X'04'                               0503 00036000
         BNE   @RF00503                                            0503 00037000
*     CALL STRTRET;                 /* SPECIAL PRIORITY AND FLAG   0504 00038000
*                                      INDICATING STARTLINE RETURNED    00039000
*                                      FROM IEDNSL                   */ 00040000
         BAL   @14,STRTRET                                         0504 00041000
*   ELSE                                                           0505 00042000
*     IF OCRESP=ON THEN             /* IF RESPONSE TO STARTLINE FROM    00043000
*                                      IGCA010D PROC         @ZM47662*/ 00044000
         B     @RC00503                                            0505 00045000
@RF00503 TM    OCRESP(ROPCE),B'00000001'                           0505 00046000
         BNO   @RF00505                                            0505 00047000
*       DO;                         /*                       @ZM47662*/ 00048000
*         OCRESP=OFF;               /*                       @ZM47662*/ 00049000
         NI    OCRESP(ROPCE),B'11111110'                           0507 00050000
*         CALL PROCRESP;            /*                       @ZM47662*/ 00051000
         BAL   @14,PROCRESP                                        0508 00052000
*       END;                        /*                       @ZM47662*/ 00053000
*     ELSE                                                         0510 00054000
*       IF OCPARM^=0 THEN                                          0510 00055000
         B     @RC00505                                            0510 00056000
@RF00505 ICM   @15,3,OCPARM(ROPCE)                                 0510 00057000
         BZ    @RF00510                                            0510 00058000
*         CALL SNASTRT;             /* NON-ZERO RET CODE MEANS SNA 0511 00059000
*                                      STARTLINE FROM IGCFA10D,    0511 00060000
*                                      PROCESS IT                    */ 00061000
         BAL   @14,SNASTRT                                         0511 00062000
*       ELSE                                                       0512 00063000
*         FIRSTREQ=ON;              /* GET FIRST LINE FLAG           */ 00064000
         B     @RC00510                                            0512 00065000
@RF00510 OI    FIRSTREQ(ROPCAVT),B'10000000'                       0512 00066000
*   DO WHILE(FIRSTREQ=ON|MORELINE=ON);/* LOOP FOR GRP,ALL AND FIRST     00067000
*                                      TIME THROUGH                  */ 00068000
@RC00510 DS    0H                                                  0513 00069000
@RC00505 DS    0H                                                  0513 00070000
@RC00503 B     @DE00513                                            0513 00071000
@DL00513 DS    0H                                                  0514 00072000
*     EXITFLAG=OFF;                 /* RESET SO THAT WE DO NOT XCTL     00073000
*                                      TO OURSELF WHEN PROCESSING A     00074000
*                                      GROUP FOR MULTIPLE NCPS,ONLY     00075000
*                                      SOME OF WHICH ARE ACTIVE    0514 00076000
*                                                            @ZM48377*/ 00077000
         NI    EXITFLAG(ROPCAVT),B'11011111'                       0514 00078000
*     CALL STRTREQ;                 /* PROC STARTLINE REQ            */ 00079000
         BAL   @14,STRTREQ                                         0515 00080000
*   END;                                                           0516 00081000
@DE00513 TM    FIRSTREQ(ROPCAVT),B'11000000'                       0516 00082000
         BNZ   @DL00513                                            0516 00083000
*   RPARM=ROPCAVT;                  /* SET R1 TO OPC AVT             */ 00084000
         LR    RPARM,ROPCAVT                                       0517 00085000
*   IF OPCMODID=VI THEN             /* IF GOING TO RETURN TO VI    0518 00086000
*                                      INSURE THAT STRTREQ GETS    0518 00087000
*                                      EXECUTED              @ZM47662*/ 00088000
         CLC   OPCMODID(2,ROPCAVT),@CC02563                        0518 00089000
         BNE   @RF00518                                            0518 00090000
*     OCPARM=0;                     /*                       @ZM47662*/ 00091000
         SLR   @15,@15                                             0519 00092000
         STH   @15,OCPARM(,ROPCE)                                  0519 00093000
*   IF OPCMODID=XCTL00 THEN         /* CLEAR REG 0 PRIOR     @YM03724*/ 00094000
@RF00518 CLC   OPCMODID(2,ROPCAVT),@CC02565                        0520 00095000
         BNE   @RF00520                                            0520 00096000
*     RZERO=0;                      /* TO TRANSFER OF CONTROL        */ 00097000
         SLR   RZERO,RZERO                                         0521 00098000
*   ELSE                                                           0522 00099000
*     ;                             /* TO MODULE IGC0010D.           */ 00100000
@RF00520 DS    0H                                                  0523 00101000
*   GEN EXIT REFS(OPCXCTL);                                        0523 00102000
          XCTL  SF=(E,OPCXCTL(ROPCAVT))                                 00103000
*                                                                  0524 00104000
*   /*****************************************************************/ 00105000
*   /*                                                               */ 00106000
*   /* PROCESS STARTLINE RETURN THIS ROUTINE IS CALLED FROM THE MAIN */ 00107000
*   /* PROGRAM LOGIC                                                 */ 00108000
*   /*                                                               */ 00109000
*   /*****************************************************************/ 00110000
*                                                                  0524 00111000
*STRTRET:                                                          0524 00112000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0524 00113000
@EL00001 DS    0H                                                  0524 00114000
@EF00001 DS    0H                                                  0524 00115000
@ER00001 BR    @14                                                 0524 00116000
STRTRET  DS    0H                                                  0525 00117000
*   OPCWRKSP(3)=RRETURN;            /* SAVE RETURN ADDR              */ 00118000
         ST    RRETURN,OPCWRKSP+8(,ROPCAVT)                        0525 00119000
*   RPARM=ADDR(NSLGRPNM);           /* GET GROUP NAME AS RETURNED  0526 00120000
*                                      FROM NSL                      */ 00121000
         LA    RPARM,NSLGRPNM(,RNSL)                               0526 00122000
*   CALL WAITLSRH;                  /* FIND OPCE WITH SAME GRPNAME ON   00123000
*                                      OPCWAITV                      */ 00124000
         BAL   @14,WAITLSRH                                        0527 00125000
*   RESPECIFY                                                      0528 00126000
*     RWORK6 RSTD;                  /* RWORK6 IS USED AS A TEMP SAVE    00127000
*                                      AREA FOR THE OPCE FOUND BY  0528 00128000
*                                      WAITLSRCH                     */ 00129000
*   RWORK6=RPARM;                   /* SAVE OPCE ADDR                */ 00130000
         LR    RWORK6,RPARM                                        0529 00131000
*   RZERO->OCLINK=RPARM->OCLINK;    /* UNLINK OPCE FROM CHAIN        */ 00132000
         LR    @15,RZERO                                           0530 00133000
         MVC   OCLINK(4,@15),OCLINK(RPARM)                         0530 00134000
*   RPARM=RNSL;                     /* GET ADDR OF BUFFER RETURNED 0531 00135000
*                                      FROM NSL                      */ 00136000
         LR    RPARM,RNSL                                          0531 00137000
*   RPARM->OCUNIT=BADTIC;           /* 1 BUFFER TO FREE      @YM03737*/ 00138000
         MVC   OCUNIT(4,RPARM),@CF02506                            0532 00139000
*   RESPECIFY                                                      0533 00140000
*     RSAVE RSTD;                   /* REG 13 =SAVE AREA ADDR        */ 00141000
*   RSAVE=ADDR(OPCSAVE);            /* SAVE AREA ADDR                */ 00142000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0534 00143000
*   CALL FREEBUF;                   /* FREE BUFFER UNIT              */ 00144000
         L     @15,OPCFREBF(,ROPCAVT)                              0535 00145000
         BALR  @14,@15                                             0535 00146000
*   RESPECIFY                                                      0536 00147000
*     RSAVE UNRSTD;                                                0536 00148000
*   ROPCE=RWORK6;                   /* SET UP OPCE ADDR              */ 00149000
         LR    ROPCE,RWORK6                                        0537 00150000
*   RESPECIFY                                                      0538 00151000
*     RWORK6 UNRSTD;                                               0538 00152000
*   OPCCOPCE=ROPCE;                 /* MAKE ORIGINAL OPCE THE CURRENT   00153000
*                                      ONE                   @ZM48377*/ 00154000
         ST    ROPCE,OPCCOPCE(,ROPCAVT)                            0539 00155000
*   RPARM=OCTRMTBL;                 /* GET TTCIN OF LINE             */ 00156000
         SLR   RPARM,RPARM                                         0540 00157000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                             0540 00158000
*   CALL IEDQTNT;                   /* CONVERT TO TTE                */ 00159000
         L     @15,AVTRNMPT(,IEDQAPTR)                             0541 00160000
         BALR  @14,@15                                             0541 00161000
*   RTERM=RPARM;                    /* SET UP TTE BASE FOR LINE WE 0542 00162000
*                                      ARE WORKING WITH              */ 00163000
         LR    RTERM,RPARM                                         0542 00164000
*   OPCWRKSP(1)=MSGNO20;            /* SET UP MSG NUMB 20            */ 00165000
         MVC   OPCWRKSP(4,ROPCAVT),@CF00632                        0543 00166000
*   OPCWRKSP(2)=PARM0;              /* SET UP PARM OF 0              */ 00167000
         SLR   @15,@15                                             0544 00168000
         ST    @15,OPCWRKSP+4(,ROPCAVT)                            0544 00169000
*   CALL NORMEXIT;                  /* DO NORMAL EXIT PROCESSING     */ 00170000
         BAL   @14,NORMEXIT                                        0545 00171000
*   RRETURN=OPCWRKSP(3);            /* LOAD RETURN ADDR              */ 00172000
         L     RRETURN,OPCWRKSP+8(,ROPCAVT)                        0546 00173000
*   RETURN;                                                        0547 00174000
@EL00002 DS    0H                                                  0547 00175000
@EF00002 DS    0H                                                  0547 00176000
@ER00002 BR    @14                                                 0547 00177000
*   END;                            /* END OF STRTRET                */ 00178000
*                                                                  0549 00179000
*   /*****************************************************************/ 00180000
*   /*                                                               */ 00181000
*   /* PROCESS RESPONSE THIS ROUTINE IS CALLED BY MAIN PROGRAM LOGIC */ 00182000
*   /*                                                               */ 00183000
*   /*****************************************************************/ 00184000
*                                                                  0549 00185000
*PROCRESP:                                                         0549 00186000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0549 00187000
PROCRESP DS    0H                                                  0550 00188000
*   OPCWRKSP(3)=RRETURN;            /* SAVE RETURN ADDR              */ 00189000
         ST    RRETURN,OPCWRKSP+8(,ROPCAVT)                        0550 00190000
*   RPARM=ADDR(OCBACKUP);           /* SET PTR TO GRPNAME            */ 00191000
         LA    RPARM,OCBACKUP(,ROPCE)                              0551 00192000
*   CALL WAITLSRH;                  /* SEARCH WAITL CHAIN FOR OPCE 0552 00193000
*                                      WITH SAME GRPNAME             */ 00194000
         BAL   @14,WAITLSRH                                        0552 00195000
*   RESPECIFY                                                      0553 00196000
*     RWORK8 RSTD;                  /* TEMP SAVE AREA FOR OPCE AD    */ 00197000
*   RWORK8=RPARM;                   /* SAVE ADDR OF REAL OPCE        */ 00198000
         LR    RWORK8,RPARM                                        0554 00199000
*   RZERO->OCLINK=RPARM->OCLINK;    /* UNLINK OPCE FROM CHAIN        */ 00200000
         LR    @15,RZERO                                           0555 00201000
         MVC   OCLINK(4,@15),OCLINK(RPARM)                         0555 00202000
*   RPARM=OCUNIT;                   /* FREE RESPONSE BUFFER          */ 00203000
         L     RPARM,OCUNIT(,ROPCE)                                0556 00204000
*   RPARM->OCUNIT=BADTIC;           /* 1 BUFFER TO FREE      @YM03737*/ 00205000
         MVC   OCUNIT(4,RPARM),@CF02506                            0557 00206000
*   RESPECIFY                                                      0558 00207000
*     RSAVE RSTD;                   /* REG13=SAVE AREA ADDR          */ 00208000
*   RSAVE=ADDR(OPCSAVE);            /* SAVE AREA ADDR                */ 00209000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0559 00210000
*   IF OCPARM=1 THEN                /* ON GOOD RESP,CAUSE TERMINAL 0560 00211000
*                                      PRIMING FOR LINE              */ 00212000
         CLC   OCPARM(2,ROPCE),@CH00061                            0560 00213000
         BNE   @RF00560                                            0560 00214000
*     DO;                           /*                       @YM08579*/ 00215000
*       CALL FREEBUF;               /* FREE BUF RTN IN QCA   @YM08579*/ 00216000
         L     @15,OPCFREBF(,ROPCAVT)                              0562 00217000
         BALR  @14,@15                                             0562 00218000
*       RESPECIFY                                                  0563 00219000
*         RSAVE UNRSTD;                                            0563 00220000
*       CALL STRTLINE;              /*                       @YM08579*/ 00221000
         BAL   @14,STRTLINE                                        0564 00222000
*     END;                          /*                       @YM08579*/ 00223000
*   ELSE                                                           0566 00224000
*     CALL ERRRESP;                 /* OTHERWISE DO ERROR PROCES   0566 00225000
*                                      BUFFER MAY BE NEEDED FOR MSG     00226000
*                                      199                   @YM08579*/ 00227000
         B     @RC00560                                            0566 00228000
@RF00560 BAL   @14,ERRRESP                                         0566 00229000
*   RRETURN=OPCWRKSP(3);            /* LOAD RETURN ADDR              */ 00230000
@RC00560 L     RRETURN,OPCWRKSP+8(,ROPCAVT)                        0567 00231000
*   RETURN;                                                        0568 00232000
@EL00003 DS    0H                                                  0568 00233000
@EF00003 DS    0H                                                  0568 00234000
@ER00003 BR    @14                                                 0568 00235000
*   RESPECIFY                                                      0569 00236000
*     RWORK8 UNRSTD;                                               0569 00237000
*   END;                            /* END OF PROCRESP               */ 00238000
*                                                                  0571 00239000
*   /*****************************************************************/ 00240000
*   /*                                                               */ 00241000
*   /* PROCESS SNA STARTLINE REQUEST THIS ROUTINE IS CALLED FROM MAIN*/ 00242000
*   /* PROGRAM LOGIC                                                 */ 00243000
*   /*                                                               */ 00244000
*   /*****************************************************************/ 00245000
*                                                                  0571 00246000
*SNASTRT:                                                          0571 00247000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0571 00248000
SNASTRT  DS    0H                                                  0572 00249000
*   OPCWRKSP(3)=RRETURN;            /* SAVE RETURN ADDR              */ 00250000
         ST    RRETURN,OPCWRKSP+8(,ROPCAVT)                        0572 00251000
*   OCWTG=OCWTGB;                   /* RESTORE OCWTG TO ORIG         */ 00252000
         MVC   OCWTG(2,ROPCE),OCWTGB(ROPCE)                        0573 00253000
*   OPCWRKSP(1)=OCPARM;             /* SAVE RESP MSG NUMB            */ 00254000
         LH    @15,OCPARM(,ROPCE)                                  0574 00255000
         ST    @15,OPCWRKSP(,ROPCAVT)                              0574 00256000
*   RPARM=OCTRMTBL;                 /* TTCIN OF LINE TO PROCESS      */ 00257000
         SLR   RPARM,RPARM                                         0575 00258000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                             0575 00259000
*   CALL IEDQTNT;                   /* CONVERT TO TTE                */ 00260000
         L     @15,AVTRNMPT(,IEDQAPTR)                             0576 00261000
         BALR  @14,@15                                             0576 00262000
*   RTERM=RPARM;                    /* SET UP TTE BASE               */ 00263000
         LR    RTERM,RPARM                                         0577 00264000
*   IF OCPARM=GOODSTRT|OCPARM=PARTGOOD/* GOOD RESPONSE PROCESSING    */ 00265000
*       |OCPARM=LOGICGD THEN                                       0578 00266000
         LH    @15,OCPARM(,ROPCE)                                  0578 00267000
         CH    @15,@CH02537                                        0578 00268000
         BE    @RT00578                                            0578 00269000
         CH    @15,@CH02539                                        0578 00270000
         BE    @RT00578                                            0578 00271000
         CH    @15,@CH02541                                        0578 00272000
         BNE   @RF00578                                            0578 00273000
@RT00578 DS    0H                                                  0579 00274000
*     DO;                                                          0579 00275000
*       OPCWRKSP(2)=PARM0;          /* SET PARM TO ZERO              */ 00276000
         SLR   @15,@15                                             0580 00277000
         ST    @15,OPCWRKSP+4(,ROPCAVT)                            0580 00278000
*       CALL NORMEXIT;              /* SET UP EXIT                   */ 00279000
         BAL   @14,NORMEXIT                                        0581 00280000
*     END;                                                         0582 00281000
*   ELSE                                                           0583 00282000
*     DO;                           /* ERROR RESPONSE PROC           */ 00283000
         B     @RC00578                                            0583 00284000
@RF00578 DS    0H                                                  0584 00285000
*       OPCWRKSP(2)=PARM4;          /* SET UP ERROR PARM             */ 00286000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00250                      0584 00287000
*       CALL ERREXIT;               /* ERROR PROCESSING              */ 00288000
         BAL   @14,ERREXIT                                         0585 00289000
*     END;                                                         0586 00290000
*   RRETURN=OPCWRKSP(3);            /* LOAD RETURN ADDR              */ 00291000
@RC00578 L     RRETURN,OPCWRKSP+8(,ROPCAVT)                        0587 00292000
*   RETURN;                                                        0588 00293000
@EL00004 DS    0H                                                  0588 00294000
@EF00004 DS    0H                                                  0588 00295000
@ER00004 BR    @14                                                 0588 00296000
*   END;                            /* END OF SNASTRT                */ 00297000
*                                                                  0590 00298000
*   /*****************************************************************/ 00299000
*   /*                                                               */ 00300000
*   /* PROCESS STARTLINE REQUEST THIS ROUTINE IS CALLED FROM MAIN    */ 00301000
*   /* PROGRAM LOGIC                                                 */ 00302000
*   /*                                                               */ 00303000
*   /*****************************************************************/ 00304000
*                                                                  0590 00305000
*STRTREQ:                                                          0590 00306000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0590 00307000
STRTREQ  DS    0H                                                  0591 00308000
*   OPCWRKSP(3)=RRETURN;            /* SAVE RETURN ADDR              */ 00309000
         ST    RRETURN,OPCWRKSP+8(,ROPCAVT)                        0591 00310000
*   IF FIRSTREQ=ON THEN                                            0592 00311000
         TM    FIRSTREQ(ROPCAVT),B'10000000'                       0592 00312000
         BNO   @RF00592                                            0592 00313000
*     DO;                           /* IF FIRST REQUEST FIND FIRST 0593 00314000
*                                      LINE TO PROC                  */ 00315000
*       FIRSTREQ=OFF;               /* RESET FLAG                    */ 00316000
         NI    FIRSTREQ(ROPCAVT),B'01111111'                       0594 00317000
*       CALL GETFIRST;              /* FIND THE FIRST LINE           */ 00318000
         BAL   @14,GETFIRST                                        0595 00319000
*     END;                                                         0596 00320000
*   ELSE                                                           0597 00321000
*     IF MORELINE=ON THEN                                          0597 00322000
         B     @RC00592                                            0597 00323000
@RF00592 TM    MORELINE(ROPCAVT),B'01000000'                       0597 00324000
         BNO   @RF00597                                            0597 00325000
*       MORELINE=OFF;               /* RESET LOOP BIT        @YM06057*/ 00326000
         NI    MORELINE(ROPCAVT),B'10111111'                       0598 00327000
*     ELSE                                                         0599 00328000
*       ;                           /*                       @YM06057*/ 00329000
@RF00597 DS    0H                                                  0600 00330000
*   RPARM=OCTRMTBL;                 /* TTCIN OF LINE TO PROCESS      */ 00331000
@RC00592 SLR   RPARM,RPARM                                         0600 00332000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                             0600 00333000
*   CALL IEDQTNT;                   /* CONVERT TO TTE                */ 00334000
         L     @15,AVTRNMPT(,IEDQAPTR)                             0601 00335000
         BALR  @14,@15                                             0601 00336000
*   RTERM=RPARM;                    /* SET UP TTE BASE               */ 00337000
         LR    RTERM,RPARM                                         0602 00338000
*   IF EXITFLAG=OFF THEN                                           0603 00339000
         TM    EXITFLAG(ROPCAVT),B'00100000'                       0603 00340000
         BNZ   @RF00603                                            0603 00341000
*     DO;                           /* NO ERROR FOUND YET            */ 00342000
*       CALL SNACHK;                /* CHECK FOR SNA LINE            */ 00343000
         BAL   @14,SNACHK                                          0605 00344000
*       IF EXITFLAG=OFF THEN                                       0606 00345000
         TM    EXITFLAG(ROPCAVT),B'00100000'                       0606 00346000
         BNZ   @RF00606                                            0606 00347000
*         DO;                       /* NO PREVIOUS ERROR             */ 00348000
*           CALL ACT3705;           /* VERIFY 3705 ACTIVE            */ 00349000
         BAL   @14,ACT3705                                         0608 00350000
*           IF EXITFLAG=OFF THEN                                   0609 00351000
         TM    EXITFLAG(ROPCAVT),B'00100000'                       0609 00352000
         BNZ   @RF00609                                            0609 00353000
*             DO;                   /* NO ERROR FOUND YET            */ 00354000
*               CALL LINESTAT;      /* VERFIY STATUS OF LINE         */ 00355000
         BAL   @14,LINESTAT                                        0611 00356000
*               IF EXITFLAG=OFF THEN                               0612 00357000
         TM    EXITFLAG(ROPCAVT),B'00100000'                       0612 00358000
         BNZ   @RF00612                                            0612 00359000
*                 DO;               /* NO ERRORS,CONT PROC           */ 00360000
*                   CALL ACTLINK;   /* BUILD ACT LINK REQ            */ 00361000
         BAL   @14,ACTLINK                                         0614 00362000
*                   OPCMODID=SSCPA0;/* CALL SSCP ROUTER              */ 00363000
         MVC   OPCMODID(2,ROPCAVT),@CC02561                        0615 00364000
*                 END;                                             0616 00365000
*             END;                                                 0617 00366000
*         END;                                                     0618 00367000
*     END;                                                         0619 00368000
*   ELSE                                                           0620 00369000
*     ;                                                            0620 00370000
@RF00603 DS    0H                                                  0621 00371000
*   RRETURN=OPCWRKSP(3);            /* LOAD RETURN ADDR              */ 00372000
@RC00603 L     RRETURN,OPCWRKSP+8(,ROPCAVT)                        0621 00373000
*   RETURN;                                                        0622 00374000
@EL00005 DS    0H                                                  0622 00375000
@EF00005 DS    0H                                                  0622 00376000
@ER00005 BR    @14                                                 0622 00377000
*   END;                            /* END OF STRTREQ                */ 00378000
*                                                                  0624 00379000
*   /*****************************************************************/ 00380000
*   /*                                                               */ 00381000
*   /* GET FIRST LINE TO PROCESS THIS ROUTINE IS CALLED BY STRTREQ.  */ 00382000
*   /*                                                               */ 00383000
*   /*****************************************************************/ 00384000
*                                                                  0624 00385000
*GETFIRST:                                                         0624 00386000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0624 00387000
GETFIRST DS    0H                                                  0625 00388000
*   OPCWRKSP(4)=RRETURN;            /* SAVE RETURN ADDR              */ 00389000
         ST    RRETURN,OPCWRKSP+12(,ROPCAVT)                       0625 00390000
*   IF OCRENTRD=ON THEN                                            0626 00391000
         TM    OCRENTRD(ROPCE),B'10000000'                         0626 00392000
         BNO   @RF00626                                            0626 00393000
*     DO;                           /* 2ND ENTRY TO VI               */ 00394000
*       OCRENTRD=OFF;               /* RESET INDICATOR               */ 00395000
         NI    OCRENTRD(ROPCE),B'01111111'                         0628 00396000
*       OCWTG=OCWTGB;               /* RESTORE OCWTG                 */ 00397000
         MVC   OCWTG(2,ROPCE),OCWTGB(ROPCE)                        0629 00398000
*     END;                                                         0630 00399000
*   ELSE                                                           0631 00400000
*     ;                                                            0631 00401000
@RF00626 DS    0H                                                  0632 00402000
*   RPARM=OCTRMTBL;                 /* GET TTCIN OF GRP OR LINE      */ 00403000
         SLR   RPARM,RPARM                                         0632 00404000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                             0632 00405000
*   CALL IEDQTNT;                   /* CONVERT TTCIN TO TTE          */ 00406000
         L     @15,AVTRNMPT(,IEDQAPTR)                             0633 00407000
         BALR  @14,@15                                             0633 00408000
*   RTERM=RPARM;                    /* SET UP TTE BASE               */ 00409000
         LR    RTERM,RPARM                                         0634 00410000
*   IF TRMTYPE=TRMGRP THEN                                         0635 00411000
         LR    @15,RTERM                                           0635 00412000
         SH    @15,@CH00036                                        0635 00413000
         CLI   TRMTYPE(@15),X'00'                                  0635 00414000
         BNE   @RF00635                                            0635 00415000
*     DO;                           /* IF GROUP TTE THEN DO          */ 00416000
*       IF TRMSUBST^=0 THEN         /* IF VALID SUBST PTR            */ 00417000
         ICM   @11,3,TRMSUBST(@15)                                 0637 00418000
         BZ    @RF00637                                            0637 00419000
*         OCTRMTBL=TRMSUBST;        /* SAVE LINE TTCIN IN OPCE       */ 00420000
         MVC   OCTRMTBL(2,ROPCE),TRMSUBST(@15)                     0638 00421000
*       ELSE                                                       0639 00422000
*         DO;                       /* NO LINES IN GROUP             */ 00423000
         B     @RC00637                                            0639 00424000
@RF00637 DS    0H                                                  0640 00425000
*           EXITFLAG=ON;            /* INDICATE EXIT                 */ 00426000
         OI    EXITFLAG(ROPCAVT),B'00100000'                       0640 00427000
*           OPCMODID=MOD03;         /* ERROR EXIT MODULE             */ 00428000
         MVC   OPCMODID(2,ROPCAVT),@CC02559                        0641 00429000
*           OPCWRKSP(1)=MSG102;     /* ERROR MSG NUMBER              */ 00430000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02543                        0642 00431000
*           OPCWRKSP(2)=PARM4;      /* PARM VALUE                    */ 00432000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00250                      0643 00433000
*         END;                                                     0644 00434000
*     END;                                                         0645 00435000
*   ELSE                                                           0646 00436000
*     ;                                                            0646 00437000
@RF00635 DS    0H                                                  0647 00438000
*   IF EXITFLAG=OFF THEN                                           0647 00439000
@RC00635 TM    EXITFLAG(ROPCAVT),B'00100000'                       0647 00440000
         BNZ   @RF00647                                            0647 00441000
*     DO;                           /* NO ERROR COND FOUND           */ 00442000
*       RPARM=ADDR(OCBACKUP);       /* GET ADDR OF GRPNAME           */ 00443000
         LA    RPARM,OCBACKUP(,ROPCE)                              0649 00444000
*       CALL WAITLSRH;              /* FIND OPCE WITH SAME GRPNAME   */ 00445000
         BAL   @14,WAITLSRH                                        0650 00446000
*       IF RPARM=0 THEN                                            0651 00447000
         LTR   RPARM,RPARM                                         0651 00448000
         BNZ   @RF00651                                            0651 00449000
*         DO;                       /* IF OPCE NOT FOUND WITH SAME 0652 00450000
*                                      GRPNAME THEN DO               */ 00451000
*           IF OCALLFLG=ON THEN                                    0653 00452000
         TM    OCALLFLG(ROPCE),B'00000100'                         0653 00453000
         BNO   @RF00653                                            0653 00454000
*             DO;                   /* GRP,ALL LOOP                  */ 00455000
*               OCSOME=OFF;         /* CLEAR STATUS BITS             */ 00456000
*               OCNONE=OFF;                                        0656 00457000
         NI    OCSOME(ROPCE),B'11111100'                           0656 00458000
*             END;                                                 0657 00459000
*           ELSE                                                   0658 00460000
*             ;                                                    0658 00461000
@RF00653 DS    0H                                                  0659 00462000
*         END;                                                     0659 00463000
*       ELSE                                                       0660 00464000
*         DO;                       /* OPCE WITH SAME GRP NAME FOUND */ 00465000
         B     @RC00651                                            0660 00466000
@RF00651 DS    0H                                                  0661 00467000
*           OCWTGB=OCWTG;           /* SAVE OCWTG                    */ 00468000
         MVC   OCWTGB(2,ROPCE),OCWTG(ROPCE)                        0661 00469000
*           OCRENTRD=ON;            /* INDICATE 2ND ENTRY            */ 00470000
         OI    OCRENTRD(ROPCE),B'10000000'                         0662 00471000
*           OCWTG=VI;               /* SET TO RETURN HERE            */ 00472000
         MVC   OCWTG(2,ROPCE),@CC02563                             0663 00473000
*           EXITFLAG=ON;            /* INDICATE EXIT                 */ 00474000
         OI    EXITFLAG(ROPCAVT),B'00100000'                       0664 00475000
*           OPCMODID=XCTL00;        /* MODULE TO GET CONTROL         */ 00476000
         MVC   OPCMODID(2,ROPCAVT),@CC02565                        0665 00477000
*           CALL WAITLATT;          /* ATTACH OPCE TO WAITL          */ 00478000
         BAL   @14,WAITLATT                                        0666 00479000
*         END;                                                     0667 00480000
*     END;                                                         0668 00481000
*   ELSE                                                           0669 00482000
*     ;                                                            0669 00483000
@RF00647 DS    0H                                                  0670 00484000
*   RRETURN=OPCWRKSP(4);            /* RESTORE RETURN ADDR           */ 00485000
@RC00647 L     RRETURN,OPCWRKSP+12(,ROPCAVT)                       0670 00486000
*   RETURN;                                                        0671 00487000
@EL00006 DS    0H                                                  0671 00488000
@EF00006 DS    0H                                                  0671 00489000
@ER00006 BR    @14                                                 0671 00490000
*   END;                            /* END OF GETFIRST               */ 00491000
*                                                                  0673 00492000
*   /*****************************************************************/ 00493000
*   /*                                                               */ 00494000
*   /* WAITL ATTACH SUBROUTINE. REG 1 MUST POINT TO OPCE ON WAITL    */ 00495000
*   /* CHAIN AND REG 3 (ROPCE) TO THE OPCE TO BE ATTACHED THIS       */ 00496000
*   /* ROUTINE IS CALLED BY GETFIRST                                 */ 00497000
*   /*                                                               */ 00498000
*   /*****************************************************************/ 00499000
*                                                                  0673 00500000
*WAITLATT:                                                         0673 00501000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0673 00502000
WAITLATT DS    0H                                                  0674 00503000
*   DO WHILE(RPARM->OCATTACH=ON);   /* IF OPCES ALREADY ATTACHED     */ 00504000
         B     @DE00674                                            0674 00505000
@DL00674 DS    0H                                                  0675 00506000
*     RPARM=RPARM->OCELMPTR;        /* NEXT OPCE                     */ 00507000
         SLR   @15,@15                                             0675 00508000
         ICM   @15,7,OCELMPTR(RPARM)                               0675 00509000
         LR    RPARM,@15                                           0675 00510000
*   END;                                                           0676 00511000
@DE00674 TM    OCATTACH(RPARM),B'00000010'                         0676 00512000
         BO    @DL00674                                            0676 00513000
*   RPARM->OCELMPTR=ROPCE;          /* OPCE TO ATTACH                */ 00514000
         STCM  ROPCE,7,OCELMPTR(RPARM)                             0677 00515000
*   RPARM->OCATTACH=ON;             /* IND ATTACHED OPCE             */ 00516000
         OI    OCATTACH(RPARM),B'00000010'                         0678 00517000
*   RETURN;                                                        0679 00518000
@EL00007 DS    0H                                                  0679 00519000
@EF00007 DS    0H                                                  0679 00520000
@ER00007 BR    @14                                                 0679 00521000
*   END;                            /* END OF WAITLATT               */ 00522000
*                                                                  0681 00523000
*   /*****************************************************************/ 00524000
*   /*                                                               */ 00525000
*   /* THIS SUBROUTINE CHECKS FOR SNA LINES THIS ROUTINE IS CALLED BY*/ 00526000
*   /* STRTREQ.                                                      */ 00527000
*   /*                                                               */ 00528000
*   /*****************************************************************/ 00529000
*                                                                  0681 00530000
*SNACHK:                                                           0681 00531000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0681 00532000
SNACHK   DS    0H                                                  0682 00533000
*   IF TRMTYPE=TRMSDLC THEN                                        0682 00534000
         LR    @15,RTERM                                           0682 00535000
         AL    @15,@CF01705                                        0682 00536000
         CLI   TRMTYPE-15(@15),X'21'                               0682 00537000
         BNE   @RF00682                                            0682 00538000
*     DO;                           /* IF SNA LINE                   */ 00539000
*       OCIPLWA=0;                  /* CLEAR FOR USE BY ACT-DE       */ 00540000
         SLR   @15,@15                                             0684 00541000
         ST    @15,OCIPLWA(,ROPCE)                                 0684 00542000
*       OCPTRSAV=0;                 /* CLEARED FOR ACTIVATE USE      */ 00543000
         ST    @15,OCPTRSAV(,ROPCE)                                0685 00544000
*       OCWTGB=OCWTG;               /* SAVE CALLER                   */ 00545000
         MVC   OCWTGB(2,ROPCE),OCWTG(ROPCE)                        0686 00546000
*       OCWTG=VI;                   /* INDICATE RETURN HERE          */ 00547000
         MVC   OCWTG(2,ROPCE),@CC02563                             0687 00548000
*       OCSWITCH=OCTOFA;            /* IND ACT LINK REQ              */ 00549000
         MVI   OCSWITCH(ROPCE),X'22'                               0688 00550000
*       OPCMODID=FA;                /* ACT MOD TO GET CONTROL        */ 00551000
         MVC   OPCMODID(2,ROPCAVT),@CC02567                        0689 00552000
*       EXITFLAG=ON;                /* IND EXIT                      */ 00553000
         OI    EXITFLAG(ROPCAVT),B'00100000'                       0690 00554000
*     END;                                                         0691 00555000
*   ELSE                                                           0692 00556000
*     ;                                                            0692 00557000
@RF00682 DS    0H                                                  0693 00558000
*   RETURN;                                                        0693 00559000
@EL00008 DS    0H                                                  0693 00560000
@EF00008 DS    0H                                                  0693 00561000
@ER00008 BR    @14                                                 0693 00562000
*   END;                            /* END OF SNACHK                 */ 00563000
*                                                                  0695 00564000
*   /*****************************************************************/ 00565000
*   /*                                                               */ 00566000
*   /* THIS SUBROUTINE CHECKS THE ACTIVE STATUS OF THE LINE THIS     */ 00567000
*   /* ROUTINE IS CALLED BY STRTREQ                                  */ 00568000
*   /*                                                               */ 00569000
*   /*****************************************************************/ 00570000
*                                                                  0695 00571000
*LINESTAT:                                                         0695 00572000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0695 00573000
LINESTAT DS    0H                                                  0696 00574000
*   OPCWRKSP(4)=RRETURN;            /* SAVE RETURN ADDR              */ 00575000
         ST    RRETURN,OPCWRKSP+12(,ROPCAVT)                       0696 00576000
*   IF TRMEPMOD=ON THEN                                            0697 00577000
         LR    @15,RTERM                                           0697 00578000
         AL    @15,@CF02672                                        0697 00579000
         TM    TRMEPMOD-5(@15),B'10000000'                         0697 00580000
         BNO   @RF00697                                            0697 00581000
*     DO;                           /* IF LINE IS IN EP MODE         */ 00582000
*       OPCWRKSP(1)=MSG443;         /* SET UP ERROR MSG              */ 00583000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02520                        0699 00584000
*       OPCWRKSP(2)=PARM4;          /* SET UP PARM VALUE             */ 00585000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00250                      0700 00586000
*       EXITFLAG=ON;                /* INDICATE EXIT                 */ 00587000
         OI    EXITFLAG(ROPCAVT),B'00100000'                       0701 00588000
*       CALL ERREXIT;               /* EXECUTE ERROR PROCESS         */ 00589000
         BAL   @14,ERREXIT                                         0702 00590000
*     END;                                                         0703 00591000
*   ELSE                                                           0704 00592000
*     DO;                           /* LINE NOT IN EP MODE           */ 00593000
         B     @RC00697                                            0704 00594000
@RF00697 DS    0H                                                  0705 00595000
*       IF OCTOTE=ON THEN                                          0705 00596000
         TM    OCTOTE(ROPCE),B'01000000'                           0705 00597000
         BNO   @RF00705                                            0705 00598000
*         TRMSTOTE=OFF;             /* IF TOTE REQUEST, INDICATE LINE   00599000
*                                      NOT IN TOTE MODE              */ 00600000
         LR    @15,RTERM                                           0706 00601000
         AL    @15,@CF02673                                        0706 00602000
         NI    TRMSTOTE-7(@15),B'11111110'                         0706 00603000
*       ELSE                                                       0707 00604000
*         ;                                                        0707 00605000
@RF00705 DS    0H                                                  0708 00606000
*       IF TRMSTOTE=ON THEN                                        0708 00607000
         LR    @15,RTERM                                           0708 00608000
         AL    @15,@CF02673                                        0708 00609000
         TM    TRMSTOTE-7(@15),B'00000001'                         0708 00610000
         BNO   @RF00708                                            0708 00611000
*         DO;                       /* IF TOTE OWNS LINE             */ 00612000
*           OPCWRKSP(1)=MSG49;      /* SET ERROR MSG NUMBER          */ 00613000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02522                        0710 00614000
*           OPCWRKSP(2)=PARM4;      /* SET PARM VALUE                */ 00615000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00250                      0711 00616000
*           EXITFLAG=ON;            /* INDICATE EXIT                 */ 00617000
         OI    EXITFLAG(ROPCAVT),B'00100000'                       0712 00618000
*           CALL ERREXIT;           /* ERROR PROCESSING              */ 00619000
         BAL   @14,ERREXIT                                         0713 00620000
*         END;                                                     0714 00621000
*       ELSE                                                       0715 00622000
*         DO;                       /* TOTE DOESNT CONTROL LINE      */ 00623000
         B     @RC00708                                            0715 00624000
@RF00708 DS    0H                                                  0716 00625000
*           IF TRMRSACT=ON THEN                                    0716 00626000
         LR    @15,RTERM                                           0716 00627000
         AL    @15,@CF02674                                        0716 00628000
         TM    TRMRSACT-6(@15),B'10000000'                         0716 00629000
         BNO   @RF00716                                            0716 00630000
*             DO;                   /* IF LINE ALREADY ACTIVE        */ 00631000
*               OPCWRKSP(1)=MSG19;  /* SET ERROR MSG NUMBER          */ 00632000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02524                        0718 00633000
*               OPCWRKSP(2)=PARM8;  /* SET PARM VALUE                */ 00634000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00046                      0719 00635000
*               EXITFLAG=ON;        /* INDICATE EXIT                 */ 00636000
         OI    EXITFLAG(ROPCAVT),B'00100000'                       0720 00637000
*               CALL ERREXIT;       /* ERROR PROCESSING              */ 00638000
         BAL   @14,ERREXIT                                         0721 00639000
*             END;                                                 0722 00640000
*           ELSE                                                   0723 00641000
*             ;                                                    0723 00642000
@RF00716 DS    0H                                                  0724 00643000
*         END;                                                     0724 00644000
*     END;                                                         0725 00645000
@RC00708 DS    0H                                                  0726 00646000
*   RRETURN=OPCWRKSP(4);            /* RESTORE RETURN REG            */ 00647000
@RC00697 L     RRETURN,OPCWRKSP+12(,ROPCAVT)                       0726 00648000
*   RETURN;                                                        0727 00649000
@EL00009 DS    0H                                                  0727 00650000
@EF00009 DS    0H                                                  0727 00651000
@ER00009 BR    @14                                                 0727 00652000
*   END;                            /* END OF LINESTAT               */ 00653000
*                                                                  0729 00654000
*   /*****************************************************************/ 00655000
*   /*                                                               */ 00656000
*   /* THIS SUBROUTINE CHECKS FOR NCP ACTIVE THIS ROUTINE IS CALLED  */ 00657000
*   /* BY STRTREQ.                                                   */ 00658000
*   /*                                                               */ 00659000
*   /*****************************************************************/ 00660000
*                                                                  0729 00661000
*ACT3705:                                                          0729 00662000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0729 00663000
ACT3705  DS    0H                                                  0730 00664000
*   OPCWRKSP(4)=RRETURN;            /* SAVE RETURN REG               */ 00665000
         ST    RRETURN,OPCWRKSP+12(,ROPCAVT)                       0730 00666000
*   IF TRMCOHRT=0 THEN                                             0731 00667000
         LR    @15,RTERM                                           0731 00668000
         AL    @15,@CF02675                                        0731 00669000
         ICM   @11,3,TRMCOHRT-8(@15)                               0731 00670000
         BNZ   @RF00731                                            0731 00671000
*     DO;                           /* IF NO COHORT PTR              */ 00672000
*       OPCWRKSP(1)=NCPACT;         /* NCP NOT ACTIVE MSG            */ 00673000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02526                        0733 00674000
*       OPCWRKSP(2)=PARM4;          /* SET PARM VALUE                */ 00675000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00250                      0734 00676000
*       EXITFLAG=ON;                /* INDICATE EXIT                 */ 00677000
         OI    EXITFLAG(ROPCAVT),B'00100000'                       0735 00678000
*       CALL ERREXIT;               /* ERROR PROCESSING              */ 00679000
         BAL   @14,ERREXIT                                         0736 00680000
*     END;                                                         0737 00681000
*   ELSE                                                           0738 00682000
*     DO;                           /* HIERARCHY IN PLACE            */ 00683000
         B     @RC00731                                            0738 00684000
@RF00731 DS    0H                                                  0739 00685000
*       RESPECIFY                                                  0739 00686000
*         RSAVE RSTD;               /* R13=SAVE AREA ADDR            */ 00687000
*       RSAVE=ADDR(OPCSAVE);        /* SET UP SAVE AREA              */ 00688000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0740 00689000
*       RPARM=RTERM;                /* PASS TTE                      */ 00690000
         LR    RPARM,RTERM                                         0741 00691000
*       CALL COHORTLK;              /* COHORT LOOK UP RTN            */ 00692000
         L     @15,OPCHORT(,ROPCAVT)                               0742 00693000
         BALR  @14,@15                                             0742 00694000
*       RESPECIFY                                                  0743 00695000
*         RSAVE UNRSTD;                                            0743 00696000
*       RPARM=RPARM-LENGTH(IEDNTRM);/* BACK UP TO NEGATIVE PREFIX    */ 00697000
         SH    RPARM,@CH00036                                      0744 00698000
*       IF RPARM->TRMRSACT=OFF THEN                                0745 00699000
         TM    TRMRSACT(RPARM),B'10000000'                         0745 00700000
         BNZ   @RF00745                                            0745 00701000
*         DO;                       /* ACTIVE FLAG OFF               */ 00702000
*           OPCWRKSP(1)=NCPACT;     /* NCP NOT ACTIVE MSG            */ 00703000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02526                        0747 00704000
*           OPCWRKSP(2)=PARM4;      /* PARM VALUE                    */ 00705000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00250                      0748 00706000
*           EXITFLAG=ON;            /* INDICATE EXIT                 */ 00707000
         OI    EXITFLAG(ROPCAVT),B'00100000'                       0749 00708000
*           CALL ERREXIT;           /* ERROR PROCESS                 */ 00709000
         BAL   @14,ERREXIT                                         0750 00710000
*         END;                                                     0751 00711000
*       ELSE                                                       0752 00712000
*         DO;                       /* ACTIVE FLAG ON                */ 00713000
         B     @RC00745                                            0752 00714000
@RF00745 DS    0H                                                  0753 00715000
*           IF OCACTREQ=OFF&RPARM->TRMINPG=ON THEN                 0753 00716000
         TM    OCACTREQ(ROPCE),B'00001000'                         0753 00717000
         BNZ   @RF00753                                            0753 00718000
         TM    TRMINPG(RPARM),B'00100000'                          0753 00719000
         BNO   @RF00753                                            0753 00720000
*             DO;                   /* IF REQUEST IS NOT FROM      0754 00721000
*                                      ACTIVATE AND ACT-DEACT-     0754 00722000
*                                      IPL-DUMP IN PROGRESS,ERROR    */ 00723000
*               RPARM=(RPARM+LENGTH(IEDNTRM))->TRMDESTQ->QCBDCBAD;/*    00724000
*                                      GET DEB ADDRESS       @YM09041*/ 00725000
         ICM   @15,7,TRMDESTQ+18(RPARM)                            0755 00726000
         SLR   @11,@11                                             0755 00727000
         ICM   @11,7,QCBDCBAD(@15)                                 0755 00728000
         LR    RPARM,@11                                           0755 00729000
*               RFY                                                0756 00730000
*                 IHADCB BASED(RPARM);/*                     @XM05659*/ 00731000
*               RPARM=DCBDEBAD;     /* GET DEB ADDRESS       @XM05659*/ 00732000
         L     @15,DCBDEBAD+40(,RPARM)                             0757 00733000
         LR    RPARM,@15                                           0757 00734000
*               RFY                                                0758 00735000
*                 IEDQDEB BASED(RPARM);                            0758 00736000
*               RPARM=RPARM-(ADDR(DEBNMSUB)-ADDR(IEDQDEB));/* BACKUP */ 00737000
         SH    RPARM,@CH00800                                      0759 00738000
*               OCBACKUP=''B;       /* CLEAR TO INSERT THE UCB ADDR  */ 00739000
         XC    OCBACKUP(8,ROPCE),OCBACKUP(ROPCE)                   0760 00740000
*               OCBACKUP(1:3)=DEBUCBAD->UCBNAME;/* INSERT THE UCB  0761 00741000
*                                      ADDR                          */ 00742000
         ICM   @15,7,DEBUCBAD(RPARM)                               0761 00743000
         MVC   OCBACKUP(3,ROPCE),UCBNAME(@15)                      0761 00744000
*               OPCWRKSP(1)=NCPACT2;/* ERROR MSG                     */ 00745000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02528                        0762 00746000
*               OPCWRKSP(2)=PARM4;  /* SET PARM VALUE                */ 00747000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00250                      0763 00748000
*               EXITFLAG=ON;        /* INDICATE EXIT                 */ 00749000
         OI    EXITFLAG(ROPCAVT),B'00100000'                       0764 00750000
*               CALL ERREXIT;       /* ERROR PROCESSING              */ 00751000
         BAL   @14,ERREXIT                                         0765 00752000
*             END;                                                 0766 00753000
*           ELSE                                                   0767 00754000
*             ;                                                    0767 00755000
@RF00753 DS    0H                                                  0768 00756000
*         END;                                                     0768 00757000
*     END;                                                         0769 00758000
@RC00745 DS    0H                                                  0770 00759000
*   RRETURN=OPCWRKSP(4);            /* RESTORE RETURN ADDR           */ 00760000
@RC00731 L     RRETURN,OPCWRKSP+12(,ROPCAVT)                       0770 00761000
*   RETURN;                                                        0771 00762000
@EL00010 DS    0H                                                  0771 00763000
@EF00010 DS    0H                                                  0771 00764000
@ER00010 BR    @14                                                 0771 00765000
*   END;                            /* END OF ACT3705                */ 00766000
*                                                                  0773 00767000
*   /*****************************************************************/ 00768000
*   /*                                                               */ 00769000
*   /* WAITL CHAIN SEARCH ROUTINE THIS ROUTINE IS CALLED BY          */ 00770000
*   /* STRTRET,PROCRESP,GETFIRST                                     */ 00771000
*   /*                                                               */ 00772000
*   /*****************************************************************/ 00773000
*                                                                  0773 00774000
*WAITLSRH:                                                         0773 00775000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0773 00776000
WAITLSRH DS    0H                                                  0774 00777000
*   RESPECIFY                                                      0774 00778000
*    (RWORK6,                                                      0774 00779000
*     RWORK7) RSTD;                 /* THIS RTN USES RWORK6 TO     0774 00780000
*                                      CONTAIN THE ADDR OF THE PREVI    00781000
*                                      OPCE ON THE CHAIN. RWORK7 HAS    00782000
*                                      THIS ADDRESS OF THE OPCE WE 0774 00783000
*                                      ARE LOOKING AT                */ 00784000
*   RWORK6=ADDR(OPCWAITV);          /* ADDR OF WAITL CHAIN           */ 00785000
         LA    RWORK6,OPCWAITV(,ROPCAVT)                           0775 00786000
*   RWORK7=OPCWAITV;                /* GET 1ST ELEM ON CHAIN         */ 00787000
         L     RWORK7,OPCWAITV(,ROPCAVT)                           0776 00788000
*   RWORK7=RWORK7&MASKBYTE;         /* CLEAR HIGH ORDER BY   @YM06021*/ 00789000
         N     RWORK7,@CF02517                                     0777 00790000
*   DO WHILE(RWORK7^=0&RWORK7->OCBACKUP^=RPARM->GRPNAME);/* SEARCH 0778 00791000
*                                      WAITL CHAIN UNTIL END OF CHAIN   00792000
*                                      FOUND OR MATCHING GRPNAMES  0778 00793000
*                                      FOUND                         */ 00794000
         B     @DE00778                                            0778 00795000
@DL00778 DS    0H                                                  0779 00796000
*     RWORK6=RWORK7;                /* SAVE THIS AS PREVIOUS         */ 00797000
         LR    RWORK6,RWORK7                                       0779 00798000
*     RWORK7=RWORK7->OCLINK;        /* NEXT OPCE                     */ 00799000
         L     RWORK7,OCLINK(,RWORK7)                              0780 00800000
*   END;                                                           0781 00801000
@DE00778 LTR   RWORK7,RWORK7                                       0781 00802000
         BZ    @DC00778                                            0781 00803000
         CLC   OCBACKUP(8,RWORK7),GRPNAME(RPARM)                   0781 00804000
         BNE   @DL00778                                            0781 00805000
@DC00778 DS    0H                                                  0782 00806000
*   IF RWORK7=0 THEN                                               0782 00807000
         LTR   RWORK7,RWORK7                                       0782 00808000
         BNZ   @RF00782                                            0782 00809000
*     RPARM=0;                      /* NO OPCE FOUND                 */ 00810000
         SLR   RPARM,RPARM                                         0783 00811000
*   ELSE                                                           0784 00812000
*     DO;                                                          0784 00813000
         B     @RC00782                                            0784 00814000
@RF00782 DS    0H                                                  0785 00815000
*       RPARM=RWORK7;               /* R1=OPCE                       */ 00816000
         LR    RPARM,RWORK7                                        0785 00817000
*       RZERO=RWORK6;               /* R0=PREVIOUS OPCE              */ 00818000
         LR    RZERO,RWORK6                                        0786 00819000
*     END;                                                         0787 00820000
*   RESPECIFY                                                      0788 00821000
*    (RWORK6,                                                      0788 00822000
*     RWORK7) UNRSTD;                                              0788 00823000
*   RETURN;                                                        0789 00824000
@EL00011 DS    0H                                                  0789 00825000
@EF00011 DS    0H                                                  0789 00826000
@ER00011 BR    @14                                                 0789 00827000
*   END;                            /* END OF WAITLSRH               */ 00828000
         B     @EL00011                                            0790 00829000
*                                                                  0791 00830000
*   /*****************************************************************/ 00831000
*   /*                                                               */ 00832000
*   /* THIS SUBR BUILDS THE ACT LINK REQUEST THIS ROUTINE IS CALLED  */ 00833000
*   /* BY STRTREQ                                                    */ 00834000
*   /*                                                               */ 00835000
*   /*****************************************************************/ 00836000
*                                                                  0791 00837000
*ACTLINK:                                                          0791 00838000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0791 00839000
ACTLINK  DS    0H                                                  0792 00840000
*   OPCWRKSP(4)=RRETURN;            /* SAVE RETURN ADDR              */ 00841000
         ST    RRETURN,OPCWRKSP+12(,ROPCAVT)                       0792 00842000
*   RPARM=1;                        /* GET ONE BUFFER                */ 00843000
         LA    RPARM,1                                             0793 00844000
*   RESPECIFY                                                      0794 00845000
*     RSAVE RSTD;                   /* R13=SAVE AREA ADDR            */ 00846000
*   RSAVE=ADDR(OPCSAVE);            /* ADDR OF SAVE AREA             */ 00847000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0795 00848000
*   CALL ALLOCBUF;                  /* GET BUFF SUBR IN QCA          */ 00849000
         L     @15,OPCGETBF(,ROPCAVT)                              0796 00850000
         BALR  @14,@15                                             0796 00851000
*   RESPECIFY                                                      0797 00852000
*     RSAVE UNRSTD;                                                0797 00853000
*   RPARM->OPREPRI=PRIHIFLG;        /* SET PRIORITY                  */ 00854000
         MVI   OPREPRI(RPARM),X'E9'                                0798 00855000
*   RPARM->OPREFLG1=OPRA0;          /* SET FLAG FOR A0               */ 00856000
         MVI   OPREFLG1(RPARM),X'01'                               0799 00857000
*   RPARM->OCSWITCH=OCACTLK;        /* SET ACTLINK REQ FLAG          */ 00858000
         MVI   OCSWITCH(RPARM),X'50'                               0800 00859000
*   RPARM->OCWTG=VI;                /* INDICATE RETURN HERE          */ 00860000
         MVC   OCWTG(2,RPARM),@CC02563                             0801 00861000
*   RPARM->OCACTREQ=ON;             /* INDICATE ACTIVATE IN PROG     */ 00862000
         OI    OCACTREQ(RPARM),B'00001000'                         0802 00863000
*   RPARM->OCTRMTBL=OCTRMTBL;       /* GET TTCIN FROM OPCE MOVE TO 0803 00864000
*                                      DUMMY OPCE                    */ 00865000
         MVC   OCTRMTBL(2,RPARM),OCTRMTBL(ROPCE)                   0803 00866000
*   RPARM->OCBACKUP=OCBACKUP;       /* MOVE GRPNAME FROM OPCE TO   0804 00867000
*                                      DUMMY OPCE                    */ 00868000
         MVC   OCBACKUP(8,RPARM),OCBACKUP(ROPCE)                   0804 00869000
*   OPCCOPCE=RPARM;                 /* ATTACH DUMMY OPCE TO OAVT     */ 00870000
         ST    RPARM,OPCCOPCE(,ROPCAVT)                            0805 00871000
*   CALL WAITLADD;                  /* PUT ORIGINAL OPCE ON WAITL    */ 00872000
         BAL   @14,WAITLADD                                        0806 00873000
*   RRETURN=OPCWRKSP(4);            /* RESTORE RETURN ADDR           */ 00874000
         L     RRETURN,OPCWRKSP+12(,ROPCAVT)                       0807 00875000
*   RETURN;                                                        0808 00876000
@EL00012 DS    0H                                                  0808 00877000
@EF00012 DS    0H                                                  0808 00878000
@ER00012 BR    @14                                                 0808 00879000
*   END;                            /* END OF ACTLINK                */ 00880000
*                                                                  0810 00881000
*   /*****************************************************************/ 00882000
*   /*                                                               */ 00883000
*   /* THIS SUBROUTINE BUILDS THE REQUEST TO IEDNSL TO PRIME THE     */ 00884000
*   /* TERMINALS ON A SPECIFIC LINE THIS ROUTINE IS CALLED BY        */ 00885000
*   /* PROCRESP                                                      */ 00886000
*   /*                                                               */ 00887000
*   /*****************************************************************/ 00888000
*                                                                  0810 00889000
*STRTLINE:                                                         0810 00890000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0810 00891000
STRTLINE DS    0H                                                  0811 00892000
*   OPCWRKSP(4)=RRETURN;            /* SAVE RETURN ADDR              */ 00893000
         ST    RRETURN,OPCWRKSP+12(,ROPCAVT)                       0811 00894000
*   RESPECIFY                                                      0812 00895000
*     RWORK8 RSTD;                  /* PROCRESP HAS LOADED RWORK8  0812 00896000
*                                      WITH THE REAL OPCE ADDR       */ 00897000
*   NSLPLCB=''B;                    /* CLEAR FIELD                   */ 00898000
         MVI   NSLPLCB(RNSL),X'00'                                 0813 00899000
*   NSLSAVE=''B;                    /* CLEAR FIELD           @YM05736*/ 00900000
         SLR   @15,@15                                             0814 00901000
         STCM  @15,7,NSLSAVE(RNSL)                                 0814 00902000
*   NSLGPCUS=''B;                   /* CLEAR FIELD                   */ 00903000
         MVI   NSLGPCUS(RNSL),X'00'                                0815 00904000
*   NSLREQTY=NSLSTRTL;              /* INDICATE STARTLINE REQ        */ 00905000
         MVI   NSLREQTY(RNSL),X'01'                                0816 00906000
*   NSLPRIBK=PRIMEDFG;              /* SET RETURN PRIORITY           */ 00907000
         MVI   NSLPRIBK(RNSL),X'DF'                                0817 00908000
*   NSLFLGBK=OPRVI;                 /* RETURN FLAG TO VI             */ 00909000
         MVI   NSLFLGBK(RNSL),X'04'                                0818 00910000
*   RPARM=RWORK8->OCTRMTBL;         /* TTCIN OF LINE                 */ 00911000
         SLR   RPARM,RPARM                                         0819 00912000
         ICM   RPARM,3,OCTRMTBL(RWORK8)                            0819 00913000
*   CALL IEDQTNT;                   /* GET TTE ADDR                  */ 00914000
         L     @15,AVTRNMPT(,IEDQAPTR)                             0820 00915000
         BALR  @14,@15                                             0820 00916000
*   NSLTTEPT=RPARM;                 /* PASS IN PARM LIST             */ 00917000
         ST    RPARM,NSLTTEPT(,RNSL)                               0821 00918000
*   NSLGRPNM=RWORK8->OCBACKUP;      /* PASS GROUP NAME               */ 00919000
         MVC   NSLGRPNM(8,RNSL),OCBACKUP(RWORK8)                   0822 00920000
*   OPREQCB=SAVTSPLN;               /* QCB FOR NSL                   */ 00921000
         L     @15,AVTSAVTP(,IEDQAPTR)                             0823 00922000
         MVC   OPREQCB(3,ROPCE),SAVTSPLN+1(@15)                    0823 00923000
*   OPREPRI=PRIOPCTL;               /* PRIORITY FOR NSL              */ 00924000
         MVI   OPREPRI(ROPCE),X'DC'                                0824 00925000
*   QCTLWRD1=RNSL;                  /* NSL BUFFER ADDR               */ 00926000
         LA    @15,180                                             0825 00927000
         ALR   @15,ROPCAVT                                         0825 00928000
         ST    RNSL,QCTLWRD1(,@15)                                 0825 00929000
*   QCTLWRD2=RNSL;                  /* NSL BUFFER ADDR               */ 00930000
         ST    RNSL,QCTLWRD2(,@15)                                 0826 00931000
*   QCTLREQ=TPOST;                  /* INDICATE POST REQUEST         */ 00932000
         MVI   QCTLREQ(@15),X'0C'                                  0827 00933000
*   QCTLEND=ENDLIST;                /* END OF PARM LIST              */ 00934000
         MVI   QCTLEND(@15),X'80'                                  0828 00935000
*   RTERM=RPARM;                    /* SET TTE BASE FOR LINE         */ 00936000
         LR    RTERM,RPARM                                         0829 00937000
*   RPARM=ADDR(OPCAQCTL);           /* ADDR OF PARM LIST             */ 00938000
         LA    RPARM,OPCAQCTL(,ROPCAVT)                            0830 00939000
*   SVC(102);                       /* ISSUE SVC 102                 */ 00940000
         SVC   102                                                 0831 00941000
*   ROPCE=RWORK8;                   /* ESTAB ADDR TO OPCE            */ 00942000
         LR    ROPCE,RWORK8                                        0832 00943000
*   CALL WAITLADD;                  /* PUT OPCE ON WAITCHAIN         */ 00944000
         BAL   @14,WAITLADD                                        0833 00945000
*   OPCMODID=XCTL00;                /* EXIT TO IGC0010D              */ 00946000
         MVC   OPCMODID(2,ROPCAVT),@CC02565                        0834 00947000
*   RRETURN=OPCWRKSP(4);            /* RESTORE RETURN ADDR           */ 00948000
         L     RRETURN,OPCWRKSP+12(,ROPCAVT)                       0835 00949000
*   RETURN;                                                        0836 00950000
@EL00013 DS    0H                                                  0836 00951000
@EF00013 DS    0H                                                  0836 00952000
@ER00013 BR    @14                                                 0836 00953000
*   RESPECIFY                                                      0837 00954000
*     RWORK8 UNRSTD;                                               0837 00955000
*   END;                            /* END OF STRT TERM              */ 00956000
*                                                                  0839 00957000
*   /*****************************************************************/ 00958000
*   /*                                                               */ 00959000
*   /* THIS SUBROUTINE PUTS AN ELEMENT ON THE WAITL CHAIN THIS       */ 00960000
*   /* ROUTINE IS CALLED BY ACTLINK,STRTLINE                         */ 00961000
*   /*                                                               */ 00962000
*   /*****************************************************************/ 00963000
*                                                                  0839 00964000
*WAITLADD:                                                         0839 00965000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0839 00966000
WAITLADD DS    0H                                                  0840 00967000
*   RESPECIFY                                                      0840 00968000
*     RWORK7 RSTD;                  /* RWORK7 IS USED TO CONTAIN ADDR   00969000
*                                      OF AN ELEMENT OF WAITL        */ 00970000
*   RWORK7=OPCWAITV;                /* GET 1ST ELEM ON WAITL         */ 00971000
         L     RWORK7,OPCWAITV(,ROPCAVT)                           0841 00972000
*   OCLINK=RWORK7;                  /* SET NEXT ELEM PTR             */ 00973000
         ST    RWORK7,OCLINK(,ROPCE)                               0842 00974000
*   ROPCE=ROPCE&MASKBYTE;           /* CLEAR THE HIGH ORDER BYTE   0843 00975000
*                                                            @YM04620*/ 00976000
         N     ROPCE,@CF02517                                      0843 00977000
*   OPCWAITV=ROPCE;                 /* CHAIN ELEM IN                 */ 00978000
         ST    ROPCE,OPCWAITV(,ROPCAVT)                            0844 00979000
*   RETURN;                                                        0845 00980000
@EL00014 DS    0H                                                  0845 00981000
@EF00014 DS    0H                                                  0845 00982000
@ER00014 BR    @14                                                 0845 00983000
*   RESPECIFY                                                      0846 00984000
*     RWORK7 UNRSTD;                                               0846 00985000
*   END;                            /* END OF WAITLADD               */ 00986000
*                                                                  0848 00987000
*   /*****************************************************************/ 00988000
*   /*                                                               */ 00989000
*   /* ERROR RESPONSE PROCESSING THIS ROUTINE IS CALLED BY PROCRESP  */ 00990000
*   /*                                                               */ 00991000
*   /*****************************************************************/ 00992000
*                                                                  0848 00993000
*ERRRESP:                                                          0848 00994000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0848 00995000
ERRRESP  DS    0H                                                  0849 00996000
*   RESPECIFY                                                      0849 00997000
*     RWORK8 RSTD;                  /* PROCRESP HAS LOADED OPCE ADDR    00998000
*                                      IN RWORK8                     */ 00999000
*   OPCWRKSP(4)=RRETURN;            /* SAVE RETURN ADDR              */ 01000000
         ST    RRETURN,OPCWRKSP+12(,ROPCAVT)                       0850 01001000
*   IF OCPARM=PARM2 THEN            /* LINE ALREADY STARTED? @YM08579*/ 01002000
         CLC   OCPARM(2,ROPCE),@CH00132                            0851 01003000
         BNE   @RF00851                                            0851 01004000
*     DO;                           /*                       @YM08579*/ 01005000
*       RESPECIFY                                                  0853 01006000
*         RSAVE RSTD;                                              0853 01007000
*       RSAVE=ADDR(OPCSAVE);        /* ADDR OF SAVE AREA             */ 01008000
         LA    RSAVE,OPCSAVE(,ROPCAVT)                             0854 01009000
*       CALL FREEBUF;               /* FREE RSP BUFFER       @YM08579*/ 01010000
         L     @15,OPCFREBF(,ROPCAVT)                              0855 01011000
         BALR  @14,@15                                             0855 01012000
*     END;                          /*                       @YM08579*/ 01013000
*   ELSE                            /*                       @YM08579*/ 01014000
*     RWORK8->OCUNIT=ROPCE->OCUNIT; /* SAVE BUF FOR MG199    @YM08579*/ 01015000
         B     @RC00851                                            0857 01016000
@RF00851 MVC   OCUNIT(4,RWORK8),OCUNIT(ROPCE)                      0857 01017000
*   RPARM=ROPCE;                    /* FREE OPCE                     */ 01018000
@RC00851 LR    RPARM,ROPCE                                         0858 01019000
*   RPARM->OCUNIT=BADTIC;           /* 1 BUFFER TO FREE      @YM03737*/ 01020000
         MVC   OCUNIT(4,RPARM),@CF02506                            0859 01021000
*   IF OCPARM=PARM2 THEN            /* LINE ALREADY STARTED? @YM04637*/ 01022000
         CLC   OCPARM(2,ROPCE),@CH00132                            0860 01023000
         BNE   @RF00860                                            0860 01024000
*     OPCWRKSP(1)=MSG19;            /* SETUP ALREADY STARTED MESSAGE    01025000
*                                                            @YM04637*/ 01026000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02524                        0861 01027000
*   ELSE                            /* NCP REJECTION         @YM04637*/ 01028000
*     OPCWRKSP(1)=MSG199;           /* MSG NUMBER 199                */ 01029000
         B     @RC00860                                            0862 01030000
@RF00860 MVC   OPCWRKSP(4,ROPCAVT),@CF02530                        0862 01031000
*   CALL FREEBUF;                   /* QCA FREE BUFFER RTN           */ 01032000
@RC00860 L     @15,OPCFREBF(,ROPCAVT)                              0863 01033000
         BALR  @14,@15                                             0863 01034000
*   RESPECIFY                                                      0864 01035000
*     RSAVE UNRSTD;                                                0864 01036000
*   OPCWRKSP(2)=PARM4;              /* SET UP PARM VALUE             */ 01037000
         MVC   OPCWRKSP+4(4,ROPCAVT),@CF00250                      0865 01038000
*   ROPCE=RWORK8;                   /* GET OPCE                      */ 01039000
         LR    ROPCE,RWORK8                                        0866 01040000
*   RESPECIFY                                                      0867 01041000
*     RWORK8 UNRSTD;                                               0867 01042000
*   OPCCOPCE=ROPCE;                 /* MAKE ORIGINAL OPCE THE CURRENT   01043000
*                                      ONE                   @ZM48377*/ 01044000
         ST    ROPCE,OPCCOPCE(,ROPCAVT)                            0868 01045000
*   RPARM=OCTRMTBL;                 /* TTCIN OF LINE TO PROCESS      */ 01046000
         SLR   RPARM,RPARM                                         0869 01047000
         ICM   RPARM,3,OCTRMTBL(ROPCE)                             0869 01048000
*   CALL IEDQTNT;                   /* CONVERT TO TTE                */ 01049000
         L     @15,AVTRNMPT(,IEDQAPTR)                             0870 01050000
         BALR  @14,@15                                             0870 01051000
*   RTERM=RPARM;                    /* SET TTE BASE                  */ 01052000
         LR    RTERM,RPARM                                         0871 01053000
*   CALL ERREXIT;                   /* ERROR PROCESSING              */ 01054000
         BAL   @14,ERREXIT                                         0872 01055000
*   RRETURN=OPCWRKSP(4);            /* RESTORE RETURN ADDR           */ 01056000
         L     RRETURN,OPCWRKSP+12(,ROPCAVT)                       0873 01057000
*   RETURN;                                                        0874 01058000
@EL00015 DS    0H                                                  0874 01059000
@EF00015 DS    0H                                                  0874 01060000
@ER00015 BR    @14                                                 0874 01061000
*   END;                            /* END OF ERRRESP                */ 01062000
*                                                                  0876 01063000
*   /*****************************************************************/ 01064000
*   /*                                                               */ 01065000
*   /* ERROR PROCESSING THIS ROUTINE IS CALLED BY SNASTRT,           */ 01066000
*   /* LINESTAT,ACT3705,ERRRESP                                      */ 01067000
*   /*                                                               */ 01068000
*   /*****************************************************************/ 01069000
*                                                                  0876 01070000
*ERREXIT:                                                          0876 01071000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0876 01072000
ERREXIT  DS    0H                                                  0877 01073000
*   OPCWRKSP(5)=RRETURN;            /* SAVE RETURN ADDR              */ 01074000
         ST    RRETURN,OPCWRKSP+16(,ROPCAVT)                       0877 01075000
*   CALL ERRSTAT;                   /* UPDATE ERROR STATUS           */ 01076000
         BAL   @14,ERRSTAT                                         0878 01077000
*   IF MORELINE=OFF THEN                                           0879 01078000
         TM    MORELINE(ROPCAVT),B'01000000'                       0879 01079000
         BNZ   @RF00879                                            0879 01080000
*     DO;                           /* IF NO MORE LINES TO PROCESS,     01081000
*                                      THEN SETUP EXIT               */ 01082000
*       IF OCWTG=0 THEN                                            0881 01083000
         ICM   @15,3,OCWTG(ROPCE)                                  0881 01084000
         BNZ   @RF00881                                            0881 01085000
*         DO;                       /* NOT INTERNAL CALL             */ 01086000
*           RZERO=OPCWRKSP(1);      /* SET UPMSG NUMB                */ 01087000
         L     RZERO,OPCWRKSP(,ROPCAVT)                            0883 01088000
*           RPARM=OPCWRKSP(2);      /* PARM VALUE                    */ 01089000
         L     RPARM,OPCWRKSP+4(,ROPCAVT)                          0884 01090000
*           IF RZERO=MSG511         /* IF SOME LINES STARTED @ZM48467*/ 01091000
*             THEN                                                 0885 01092000
         CH    RZERO,@CH02534                                      0885 01093000
         BNE   @RF00885                                            0885 01094000
*             DO;                   /*                       @ZM48467*/ 01095000
*               OPCMODID=CHKPT;     /* SET TO XCTL TO IGC0610D     0887 01096000
*                                                            @ZM48467*/ 01097000
         MVC   OPCMODID(2,ROPCAVT),@CC02553                        0887 01098000
*               OCWTG=MOD03;        /* SET TO GO TO ERROR MESSAGE  0888 01099000
*                                      MODULE CHAIN FOLLOWING      0888 01100000
*                                      CHECKPOINT            @ZM48467*/ 01101000
         MVC   OCWTG(2,ROPCE),@CC02559                             0888 01102000
*               OCPARM=RZERO;       /* SET MESSAGE NUMBER IN OPCE SO    01103000
*                                      THAT IGC0610D CAN SET RZERO 0889 01104000
*                                      PRIOR TO XCTL TO IGC0310D   0889 01105000
*                                                            @ZM48484*/ 01106000
         STH   RZERO,OCPARM(,ROPCE)                                0889 01107000
*             END;                  /*                       @ZM48467*/ 01108000
*           ELSE                                                   0891 01109000
*             OPCMODID=MOD03;       /* ..ELSE XCTL DIRECTLY TO MSG 0891 01110000
*                                      MODULE                @ZM48467*/ 01111000
         B     @RC00885                                            0891 01112000
@RF00885 MVC   OPCMODID(2,ROPCAVT),@CC02559                        0891 01113000
*           CALL NONINTEX;          /* COMMON NON-INTERNALEXIT       */ 01114000
@RC00885 BAL   @14,NONINTEX                                        0892 01115000
*         END;                                                     0893 01116000
*       ELSE                                                       0894 01117000
*         CALL INTRINVK;            /* ELSE INTERNAL INVOKER         */ 01118000
         B     @RC00881                                            0894 01119000
@RF00881 BAL   @14,INTRINVK                                        0894 01120000
*     END;                                                         0895 01121000
*   ELSE                                                           0896 01122000
*     ;                                                            0896 01123000
@RF00879 DS    0H                                                  0897 01124000
*   RRETURN=OPCWRKSP(5);            /* RESTORE RETURN ADDR           */ 01125000
@RC00879 L     RRETURN,OPCWRKSP+16(,ROPCAVT)                       0897 01126000
*   RETURN;                                                        0898 01127000
@EL00016 DS    0H                                                  0898 01128000
@EF00016 DS    0H                                                  0898 01129000
@ER00016 BR    @14                                                 0898 01130000
*   END;                            /* END OF ERREXIT                */ 01131000
*                                                                  0900 01132000
*   /*****************************************************************/ 01133000
*   /*                                                               */ 01134000
*   /* NORMAL EXIT PROCESSING THIS ROUTINE IS CALLED BY              */ 01135000
*   /* STRTRET,SNASTRT                                               */ 01136000
*   /*                                                               */ 01137000
*   /*****************************************************************/ 01138000
*                                                                  0900 01139000
*NORMEXIT:                                                         0900 01140000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0900 01141000
NORMEXIT DS    0H                                                  0901 01142000
*   OPCWRKSP(4)=RRETURN;            /* SAVE RTURN ADDR               */ 01143000
         ST    RRETURN,OPCWRKSP+12(,ROPCAVT)                       0901 01144000
*   CALL NORMSTAT;                  /* UPDATE NORMAL STATUS          */ 01145000
         BAL   @14,NORMSTAT                                        0902 01146000
*   IF MORELINE=OFF THEN                                           0903 01147000
         TM    MORELINE(ROPCAVT),B'01000000'                       0903 01148000
         BNZ   @RF00903                                            0903 01149000
*     DO;                           /* IF NO MORE LINES              */ 01150000
*       IF OCWTG^=0 THEN                                           0905 01151000
         ICM   @15,3,OCWTG(ROPCE)                                  0905 01152000
         BZ    @RF00905                                            0905 01153000
*         CALL INTRINVK;            /* IF INTERNALLY INVOKED, SETUP     01154000
*                                      TO RETURN INTERNALLY          */ 01155000
         BAL   @14,INTRINVK                                        0906 01156000
*       ELSE                                                       0907 01157000
*         DO;                       /* NOT INTERNALLY INVOKED        */ 01158000
         B     @RC00905                                            0907 01159000
@RF00905 DS    0H                                                  0908 01160000
*           RZERO=OPCWRKSP(1);      /* PUT MSG NUMBER IN R0          */ 01161000
         L     RZERO,OPCWRKSP(,ROPCAVT)                            0908 01162000
*           RPARM=OPCWRKSP(2);      /* SET UP PARAMETER              */ 01163000
         L     RPARM,OPCWRKSP+4(,ROPCAVT)                          0909 01164000
*           OCPARM=RZERO;           /* PUT MSG NUMBER IN OCPARM      */ 01165000
         STH   RZERO,OCPARM(,ROPCE)                                0910 01166000
*           OPCMODID=CHKPT;         /* EXIT TO CHECK POINT           */ 01167000
         MVC   OPCMODID(2,ROPCAVT),@CC02553                        0911 01168000
*           OCWTG=MOD09;            /* THEN TO MSG MOD 09            */ 01169000
         MVC   OCWTG(2,ROPCE),@CC02555                             0912 01170000
*           CALL NONINTEX;          /* EXIT SET UP                   */ 01171000
         BAL   @14,NONINTEX                                        0913 01172000
*         END;                                                     0914 01173000
*     END;                                                         0915 01174000
*   ELSE                                                           0916 01175000
*     ;                                                            0916 01176000
@RF00903 DS    0H                                                  0917 01177000
*   RRETURN=OPCWRKSP(4);            /* RESTORE RETURN ADDR           */ 01178000
@RC00903 L     RRETURN,OPCWRKSP+12(,ROPCAVT)                       0917 01179000
*   RETURN;                                                        0918 01180000
@EL00017 DS    0H                                                  0918 01181000
@EF00017 DS    0H                                                  0918 01182000
@ER00017 BR    @14                                                 0918 01183000
*   END;                            /* END OF NORMEXIT               */ 01184000
*                                                                  0920 01185000
*   /*****************************************************************/ 01186000
*   /*                                                               */ 01187000
*   /* UPDATE STATUS IN AN ERROR SITUATION THIS ROUTINE IS CALLED BY */ 01188000
*   /* ERREXIT                                                       */ 01189000
*   /*                                                               */ 01190000
*   /*****************************************************************/ 01191000
*                                                                  0920 01192000
*ERRSTAT:                                                          0920 01193000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0920 01194000
ERRSTAT  DS    0H                                                  0921 01195000
*   OPCWRKSP(7)=RRETURN;            /* SAVE RETURN ADDR              */ 01196000
         ST    RRETURN,OPCWRKSP+24(,ROPCAVT)                       0921 01197000
*   IF OCALLFLG=ON THEN                                            0922 01198000
         TM    OCALLFLG(ROPCE),B'00000100'                         0922 01199000
         BNO   @RF00922                                            0922 01200000
*     DO;                           /* IF GRP,ALL PROCESSING         */ 01201000
*       IF OCSOME=OFF THEN                                         0924 01202000
         TM    OCSOME(ROPCE),B'00000010'                           0924 01203000
         BNZ   @RF00924                                            0924 01204000
*         DO;                       /* IF NO LINES STARTED OR STATE     01205000
*                                      INDICATOR IS UNSET, CHANGE  0925 01206000
*                                      STATE TO NO LINES STARTED     */ 01207000
*           OCNONE=ON;              /* NO LINES STARTED              */ 01208000
         OI    OCNONE(ROPCE),B'00000001'                           0926 01209000
*           OPCWRKSP(1)=MSG512;     /* SET UP MSG NUMBER             */ 01210000
         MVC   OPCWRKSP(4,ROPCAVT),@CF00837                        0927 01211000
*         END;                                                     0928 01212000
*       ELSE                                                       0929 01213000
*         DO;                                                      0929 01214000
         B     @RC00924                                            0929 01215000
@RF00924 DS    0H                                                  0930 01216000
*           OCNONE=OFF;             /* IF SOME OR ALL LINES STARTED     01217000
*                                      INDICATOR ON,CHANGE STATE TO     01218000
*                                      SOME STARTED                  */ 01219000
         NI    OCNONE(ROPCE),B'11111110'                           0930 01220000
*           OPCWRKSP(1)=MSG511;     /* SET UP MSG NUMBER             */ 01221000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02534                        0931 01222000
*         END;                                                     0932 01223000
*       CALL CHKMORE;               /* CHECK FOR MORE LINES          */ 01224000
@RC00924 BAL   @14,CHKMORE                                         0933 01225000
*     END;                                                         0934 01226000
*   ELSE                                                           0935 01227000
*     ;                                                            0935 01228000
@RF00922 DS    0H                                                  0936 01229000
*   RRETURN=OPCWRKSP(7);            /* RESTORE RETURN ADDR           */ 01230000
         L     RRETURN,OPCWRKSP+24(,ROPCAVT)                       0936 01231000
*   RETURN;                                                        0937 01232000
@EL00018 DS    0H                                                  0937 01233000
@EF00018 DS    0H                                                  0937 01234000
@ER00018 BR    @14                                                 0937 01235000
*   END;                            /* END OF ERRSTAT                */ 01236000
*                                                                  0939 01237000
*   /*****************************************************************/ 01238000
*   /*                                                               */ 01239000
*   /* UPDATE ALL STATUS IN NORMAL PROCESSING THIS ROUTINE IS CALLED */ 01240000
*   /* BY NORMEXIT                                                   */ 01241000
*   /*                                                               */ 01242000
*   /*****************************************************************/ 01243000
*                                                                  0939 01244000
*NORMSTAT:                                                         0939 01245000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0939 01246000
NORMSTAT DS    0H                                                  0940 01247000
*   OPCWRKSP(5)=RRETURN;            /* SAVE RETURN ADDR              */ 01248000
         ST    RRETURN,OPCWRKSP+16(,ROPCAVT)                       0940 01249000
*   IF OCALLFLG=ON THEN                                            0941 01250000
         TM    OCALLFLG(ROPCE),B'00000100'                         0941 01251000
         BNO   @RF00941                                            0941 01252000
*     DO;                           /* IF GRP,ALL PROCESSING         */ 01253000
*       IF(OCSOME=OFF&OCNONE=OFF)|(OCSOME=ON&OCNONE=ON) THEN       0943 01254000
         TM    OCSOME(ROPCE),B'00000011'                           0943 01255000
         BZ    @RT00943                                            0943 01256000
         TM    OCSOME(ROPCE),B'00000011'                           0943 01257000
         BNO   @RF00943                                            0943 01258000
@RT00943 DS    0H                                                  0944 01259000
*         DO;                       /* IF THIS IS 1ST SUCCESSFUL LINE   01260000
*                                      START OR ALL HAVE BEEN      0944 01261000
*                                      SUCESSFUL,THEN DO             */ 01262000
*           OCSOME=ON;              /* INDICATE ALL SUCCESSFUL       */ 01263000
*           OCNONE=ON;                                             0946 01264000
         OI    OCSOME(ROPCE),B'00000011'                           0946 01265000
*           OPCWRKSP(1)=MSG510;     /* MSG NUMBER 510                */ 01266000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02532                        0947 01267000
*         END;                                                     0948 01268000
*       ELSE                                                       0949 01269000
*         DO;                       /* IF NOT ALL HAVE BEEN SUCC     */ 01270000
         B     @RC00943                                            0949 01271000
@RF00943 DS    0H                                                  0950 01272000
*           OCSOME=ON;              /* INDICATE SOME STARTED         */ 01273000
*           OCNONE=OFF;                                            0951 01274000
         OI    OCSOME(ROPCE),B'00000010'                           0951 01275000
         NI    OCNONE(ROPCE),B'11111110'                           0951 01276000
*           OPCWRKSP(1)=MSG511;     /* SET UP MSG NUMBER             */ 01277000
         MVC   OPCWRKSP(4,ROPCAVT),@CF02534                        0952 01278000
*         END;                                                     0953 01279000
*       CALL CHKMORE;               /* MORE LINES TO PROCESS?        */ 01280000
@RC00943 BAL   @14,CHKMORE                                         0954 01281000
*     END;                                                         0955 01282000
*   ELSE                                                           0956 01283000
*     ;                                                            0956 01284000
@RF00941 DS    0H                                                  0957 01285000
*   RRETURN=OPCWRKSP(5);            /* RESTORE RETURN ADDR           */ 01286000
         L     RRETURN,OPCWRKSP+16(,ROPCAVT)                       0957 01287000
*   RETURN;                                                        0958 01288000
@EL00019 DS    0H                                                  0958 01289000
@EF00019 DS    0H                                                  0958 01290000
@ER00019 BR    @14                                                 0958 01291000
*   END;                            /* END OF NORMSTAT               */ 01292000
*                                                                  0960 01293000
*   /*****************************************************************/ 01294000
*   /*                                                               */ 01295000
*   /* INTERNAL INVOCATION PROCESSING THIS ROUTINE IS CALLED BY      */ 01296000
*   /* ERREXIT,NORMEXIT                                              */ 01297000
*   /*                                                               */ 01298000
*   /*****************************************************************/ 01299000
*                                                                  0960 01300000
*INTRINVK:                                                         0960 01301000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0960 01302000
INTRINVK DS    0H                                                  0961 01303000
*   RZERO=OPCWRKSP(1);              /* SET UP MSG NUMBER             */ 01304000
         L     RZERO,OPCWRKSP(,ROPCAVT)                            0961 01305000
*   OCPARM=RZERO;                   /* SAVE INOPCE                   */ 01306000
         STH   RZERO,OCPARM(,ROPCE)                                0962 01307000
*   OPCMODID=OCWTG;                 /* RETURN TO CALLER              */ 01308000
         MVC   OPCMODID(2,ROPCAVT),OCWTG(ROPCE)                    0963 01309000
*   OCWTG=0;                        /* NO RETURN                     */ 01310000
         SLR   @15,@15                                             0964 01311000
         STH   @15,OCWTG(,ROPCE)                                   0964 01312000
*   IF OPCMODID=MOD07 THEN                                         0965 01313000
         CLC   OPCMODID(2,ROPCAVT),@CC02557                        0965 01314000
         BNE   @RF00965                                            0965 01315000
*     DO;                           /* IF EXIT IS TO IGC0710D        */ 01316000
*       RZERO=0;                    /* CLEAR RZERO                   */ 01317000
         SLR   RZERO,RZERO                                         0967 01318000
*       OCPARM=RZERO;               /* CLEAR OCPARM                  */ 01319000
         STH   RZERO,OCPARM(,ROPCE)                                0968 01320000
*     END;                                                         0969 01321000
*   ELSE                                                           0970 01322000
*     ;                                                            0970 01323000
@RF00965 DS    0H                                                  0971 01324000
*   RETURN;                                                        0971 01325000
@EL00020 DS    0H                                                  0971 01326000
@EF00020 DS    0H                                                  0971 01327000
@ER00020 BR    @14                                                 0971 01328000
*   END;                            /* END OF INTRINVK               */ 01329000
*                                                                  0973 01330000
*   /*****************************************************************/ 01331000
*   /*                                                               */ 01332000
*   /* COMMON NON-INTERNAL EXIT PROCESSING THIS ROUTINE IS CALLED BY */ 01333000
*   /* ERREXIT,NORMEXIT                                              */ 01334000
*   /*                                                               */ 01335000
*   /*****************************************************************/ 01336000
*                                                                  0973 01337000
*NONINTEX:                                                         0973 01338000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0973 01339000
NONINTEX DS    0H                                                  0974 01340000
*   IF OCTOTE=ON THEN                                              0974 01341000
         TM    OCTOTE(ROPCE),B'01000000'                           0974 01342000
         BNO   @RF00974                                            0974 01343000
*     DO;                           /* IF TOTE INPUT                 */ 01344000
*       OCWTG=MOD07;                /* SET EXIT TO IGC0710D          */ 01345000
         MVC   OCWTG(2,ROPCE),@CC02557                             0976 01346000
*       OCPARM=RPARM;               /* SAVE RETURN CODE              */ 01347000
         STH   RPARM,OCPARM(,ROPCE)                                0977 01348000
*       RZERO=RPARM;                /* RETURN CODE                   */ 01349000
         LR    RZERO,RPARM                                         0978 01350000
*       IF OPCMODID=MOD03 THEN                                     0979 01351000
         CLC   OPCMODID(2,ROPCAVT),@CC02559                        0979 01352000
         BNE   @RF00979                                            0979 01353000
*         DO;                       /* IF EXIT IS TO ERROR MOD       */ 01354000
*           OPCMODID=MOD07;         /* GO TO MSG MODULE              */ 01355000
         MVC   OPCMODID(2,ROPCAVT),@CC02557                        0981 01356000
*           OCWTG=0;                /* NO RETURN                     */ 01357000
         SLR   @15,@15                                             0982 01358000
         STH   @15,OCWTG(,ROPCE)                                   0982 01359000
*         END;                                                     0983 01360000
*       ELSE                                                       0984 01361000
*         ;                                                        0984 01362000
@RF00979 DS    0H                                                  0985 01363000
*     END;                                                         0985 01364000
*   ELSE                                                           0986 01365000
*     ;                                                            0986 01366000
@RF00974 DS    0H                                                  0987 01367000
*   IF OPCWRKSP(1)^=MSG199 THEN     /* IS THIS MSG IED199I?  @YM09054*/ 01368000
         CLC   OPCWRKSP(4,ROPCAVT),@CF02530                        0987 01369000
         BE    @RF00987                                            0987 01370000
*     OCUNIT=BADTIC;                /* INDICATE INVALID TIC ADDR     */ 01371000
         MVC   OCUNIT(4,ROPCE),@CF02506                            0988 01372000
*   ELSE                                                           0989 01373000
*     ;                             /* IF IED199I, DO NOT RESET    0989 01374000
*                                      OCUNIT                @YM09054*/ 01375000
@RF00987 DS    0H                                                  0990 01376000
*   RETURN;                                                        0990 01377000
@EL00021 DS    0H                                                  0990 01378000
@EF00021 DS    0H                                                  0990 01379000
@ER00021 BR    @14                                                 0990 01380000
*   END;                            /* END OF NONINTEX               */ 01381000
*                                                                  0992 01382000
*   /*****************************************************************/ 01383000
*   /*                                                               */ 01384000
*   /* CHECK FOR MORE LINES THIS ROUTINE IS CALLED BY                */ 01385000
*   /* NORMSTAT,ERRSTAT                                              */ 01386000
*   /*                                                               */ 01387000
*   /*****************************************************************/ 01388000
*                                                                  0992 01389000
*CHKMORE:                                                          0992 01390000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0992 01391000
CHKMORE  DS    0H                                                  0993 01392000
*   RESPECIFY                                                      0993 01393000
*    (RWORK6) RSTD;                 /*                       @ZM46522*/ 01394000
*   OPCWRKSP(6)=RRETURN;            /* SAVE RETURN ADDR              */ 01395000
         ST    RRETURN,OPCWRKSP+20(,ROPCAVT)                       0994 01396000
*   RPARM=RTERM;                    /*                       @ZM46522*/ 01397000
         LR    RPARM,RTERM                                         0995 01398000
*   RPARM=RPARM-LENGTH(IEDNTRM);    /* BACK UP FOR NEG PREFIX      0996 01399000
*                                                            @ZM46522*/ 01400000
         SH    RPARM,@CH00036                                      0996 01401000
*   DO UNTIL((RPARM->TRMTYPE=TRMGRP)|(RPARM->TRMRSACT=OFF));/* INSURE   01402000
*                                      THAT A VALID ENTRY IS FOUND 0997 01403000
*                                                            @ZM46522*/ 01404000
@DL00997 DS    0H                                                  0998 01405000
*     RWORK6=RPARM->TRMCOHTG;       /* SAVE TTCIN FOR OPC UPDATE   0998 01406000
*                                                            @ZM46522*/ 01407000
         SLR   @15,@15                                             0998 01408000
         ICM   @15,3,TRMCOHTG(RPARM)                               0998 01409000
         LR    RWORK6,@15                                          0998 01410000
*     RPARM=RPARM->TRMCOHTG;        /* GET COHORT G PTR              */ 01411000
         LR    RPARM,@15                                           0999 01412000
*     CALL IEDQTNT;                 /* CONVERT TO TTE                */ 01413000
         L     @15,AVTRNMPT(,IEDQAPTR)                             1000 01414000
         BALR  @14,@15                                             1000 01415000
*     RPARM=RPARM-LENGTH(IEDNTRM);  /* BACK UP TO NEG PREFIX ADDR    */ 01416000
         SH    RPARM,@CH00036                                      1001 01417000
*   END;                            /*                       @ZM46522*/ 01418000
@DE00997 CLI   TRMTYPE(RPARM),X'00'                                1002 01419000
         BE    @DC00997                                            1002 01420000
         TM    TRMRSACT(RPARM),B'10000000'                         1002 01421000
         BNZ   @DL00997                                            1002 01422000
@DC00997 DS    0H                                                  1003 01423000
*   IF RPARM->TRMTYPE=TRMGRP THEN                                  1003 01424000
         CLI   TRMTYPE(RPARM),X'00'                                1003 01425000
         BNE   @RF01003                                            1003 01426000
*     MORELINE=OFF;                 /* IF TTE IS FOR GROUP THEN NO 1004 01427000
*                                      MORE LINES TOPROC             */ 01428000
         NI    MORELINE(ROPCAVT),B'10111111'                       1004 01429000
*   ELSE                                                           1005 01430000
*     DO;                           /* MORE LINES TO PROCESS         */ 01431000
         B     @RC01003                                            1005 01432000
@RF01003 DS    0H                                                  1006 01433000
*       MORELINE=ON;                /* SET INDICATOR                 */ 01434000
         OI    MORELINE(ROPCAVT),B'01000000'                       1006 01435000
*       OCTRMTBL=RWORK6;            /* SET NEXT LINE TO PROC @ZM46522*/ 01436000
         STH   RWORK6,OCTRMTBL(,ROPCE)                             1007 01437000
*     END;                                                         1008 01438000
*   RRETURN=OPCWRKSP(6);            /* RELOAD RETURN ADDR            */ 01439000
@RC01003 L     RRETURN,OPCWRKSP+20(,ROPCAVT)                       1009 01440000
*   RESPECIFY                                                      1010 01441000
*    (RWORK6) UNRSTD;               /*                       @ZM46522*/ 01442000
*   RETURN;                                                        1011 01443000
@EL00022 DS    0H                                                  1011 01444000
@EF00022 DS    0H                                                  1011 01445000
@ER00022 BR    @14                                                 1011 01446000
*   END;                            /* END OF CHKMORE                */ 01447000
*   END                             /* IGCVI10D END                  */ 01448000
*                                                                  1013 01449000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01450000
*/*%INCLUDE SYSLIB  (TAVTD   )                                       */ 01451000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 01452000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 01453000
*/*%INCLUDE SYSLIB  (TDEBD   )                                       */ 01454000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 01455000
*/*%INCLUDE SYSLIB  (TNSLD   )                                       */ 01456000
*/*%INCLUDE SYSLIB  (TOPCED  )                                       */ 01457000
*/*%INCLUDE SYSLIB  (TOPCAVTD)                                       */ 01458000
*/*%INCLUDE SYSLIB  (TOPRED  )                                       */ 01459000
*/*%INCLUDE SYSLIB  (TPRIOR  )                                       */ 01460000
*/*%INCLUDE SYSLIB  (TQCBD   )                                       */ 01461000
*/*%INCLUDE SYSLIB  (TTNTD   )                                       */ 01462000
*/*%INCLUDE SYSLIB  (TTRMD   )                                       */ 01463000
*                                                                  1013 01464000
*       ;                                                          1013 01465000
@DATA    DS    0H                                                       01466000
@CH00061 DC    H'1'                                                     01467000
@CH00132 DC    H'2'                                                     01468000
@CH00036 DC    H'18'                                                    01469000
@CH00800 DC    H'36'                                                    01470000
@CH02537 DC    H'382'                                                   01471000
@CH02541 DC    H'515'                                                   01472000
@CH02539 DC    H'530'                                                   01473000
         DS    0F                                                       01474000
         DS    0F                                                       01475000
@CF00250 DC    F'4'                                                     01476000
@CF00046 DC    F'8'                                                     01477000
@CF02524 DC    F'19'                                                    01478000
@CF00632 DC    F'20'                                                    01479000
@CF02522 DC    F'49'                                                    01480000
@CF02543 DC    F'102'                                                   01481000
@CF02530 DC    F'199'                                                   01482000
@CF02528 DC    F'210'                                                   01483000
@CF02526 DC    F'400'                                                   01484000
@CF02520 DC    F'443'                                                   01485000
@CF02532 DC    F'510'                                                   01486000
@CF02534 DC    F'511'                                                   01487000
@CH02534 EQU   @CF02534+2                                               01488000
@CF00837 DC    F'512'                                                   01489000
@CF02672 DC    F'-13'                                                   01490000
@CF02674 DC    F'-12'                                                   01491000
@CF02673 DC    F'-11'                                                   01492000
@CF02675 DC    F'-10'                                                   01493000
@CF01705 DC    F'-3'                                                    01494000
@CF02506 DC    XL4'08000002'                                            01495000
@CF02517 DC    XL4'00FFFFFF'                                            01496000
         DS    0D                                                       01497000
@CC02553 DC    C'06'                                                    01498000
@CC02555 DC    C'09'                                                    01499000
@CC02557 DC    C'07'                                                    01500000
@CC02559 DC    C'03'                                                    01501000
@CC02561 DC    C'A0'                                                    01502000
@CC02563 DC    C'VI'                                                    01503000
@CC02565 DC    C'00'                                                    01504000
@CC02567 DC    C'FA'                                                    01505000
ZAPAREA  DC    60X'00'                                                  01506000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01507000
@01      EQU   01                                                       01508000
@02      EQU   02                                                       01509000
@03      EQU   03                                                       01510000
@04      EQU   04                                                       01511000
@05      EQU   05                                                       01512000
@06      EQU   06                                                       01513000
@07      EQU   07                                                       01514000
@08      EQU   08                                                       01515000
@09      EQU   09                                                       01516000
@10      EQU   10                                                       01517000
@11      EQU   11                                                       01518000
@12      EQU   12                                                       01519000
@13      EQU   13                                                       01520000
@14      EQU   14                                                       01521000
@15      EQU   15                                                       01522000
IEDQAPTR EQU   @04                                                      01523000
IEDNSLP  EQU   @03                                                      01524000
ROPCE    EQU   @03                                                      01525000
ROPCAVT  EQU   @02                                                      01526000
IEDQTPTR EQU   @05                                                      01527000
RTERM    EQU   @05                                                      01528000
RNSL     EQU   @03                                                      01529000
RZERO    EQU   @00                                                      01530000
RPARM    EQU   @01                                                      01531000
ROPRE    EQU   @03                                                      01532000
RAVT     EQU   @04                                                      01533000
RWORK6   EQU   @06                                                      01534000
RWORK7   EQU   @07                                                      01535000
RWORK8   EQU   @08                                                      01536000
RSAVE    EQU   @13                                                      01537000
RRETURN  EQU   @14                                                      01538000
RLINK    EQU   @15                                                      01539000
RWORK10  EQU   @10                                                      01540000
RWORK11  EQU   @11                                                      01541000
RWORK9   EQU   @09                                                      01542000
IEDQAVTD EQU   0                                                        01543000
AVTSAVEX EQU   IEDQAVTD+288                                             01544000
@NM00003 EQU   IEDQAVTD+388                                             01545000
AVTCKFLG EQU   @NM00003                                                 01546000
AVTBASE  EQU   IEDQAVTD+412                                             01547000
AVTPKF   EQU   AVTBASE                                                  01548000
AVTRNMPT EQU   IEDQAVTD+424                                             01549000
AVTOSECB EQU   IEDQAVTD+492                                             01550000
AVTECB1  EQU   AVTOSECB                                                 01551000
AVTHG02  EQU   IEDQAVTD+528                                             01552000
AVTDISP  EQU   IEDQAVTD+552                                             01553000
AVTHD    EQU   IEDQAVTD+556                                             01554000
AVTSCOPT EQU   AVTHD                                                    01555000
AVTSAVTP EQU   IEDQAVTD+612                                             01556000
AVTSAVTF EQU   AVTSAVTP                                                 01557000
AVTCKPEL EQU   IEDQAVTD+652                                             01558000
AVTCKRMV EQU   AVTCKPEL                                                 01559000
AVTCKELF EQU   IEDQAVTD+680                                             01560000
AVTCKBYT EQU   IEDQAVTD+691                                             01561000
AVTHG01  EQU   IEDQAVTD+692                                             01562000
AVTCKLNK EQU   IEDQAVTD+696                                             01563000
AVTCRELE EQU   IEDQAVTD+708                                             01564000
AVTCCELE EQU   AVTCRELE                                                 01565000
AVTCLRHI EQU   IEDQAVTD+716                                             01566000
AVTADBUF EQU   IEDQAVTD+720                                             01567000
AVTSYSER EQU   IEDQAVTD+728                                             01568000
AVTBFRFG EQU   IEDQAVTD+784                                             01569000
AVTCKPQB EQU   IEDQAVTD+804                                             01570000
AVTCKPTB EQU   AVTCKPQB                                                 01571000
AVTCKPEC EQU   AVTCKPQB+4                                               01572000
AVTCKPCC EQU   AVTCKPEC                                                 01573000
AVTOPCQB EQU   IEDQAVTD+816                                             01574000
AVTOPCOB EQU   AVTOPCQB                                                 01575000
AVTOPCEC EQU   AVTOPCQB+4                                               01576000
AVTOPCCC EQU   AVTOPCEC                                                 01577000
AVTOLTQB EQU   IEDQAVTD+828                                             01578000
AVTCWFL1 EQU   IEDQAVTD+924                                             01579000
AVTCWFL2 EQU   IEDQAVTD+925                                             01580000
AVTSUBT  EQU   IEDQAVTD+948                                             01581000
AVTIOTR  EQU   IEDQAVTD+949                                             01582000
AVTBIT1  EQU   IEDQAVTD+1050                                            01583000
AVTBIT2  EQU   IEDQAVTD+1051                                            01584000
AVTBIT3  EQU   IEDQAVTD+1052                                            01585000
AVTBIT4  EQU   IEDQAVTD+1136                                            01586000
@NM00085 EQU   IEDQAVTD+1232                                            01587000
IEDNSVTD EQU   0                                                        01588000
SAVTDIAG EQU   IEDNSVTD                                                 01589000
SAVTDIAF EQU   SAVTDIAG                                                 01590000
SAVTLUSQ EQU   IEDNSVTD+88                                              01591000
SAVTSPLN EQU   IEDNSVTD+224                                             01592000
SAVTTCPU EQU   IEDNSVTD+238                                             01593000
SAVTZELM EQU   IEDNSVTD+270                                             01594000
SAVTRDRV EQU   IEDNSVTD+284                                             01595000
SAVTCKQB EQU   IEDNSVTD+300                                             01596000
SAVTCKTB EQU   SAVTCKQB                                                 01597000
SAVTCKEC EQU   SAVTCKQB+4                                               01598000
SAVTCKCC EQU   SAVTCKEC                                                 01599000
SAVTNETF EQU   IEDNSVTD+324                                             01600000
SAVTCDRV EQU   IEDNSVTD+332                                             01601000
IHADCB   EQU   0                                                        01602000
IHADCS1A EQU   0                                                        01603000
DCBBCKUP EQU   IHADCS1A+8                                               01604000
IHADCS2K EQU   0                                                        01605000
DCBDUMPD EQU   IHADCS2K                                                 01606000
DCBTRSTA EQU   IHADCS2K+5                                               01607000
DCBDSORG EQU   IHADCS2K+6                                               01608000
DCBDSRG2 EQU   DCBDSORG+1                                               01609000
DCBRNCKD EQU   IHADCS2K+12                                              01610000
DCBEXLST EQU   IHADCS2K+16                                              01611000
IHADCS24 EQU   0                                                        01612000
DCBOFLGS EQU   IHADCS24+8                                               01613000
DCBOFLWR EQU   DCBOFLGS                                                 01614000
DCBIFLG  EQU   IHADCS24+9                                               01615000
DCBIBPCT EQU   DCBIFLG                                                  01616000
DCBMACR  EQU   IHADCS24+10                                              01617000
DCBMACR1 EQU   DCBMACR                                                  01618000
DCBMRFE  EQU   DCBMACR1                                                 01619000
DCBMRGET EQU   DCBMRFE                                                  01620000
DCBMRAPG EQU   DCBMACR1                                                 01621000
DCBMRRD  EQU   DCBMRAPG                                                 01622000
DCBMRCI  EQU   DCBMACR1                                                 01623000
DCBMRMVG EQU   DCBMRCI                                                  01624000
DCBMRLCG EQU   DCBMACR1                                                 01625000
DCBMRABC EQU   DCBMACR1                                                 01626000
DCBMRPT1 EQU   DCBMRABC                                                 01627000
DCBMRSBG EQU   DCBMRPT1                                                 01628000
DCBMRCRL EQU   DCBMACR1                                                 01629000
DCBMRCHK EQU   DCBMRCRL                                                 01630000
DCBMRRDX EQU   DCBMRCHK                                                 01631000
DCBMRDMG EQU   DCBMACR1                                                 01632000
DCBMACR2 EQU   DCBMACR+1                                                01633000
DCBMRPUT EQU   DCBMACR2                                                 01634000
DCBMRWRT EQU   DCBMACR2                                                 01635000
DCBMRMVP EQU   DCBMACR2                                                 01636000
DCBMR5WD EQU   DCBMACR2                                                 01637000
DCBMRLDM EQU   DCBMR5WD                                                 01638000
DCBMRLCP EQU   DCBMRLDM                                                 01639000
DCBMR4WD EQU   DCBMACR2                                                 01640000
DCBMRPT2 EQU   DCBMR4WD                                                 01641000
DCBMRTMD EQU   DCBMRPT2                                                 01642000
DCBMR3WD EQU   DCBMACR2                                                 01643000
DCBMRCTL EQU   DCBMR3WD                                                 01644000
DCBMRSTK EQU   DCBMRCTL                                                 01645000
DCBMR1WD EQU   DCBMACR2                                                 01646000
DCBMRSWA EQU   DCBMR1WD                                                 01647000
DCBMRDMD EQU   DCBMRSWA                                                 01648000
IHADCS25 EQU   0                                                        01649000
DCBMACRF EQU   IHADCS25+2                                               01650000
DCBMACF1 EQU   DCBMACRF                                                 01651000
DCBMFFE  EQU   DCBMACF1                                                 01652000
DCBMFGET EQU   DCBMFFE                                                  01653000
DCBMFAPG EQU   DCBMACF1                                                 01654000
DCBMFRD  EQU   DCBMFAPG                                                 01655000
DCBMFCI  EQU   DCBMACF1                                                 01656000
DCBMFMVG EQU   DCBMFCI                                                  01657000
DCBMFLCG EQU   DCBMACF1                                                 01658000
DCBMFABC EQU   DCBMACF1                                                 01659000
DCBMFPT1 EQU   DCBMFABC                                                 01660000
DCBMFSBG EQU   DCBMFPT1                                                 01661000
DCBMFCRL EQU   DCBMACF1                                                 01662000
DCBMFCHK EQU   DCBMFCRL                                                 01663000
DCBMFDMG EQU   DCBMACF1                                                 01664000
DCBMACF2 EQU   DCBMACRF+1                                               01665000
DCBMFPUT EQU   DCBMACF2                                                 01666000
DCBMFWRT EQU   DCBMACF2                                                 01667000
DCBMFMVP EQU   DCBMACF2                                                 01668000
DCBMF5WD EQU   DCBMACF2                                                 01669000
DCBMFLDM EQU   DCBMF5WD                                                 01670000
DCBMFLCP EQU   DCBMFLDM                                                 01671000
DCBMF4WD EQU   DCBMACF2                                                 01672000
DCBMFPT2 EQU   DCBMF4WD                                                 01673000
DCBMFTMD EQU   DCBMFPT2                                                 01674000
DCBMF3WD EQU   DCBMACF2                                                 01675000
DCBMFCTL EQU   DCBMF3WD                                                 01676000
DCBMFSTK EQU   DCBMFCTL                                                 01677000
DCBMF1WD EQU   DCBMACF2                                                 01678000
DCBMFSWA EQU   DCBMF1WD                                                 01679000
DCBMFDMD EQU   DCBMFSWA                                                 01680000
DCBDEBAD EQU   IHADCS25+4                                               01681000
DCBIFLGS EQU   DCBDEBAD                                                 01682000
DCBIFPCT EQU   DCBIFLGS                                                 01683000
IHADCS27 EQU   0                                                        01684000
DCBGET   EQU   IHADCS27                                                 01685000
DCBPUT   EQU   DCBGET                                                   01686000
DCBGETA  EQU   DCBPUT+1                                                 01687000
IHADCS43 EQU   0                                                        01688000
DCBSCTAB EQU   IHADCS43                                                 01689000
IEDQDEB  EQU   0                                                        01690000
DEBPRF   EQU   IEDQDEB                                                  01691000
DEBAPVT  EQU   DEBPRF                                                   01692000
DEBNMSUB EQU   IEDQDEB+36                                               01693000
DEBNMEXT EQU   IEDQDEB+52                                               01694000
DEBUCBS  EQU   IEDQDEB+68                                               01695000
IEDQDPTR EQU   0                                                        01696000
UCB      EQU   0                                                        01697000
UCBOB    EQU   0                                                        01698000
UCBJBNR  EQU   UCBOB                                                    01699000
UCBFL5   EQU   UCBOB+1                                                  01700000
UCBAF    EQU   UCBFL5                                                   01701000
UCBSTAT  EQU   UCBOB+3                                                  01702000
UCBCHAN  EQU   UCBOB+4                                                  01703000
UCBSFLS  EQU   UCBOB+6                                                  01704000
UCBFLA   EQU   UCBSFLS                                                  01705000
UCBFL1   EQU   UCBFLA                                                   01706000
UCBBSY   EQU   UCBFL1                                                   01707000
UCBNRY   EQU   UCBFL1                                                   01708000
UCBPST   EQU   UCBFL1                                                   01709000
UCBCUB   EQU   UCBFL1                                                   01710000
UCBFLB   EQU   UCBSFLS+1                                                01711000
UCBCHM   EQU   UCBOB+8                                                  01712000
UCBCHM1  EQU   UCBCHM                                                   01713000
UCBPTH0  EQU   UCBCHM1                                                  01714000
UCBPTH1  EQU   UCBCHM1                                                  01715000
UCBWGT   EQU   UCBOB+12                                                 01716000
UCBNAME  EQU   UCBOB+13                                                 01717000
UCBTYP   EQU   UCBOB+16                                                 01718000
UCBTBYT1 EQU   UCBTYP                                                   01719000
UCB1FEA5 EQU   UCBTBYT1                                                 01720000
UCB1FEA6 EQU   UCBTBYT1                                                 01721000
UCBTBYT2 EQU   UCBTYP+1                                                 01722000
UCB2OPT2 EQU   UCBTBYT2                                                 01723000
UCBDUDN1 EQU   UCB2OPT2                                                 01724000
UCB2OPT3 EQU   UCBTBYT2                                                 01725000
UCBDUDN2 EQU   UCB2OPT3                                                 01726000
UCB2OPT4 EQU   UCBTBYT2                                                 01727000
UCBRWTAU EQU   UCB2OPT4                                                 01728000
UCB2OPT6 EQU   UCBTBYT2                                                 01729000
UCB2OPT7 EQU   UCBTBYT2                                                 01730000
UCBTBYT3 EQU   UCBTYP+2                                                 01731000
UCBDVCLS EQU   UCBTBYT3                                                 01732000
UCBTBYT4 EQU   UCBTYP+3                                                 01733000
UCBEXTPT EQU   UCBOB+20                                                 01734000
UCBFLC   EQU   UCBEXTPT                                                 01735000
UCBDEV   EQU   UCBOB+24                                                 01736000
UCBCMEXT EQU   0                                                        01737000
UCBATI   EQU   UCBCMEXT+3                                               01738000
@NM00121 EQU   UCBATI                                                   01739000
UCBFLP1  EQU   UCBCMEXT+5                                               01740000
UCBMT    EQU   0                                                        01741000
UCBOCR   EQU   0                                                        01742000
UCB3540X EQU   0                                                        01743000
UCBDKBYT EQU   UCB3540X+6                                               01744000
UCB3800X EQU   0                                                        01745000
UCBOPTNS EQU   UCB3800X                                                 01746000
UCBACTIV EQU   UCB3800X+3                                               01747000
UCBMDRBF EQU   UCB3800X+36                                              01748000
UCBUCS   EQU   0                                                        01749000
UCBUCSOP EQU   UCBUCS+4                                                 01750000
UCBFCBOP EQU   UCBUCS+5                                                 01751000
IEDNNSLD EQU   0                                                        01752000
IEDNSLD  EQU   0                                                        01753000
NSLPLCB  EQU   IEDNSLD+8                                                01754000
NSLSAVE  EQU   IEDNSLD+9                                                01755000
NSLGPCUS EQU   IEDNSLD+12                                               01756000
NSLPRIBK EQU   IEDNSLD+18                                               01757000
NSLFLGBK EQU   IEDNSLD+19                                               01758000
NSLERB   EQU   IEDNSLD+20                                               01759000
NSLESTAT EQU   NSLERB+8                                                 01760000
NSLUNCNT EQU   NSLERB+12                                                01761000
NSLREQTY EQU   IEDNSLD+35                                               01762000
NSLGRPNM EQU   IEDNSLD+36                                               01763000
NSLTTEBG EQU   NSLGRPNM                                                 01764000
NSLTTEPT EQU   IEDNSLD+44                                               01765000
IEDQOPCE EQU   0                                                        01766000
OCLINK   EQU   IEDQOPCE                                                 01767000
OCELEM   EQU   IEDQOPCE+4                                               01768000
OCELMPTR EQU   OCELEM+1                                                 01769000
OCUNIT   EQU   IEDQOPCE+8                                               01770000
OCRUDEST EQU   OCUNIT                                                   01771000
OCCKPKEY EQU   OCRUDEST                                                 01772000
OCSCAN   EQU   OCCKPKEY                                                 01773000
@NM00128 EQU   OCRUDEST+1                                               01774000
OCUNITBF EQU   @NM00128+2                                               01775000
OCOPTCDE EQU   IEDQOPCE+12                                              01776000
OCSWITCH EQU   IEDQOPCE+13                                              01777000
OCFLAG   EQU   IEDQOPCE+14                                              01778000
OCTOTE   EQU   OCFLAG                                                   01779000
OCATTACH EQU   OCFLAG                                                   01780000
OCRESP   EQU   OCFLAG                                                   01781000
OCCIB    EQU   IEDQOPCE+16                                              01782000
OCMSTSAV EQU   OCCIB                                                    01783000
OCDEST   EQU   OCMSTSAV                                                 01784000
OCTRMTBL EQU   IEDQOPCE+20                                              01785000
OCLINENO EQU   IEDQOPCE+22                                              01786000
OCTIOT   EQU   OCLINENO                                                 01787000
OCWTGB   EQU   OCTIOT                                                   01788000
OCTRUNIT EQU   IEDQOPCE+24                                              01789000
OCRSID   EQU   OCTRUNIT                                                 01790000
OCALSTAT EQU   OCRSID                                                   01791000
OCRENTRD EQU   OCALSTAT                                                 01792000
OCACTREQ EQU   OCALSTAT                                                 01793000
OCALLFLG EQU   OCALSTAT                                                 01794000
OCSOME   EQU   OCALSTAT                                                 01795000
OCNONE   EQU   OCALSTAT                                                 01796000
OCPARM   EQU   IEDQOPCE+28                                              01797000
OCWTG    EQU   IEDQOPCE+30                                              01798000
OCBACKUP EQU   IEDQOPCE+32                                              01799000
OCBUFNED EQU   OCBACKUP                                                 01800000
OCBUFGOT EQU   OCBACKUP+2                                               01801000
OCMODNME EQU   IEDQOPCE+40                                              01802000
OCIPLWA  EQU   OCMODNME                                                 01803000
OCPTRSAV EQU   OCMODNME+4                                               01804000
OCCKDATA EQU   IEDQOPCE+48                                              01805000
OCRSTGTM EQU   OCCKDATA                                                 01806000
OC379RRT EQU   OCRSTGTM                                                 01807000
IEDQOPCN EQU   0                                                        01808000
OCLDNME  EQU   IEDQOPCN                                                 01809000
OCLINTTE EQU   OCLDNME                                                  01810000
OCREQFLG EQU   OCLINTTE+2                                               01811000
OCPREFLG EQU   OCLINTTE+3                                               01812000
IEDQOPCD EQU   0                                                        01813000
OPCAVTPT EQU   IEDQOPCD+8                                               01814000
OPCCOPCE EQU   IEDQOPCD+12                                              01815000
OPCSAVE  EQU   IEDQOPCD+56                                              01816000
OPCFLAG1 EQU   IEDQOPCD+146                                             01817000
OPCAQCTL EQU   IEDQOPCD+180                                             01818000
OPCXCTL  EQU   IEDQOPCD+204                                             01819000
OPCLDNME EQU   IEDQOPCD+212                                             01820000
OPCMODID EQU   OPCLDNME+3                                               01821000
OPCHORT  EQU   IEDQOPCD+256                                             01822000
OPCGETBF EQU   IEDQOPCD+276                                             01823000
OPCFREBF EQU   IEDQOPCD+280                                             01824000
OPCSPEC  EQU   IEDQOPCD+300                                             01825000
OPCWRKSP EQU   IEDQOPCD+320                                             01826000
OPCWAITV EQU   IEDQOPCD+364                                             01827000
OPCPWCOB EQU   IEDQOPCD+368                                             01828000
OPCPWQCB EQU   OPCPWCOB                                                 01829000
OPCPWECB EQU   OPCPWCOB+4                                               01830000
OPCSESS  EQU   IEDQOPCD+384                                             01831000
OPCPCID  EQU   IEDQOPCD+456                                             01832000
OPCUNIQP EQU   OPCPCID+2                                                01833000
OPCSESSF EQU   IEDQOPCD+464                                             01834000
OPCBLIN  EQU   OPCSESSF                                                 01835000
IEDOPRED EQU   0                                                        01836000
OPREQCB  EQU   IEDOPRED+1                                               01837000
OPREPRI  EQU   IEDOPRED+4                                               01838000
OPRESAVE EQU   IEDOPRED+8                                               01839000
OPRETIC  EQU   OPRESAVE                                                 01840000
OPRVTCHK EQU   OPRETIC+3                                                01841000
OPREFLG1 EQU   IEDOPRED+12                                              01842000
OPREFLG3 EQU   IEDOPRED+14                                              01843000
IEDQQCB  EQU   0                                                        01844000
QCBDSFLG EQU   IEDQQCB                                                  01845000
QCBDISK  EQU   QCBDSFLG                                                 01846000
QCBELCHN EQU   IEDQQCB+1                                                01847000
QCBEOLDT EQU   IEDQQCB+16                                               01848000
QCBBYTE1 EQU   QCBEOLDT+1                                               01849000
QCBLKRLN EQU   IEDQQCB+18                                               01850000
QCBRETCT EQU   QCBLKRLN                                                 01851000
QCBSTAT  EQU   IEDQQCB+19                                               01852000
QCBINSRC EQU   IEDQQCB+21                                               01853000
QCBTSOF2 EQU   QCBINSRC+1                                               01854000
QCBTSOF1 EQU   QCBINSRC+2                                               01855000
QCBINTVL EQU   IEDQQCB+24                                               01856000
QCBPREN  EQU   IEDQQCB+28                                               01857000
QCBLKRRN EQU   QCBPREN+1                                                01858000
QCBDCBAD EQU   IEDQQCB+33                                               01859000
QCBFLAG  EQU   IEDQQCB+36                                               01860000
IEDQQPTR EQU   0                                                        01861000
IEDQPQCB EQU   0                                                        01862000
QCBFHDLZ EQU   IEDQPQCB+3                                               01863000
QCBFHDTZ EQU   IEDQPQCB+6                                               01864000
QCBINTLF EQU   IEDQPQCB+12                                              01865000
IEDNQCB  EQU   0                                                        01866000
QCBSTAT1 EQU   IEDNQCB+4                                                01867000
QCBPLCBA EQU   IEDNQCB+5                                                01868000
IEDQTNTD EQU   0                                                        01869000
TNTSTART EQU   IEDQTNTD+82                                              01870000
IEDQNPTR EQU   0                                                        01871000
IEDTNTA  EQU   0                                                        01872000
IEDQTRM  EQU   0                                                        01873000
TRMSTATE EQU   IEDQTRM                                                  01874000
TRMLOG   EQU   TRMSTATE                                                 01875000
TRMDESTQ EQU   IEDQTRM+1                                                01876000
TRMRSTRT EQU   TRMDESTQ+2                                               01877000
TRMINSEQ EQU   IEDQTRM+4                                                01878000
TLISTCNT EQU   TRMINSEQ                                                 01879000
TRMSESCT EQU   TLISTCNT                                                 01880000
TRMOUTSQ EQU   IEDQTRM+6                                                01881000
TLISTEN  EQU   TRMOUTSQ                                                 01882000
TRMDSORG EQU   TLISTEN                                                  01883000
TRMPLIM  EQU   TLISTEN+1                                                01884000
TRMALTD  EQU   IEDQTRM+8                                                01885000
TRMPRILK EQU   TRMALTD                                                  01886000
TRMDEVFL EQU   IEDQTRM+10                                               01887000
TRMADDC  EQU   TRMDEVFL                                                 01888000
TRMNCPI  EQU   TRMDEVFL+1                                               01889000
TRMSTAT  EQU   IEDQTRM+12                                               01890000
TRMSIO   EQU   TRMSTAT                                                  01891000
TRMOWNER EQU   TRMSIO                                                   01892000
IEDNTRM  EQU   0                                                        01893000
TRMINDEX EQU   IEDNTRM                                                  01894000
TRMCOHTG EQU   IEDNTRM+2                                                01895000
TRMBYTE6 EQU   TRMCOHTG                                                 01896000
TRMCDF0  EQU   TRMBYTE6                                                 01897000
TRMBYTE5 EQU   TRMCOHTG+1                                               01898000
TRMBYTE4 EQU   IEDNTRM+4                                                01899000
TRMBYTE3 EQU   IEDNTRM+5                                                01900000
TRMBYTE2 EQU   IEDNTRM+6                                                01901000
TRMRSACT EQU   TRMBYTE2                                                 01902000
TRMINPG  EQU   TRMBYTE2                                                 01903000
TRMBYTE1 EQU   IEDNTRM+7                                                01904000
TRMSCPRQ EQU   TRMBYTE1                                                 01905000
TRMSTOTE EQU   TRMBYTE1                                                 01906000
TRMCOHRT EQU   IEDNTRM+8                                                01907000
TRMBYTE0 EQU   IEDNTRM+10                                               01908000
TRMNOWCD EQU   TRMBYTE0                                                 01909000
TRMSIBPT EQU   IEDNTRM+11                                               01910000
TRMLTRAC EQU   TRMSIBPT                                                 01911000
TRMRLMCT EQU   IEDNTRM+14                                               01912000
TRMLGBST EQU   TRMRLMCT                                                 01913000
TRMTYPE  EQU   IEDNTRM+15                                               01914000
TRMSUBST EQU   IEDNTRM+16                                               01915000
GRPNAME  EQU   0                                                        01916000
QCTLPARM EQU   0                                                        01917000
QCTLWRD1 EQU   QCTLPARM                                                 01918000
QCTLREQ  EQU   QCTLWRD1                                                 01919000
QCTLWRD2 EQU   QCTLPARM+4                                               01920000
QCTLEND  EQU   QCTLWRD2                                                 01921000
FREEBUF  EQU   0                                                        01922000
ALLOCBUF EQU   0                                                        01923000
IEDQTNT  EQU   0                                                        01924000
COHORTLK EQU   0                                                        01925000
DEBSUBR  EQU   0                                                        01926000
QCBLDCB  EQU   0                                                        01927000
TNTCODE  EQU   0                                                        01928000
TNTDCODE EQU   46                                                       01929000
TNTNAME  EQU   0                                                        01930000
UCBBGN   EQU   0                                                        01931000
UCBDCPTR EQU   0                                                        01932000
DCBPTR   EQU   QCBDCBAD                                                 01933000
DEBUCB   EQU   DEBUCBS                                                  01934000
DEBDVMOD EQU   DEBUCB                                                   01935000
DEBUCBAD EQU   DEBUCB+1                                                 01936000
UCBPTR   EQU   DEBUCBAD                                                 01937000
UCBOBS01 EQU   UCBDEV                                                   01938000
UCBSTAB  EQU   UCBOBS01+10                                              01939000
UCBBSVL  EQU   UCBSTAB                                                  01940000
UCBPRSRS EQU   UCBSTAB                                                  01941000
UCBDMCT  EQU   UCBOBS01+11                                              01942000
UCBFL4   EQU   UCBOBS01+13                                              01943000
UCBOBS02 EQU   UCBDEV                                                   01944000
UCBTFL1  EQU   UCBOBS02+19                                              01945000
UCBXTN   EQU   UCBOBS02+20                                              01946000
UCBVOPT  EQU   UCBXTN                                                   01947000
UCBOBS03 EQU   UCBDEV                                                   01948000
UCBXTADR EQU   UCBOBS03                                                 01949000
UCBOBS04 EQU   UCBDEV                                                   01950000
UCBBTA   EQU   UCBOBS04+12                                              01951000
UCBOBS06 EQU   UCBDEV                                                   01952000
UCBAOF   EQU   UCBOBS06                                                 01953000
UCBAOF1  EQU   UCBAOF                                                   01954000
UCBAOF2  EQU   UCBAOF+1                                                 01955000
@NM00120 EQU   UCBOBS06+3                                               01956000
UCBIRB   EQU   UCBOBS06+4                                               01957000
UCBGRAF  EQU   UCBIRB                                                   01958000
UCBLDNCA EQU   UCBOBS06+8                                               01959000
UCBRDYQ  EQU   UCBLDNCA                                                 01960000
UCBIRLN  EQU   UCBRDYQ                                                  01961000
UCBLDNCB EQU   UCBRDYQ+1                                                01962000
UCBCTLNK EQU   UCBOBS06+12                                              01963000
UCBOBS07 EQU   UCBDEV                                                   01964000
UCBOBS08 EQU   UCBDEV                                                   01965000
UCBCTCAD EQU   UCBOBS08                                                 01966000
UCBCTCF1 EQU   UCBOBS08+4                                               01967000
UCBOBS09 EQU   UCBDEV                                                   01968000
@NM00137 EQU   OCCIB                                                    01969000
@NM00138 EQU   @NM00137+1                                               01970000
OCCKPKY1 EQU   OCCKPKEY                                                 01971000
OCCKPTYP EQU   OCCKPKY1                                                 01972000
OCICACTN EQU   OCMODNME                                                 01973000
OCICDADR EQU   OCICACTN                                                 01974000
OCICSW   EQU   OCICDADR+3                                               01975000
OCFID0   EQU   OCMODNME                                                 01976000
OCFID01  EQU   OCBACKUP                                                 01977000
@NM00143 EQU   OCCKDATA                                                 01978000
OCMSGFLG EQU   OCPREFLG                                                 01979000
OCBKUP1  EQU   OCMODNME                                                 01980000
@NM00148 EQU   OCMODNME                                                 01981000
OCBKUP2  EQU   OCCKDATA                                                 01982000
OCBKUP3  EQU   OCLDNME                                                  01983000
OCRESPTR EQU   OCBKUP3+4                                                01984000
OCDIALLN EQU   OCRESPTR                                                 01985000
OCIPLDMP EQU   OCLDNME+4                                                01986000
OPCAQWD  EQU   OPCAQCTL                                                 01987000
OPCAQWD1 EQU   OPCAQWD                                                  01988000
OPCAQWD2 EQU   OPCAQWD+4                                                01989000
OPCAQWD3 EQU   OPCAQWD+8                                                01990000
@NM00178 EQU   QCBFHDLZ                                                 01991000
TRMDIALQ EQU   TRMPLIM                                                  01992000
@NM00191 EQU   TRMSTATE                                                 01993000
TRMCDFD0 EQU   TRMBYTE5                                                 01994000
TRMPRE1  EQU   TRMBYTE4                                                 01995000
TRMNCP1  EQU   TRMBYTE4                                                 01996000
TRMLU1   EQU   TRMBYTE4                                                 01997000
TRMLINK1 EQU   TRMBYTE4                                                 01998000
TRMDCONS EQU   TRMLINK1                                                 01999000
TRMPRE   EQU   TRMBYTE3                                                 02000000
TRMNCP   EQU   TRMBYTE3                                                 02001000
TRMPU    EQU   TRMBYTE3                                                 02002000
TRMLU    EQU   TRMBYTE3                                                 02003000
TRMCDMGR EQU   TRMBYTE3                                                 02004000
TRMLINK  EQU   TRMBYTE3                                                 02005000
TRMEPMOD EQU   TRMLINK                                                  02006000
FLAGS    EQU   OPCFLAG1                                                 02007000
FIRSTREQ EQU   FLAGS                                                    02008000
MORELINE EQU   FLAGS                                                    02009000
EXITFLAG EQU   FLAGS                                                    02010000
OCLINRRT EQU   OCTRUNIT                                                 02011000
OCPCID   EQU   OCBACKUP                                                 02012000
OCRSNCDE EQU   OCALSTAT                                                 02013000
TNTFIRST EQU   TNTSTART                                                 02014000
TRMOPT   EQU   IEDQTRM+20                                               02015000
TRMPOOLP EQU   TRMINSEQ                                                 02016000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02017000
@NM00209 EQU   FLAGS                                                    02018000
TRMLDISC EQU   TRMLINK                                                  02019000
@NM00208 EQU   TRMLINK                                                  02020000
TRMLALOC EQU   TRMLINK                                                  02021000
TRMLSTAT EQU   TRMLINK                                                  02022000
TRMLINT  EQU   TRMLINK                                                  02023000
TRMCDLOG EQU   TRMCDMGR                                                 02024000
@NM00207 EQU   TRMCDMGR                                                 02025000
@NM00206 EQU   TRMCDMGR                                                 02026000
@NM00205 EQU   TRMCDMGR                                                 02027000
@NM00204 EQU   TRMCDMGR                                                 02028000
@NM00203 EQU   TRMCDMGR                                                 02029000
TRMBKDUP EQU   TRMCDMGR                                                 02030000
TRMLULOG EQU   TRMLU                                                    02031000
@NM00202 EQU   TRMLU                                                    02032000
@NM00201 EQU   TRMLU                                                    02033000
@NM00200 EQU   TRMLU                                                    02034000
TRMTDIFF EQU   TRMLU                                                    02035000
@NM00199 EQU   TRMLU                                                    02036000
@NM00198 EQU   TRMLU                                                    02037000
TRMAUTO  EQU   TRMLU                                                    02038000
TRMPCONT EQU   TRMPU                                                    02039000
TRMPDOCQ EQU   TRMPU                                                    02040000
TRMPULOC EQU   TRMPU                                                    02041000
TRMPDNAS EQU   TRMPU                                                    02042000
TRMPALOC EQU   TRMPU                                                    02043000
TRMNCONT EQU   TRMNCP                                                   02044000
TRMQUCKN EQU   TRMNCP                                                   02045000
TRMSLOWN EQU   TRMNCP                                                   02046000
TRMSYGEN EQU   TRMNCP                                                   02047000
TRMNCPCL EQU   TRMNCP                                                   02048000
TRMIPLDM EQU   TRMNCP                                                   02049000
TRMINOUT EQU   TRMPRE                                                   02050000
TRMRDOUT EQU   TRMPRE                                                   02051000
TRMNLOUT EQU   TRMPRE                                                   02052000
TRMWROUT EQU   TRMPRE                                                   02053000
TRMASNXI EQU   TRMPRE                                                   02054000
TRMSTMM  EQU   TRMPRE                                                   02055000
TRMCMODE EQU   TRMPRE                                                   02056000
TRMSTPND EQU   TRMPRE                                                   02057000
TRMNCPLK EQU   TRMLINK1                                                 02058000
@NM00197 EQU   TRMLINK1                                                 02059000
TRMDCONN EQU   TRMDCONS                                                 02060000
TRMDCOP  EQU   TRMDCONS                                                 02061000
TRMPMARY EQU   TRMLU1                                                   02062000
@NM00196 EQU   TRMLU1                                                   02063000
@NM00195 EQU   TRMLU1                                                   02064000
TRMCDSRQ EQU   TRMLU1                                                   02065000
TRMLSCVP EQU   TRMLU1                                                   02066000
@NM00194 EQU   TRMLU1                                                   02067000
@NM00193 EQU   TRMNCP1                                                  02068000
TRMANS   EQU   TRMNCP1                                                  02069000
TRMLINOP EQU   TRMNCP1                                                  02070000
TRMINOP  EQU   TRMNCP1                                                  02071000
TRMLYNCH EQU   TRMPRE1                                                  02072000
TRMSPOUT EQU   TRMPRE1                                                  02073000
TRMERLCK EQU   TRMPRE1                                                  02074000
TRMQNPL  EQU   TRMPRE1                                                  02075000
TRMSPACT EQU   TRMPRE1                                                  02076000
TRMOCNI  EQU   TRMPRE1                                                  02077000
TRMSESSN EQU   TRMPRE1                                                  02078000
TRMCONT  EQU   TRMPRE1                                                  02079000
TRMINERR EQU   TRMCDFD0                                                 02080000
TRMLUTM  EQU   TRMCDFD0                                                 02081000
TRMLUIT  EQU   TRMCDFD0                                                 02082000
TRMLUREQ EQU   TRMCDFD0                                                 02083000
TRMCDPRE EQU   TRMCDFD0                                                 02084000
TRMWASCD EQU   TRMCDFD0                                                 02085000
TRMSRPFG EQU   TRMCDFD0                                                 02086000
TRMSESRQ EQU   TRMCDFD0                                                 02087000
@NM00192 EQU   @NM00191                                                 02088000
TRMENTRY EQU   @NM00191                                                 02089000
TRMSRPTR EQU   TRMDIALQ                                                 02090000
QCBPFEFO EQU   @NM00178+1                                               02091000
QCBDATFL EQU   @NM00178                                                 02092000
OPCAQLST EQU   OPCAQWD3+1                                               02093000
OPCAQRQ3 EQU   OPCAQWD3                                                 02094000
OPCAQSEC EQU   OPCAQWD2+1                                               02095000
OPCAQRQ2 EQU   OPCAQWD2                                                 02096000
OPCAQFST EQU   OPCAQWD1+1                                               02097000
OPCAQREQ EQU   OPCAQWD1                                                 02098000
@NM00151 EQU   OCIPLDMP                                                 02099000
OCACTRQ  EQU   OCIPLDMP                                                 02100000
OCDACRQ  EQU   OCIPLDMP                                                 02101000
OCIPLRQ  EQU   OCIPLDMP                                                 02102000
OCDMPRQ  EQU   OCIPLDMP                                                 02103000
@NM00150 EQU   OCRESPTR+2                                               02104000
OCOHNATA EQU   OCDIALLN                                                 02105000
OCRRTPTR EQU   OCBKUP3                                                  02106000
@NM00149 EQU   OCBKUP2+4                                                02107000
OCNHITTC EQU   OCBKUP2+2                                                02108000
OCLINTTC EQU   OCBKUP2                                                  02109000
OCCSIB   EQU   @NM00148                                                 02110000
@NM00147 EQU   OCBKUP1+6                                                02111000
OCTARTTC EQU   OCBKUP1+4                                                02112000
OCSRTTC  EQU   OCBKUP1+2                                                02113000
OCRSTTC  EQU   OCBKUP1                                                  02114000
@NM00146 EQU   OCMSGFLG                                                 02115000
OCRRT    EQU   OCMSGFLG                                                 02116000
OCNAME   EQU   OCMSGFLG                                                 02117000
OCLU1TTE EQU   @NM00143+4                                               02118000
OCLU2TTI EQU   @NM00143+2                                               02119000
OCLU1TTI EQU   @NM00143                                                 02120000
OCSLUTNT EQU   OCFID01+6                                                02121000
OCPLUTNT EQU   OCFID01+4                                                02122000
OCBIADDR EQU   OCFID01                                                  02123000
OCSRCED  EQU   OCFID0+4                                                 02124000
OCSRCEU  EQU   OCFID0                                                   02125000
OCICINAC EQU   OCICSW                                                   02126000
@NM00142 EQU   OCICSW                                                   02127000
OCICATST EQU   OCICDADR+1                                               02128000
OCICTYPE EQU   OCICDADR                                                 02129000
@NM00141 EQU   OCCKPKY1                                                 02130000
OCCKPENV EQU   OCCKPKY1                                                 02131000
OCCKPRST EQU   OCCKPTYP                                                 02132000
OCCKPNCP EQU   OCCKPTYP                                                 02133000
OCCKPINC EQU   OCCKPTYP                                                 02134000
@NM00140 EQU   @NM00137+2                                               02135000
@NM00139 EQU   @NM00138                                                 02136000
OCTSTAT  EQU   @NM00138                                                 02137000
OCREASON EQU   @NM00137                                                 02138000
UCBRV066 EQU   UCBOBS09+4                                               02139000
UCBIOSBA EQU   UCBOBS09                                                 02140000
UCBRV042 EQU   UCBOBS08+5                                               02141000
UCBRV082 EQU   UCBCTCF1                                                 02142000
UCBRV081 EQU   UCBCTCF1                                                 02143000
UCBRV080 EQU   UCBCTCF1                                                 02144000
UCBRV079 EQU   UCBCTCF1                                                 02145000
UCBRV078 EQU   UCBCTCF1                                                 02146000
UCBRV077 EQU   UCBCTCF1                                                 02147000
UCBRV076 EQU   UCBCTCF1                                                 02148000
UCBCTC80 EQU   UCBCTCF1                                                 02149000
UCBCTCAL EQU   UCBCTCAD                                                 02150000
UCBICNCB EQU   UCBOBS07+4                                               02151000
UCBRV040 EQU   UCBOBS07                                                 02152000
UCBCTLNA EQU   UCBCTLNK+1                                               02153000
UCBRLN   EQU   UCBCTLNK                                                 02154000
UCBRDYQA EQU   UCBLDNCB                                                 02155000
UCBINRLN EQU   UCBIRLN                                                  02156000
UCBIRBA  EQU   UCBIRB+1                                                 02157000
UCBRV039 EQU   UCBGRAF                                                  02158000
UCBDWNR  EQU   UCBGRAF                                                  02159000
UCBRPND  EQU   UCBGRAF                                                  02160000
UCBUPM   EQU   UCBGRAF                                                  02161000
UCBBTAM  EQU   UCBGRAF                                                  02162000
UCBDRNO  EQU   UCBGRAF                                                  02163000
UCBDRO   EQU   UCBGRAF                                                  02164000
UCBOIP   EQU   UCBGRAF                                                  02165000
UCBATRCD EQU   @NM00120                                                 02166000
UCBSKPFG EQU   @NM00120                                                 02167000
UCBRIPND EQU   @NM00120                                                 02168000
UCBRTIAC EQU   @NM00120                                                 02169000
UCBRSV79 EQU   @NM00120                                                 02170000
UCBRSV78 EQU   @NM00120                                                 02171000
UCBRSV77 EQU   @NM00120                                                 02172000
UCBOLTEP EQU   @NM00120                                                 02173000
UCBATNCT EQU   UCBOBS06+2                                               02174000
UCBRSV76 EQU   UCBAOF2                                                  02175000
UCBRSV75 EQU   UCBAOF2                                                  02176000
UCBRSV74 EQU   UCBAOF2                                                  02177000
UCBRSV73 EQU   UCBAOF2                                                  02178000
UCBRSV72 EQU   UCBAOF2                                                  02179000
UCBRSV71 EQU   UCBAOF2                                                  02180000
UCBRSV70 EQU   UCBAOF2                                                  02181000
UCBRSV69 EQU   UCBAOF2                                                  02182000
UCBRSV68 EQU   UCBAOF1                                                  02183000
UCBRSV67 EQU   UCBAOF1                                                  02184000
UCBRSV66 EQU   UCBAOF1                                                  02185000
UCBRSV65 EQU   UCBAOF1                                                  02186000
UCBRSV64 EQU   UCBAOF1                                                  02187000
UCBOFNL  EQU   UCBAOF1                                                  02188000
UCBOFSP  EQU   UCBAOF1                                                  02189000
UCBOFMCR EQU   UCBAOF1                                                  02190000
UCBBTB   EQU   UCBBTA+1                                                 02191000
UCBDI    EQU   UCBBTA                                                   02192000
UCBSNS   EQU   UCBOBS04+8                                               02193000
UCBTEB   EQU   UCBOBS04+4                                               02194000
UCBGCB   EQU   UCBOBS04+3                                               02195000
UCBOPEN  EQU   UCBOBS04+2                                               02196000
UCBSTART EQU   UCBOBS04                                                 02197000
UCBXTNB  EQU   UCBXTN+1                                                 02198000
UCBRSV22 EQU   UCBVOPT                                                  02199000
UCBRSV21 EQU   UCBVOPT                                                  02200000
UCBRSV20 EQU   UCBVOPT                                                  02201000
UCBESVE  EQU   UCBVOPT                                                  02202000
UCBERPC  EQU   UCBVOPT                                                  02203000
UCBESVC  EQU   UCBVOPT                                                  02204000
UCBEVA   EQU   UCBVOPT                                                  02205000
UCBESV   EQU   UCBVOPT                                                  02206000
UCBRV009 EQU   UCBTFL1                                                  02207000
UCBRV008 EQU   UCBTFL1                                                  02208000
UCBRV007 EQU   UCBTFL1                                                  02209000
UCBRV006 EQU   UCBTFL1                                                  02210000
UCBRV005 EQU   UCBTFL1                                                  02211000
UCBRV038 EQU   UCBTFL1                                                  02212000
UCBNSLTP EQU   UCBTFL1                                                  02213000
UCBNLTP  EQU   UCBTFL1                                                  02214000
UCBRES1B EQU   UCBOBS02+18                                              02215000
UCBFSER  EQU   UCBOBS02+12                                              02216000
@NM00119 EQU   UCBOBS02+4                                               02217000
UCBFSEQ  EQU   UCBOBS02+2                                               02218000
UCBFSCT  EQU   UCBOBS02                                                 02219000
UCBNEXP  EQU   UCBOBS01+20                                              02220000
UCBBASE  EQU   UCBOBS01+16                                              02221000
UCBRES1A EQU   UCBOBS01+15                                              02222000
UCBUSER  EQU   UCBOBS01+14                                              02223000
UCBFL47  EQU   UCBFL4                                                   02224000
UCBFL46  EQU   UCBFL4                                                   02225000
UCBFL45  EQU   UCBFL4                                                   02226000
UCBRV065 EQU   UCBFL4                                                   02227000
UCBDSS   EQU   UCBFL4                                                   02228000
UCBRV028 EQU   UCBFL4                                                   02229000
UCBWDAV  EQU   UCBFL4                                                   02230000
UCBDAVV  EQU   UCBFL4                                                   02231000
UCBSQC   EQU   UCBOBS01+12                                              02232000
UCBDATP  EQU   UCBOBS01+12                                              02233000
UCBDMC   EQU   UCBDMCT                                                  02234000
UCBMOUNT EQU   UCBDMCT                                                  02235000
UCBBNUL  EQU   UCBSTAB                                                  02236000
UCBSHAR  EQU   UCBSTAB                                                  02237000
UCBBSTR  EQU   UCBSTAB                                                  02238000
UCBBPUB  EQU   UCBSTAB                                                  02239000
UCBBPRV  EQU   UCBSTAB                                                  02240000
UCBBALB  EQU   UCBPRSRS                                                 02241000
UCBPGFL  EQU   UCBSTAB                                                  02242000
UCBDVSHR EQU   UCBBSVL                                                  02243000
UCBVOLI  EQU   UCBOBS01+4                                               02244000
UCBVTOC  EQU   UCBOBS01                                                 02245000
@NM00211 EQU   QCTLWRD2+1                                               02246000
@NM00210 EQU   QCTLWRD1+1                                               02247000
TRMPRIME EQU   TRMLGBST                                                 02248000
TRMOWNR  EQU   TRMLTRAC+1                                               02249000
TRMGPCNT EQU   TRMLTRAC                                                 02250000
TRMBUFRD EQU   TRMBYTE0                                                 02251000
TRMSNA   EQU   TRMBYTE0                                                 02252000
TRMGP    EQU   TRMBYTE0                                                 02253000
TRMDIAL  EQU   TRMBYTE0                                                 02254000
TRMACDC  EQU   TRMNOWCD                                                 02255000
TRMOUTPT EQU   TRMBYTE0                                                 02256000
TRMINPUT EQU   TRMBYTE0                                                 02257000
TRMUDEF  EQU   TRMBYTE0                                                 02258000
TRMCKPRN EQU   TRMBYTE1                                                 02259000
TRMTSATN EQU   TRMBYTE1                                                 02260000
TRMTRACE EQU   TRMBYTE1                                                 02261000
TRMSWBCK EQU   TRMBYTE1                                                 02262000
TRMAUTOC EQU   TRMBYTE1                                                 02263000
TRMINPTP EQU   TRMBYTE1                                                 02264000
TRMWTNEG EQU   TRMSCPRQ                                                 02265000
TRMWRBRK EQU   TRMBYTE2                                                 02266000
TRMNOSND EQU   TRMBYTE2                                                 02267000
TRMPREP  EQU   TRMBYTE2                                                 02268000
TRMGPACT EQU   TRMBYTE2                                                 02269000
TRMANDL  EQU   TRMBYTE2                                                 02270000
TRMCLOSN EQU   TRMINPG                                                  02271000
TRMREMB  EQU   TRMBYTE2                                                 02272000
@NM00190 EQU   TRMCDF0                                                  02273000
TRMPURGE EQU   TRMCDF0                                                  02274000
TRMCDST  EQU   TRMINDEX                                                 02275000
TRMOPTBL EQU   IEDQTRM+18                                               02276000
TRMOPNO  EQU   IEDQTRM+17                                               02277000
TRMCHCIN EQU   IEDQTRM+16                                               02278000
TRMSENSE EQU   TRMSTAT+3                                                02279000
TRMTEMPR EQU   TRMSTAT+2                                                02280000
TRMNADDR EQU   TRMOWNER                                                 02281000
@NM00189 EQU   TRMDEVFL+1                                               02282000
TRMTPIN  EQU   TRMDEVFL+1                                               02283000
@NM00188 EQU   TRMNCPI                                                  02284000
TRMRNTRM EQU   TRMDEVFL+1                                               02285000
@NM00187 EQU   TRMDEVFL+1                                               02286000
TRMLMD   EQU   TRMDEVFL+1                                               02287000
TRMCONC  EQU   TRMDEVFL+1                                               02288000
TRMTSOB  EQU   TRMDEVFL                                                 02289000
TRMBFDY  EQU   TRMDEVFL                                                 02290000
TRMTBLK  EQU   TRMDEVFL                                                 02291000
TRMSBLK  EQU   TRMDEVFL                                                 02292000
TRMBLKS  EQU   TRMDEVFL                                                 02293000
TRMSCV   EQU   TRMADDC                                                  02294000
TRMDDIG  EQU   TRMDEVFL                                                 02295000
TRMBUFS  EQU   TRMDEVFL                                                 02296000
TRMSTEAL EQU   TRMPRILK                                                 02297000
TRMLGB   EQU   TRMDSORG                                                 02298000
TRMUTERM EQU   TRMSESCT                                                 02299000
TRMVERIF EQU   TRMRSTRT                                                 02300000
@NM00186 EQU   TRMRSTRT                                                 02301000
@NM00185 EQU   TRMDESTQ                                                 02302000
TRMSCNYN EQU   TRMSTATE                                                 02303000
TRMOPTFN EQU   TRMSTATE                                                 02304000
TRMHELDN EQU   TRMSTATE                                                 02305000
TRMACPTN EQU   TRMSTATE                                                 02306000
TRMPREF  EQU   TRMSTATE                                                 02307000
TRMPROC  EQU   TRMLOG                                                   02308000
TRMLIST  EQU   TRMLOG                                                   02309000
TRMLINE  EQU   TRMSTATE                                                 02310000
TNTTRMAD EQU   IEDTNTA                                                  02311000
@NM00184 EQU   IEDQTNTD+46                                              02312000
TNTLEN   EQU   IEDQTNTD+44                                              02313000
@NM00183 EQU   IEDQTNTD+41                                              02314000
TNTENLEN EQU   IEDQTNTD+40                                              02315000
@NM00182 EQU   IEDQTNTD+38                                              02316000
@NM00181 EQU   IEDQTNTD                                                 02317000
QCBTTCIN EQU   QCBPLCBA+1                                               02318000
@NM00180 EQU   QCBPLCBA                                                 02319000
@NM00179 EQU   QCBSTAT1                                                 02320000
QCBFLUSH EQU   QCBSTAT1                                                 02321000
QCBNDXRQ EQU   QCBSTAT1                                                 02322000
QCBESIG  EQU   QCBSTAT1                                                 02323000
QCBRCVRQ EQU   QCBSTAT1                                                 02324000
QCBSNDRQ EQU   QCBSTAT1                                                 02325000
QCBWAITC EQU   QCBSTAT1                                                 02326000
QCBPLCBN EQU   QCBSTAT1                                                 02327000
QCBCHAIN EQU   IEDNQCB                                                  02328000
QCBPQBCK EQU   IEDQPQCB+25                                              02329000
QCBPRIPQ EQU   IEDQPQCB+24                                              02330000
QCBCFHDR EQU   IEDQPQCB+21                                              02331000
QCBLFEFO EQU   IEDQPQCB+18                                              02332000
QCBFFEFO EQU   IEDQPQCB+15                                              02333000
QCBPREVF EQU   QCBINTLF                                                 02334000
QCBINTFF EQU   IEDQPQCB+9                                               02335000
QCBDATSQ EQU   QCBFHDTZ+1                                               02336000
@NM00177 EQU   QCBFHDTZ                                                 02337000
QCBDNHDR EQU   IEDQPQCB                                                 02338000
QCBQBACK EQU   IEDQQCB+37                                               02339000
QCBCKPT  EQU   QCBFLAG                                                  02340000
QCBPROC  EQU   QCBFLAG                                                  02341000
QCBSDFFO EQU   QCBFLAG                                                  02342000
QCBTERMQ EQU   QCBFLAG                                                  02343000
QCBRSRV  EQU   QCBFLAG                                                  02344000
QCBREAD  EQU   QCBFLAG                                                  02345000
QCBNOBRK EQU   QCBFLAG                                                  02346000
QCBTSSES EQU   QCBFLAG                                                  02347000
QCBLGBAD EQU   QCBDCBAD                                                 02348000
QCBRELLN EQU   IEDQQCB+32                                               02349000
QCBTJID  EQU   QCBLKRRN+1                                               02350000
QCBCARCT EQU   QCBLKRRN                                                 02351000
QCBPRLVL EQU   QCBPREN                                                  02352000
QCBMSGCT EQU   IEDQQCB+26                                               02353000
QCBEXTO  EQU   QCBINTVL                                                 02354000
QCBDISC  EQU   QCBTSOF1                                                 02355000
QCBDELAY EQU   QCBTSOF1                                                 02356000
QCBPARTO EQU   QCBTSOF1                                                 02357000
QCBSATRD EQU   QCBTSOF1                                                 02358000
QCBNOBUF EQU   QCBTSOF1                                                 02359000
QCBTPUT  EQU   QCBTSOF1                                                 02360000
QCBTGET  EQU   QCBTSOF1                                                 02361000
QCBWRBRK EQU   QCBTSOF1                                                 02362000
QCBSATLC EQU   QCBTSOF2                                                 02363000
QCBSATTI EQU   QCBTSOF2                                                 02364000
QCBSATCH EQU   QCBTSOF2                                                 02365000
QCBSIMRD EQU   QCBTSOF2                                                 02366000
QCBDSSMI EQU   QCBTSOF2                                                 02367000
QCBPOSTO EQU   QCBTSOF2                                                 02368000
QCBBUFQ  EQU   QCBTSOF2                                                 02369000
QCBINHBN EQU   QCBTSOF2                                                 02370000
QCBSATCT EQU   QCBINSRC                                                 02371000
QCBSCBOF EQU   IEDQQCB+20                                               02372000
QCBTIME  EQU   QCBSTAT                                                  02373000
QCBCLOCK EQU   QCBSTAT                                                  02374000
QCBSCHDL EQU   QCBSTAT                                                  02375000
QCBSMODE EQU   QCBSTAT                                                  02376000
QCBSEND  EQU   QCBSTAT                                                  02377000
QCBBUFRD EQU   QCBSTAT                                                  02378000
QCBTRMHO EQU   QCBSTAT                                                  02379000
QCBEOM   EQU   QCBSTAT                                                  02380000
QCBHUCT  EQU   QCBRETCT                                                 02381000
QCBIEND  EQU   QCBRETCT                                                 02382000
QCBEND   EQU   QCBRETCT                                                 02383000
QCBNL    EQU   QCBRETCT                                                 02384000
QCBLOGCT EQU   QCBRETCT                                                 02385000
@NM00176 EQU   QCBBYTE1                                                 02386000
QCBRITRM EQU   QCBBYTE1                                                 02387000
@NM00175 EQU   QCBEOLDT                                                 02388000
QCBSLINK EQU   IEDQQCB+13                                               02389000
QCBSTPRI EQU   IEDQQCB+12                                               02390000
QCBSTCHN EQU   IEDQQCB+9                                                02391000
QCBSTVTO EQU   IEDQQCB+8                                                02392000
QCBLINK  EQU   IEDQQCB+5                                                02393000
QCBPRI   EQU   IEDQQCB+4                                                02394000
QCBCNTEN EQU   QCBELCHN+2                                               02395000
@NM00174 EQU   QCBELCHN+2                                               02396000
@NM00173 EQU   QCBELCHN                                                 02397000
QCBHELD  EQU   QCBDSFLG                                                 02398000
QCBFQCB  EQU   QCBDSFLG                                                 02399000
QCBDRQQ  EQU   QCBDSFLG                                                 02400000
QCBALTMH EQU   QCBDSFLG                                                 02401000
QCBREUS  EQU   QCBDISK                                                  02402000
QCBNREUS EQU   QCBDISK                                                  02403000
QCBCORE  EQU   QCBDSFLG                                                 02404000
QCBTSQ   EQU   QCBDSFLG                                                 02405000
@NM00172 EQU   OPREFLG3                                                 02406000
OPREATCH EQU   OPREFLG3                                                 02407000
@NM00171 EQU   OPREFLG3                                                 02408000
OPREFLG2 EQU   IEDOPRED+13                                              02409000
@NM00170 EQU   OPRVTCHK                                                 02410000
OPRITSET EQU   OPRVTCHK                                                 02411000
@NM00169 EQU   OPRVTCHK                                                 02412000
@NM00168 EQU   OPRETIC                                                  02413000
OPRELINK EQU   IEDOPRED+5                                               02414000
OPREKEY  EQU   IEDOPRED                                                 02415000
OPCBOTTM EQU   IEDQOPCD+1276                                            02416000
OPCDSRWT EQU   IEDQOPCD+1272                                            02417000
@NM00167 EQU   IEDQOPCD+1188                                            02418000
@NM00166 EQU   IEDQOPCD+1036                                            02419000
@NM00165 EQU   IEDQOPCD+1028                                            02420000
@NM00164 EQU   IEDQOPCD+468                                             02421000
OPCLSABC EQU   IEDQOPCD+466                                             02422000
@NM00163 EQU   IEDQOPCD+465                                             02423000
@NM00162 EQU   OPCBLIN                                                  02424000
OPCBLDSC EQU   OPCBLIN                                                  02425000
OPCUNIQV EQU   OPCUNIQP+2                                               02426000
OPCUNIQU EQU   OPCUNIQP                                                 02427000
OPCOSSCP EQU   OPCPCID                                                  02428000
OPCSDUPU EQU   IEDQOPCD+452                                             02429000
OPCSDULU EQU   IEDQOPCD+448                                             02430000
OPCSDRVT EQU   IEDQOPCD+444                                             02431000
OPCSDRET EQU   IEDQOPCD+440                                             02432000
OPCSDHSY EQU   IEDQOPCD+436                                             02433000
OPCSDENQ EQU   IEDQOPCD+432                                             02434000
OPCSDDIA EQU   IEDQOPCD+428                                             02435000
OPCSDCIS EQU   IEDQOPCD+424                                             02436000
OPCSDBIS EQU   IEDQOPCD+420                                             02437000
OPCSDAPU EQU   IEDQOPCD+416                                             02438000
OPCSDALU EQU   IEDQOPCD+412                                             02439000
OPCCSKEY EQU   IEDQOPCD+408                                             02440000
OPCSSKEY EQU   IEDQOPCD+404                                             02441000
OPCPRTTE EQU   IEDQOPCD+400                                             02442000
OPCLU2TT EQU   OPCSESS+14                                               02443000
OPCLU1TT EQU   OPCSESS+12                                               02444000
OPCSENSE EQU   OPCSESS+8                                                02445000
OPCCSIB  EQU   OPCSESS+4                                                02446000
OPCCTTE  EQU   OPCSESS                                                  02447000
OPCGTSIB EQU   IEDQOPCD+380                                             02448000
@NM00161 EQU   OPCPWCOB+9                                               02449000
@NM00160 EQU   OPCPWCOB+8                                               02450000
@NM00159 EQU   OPCPWECB+1                                               02451000
OPCPWCCC EQU   OPCPWECB                                                 02452000
OPCPWCHN EQU   OPCPWQCB+1                                               02453000
OPCPWVTO EQU   OPCPWQCB                                                 02454000
OPCTOTCK EQU   IEDQOPCD+360                                             02455000
OPCAPXTL EQU   IEDQOPCD+356                                             02456000
OPCDECR  EQU   IEDQOPCD+352                                             02457000
OPCBUFWT EQU   IEDQOPCD+348                                             02458000
OPCADGOT EQU   IEDQOPCD+318                                             02459000
OPCRQCNT EQU   IEDQOPCD+316                                             02460000
OPPOLSTP EQU   IEDQOPCD+312                                             02461000
OPCCKCIB EQU   IEDQOPCD+308                                             02462000
OPCEND   EQU   IEDQOPCD+307                                             02463000
OPCSTCBS EQU   IEDQOPCD+306                                             02464000
OPCHNEND EQU   IEDQOPCD+302                                             02465000
OPCOQSW  EQU   IEDQOPCD+301                                             02466000
@NM00158 EQU   OPCSPEC                                                  02467000
@NM00157 EQU   OPCSPEC                                                  02468000
@NM00156 EQU   OPCSPEC                                                  02469000
@NM00155 EQU   OPCSPEC                                                  02470000
OPCFRMCA EQU   OPCSPEC                                                  02471000
OPCRSTRT EQU   OPCSPEC                                                  02472000
OPCPART  EQU   OPCSPEC                                                  02473000
OPCALTD  EQU   OPCSPEC                                                  02474000
OPCBFEND EQU   IEDQOPCD+296                                             02475000
OPCBFIRS EQU   IEDQOPCD+292                                             02476000
OPCAVBUF EQU   IEDQOPCD+290                                             02477000
OPCIPLCT EQU   IEDQOPCD+289                                             02478000
OPCCLNTS EQU   IEDQOPCD+288                                             02479000
OPCHA8   EQU   IEDQOPCD+286                                             02480000
OPCBFREQ EQU   IEDQOPCD+284                                             02481000
OPCNEXT  EQU   IEDQOPCD+272                                             02482000
OPCFMDFC EQU   IEDQOPCD+268                                             02483000
OPCSCNC  EQU   IEDQOPCD+264                                             02484000
OPCHORTG EQU   IEDQOPCD+260                                             02485000
OPCCKPTL EQU   IEDQOPCD+252                                             02486000
OPCCKPTF EQU   IEDQOPCD+248                                             02487000
OPCWAITA EQU   IEDQOPCD+244                                             02488000
OPCWAITR EQU   IEDQOPCD+240                                             02489000
OPCWAITP EQU   IEDQOPCD+236                                             02490000
OPCWAITO EQU   IEDQOPCD+232                                             02491000
OPCWAITN EQU   IEDQOPCD+228                                             02492000
OPCWAITL EQU   IEDQOPCD+224                                             02493000
OPCWAITC EQU   IEDQOPCD+220                                             02494000
@NM00154 EQU   OPCLDNME+5                                               02495000
@NM00153 EQU   OPCLDNME                                                 02496000
OPCWAIT  EQU   IEDQOPCD+192                                             02497000
OPCCKERB EQU   IEDQOPCD+164                                             02498000
OPCBFERB EQU   IEDQOPCD+148                                             02499000
OPCFLAG2 EQU   IEDQOPCD+147                                             02500000
OPCWRKSZ EQU   IEDQOPCD+144                                             02501000
OPCWORK  EQU   IEDQOPCD+140                                             02502000
OPCRSAVE EQU   IEDQOPCD+132                                             02503000
OPCQCBAD EQU   IEDQOPCD+128                                             02504000
OPCTRMWA EQU   IEDQOPCD+52                                              02505000
OPCPSTWT EQU   IEDQOPCD+48                                              02506000
OPCTNTEA EQU   IEDQOPCD+44                                              02507000
OPCPGCK  EQU   IEDQOPCD+40                                              02508000
OPCLCB   EQU   IEDQOPCD+36                                              02509000
@NM00152 EQU   IEDQOPCD+32                                              02510000
OPCIPLAD EQU   IEDQOPCD+28                                              02511000
OPCTOFLK EQU   IEDQOPCD+24                                              02512000
OPCOPTLK EQU   IEDQOPCD+20                                              02513000
OPCDCBLK EQU   IEDQOPCD+16                                              02514000
OPCDOUBL EQU   IEDQOPCD                                                 02515000
@NM00145 EQU   OCLDNME+4                                                02516000
@NM00144 EQU   OCPREFLG                                                 02517000
OCREMCON EQU   OCPREFLG                                                 02518000
OCCLNUP  EQU   OCPREFLG                                                 02519000
OCTOTEP  EQU   OCPREFLG                                                 02520000
OCREPOST EQU   OCPREFLG                                                 02521000
OCRSPSNT EQU   OCPREFLG                                                 02522000
OCBFREQ  EQU   OCPREFLG                                                 02523000
OCIDLE   EQU   OCREQFLG                                                 02524000
OCFORCE  EQU   OCREQFLG                                                 02525000
OCDCARD  EQU   OCREQFLG                                                 02526000
OCPARTAL EQU   OCREQFLG                                                 02527000
OCADNCP  EQU   OCREQFLG                                                 02528000
OCRMPORQ EQU   OCREQFLG                                                 02529000
OCCDLACT EQU   OCREQFLG                                                 02530000
OCFLUSHZ EQU   OCREQFLG                                                 02531000
OCRESPCT EQU   OCLINTTE                                                 02532000
OCCKPTWA EQU   OCCKDATA+4                                               02533000
OCNCP    EQU   OCRSTGTM+2                                               02534000
OCCKDAT2 EQU   OC379RRT+1                                               02535000
OCCKDAT1 EQU   OC379RRT                                                 02536000
OCPUADR  EQU   OCIPLWA+2                                                02537000
OCWTGSAV EQU   OCIPLWA                                                  02538000
OCDVRDCT EQU   OCBACKUP+6                                               02539000
@NM00136 EQU   OCBACKUP+4                                               02540000
OCBUFRET EQU   OCBUFGOT                                                 02541000
OCBUFUSD EQU   OCBUFNED                                                 02542000
OCRESNUM EQU   OCPARM                                                   02543000
OCSEQ    EQU   OCTRUNIT+2                                               02544000
@NM00135 EQU   OCRSID+1                                                 02545000
OCREDRVE EQU   OCALSTAT                                                 02546000
OCSEQIND EQU   OCALSTAT                                                 02547000
@NM00134 EQU   OCALSTAT                                                 02548000
OCDIALX  EQU   OCWTGB                                                   02549000
@NM00133 EQU   OCMSTSAV+2                                               02550000
OCREQVAL EQU   OCDEST+1                                                 02551000
OCCONID  EQU   OCDEST                                                   02552000
OCRLN    EQU   IEDQOPCE+15                                              02553000
OCSSCP   EQU   OCFLAG                                                   02554000
OCOUTPUT EQU   OCFLAG                                                   02555000
OCLINE   EQU   OCFLAG                                                   02556000
OCMPP    EQU   OCFLAG                                                   02557000
OCCONSOL EQU   OCFLAG                                                   02558000
@NM00132 EQU   OCSWITCH                                                 02559000
OCQUCKN  EQU   OCSWITCH                                                 02560000
OCPRIFLG EQU   OCOPTCDE                                                 02561000
@NM00131 EQU   OCUNITBF                                                 02562000
OCINVTIC EQU   OCUNITBF                                                 02563000
@NM00130 EQU   OCUNITBF                                                 02564000
@NM00129 EQU   @NM00128                                                 02565000
@NM00127 EQU   OCSCAN                                                   02566000
OCNOTUCB EQU   OCSCAN                                                   02567000
OCNONAME EQU   OCSCAN                                                   02568000
OCALLRLN EQU   OCSCAN                                                   02569000
OCDDNAME EQU   OCSCAN                                                   02570000
OCDDNRLN EQU   OCSCAN                                                   02571000
OCADDR   EQU   OCSCAN                                                   02572000
OCELMPRI EQU   OCELEM                                                   02573000
NSLTTEND EQU   NSLGRPNM+4                                               02574000
NSLOPCEP EQU   NSLTTEBG                                                 02575000
@NM00126 EQU   IEDNSLD+34                                               02576000
NSLUNREQ EQU   NSLUNCNT+1                                               02577000
NSLBFREQ EQU   NSLUNCNT                                                 02578000
NSLBUFFR EQU   NSLERB+9                                                 02579000
@NM00125 EQU   NSLESTAT                                                 02580000
NSLMPPI  EQU   NSLESTAT                                                 02581000
@NM00124 EQU   NSLESTAT                                                 02582000
NSLELINK EQU   NSLERB+5                                                 02583000
NSLERBPR EQU   NSLERB+4                                                 02584000
NSLERQCB EQU   NSLERB                                                   02585000
NSLTTCIN EQU   IEDNSLD+16                                               02586000
NSLCTTRM EQU   IEDNSLD+13                                               02587000
@NM00123 EQU   NSLGPCUS                                                 02588000
NSLDRDRV EQU   NSLGPCUS                                                 02589000
NSLSDIAL EQU   NSLGPCUS                                                 02590000
NSLNGPSL EQU   NSLGPCUS                                                 02591000
NSLGPTSP EQU   NSLGPCUS                                                 02592000
NSLNGPST EQU   NSLGPCUS                                                 02593000
@NM00122 EQU   NSLPLCB                                                  02594000
NSLPLCBR EQU   NSLPLCB                                                  02595000
NSLOPRE  EQU   IEDNSLD                                                  02596000
NSLSAVE2 EQU   IEDNNSLD+4                                               02597000
NSLSAVE1 EQU   IEDNNSLD                                                 02598000
UCBERADR EQU   UCBUCS+12                                                02599000
UCBFCBID EQU   UCBUCS+8                                                 02600000
UCBERCNT EQU   UCBUCS+7                                                 02601000
UCBRSV51 EQU   UCBUCS+6                                                 02602000
UCBRSV50 EQU   UCBFCBOP                                                 02603000
UCBRSV49 EQU   UCBFCBOP                                                 02604000
UCBRSV48 EQU   UCBFCBOP                                                 02605000
UCBRSV47 EQU   UCBFCBOP                                                 02606000
UCBRSV46 EQU   UCBFCBOP                                                 02607000
UCBRSV45 EQU   UCBFCBOP                                                 02608000
UCBRSV44 EQU   UCBFCBOP                                                 02609000
UCBFCBO1 EQU   UCBFCBOP                                                 02610000
UCBUCSPE EQU   UCBUCSOP                                                 02611000
UCBRSV43 EQU   UCBUCSOP                                                 02612000
UCBRSV42 EQU   UCBUCSOP                                                 02613000
UCBRSV41 EQU   UCBUCSOP                                                 02614000
UCBRSV40 EQU   UCBUCSOP                                                 02615000
UCBRSV39 EQU   UCBUCSOP                                                 02616000
UCBUCSO2 EQU   UCBUCSOP                                                 02617000
UCBUCSO1 EQU   UCBUCSOP                                                 02618000
UCBUCSID EQU   UCBUCS                                                   02619000
UCBMDRBA EQU   UCBMDRBF+1                                               02620000
UCBRV075 EQU   UCBMDRBF                                                 02621000
UCBRV074 EQU   UCB3800X+32                                              02622000
UCBIMAGE EQU   UCB3800X+28                                              02623000
UCBFCBNM EQU   UCB3800X+24                                              02624000
UCBCHAR4 EQU   UCB3800X+20                                              02625000
UCBCHAR3 EQU   UCB3800X+16                                              02626000
UCBCHAR2 EQU   UCB3800X+12                                              02627000
UCBCHAR1 EQU   UCB3800X+8                                               02628000
UCBCGMID EQU   UCB3800X+4                                               02629000
UCBBRSTA EQU   UCBACTIV                                                 02630000
UCBRV063 EQU   UCBACTIV                                                 02631000
UCBRV062 EQU   UCBACTIV                                                 02632000
UCBRV061 EQU   UCBACTIV                                                 02633000
UCBRV060 EQU   UCBACTIV                                                 02634000
UCBRV059 EQU   UCBACTIV                                                 02635000
UCBRV058 EQU   UCBACTIV                                                 02636000
UCBRV057 EQU   UCBACTIV                                                 02637000
UCBRV050 EQU   UCB3800X+2                                               02638000
UCBCGMNO EQU   UCB3800X+1                                               02639000
UCBRV083 EQU   UCBOPTNS                                                 02640000
UCBBRSTR EQU   UCBOPTNS                                                 02641000
UCBRV056 EQU   UCBOPTNS                                                 02642000
UCBRV055 EQU   UCBOPTNS                                                 02643000
UCBRV054 EQU   UCBOPTNS                                                 02644000
UCBRV053 EQU   UCBOPTNS                                                 02645000
UCBRV052 EQU   UCBOPTNS                                                 02646000
UCBRV051 EQU   UCBOPTNS                                                 02647000
UCBRV073 EQU   UCB3540X+7                                               02648000
UCBRV072 EQU   UCBDKBYT                                                 02649000
UCBRV071 EQU   UCBDKBYT                                                 02650000
UCBRV070 EQU   UCBDKBYT                                                 02651000
UCBRV069 EQU   UCBDKBYT                                                 02652000
UCBRV068 EQU   UCBDKBYT                                                 02653000
UCBRV067 EQU   UCBDKBYT                                                 02654000
UCBVLVER EQU   UCBDKBYT                                                 02655000
UCBDKAMX EQU   UCBDKBYT                                                 02656000
UCBVLSER EQU   UCB3540X                                                 02657000
UCBRDATA EQU   UCBOCR+4                                                 02658000
UCBFRID  EQU   UCBOCR                                                   02659000
UCBCLN   EQU   UCBMT+14                                                 02660000
UCBERG   EQU   UCBMT+12                                                 02661000
UCBMS    EQU   UCBMT+11                                                 02662000
UCBNB    EQU   UCBMT+10                                                 02663000
UCBPW    EQU   UCBMT+9                                                  02664000
UCBPR    EQU   UCBMT+8                                                  02665000
UCBSIO   EQU   UCBMT+6                                                  02666000
UCBTW    EQU   UCBMT+5                                                  02667000
UCBTR    EQU   UCBMT+4                                                  02668000
UCBTWT   EQU   UCBMT+3                                                  02669000
UCBTRT   EQU   UCBMT+2                                                  02670000
UCBCTD   EQU   UCBMT                                                    02671000
UCBWTOID EQU   UCBCMEXT+17                                              02672000
UCBRV043 EQU   UCBCMEXT+16                                              02673000
UCBASID  EQU   UCBCMEXT+14                                              02674000
UCBMFCNT EQU   UCBCMEXT+12                                              02675000
UCBPMSK  EQU   UCBCMEXT+10                                              02676000
UCBCCWOF EQU   UCBCMEXT+8                                               02677000
UCBRV041 EQU   UCBCMEXT+6                                               02678000
UCBRV036 EQU   UCBFLP1                                                  02679000
UCBRV035 EQU   UCBFLP1                                                  02680000
UCBERLOG EQU   UCBFLP1                                                  02681000
UCBRV033 EQU   UCBFLP1                                                  02682000
UCBRV032 EQU   UCBFLP1                                                  02683000
UCBRV031 EQU   UCBFLP1                                                  02684000
UCBSHRUP EQU   UCBFLP1                                                  02685000
UCBNSRCH EQU   UCBFLP1                                                  02686000
UCBSNSCT EQU   UCBCMEXT+4                                               02687000
UCBHPDV  EQU   @NM00121                                                 02688000
UCBHALI  EQU   @NM00121                                                 02689000
UCBRSV09 EQU   @NM00121                                                 02690000
UCBRSV08 EQU   @NM00121                                                 02691000
UCBRSV07 EQU   @NM00121                                                 02692000
UCBRSV06 EQU   @NM00121                                                 02693000
UCBRSV05 EQU   @NM00121                                                 02694000
UCBRSV04 EQU   @NM00121                                                 02695000
UCBDTI   EQU   UCBCMEXT+2                                               02696000
UCBSTI   EQU   UCBCMEXT+1                                               02697000
UCBETI   EQU   UCBCMEXT                                                 02698000
UCBEXTP  EQU   UCBEXTPT+1                                               02699000
UCBDDRSW EQU   UCBFLC                                                   02700000
UCBTICBT EQU   UCBFLC                                                   02701000
UCBIVRR  EQU   UCBFLC                                                   02702000
UCBIVRS  EQU   UCBFLC                                                   02703000
UCBITF   EQU   UCBFLC                                                   02704000
UCBUDE   EQU   UCBFLC                                                   02705000
UCBWAA   EQU   UCBFLC                                                   02706000
UCBATTP  EQU   UCBFLC                                                   02707000
UCBUNTYP EQU   UCBTBYT4                                                 02708000
UCBRSV11 EQU   UCBDVCLS                                                 02709000
UCBRSV10 EQU   UCBDVCLS                                                 02710000
UCB3CHAR EQU   UCBDVCLS                                                 02711000
UCB3UREC EQU   UCBDVCLS                                                 02712000
UCB3DISP EQU   UCBDVCLS                                                 02713000
UCB3DACC EQU   UCBDVCLS                                                 02714000
UCB3COMM EQU   UCBDVCLS                                                 02715000
UCB3TAPE EQU   UCBDVCLS                                                 02716000
UCBDVPWR EQU   UCB2OPT7                                                 02717000
UCBVLPWR EQU   UCB2OPT6                                                 02718000
UCB2OPT5 EQU   UCBTBYT2                                                 02719000
UCBRVDEV EQU   UCBRWTAU                                                 02720000
UCBRPS   EQU   UCBDUDN2                                                 02721000
UCBRR    EQU   UCBDUDN1                                                 02722000
UCB2OPT1 EQU   UCBTBYT2                                                 02723000
UCB2OPT0 EQU   UCBTBYT2                                                 02724000
UCB1FEA7 EQU   UCBTBYT1                                                 02725000
UCBD6250 EQU   UCB1FEA6                                                 02726000
UCBD1600 EQU   UCB1FEA5                                                 02727000
UCB1FEA4 EQU   UCBTBYT1                                                 02728000
UCB1FEA3 EQU   UCBTBYT1                                                 02729000
UCB1FEA2 EQU   UCBTBYT1                                                 02730000
UCB1FEA1 EQU   UCBTBYT1                                                 02731000
UCB1FEA0 EQU   UCBTBYT1                                                 02732000
UCBRV029 EQU   UCBWGT                                                   02733000
UCBVHRSN EQU   UCBWGT                                                   02734000
UCBVORSN EQU   UCBWGT                                                   02735000
UCBMTPXP EQU   UCBWGT                                                   02736000
UCBREW   EQU   UCBWGT                                                   02737000
UCBPUB   EQU   UCBWGT                                                   02738000
UCBOUT   EQU   UCBWGT                                                   02739000
UCBIN    EQU   UCBWGT                                                   02740000
UCBCPU   EQU   UCBOB+11                                                 02741000
UCBLCI   EQU   UCBOB+10                                                 02742000
UCBCNT   EQU   UCBOB+9                                                  02743000
UCBRV017 EQU   UCBCHM1                                                  02744000
UCBRV016 EQU   UCBCHM1                                                  02745000
UCBRV015 EQU   UCBCHM1                                                  02746000
UCBRV014 EQU   UCBCHM1                                                  02747000
UCBSPB   EQU   UCBPTH1                                                  02748000
UCBPPB   EQU   UCBPTH1                                                  02749000
UCBSPA   EQU   UCBPTH0                                                  02750000
UCBPPA   EQU   UCBPTH0                                                  02751000
UCBSIGP  EQU   UCBFLB                                                   02752000
UCBVALPH EQU   UCBFLB                                                   02753000
UCBCRHSN EQU   UCBFLB                                                   02754000
UCBCRHRV EQU   UCBFLB                                                   02755000
UCBRESVH EQU   UCBFLB                                                   02756000
UCBSPST  EQU   UCBFLB                                                   02757000
UCBASNS  EQU   UCBFLB                                                   02758000
UCBIORST EQU   UCBFLB                                                   02759000
UCBQISCE EQU   UCBFL1                                                   02760000
UCBACTV  EQU   UCBFL1                                                   02761000
UCBSAP   EQU   UCBFL1                                                   02762000
UCBNOTRC EQU   UCBCUB                                                   02763000
UCBPSNS  EQU   UCBFL1                                                   02764000
UCBUSING EQU   UCBPST                                                   02765000
UCBNOTRD EQU   UCBNRY                                                   02766000
UCBBUSYD EQU   UCBBSY                                                   02767000
UCBUA    EQU   UCBCHAN+1                                                02768000
UCBCHA   EQU   UCBCHAN                                                  02769000
UCBDADI  EQU   UCBSTAT                                                  02770000
UCBSYSR  EQU   UCBSTAT                                                  02771000
UCBPRES  EQU   UCBSTAT                                                  02772000
UCBALOC  EQU   UCBSTAT                                                  02773000
UCBUNLD  EQU   UCBSTAT                                                  02774000
UCBRESV  EQU   UCBSTAT                                                  02775000
UCBCHGS  EQU   UCBSTAT                                                  02776000
UCBONLI  EQU   UCBSTAT                                                  02777000
UCBID    EQU   UCBOB+2                                                  02778000
UCBALTPH EQU   UCBFL5                                                   02779000
UCBALTCU EQU   UCBFL5                                                   02780000
UCBNALOC EQU   UCBFL5                                                   02781000
UCBENVRD EQU   UCBFL5                                                   02782000
UCBVSDR  EQU   UCBFL5                                                   02783000
UCBSASK  EQU   UCBFL5                                                   02784000
UCBAMV   EQU   UCBAF                                                    02785000
UCBDCC   EQU   UCBFL5                                                   02786000
UCBMONT  EQU   UCBJBNR                                                  02787000
UCBRV011 EQU   UCBJBNR                                                  02788000
UCBRSV02 EQU   UCBJBNR                                                  02789000
UCBOLDSM EQU   UCBJBNR                                                  02790000
UCBRV003 EQU   UCBJBNR                                                  02791000
UCBDUC   EQU   UCBJBNR                                                  02792000
UCBJES3  EQU   UCBJBNR                                                  02793000
UCBVRDEV EQU   UCBJBNR                                                  02794000
UCBCMSEG EQU   UCBOB                                                    02795000
UCBPFXND EQU   UCB+512                                                  02796000
UCBIOQ   EQU   UCB+508                                                  02797000
UCBLOCK  EQU   UCB+504                                                  02798000
UCBPXST  EQU   UCB+504                                                  02799000
@NM00118 EQU   UCB                                                      02800000
DEBAPPAD EQU   IEDQDEB+65                                               02801000
DEBEXSCL EQU   IEDQDEB+64                                               02802000
DEBDCBAD EQU   IEDQDEB+61                                               02803000
DEBPROTG EQU   IEDQDEB+60                                               02804000
DEBECBAD EQU   IEDQDEB+57                                               02805000
DEBPRIOR EQU   IEDQDEB+56                                               02806000
DEBUSRPG EQU   IEDQDEB+53                                               02807000
DEBSYSPG EQU   IEDQDEB+49                                               02808000
DEBOPATB EQU   IEDQDEB+48                                               02809000
DEBIRBAD EQU   IEDQDEB+45                                               02810000
DEBOFLGS EQU   IEDQDEB+44                                               02811000
DEBDEBAD EQU   IEDQDEB+41                                               02812000
DEBAMLNG EQU   IEDQDEB+40                                               02813000
DEBTCBAD EQU   IEDQDEB+37                                               02814000
@NM00117 EQU   DEBPRF+33                                                02815000
DEBLNGTH EQU   DEBPRF+32                                                02816000
DEBDCBMK EQU   DEBPRF+28                                                02817000
DEBDSCBA EQU   DEBPRF+21                                                02818000
DEBWKARA EQU   DEBPRF+20                                                02819000
DEBXCEA  EQU   DEBAPVT+16                                               02820000
DEBCEA   EQU   DEBAPVT+12                                               02821000
DEBPCIA  EQU   DEBAPVT+8                                                02822000
DEBSIOA  EQU   DEBAPVT+4                                                02823000
DEBEOEA  EQU   DEBAPVT                                                  02824000
DCBBUFSI EQU   IHADCS43+6                                               02825000
DCBUNTCT EQU   IHADCS43+5                                               02826000
DCBILCT  EQU   IHADCS43+4                                               02827000
DCBSCTAD EQU   DCBSCTAB+1                                               02828000
@NM00116 EQU   DCBSCTAB                                                 02829000
DCBPUTA  EQU   DCBGETA                                                  02830000
@NM00115 EQU   DCBPUT                                                   02831000
DCBDEBA  EQU   DCBDEBAD+1                                               02832000
@NM00114 EQU   DCBIFLGS                                                 02833000
DCBIFIOE EQU   DCBIFLGS                                                 02834000
DCBCH12  EQU   DCBIFPCT                                                 02835000
DCBCH9   EQU   DCBIFPCT                                                 02836000
DCBIFEC  EQU   DCBIFLGS                                                 02837000
DCBMFSTI EQU   DCBMFDMD                                                 02838000
DCBMFAWR EQU   DCBMFSTK                                                 02839000
DCBMFUIP EQU   DCBMFTMD                                                 02840000
DCBMFIDW EQU   DCBMFLCP                                                 02841000
DCBMFWRK EQU   DCBMFMVP                                                 02842000
DCBMFRDQ EQU   DCBMFWRT                                                 02843000
DCBMFGTQ EQU   DCBMFPUT                                                 02844000
DCBMFSTL EQU   DCBMACF2                                                 02845000
DCBMFCK  EQU   DCBMFDMG                                                 02846000
DCBMFRDX EQU   DCBMFCHK                                                 02847000
DCBMFDBF EQU   DCBMFSBG                                                 02848000
DCBMFRDI EQU   DCBMFLCG                                                 02849000
DCBMFRDK EQU   DCBMFMVG                                                 02850000
DCBMFWRQ EQU   DCBMFRD                                                  02851000
DCBMFPTQ EQU   DCBMFGET                                                 02852000
DCBMFECP EQU   DCBMACF1                                                 02853000
DCBTIOT  EQU   IHADCS25                                                 02854000
DCBMRSTI EQU   DCBMRDMD                                                 02855000
DCBMRAWR EQU   DCBMRSTK                                                 02856000
DCBMRUIP EQU   DCBMRTMD                                                 02857000
DCBMRIDW EQU   DCBMRLCP                                                 02858000
DCBMRWRK EQU   DCBMRMVP                                                 02859000
DCBMRRDQ EQU   DCBMRWRT                                                 02860000
DCBMRGTQ EQU   DCBMRPUT                                                 02861000
DCBMRSTL EQU   DCBMACR2                                                 02862000
DCBMRCK  EQU   DCBMRDMG                                                 02863000
DCBPGFXA EQU   DCBMRRDX                                                 02864000
DCBMRDBF EQU   DCBMRSBG                                                 02865000
DCBMRRDI EQU   DCBMRLCG                                                 02866000
DCBMRRDK EQU   DCBMRMVG                                                 02867000
DCBMRWRQ EQU   DCBMRRD                                                  02868000
DCBMRPTQ EQU   DCBMRGET                                                 02869000
DCBMRECP EQU   DCBMACR1                                                 02870000
@NM00113 EQU   DCBIFLG                                                  02871000
DCBIBIOE EQU   DCBIFLG                                                  02872000
DCBICH12 EQU   DCBIBPCT                                                 02873000
DCBICH9  EQU   DCBIBPCT                                                 02874000
DCBIBEC  EQU   DCBIFLG                                                  02875000
DCBOFIOF EQU   DCBOFLGS                                                 02876000
DCBOFUEX EQU   DCBOFLGS                                                 02877000
DCBOFTM  EQU   DCBOFLGS                                                 02878000
DCBOFPPC EQU   DCBOFLGS                                                 02879000
DCBOFOPN EQU   DCBOFLGS                                                 02880000
DCBOFEOV EQU   DCBOFLGS                                                 02881000
DCBOFLRB EQU   DCBOFLGS                                                 02882000
DCBOFIOD EQU   DCBOFLWR                                                 02883000
DCBDDNAM EQU   IHADCS24                                                 02884000
DCBEXLSA EQU   DCBEXLST+1                                               02885000
DCBEIOBX EQU   DCBEXLST                                                 02886000
DCBRNCKA EQU   DCBRNCKD+1                                               02887000
@NM00112 EQU   DCBRNCKD                                                 02888000
DCBIOBAD EQU   IHADCS2K+8                                               02889000
DCBDSGTR EQU   DCBDSRG2                                                 02890000
@NM00111 EQU   DCBDSRG2                                                 02891000
DCBDSRG1 EQU   DCBDSORG                                                 02892000
DCBCHNGL EQU   DCBTRSTA                                                 02893000
DCBNIDLE EQU   DCBTRSTA                                                 02894000
DCBBAKUP EQU   DCBTRSTA                                                 02895000
DCBIPLED EQU   DCBTRSTA                                                 02896000
DCBRSTRT EQU   DCBTRSTA                                                 02897000
DCBINITL EQU   DCBTRSTA                                                 02898000
DCBAUTOD EQU   DCBTRSTA                                                 02899000
DCBAUTOI EQU   DCBTRSTA                                                 02900000
@NM00110 EQU   IHADCS2K+4                                               02901000
DCBDUMPA EQU   DCBDUMPD+1                                               02902000
DCBUNITN EQU   DCBDUMPD                                                 02903000
DCBBCKUA EQU   DCBBCKUP+1                                               02904000
@NM00109 EQU   DCBBCKUP                                                 02905000
DCBIPLTX EQU   IHADCS1A                                                 02906000
@NM00108 EQU   IHADCB                                                   02907000
SAVTLLCB EQU   IEDNSVTD+380                                             02908000
SAVTSCF0 EQU   IEDNSVTD+376                                             02909000
SAVTLSNY EQU   IEDNSVTD+372                                             02910000
SAVTLSZP EQU   IEDNSVTD+368                                             02911000
SAVTOMSU EQU   IEDNSVTD+364                                             02912000
SAVTGTSB EQU   IEDNSVTD+360                                             02913000
SAVTHIBL EQU   IEDNSVTD+356                                             02914000
SAVTHISY EQU   IEDNSVTD+352                                             02915000
SAVTNAX2 EQU   IEDNSVTD+348                                             02916000
SAVTCDRU EQU   IEDNSVTD+344                                             02917000
SAVTPOLC EQU   IEDNSVTD+342                                             02918000
SAVTPOLM EQU   IEDNSVTD+340                                             02919000
SAVTPOLR EQU   IEDNSVTD+336                                             02920000
SAVTCDRN EQU   SAVTCDRV                                                 02921000
SAVTPOLL EQU   IEDNSVTD+328                                             02922000
SAVTPOLN EQU   IEDNSVTD+326                                             02923000
@NM00107 EQU   IEDNSVTD+325                                             02924000
@NM00106 EQU   SAVTNETF                                                 02925000
SAVTSDIS EQU   SAVTNETF                                                 02926000
SAVTROUT EQU   SAVTNETF                                                 02927000
SAVTNETW EQU   SAVTNETF                                                 02928000
SAVTDIAL EQU   IEDNSVTD+320                                             02929000
SAVTRQUT EQU   IEDNSVTD+316                                             02930000
SAVTBITN EQU   IEDNSVTD+312                                             02931000
@NM00105 EQU   SAVTCKQB+8                                               02932000
@NM00104 EQU   SAVTCKEC+1                                               02933000
@NM00103 EQU   SAVTCKCC                                                 02934000
SAVTCKPO EQU   SAVTCKCC                                                 02935000
SAVTCKWA EQU   SAVTCKCC                                                 02936000
SAVTCKCH EQU   SAVTCKTB+1                                               02937000
SAVTCKVT EQU   SAVTCKTB                                                 02938000
@NM00102 EQU   IEDNSVTD+297                                             02939000
SAVTRDFG EQU   SAVTRDRV+12                                              02940000
@NM00101 EQU   SAVTRDRV+5                                               02941000
SAVTRDPY EQU   SAVTRDRV+4                                               02942000
SAVTRDQB EQU   SAVTRDRV+1                                               02943000
SAVTRDKY EQU   SAVTRDRV                                                 02944000
SAVTNID  EQU   IEDNSVTD+280                                             02945000
SAVTDVAS EQU   IEDNSVTD+276                                             02946000
SAVTPLSZ EQU   IEDNSVTD+274                                             02947000
@NM00100 EQU   IEDNSVTD+273                                             02948000
SAVTSUBL EQU   IEDNSVTD+272                                             02949000
@NM00099 EQU   SAVTZELM+1                                               02950000
SAVTSUBM EQU   SAVTZELM                                                 02951000
SAVTMHDX EQU   IEDNSVTD+268                                             02952000
SAVTNAT1 EQU   IEDNSVTD+266                                             02953000
SAVTSH20 EQU   IEDNSVTD+264                                             02954000
SAVTLCBS EQU   IEDNSVTD+260                                             02955000
SAVTRNMP EQU   IEDNSVTD+256                                             02956000
SAVTTNTX EQU   IEDNSVTD+252                                             02957000
SAVTNAX  EQU   IEDNSVTD+248                                             02958000
SAVTSUBV EQU   IEDNSVTD+247                                             02959000
SAVTSUBA EQU   IEDNSVTD+246                                             02960000
SAVTSIBC EQU   IEDNSVTD+244                                             02961000
SAVTBSM  EQU   IEDNSVTD+240                                             02962000
SAVTSCPT EQU   SAVTTCPU                                                 02963000
SAVTRQTG EQU   IEDNSVTD+236                                             02964000
SAVTRQCH EQU   IEDNSVTD+232                                             02965000
SAVTMAND EQU   IEDNSVTD+228                                             02966000
SAVTNADL EQU   IEDNSVTD+222                                             02967000
SAVTNATL EQU   IEDNSVTD+220                                             02968000
SAVTMHTB EQU   IEDNSVTD+216                                             02969000
SAVTSSMH EQU   IEDNSVTD+212                                             02970000
SAVTQRS  EQU   IEDNSVTD+208                                             02971000
SAVTRQIN EQU   IEDNSVTD+204                                             02972000
SAVTDFCO EQU   IEDNSVTD+200                                             02973000
SAVTSAO  EQU   IEDNSVTD+196                                             02974000
SAVTSARI EQU   IEDNSVTD+192                                             02975000
SAVTSAC  EQU   IEDNSVTD+188                                             02976000
SAVTSAI  EQU   IEDNSVTD+184                                             02977000
SAVTCSCI EQU   IEDNSVTD+180                                             02978000
SAVTSSRP EQU   IEDNSVTD+176                                             02979000
SAVTSSRQ EQU   IEDNSVTD+172                                             02980000
SAVTSCLU EQU   IEDNSVTD+168                                             02981000
SAVTXTRQ EQU   IEDNSVTD+164                                             02982000
SAVTMVBF EQU   IEDNSVTD+160                                             02983000
@NM00098 EQU   IEDNSVTD+148                                             02984000
SAVTIPCQ EQU   IEDNSVTD+144                                             02985000
@NM00097 EQU   IEDNSVTD+136                                             02986000
SAVTXFMI EQU   IEDNSVTD+132                                             02987000
@NM00096 EQU   IEDNSVTD+124                                             02988000
SAVTXFMO EQU   IEDNSVTD+120                                             02989000
@NM00095 EQU   IEDNSVTD+116                                             02990000
SAVTSSSR EQU   IEDNSVTD+112                                             02991000
SAVTSCPQ EQU   IEDNSVTD+108                                             02992000
SAVTSLCB EQU   IEDNSVTD+104                                             02993000
SAVTLUSR EQU   IEDNSVTD+100                                             02994000
@NM00094 EQU   SAVTLUSQ+8                                               02995000
SAVTLUSP EQU   SAVTLUSQ+4                                               02996000
SAVTLUSB EQU   SAVTLUSQ                                                 02997000
@NM00093 EQU   IEDNSVTD+84                                              02998000
SAVTSAT  EQU   IEDNSVTD+80                                              02999000
SAVTNAT  EQU   IEDNSVTD+76                                              03000000
SAVTCLUP EQU   IEDNSVTD+72                                              03001000
SAVTPIUT EQU   IEDNSVTD+68                                              03002000
SAVTRNTA EQU   IEDNSVTD+64                                              03003000
SAVTDNIR EQU   IEDNSVTD+60                                              03004000
SAVTCNIR EQU   IEDNSVTD+56                                              03005000
SAVTFLDH EQU   IEDNSVTD+52                                              03006000
SAVTSRTN EQU   IEDNSVTD+48                                              03007000
SAVTSREQ EQU   IEDNSVTD+44                                              03008000
SAVTFAIL EQU   IEDNSVTD+42                                              03009000
SAVTSUSE EQU   IEDNSVTD+40                                              03010000
SAVTSIB  EQU   IEDNSVTD+36                                              03011000
SAVTPRTN EQU   IEDNSVTD+32                                              03012000
@NM00092 EQU   IEDNSVTD+28                                              03013000
SAVTWH20 EQU   IEDNSVTD+26                                              03014000
SAVTPWT  EQU   IEDNSVTD+24                                              03015000
SAVTPRTQ EQU   IEDNSVTD+20                                              03016000
SAVTPREQ EQU   IEDNSVTD+16                                              03017000
SAVTPH20 EQU   IEDNSVTD+14                                              03018000
SAVTPUSE EQU   IEDNSVTD+12                                              03019000
SAVTPLCB EQU   IEDNSVTD+8                                               03020000
SAVTPOOL EQU   IEDNSVTD+4                                               03021000
SAVTPRMT EQU   SAVTDIAF                                                 03022000
SAVTVIRT EQU   SAVTDIAF                                                 03023000
AVTSITS  EQU   IEDQAVTD+1264                                            03024000
AVTMSUHI EQU   IEDQAVTD+1260                                            03025000
AVTSITU  EQU   IEDQAVTD+1256                                            03026000
AVTSITP  EQU   IEDQAVTD+1252                                            03027000
AVTPADDR EQU   IEDQAVTD+1248                                            03028000
@NM00091 EQU   IEDQAVTD+1246                                            03029000
AVTCPBNO EQU   IEDQAVTD+1244                                            03030000
AVTHRESS EQU   IEDQAVTD+1243                                            03031000
@NM00090 EQU   IEDQAVTD+1242                                            03032000
@NM00089 EQU   IEDQAVTD+1241                                            03033000
@NM00088 EQU   IEDQAVTD+1240                                            03034000
@NM00087 EQU   IEDQAVTD+1237                                            03035000
@NM00086 EQU   IEDQAVTD+1236                                            03036000
AVTHRESE EQU   @NM00085                                                 03037000
AVTRADDR EQU   IEDQAVTD+1228                                            03038000
AVTNADDR EQU   IEDQAVTD+1224                                            03039000
AVTHRESN EQU   IEDQAVTD+1220                                            03040000
AVTVOLRN EQU   IEDQAVTD+1216                                            03041000
AVTTOTNN EQU   IEDQAVTD+1212                                            03042000
AVTTRCYN EQU   IEDQAVTD+1208                                            03043000
AVTRCTRN EQU   IEDQAVTD+1204                                            03044000
AVTNOVON EQU   IEDQAVTD+1200                                            03045000
AVTADEBN EQU   IEDQAVTD+1196                                            03046000
AVTVOLRR EQU   IEDQAVTD+1192                                            03047000
AVTTOTNR EQU   IEDQAVTD+1188                                            03048000
AVTTRCYR EQU   IEDQAVTD+1184                                            03049000
AVTRCTRR EQU   IEDQAVTD+1180                                            03050000
AVTNOVOR EQU   IEDQAVTD+1176                                            03051000
AVTADEBR EQU   IEDQAVTD+1172                                            03052000
AVTLODPT EQU   IEDQAVTD+1168                                            03053000
AVTIOBN  EQU   IEDQAVTD+1164                                            03054000
AVTIOBR  EQU   IEDQAVTD+1160                                            03055000
AVTCPBPT EQU   IEDQAVTD+1156                                            03056000
AVTFCPB  EQU   IEDQAVTD+1152                                            03057000
@NM00084 EQU   IEDQAVTD+1148                                            03058000
AVTINCPQ EQU   IEDQAVTD+1144                                            03059000
@NM00083 EQU   IEDQAVTD+1140                                            03060000
@NM00082 EQU   IEDQAVTD+1137                                            03061000
@NM00081 EQU   AVTBIT4                                                  03062000
@NM00080 EQU   AVTBIT4                                                  03063000
@NM00079 EQU   AVTBIT4                                                  03064000
@NM00078 EQU   AVTBIT4                                                  03065000
@NM00077 EQU   AVTBIT4                                                  03066000
@NM00076 EQU   AVTBIT4                                                  03067000
@NM00075 EQU   AVTBIT4                                                  03068000
AVTRUFTN EQU   AVTBIT4                                                  03069000
@NM00074 EQU   IEDQAVTD+1132                                            03070000
AVTNOBFQ EQU   IEDQAVTD+1128                                            03071000
@NM00073 EQU   IEDQAVTD+1124                                            03072000
AVTDKENQ EQU   IEDQAVTD+1120                                            03073000
@NM00072 EQU   IEDQAVTD+1116                                            03074000
AVTDKAPQ EQU   IEDQAVTD+1112                                            03075000
AVTCOPY  EQU   IEDQAVTD+1108                                            03076000
AVTIA    EQU   IEDQAVTD+1104                                            03077000
AVTFL    EQU   IEDQAVTD+1100                                            03078000
@NM00071 EQU   IEDQAVTD+1096                                            03079000
AVTNCPBQ EQU   IEDQAVTD+1092                                            03080000
AVTTOTNC EQU   IEDQAVTD+1088                                            03081000
AVTCMAX  EQU   IEDQAVTD+1084                                            03082000
AVTCMIN  EQU   IEDQAVTD+1080                                            03083000
AVTHM02  EQU   IEDQAVTD+1076                                            03084000
AVTOPCIN EQU   IEDQAVTD+1074                                            03085000
AVTDCTLN EQU   IEDQAVTD+1072                                            03086000
AVTOPMSK EQU   IEDQAVTD+1068                                            03087000
AVTDDFT  EQU   IEDQAVTD+1064                                            03088000
AVTSTEAL EQU   IEDQAVTD+1060                                            03089000
AVTOPTN  EQU   IEDQAVTD+1056                                            03090000
AVTDSKCT EQU   IEDQAVTD+1054                                            03091000
AVTCKRST EQU   IEDQAVTD+1053                                            03092000
AVTSTAN  EQU   AVTBIT3                                                  03093000
AVTSTACN EQU   AVTBIT3                                                  03094000
AVTSTAIN EQU   AVTBIT3                                                  03095000
AVTSTAYN EQU   AVTBIT3                                                  03096000
AVTOLTBN EQU   AVTBIT3                                                  03097000
AVTTSAB  EQU   AVTBIT3                                                  03098000
AVTRFULN EQU   AVTBIT3                                                  03099000
AVTRECVN EQU   AVTBIT3                                                  03100000
@NM00070 EQU   AVTBIT2                                                  03101000
@NM00069 EQU   AVTBIT2                                                  03102000
AVTOPEIN EQU   AVTBIT2                                                  03103000
AVTSTRTN EQU   AVTBIT2                                                  03104000
AVTTOPOL EQU   AVTBIT2                                                  03105000
AVTCOPYN EQU   AVTBIT2                                                  03106000
AVTREUSN EQU   AVTBIT2                                                  03107000
AVTEXTSC EQU   AVTBIT2                                                  03108000
AVTDISKN EQU   AVTBIT1                                                  03109000
AVTQUCKN EQU   AVTBIT1                                                  03110000
AVTCLOSN EQU   AVTBIT1                                                  03111000
AVTREADN EQU   AVTBIT1                                                  03112000
AVTDLAYN EQU   AVTBIT1                                                  03113000
AVTAQTAN EQU   AVTBIT1                                                  03114000
AVTTSON  EQU   AVTBIT1                                                  03115000
AVTAPLKN EQU   AVTBIT1                                                  03116000
AVTDUMBR EQU   IEDQAVTD+1048                                            03117000
AVTDLQX  EQU   IEDQAVTD+1046                                            03118000
AVTINTLV EQU   IEDQAVTD+1044                                            03119000
AVTSMCNT EQU   IEDQAVTD+1042                                            03120000
AVTAVFCT EQU   IEDQAVTD+1040                                            03121000
AVTOPCON EQU   IEDQAVTD+1038                                            03122000
AVTOPCNT EQU   IEDQAVTD+1036                                            03123000
AVTLNCNT EQU   IEDQAVTD+1034                                            03124000
AVTKEYLE EQU   IEDQAVTD+1032                                            03125000
AVTHA16  EQU   IEDQAVTD+1030                                            03126000
AVTHA7   EQU   IEDQAVTD+1028                                            03127000
AVTHA4   EQU   IEDQAVTD+1026                                            03128000
AVTHA3   EQU   IEDQAVTD+1024                                            03129000
AVTHA2   EQU   IEDQAVTD+1022                                            03130000
AVTGETMS EQU   IEDQAVTD+1021                                            03131000
@NM00068 EQU   IEDQAVTD+1020                                            03132000
AVTGETMD EQU   IEDQAVTD+1016                                            03133000
AVTGETMN EQU   IEDQAVTD+1012                                            03134000
AVTCWTOT EQU   IEDQAVTD+1008                                            03135000
AVTCWINT EQU   IEDQAVTD+956                                             03136000
AVTDTRAP EQU   IEDQAVTD+952                                             03137000
@NM00067 EQU   IEDQAVTD+950                                             03138000
@NM00066 EQU   AVTIOTR                                                  03139000
AVTIOTRH EQU   AVTIOTR                                                  03140000
AVTIOTRE EQU   AVTIOTR                                                  03141000
@NM00065 EQU   AVTSUBT                                                  03142000
AVTSUBPT EQU   AVTSUBT                                                  03143000
AVTSUBON EQU   AVTSUBT                                                  03144000
AVTAFE30 EQU   IEDQAVTD+944                                             03145000
AVTAFE20 EQU   IEDQAVTD+940                                             03146000
AVTAFE10 EQU   IEDQAVTD+936                                             03147000
AVTCWEC2 EQU   IEDQAVTD+932                                             03148000
AVTCWPM2 EQU   IEDQAVTD+928                                             03149000
AVTCWTS2 EQU   IEDQAVTD+927                                             03150000
AVTCWTS1 EQU   IEDQAVTD+926                                             03151000
AVTCWCLD EQU   AVTCWFL2                                                 03152000
AVTCWRAP EQU   AVTCWFL2                                                 03153000
@NM00064 EQU   AVTCWFL2                                                 03154000
@NM00063 EQU   AVTCWFL2                                                 03155000
@NM00062 EQU   AVTCWFL2                                                 03156000
@NM00061 EQU   AVTCWFL2                                                 03157000
@NM00060 EQU   AVTCWFL2                                                 03158000
AVTCWACT EQU   AVTCWFL2                                                 03159000
@NM00059 EQU   AVTCWFL1                                                 03160000
@NM00058 EQU   AVTCWFL1                                                 03161000
@NM00057 EQU   AVTCWFL1                                                 03162000
@NM00056 EQU   AVTCWFL1                                                 03163000
@NM00055 EQU   AVTCWFL1                                                 03164000
@NM00054 EQU   AVTCWFL1                                                 03165000
@NM00053 EQU   AVTCWFL1                                                 03166000
AVTCOMWN EQU   AVTCWFL1                                                 03167000
AVTCWEC1 EQU   IEDQAVTD+920                                             03168000
AVTCWPM1 EQU   IEDQAVTD+916                                             03169000
AVTCAREA EQU   IEDQAVTD+912                                             03170000
AVTFZERO EQU   IEDQAVTD+908                                             03171000
AVTCADDR EQU   IEDQAVTD+904                                             03172000
AVTCOREC EQU   IEDQAVTD+900                                             03173000
@NM00052 EQU   IEDQAVTD+892                                             03174000
AVTCPBCB EQU   IEDQAVTD+888                                             03175000
@NM00051 EQU   IEDQAVTD+880                                             03176000
AVTDSIOB EQU   IEDQAVTD+876                                             03177000
@NM00050 EQU   IEDQAVTD+868                                             03178000
AVTCPRMB EQU   IEDQAVTD+864                                             03179000
@NM00049 EQU   IEDQAVTD+856                                             03180000
AVTCLOSB EQU   IEDQAVTD+852                                             03181000
@NM00048 EQU   IEDQAVTD+844                                             03182000
AVTACTIB EQU   IEDQAVTD+840                                             03183000
@NM00047 EQU   IEDQAVTD+836                                             03184000
AVTOLTEB EQU   IEDQAVTD+832                                             03185000
AVTOLTCH EQU   AVTOLTQB+1                                               03186000
AVTOLTVT EQU   AVTOLTQB                                                 03187000
@NM00046 EQU   AVTOPCQB+8                                               03188000
@NM00045 EQU   AVTOPCEC+1                                               03189000
@NM00044 EQU   AVTOPCCC                                                 03190000
AVTOPCPO EQU   AVTOPCCC                                                 03191000
AVTOPCWA EQU   AVTOPCCC                                                 03192000
AVTOPCCH EQU   AVTOPCOB+1                                               03193000
AVTOPCVT EQU   AVTOPCOB                                                 03194000
@NM00043 EQU   AVTCKPQB+9                                               03195000
AVTCKPTS EQU   AVTCKPQB+8                                               03196000
@NM00042 EQU   AVTCKPEC+1                                               03197000
@NM00041 EQU   AVTCKPCC                                                 03198000
AVTCKPPO EQU   AVTCKPCC                                                 03199000
AVTCKPWA EQU   AVTCKPCC                                                 03200000
AVTCKPCH EQU   AVTCKPTB+1                                               03201000
AVTCKPVT EQU   AVTCKPTB                                                 03202000
@NM00040 EQU   IEDQAVTD+796                                             03203000
AVTBFRTB EQU   IEDQAVTD+792                                             03204000
@NM00039 EQU   IEDQAVTD+788                                             03205000
AVTSELCH EQU   IEDQAVTD+785                                             03206000
AVTBFRTN EQU   AVTBFRFG                                                 03207000
AVTBFREB EQU   IEDQAVTD+780                                             03208000
AVTTIMQ  EQU   IEDQAVTD+776                                             03209000
@NM00038 EQU   IEDQAVTD+772                                             03210000
AVTIMQPS EQU   IEDQAVTD+768                                             03211000
AVTINOUT EQU   IEDQAVTD+766                                             03212000
AVTREFTM EQU   IEDQAVTD+764                                             03213000
@NM00037 EQU   IEDQAVTD+752                                             03214000
AVTDELYB EQU   IEDQAVTD+748                                             03215000
AVTOCQPT EQU   IEDQAVTD+744                                             03216000
AVTTSOPT EQU   IEDQAVTD+740                                             03217000
AVTSUPPT EQU   IEDQAVTD+736                                             03218000
AVTCBQCB EQU   IEDQAVTD+732                                             03219000
AVTMSGS  EQU   IEDQAVTD+729                                             03220000
@NM00036 EQU   AVTSYSER                                                 03221000
@NM00035 EQU   AVTSYSER                                                 03222000
@NM00034 EQU   AVTSYSER                                                 03223000
@NM00033 EQU   AVTSYSER                                                 03224000
@NM00032 EQU   AVTSYSER                                                 03225000
@NM00031 EQU   AVTSYSER                                                 03226000
AVTCMAXN EQU   AVTSYSER                                                 03227000
AVTCMINN EQU   AVTSYSER                                                 03228000
AVT2260L EQU   IEDQAVTD+724                                             03229000
AVTABEPL EQU   AVTADBUF                                                 03230000
AVTHFF   EQU   AVTCLRHI+2                                               03231000
@NM00030 EQU   AVTCLRHI                                                 03232000
AVTCCLNK EQU   AVTCRELE+5                                               03233000
AVTCCPRI EQU   AVTCRELE+4                                               03234000
AVTCCQCB EQU   AVTCCELE+1                                               03235000
AVTCCKEY EQU   AVTCCELE                                                 03236000
AVTDELAD EQU   IEDQAVTD+704                                             03237000
AVTDELEM EQU   IEDQAVTD+700                                             03238000
AVTBSX   EQU   AVTCKLNK                                                 03239000
AVTOPETR EQU   AVTHG01                                                  03240000
@NM00029 EQU   AVTCKBYT                                                 03241000
AVTCKONQ EQU   AVTCKBYT                                                 03242000
@NM00028 EQU   AVTCKBYT                                                 03243000
@NM00027 EQU   AVTCKBYT                                                 03244000
@NM00026 EQU   AVTCKBYT                                                 03245000
@NM00025 EQU   AVTCKBYT                                                 03246000
@NM00024 EQU   AVTCKBYT                                                 03247000
@NM00023 EQU   AVTCKBYT                                                 03248000
AVTOPERT EQU   IEDQAVTD+690                                             03249000
AVTOPXCL EQU   IEDQAVTD+688                                             03250000
AVTOPERL EQU   IEDQAVTD+687                                             03251000
@NM00022 EQU   IEDQAVTD+686                                             03252000
AVTCKTIM EQU   IEDQAVTD+684                                             03253000
AVTCKELV EQU   IEDQAVTD+682                                             03254000
AVTCPRCD EQU   IEDQAVTD+681                                             03255000
AVTWARMN EQU   AVTCKELF                                                 03256000
AVTCRTLN EQU   AVTCKELF                                                 03257000
AVTCPIPN EQU   AVTCKELF                                                 03258000
AVTCCLCN EQU   AVTCKELF                                                 03259000
AVTCINCN EQU   AVTCKELF                                                 03260000
@NM00021 EQU   AVTCKELF                                                 03261000
AVTCMCPN EQU   AVTCKELF                                                 03262000
AVTNQBCK EQU   AVTCKELF                                                 03263000
AVTCKQAD EQU   IEDQAVTD+677                                             03264000
AVTSCBSZ EQU   IEDQAVTD+676                                             03265000
@NM00020 EQU   IEDQAVTD+672                                             03266000
AVTCKELE EQU   IEDQAVTD+668                                             03267000
@NM00019 EQU   AVTCKPEL+8                                               03268000
AVTCKRLK EQU   AVTCKPEL+5                                               03269000
AVTCKRPR EQU   AVTCKPEL+4                                               03270000
AVTCKRMQ EQU   AVTCKRMV+1                                               03271000
AVTCKRKY EQU   AVTCKRMV                                                 03272000
AVTHK    EQU   IEDQAVTD+648                                             03273000
AVTHI    EQU   IEDQAVTD+644                                             03274000
AVTIOT   EQU   IEDQAVTD+640                                             03275000
AVTNX    EQU   IEDQAVTD+636                                             03276000
AVTTONE  EQU   IEDQAVTD+632                                             03277000
AVTA3TL  EQU   IEDQAVTD+628                                             03278000
AVTDMECB EQU   IEDQAVTD+624                                             03279000
AVTABEND EQU   IEDQAVTD+618                                             03280000
AVTPLCBN EQU   IEDQAVTD+616                                             03281000
@NM00018 EQU   AVTSAVTP+1                                               03282000
@NM00017 EQU   AVTSAVTF                                                 03283000
AVTSNA   EQU   AVTSAVTF                                                 03284000
AVTONSNA EQU   AVTSAVTF                                                 03285000
AVTVTMCP EQU   AVTSAVTF                                                 03286000
@NM00016 EQU   IEDQAVTD+608                                             03287000
AVTCMBSS EQU   IEDQAVTD+604                                             03288000
AVTRCV   EQU   IEDQAVTD+600                                             03289000
AVTSEND  EQU   IEDQAVTD+596                                             03290000
AVTCSCH  EQU   IEDQAVTD+592                                             03291000
AVTQ1    EQU   IEDQAVTD+588                                             03292000
AVTE7    EQU   IEDQAVTD+584                                             03293000
AVTHB    EQU   IEDQAVTD+580                                             03294000
AVTR1    EQU   IEDQAVTD+576                                             03295000
AVTBZ    EQU   IEDQAVTD+572                                             03296000
AVTEZ    EQU   IEDQAVTD+568                                             03297000
AVTEC    EQU   IEDQAVTD+564                                             03298000
AVTEW    EQU   IEDQAVTD+560                                             03299000
AVTNDIAL EQU   AVTSCOPT                                                 03300000
AVTN2741 EQU   AVTSCOPT                                                 03301000
AVTCONCO EQU   AVTSCOPT                                                 03302000
AVTCONC  EQU   AVTSCOPT                                                 03303000
AVTCMBUF EQU   AVTSCOPT                                                 03304000
AVTAPDMP EQU   AVTSCOPT                                                 03305000
@NM00015 EQU   AVTSCOPT                                                 03306000
AVTHA    EQU   AVTDISP                                                  03307000
AVTEA    EQU   IEDQAVTD+548                                             03308000
AVTAX    EQU   IEDQAVTD+544                                             03309000
AVTA3    EQU   IEDQAVTD+540                                             03310000
AVTGD    EQU   IEDQAVTD+536                                             03311000
AVTAL    EQU   IEDQAVTD+532                                             03312000
AVTOLTST EQU   AVTHG02                                                  03313000
AVTE8    EQU   IEDQAVTD+524                                             03314000
AVTUI    EQU   IEDQAVTD+520                                             03315000
AVTCOMPT EQU   IEDQAVTD+516                                             03316000
AVTCRSRF EQU   IEDQAVTD+512                                             03317000
@NM00014 EQU   IEDQAVTD+508                                             03318000
AVTKA02  EQU   IEDQAVTD+504                                             03319000
AVTOPTPT EQU   IEDQAVTD+500                                             03320000
AVTPCBPT EQU   IEDQAVTD+496                                             03321000
@NM00013 EQU   AVTECB1                                                  03322000
AVTCOMP  EQU   AVTECB1                                                  03323000
@NM00012 EQU   AVTECB1                                                  03324000
AVTOPECA EQU   IEDQAVTD+488                                             03325000
AVTOLECA EQU   IEDQAVTD+484                                             03326000
AVTCKECA EQU   IEDQAVTD+480                                             03327000
AVTCWECA EQU   IEDQAVTD+476                                             03328000
AVTCWTCB EQU   IEDQAVTD+472                                             03329000
AVTOLTCB EQU   IEDQAVTD+468                                             03330000
AVTOCTCB EQU   IEDQAVTD+464                                             03331000
AVTCKTCB EQU   IEDQAVTD+460                                             03332000
AVTAS    EQU   IEDQAVTD+456                                             03333000
AVTNOLBF EQU   IEDQAVTD+454                                             03334000
AVTNCKPR EQU   IEDQAVTD+453                                             03335000
AVTCIB   EQU   IEDQAVTD+452                                             03336000
AVTSPLPT EQU   IEDQAVTD+448                                             03337000
AVTMVBFR EQU   IEDQAVTD+444                                             03338000
AVTSBTA  EQU   IEDQAVTD+440                                             03339000
AVTRARTN EQU   IEDQAVTD+436                                             03340000
AVTBSCAN EQU   IEDQAVTD+432                                             03341000
AVTRDYA  EQU   IEDQAVTD+428                                             03342000
AVTDISTR EQU   IEDQAVTD+420                                             03343000
AVTPARM3 EQU   IEDQAVTD+416                                             03344000
@NM00011 EQU   AVTPKF                                                   03345000
@NM00010 EQU   AVTPKF                                                   03346000
@NM00009 EQU   AVTPKF                                                   03347000
AVTFTCHF EQU   AVTPKF                                                   03348000
@NM00008 EQU   AVTPKF                                                   03349000
@NM00007 EQU   AVTPKF                                                   03350000
@NM00006 EQU   AVTPKF                                                   03351000
@NM00005 EQU   AVTPKF                                                   03352000
AVTPARM  EQU   IEDQAVTD+408                                             03353000
AVTEXS2A EQU   IEDQAVTD+402                                             03354000
AVTEXA2S EQU   IEDQAVTD+396                                             03355000
AVTOCGET EQU   IEDQAVTD+392                                             03356000
AVTCKAVT EQU   @NM00003+1                                               03357000
@NM00004 EQU   AVTCKFLG                                                 03358000
AVTCKHLT EQU   AVTCKFLG                                                 03359000
AVTCKREQ EQU   AVTCKFLG                                                 03360000
AVTCKENV EQU   AVTCKFLG                                                 03361000
AVTCKNAC EQU   AVTCKFLG                                                 03362000
AVTCKTAC EQU   AVTCKFLG                                                 03363000
@NM00002 EQU   IEDQAVTD+384                                             03364000
AVTREADD EQU   IEDQAVTD+380                                             03365000
AVTREADY EQU   IEDQAVTD+376                                             03366000
AVTRACE  EQU   IEDQAVTD+372                                             03367000
AVTTCB   EQU   IEDQAVTD+368                                             03368000
AVTPASWD EQU   IEDQAVTD+360                                             03369000
AVTCTLCH EQU   IEDQAVTD+352                                             03370000
AVTDOUBL EQU   IEDQAVTD+344                                             03371000
AVTDOUBX EQU   IEDQAVTD+336                                             03372000
AVTDPARM EQU   IEDQAVTD+332                                             03373000
AVTCSTCS EQU   IEDQAVTD+328                                             03374000
AVTDLQ   EQU   AVTSAVEX+32                                              03375000
@NM00001 EQU   AVTSAVEX                                                 03376000
AVTSAVE4 EQU   IEDQAVTD+216                                             03377000
AVTSAVE3 EQU   IEDQAVTD+144                                             03378000
AVTSAVE2 EQU   IEDQAVTD+72                                              03379000
AVTSAVE1 EQU   IEDQAVTD                                                 03380000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03381000
@RF00606 EQU   @RC00603                                                 03382000
@RF00609 EQU   @RC00603                                                 03383000
@RF00612 EQU   @RC00603                                                 03384000
@RC00637 EQU   @RC00635                                                 03385000
@RC00651 EQU   @RC00647                                                 03386000
@RC00782 EQU   @EL00011                                                 03387000
@RC00881 EQU   @RC00879                                                 03388000
@RC00905 EQU   @RC00903                                                 03389000
@PB00022 EQU   @EL00001                                                 03390000
@PB00021 EQU   @PB00022                                                 03391000
@PB00020 EQU   @PB00021                                                 03392000
@PB00019 EQU   @PB00020                                                 03393000
@PB00018 EQU   @PB00019                                                 03394000
@PB00017 EQU   @PB00018                                                 03395000
@PB00016 EQU   @PB00017                                                 03396000
@PB00015 EQU   @PB00016                                                 03397000
@PB00014 EQU   @PB00015                                                 03398000
@PB00013 EQU   @PB00014                                                 03399000
@PB00012 EQU   @PB00013                                                 03400000
@PB00011 EQU   @PB00012                                                 03401000
@PB00010 EQU   @PB00011                                                 03402000
@PB00009 EQU   @PB00010                                                 03403000
@PB00008 EQU   @PB00009                                                 03404000
@PB00007 EQU   @PB00008                                                 03405000
@PB00006 EQU   @PB00007                                                 03406000
@PB00005 EQU   @PB00006                                                 03407000
@PB00004 EQU   @PB00005                                                 03408000
@PB00003 EQU   @PB00004                                                 03409000
@PB00002 EQU   @PB00003                                                 03410000
@ENDDATA EQU   *                                                        03411000
         END   IGCVI10D,(C'PLS0647',0701,77341)                         03412000
