         TITLE '*** IKT93EST: TSO/VTAM ESTAE FOR SVC 93 ***'            00001000
IKT93EST CSECT ,                                                01S0001 00002000
@MAINENT DS    0H                                               01S0001 00003000
         USING *,@15                                            01S0001 00004000
         B     @PROLOG                                          01S0001 00005000
         DC    AL1(16)                                          01S0001 00006000
         DC    C'IKT93EST  80.033'                              01S0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @12,0                                            01S0001 00009000
@PSTART  DS    0H                                               01S0001 00010000
         USING @PSTART,@12                                      01S0001 00011000
RBPRFXLN EQU 64                                                         00012000
RBPRFLNA EQU 32                                                         00013000
PRBLEN   EQU 136                                                        00014000
SIRBLEN  EQU 200                                                        00015000
TIRBLEN  EQU 136                                                        00016000
IRBLEN   EQU 128                                                        00017000
SVRBLEN  EQU 224                                                        00018000
*                                      IKTASTPT              @ZMB6772*/ 00019000
*                                                               01S0077 00020000
*/********************************************************************/ 00021000
*/*                                                                  */ 00022000
*/* SEGMENT-                                                         */ 00023000
*/*       IKT93EST                                                   */ 00024000
*/*                                                                  */ 00025000
*/* FUNCTION-                                                        */ 00026000
*/*       MAINLINE                                                   */ 00027000
*/*                                                                  */ 00028000
*/********************************************************************/ 00029000
*                                                               01S0077 00030000
*   DO;                             /* BLOCK MAIN START OF MAIN BLOCK   00031000
*                                                            @ZMB6772*/ 00032000
*/*  LEAVE(MAIN) ON(REG0=12)                                         */ 00033000
*                                                               01S0078 00034000
*     IF(REG0=12) THEN                                          01S0078 00035000
         C     REG0,@CF02102                                    01S0078 00036000
         BE    @RT00078                                         01S0078 00037000
*       GOTO #BCM0001;              /* EXIT, NO SDWA PRESENT @ZMB6772*/ 00038000
*     STM(RTNREG,BASEREG,ESTAESA);  /* SAVE REGS IN ESTAE SAVE AREA  */ 00039000
         STM   RTNREG,BASEREG,ESTAESA(STORREG)                  01S0080 00040000
*     TSBPTR=ASCBTSB;               /* SET UP TSB ADDRESSABILITY     */ 00041000
         L     @15,ASCBPTR                                      01S0081 00042000
         L     TSBPTR,ASCBTSB(,@15)                             01S0081 00043000
*     SDWAPTR=REG1;                 /* SAVE ADDRESS OF SDWA          */ 00044000
         LR    SDWAPTR,REG1                                     01S0082 00045000
*     RBSECPTR=SDWAPARM;            /* ESTABLISH ADDRESSABILITY TO      00046000
*                                      EXTENDED SAVE AREA.           */ 00047000
         L     RBSECPTR,SDWAPARM(,SDWAPTR)                      01S0083 00048000
*     RFY                                                       01S0084 00049000
*       TVCS BASED(ESTTVCSP);       /*                       @ZMB6772*/ 00050000
*     IF SDWAPCHK='1'B&XSADMOVE='1'B THEN/* PGM CHECK DURING DATA       00051000
*                                      MOVE ?                        */ 00052000
         TM    SDWAPCHK(SDWAPTR),B'01000000'                    01S0085 00053000
         BNO   @RF00085                                         01S0085 00054000
         TM    XSADMOVE(RBSECPTR),B'01000000'                   01S0085 00055000
         BNO   @RF00085                                         01S0085 00056000
*       SDWACMPC=CMPLCODE;          /* YES, CHANGE COMPLETION CODE   */ 00057000
         MVC   SDWACMPC(3,SDWAPTR),CMPLCODE+1                   01S0086 00058000
*     IF XSAPTGT='0'B THEN          /* IF TPUT, THEN CLEAN UP TSB    */ 00059000
@RF00085 TM    XSAPTGT(RBSECPTR),B'10000000'                    01S0087 00060000
         BNZ   @RF00087                                         01S0087 00061000
*       CALL TSBCLEAN;              /* GO CLEAN UP PROPER TSB        */ 00062000
         BAL   @14,TSBCLEAN                                     01S0088 00063000
*     IF XSAIDENQ='1'B THEN         /* WAS AN ASID ENQ'ED IN IKTASTPT   00064000
*                                      ? YES, DEQUEUE THE ASID       */ 00065000
@RF00087 TM    XSAIDENQ(RBSECPTR),B'10000000'                   01S0089 00066000
         BNO   @RF00089                                         01S0089 00067000
*       DO;                                                     01S0090 00068000
*         RFY                                                   01S0091 00069000
*          (REG2,                                               01S0091 00070000
*           REG3) RSTD;                                         01S0091 00071000
*         XSAWD5='FF000000'X;       /* SET LIST FORM OF DEQ          */ 00072000
         MVC   XSAWD5(4,RBSECPTR),@CF02164                      01S0092 00073000
*         REG1=ADDR(XSAENQAD);      /* ADDRESS OF DEQ WORK AREA      */ 00074000
         LA    REG1,XSAENQAD(,RBSECPTR)                         01S0093 00075000
*         REG2=ADDR(QNAME);         /* GET QNAME ADDRESS FOR GEN     */ 00076000
         LA    REG2,QNAME                                       01S0094 00077000
*         REG3=ADDR(XSAASID);       /* GET RNAME ADDRESS FOR GEN     */ 00078000
         LA    REG3,XSAASID(,RBSECPTR)                          01S0095 00079000
*         GEN(DEQ ((REG2),(REG3),2,SYSTEM),RET=HAVE,MF=(E,(REG1)) );    00080000
         DEQ ((REG2),(REG3),2,SYSTEM),RET=HAVE,MF=(E,(REG1))            00081000
*       END;                                                    01S0097 00082000
*     RFY                                                       01S0098 00083000
*      (REG2,                                                   01S0098 00084000
*       REG3) UNRSTD;                                           01S0098 00085000
@RF00089 DS    0H                                               01S0099 00086000
*     SDWARCDE=SDWACWT;             /* INDICATE TO CONTINUE WITH        00087000
*                                      TERMINATION                   */ 00088000
         MVI   SDWARCDE(SDWAPTR),X'00'                          01S0099 00089000
*     SDWARTYA=0;                   /* CLEAR RETRY ADDRESS           */ 00090000
         SLR   @15,@15                                          01S0100 00091000
         ST    @15,SDWARTYA(,SDWAPTR)                           01S0100 00092000
*     LM(RTNREG,BASEREG,ESTAESA);   /* RESTORE REGISTERS             */ 00093000
         LM    RTNREG,BASEREG,ESTAESA(STORREG)                  01S0101 00094000
*   END;                            /* END                           */ 00095000
*#BCM0001:                                                      01S0103 00096000
*   ;                               /* END OF MAIN BLOCK     @ZMB6772*/ 00097000
#BCM0001 DS    0H                                               01S0104 00098000
*/********************************************************************/ 00099000
*/* THE FOLLOWING CODE IS REACHED BY ANY ?LEAVE (MAIN) MACRO         */ 00100000
*/********************************************************************/ 00101000
*                                                               01S0104 00102000
*   RETURN CODE(0);                 /* RETURN TO RTM                 */ 00103000
         SLR   @15,@15                                          01S0104 00104000
@EL00001 DS    0H                                               01S0104 00105000
@EF00001 DS    0H                                               01S0104 00106000
@ER00001 BR    @14                                              01S0104 00107000
         EJECT                                                          00108000
*                                                               01S0105 00109000
*/********************************************************************/ 00110000
*/*                                                                  */ 00111000
*/* SUBROUTINE-                                                      */ 00112000
*/*      TSBCLEAN                                                    */ 00113000
*/*                                                                  */ 00114000
*/* FUNCTION-                                                        */ 00115000
*/*      RESET TSB FIELDS FOR TGET/TPUT/TPG                          */ 00116000
*/*                                                                  */ 00117000
*/********************************************************************/ 00118000
*                                                               01S0105 00119000
*TSBCLEAN:                                                      01S0105 00120000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                            01S0105 00121000
TSBCLEAN DS    0H                                               01S0106 00122000
*   XSASAVEA=RTNREG;                /* SAVE RETURN ADDRESS           */ 00123000
         ST    RTNREG,XSASAVEA(,RBSECPTR)                       01S0106 00124000
*   GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);      01S0107 00125000
*                                   /* GET THE LOCAL LOCK            */ 00126000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,               -00127000
               RELATED=(TSB,TSBCLEAN(RETURN))                           00128000
*   IF TSBPTR^=0&TSBCTCB=CURNTTCB THEN/* IF FOREGROUND JOB, THEN DOES   00129000
*                                      THIS TASK 'OWN' THE TSB ?     */ 00130000
         SLR   @15,@15                                          01S0108 00131000
         CR    TSBPTR,@15                                       01S0108 00132000
         BE    @RF00108                                         01S0108 00133000
         L     @08,CVTPTR                                       01S0108 00134000
         L     @07,CVTTCBP(,@08)                                01S0108 00135000
         CLC   TSBCTCB(4,TSBPTR),CURNTTCB(@07)                  01S0108 00136000
         BNE   @RF00108                                         01S0108 00137000
*     DO;                           /* PROCESS THIS TASK OWNS TSB    */ 00138000
*       TSBOWIP='0'B;               /* CLEAR 'OWAIT IN PROGRESS      */ 00139000
         NI    TSBOWIP(TSBPTR),B'11011111'                      01S0110 00140000
*       TSBCTCB=0;                  /* SET TO NOT 'OWN' TSB          */ 00141000
         ST    @15,TSBCTCB(,TSBPTR)                             01S0111 00142000
*       IF TSBWOWIP='1'B THEN       /* ANYBODY WAITING ?             */ 00143000
         TM    TSBWOWIP(TSBPTR),B'00010000'                     01S0112 00144000
         BNO   @RF00112                                         01S0112 00145000
*         DO;                       /* YES                           */ 00146000
*           TSBWOWIP='0'B;          /* CLEAR OWAIT IN PROGRESS IND   */ 00147000
         NI    TSBWOWIP(TSBPTR),B'11101111'                     01S0114 00148000
*           RFY                                                 01S0115 00149000
*             REG2 RSTD;                                        01S0115 00150000
*           REG2=STORREG;           /* SAVE ESTAE SAVE AREA  @ZMB6772*/ 00151000
         LR    REG2,STORREG                                     01S0116 00152000
*           STORREG=NDISPBIT;       /* INDICATE THAT NON-DISPATCH-      00153000
*                                      ABILITY BIT TO RESET IS OWAIT    00154000
*                                                            @ZMB6772*/ 00155000
         LA    STORREG,1024                                     01S0117 00156000
*           REG0=ASCBASID*65536|ALLTASKS;/* ALL TASKS WILL BE RESET  */ 00157000
         L     @15,ASCBPTR                                      01S0118 00158000
         LH    REG0,ASCBASID(,@15)                              01S0118 00159000
         N     REG0,@CF02189                                    01S0118 00160000
         SLA   REG0,16                                          01S0118 00161000
         O     REG0,@CF00049                                    01S0118 00162000
*           REG1=RESET;             /* INDICATE RESET VS. SET        */ 00163000
         L     REG1,RESET                                       01S0119 00164000
*           CALL STATUS;            /* DRIVE SUSPENDED TASKS         */ 00165000
         L     @08,SCVTSPTR(,@08)                               01S0120 00166000
         L     @15,SCVTSTAT(,@08)                               01S0120 00167000
         BALR  @14,@15                                          01S0120 00168000
*           STORREG=REG2;           /* RESTORE SAVE AREA ADDRESS        00169000
*                                                            @ZMB6772*/ 00170000
         LR    STORREG,REG2                                     01S0121 00171000
*           RFY                                                 01S0122 00172000
*             REG2 UNRSTD;                                      01S0122 00173000
*         END;                      /* END, THIS TASK OWNS TSB       */ 00174000
*       GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);  01S0124 00175000
@RF00112 DS    0H                                               01S0124 00176000
*                                   /* RELEASE LOCAL LOCK            */ 00177000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                          -00178000
               RELATED=(TSB,TSBCLEAN(ENTRY));                           00179000
*     END;                          /* END 'THIS TASKS OWNS TSB'     */ 00180000
*   ELSE                            /* TASK DOES NOT OWN TSB         */ 00181000
*     DO;                           /* PROCESS OTHER TASK OWNS TSB      00182000
*                                                            @ZMB6772*/ 00183000
         B     @RC00108                                         01S0126 00184000
@RF00108 DS    0H                                               01S0127 00185000
*       WORK1REG=XSAASID&NEDMASK;   /* GET ASID, NEDIT FLAG OFF 01S0127 00186000
*                                                            @ZMB6188*/ 00187000
         LH    WORK1REG,XSAASID(,RBSECPTR)                      01S0127 00188000
         N     WORK1REG,@CF02152                                01S0127 00189000
*       IF WORK1REG^=0&             /* ASID SPECIFIED        @ZMB6188*/ 00190000
*           WORK1REG^=ASCBASID&     /* ASID FOR DIFFERENT ADDRESS       00191000
*                                      SPACE                 @ZMB6188*/ 00192000
*           ESTTVCSP^=0 THEN        /* IS THERE A TVCS AREA  @ZMB6772*/ 00193000
         LTR   WORK1REG,WORK1REG                                01S0128 00194000
         BZ    @RF00128                                         01S0128 00195000
         L     @15,ASCBPTR                                      01S0128 00196000
         LH    @15,ASCBASID(,@15)                               01S0128 00197000
         N     @15,@CF02189                                     01S0128 00198000
         CR    WORK1REG,@15                                     01S0128 00199000
         BE    @RF00128                                         01S0128 00200000
         L     @15,ESTTVCSP-1(,RBSECPTR)                        01S0128 00201000
         LA    @15,0(,@15)                                      01S0128 00202000
         LTR   @15,@15                                          01S0128 00203000
         BZ    @RF00128                                         01S0128 00204000
*         DO;                       /* PROCESS CROSS MEMORY TPUT     */ 00205000
*           RFY                                                 01S0130 00206000
*             WORK2REG RSTD;        /* RESTRICT WORK REGISTERS  01S0130 00207000
*                                                            @ZMB6188*/ 00208000
*           WORK1REG=TVCSINDS;      /* FIRST OPERAND FOR CS          */ 00209000
         L     WORK1REG,TVCSINDS(,@15)                          01S0131 00210000
*CSLOOP:                                                        01S0132 00211000
*           WORK2REG=WORK1REG;      /* THIRD OPERAND FOR CS          */ 00212000
CSLOOP   LR    WORK2REG,WORK1REG                                01S0132 00213000
*           IF TVCSTGRC='1'B|ESTSCHED=0 THEN/* IF TARGET HAS GIVEN UP   00214000
*                                      TVCS CONTROL, OR IKTXMTPT HAS    00215000
*                                      NOT BEEN SCHEDULED    @ZMB6772*/ 00216000
         L     @15,ESTTVCSP-1(,RBSECPTR)                        01S0133 00217000
         TM    TVCSTGRC(@15),B'01000000'                        01S0133 00218000
         BO    @RT00133                                         01S0133 00219000
         CLI   ESTSCHED(RBSECPTR),0                             01S0133 00220000
         BNE   @RF00133                                         01S0133 00221000
@RT00133 DS    0H                                               01S0134 00222000
*             DO;                   /* CLEAN UP CROSS MEMORY TPUT    */ 00223000
*               GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);  00224000
*                                   /* OBTAIN CMS LOCK               */ 00225000
         SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,REGS=USE,                 -00226000
               RELATED=(TARGET-TSB)                                     00227000
*               CALL TERMSTAT;      /* CHECK TERMINAL STATUS         */ 00228000
         BAL   @14,TERMSTAT                                     01S0136 00229000
*               IF XSARC^=TERMCNCL THEN/* OTHER TERMINAL STILL THERE?*/ 00230000
         CLI   XSARC(RBSECPTR),20                               01S0137 00231000
         BE    @RF00137                                         01S0137 00232000
*                 DO;               /* RESET TARGET TSB              */ 00233000
*                   TSBXCSAP=0;     /* CLEAR POINTER TO TVCS         */ 00234000
         SLR   @15,@15                                          01S0139 00235000
         L     @08,TSBEXTNT(,TSBPTR)                            01S0139 00236000
         ST    @15,TSBXCSAP(,@08)                               01S0139 00237000
*                   TSBWTJID=0;     /* CLEAR CALLING ASID FIELD      */ 00238000
         STH   @15,TSBWTJID(,TSBPTR)                            01S0140 00239000
*                   TSBWTCB=0;      /* CLEAR CALLING TCB FIELD       */ 00240000
         STCM  @15,7,TSBWTCB(TSBPTR)                            01S0141 00241000
*                 END;              /* END, RESET TARGET TSB         */ 00242000
*               GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);  00243000
@RF00137 DS    0H                                               01S0143 00244000
*                                   /* RELEASE CMS AND LOCAL LOCKS   */ 00245000
         SETLOCK RELEASE,TYPE=CMS,REGS=USE,RELATED=(TARGET-TSB)         00246000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(CMS-LOCK)         00247000
*               CALL FREESTOR;      /* NOW FREE CSA STORAGE          */ 00248000
         BAL   @14,FREESTOR                                     01S0144 00249000
*             END;                  /* END TARGET RELINQUISHED  01S0145 00250000
*                                      CONTROL 'DO'                  */ 00251000
*           ELSE                    /* TARGET HAS TVCS CONTROL       */ 00252000
*             DO;                   /* SET SOURCE RELEASES CONTROL   */ 00253000
         B     @RC00133                                         01S0146 00254000
@RF00133 DS    0H                                               01S0147 00255000
*               GEN SETS(WORK2REG) REFS(SOURCERC)(O  WORK2REG,SOURCERC) 00256000
*                   ;               /* TURN ON TVCSRCRC              */ 00257000
         O  WORK2REG,SOURCERC                                           00258000
*               CS(WORK1REG,WORK2REG,TVCSINDS);/* DO THE COMPARE &      00259000
*                                      SWAP                          */ 00260000
         L     @03,ESTTVCSP-1(,RBSECPTR)                        01S0148 00261000
         CS    WORK1REG,@02,TVCSINDS(@03)                       01S0148 00262000
*               BC(NE,CSLOOP);      /* CONTINUE LOOP IF CS FAILED    */ 00263000
         BC    7,CSLOOP                                         01S0149 00264000
*               GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC)   00265000
*                   (SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(TSB)) 00266000
*                   ;               /* RELEASE LOCAL LOCK            */ 00267000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(TSB)              00268000
*             END;                  /* END OF CS FOR SETTING TVCSRCRC*/ 00269000
*           RFY                                                 01S0152 00270000
*             WORK2REG UNRSTD;      /*                       @ZA19923*/ 00271000
@RC00133 DS    0H                                               01S0153 00272000
*         END;                      /* END, ESTTVCSP^=0      @ZMB6772*/ 00273000
*       ELSE                        /* IF ESTTVCSP=0         @ZMB6772*/ 00274000
*         GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);        00275000
         B     @RC00128                                         01S0154 00276000
@RF00128 DS    0H                                               01S0154 00277000
*                                   /* RELEASE LOCAL LOCK     @ZA19923* 00278000
          SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(TSBCLEAN)        00279000
*     END;                          /* END, TASK DOES NOT OWN TSB       00280000
*                                                            @ZMB6772*/ 00281000
@RC00128 DS    0H                                               01S0156 00282000
*   RTNREG=XSASAVEA;                /* RESTORE RETURN ADDRESS        */ 00283000
@RC00108 L     RTNREG,XSASAVEA(,RBSECPTR)                       01S0156 00284000
*   END TSBCLEAN;                                               01S0157 00285000
@EL00002 DS    0H                                               01S0157 00286000
@EF00002 DS    0H                                               01S0157 00287000
@ER00002 BR    @14                                              01S0157 00288000
         EJECT                                                          00289000
*                                                               01S0158 00290000
*/********************************************************************/ 00291000
*/*                                                                  */ 00292000
*/* SUBROUTINE-                                                      */ 00293000
*/*      FREESTOR                                                    */ 00294000
*/*                                                                  */ 00295000
*/* FUNCTION-                                                        */ 00296000
*/*      COMPLETE CROSS-MEMORY POST, AND FREE CSA AREA               */ 00297000
*/*                                                                  */ 00298000
*/********************************************************************/ 00299000
*                                                               01S0158 00300000
*FREESTOR:                                                      01S0158 00301000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                            01S0158 00302000
FREESTOR DS    0H                                               01S0159 00303000
*   XSASAVEB=RTNREG;                /* SAVE RETURN ADDRESS           */ 00304000
         ST    RTNREG,XSASAVEB(,RBSECPTR)                       01S0159 00305000
*   GEN CODE SETS(REG1) REFS(CVTPTR,CVTSPOST,CVTMAP)(SPOST );/* ISSUE   00306000
*                                      SPOST                         */ 00307000
         SPOST                                                          00308000
*   RFY                                                         01S0161 00309000
*    (REG2,                                                     01S0161 00310000
*     REG7,                                                     01S0161 00311000
*     REG8) RSTD;                                               01S0161 00312000
*   REG2=TVCSSRBA;                  /* GET ADDR FOR SRB FREEMAIN     */ 00313000
         L     @15,ESTTVCSP-1(,RBSECPTR)                        01S0162 00314000
         LA    @15,0(,@15)                                      01S0162 00315000
         L     REG2,TVCSSRBA-1(,@15)                            01S0162 00316000
         LA    REG2,0(,REG2)                                    01S0162 00317000
*   REG7=TVCSGMSZ;                  /* GET SIZE FOR TVCS FREEMAIN    */ 00318000
         LH    REG7,TVCSGMSZ(,@15)                              01S0163 00319000
*   REG8=ESTTVCSP;                  /* GET ADDR FOR TVCS FREEMAIN       00320000
*                                                            @ZMB6772*/ 00321000
         LR    REG8,@15                                         01S0164 00322000
*   GEN CODE SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC); 01S0165 00323000
*                                   /* OBTAIN SALLOC LOCK            */ 00324000
         SETLOCK OBTAIN,TYPE=SALLOC,MODE=UNCOND,REGS=USE,              -00325000
               RELATED=(TVCS,SRB)                                       00326000
*   IF REG2^=0 THEN                 /* IS THERE AN SRB ?             */ 00327000
         LTR   REG2,REG2                                        01S0166 00328000
         BZ    @RF00166                                         01S0166 00329000
*     DO;                           /* YES, FREE IT                  */ 00330000
*       REG0=LENGTH(SRB);           /* GET LENGTH FOR FREEMAIN       */ 00331000
         LA    REG0,44                                          01S0168 00332000
*       GEN SETS(RTNREG,ENTRYREG,REG1,REG3,REG4) REFS(CVTSPSA,CVTMAP,   00333000
*           WSAGGMFM,WSAG,CVTGLMN);                             01S0169 00334000
         FREEMAIN RU,LV=(0),A=(REG2),SP=239,KEY=0,                     -00335000
               BRANCH=(YES,GLOBAL),RELATED=(SRB)                        00336000
*     END;                                                      01S0170 00337000
*   REG0=REG7;                      /* GET LENGTH OF TVCS            */ 00338000
@RF00166 LR    REG0,REG7                                        01S0171 00339000
*   GEN CODE SETS(RTNREG,ENTRYREG,REG1,REG3,REG4) REFS(CVTSPSA,CVTMAP,  00340000
*       WSAGGMFM,WSAG,CVTGLMN);                                 01S0172 00341000
         FREEMAIN RU,LV=(0),A=(REG8),SP=231,KEY=6,                     -00342000
               BRANCH=(YES,GLOBAL),RELATED=(TVCS,SRB)                   00343000
*   GEN CODE SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC); 01S0173 00344000
          SETLOCK RELEASE,TYPE=SALLOC,REGS=USE,RELATED=(TVCS,SRB)       00345000
*   RFY                                                         01S0174 00346000
*     REG2 UNRSTD;                                              01S0174 00347000
*   RTNREG=XSASAVEB;                /* RESTORE RETURN ADDRESS        */ 00348000
         L     RTNREG,XSASAVEB(,RBSECPTR)                       01S0175 00349000
*   END FREESTOR;                                               01S0176 00350000
@EL00003 DS    0H                                               01S0176 00351000
@EF00003 DS    0H                                               01S0176 00352000
@ER00003 BR    @14                                              01S0176 00353000
         EJECT                                                          00354000
*                                                               01S0177 00355000
*/********************************************************************/ 00356000
*/*                                                                  */ 00357000
*/* SUBROUTINE-                                                      */ 00358000
*/*      TERMSTAT                                                    */ 00359000
*/*                                                                  */ 00360000
*/* FUNCTION-                                                        */ 00361000
*/*      DETERMINE STATUS OF TARGET TERMINAL                         */ 00362000
*/*                                                                  */ 00363000
*/********************************************************************/ 00364000
*                                                               01S0177 00365000
*TERMSTAT:                                                      01S0177 00366000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                            01S0177 00367000
TERMSTAT DS    0H                                               01S0178 00368000
*   XSASAVEB=RTNREG;                /* SAVE RETURN ADDRESS           */ 00369000
         ST    RTNREG,XSASAVEB(,RBSECPTR)                       01S0178 00370000
*   XSARC=TERMCNCL;                 /* INITIALIZE RETURN CODE        */ 00371000
         MVI   XSARC(RBSECPTR),X'14'                            01S0179 00372000
*   RFY                                                         01S0180 00373000
*     ASCB BASED(ASVTENTY(XSAASID));/* THE ASVT POINTS TO THE ASCB S    00374000
*                                      ADDRESS. BASE THE ASCB ON THE    00375000
*                                      ENTRY SPECIFIED BY THE ASID   */ 00376000
*   IF CVTTCASP^=0 THEN             /* IS TSO/VTAM UP ? YES IT IS    */ 00377000
         SLR   @15,@15                                          01S0181 00378000
         L     @04,CVTPTR                                       01S0181 00379000
         C     @15,CVTTCASP(,@04)                               01S0181 00380000
         BE    @RF00181                                         01S0181 00381000
*     IF ASVTAVAL(XSAASID)='0'B THEN/* CHECK IF ASID SLOT IN ASVT       00382000
*                                      INDICATES IT IS ASSIGNED      */ 00383000
         LH    @11,XSAASID(,RBSECPTR)                           01S0182 00384000
         SLA   @11,2                                            01S0182 00385000
         L     @04,ASVTPTR(,@04)                                01S0182 00386000
         ALR   @11,@04                                          01S0182 00387000
         TM    ASVTAVAL-4(@11),B'10000000'                      01S0182 00388000
         BNZ   @RF00182                                         01S0182 00389000
*       DO;                                                     01S0183 00390000
*         TSBPTR=ASCBTSB;           /* DEFINE TSB POINTER OF TARGET     00391000
*                                      ADDRESS SPACE                 */ 00392000
         LH    @11,XSAASID(,RBSECPTR)                           01S0184 00393000
         SLA   @11,2                                            01S0184 00394000
         L     @04,ASVTENTY-4(@11,@04)                          01S0184 00395000
         L     TSBPTR,ASCBTSB(,@04)                             01S0184 00396000
*         RFY                                                   01S0185 00397000
*           ASCB BASED(ASCBPTR);    /* NOW RE-BASE ASCB FOR THIS        00398000
*                                      ADDRESS SPACE                 */ 00399000
*         IF TSBPTR^=0&TSBWTJID=ASCBASID THEN/* IS THE ASID STORED      00400000
*                                      THIS ASID?                    */ 00401000
         CR    TSBPTR,@15                                       01S0186 00402000
         BE    @RF00186                                         01S0186 00403000
         L     @15,ASCBPTR                                      01S0186 00404000
         LH    @15,ASCBASID(,@15)                               01S0186 00405000
         N     @15,@CF02189                                     01S0186 00406000
         CH    @15,TSBWTJID(,TSBPTR)                            01S0186 00407000
         BNE   @RF00186                                         01S0186 00408000
*           IF TSBCANC='0'B THEN    /* IF SESSION HAS BEEN CANCELLED */ 00409000
         TM    TSBCANC(TSBPTR),B'00000100'                      01S0187 00410000
         BNZ   @RF00187                                         01S0187 00411000
*             XSARC=CONTINUE;       /* CONTINUE                      */ 00412000
         MVI   XSARC(RBSECPTR),X'00'                            01S0188 00413000
*       END;                                                    01S0189 00414000
@RF00187 DS    0H                                               01S0189 00415000
@RF00186 DS    0H                                               01S0190 00416000
*   RTNREG=XSASAVEB;                /* RESTORE RETURN ADDRESS        */ 00417000
@RF00182 DS    0H                                               01S0190 00418000
@RF00181 L     RTNREG,XSASAVEB(,RBSECPTR)                       01S0190 00419000
*   END TERMSTAT;                                               01S0191 00420000
@EL00004 DS    0H                                               01S0191 00421000
@EF00004 DS    0H                                               01S0191 00422000
@ER00004 BR    @14                                              01S0191 00423000
*   END IKT93EST                                                01S0192 00424000
*                                                               01S0192 00425000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00426000
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */ 00427000
*/*%INCLUDE SYSUT5  (IKT93EST)                                       */ 00428000
*/*%INCLUDE SYSLIB  (IHASDWA )                                       */ 00429000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00430000
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */ 00431000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00432000
*/*%INCLUDE SYSLIB  (IKJTSB  )                                       */ 00433000
*/*%INCLUDE SYSLIB  (IKTTSBX )                                       */ 00434000
*/*%INCLUDE SYSLIB  (IHAASVT )                                       */ 00435000
*/*%INCLUDE SYSLIB  (IHASCVT )                                       */ 00436000
*/*%INCLUDE SYSLIB  (IHARB   )                                       */ 00437000
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */ 00438000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00439000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00440000
*/*%INCLUDE SYSLIB  (IKTTVCS )                                       */ 00441000
*/*%INCLUDE SYSLIB  (IKTXSA  )                                       */ 00442000
*/*%INCLUDE SYSUT5  (TSBCLEAN)                                       */ 00443000
*/*%INCLUDE SYSUT5  (FREESTOR)                                       */ 00444000
*/*%INCLUDE SYSUT5  (TERMSTAT)                                       */ 00445000
*                                                               01S0192 00446000
*       ;                                                       01S0192 00447000
@DATA    DS    0H                                                       00448000
@DATD    DSECT                                                          00449000
         DS    0F                                                       00450000
IKT93EST CSECT                                                          00451000
         DS    0F                                                       00452000
@CF00049 DC    F'8'                                                     00453000
@CF02102 DC    F'12'                                                    00454000
@CF02152 DC    XL4'00007FFF'                                            00455000
@CF02164 DC    XL4'FF000000'                                            00456000
@CF02189 DC    XL4'0000FFFF'                                            00457000
@DATD    DSECT                                                          00458000
         DS    0D                                                       00459000
@ENDDATD EQU   *                                                        00460000
IKT93EST CSECT                                                          00461000
         NOPR  ((@ENDDATD-@DATD)*16)                                    00462000
         DS    0F                                                       00463000
@SIZDATD DC    AL1(0)                                                   00464000
         DC    AL3(@ENDDATD-@DATD)                                      00465000
         DS    0D                                                       00466000
CMPLCODE DC    XL4'15D000'                                              00467000
RESET    DC    XL4'80000000'                                            00468000
SOURCERC DC    XL4'80000000'                                            00469000
QNAME    DC    CL8'SYSZIGGI'                                            00470000
PATCHLBL DS    CL50                                                     00471000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00472000
@01      EQU   01                                                       00473000
@02      EQU   02                                                       00474000
@03      EQU   03                                                       00475000
@04      EQU   04                                                       00476000
@05      EQU   05                                                       00477000
@06      EQU   06                                                       00478000
@07      EQU   07                                                       00479000
@08      EQU   08                                                       00480000
@09      EQU   09                                                       00481000
@10      EQU   10                                                       00482000
@11      EQU   11                                                       00483000
@12      EQU   12                                                       00484000
@13      EQU   13                                                       00485000
@14      EQU   14                                                       00486000
@15      EQU   15                                                       00487000
SDWAPTR  EQU   @06                                                      00488000
TSBPTR   EQU   @09                                                      00489000
RBSECPTR EQU   @05                                                      00490000
REG0     EQU   @00                                                      00491000
REG1     EQU   @01                                                      00492000
WORK1REG EQU   @01                                                      00493000
REG2     EQU   @02                                                      00494000
WORK2REG EQU   @02                                                      00495000
REG3     EQU   @03                                                      00496000
REG4     EQU   @04                                                      00497000
REG7     EQU   @07                                                      00498000
REG8     EQU   @08                                                      00499000
BASEREG  EQU   @12                                                      00500000
STORREG  EQU   @13                                                      00501000
RTNREG   EQU   @14                                                      00502000
ENTRYREG EQU   @15                                                      00503000
RCREG    EQU   @15                                                      00504000
WORK3REG EQU   @03                                                      00505000
PSA      EQU   0                                                        00506000
FLCRNPSW EQU   PSA                                                      00507000
FLCROPSW EQU   PSA+8                                                    00508000
FLCICCW2 EQU   PSA+16                                                   00509000
FLCCVT   EQU   FLCICCW2                                                 00510000
PSAEEPSW EQU   PSA+132                                                  00511000
PSAESPSW EQU   PSA+136                                                  00512000
FLCSVILC EQU   PSAESPSW+1                                               00513000
PSAEPPSW EQU   PSA+140                                                  00514000
FLCPIILC EQU   PSAEPPSW+1                                               00515000
FLCPICOD EQU   PSAEPPSW+2                                               00516000
PSAPICOD EQU   FLCPICOD+1                                               00517000
FLCTEA   EQU   PSAEPPSW+4                                               00518000
FLCPER   EQU   PSA+152                                                  00519000
FLCMCLA  EQU   PSA+168                                                  00520000
FLCIOEL  EQU   FLCMCLA+4                                                00521000
FLCIOA   EQU   FLCMCLA+16                                               00522000
FLCFSA   EQU   FLCMCLA+80                                               00523000
PSAAOLD  EQU   PSA+548                                                  00524000
PSASUPER EQU   PSA+552                                                  00525000
PSASUP1  EQU   PSASUPER                                                 00526000
PSASUP2  EQU   PSASUPER+1                                               00527000
PSASUP3  EQU   PSASUPER+2                                               00528000
PSASUP4  EQU   PSASUPER+3                                               00529000
PSACLHT  EQU   PSA+640                                                  00530000
PSALKSA  EQU   PSA+696                                                  00531000
PSAHLHI  EQU   PSA+760                                                  00532000
PSALITA  EQU   PSA+764                                                  00533000
PSADSSFL EQU   PSA+836                                                  00534000
PSADSSF1 EQU   PSADSSFL                                                 00535000
PSADSSF3 EQU   PSADSSFL+2                                               00536000
PSADSSF4 EQU   PSADSSFL+3                                               00537000
PSARSVT  EQU   PSA+896                                                  00538000
SDWA     EQU   0                                                        00539000
SDWAPARM EQU   SDWA                                                     00540000
SDWAFIOB EQU   SDWA+4                                                   00541000
SDWAABCC EQU   SDWAFIOB                                                 00542000
SDWACMPF EQU   SDWAABCC                                                 00543000
SDWACMPC EQU   SDWAABCC+1                                               00544000
SDWACTL1 EQU   SDWA+8                                                   00545000
SDWACMKA EQU   SDWACTL1                                                 00546000
SDWAMWPA EQU   SDWACTL1+1                                               00547000
SDWAPMKA EQU   SDWACTL1+4                                               00548000
SDWACTL2 EQU   SDWA+16                                                  00549000
SDWACMKP EQU   SDWACTL2                                                 00550000
SDWAMWPP EQU   SDWACTL2+1                                               00551000
SDWAPMKP EQU   SDWACTL2+4                                               00552000
SDWAGRSV EQU   SDWA+24                                                  00553000
SDWANAME EQU   SDWA+88                                                  00554000
SDWAEC1  EQU   SDWA+104                                                 00555000
SDWAEMK1 EQU   SDWAEC1                                                  00556000
SDWAMWP1 EQU   SDWAEC1+1                                                00557000
SDWAINT1 EQU   SDWAEC1+2                                                00558000
SDWANXT1 EQU   SDWAEC1+4                                                00559000
SDWAAEC1 EQU   SDWA+112                                                 00560000
SDWAILC1 EQU   SDWAAEC1+1                                               00561000
SDWAINC1 EQU   SDWAAEC1+2                                               00562000
SDWAICD1 EQU   SDWAINC1+1                                               00563000
SDWAEC2  EQU   SDWA+120                                                 00564000
SDWAEMK2 EQU   SDWAEC2                                                  00565000
SDWAMWP2 EQU   SDWAEC2+1                                                00566000
SDWAINT2 EQU   SDWAEC2+2                                                00567000
SDWANXT2 EQU   SDWAEC2+4                                                00568000
SDWAAEC2 EQU   SDWA+128                                                 00569000
SDWAILC2 EQU   SDWAAEC2+1                                               00570000
SDWAINC2 EQU   SDWAAEC2+2                                               00571000
SDWAICD2 EQU   SDWAINC2+1                                               00572000
SDWASRSV EQU   SDWA+136                                                 00573000
SDWAIDNT EQU   SDWA+200                                                 00574000
SDWAMCH  EQU   SDWA+204                                                 00575000
SDWASTCK EQU   SDWAMCH                                                  00576000
SDWAMCHI EQU   SDWAMCH+8                                                00577000
SDWAMCHS EQU   SDWAMCHI                                                 00578000
SDWAMCHD EQU   SDWAMCHI+1                                               00579000
SDWARSR1 EQU   SDWAMCH+12                                               00580000
SDWARSR2 EQU   SDWAMCH+13                                               00581000
SDWAFLGS EQU   SDWA+232                                                 00582000
SDWAERRA EQU   SDWAFLGS                                                 00583000
SDWAPCHK EQU   SDWAERRA                                                 00584000
SDWAERRB EQU   SDWAFLGS+1                                               00585000
SDWAERRC EQU   SDWAFLGS+2                                               00586000
SDWAERRD EQU   SDWAFLGS+3                                               00587000
SDWAIOFS EQU   SDWA+238                                                 00588000
SDWARTYA EQU   SDWA+240                                                 00589000
SDWACPUA EQU   SDWA+248                                                 00590000
SDWAPARQ EQU   SDWA+252                                                 00591000
SDWARCDE EQU   SDWAPARQ                                                 00592000
SDWAACF2 EQU   SDWAPARQ+1                                               00593000
SDWAACF3 EQU   SDWAPARQ+2                                               00594000
SDWAACF4 EQU   SDWAPARQ+3                                               00595000
SDWALKWA EQU   SDWA+256                                                 00596000
SDWALKWS EQU   SDWALKWA                                                 00597000
SDWARECP EQU   SDWA+292                                                 00598000
SDWASNPA EQU   SDWA+320                                                 00599000
SDWADUMP EQU   SDWASNPA                                                 00600000
SDWADPFS EQU   SDWADUMP+1                                               00601000
SDWADDAT EQU   SDWASNPA+4                                               00602000
SDWASDAT EQU   SDWADDAT                                                 00603000
SDWAPDAT EQU   SDWADDAT+2                                               00604000
SDWADPSA EQU   SDWA+328                                                 00605000
SDWADPSL EQU   SDWADPSA                                                 00606000
SDWARA   EQU   SDWA+400                                                 00607000
SDWADPVA EQU   SDWARA+2                                                 00608000
CVTMAP   EQU   0                                                        00609000
CVTTCBP  EQU   CVTMAP                                                   00610000
CVTDAR   EQU   CVTMAP+72                                                00611000
CVTFLGS1 EQU   CVTDAR                                                   00612000
CVTDCB   EQU   CVTMAP+116                                               00613000
CVTIERLC EQU   CVTMAP+144                                               00614000
CVTOPTA  EQU   CVTMAP+182                                               00615000
CVTOPTB  EQU   CVTMAP+183                                               00616000
CVTABEND EQU   CVTMAP+200                                               00617000
CVTGTF   EQU   CVTMAP+236                                               00618000
CVTGTFST EQU   CVTGTF                                                   00619000
CVTGTFS  EQU   CVTGTFST                                                 00620000
CVTSTATE EQU   CVTGTFST                                                 00621000
CVTTMODE EQU   CVTGTFST                                                 00622000
CVTFORM  EQU   CVTGTFST                                                 00623000
CVTAQAVT EQU   CVTMAP+240                                               00624000
CVTTCMFG EQU   CVTAQAVT                                                 00625000
CVTVOLM2 EQU   CVTMAP+244                                               00626000
CVTTATA  EQU   CVTVOLM2                                                 00627000
CVTTSKS  EQU   CVTTATA                                                  00628000
CVTVOLF2 EQU   CVTTSKS                                                  00629000
CVTTAT   EQU   CVTTATA+1                                                00630000
CVTATER  EQU   CVTMAP+248                                               00631000
CVTEXT1  EQU   CVTMAP+252                                               00632000
CVTPURG  EQU   CVTMAP+260                                               00633000
CVTQMSG  EQU   CVTMAP+268                                               00634000
CVTDMSR  EQU   CVTMAP+272                                               00635000
CVTRSV37 EQU   CVTDMSR                                                  00636000
CVTDMSRF EQU   CVTRSV37                                                 00637000
CVTERPV  EQU   CVTMAP+316                                               00638000
CVTINTLA EQU   CVTMAP+320                                               00639000
CVTAPF   EQU   CVTMAP+324                                               00640000
CVTEXT2  EQU   CVTMAP+328                                               00641000
CVTHJES  EQU   CVTMAP+332                                               00642000
CVTPGSIA EQU   CVTMAP+348                                               00643000
CVTA1F1  EQU   CVTMAP+356                                               00644000
CVTSYSK  EQU   CVTMAP+357                                               00645000
CVTVOLM1 EQU   CVTMAP+380                                               00646000
CVTVOLF1 EQU   CVTVOLM1                                                 00647000
CVTXTNT1 EQU   0                                                        00648000
CVTXTNT2 EQU   0                                                        00649000
CVTDSSV  EQU   CVTXTNT2                                                 00650000
CVTFLGBT EQU   CVTXTNT2+5                                               00651000
CVTQID   EQU   CVTXTNT2+24                                              00652000
CVTRV400 EQU   CVTXTNT2+52                                              00653000
CVTRV409 EQU   CVTXTNT2+53                                              00654000
CVTATCVT EQU   CVTXTNT2+64                                              00655000
CVTRV429 EQU   CVTXTNT2+84                                              00656000
CVTRV438 EQU   CVTXTNT2+85                                              00657000
CVTRV457 EQU   CVTXTNT2+112                                             00658000
CVTRV466 EQU   CVTXTNT2+113                                             00659000
CVTFIX   EQU   0                                                        00660000
CVTRELNO EQU   CVTFIX+252                                               00661000
WSAG     EQU   0                                                        00662000
WSAGGMFM EQU   WSAG+4                                                   00663000
ASCB     EQU   0                                                        00664000
ASCBSUPC EQU   ASCB+16                                                  00665000
ASCBASID EQU   ASCB+36                                                  00666000
ASCBTSB  EQU   ASCB+60                                                  00667000
ASCBFW1  EQU   ASCB+100                                                 00668000
ASCBRCTF EQU   ASCBFW1+2                                                00669000
ASCBFLG1 EQU   ASCBFW1+3                                                00670000
ASCBDSP1 EQU   ASCB+114                                                 00671000
ASCBFLG2 EQU   ASCB+115                                                 00672000
ASCBLKGP EQU   ASCB+128                                                 00673000
ASCBSRQ  EQU   ASCB+180                                                 00674000
ASCBSRQ1 EQU   ASCBSRQ                                                  00675000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00676000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00677000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00678000
TSB      EQU   0                                                        00679000
TSBASCBA EQU   TSB                                                      00680000
TSBSTAT  EQU   TSBASCBA                                                 00681000
TSBFLG1  EQU   TSB+4                                                    00682000
TSBOWIP  EQU   TSBFLG1                                                  00683000
TSBWOWIP EQU   TSBFLG1                                                  00684000
TSBWTCB  EQU   TSB+5                                                    00685000
TSBFLG2  EQU   TSB+16                                                   00686000
TSBFLG3  EQU   TSB+24                                                   00687000
TSBFLG5  EQU   TSB+25                                                   00688000
TSBTERMC EQU   TSB+26                                                   00689000
TSBTERM1 EQU   TSBTERMC                                                 00690000
TSBTERM2 EQU   TSBTERMC+1                                               00691000
TSBWTJID EQU   TSB+32                                                   00692000
TSBSTCC  EQU   TSB+34                                                   00693000
TSBFLG4  EQU   TSB+41                                                   00694000
TSBCANC  EQU   TSBFLG4                                                  00695000
TSBCTCB  EQU   TSB+60                                                   00696000
TSBRCB   EQU   TSB+64                                                   00697000
TSBLINKA EQU   TSBRCB+4                                                 00698000
TSBTPOST EQU   TSB+72                                                   00699000
TSBTPFLG EQU   TSBTPOST                                                 00700000
TSBMINL  EQU   TSB+84                                                   00701000
TSBEXTNT EQU   TSB+96                                                   00702000
TSBX     EQU   0                                                        00703000
TSBXFLG1 EQU   TSBX+32                                                  00704000
TSBXTIM  EQU   TSBX+40                                                  00705000
TSBXTOM  EQU   TSBX+44                                                  00706000
TSBXCSAP EQU   TSBX+60                                                  00707000
TSBXTERM EQU   TSBX+72                                                  00708000
ASVT     EQU   0                                                        00709000
ASVTFRST EQU   ASVT+524                                                 00710000
ASVTENTY EQU   ASVT+528                                                 00711000
ASVTAVAL EQU   ASVTENTY                                                 00712000
SCVTSECT EQU   0                                                        00713000
SCVTSTAT EQU   SCVTSECT+148                                             00714000
RBPRFX   EQU   0                                                        00715000
RBBASIC  EQU   0                                                        00716000
RBEXRTNM EQU   RBBASIC                                                  00717000
RBTMFLD  EQU   RBEXRTNM                                                 00718000
RBSTAB   EQU   RBBASIC+10                                               00719000
XSTAB    EQU   RBSTAB                                                   00720000
RBSTAB1  EQU   XSTAB                                                    00721000
XSTAB1   EQU   RBSTAB1                                                  00722000
RBFTCKPT EQU   XSTAB1                                                   00723000
RBSTAB2  EQU   XSTAB+1                                                  00724000
XSTAB2   EQU   RBSTAB2                                                  00725000
RBTCBNXT EQU   XSTAB2                                                   00726000
RBFACTV  EQU   XSTAB2                                                   00727000
RBFDYN   EQU   XSTAB2                                                   00728000
RBECBWT  EQU   XSTAB2                                                   00729000
RBOPSW   EQU   RBBASIC+16                                               00730000
XRBPSW   EQU   RBOPSW                                                   00731000
RBOPSWB2 EQU   XRBPSW+1                                                 00732000
RBLINK   EQU   RBBASIC+28                                               00733000
XRBLNK   EQU   RBLINK                                                   00734000
RBWCF    EQU   XRBLNK                                                   00735000
RBLINKB  EQU   XRBLNK+1                                                 00736000
RBGRSAVE EQU   RBBASIC+32                                               00737000
XRBREG   EQU   RBGRSAVE                                                 00738000
RBGRS0   EQU   XRBREG                                                   00739000
RBGRS1   EQU   XRBREG+4                                                 00740000
RBGRS2   EQU   XRBREG+8                                                 00741000
RBGRS3   EQU   XRBREG+12                                                00742000
RBGRS4   EQU   XRBREG+16                                                00743000
RBGRS5   EQU   XRBREG+20                                                00744000
RBGRS6   EQU   XRBREG+24                                                00745000
RBGRS7   EQU   XRBREG+28                                                00746000
RBGRS8   EQU   XRBREG+32                                                00747000
RBGRS9   EQU   XRBREG+36                                                00748000
RBGRS10  EQU   XRBREG+40                                                00749000
RBGRS11  EQU   XRBREG+44                                                00750000
RBGRS12  EQU   XRBREG+48                                                00751000
RBGRS13  EQU   XRBREG+52                                                00752000
RBGRS14  EQU   XRBREG+56                                                00753000
RBGRS15  EQU   XRBREG+60                                                00754000
XRBESA   EQU   RBBASIC+96                                               00755000
RBEXSAVE EQU   XRBESA                                                   00756000
RBPREFIX EQU   0                                                        00757000
RBRSV019 EQU   RBPREFIX+14                                              00758000
RBRSV028 EQU   RBPREFIX+15                                              00759000
RBRSV041 EQU   RBPREFIX+27                                              00760000
RBRSV054 EQU   RBPREFIX+39                                              00761000
RBRTOPSW EQU   RBPREFIX+40                                              00762000
RBRTPSW2 EQU   RBRTOPSW+8                                               00763000
RBRTICIL EQU   RBRTPSW2                                                 00764000
RBFLAGS1 EQU   RBPREFIX+56                                              00765000
RBINTCDA EQU   RBPREFIX+61                                              00766000
RBSECT   EQU   0                                                        00767000
RBPPSAV  EQU   RBSECT                                                   00768000
@NM00110 EQU   RBSECT+10                                                00769000
@NM00111 EQU   @NM00110                                                 00770000
RBTRSVRB EQU   @NM00111                                                 00771000
@NM00113 EQU   @NM00110+1                                               00772000
RBETXR   EQU   @NM00113                                                 00773000
RBEP     EQU   RBSECT+12                                                00774000
RBPGMQ   EQU   RBSECT+24                                                00775000
@NM00120 EQU   RBSECT+28                                                00776000
@NM00121 EQU   @NM00120                                                 00777000
IRBEND   EQU   RBSECT+96                                                00778000
@NM00124 EQU   RBSECT+96                                                00779000
RBRSV138 EQU   @NM00124+7                                               00780000
RBSCBB   EQU   RBSECT+144                                               00781000
RBSPARM  EQU   RBSCBB+8                                                 00782000
RBSFLGS1 EQU   RBSPARM                                                  00783000
RBSIOPRC EQU   RBSFLGS1                                                 00784000
RBSOWNR  EQU   RBSCBB+12                                                00785000
RBSFLGS2 EQU   RBSOWNR                                                  00786000
RBSDATA  EQU   RBSCBB+16                                                00787000
RBSFLG3  EQU   RBSDATA                                                  00788000
RBRSV150 EQU   RBSECT+167                                               00789000
SRBSECT  EQU   0                                                        00790000
SRBFLC   EQU   SRBSECT+12                                               00791000
TVCS     EQU   0                                                        00792000
TVCSECB  EQU   TVCS+96                                                  00793000
TVCSGMSZ EQU   TVCS+102                                                 00794000
TVCSOPTN EQU   TVCS+104                                                 00795000
TVCSSRBA EQU   TVCS+105                                                 00796000
TVCSINDS EQU   TVCS+112                                                 00797000
TVCSTGRC EQU   TVCSINDS                                                 00798000
ESTAESA  EQU   12                                                       00799000
STATUS   EQU   0                                                        00800000
CURNTTCB EQU   4                                                        00801000
CVTPTR   EQU   FLCCVT                                                   00802000
CVTS01   EQU   CVTPGSIA                                                 00803000
CVTLPDIA EQU   CVTS01+12                                                00804000
CVTDIRST EQU   CVTLPDIA                                                 00805000
CVTSLIDA EQU   CVTS01+24                                                00806000
CVTCTLFG EQU   CVTS01+50                                                00807000
CVTASVT  EQU   CVTS01+208                                               00808000
CVTGLMN  EQU   CVTS01+332                                               00809000
CVTSPSA  EQU   CVTS01+336                                               00810000
CVTSPOST EQU   CVTS01+364                                               00811000
CVTRV210 EQU   CVTS01+424                                               00812000
CVTRV219 EQU   CVTS01+425                                               00813000
CVTRV228 EQU   CVTS01+426                                               00814000
CVTRV237 EQU   CVTS01+427                                               00815000
CVTMFRTR EQU   CVTS01+452                                               00816000
CVTRV262 EQU   CVTS01+468                                               00817000
CVTRV271 EQU   CVTS01+469                                               00818000
CVTRV280 EQU   CVTS01+470                                               00819000
CVTRV289 EQU   CVTS01+471                                               00820000
CVTGSDA  EQU   CVTS01+600                                               00821000
CVTTCASP EQU   CVTS01+664                                               00822000
ASCBPTR  EQU   PSAAOLD                                                  00823000
ASVTPTR  EQU   CVTASVT                                                  00824000
SCVTSPTR EQU   CVTABEND                                                 00825000
RBSECS03 EQU   RBEP                                                     00826000
RBCDE    EQU   RBSECS03                                                 00827000
RBCDFLGS EQU   RBCDE                                                    00828000
RBSECS05 EQU   RBPGMQ                                                   00829000
RBSQE    EQU   RBSECS05                                                 00830000
RBSECS06 EQU   RBPGMQ                                                   00831000
RBIQE    EQU   RBSECS06                                                 00832000
RBSECS07 EQU   RBPGMQ                                                   00833000
RBIQE2   EQU   RBSECS07                                                 00834000
RBSECS08 EQU   IRBEND                                                   00835000
RBSECS09 EQU   IRBEND                                                   00836000
SRBPTR   EQU   TVCSSRBA                                                 00837000
SRB      EQU   SRBSECT                                                  00838000
FLC      EQU   PSA                                                      00839000
PSARSVTE EQU   PSARSVT                                                  00840000
IKTXSA   EQU   RBEXSAVE                                                 00841000
XSAPRM0  EQU   IKTXSA                                                   00842000
XSAASID  EQU   XSAPRM0                                                  00843000
XSAPRM1  EQU   IKTXSA+4                                                 00844000
XSAOPTNS EQU   XSAPRM1                                                  00845000
XSAPTGT  EQU   XSAOPTNS                                                 00846000
XSAWD3   EQU   IKTXSA+8                                                 00847000
XSAFLAG  EQU   XSAWD3                                                   00848000
XSAIDENQ EQU   XSAFLAG                                                  00849000
XSADMOVE EQU   XSAFLAG                                                  00850000
XSAWD4   EQU   IKTXSA+12                                                00851000
XSASAVEA EQU   XSAWD4                                                   00852000
XSAENQAD EQU   IKTXSA+16                                                00853000
XSAWD5   EQU   XSAENQAD                                                 00854000
XSAWD8   EQU   IKTXSA+28                                                00855000
XSASAVEB EQU   XSAWD8                                                   00856000
XSAUSERP EQU   IKTXSA+32                                                00857000
XSARETG  EQU   IKTXSA+36                                                00858000
XSAWD11  EQU   IKTXSA+40                                                00859000
XSARC    EQU   XSAWD11                                                  00860000
XSAWD12  EQU   IKTXSA+44                                                00861000
ESTXSA12 EQU   XSAWD12                                                  00862000
ESTSCHED EQU   ESTXSA12                                                 00863000
ESTTVCSP EQU   ESTXSA12+1                                               00864000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00865000
XSABUFAD EQU   XSAWD12                                                  00866000
XSAIDAS  EQU   XSAWD11+2                                                00867000
@NM00156 EQU   XSAWD11+1                                                00868000
XSAWD10  EQU   XSARETG                                                  00869000
XSAWD9   EQU   XSAUSERP                                                 00870000
XSAWD7   EQU   XSAENQAD+8                                               00871000
XSAWD6   EQU   XSAENQAD+4                                               00872000
XSATCBA  EQU   XSAWD3+1                                                 00873000
XSARETY  EQU   XSAFLAG                                                  00874000
XSAAUTH  EQU   XSAFLAG                                                  00875000
XSALOCKS EQU   XSAFLAG                                                  00876000
XSADATVF EQU   XSAFLAG                                                  00877000
XSADOSWT EQU   XSAFLAG                                                  00878000
XSATCBFX EQU   XSAFLAG                                                  00879000
XSABFRAD EQU   XSAPRM1+1                                                00880000
XSAEDITO EQU   XSAOPTNS                                                 00881000
XSABRK   EQU   XSAOPTNS                                                 00882000
XSAHOLD  EQU   XSAOPTNS                                                 00883000
XSANOWT  EQU   XSAOPTNS                                                 00884000
XSAPRIOR EQU   XSAOPTNS                                                 00885000
XSAUSRID EQU   XSAOPTNS                                                 00886000
XSAPRMSZ EQU   XSAPRM0+2                                                00887000
@NM00155 EQU   XSAASID                                                  00888000
XSANEDIT EQU   XSAASID                                                  00889000
PSARSAV  EQU   PSARSVTE+60                                              00890000
PSARSTK  EQU   PSARSVTE+56                                              00891000
PSAESAV3 EQU   PSARSVTE+52                                              00892000
PSAESTK3 EQU   PSARSVTE+48                                              00893000
PSAESAV2 EQU   PSARSVTE+44                                              00894000
PSAESTK2 EQU   PSARSVTE+40                                              00895000
PSAESAV1 EQU   PSARSVTE+36                                              00896000
PSAESTK1 EQU   PSARSVTE+32                                              00897000
PSAPSAV  EQU   PSARSVTE+28                                              00898000
PSAPSTK  EQU   PSARSVTE+24                                              00899000
PSAMSAV  EQU   PSARSVTE+20                                              00900000
PSAMSTK  EQU   PSARSVTE+16                                              00901000
PSASSAV  EQU   PSARSVTE+12                                              00902000
PSASSTK  EQU   PSARSVTE+8                                               00903000
PSANSTK  EQU   PSARSVTE+4                                               00904000
PSACSTK  EQU   PSARSVTE                                                 00905000
RBRSV161 EQU   RBSECS09+64                                              00906000
RBSIRBWA EQU   RBSECS09                                                 00907000
RBIQEWRK EQU   RBSECS08+4                                               00908000
RBNEXAV  EQU   RBSECS08                                                 00909000
RBIQEA   EQU   RBIQE2                                                   00910000
RBIQE1   EQU   RBIQE+1                                                  00911000
RBUSE    EQU   RBIQE                                                    00912000
RBSQEA   EQU   RBSQE+1                                                  00913000
@NM00125 EQU   RBSQE                                                    00914000
RBCDE1   EQU   RBCDE+1                                                  00915000
RBCDLOAD EQU   RBCDFLGS                                                 00916000
RBCDXCTL EQU   RBCDFLGS                                                 00917000
RBCDSYNC EQU   RBCDFLGS                                                 00918000
RBCDNODE EQU   RBCDFLGS                                                 00919000
RBRSV010 EQU   RBCDFLGS                                                 00920000
RBCDATCH EQU   RBCDFLGS                                                 00921000
RBRSV009 EQU   RBCDFLGS                                                 00922000
RBNOCELL EQU   RBCDFLGS                                                 00923000
CVTRV628 EQU   CVTS01+728                                               00924000
CVTRV627 EQU   CVTS01+724                                               00925000
CVTRV626 EQU   CVTS01+720                                               00926000
CVTRV625 EQU   CVTS01+716                                               00927000
CVTRV624 EQU   CVTS01+712                                               00928000
CVTRV623 EQU   CVTS01+708                                               00929000
CVTRV622 EQU   CVTS01+704                                               00930000
CVTRV621 EQU   CVTS01+700                                               00931000
CVTIHASU EQU   CVTS01+696                                               00932000
CVTSUSP  EQU   CVTS01+692                                               00933000
CVTT6SVC EQU   CVTS01+688                                               00934000
CVTCDAL  EQU   CVTS01+684                                               00935000
CVTTCTL  EQU   CVTS01+680                                               00936000
CVTRSUME EQU   CVTS01+676                                               00937000
CVTJTERM EQU   CVTS01+672                                               00938000
CVTASMRM EQU   CVTS01+668                                               00939000
CVT0PT03 EQU   CVTS01+660                                               00940000
CVT0PT0E EQU   CVTS01+656                                               00941000
CVTRV609 EQU   CVTS01+652                                               00942000
CVTCGK   EQU   CVTS01+648                                               00943000
CVTRAC   EQU   CVTS01+644                                               00944000
CVTRV606 EQU   CVTS01+640                                               00945000
CVTRV605 EQU   CVTS01+636                                               00946000
CVTRV604 EQU   CVTS01+632                                               00947000
CVTEFF02 EQU   CVTS01+628                                               00948000
CVTCBBR  EQU   CVTS01+624                                               00949000
CVTSSCR  EQU   CVTS01+620                                               00950000
CVTEVENT EQU   CVTS01+616                                               00951000
CVTCRCA  EQU   CVTS01+612                                               00952000
CVTTPIO  EQU   CVTS01+608                                               00953000
CVTADV   EQU   CVTS01+604                                               00954000
CVTGSDAB EQU   CVTGSDA                                                  00955000
CVTQV3   EQU   CVTS01+596                                               00956000
CVTQV2   EQU   CVTS01+592                                               00957000
CVTQV1   EQU   CVTS01+588                                               00958000
CVTRPT   EQU   CVTS01+584                                               00959000
CVTSSRB  EQU   CVTS01+580                                               00960000
CVTCSDRL EQU   CVTS01+576                                               00961000
CVTEXP1  EQU   CVTS01+572                                               00962000
CVTRMPMT EQU   CVTS01+568                                               00963000
CVTRMPTT EQU   CVTS01+564                                               00964000
CVTVPSA  EQU   CVTS01+560                                               00965000
CVTVSTOP EQU   CVTS01+556                                               00966000
CVTGTFR8 EQU   CVTS01+552                                               00967000
CVTQUIT  EQU   CVTS01+548                                               00968000
CVTVACR  EQU   CVTS01+544                                               00969000
CVTWTCB  EQU   CVTS01+540                                               00970000
CVTSTPRS EQU   CVTS01+536                                               00971000
CVT0PT02 EQU   CVTS01+532                                               00972000
CVTDARCM EQU   CVTS01+528                                               00973000
CVTIRECM EQU   CVTS01+524                                               00974000
CVTJRECM EQU   CVTS01+520                                               00975000
CVTVEMS0 EQU   CVTS01+516                                               00976000
CVTSPFRR EQU   CVTS01+512                                               00977000
CVTRLSTG EQU   CVTS01+508                                               00978000
CVT0TC0A EQU   CVTS01+504                                               00979000
CVTGMBR  EQU   CVTS01+500                                               00980000
CVTLFRM  EQU   CVTS01+496                                               00981000
CVTRMBR  EQU   CVTS01+492                                               00982000
CVTVIOP  EQU   CVTS01+488                                               00983000
CVTRV307 EQU   CVTS01+486                                               00984000
CVTRV306 EQU   CVTS01+484                                               00985000
CVTRV305 EQU   CVTS01+482                                               00986000
CVTRV304 EQU   CVTS01+480                                               00987000
CVTRV303 EQU   CVTS01+478                                               00988000
CVTRV302 EQU   CVTS01+476                                               00989000
CVTTRCA  EQU   CVTS01+472                                               00990000
CVTRV297 EQU   CVTRV289                                                 00991000
CVTRV296 EQU   CVTRV289                                                 00992000
CVTRV295 EQU   CVTRV289                                                 00993000
CVTRV294 EQU   CVTRV289                                                 00994000
CVTRV293 EQU   CVTRV289                                                 00995000
CVTRV292 EQU   CVTRV289                                                 00996000
CVTRV291 EQU   CVTRV289                                                 00997000
CVTRV290 EQU   CVTRV289                                                 00998000
CVTRV288 EQU   CVTRV280                                                 00999000
CVTRV287 EQU   CVTRV280                                                 01000000
CVTRV286 EQU   CVTRV280                                                 01001000
CVTRV285 EQU   CVTRV280                                                 01002000
CVTRV284 EQU   CVTRV280                                                 01003000
CVTRV283 EQU   CVTRV280                                                 01004000
CVTRV282 EQU   CVTRV280                                                 01005000
CVTRV281 EQU   CVTRV280                                                 01006000
CVTRV279 EQU   CVTRV271                                                 01007000
CVTRV278 EQU   CVTRV271                                                 01008000
CVTRV277 EQU   CVTRV271                                                 01009000
CVTRV276 EQU   CVTRV271                                                 01010000
CVTRV275 EQU   CVTRV271                                                 01011000
CVTRV274 EQU   CVTRV271                                                 01012000
CVTRV273 EQU   CVTRV271                                                 01013000
CVTRV272 EQU   CVTRV271                                                 01014000
CVTRV270 EQU   CVTRV262                                                 01015000
CVTRV269 EQU   CVTRV262                                                 01016000
CVTRV268 EQU   CVTRV262                                                 01017000
CVTRV267 EQU   CVTRV262                                                 01018000
CVTRV266 EQU   CVTRV262                                                 01019000
CVTRV265 EQU   CVTRV262                                                 01020000
CVTRV264 EQU   CVTRV262                                                 01021000
CVTRV263 EQU   CVTRV262                                                 01022000
CVTVFP   EQU   CVTS01+464                                               01023000
CVTVSI   EQU   CVTS01+460                                               01024000
CVTVPSIB EQU   CVTS01+456                                               01025000
CVTMFACT EQU   CVTMFRTR                                                 01026000
CVTMFCTL EQU   CVTS01+448                                               01027000
CVTPVBP  EQU   CVTS01+444                                               01028000
CVTPWI   EQU   CVTS01+440                                               01029000
CVTRV254 EQU   CVTS01+438                                               01030000
CVTRV253 EQU   CVTS01+436                                               01031000
CVTRV252 EQU   CVTS01+434                                               01032000
CVTRV251 EQU   CVTS01+433                                               01033000
CVTRV250 EQU   CVTS01+432                                               01034000
CVTRV249 EQU   CVTS01+431                                               01035000
CVTRV248 EQU   CVTS01+430                                               01036000
CVTRV247 EQU   CVTS01+429                                               01037000
CVTRV246 EQU   CVTS01+428                                               01038000
CVTRV245 EQU   CVTRV237                                                 01039000
CVTRV244 EQU   CVTRV237                                                 01040000
CVTRV243 EQU   CVTRV237                                                 01041000
CVTRV242 EQU   CVTRV237                                                 01042000
CVTRV241 EQU   CVTRV237                                                 01043000
CVTRV240 EQU   CVTRV237                                                 01044000
CVTRV239 EQU   CVTRV237                                                 01045000
CVTRV238 EQU   CVTRV237                                                 01046000
CVTRV236 EQU   CVTRV228                                                 01047000
CVTRV235 EQU   CVTRV228                                                 01048000
CVTRV234 EQU   CVTRV228                                                 01049000
CVTRV233 EQU   CVTRV228                                                 01050000
CVTRV232 EQU   CVTRV228                                                 01051000
CVTRV231 EQU   CVTRV228                                                 01052000
CVTRV230 EQU   CVTRV228                                                 01053000
CVTRV229 EQU   CVTRV228                                                 01054000
CVTRV227 EQU   CVTRV219                                                 01055000
CVTRV226 EQU   CVTRV219                                                 01056000
CVTRV225 EQU   CVTRV219                                                 01057000
CVTRV224 EQU   CVTRV219                                                 01058000
CVTRV223 EQU   CVTRV219                                                 01059000
CVTRV222 EQU   CVTRV219                                                 01060000
CVTRV221 EQU   CVTRV219                                                 01061000
CVTRV220 EQU   CVTRV219                                                 01062000
CVTRV218 EQU   CVTRV210                                                 01063000
CVTRV217 EQU   CVTRV210                                                 01064000
CVTRV216 EQU   CVTRV210                                                 01065000
CVTRV215 EQU   CVTRV210                                                 01066000
CVTRV214 EQU   CVTRV210                                                 01067000
CVTRV213 EQU   CVTRV210                                                 01068000
CVTRV212 EQU   CVTRV210                                                 01069000
CVTRV211 EQU   CVTRV210                                                 01070000
CVTLCCAT EQU   CVTS01+420                                               01071000
CVTPCCAT EQU   CVTS01+416                                               01072000
CVTIPCRP EQU   CVTS01+412                                               01073000
CVTIPCRI EQU   CVTS01+408                                               01074000
CVTIPCDS EQU   CVTS01+404                                               01075000
CVTAIDVT EQU   CVTS01+400                                               01076000
CVTSSAP  EQU   CVTS01+396                                               01077000
CVTEHCIR EQU   CVTS01+392                                               01078000
CVTEHDEF EQU   CVTS01+388                                               01079000
CVTDAIR  EQU   CVTS01+384                                               01080000
CVTPERFM EQU   CVTS01+380                                               01081000
CVT044R2 EQU   CVTS01+376                                               01082000
CVTFETCH EQU   CVTS01+372                                               01083000
CVTRSTWD EQU   CVTS01+368                                               01084000
CVTIOBP  EQU   CVTS01+360                                               01085000
CVTASMVT EQU   CVTS01+356                                               01086000
CVTRECRQ EQU   CVTS01+352                                               01087000
CVTWSAC  EQU   CVTS01+348                                               01088000
CVTRV149 EQU   CVTS01+344                                               01089000
CVTWSAL  EQU   CVTS01+340                                               01090000
CVTVEAC0 EQU   CVTS01+328                                               01091000
CVT062R1 EQU   CVTS01+324                                               01092000
CVTRPOST EQU   CVTS01+320                                               01093000
CVTDQIQE EQU   CVTS01+316                                               01094000
CVTCSD   EQU   CVTS01+312                                               01095000
CVTLKRMA EQU   CVTS01+308                                               01096000
CVTRSPIE EQU   CVTS01+304                                               01097000
CVTRENQ  EQU   CVTS01+300                                               01098000
CVTLQCB  EQU   CVTS01+296                                               01099000
CVTFQCB  EQU   CVTS01+292                                               01100000
CVTQCS01 EQU   CVTS01+288                                               01101000
CVTAPFT  EQU   CVTS01+284                                               01102000
CVTPARRL EQU   CVTS01+280                                               01103000
CVTVWAIT EQU   CVTS01+276                                               01104000
CVTGSPL  EQU   CVTS01+272                                               01105000
CVTLSMQ  EQU   CVTS01+268                                               01106000
CVTGSMQ  EQU   CVTS01+264                                               01107000
CVTEXPRO EQU   CVTS01+260                                               01108000
CVTOPCTP EQU   CVTS01+256                                               01109000
CVTSIC   EQU   CVTS01+252                                               01110000
CVTTPIOS EQU   CVTS01+248                                               01111000
CVTRTMS  EQU   CVTS01+244                                               01112000
CVTSDBF  EQU   CVTS01+240                                               01113000
CVTSCBP  EQU   CVTS01+236                                               01114000
CVTSDMP  EQU   CVTS01+232                                               01115000
CVTSV60  EQU   CVTS01+228                                               01116000
CVTRTMCT EQU   CVTS01+224                                               01117000
CVTASCBL EQU   CVTS01+220                                               01118000
CVTASCBH EQU   CVTS01+216                                               01119000
CVTGDA   EQU   CVTS01+212                                               01120000
CVTVVMDI EQU   CVTS01+204                                               01121000
CVTAQTOP EQU   CVTS01+200                                               01122000
CVTIOSCS EQU   CVTS01+196                                               01123000
CVTSDRM  EQU   CVTS01+192                                               01124000
CVTOPTE  EQU   CVTS01+188                                               01125000
CVTSTXU  EQU   CVTS01+184                                               01126000
CVTQUIS  EQU   CVTS01+180                                               01127000
CVTPARS  EQU   CVTS01+176                                               01128000
CVTS1EE  EQU   CVTS01+172                                               01129000
CVTFRAS  EQU   CVTS01+168                                               01130000
CVTQSAS  EQU   CVTS01+164                                               01131000
CVTCRAS  EQU   CVTS01+160                                               01132000
CVTCRMN  EQU   CVTS01+156                                               01133000
CVTDELCP EQU   CVTS01+152                                               01134000
CVTFRECL EQU   CVTS01+148                                               01135000
CVTGETCL EQU   CVTS01+144                                               01136000
CVTBLDCP EQU   CVTS01+140                                               01137000
CVTAUTHL EQU   CVTS01+136                                               01138000
CVTSCAN  EQU   CVTS01+132                                               01139000
CVTRV144 EQU   CVTS01+130                                               01140000
CVTMAXMP EQU   CVTS01+128                                               01141000
CVTSTCK  EQU   CVTS01+124                                               01142000
CVTRV139 EQU   CVTS01+123                                               01143000
CVTDSSAC EQU   CVTS01+122                                               01144000
CVTRV513 EQU   CVTS01+121                                               01145000
CVTIOSPL EQU   CVTS01+120                                               01146000
CVTPTGT  EQU   CVTS01+116                                               01147000
CVTCSPIE EQU   CVTS01+112                                               01148000
CVTSMFEX EQU   CVTS01+108                                               01149000
CVTOLT0A EQU   CVTS01+104                                               01150000
CVTSRBRT EQU   CVTS01+100                                               01151000
CVTPUTL  EQU   CVTS01+96                                                01152000
CVTASCRL EQU   CVTS01+92                                                01153000
CVTASCRF EQU   CVTS01+88                                                01154000
CVTRV326 EQU   CVTS01+84                                                01155000
CVTRV325 EQU   CVTS01+80                                                01156000
CVTRV324 EQU   CVTS01+76                                                01157000
CVT0VL01 EQU   CVTS01+72                                                01158000
CVTSHRVM EQU   CVTS01+68                                                01159000
CVTRV332 EQU   CVTS01+64                                                01160000
CVTTAS   EQU   CVTS01+60                                                01161000
CVTRSCN  EQU   CVTS01+56                                                01162000
CVTTRAC2 EQU   CVTS01+54                                                01163000
CVTTRACE EQU   CVTS01+52                                                01164000
CVTAPG   EQU   CVTS01+51                                                01165000
CVTSDTRC EQU   CVTCTLFG                                                 01166000
CVTGTRCE EQU   CVTCTLFG                                                 01167000
CVTNOMP  EQU   CVTCTLFG                                                 01168000
CVTRSV79 EQU   CVTCTLFG                                                 01169000
CVTDSTAT EQU   CVTCTLFG                                                 01170000
CVTRSV78 EQU   CVTCTLFG                                                 01171000
CVTRV333 EQU   CVTCTLFG                                                 01172000
CVTRV323 EQU   CVTCTLFG                                                 01173000
CVTSPVLK EQU   CVTS01+49                                                01174000
CVTRSV77 EQU   CVTS01+48                                                01175000
CVTRV331 EQU   CVTS01+44                                                01176000
CVTRV330 EQU   CVTS01+40                                                01177000
CVTRV329 EQU   CVTS01+36                                                01178000
CVTRV328 EQU   CVTS01+32                                                01179000
CVTRV322 EQU   CVTS01+28                                                01180000
CVTSLID  EQU   CVTSLIDA+1                                               01181000
CVTSYLK  EQU   CVTSLIDA                                                 01182000
CVTRV321 EQU   CVTS01+20                                                01183000
CVTRV320 EQU   CVTS01+16                                                01184000
CVTLPDIR EQU   CVTLPDIA+1                                               01185000
CVTRSV69 EQU   CVTDIRST                                                 01186000
CVTRSV68 EQU   CVTDIRST                                                 01187000
CVTRSV67 EQU   CVTDIRST                                                 01188000
CVTRSV66 EQU   CVTDIRST                                                 01189000
CVTRSV65 EQU   CVTDIRST                                                 01190000
CVTRSV64 EQU   CVTDIRST                                                 01191000
CVTRSV63 EQU   CVTDIRST                                                 01192000
CVTDICOM EQU   CVTDIRST                                                 01193000
CVTPVTP  EQU   CVTS01+8                                                 01194000
CVTLPDSR EQU   CVTS01+4                                                 01195000
CVTGETL  EQU   CVTS01                                                   01196000
TVCSDATA EQU   TVCS+116                                                 01197000
@NM00154 EQU   TVCSINDS                                                 01198000
TVCSRCRC EQU   TVCSINDS                                                 01199000
TVCSASCB EQU   TVCS+108                                                 01200000
TVCSEDIT EQU   TVCSOPTN                                                 01201000
TVCSBRK  EQU   TVCSOPTN                                                 01202000
TVCSHOLD EQU   TVCSOPTN                                                 01203000
TVCSNOWT EQU   TVCSOPTN                                                 01204000
TVCSPRIO EQU   TVCSOPTN                                                 01205000
@NM00153 EQU   TVCSOPTN                                                 01206000
TVCSPTGT EQU   TVCSOPTN                                                 01207000
TVCSDASZ EQU   TVCS+100                                                 01208000
TVCSCODE EQU   TVCSECB+1                                                01209000
@NM00152 EQU   TVCSECB                                                  01210000
TVCSPOST EQU   TVCSECB                                                  01211000
TVCSWAIT EQU   TVCSECB                                                  01212000
TVCSOPRM EQU   TVCS+76                                                  01213000
TVCSPARM EQU   TVCS+72                                                  01214000
TVCSAVEA EQU   TVCS                                                     01215000
@NM00127 EQU   SRBSECT+40                                               01216000
@NM00126 EQU   SRBSECT+38                                               01217000
SRBPRIOR EQU   SRBSECT+37                                               01218000
SRBPKF   EQU   SRBSECT+36                                               01219000
SRBSAVE  EQU   SRBSECT+32                                               01220000
SRBPARM  EQU   SRBSECT+28                                               01221000
SRBRMTR  EQU   SRBSECT+24                                               01222000
SRBEP    EQU   SRBSECT+20                                               01223000
SRBPTCB  EQU   SRBFLC+4                                                 01224000
SRBPASID EQU   SRBFLC+2                                                 01225000
SRBCPAFF EQU   SRBFLC                                                   01226000
SRBASCB  EQU   SRBSECT+8                                                01227000
SRBFLNK  EQU   SRBSECT+4                                                01228000
SRBID    EQU   SRBSECT                                                  01229000
SVRBEND  EQU   RBSECT+192                                               01230000
RBFEPARM EQU   RBSECT+168                                               01231000
SIRBEND  EQU   RBSECT+168                                               01232000
RBRSV158 EQU   RBRSV150                                                 01233000
RBRSV157 EQU   RBRSV150                                                 01234000
RBRSV156 EQU   RBRSV150                                                 01235000
RBRSV155 EQU   RBRSV150                                                 01236000
RBRSV154 EQU   RBRSV150                                                 01237000
RBRSV153 EQU   RBRSV150                                                 01238000
RBRSV152 EQU   RBRSV150                                                 01239000
RBRSV151 EQU   RBRSV150                                                 01240000
RBRSV149 EQU   RBSECT+166                                               01241000
RBRSV148 EQU   RBSECT+164                                               01242000
RBRSV169 EQU   RBSDATA+3                                                01243000
RBSID    EQU   RBSDATA+2                                                01244000
RBSPKEY  EQU   RBSDATA+1                                                01245000
RBRSV168 EQU   RBSFLG3                                                  01246000
RBSTERMO EQU   RBSFLG3                                                  01247000
RBSBRNTR EQU   RBSFLG3                                                  01248000
RBSPRNTR EQU   RBSFLG3                                                  01249000
RBSCNCEL EQU   RBSFLG3                                                  01250000
RBSRECRD EQU   RBSFLG3                                                  01251000
RBSTERMI EQU   RBSFLG3                                                  01252000
RBRSV167 EQU   RBSFLG3                                                  01253000
RBSOWNRA EQU   RBSOWNR+1                                                01254000
RBSSUPER EQU   RBSFLGS2                                                 01255000
RBSKEY0  EQU   RBSFLGS2                                                 01256000
RBRSV166 EQU   RBSFLGS2                                                 01257000
RBRSV165 EQU   RBSFLGS2                                                 01258000
RBSINUSE EQU   RBSFLGS2                                                 01259000
RBRSV164 EQU   RBSFLGS2                                                 01260000
RBSXCTL2 EQU   RBSFLGS2                                                 01261000
RBRSV163 EQU   RBSFLGS2                                                 01262000
RBSPARMA EQU   RBSPARM+1                                                01263000
RBSHALT  EQU   RBSIOPRC                                                 01264000
RBSNOIOP EQU   RBSIOPRC                                                 01265000
RBSASYNC EQU   RBSFLGS1                                                 01266000
RBRSV162 EQU   RBSFLGS1                                                 01267000
RBSESTAE EQU   RBSFLGS1                                                 01268000
RBSDUMMY EQU   RBSFLGS1                                                 01269000
RBSSTAR  EQU   RBSFLGS1                                                 01270000
RBSSTAI  EQU   RBSFLGS1                                                 01271000
RBSEXIT  EQU   RBSCBB+4                                                 01272000
RBSCHAIN EQU   RBSCBB                                                   01273000
TIRBEND  EQU   @NM00124+8                                               01274000
PRBEND   EQU   @NM00124+8                                               01275000
RBRSV146 EQU   RBRSV138                                                 01276000
RBRSV145 EQU   RBRSV138                                                 01277000
RBRSV144 EQU   RBRSV138                                                 01278000
RBRSV143 EQU   RBRSV138                                                 01279000
RBRSV142 EQU   RBRSV138                                                 01280000
RBRSV141 EQU   RBRSV138                                                 01281000
RBRSV140 EQU   RBRSV138                                                 01282000
RBRSV139 EQU   RBRSV138                                                 01283000
RBRSV137 EQU   @NM00124+6                                               01284000
RBRSV136 EQU   @NM00124+4                                               01285000
RBRSV135 EQU   @NM00124                                                 01286000
@NM00123 EQU   RBSECT+32                                                01287000
@NM00122 EQU   @NM00120+1                                               01288000
RBSCF    EQU   @NM00121                                                 01289000
RBPGMQ1  EQU   RBPGMQ+1                                                 01290000
@NM00119 EQU   RBPGMQ                                                   01291000
@NM00118 EQU   RBSECT+16                                                01292000
@NM00117 EQU   @NM00113                                                 01293000
@NM00116 EQU   @NM00113                                                 01294000
RBIQETP  EQU   @NM00113                                                 01295000
RBUSIQE  EQU   RBETXR                                                   01296000
RBATTN   EQU   @NM00113                                                 01297000
@NM00115 EQU   @NM00113                                                 01298000
@NM00114 EQU   @NM00113                                                 01299000
RBPMSVRB EQU   @NM00111                                                 01300000
RBATNXIT EQU   @NM00111                                                 01301000
@NM00112 EQU   @NM00111                                                 01302000
RBWAITP  EQU   @NM00111                                                 01303000
RBFNSVRB EQU   RBTRSVRB                                                 01304000
RBFTP    EQU   @NM00111                                                 01305000
RBSIZE   EQU   RBSECT+8                                                 01306000
RBABOPSW EQU   RBSECT+4                                                 01307000
RBPPSAV1 EQU   RBPPSAV+1                                                01308000
@NM00109 EQU   RBPPSAV                                                  01309000
RBPRFXND EQU   RBPREFIX+64                                              01310000
RBINTCOD EQU   RBINTCDA+1                                               01311000
RBINLNTH EQU   RBINTCDA                                                 01312000
RBWCSA   EQU   RBPREFIX+60                                              01313000
RBRSV004 EQU   RBPREFIX+57                                              01314000
RBSSSYN  EQU   RBFLAGS1                                                 01315000
RBSCB    EQU   RBFLAGS1                                                 01316000
RBLONGWT EQU   RBFLAGS1                                                 01317000
RBASIR   EQU   RBFLAGS1                                                 01318000
RBRSV159 EQU   RBFLAGS1                                                 01319000
RBABEND  EQU   RBFLAGS1                                                 01320000
RBXWAIT  EQU   RBFLAGS1                                                 01321000
RBSLOCK  EQU   RBFLAGS1                                                 01322000
RBRTRAN  EQU   RBRTPSW2+4                                               01323000
RBRTINCD EQU   RBRTICIL+2                                               01324000
RBRTILC  EQU   RBRTICIL+1                                               01325000
RBRSV160 EQU   RBRTICIL                                                 01326000
RBRTPSW1 EQU   RBRTOPSW                                                 01327000
RBRSV062 EQU   RBRSV054                                                 01328000
RBRSV061 EQU   RBRSV054                                                 01329000
RBRSV060 EQU   RBRSV054                                                 01330000
RBRSV059 EQU   RBRSV054                                                 01331000
RBRSV058 EQU   RBRSV054                                                 01332000
RBRSV057 EQU   RBRSV054                                                 01333000
RBRSV056 EQU   RBRSV054                                                 01334000
RBRSV055 EQU   RBRSV054                                                 01335000
RBRSV053 EQU   RBPREFIX+38                                              01336000
RBRSV052 EQU   RBPREFIX+36                                              01337000
RBRSV051 EQU   RBPREFIX+32                                              01338000
RBPRFXST EQU   RBPREFIX+32                                              01339000
RBRSV050 EQU   RBPREFIX+28                                              01340000
RBRSV049 EQU   RBRSV041                                                 01341000
RBRSV048 EQU   RBRSV041                                                 01342000
RBRSV047 EQU   RBRSV041                                                 01343000
RBRSV046 EQU   RBRSV041                                                 01344000
RBRSV045 EQU   RBRSV041                                                 01345000
RBRSV044 EQU   RBRSV041                                                 01346000
RBRSV043 EQU   RBRSV041                                                 01347000
RBRSV042 EQU   RBRSV041                                                 01348000
RBRSV040 EQU   RBPREFIX+26                                              01349000
RBRSV039 EQU   RBPREFIX+24                                              01350000
RBRSV038 EQU   RBPREFIX+20                                              01351000
RBRSV037 EQU   RBPREFIX+16                                              01352000
RBRSV036 EQU   RBRSV028                                                 01353000
RBRSV035 EQU   RBRSV028                                                 01354000
RBRSV034 EQU   RBRSV028                                                 01355000
RBRSV033 EQU   RBRSV028                                                 01356000
RBRSV032 EQU   RBRSV028                                                 01357000
RBRSV031 EQU   RBRSV028                                                 01358000
RBRSV030 EQU   RBRSV028                                                 01359000
RBRSV029 EQU   RBRSV028                                                 01360000
RBRSV027 EQU   RBRSV019                                                 01361000
RBRSV026 EQU   RBRSV019                                                 01362000
RBRSV025 EQU   RBRSV019                                                 01363000
RBRSV024 EQU   RBRSV019                                                 01364000
RBRSV023 EQU   RBRSV019                                                 01365000
RBRSV022 EQU   RBRSV019                                                 01366000
RBRSV021 EQU   RBRSV019                                                 01367000
RBRSV020 EQU   RBRSV019                                                 01368000
RBRSV018 EQU   RBPREFIX+13                                              01369000
RBRSV017 EQU   RBPREFIX+12                                              01370000
RBSRV016 EQU   RBPREFIX+11                                              01371000
RBRSV015 EQU   RBPREFIX+10                                              01372000
RBRSV014 EQU   RBPREFIX+8                                               01373000
RBRSV013 EQU   RBPREFIX+4                                               01374000
RBRSV012 EQU   RBPREFIX                                                 01375000
XRBREG15 EQU   RBGRS15                                                  01376000
XRBREG14 EQU   RBGRS14                                                  01377000
XRBREG13 EQU   RBGRS13                                                  01378000
XRBREG12 EQU   RBGRS12                                                  01379000
XRBREG11 EQU   RBGRS11                                                  01380000
XRBREG10 EQU   RBGRS10                                                  01381000
XRBREG9  EQU   RBGRS9                                                   01382000
XRBREG8  EQU   RBGRS8                                                   01383000
XRBREG7  EQU   RBGRS7                                                   01384000
XRBREG6  EQU   RBGRS6                                                   01385000
XRBREG5  EQU   RBGRS5                                                   01386000
XRBREG4  EQU   RBGRS4                                                   01387000
XRBREG3  EQU   RBGRS3                                                   01388000
XRBREG2  EQU   RBGRS2                                                   01389000
XRBREG1  EQU   RBGRS1                                                   01390000
XRBREG0  EQU   RBGRS0                                                   01391000
XRBLNKA  EQU   RBLINKB                                                  01392000
XRBWT    EQU   RBWCF                                                    01393000
@NM00108 EQU   RBBASIC+24                                               01394000
RBOPSWPS EQU   RBOPSWB2                                                 01395000
@NM00107 EQU   RBOPSWB2                                                 01396000
@NM00106 EQU   XRBPSW                                                   01397000
@NM00105 EQU   RBBASIC+12                                               01398000
XRBWAIT  EQU   RBECBWT                                                  01399000
XRBFRRB  EQU   RBFDYN                                                   01400000
@NM00104 EQU   XSTAB2                                                   01401000
XRBACTV  EQU   RBFACTV                                                  01402000
XRBTCBP  EQU   RBTCBNXT                                                 01403000
@NM00103 EQU   XSTAB1                                                   01404000
XRBCKPT  EQU   RBFTCKPT                                                 01405000
@NM00102 EQU   XSTAB1                                                   01406000
@NM00101 EQU   RBBASIC+8                                                01407000
@NM00100 EQU   RBEXRTNM+1                                               01408000
RBTMIND3 EQU   RBTMFLD                                                  01409000
RBTMIND2 EQU   RBTMFLD                                                  01410000
RBTMCMP  EQU   RBTMFLD                                                  01411000
RBWLIM   EQU   RBTMFLD                                                  01412000
RBRSV005 EQU   RBTMFLD                                                  01413000
RBTMTOD  EQU   RBTMFLD                                                  01414000
RBTMQUE  EQU   RBTMFLD                                                  01415000
@NM00099 EQU   RBPRFX                                                   01416000
@NM00098 EQU   SCVTSECT+180                                             01417000
@NM00097 EQU   SCVTSECT+176                                             01418000
SCVTPIQE EQU   SCVTSECT+172                                             01419000
@NM00096 EQU   SCVTSECT+168                                             01420000
SCVTPTRM EQU   SCVTSECT+164                                             01421000
@NM00095 EQU   SCVTSECT+160                                             01422000
@NM00094 EQU   SCVTSECT+156                                             01423000
SCVTQCBR EQU   SCVTSECT+152                                             01424000
@NM00093 EQU   SCVTSECT+144                                             01425000
SCVTTQE  EQU   SCVTSECT+140                                             01426000
@NM00092 EQU   SCVTSECT+136                                             01427000
SCVTSVCT EQU   SCVTSECT+132                                             01428000
@NM00091 EQU   SCVTSECT+128                                             01429000
@NM00090 EQU   SCVTSECT+124                                             01430000
SCVTRXLQ EQU   SCVTSECT+120                                             01431000
@NM00089 EQU   SCVTSECT+116                                             01432000
SCVTCTCB EQU   SCVTSECT+112                                             01433000
@NM00088 EQU   SCVTSECT+108                                             01434000
@NM00087 EQU   SCVTSECT+104                                             01435000
@NM00086 EQU   SCVTSECT+100                                             01436000
@NM00085 EQU   SCVTSECT+96                                              01437000
SCVTCOMM EQU   SCVTSECT+92                                              01438000
@NM00084 EQU   SCVTSECT+88                                              01439000
@NM00083 EQU   SCVTSECT+84                                              01440000
@NM00082 EQU   SCVTSECT+80                                              01441000
@NM00081 EQU   SCVTSECT+76                                              01442000
@NM00080 EQU   SCVTSECT+72                                              01443000
SCVTGMBR EQU   SCVTSECT+68                                              01444000
SCVTRPTR EQU   SCVTSECT+64                                              01445000
SCVTHSKP EQU   SCVTSECT+60                                              01446000
@NM00079 EQU   SCVTSECT+56                                              01447000
@NM00078 EQU   SCVTSECT+52                                              01448000
SCVTLFRM EQU   SCVTSECT+48                                              01449000
SCVTCDCL EQU   SCVTSECT+44                                              01450000
@NM00077 EQU   SCVTSECT+40                                              01451000
SCVTRACE EQU   SCVTSECT+36                                              01452000
@NM00076 EQU   SCVTSECT+32                                              01453000
SCVTRMBR EQU   SCVTSECT+28                                              01454000
@NM00075 EQU   SCVTSECT+24                                              01455000
@NM00074 EQU   SCVTSECT+20                                              01456000
@NM00073 EQU   SCVTSECT+16                                              01457000
@NM00072 EQU   SCVTSECT+14                                              01458000
SCVTBR14 EQU   SCVTSECT+12                                              01459000
SCVTSPET EQU   SCVTSECT+8                                               01460000
SCVTPGWR EQU   SCVTSECT+4                                               01461000
SCVTPGTM EQU   SCVTSECT                                                 01462000
ASVTEND  EQU   ASVT+528                                                 01463000
ASVTAVAI EQU   ASVTFRST                                                 01464000
ASVTRS00 EQU   ASVT+520                                                 01465000
ASVTMAXU EQU   ASVT+516                                                 01466000
ASVTASVT EQU   ASVT+512                                                 01467000
ASVTBEGN EQU   ASVT+512                                                 01468000
@NM00071 EQU   ASVT                                                     01469000
TSBXEND  EQU   TSBX+128                                                 01470000
@NM00070 EQU   TSBX+124                                                 01471000
TSBXDMMO EQU   TSBX+120                                                 01472000
TSBXDMMI EQU   TSBX+116                                                 01473000
TSBXBIND EQU   TSBX+80                                                  01474000
TSBXRPL  EQU   TSBX+76                                                  01475000
TSBXTMBF EQU   TSBXTERM+2                                               01476000
TSBXSUBT EQU   TSBXTERM+1                                               01477000
TSBXTMTP EQU   TSBXTERM                                                 01478000
TSBXAIND EQU   TSBX+70                                                  01479000
TSBXRSZO EQU   TSBX+69                                                  01480000
TSBXRSZI EQU   TSBX+68                                                  01481000
TSBXLBUF EQU   TSBX+64                                                  01482000
TSBXSRB  EQU   TSBX+56                                                  01483000
TSBXSRBI EQU   TSBX+52                                                  01484000
@NM00069 EQU   TSBX+48                                                  01485000
TSBXDPMO EQU   TSBXTOM                                                  01486000
TSBXDPMI EQU   TSBXTIM                                                  01487000
TSBXTVWA EQU   TSBX+36                                                  01488000
TSBXFLG4 EQU   TSBX+35                                                  01489000
TSBXFLG3 EQU   TSBX+34                                                  01490000
TSBXFLG2 EQU   TSBX+33                                                  01491000
@NM00068 EQU   TSBXFLG1                                                 01492000
TSBXTGTF EQU   TSBXFLG1                                                 01493000
TSBXNOSW EQU   TSBXFLG1                                                 01494000
TSBXWREC EQU   TSBXFLG1                                                 01495000
TSBXLOGF EQU   TSBXFLG1                                                 01496000
TSBXACTV EQU   TSBXFLG1                                                 01497000
TSBXASCI EQU   TSBXFLG1                                                 01498000
TSBXUID  EQU   TSBX+24                                                  01499000
@NM00067 EQU   TSBX+16                                                  01500000
@NM00066 EQU   TSBX+12                                                  01501000
TSBXECB  EQU   TSBX+8                                                   01502000
TSBXBCK  EQU   TSBX+4                                                   01503000
TSBXFWD  EQU   TSBX                                                     01504000
TSBEND   EQU   TSB+120                                                  01505000
TSBSF1   EQU   TSB+112                                                  01506000
TSBTRMID EQU   TSB+104                                                  01507000
TSBALTC  EQU   TSB+103                                                  01508000
TSBALTR  EQU   TSB+102                                                  01509000
TSBPRMC  EQU   TSB+101                                                  01510000
TSBPRMR  EQU   TSB+100                                                  01511000
TSBPSWD  EQU   TSB+88                                                   01512000
TSBLECB  EQU   TSBMINL                                                  01513000
TSBLINE  EQU   TSB+82                                                   01514000
TSBSTAX  EQU   TSB+81                                                   01515000
TSBATTNC EQU   TSB+80                                                   01516000
TSBF1V   EQU   TSBTPOST+7                                               01517000
TSBF1M   EQU   TSBTPOST+6                                               01518000
TSBF2V   EQU   TSBTPOST+5                                               01519000
TSBF2M   EQU   TSBTPOST+4                                               01520000
TSBFLAGV EQU   TSBTPOST+3                                               01521000
TSBFLAGM EQU   TSBTPOST+2                                               01522000
@NM00065 EQU   TSBTPOST+1                                               01523000
@NM00064 EQU   TSBTPFLG                                                 01524000
@NM00063 EQU   TSBTPFLG                                                 01525000
@NM00062 EQU   TSBTPFLG                                                 01526000
@NM00061 EQU   TSBTPFLG                                                 01527000
TSBNEWID EQU   TSBTPFLG                                                 01528000
TSBTPAYI EQU   TSBTPFLG                                                 01529000
TSBTPQCB EQU   TSBTPFLG                                                 01530000
TSBPOSTO EQU   TSBTPFLG                                                 01531000
TSBLINKB EQU   TSBLINKA+1                                               01532000
TSBPRI   EQU   TSBLINKA                                                 01533000
TSBRQCB  EQU   TSBRCB                                                   01534000
TSBERSDS EQU   TSB+56                                                   01535000
TSBAUTOI EQU   TSB+52                                                   01536000
TSBAUTOS EQU   TSB+48                                                   01537000
TSBATNCC EQU   TSB+44                                                   01538000
TSBASRCE EQU   TSB+42                                                   01539000
TSBHLDL  EQU   TSBFLG4                                                  01540000
TSBGETBF EQU   TSBFLG4                                                  01541000
TSBHOLD  EQU   TSBFLG4                                                  01542000
TSBHUNG  EQU   TSBFLG4                                                  01543000
TSBOWAIT EQU   TSBFLG4                                                  01544000
TSBIWAIT EQU   TSBFLG4                                                  01545000
TSBOCAB  EQU   TSBFLG4                                                  01546000
TSBLNNO  EQU   TSB+40                                                   01547000
TSBATNTC EQU   TSB+38                                                   01548000
TSBATNLC EQU   TSB+36                                                   01549000
TSBCHDCC EQU   TSBSTCC+1                                                01550000
TSBLNDCC EQU   TSBSTCC                                                  01551000
TSBECB   EQU   TSB+28                                                   01552000
TSBC1050 EQU   TSBTERM2                                                 01553000
@NM00060 EQU   TSBTERM2                                                 01554000
@NM00059 EQU   TSBTERM2                                                 01555000
@NM00058 EQU   TSBTERM2                                                 01556000
@NM00057 EQU   TSBTERM2                                                 01557000
TSBCTWX  EQU   TSBTERM2                                                 01558000
@NM00056 EQU   TSBTERM2                                                 01559000
@NM00055 EQU   TSBTERM2                                                 01560000
@NM00054 EQU   TSBTERM1                                                 01561000
@NM00053 EQU   TSBTERM1                                                 01562000
@NM00052 EQU   TSBTERM1                                                 01563000
TSBC2741 EQU   TSBTERM1                                                 01564000
TSBC5041 EQU   TSBTERM1                                                 01565000
TSBCATTN EQU   TSBTERM1                                                 01566000
TSBCBRK  EQU   TSBTERM1                                                 01567000
TSBCIHBN EQU   TSBTERM1                                                 01568000
TSBVTAM  EQU   TSBFLG5                                                  01569000
TSBKEYS  EQU   TSBFLG5                                                  01570000
TSBNEDIT EQU   TSBFLG5                                                  01571000
TSBQRY   EQU   TSBFLG5                                                  01572000
@NM00051 EQU   TSBFLG5                                                  01573000
TSBSPF   EQU   TSBFLG5                                                  01574000
TSBATMP  EQU   TSBFLG5                                                  01575000
TSBNFLOP EQU   TSBFLG3                                                  01576000
TSBNOBRK EQU   TSBFLG3                                                  01577000
TSBTPUT  EQU   TSBFLG3                                                  01578000
TSBAWOIP EQU   TSBFLG3                                                  01579000
TSBNBKSP EQU   TSBFLG3                                                  01580000
TSBSPIT  EQU   TSBFLG3                                                  01581000
TSBTJMSG EQU   TSBFLG3                                                  01582000
TSBATTN  EQU   TSBFLG3                                                  01583000
TSBIBFP  EQU   TSB+21                                                   01584000
TSBNIBF  EQU   TSB+20                                                   01585000
TSBITBFP EQU   TSB+17                                                   01586000
TSBSATN2 EQU   TSBFLG2                                                  01587000
TSBSATN1 EQU   TSBFLG2                                                  01588000
TSBSTAUT EQU   TSBFLG2                                                  01589000
TSBAUTOC EQU   TSBFLG2                                                  01590000
TSBAULST EQU   TSBFLG2                                                  01591000
TSBBRKIN EQU   TSBFLG2                                                  01592000
TSBAUTON EQU   TSBFLG2                                                  01593000
TSBBIPI  EQU   TSBFLG2                                                  01594000
TSBOBFP  EQU   TSB+13                                                   01595000
TSBNOBF  EQU   TSB+12                                                   01596000
TSBOTBFP EQU   TSB+9                                                    01597000
TSBLNSZ  EQU   TSB+8                                                    01598000
TSBTJBF  EQU   TSBFLG1                                                  01599000
TSBTJIP  EQU   TSBFLG1                                                  01600000
TSBTJOW  EQU   TSBFLG1                                                  01601000
TSBIFLSH EQU   TSBFLG1                                                  01602000
TSBOFLSH EQU   TSBFLG1                                                  01603000
TSBANSR  EQU   TSBFLG1                                                  01604000
TSBASCB  EQU   TSBASCBA+1                                               01605000
TSBATNLD EQU   TSBSTAT                                                  01606000
TSB3270  EQU   TSBSTAT                                                  01607000
TSBDISC  EQU   TSBSTAT                                                  01608000
TSBITOFF EQU   TSBSTAT                                                  01609000
TSBNOBUF EQU   TSBSTAT                                                  01610000
TSBDSPLY EQU   TSBSTAT                                                  01611000
TSBLWAIT EQU   TSBSTAT                                                  01612000
TSBINUSE EQU   TSBSTAT                                                  01613000
ASCBEND  EQU   ASCB+208                                                 01614000
ASCBSRBT EQU   ASCB+200                                                 01615000
ASCBSWTL EQU   ASCB+196                                                 01616000
ASCBRS14 EQU   ASCB+195                                                 01617000
ASCBSMCT EQU   ASCB+194                                                 01618000
ASCBRS12 EQU   ASCB+192                                                 01619000
ASCBPCTT EQU   ASCB+188                                                 01620000
ASCBVGTT EQU   ASCB+184                                                 01621000
ASCBRV43 EQU   ASCBSRQ4                                                 01622000
ASCBRV42 EQU   ASCBSRQ4                                                 01623000
ASCBRV41 EQU   ASCBSRQ4                                                 01624000
ASCBRV40 EQU   ASCBSRQ4                                                 01625000
ASCBRV39 EQU   ASCBSRQ4                                                 01626000
ASCBRV38 EQU   ASCBSRQ4                                                 01627000
ASCBRV37 EQU   ASCBSRQ4                                                 01628000
ASCBRV36 EQU   ASCBSRQ4                                                 01629000
ASCBRV35 EQU   ASCBSRQ3                                                 01630000
ASCBRV34 EQU   ASCBSRQ3                                                 01631000
ASCBRV33 EQU   ASCBSRQ3                                                 01632000
ASCBRV32 EQU   ASCBSRQ3                                                 01633000
ASCBRV31 EQU   ASCBSRQ3                                                 01634000
ASCBRV30 EQU   ASCBSRQ3                                                 01635000
ASCBRV29 EQU   ASCBSRQ3                                                 01636000
ASCBRV28 EQU   ASCBSRQ3                                                 01637000
ASCBRV27 EQU   ASCBSRQ2                                                 01638000
ASCBRV26 EQU   ASCBSRQ2                                                 01639000
ASCBRV25 EQU   ASCBSRQ2                                                 01640000
ASCBRV24 EQU   ASCBSRQ2                                                 01641000
ASCBRV23 EQU   ASCBSRQ2                                                 01642000
ASCBRV22 EQU   ASCBSRQ2                                                 01643000
ASCBRV21 EQU   ASCBSRQ2                                                 01644000
ASCBRV20 EQU   ASCBSRQ2                                                 01645000
ASCBRV19 EQU   ASCBSRQ1                                                 01646000
ASCBRV18 EQU   ASCBSRQ1                                                 01647000
ASCBRV17 EQU   ASCBSRQ1                                                 01648000
ASCBRV16 EQU   ASCBSRQ1                                                 01649000
ASCBRV15 EQU   ASCBSRQ1                                                 01650000
ASCBRV14 EQU   ASCBSRQ1                                                 01651000
ASCBRV13 EQU   ASCBSRQ1                                                 01652000
ASCBSTA  EQU   ASCBSRQ1                                                 01653000
ASCBJBNS EQU   ASCB+176                                                 01654000
ASCBJBNI EQU   ASCB+172                                                 01655000
ASCBMCC  EQU   ASCB+168                                                 01656000
ASCBRTWA EQU   ASCB+164                                                 01657000
ASCBIQEA EQU   ASCB+160                                                 01658000
ASCBXMPQ EQU   ASCB+156                                                 01659000
ASCBRS01 EQU   ASCB+154                                                 01660000
ASCBFMCT EQU   ASCB+152                                                 01661000
ASCBOUXB EQU   ASCB+148                                                 01662000
ASCBOUCB EQU   ASCB+144                                                 01663000
ASCBMECB EQU   ASCB+140                                                 01664000
ASCBQECB EQU   ASCB+136                                                 01665000
ASCBLSQH EQU   ASCBLKGP+4                                               01666000
ASCBLOCK EQU   ASCBLKGP                                                 01667000
ASCBTCBS EQU   ASCB+124                                                 01668000
ASCBNVSC EQU   ASCB+122                                                 01669000
ASCBVSC  EQU   ASCB+120                                                 01670000
ASCBSRBS EQU   ASCB+118                                                 01671000
ASCBSSRB EQU   ASCB+116                                                 01672000
ASCBRV06 EQU   ASCBFLG2                                                 01673000
ASCBRV05 EQU   ASCBFLG2                                                 01674000
ASCBRV04 EQU   ASCBFLG2                                                 01675000
ASCBSNQS EQU   ASCBFLG2                                                 01676000
ASCBS2S  EQU   ASCBFLG2                                                 01677000
ASCBCEXT EQU   ASCBFLG2                                                 01678000
ASCBPXMT EQU   ASCBFLG2                                                 01679000
ASCBXMPT EQU   ASCBFLG2                                                 01680000
ASCBRF07 EQU   ASCBDSP1                                                 01681000
ASCBRF06 EQU   ASCBDSP1                                                 01682000
ASCBRF05 EQU   ASCBDSP1                                                 01683000
ASCBRF04 EQU   ASCBDSP1                                                 01684000
ASCBRF03 EQU   ASCBDSP1                                                 01685000
ASCBRF02 EQU   ASCBDSP1                                                 01686000
ASCBFAIL EQU   ASCBDSP1                                                 01687000
ASCBNOQ  EQU   ASCBDSP1                                                 01688000
ASCBSWCT EQU   ASCB+112                                                 01689000
ASCBASXB EQU   ASCB+108                                                 01690000
ASCBTMCH EQU   ASCB+104                                                 01691000
ASCBNSWP EQU   ASCBFLG1                                                 01692000
ASCBTYP1 EQU   ASCBFLG1                                                 01693000
ASCBSTND EQU   ASCBFLG1                                                 01694000
ASCBABNT EQU   ASCBFLG1                                                 01695000
ASCBTERM EQU   ASCBFLG1                                                 01696000
ASCBS3S  EQU   ASCBFLG1                                                 01697000
ASCBCMSH EQU   ASCBFLG1                                                 01698000
ASCBTOFF EQU   ASCBFLG1                                                 01699000
ASCBRF01 EQU   ASCBRCTF                                                 01700000
ASCBTMLW EQU   ASCBRCTF                                                 01701000
ASCBOUT  EQU   ASCBRCTF                                                 01702000
ASCBWAIT EQU   ASCBRCTF                                                 01703000
ASCBRV08 EQU   ASCBRCTF                                                 01704000
ASCBFQU  EQU   ASCBRCTF                                                 01705000
ASCBFRS  EQU   ASCBRCTF                                                 01706000
ASCBTMNO EQU   ASCBRCTF                                                 01707000
ASCBAFFN EQU   ASCBFW1                                                  01708000
ASCBDUMP EQU   ASCB+96                                                  01709000
ASCBQSVC EQU   ASCB+92                                                  01710000
ASCBUBET EQU   ASCB+88                                                  01711000
ASCBECB  EQU   ASCB+84                                                  01712000
ASCBJSTL EQU   ASCB+80                                                  01713000
ASCBEWST EQU   ASCB+72                                                  01714000
ASCBEJST EQU   ASCB+64                                                  01715000
ASCBCSCB EQU   ASCB+56                                                  01716000
ASCBRSM  EQU   ASCB+52                                                  01717000
ASCBLDA  EQU   ASCB+48                                                  01718000
ASCBSTOR EQU   ASCB+44                                                  01719000
ASCBDP   EQU   ASCB+43                                                  01720000
ASCBRV07 EQU   ASCB+42                                                  01721000
ASCBIOSM EQU   ASCB+40                                                  01722000
ASCBSEQN EQU   ASCB+38                                                  01723000
ASCBCPUS EQU   ASCB+32                                                  01724000
ASCBSPL  EQU   ASCB+28                                                  01725000
ASCBIOSP EQU   ASCB+24                                                  01726000
ASCBSYNC EQU   ASCBSUPC+4                                               01727000
ASCBSVRB EQU   ASCBSUPC                                                 01728000
ASCBCMSF EQU   ASCB+12                                                  01729000
ASCBBWDP EQU   ASCB+8                                                   01730000
ASCBFWDP EQU   ASCB+4                                                   01731000
ASCBASCB EQU   ASCB                                                     01732000
ASCBEGIN EQU   ASCB                                                     01733000
WSAGSCHE EQU   WSAG+40                                                  01734000
WSAGREST EQU   WSAG+36                                                  01735000
WSAGNQDQ EQU   WSAG+32                                                  01736000
WSAGMEMT EQU   WSAG+28                                                  01737000
WSAGOPTM EQU   WSAG+24                                                  01738000
WSAGSTAT EQU   WSAG+20                                                  01739000
WSAGEMS0 EQU   WSAG+16                                                  01740000
WSAGSSRS EQU   WSAG+12                                                  01741000
WSAGRSM  EQU   WSAG+8                                                   01742000
WSAGPGIO EQU   WSAG                                                     01743000
CVTLEVL  EQU   CVTRELNO+2                                               01744000
CVTNUMB  EQU   CVTRELNO                                                 01745000
CVTMDL   EQU   CVTFIX+250                                               01746000
@NM00050 EQU   CVTFIX+248                                               01747000
@NM00049 EQU   CVTFIX                                                   01748000
CVTRV482 EQU   CVTXTNT2+128                                             01749000
CVTRV481 EQU   CVTXTNT2+124                                             01750000
CVTRV480 EQU   CVTXTNT2+120                                             01751000
CVTRV479 EQU   CVTXTNT2+118                                             01752000
CVTRV478 EQU   CVTXTNT2+117                                             01753000
CVTRV477 EQU   CVTXTNT2+116                                             01754000
CVTRV476 EQU   CVTXTNT2+115                                             01755000
CVTRV475 EQU   CVTXTNT2+114                                             01756000
CVTRV474 EQU   CVTRV466                                                 01757000
CVTRV473 EQU   CVTRV466                                                 01758000
CVTRV472 EQU   CVTRV466                                                 01759000
CVTRV471 EQU   CVTRV466                                                 01760000
CVTRV470 EQU   CVTRV466                                                 01761000
CVTRV469 EQU   CVTRV466                                                 01762000
CVTRV468 EQU   CVTRV466                                                 01763000
CVTRV467 EQU   CVTRV466                                                 01764000
CVTRV465 EQU   CVTRV457                                                 01765000
CVTRV464 EQU   CVTRV457                                                 01766000
CVTRV463 EQU   CVTRV457                                                 01767000
CVTRV462 EQU   CVTRV457                                                 01768000
CVTRV461 EQU   CVTRV457                                                 01769000
CVTRV460 EQU   CVTRV457                                                 01770000
CVTRV459 EQU   CVTRV457                                                 01771000
CVTRV458 EQU   CVTRV457                                                 01772000
CVTRV456 EQU   CVTXTNT2+108                                             01773000
CVTRV455 EQU   CVTXTNT2+104                                             01774000
CVTRV454 EQU   CVTXTNT2+100                                             01775000
CVTRV453 EQU   CVTXTNT2+96                                              01776000
CVTRV452 EQU   CVTXTNT2+94                                              01777000
CVTRV451 EQU   CVTXTNT2+92                                              01778000
CVTRV450 EQU   CVTXTNT2+90                                              01779000
CVTRV449 EQU   CVTXTNT2+88                                              01780000
CVTRV448 EQU   CVTXTNT2+87                                              01781000
CVTRV447 EQU   CVTXTNT2+86                                              01782000
CVTRV446 EQU   CVTRV438                                                 01783000
CVTRV445 EQU   CVTRV438                                                 01784000
CVTRV444 EQU   CVTRV438                                                 01785000
CVTRV443 EQU   CVTRV438                                                 01786000
CVTRV442 EQU   CVTRV438                                                 01787000
CVTRV441 EQU   CVTRV438                                                 01788000
CVTRV440 EQU   CVTRV438                                                 01789000
CVTRV439 EQU   CVTRV438                                                 01790000
CVTRV437 EQU   CVTRV429                                                 01791000
CVTRV436 EQU   CVTRV429                                                 01792000
CVTRV435 EQU   CVTRV429                                                 01793000
CVTRV434 EQU   CVTRV429                                                 01794000
CVTRV433 EQU   CVTRV429                                                 01795000
CVTRV432 EQU   CVTRV429                                                 01796000
CVTRV431 EQU   CVTRV429                                                 01797000
CVTRV430 EQU   CVTRV429                                                 01798000
CVTRV428 EQU   CVTXTNT2+80                                              01799000
CVTRV427 EQU   CVTXTNT2+76                                              01800000
CVTRV426 EQU   CVTXTNT2+72                                              01801000
CVTRV425 EQU   CVTXTNT2+68                                              01802000
CVTATACT EQU   CVTATCVT                                                 01803000
CVTRV423 EQU   CVTXTNT2+62                                              01804000
CVTRV422 EQU   CVTXTNT2+60                                              01805000
CVTRV421 EQU   CVTXTNT2+58                                              01806000
CVTRV420 EQU   CVTXTNT2+56                                              01807000
CVTRV419 EQU   CVTXTNT2+55                                              01808000
CVTRV418 EQU   CVTXTNT2+54                                              01809000
CVTRV417 EQU   CVTRV409                                                 01810000
CVTRV416 EQU   CVTRV409                                                 01811000
CVTRV415 EQU   CVTRV409                                                 01812000
CVTRV414 EQU   CVTRV409                                                 01813000
CVTRV413 EQU   CVTRV409                                                 01814000
CVTRV412 EQU   CVTRV409                                                 01815000
CVTRV411 EQU   CVTRV409                                                 01816000
CVTRV410 EQU   CVTRV409                                                 01817000
CVTRV408 EQU   CVTRV400                                                 01818000
CVTRV407 EQU   CVTRV400                                                 01819000
CVTRV406 EQU   CVTRV400                                                 01820000
CVTRV405 EQU   CVTRV400                                                 01821000
CVTRV404 EQU   CVTRV400                                                 01822000
CVTRV403 EQU   CVTRV400                                                 01823000
CVTRV402 EQU   CVTRV400                                                 01824000
CVTRV401 EQU   CVTRV400                                                 01825000
CVTICB   EQU   CVTXTNT2+48                                              01826000
CVTSKTA  EQU   CVTXTNT2+44                                              01827000
CVTCCVT  EQU   CVTXTNT2+40                                              01828000
CVTRSV98 EQU   CVTXTNT2+36                                              01829000
CVTRSV97 EQU   CVTXTNT2+34                                              01830000
CVTRSV96 EQU   CVTXTNT2+32                                              01831000
CVTOLTEP EQU   CVTXTNT2+28                                              01832000
CVTQIDA  EQU   CVTQID+1                                                 01833000
CVTRSV95 EQU   CVTQID                                                   01834000
CVTRSV94 EQU   CVTXTNT2+20                                              01835000
CVTRSV93 EQU   CVTXTNT2+16                                              01836000
CVTRSV92 EQU   CVTXTNT2+12                                              01837000
CVTDEBVR EQU   CVTXTNT2+8                                               01838000
CVTRSV91 EQU   CVTXTNT2+6                                               01839000
CVTRSV9H EQU   CVTFLGBT                                                 01840000
CVTRSV9G EQU   CVTFLGBT                                                 01841000
CVTRSV9F EQU   CVTFLGBT                                                 01842000
CVTRSV9E EQU   CVTFLGBT                                                 01843000
CVTRSV9D EQU   CVTFLGBT                                                 01844000
CVTBAH   EQU   CVTFLGBT                                                 01845000
CVTVME   EQU   CVTFLGBT                                                 01846000
CVTNPE   EQU   CVTFLGBT                                                 01847000
CVTNUCLS EQU   CVTXTNT2+4                                               01848000
CVTDSSVA EQU   CVTDSSV+1                                                01849000
CVTRSV89 EQU   CVTDSSV                                                  01850000
CVTRSV88 EQU   CVTXTNT1+8                                               01851000
CVTRSV87 EQU   CVTXTNT1+4                                               01852000
CVTFACHN EQU   CVTXTNT1                                                 01853000
CVTRV488 EQU   CVTMAP+412                                               01854000
CVTRV487 EQU   CVTMAP+408                                               01855000
CVTRV486 EQU   CVTMAP+404                                               01856000
CVTRV485 EQU   CVTMAP+400                                               01857000
CVTACTAP EQU   CVTMAP+396                                               01858000
CVTAUTH  EQU   CVTMAP+392                                               01859000
CVTRV490 EQU   CVTMAP+388                                               01860000
CVTSU    EQU   CVTMAP+384                                               01861000
CVTVOLT1 EQU   CVTVOLM1+1                                               01862000
CVTVOLI1 EQU   CVTVOLF1                                                 01863000
CVTSTOA  EQU   CVTMAP+376                                               01864000
CVTRSV58 EQU   CVTMAP+374                                               01865000
CVTRSV57 EQU   CVTMAP+372                                               01866000
CVTDDCE  EQU   CVTMAP+368                                               01867000
CVTPNWFR EQU   CVTMAP+364                                               01868000
CVTSMF   EQU   CVTMAP+360                                               01869000
CVTSULK  EQU   CVTMAP+358                                               01870000
CVTSLKO  EQU   CVTSYSK                                                  01871000
CVTSLKP  EQU   CVTSYSK                                                  01872000
CVTSLKQ  EQU   CVTSYSK                                                  01873000
CVTSLKR  EQU   CVTSYSK                                                  01874000
CVTRSV56 EQU   CVTSYSK                                                  01875000
CVTRSV55 EQU   CVTSYSK                                                  01876000
CVTRSV54 EQU   CVTSYSK                                                  01877000
CVTRSV53 EQU   CVTSYSK                                                  01878000
CVTRSV52 EQU   CVTA1F1                                                  01879000
CVTRSV51 EQU   CVTA1F1                                                  01880000
CVTRSV50 EQU   CVTA1F1                                                  01881000
CVTRSV49 EQU   CVTA1F1                                                  01882000
CVTRSV48 EQU   CVTA1F1                                                  01883000
CVTRSV47 EQU   CVTA1F1                                                  01884000
CVTSRSW  EQU   CVTA1F1                                                  01885000
CVTPFSW  EQU   CVTA1F1                                                  01886000
CVTPCVT  EQU   CVTMAP+352                                               01887000
CVTRSV46 EQU   CVTMAP+344                                               01888000
CVTRSV45 EQU   CVTMAP+340                                               01889000
CVTRSV44 EQU   CVTMAP+338                                               01890000
CVTRSV43 EQU   CVTMAP+336                                               01891000
CVTHJESA EQU   CVTHJES+1                                                01892000
CVTRSV42 EQU   CVTHJES                                                  01893000
CVTEXT2A EQU   CVTEXT2+1                                                01894000
CVTRSV41 EQU   CVTEXT2                                                  01895000
CVTAPFA  EQU   CVTAPF+1                                                 01896000
CVTRSV40 EQU   CVTAPF                                                   01897000
CVTRV518 EQU   CVTINTLA                                                 01898000
CVTRV517 EQU   CVTERPV                                                  01899000
CVTEORM  EQU   CVTMAP+312                                               01900000
CVTMCHPR EQU   CVTMAP+308                                               01901000
CVTTZ    EQU   CVTMAP+304                                               01902000
CVTJEPS  EQU   CVTMAP+300                                               01903000
CVTJESCT EQU   CVTMAP+296                                               01904000
CVTMODE  EQU   CVTMAP+292                                               01905000
CVTPTRV  EQU   CVTMAP+288                                               01906000
CVTREAL  EQU   CVTMAP+284                                               01907000
CVTRSV39 EQU   CVTMAP+280                                               01908000
CVTRSV38 EQU   CVTMAP+276                                               01909000
CVTDMSRA EQU   CVTDMSR+1                                                01910000
CVTRV634 EQU   CVTDMSRF                                                 01911000
CVTRV633 EQU   CVTDMSRF                                                 01912000
CVTRV632 EQU   CVTDMSRF                                                 01913000
CVTRV631 EQU   CVTDMSRF                                                 01914000
CVTRV630 EQU   CVTDMSRF                                                 01915000
CVTRV629 EQU   CVTDMSRF                                                 01916000
CVTUDUMP EQU   CVTDMSRF                                                 01917000
CVTSDUMP EQU   CVTDMSRF                                                 01918000
CVTQMSGA EQU   CVTQMSG+1                                                01919000
CVTRSV36 EQU   CVTQMSG                                                  01920000
CVTAMFF  EQU   CVTMAP+264                                               01921000
CVTPURGA EQU   CVTPURG+1                                                01922000
CVTRSV35 EQU   CVTPURG                                                  01923000
CVTCBSP  EQU   CVTMAP+256                                               01924000
CVTATERA EQU   CVTATER+1                                                01925000
CVTSYST  EQU   CVTATER                                                  01926000
CVTVOLT2 EQU   CVTTAT                                                   01927000
CVTVOLI2 EQU   CVTVOLF2                                                 01928000
CVTAQAVB EQU   CVTAQAVT+1                                               01929000
CVTRSV34 EQU   CVTTCMFG                                                 01930000
CVTRSV33 EQU   CVTTCMFG                                                 01931000
CVTRSV32 EQU   CVTTCMFG                                                 01932000
CVTRSV31 EQU   CVTTCMFG                                                 01933000
CVTRSV30 EQU   CVTTCMFG                                                 01934000
CVTRSV29 EQU   CVTTCMFG                                                 01935000
CVTLDEV  EQU   CVTTCMFG                                                 01936000
CVTTCRDY EQU   CVTTCMFG                                                 01937000
CVTGTFA  EQU   CVTGTF+1                                                 01938000
CVTRSV27 EQU   CVTGTFST                                                 01939000
CVTRNIO  EQU   CVTGTFST                                                 01940000
CVTUSR   EQU   CVTGTFST                                                 01941000
CVTRV318 EQU   CVTFORM                                                  01942000
CVTRV317 EQU   CVTTMODE                                                 01943000
CVTRV316 EQU   CVTSTATE                                                 01944000
CVTRV315 EQU   CVTGTFS                                                  01945000
CVTGTFAV EQU   CVTGTFS                                                  01946000
CVT0SCR1 EQU   CVTMAP+232                                               01947000
CVTRV515 EQU   CVTMAP+228                                               01948000
CVTRMS   EQU   CVTMAP+224                                               01949000
CVTPATCH EQU   CVTMAP+220                                               01950000
CVTTSCE  EQU   CVTMAP+216                                               01951000
CVTLNKSC EQU   CVTMAP+214                                               01952000
CVTQABST EQU   CVTMAP+212                                               01953000
CVTMDLDS EQU   CVTMAP+208                                               01954000
CVTUSER  EQU   CVTMAP+204                                               01955000
CVTSMCA  EQU   CVTMAP+196                                               01956000
CVTRSV18 EQU   CVTMAP+192                                               01957000
CVTQLPAQ EQU   CVTMAP+188                                               01958000
CVTQCDSR EQU   CVTMAP+184                                               01959000
CVTVS1B  EQU   CVTOPTB                                                  01960000
CVTVS1A  EQU   CVTOPTB                                                  01961000
CVTFP    EQU   CVTOPTB                                                  01962000
CVTAPTHR EQU   CVTOPTB                                                  01963000
CVTNLOG  EQU   CVTOPTB                                                  01964000
CVTTOD   EQU   CVTOPTB                                                  01965000
CVTCTIMS EQU   CVTOPTB                                                  01966000
CVTPROT  EQU   CVTOPTB                                                  01967000
CVTXPFP  EQU   CVTOPTA                                                  01968000
CVTASCII EQU   CVTOPTA                                                  01969000
CVTRSV13 EQU   CVTOPTA                                                  01970000
CVTRSV12 EQU   CVTOPTA                                                  01971000
CVTNIP   EQU   CVTOPTA                                                  01972000
CVTDDR   EQU   CVTOPTA                                                  01973000
CVTAPR   EQU   CVTOPTA                                                  01974000
CVTCCH   EQU   CVTOPTA                                                  01975000
CVTSNCTR EQU   CVTMAP+180                                               01976000
CVTQMWR  EQU   CVTMAP+176                                               01977000
CVTQOCR  EQU   CVTMAP+172                                               01978000
CVT1EF00 EQU   CVTMAP+168                                               01979000
CVTMZ00  EQU   CVTMAP+164                                               01980000
CVTHEAD  EQU   CVTMAP+160                                               01981000
CVTRSV11 EQU   CVTMAP+156                                               01982000
CVT0PT01 EQU   CVTMAP+152                                               01983000
CVTMSER  EQU   CVTMAP+148                                               01984000
CVTRV516 EQU   CVTIERLC                                                 01985000
CVTILCH  EQU   CVTMAP+140                                               01986000
CVT0DS   EQU   CVTMAP+136                                               01987000
CVTFBOSV EQU   CVTMAP+132                                               01988000
CVTNUCB  EQU   CVTMAP+128                                               01989000
CVTIXAVL EQU   CVTMAP+124                                               01990000
CVTIOQET EQU   CVTMAP+120                                               01991000
CVTDCBA  EQU   CVTMAP+117                                               01992000
CVTMVS2  EQU   CVTDCB                                                   01993000
CVT6DAT  EQU   CVTDCB                                                   01994000
CVT4MPS  EQU   CVTDCB                                                   01995000
CVTRSV09 EQU   CVTDCB                                                   01996000
CVT4MS1  EQU   CVTDCB                                                   01997000
CVT2SPS  EQU   CVTDCB                                                   01998000
CVT1SSS  EQU   CVTDCB                                                   01999000
CVTRSV08 EQU   CVTDCB                                                   02000000
CVTSTB   EQU   CVTMAP+112                                               02001000
CVTQTD00 EQU   CVTMAP+108                                               02002000
CVTQTE00 EQU   CVTMAP+104                                               02003000
CVTCUCB  EQU   CVTMAP+100                                               02004000
CVTSJQ   EQU   CVTMAP+96                                                02005000
CVTPBLDL EQU   CVTMAP+92                                                02006000
CVTTPC   EQU   CVTMAP+88                                                02007000
CVTSVDCB EQU   CVTMAP+84                                                02008000
CVTBRET  EQU   CVTMAP+82                                                02009000
CVTEXIT  EQU   CVTMAP+80                                                02010000
CVT0FN00 EQU   CVTMAP+76                                                02011000
CVTDARA  EQU   CVTDAR+1                                                 02012000
CVTRSV07 EQU   CVTFLGS1                                                 02013000
CVTRSV06 EQU   CVTFLGS1                                                 02014000
CVTRSV05 EQU   CVTFLGS1                                                 02015000
CVTRSV04 EQU   CVTFLGS1                                                 02016000
CVTRSV03 EQU   CVTFLGS1                                                 02017000
CVTRSV02 EQU   CVTFLGS1                                                 02018000
CVTRSV01 EQU   CVTFLGS1                                                 02019000
CVTDMPLK EQU   CVTFLGS1                                                 02020000
CVTXITP  EQU   CVTMAP+68                                                02021000
CVTZDTAB EQU   CVTMAP+64                                                02022000
CVTMSLT  EQU   CVTMAP+60                                                02023000
CVTDATE  EQU   CVTMAP+56                                                02024000
CVTBTERM EQU   CVTMAP+52                                                02025000
CVTSYSAD EQU   CVTMAP+48                                                02026000
CVTXTLER EQU   CVTMAP+44                                                02027000
CVTILK2  EQU   CVTMAP+40                                                02028000
CVTILK1  EQU   CVTMAP+36                                                02029000
CVTPRLTV EQU   CVTMAP+32                                                02030000
CVTPCNVT EQU   CVTMAP+28                                                02031000
CVT0VL00 EQU   CVTMAP+24                                                02032000
CVTXAPG  EQU   CVTMAP+20                                                02033000
CVTBUF   EQU   CVTMAP+16                                                02034000
CVTJOB   EQU   CVTMAP+12                                                02035000
CVTLINK  EQU   CVTMAP+8                                                 02036000
CVT0EF00 EQU   CVTMAP+4                                                 02037000
CVT      EQU   CVTMAP                                                   02038000
@NM00048 EQU   SDWA+512                                                 02039000
SDWAVRA  EQU   SDWARA+4                                                 02040000
SDWAURAL EQU   SDWARA+3                                                 02041000
@NM00047 EQU   SDWADPVA                                                 02042000
SDWAEBC  EQU   SDWADPVA                                                 02043000
SDWAHEX  EQU   SDWADPVA                                                 02044000
SDWAVRAL EQU   SDWARA                                                   02045000
@NM00046 EQU   SDWA+396                                                 02046000
SDWACOMP EQU   SDWA+392                                                 02047000
SDWARCPL EQU   SDWA+364                                                 02048000
@NM00045 EQU   SDWADPSA+32                                              02049000
SDWATO4  EQU   SDWADPSL+28                                              02050000
SDWAFRM4 EQU   SDWADPSL+24                                              02051000
SDWATO3  EQU   SDWADPSL+20                                              02052000
SDWAFRM3 EQU   SDWADPSL+16                                              02053000
SDWATO2  EQU   SDWADPSL+12                                              02054000
SDWAFRM2 EQU   SDWADPSL+8                                               02055000
SDWATO1  EQU   SDWADPSL+4                                               02056000
SDWAFRM1 EQU   SDWADPSL                                                 02057000
@NM00044 EQU   SDWADDAT+3                                               02058000
@NM00043 EQU   SDWAPDAT                                                 02059000
SDWAUSPL EQU   SDWAPDAT                                                 02060000
SDWADPSW EQU   SDWAPDAT                                                 02061000
SDWATJPA EQU   SDWAPDAT                                                 02062000
SDWATLPA EQU   SDWAPDAT                                                 02063000
SDWADREG EQU   SDWAPDAT                                                 02064000
SDWADSAH EQU   SDWAPDAT                                                 02065000
SDWADSAS EQU   SDWAPDAT                                                 02066000
@NM00042 EQU   SDWADDAT+1                                               02067000
@NM00041 EQU   SDWASDAT                                                 02068000
SDWAQQS  EQU   SDWASDAT                                                 02069000
SDWACBS  EQU   SDWASDAT                                                 02070000
SDWAGTF  EQU   SDWASDAT                                                 02071000
SDWASWA  EQU   SDWASDAT                                                 02072000
SDWALSQA EQU   SDWASDAT                                                 02073000
SDWASQA  EQU   SDWASDAT                                                 02074000
SDWANUC  EQU   SDWASDAT                                                 02075000
@NM00040 EQU   SDWADUMP+2                                               02076000
@NM00039 EQU   SDWADPFS                                                 02077000
SDWASLST EQU   SDWADPFS                                                 02078000
@NM00038 EQU   SDWADPFS                                                 02079000
SDWADLST EQU   SDWADPFS                                                 02080000
SDWADPT  EQU   SDWADPFS                                                 02081000
SDWADPID EQU   SDWADUMP                                                 02082000
SDWADPLA EQU   SDWA+316                                                 02083000
SDWAREXN EQU   SDWARECP+16                                              02084000
SDWACSCT EQU   SDWARECP+8                                               02085000
SDWAMODN EQU   SDWARECP                                                 02086000
@NM00037 EQU   SDWALKWA+32                                              02087000
SDWATALW EQU   SDWALKWS+28                                              02088000
SDWATDLW EQU   SDWALKWS+24                                              02089000
SDWATNLW EQU   SDWALKWS+20                                              02090000
SDWAAPLW EQU   SDWALKWS+16                                              02091000
SDWAIPLW EQU   SDWALKWS+12                                              02092000
SDWAILLW EQU   SDWALKWS+8                                               02093000
SDWAIULW EQU   SDWALKWS+4                                               02094000
SDWAICLW EQU   SDWALKWS                                                 02095000
SDWAFLLK EQU   SDWAACF4                                                 02096000
SDWACMS  EQU   SDWAACF4                                                 02097000
SDWAOPTM EQU   SDWAACF4                                                 02098000
SDWATADB EQU   SDWAACF4                                                 02099000
SDWATDNB EQU   SDWAACF4                                                 02100000
SDWATNCB EQU   SDWAACF4                                                 02101000
SDWAILCH EQU   SDWAACF4                                                 02102000
SDWAIUCB EQU   SDWAACF4                                                 02103000
SDWAICAT EQU   SDWAACF3                                                 02104000
SDWAIPRG EQU   SDWAACF3                                                 02105000
SDWASALL EQU   SDWAACF3                                                 02106000
SDWAASMP EQU   SDWAACF3                                                 02107000
SDWADISP EQU   SDWAACF3                                                 02108000
@NM00036 EQU   SDWAACF3                                                 02109000
@NM00035 EQU   SDWAACF2                                                 02110000
SDWAFREE EQU   SDWAACF2                                                 02111000
SDWAUPRG EQU   SDWAACF2                                                 02112000
@NM00034 EQU   SDWAACF2                                                 02113000
SDWASPIN EQU   SDWAACF2                                                 02114000
@NM00033 EQU   SDWAACF2                                                 02115000
SDWARCRD EQU   SDWAACF2                                                 02116000
SDWALCPU EQU   SDWACPUA+2                                               02117000
@NM00032 EQU   SDWACPUA                                                 02118000
SDWARECA EQU   SDWA+244                                                 02119000
@NM00031 EQU   SDWA+239                                                 02120000
@NM00030 EQU   SDWAIOFS                                                 02121000
SDWANIOP EQU   SDWAIOFS                                                 02122000
SDWANOIO EQU   SDWAIOFS                                                 02123000
SDWAIOHT EQU   SDWAIOFS                                                 02124000
SDWAIOQR EQU   SDWAIOFS                                                 02125000
SDWAFMID EQU   SDWA+236                                                 02126000
@NM00029 EQU   SDWAERRD                                                 02127000
SDWAMCIV EQU   SDWAERRD                                                 02128000
SDWARPIV EQU   SDWAERRD                                                 02129000
SDWAMABD EQU   SDWAERRD                                                 02130000
SDWACTS  EQU   SDWAERRD                                                 02131000
SDWASTAE EQU   SDWAERRD                                                 02132000
SDWANRBE EQU   SDWAERRD                                                 02133000
SDWACLUP EQU   SDWAERRD                                                 02134000
@NM00028 EQU   SDWAERRC                                                 02135000
SDWAEAS  EQU   SDWAERRC                                                 02136000
SDWAPERC EQU   SDWAERRC                                                 02137000
SDWAIRB  EQU   SDWAERRC                                                 02138000
SDWASTAI EQU   SDWAERRC                                                 02139000
SDWASTAF EQU   SDWAERRC                                                 02140000
SDWASRBM EQU   SDWAERRB                                                 02141000
SDWALDIS EQU   SDWAERRB                                                 02142000
SDWAENRB EQU   SDWAERRB                                                 02143000
SDWATYP1 EQU   SDWAERRB                                                 02144000
@NM00027 EQU   SDWAERRB                                                 02145000
SDWAPGIO EQU   SDWAERRA                                                 02146000
SDWATEXC EQU   SDWAERRA                                                 02147000
SDWASVCE EQU   SDWAERRA                                                 02148000
SDWAABTM EQU   SDWAERRA                                                 02149000
SDWASVCD EQU   SDWAERRA                                                 02150000
SDWARKEY EQU   SDWAERRA                                                 02151000
SDWAMCHK EQU   SDWAERRA                                                 02152000
SDWATIME EQU   SDWAMCH+20                                               02153000
SDWARFSA EQU   SDWAMCH+16                                               02154000
@NM00026 EQU   SDWAMCH+14                                               02155000
SDWAVEQR EQU   SDWARSR2                                                 02156000
SDWAPGFX EQU   SDWARSR2                                                 02157000
SDWAFLSQ EQU   SDWARSR2                                                 02158000
SDWAFSQA EQU   SDWARSR2                                                 02159000
SDWANUCL EQU   SDWARSR2                                                 02160000
SDWASPER EQU   SDWARSR2                                                 02161000
SDWAINTC EQU   SDWARSR2                                                 02162000
SDWAOFLN EQU   SDWARSR2                                                 02163000
SDWACHNG EQU   SDWARSR1                                                 02164000
SDWAMSER EQU   SDWARSR1                                                 02165000
@NM00025 EQU   SDWARSR1                                                 02166000
SDWACPID EQU   SDWAMCH+10                                               02167000
SDWATERR EQU   SDWAMCHD                                                 02168000
SDWAFPRX EQU   SDWAMCHD                                                 02169000
SDWAINSF EQU   SDWAMCHD                                                 02170000
SDWAACR  EQU   SDWAMCHD                                                 02171000
SDWASCK  EQU   SDWAMCHD                                                 02172000
SDWAPSWU EQU   SDWAMCHD                                                 02173000
SDWAREGU EQU   SDWAMCHD                                                 02174000
SDWASKYF EQU   SDWAMCHD                                                 02175000
@NM00024 EQU   SDWAMCHS                                                 02176000
SDWARSRF EQU   SDWAMCHS                                                 02177000
SDWARSRC EQU   SDWAMCHS                                                 02178000
SDWAINVP EQU   SDWAMCHS                                                 02179000
SDWATSVL EQU   SDWAMCHS                                                 02180000
SDWARCDF EQU   SDWAMCHS                                                 02181000
SDWASRVL EQU   SDWAMCHS                                                 02182000
SDWASCKE EQU   SDWASTCK+4                                               02183000
SDWASCKB EQU   SDWASTCK                                                 02184000
SDWALNTH EQU   SDWAIDNT+1                                               02185000
SDWASPID EQU   SDWAIDNT                                                 02186000
SDWASR15 EQU   SDWASRSV+60                                              02187000
SDWASR14 EQU   SDWASRSV+56                                              02188000
SDWASR13 EQU   SDWASRSV+52                                              02189000
SDWASR12 EQU   SDWASRSV+48                                              02190000
SDWASR11 EQU   SDWASRSV+44                                              02191000
SDWASR10 EQU   SDWASRSV+40                                              02192000
SDWASR09 EQU   SDWASRSV+36                                              02193000
SDWASR08 EQU   SDWASRSV+32                                              02194000
SDWASR07 EQU   SDWASRSV+28                                              02195000
SDWASR06 EQU   SDWASRSV+24                                              02196000
SDWASR05 EQU   SDWASRSV+20                                              02197000
SDWASR04 EQU   SDWASRSV+16                                              02198000
SDWASR03 EQU   SDWASRSV+12                                              02199000
SDWASR02 EQU   SDWASRSV+8                                               02200000
SDWASR01 EQU   SDWASRSV+4                                               02201000
SDWASR00 EQU   SDWASRSV                                                 02202000
SDWATRN2 EQU   SDWAAEC2+4                                               02203000
SDWAIPC2 EQU   SDWAICD2                                                 02204000
SDWAIMC2 EQU   SDWAICD2                                                 02205000
SDWAIPR2 EQU   SDWAICD2                                                 02206000
@NM00023 EQU   SDWAINC2                                                 02207000
@NM00022 EQU   SDWAILC2                                                 02208000
SDWAIL2  EQU   SDWAILC2                                                 02209000
@NM00021 EQU   SDWAILC2                                                 02210000
@NM00020 EQU   SDWAAEC2                                                 02211000
SDWAADD2 EQU   SDWANXT2+1                                               02212000
@NM00019 EQU   SDWANXT2                                                 02213000
@NM00018 EQU   SDWAEC2+3                                                02214000
SDWASGN2 EQU   SDWAINT2                                                 02215000
SDWAEXP2 EQU   SDWAINT2                                                 02216000
SDWADEC2 EQU   SDWAINT2                                                 02217000
SDWAFPO2 EQU   SDWAINT2                                                 02218000
SDWACC2  EQU   SDWAINT2                                                 02219000
@NM00017 EQU   SDWAINT2                                                 02220000
SDWAPGM2 EQU   SDWAMWP2                                                 02221000
SDWAWAT2 EQU   SDWAMWP2                                                 02222000
SDWAMCK2 EQU   SDWAMWP2                                                 02223000
SDWAECT2 EQU   SDWAMWP2                                                 02224000
SDWAKEY2 EQU   SDWAMWP2                                                 02225000
SDWAEXT2 EQU   SDWAEMK2                                                 02226000
SDWAIO2  EQU   SDWAEMK2                                                 02227000
SDWATRM2 EQU   SDWAEMK2                                                 02228000
@NM00016 EQU   SDWAEMK2                                                 02229000
SDWAPER2 EQU   SDWAEMK2                                                 02230000
@NM00015 EQU   SDWAEMK2                                                 02231000
SDWATRAN EQU   SDWAAEC1+4                                               02232000
SDWAIPC1 EQU   SDWAICD1                                                 02233000
SDWAIMC1 EQU   SDWAICD1                                                 02234000
SDWAIPR1 EQU   SDWAICD1                                                 02235000
@NM00014 EQU   SDWAINC1                                                 02236000
@NM00013 EQU   SDWAILC1                                                 02237000
SDWAIL1  EQU   SDWAILC1                                                 02238000
@NM00012 EQU   SDWAILC1                                                 02239000
@NM00011 EQU   SDWAAEC1                                                 02240000
SDWAADD1 EQU   SDWANXT1+1                                               02241000
@NM00010 EQU   SDWANXT1                                                 02242000
@NM00009 EQU   SDWAEC1+3                                                02243000
SDWASGN1 EQU   SDWAINT1                                                 02244000
SDWAEXP1 EQU   SDWAINT1                                                 02245000
SDWADEC1 EQU   SDWAINT1                                                 02246000
SDWAFPO1 EQU   SDWAINT1                                                 02247000
SDWACC1  EQU   SDWAINT1                                                 02248000
@NM00008 EQU   SDWAINT1                                                 02249000
SDWAPGM1 EQU   SDWAMWP1                                                 02250000
SDWAWAT1 EQU   SDWAMWP1                                                 02251000
SDWAMCK1 EQU   SDWAMWP1                                                 02252000
SDWAECT1 EQU   SDWAMWP1                                                 02253000
SDWAKEY1 EQU   SDWAMWP1                                                 02254000
SDWAEXT1 EQU   SDWAEMK1                                                 02255000
SDWAIO1  EQU   SDWAEMK1                                                 02256000
SDWATRM1 EQU   SDWAEMK1                                                 02257000
@NM00007 EQU   SDWAEMK1                                                 02258000
SDWAPER1 EQU   SDWAEMK1                                                 02259000
@NM00006 EQU   SDWAEMK1                                                 02260000
SDWAIOBR EQU   SDWA+100                                                 02261000
SDWAEPA  EQU   SDWA+96                                                  02262000
@NM00005 EQU   SDWANAME+4                                               02263000
SDWARBAD EQU   SDWANAME                                                 02264000
SDWAGR15 EQU   SDWAGRSV+60                                              02265000
SDWAGR14 EQU   SDWAGRSV+56                                              02266000
SDWAGR13 EQU   SDWAGRSV+52                                              02267000
SDWAGR12 EQU   SDWAGRSV+48                                              02268000
SDWAGR11 EQU   SDWAGRSV+44                                              02269000
SDWAGR10 EQU   SDWAGRSV+40                                              02270000
SDWAGR09 EQU   SDWAGRSV+36                                              02271000
SDWAGR08 EQU   SDWAGRSV+32                                              02272000
SDWAGR07 EQU   SDWAGRSV+28                                              02273000
SDWAGR06 EQU   SDWAGRSV+24                                              02274000
SDWAGR05 EQU   SDWAGRSV+20                                              02275000
SDWAGR04 EQU   SDWAGRSV+16                                              02276000
SDWAGR03 EQU   SDWAGRSV+12                                              02277000
SDWAGR02 EQU   SDWAGRSV+8                                               02278000
SDWAGR01 EQU   SDWAGRSV+4                                               02279000
SDWAGR00 EQU   SDWAGRSV                                                 02280000
SDWANXTP EQU   SDWACTL2+5                                               02281000
SDWASGP  EQU   SDWAPMKP                                                 02282000
SDWAEUP  EQU   SDWAPMKP                                                 02283000
SDWADOP  EQU   SDWAPMKP                                                 02284000
SDWAFPP  EQU   SDWAPMKP                                                 02285000
SDWACCP  EQU   SDWAPMKP                                                 02286000
SDWAILP  EQU   SDWAPMKP                                                 02287000
SDWAINTP EQU   SDWACTL2+2                                               02288000
SDWASPVP EQU   SDWAMWPP                                                 02289000
SDWAWATP EQU   SDWAMWPP                                                 02290000
SDWAMCKP EQU   SDWAMWPP                                                 02291000
@NM00004 EQU   SDWAMWPP                                                 02292000
SDWAKEYP EQU   SDWAMWPP                                                 02293000
SDWAEXTP EQU   SDWACMKP                                                 02294000
SDWAIOP  EQU   SDWACMKP                                                 02295000
SDWANXTA EQU   SDWACTL1+5                                               02296000
SDWASGA  EQU   SDWAPMKA                                                 02297000
SDWAEUA  EQU   SDWAPMKA                                                 02298000
SDWADOA  EQU   SDWAPMKA                                                 02299000
SDWAFPA  EQU   SDWAPMKA                                                 02300000
SDWACCA  EQU   SDWAPMKA                                                 02301000
SDWAILA  EQU   SDWAPMKA                                                 02302000
SDWAINTA EQU   SDWACTL1+2                                               02303000
SDWASPVA EQU   SDWAMWPA                                                 02304000
SDWAWATA EQU   SDWAMWPA                                                 02305000
SDWAMCKA EQU   SDWAMWPA                                                 02306000
@NM00003 EQU   SDWAMWPA                                                 02307000
SDWAKEYA EQU   SDWAMWPA                                                 02308000
SDWAEXTA EQU   SDWACMKA                                                 02309000
SDWAIOA  EQU   SDWACMKA                                                 02310000
@NM00002 EQU   SDWACMPF                                                 02311000
SDWASTCC EQU   SDWACMPF                                                 02312000
@NM00001 EQU   SDWACMPF                                                 02313000
SDWASTEP EQU   SDWACMPF                                                 02314000
SDWAREQ  EQU   SDWACMPF                                                 02315000
@NM00151 EQU   PSA+3668                                                 02316000
PSASTAK  EQU   PSA+3072                                                 02317000
@NM00150 EQU   PSA+1048                                                 02318000
PSAUSEND EQU   PSA+1048                                                 02319000
PSARV062 EQU   PSA+1044                                                 02320000
PSACDAL  EQU   PSA+1040                                                 02321000
PSAWTCOD EQU   PSA+1036                                                 02322000
PSAATCVT EQU   PSA+1032                                                 02323000
PSAPCPSW EQU   PSA+1024                                                 02324000
PSAPIR2  EQU   PSA+1020                                                 02325000
PSARV059 EQU   PSA+1018                                                 02326000
PSASVC13 EQU   PSA+1016                                                 02327000
PSALSFCC EQU   PSA+1012                                                 02328000
PSASFACC EQU   PSA+1008                                                 02329000
PSASTOP  EQU   PSA+992                                                  02330000
PSASTART EQU   PSA+976                                                  02331000
PSARSPSW EQU   PSA+968                                                  02332000
PSASRPSW EQU   PSA+960                                                  02333000
PSARV045 EQU   PSA+892                                                  02334000
PSARV044 EQU   PSA+888                                                  02335000
PSARV043 EQU   PSA+884                                                  02336000
PSARV042 EQU   PSA+880                                                  02337000
PSARV041 EQU   PSA+876                                                  02338000
PSARV040 EQU   PSA+872                                                  02339000
PSARV025 EQU   PSA+868                                                  02340000
PSADSSED EQU   PSA+868                                                  02341000
PSADSSPR EQU   PSA+864                                                  02342000
PSADSSFW EQU   PSA+860                                                  02343000
PSADSS14 EQU   PSA+856                                                  02344000
PSADSSPP EQU   PSA+848                                                  02345000
PSADSSRP EQU   PSA+840                                                  02346000
PSADSS05 EQU   PSADSSF4                                                 02347000
PSADSS10 EQU   PSADSSF4                                                 02348000
PSADSSVE EQU   PSADSSF4                                                 02349000
PSADSSDE EQU   PSADSSF4                                                 02350000
PSADSSC0 EQU   PSADSSF4                                                 02351000
PSADSSIE EQU   PSADSSF4                                                 02352000
PSADSS12 EQU   PSADSSF4                                                 02353000
PSADSSRC EQU   PSADSSF4                                                 02354000
PSARV057 EQU   PSADSSF3                                                 02355000
PSARV056 EQU   PSADSSF3                                                 02356000
PSARV055 EQU   PSADSSF3                                                 02357000
PSADSSMC EQU   PSADSSF3                                                 02358000
PSADSSRW EQU   PSADSSF3                                                 02359000
PSADSSNM EQU   PSADSSF3                                                 02360000
PSADSSES EQU   PSADSSF3                                                 02361000
PSADSSGP EQU   PSADSSF3                                                 02362000
PSADSSF2 EQU   PSADSSFL+1                                               02363000
PSADSSPI EQU   PSADSSF1                                                 02364000
PSADSSOI EQU   PSADSSF1                                                 02365000
PSADSSSP EQU   PSADSSF1                                                 02366000
PSADSSTP EQU   PSADSSF1                                                 02367000
PSADSSDW EQU   PSADSSF1                                                 02368000
PSADSSDD EQU   PSADSSF1                                                 02369000
PSADSSDM EQU   PSADSSF1                                                 02370000
PSADSSMV EQU   PSADSSF1                                                 02371000
PSADSSTS EQU   PSA+816                                                  02372000
PSADSSWK EQU   PSA+812                                                  02373000
PSADSSR3 EQU   PSA+808                                                  02374000
PSADSSR2 EQU   PSA+804                                                  02375000
PSADSSRS EQU   PSA+800                                                  02376000
PSASTOR  EQU   PSA+796                                                  02377000
PSACPUSA EQU   PSA+794                                                  02378000
PSAVSTAP EQU   PSA+792                                                  02379000
PSAWKVAP EQU   PSA+788                                                  02380000
PSAWKRAP EQU   PSA+784                                                  02381000
PSAMCHIC EQU   PSA+783                                                  02382000
PSARV061 EQU   PSA+782                                                  02383000
PSASYMSK EQU   PSA+781                                                  02384000
PSAMCHFL EQU   PSA+780                                                  02385000
PSACR0   EQU   PSA+776                                                  02386000
PSAPSWSV EQU   PSA+768                                                  02387000
PSACLHS  EQU   PSAHLHI                                                  02388000
PSALKR15 EQU   PSALKSA+60                                               02389000
PSALKR14 EQU   PSALKSA+56                                               02390000
PSALKR13 EQU   PSALKSA+52                                               02391000
PSALKR12 EQU   PSALKSA+48                                               02392000
PSALKR11 EQU   PSALKSA+44                                               02393000
PSALKR10 EQU   PSALKSA+40                                               02394000
PSALKR9  EQU   PSALKSA+36                                               02395000
PSALKR8  EQU   PSALKSA+32                                               02396000
PSALKR7  EQU   PSALKSA+28                                               02397000
PSALKR6  EQU   PSALKSA+24                                               02398000
PSALKR5  EQU   PSALKSA+20                                               02399000
PSALKR4  EQU   PSALKSA+16                                               02400000
PSALKR3  EQU   PSALKSA+12                                               02401000
PSALKR2  EQU   PSALKSA+8                                                02402000
PSALKR1  EQU   PSALKSA+4                                                02403000
PSALKR0  EQU   PSALKSA                                                  02404000
PSARV023 EQU   PSACLHT+52                                               02405000
PSALOCAL EQU   PSACLHT+48                                               02406000
PSACMSL  EQU   PSACLHT+44                                               02407000
PSAOPTL  EQU   PSACLHT+40                                               02408000
PSATPACL EQU   PSACLHT+36                                               02409000
PSATPDNL EQU   PSACLHT+32                                               02410000
PSATPNCL EQU   PSACLHT+28                                               02411000
PSAIOSLL EQU   PSACLHT+24                                               02412000
PSAIOSUL EQU   PSACLHT+20                                               02413000
PSAIOSCL EQU   PSACLHT+16                                               02414000
PSAIOSSL EQU   PSACLHT+12                                               02415000
PSASALCL EQU   PSACLHT+8                                                02416000
PSAASML  EQU   PSACLHT+4                                                02417000
PSADISPL EQU   PSACLHT                                                  02418000
PSASRSA  EQU   PSA+636                                                  02419000
PSARV050 EQU   PSA+634                                                  02420000
PSADSSGO EQU   PSA+633                                                  02421000
PSARECUR EQU   PSA+632                                                  02422000
PSAHLHIS EQU   PSA+628                                                  02423000
PSAIPCSA EQU   PSA+624                                                  02424000
@NM00149 EQU   PSA+621                                                  02425000
PSAIPCDM EQU   PSA+620                                                  02426000
PSAIPCD  EQU   PSA+616                                                  02427000
@NM00148 EQU   PSA+613                                                  02428000
PSAIPCRM EQU   PSA+612                                                  02429000
PSAIPCR  EQU   PSA+608                                                  02430000
PSAMCHEX EQU   PSA+600                                                  02431000
PSAMPSW  EQU   PSA+592                                                  02432000
PSAEXPS2 EQU   PSA+584                                                  02433000
PSAEXPS1 EQU   PSA+576                                                  02434000
PSAPIREG EQU   PSA+572                                                  02435000
PSARSREG EQU   PSA+568                                                  02436000
PSAGPREG EQU   PSA+556                                                  02437000
PSARV022 EQU   PSASUP4                                                  02438000
PSARV021 EQU   PSASUP4                                                  02439000
PSARV020 EQU   PSASUP4                                                  02440000
PSARV019 EQU   PSASUP4                                                  02441000
PSARV018 EQU   PSASUP4                                                  02442000
PSARV017 EQU   PSASUP4                                                  02443000
PSARV016 EQU   PSASUP4                                                  02444000
PSARV015 EQU   PSASUP4                                                  02445000
PSARV014 EQU   PSASUP3                                                  02446000
PSARV013 EQU   PSASUP3                                                  02447000
PSARV012 EQU   PSASUP3                                                  02448000
PSARV011 EQU   PSASUP3                                                  02449000
PSASPR   EQU   PSASUP3                                                  02450000
PSAPSREG EQU   PSASUP3                                                  02451000
PSAPI2   EQU   PSASUP3                                                  02452000
PSAIOSUP EQU   PSASUP3                                                  02453000
PSALCR   EQU   PSASUP2                                                  02454000
PSARTM   EQU   PSASUP2                                                  02455000
PSAACR   EQU   PSASUP2                                                  02456000
PSAIPCE2 EQU   PSASUP2                                                  02457000
PSAIPCES EQU   PSASUP2                                                  02458000
PSAIPCEC EQU   PSASUP2                                                  02459000
PSAGTF   EQU   PSASUP2                                                  02460000
PSAIPCRI EQU   PSASUP2                                                  02461000
PSARV063 EQU   PSASUP1                                                  02462000
PSATCTL  EQU   PSASUP1                                                  02463000
PSADISP  EQU   PSASUP1                                                  02464000
PSALOCK  EQU   PSASUP1                                                  02465000
PSAPI    EQU   PSASUP1                                                  02466000
PSAEXT   EQU   PSASUP1                                                  02467000
PSASVC   EQU   PSASUP1                                                  02468000
PSAIO    EQU   PSASUP1                                                  02469000
PSAANEW  EQU   PSA+544                                                  02470000
PSATOLD  EQU   PSA+540                                                  02471000
PSATNEW  EQU   PSA+536                                                  02472000
PSALCCAR EQU   PSA+532                                                  02473000
PSALCCAV EQU   PSA+528                                                  02474000
PSAPCCAR EQU   PSA+524                                                  02475000
PSAPCCAV EQU   PSA+520                                                  02476000
PSACPULA EQU   PSA+518                                                  02477000
PSACPUPA EQU   PSA+516                                                  02478000
PSAPSA   EQU   PSA+512                                                  02479000
FLCHDEND EQU   PSA+512                                                  02480000
FLCCRSAV EQU   FLCMCLA+280                                              02481000
FLCGRSAV EQU   FLCMCLA+216                                              02482000
FLCFPSAV EQU   FLCMCLA+184                                              02483000
FLCFLA   EQU   FLCMCLA+88                                               02484000
FLCRGNCD EQU   FLCMCLA+84                                               02485000
FLCFSAA  EQU   FLCFSA+1                                                 02486000
@NM00147 EQU   FLCFSA                                                   02487000
@NM00146 EQU   FLCMCLA+72                                               02488000
FLCMCIC  EQU   FLCMCLA+64                                               02489000
@NM00145 EQU   FLCMCLA+20                                               02490000
FLCIOAA  EQU   FLCIOA+1                                                 02491000
@NM00144 EQU   FLCIOA                                                   02492000
@NM00143 EQU   FLCMCLA+15                                               02493000
@NM00142 EQU   FLCMCLA+14                                               02494000
@NM00141 EQU   FLCMCLA+12                                               02495000
FLCLCL   EQU   FLCMCLA+8                                                02496000
FLCIOELA EQU   FLCIOEL+1                                                02497000
@NM00140 EQU   FLCIOEL                                                  02498000
FLCCHNID EQU   FLCMCLA                                                  02499000
@NM00139 EQU   PSA+160                                                  02500000
FLCMTRCD EQU   PSA+157                                                  02501000
@NM00138 EQU   PSA+156                                                  02502000
FLCPERA  EQU   FLCPER+1                                                 02503000
@NM00137 EQU   FLCPER                                                   02504000
@NM00136 EQU   PSA+151                                                  02505000
FLCPERCD EQU   PSA+150                                                  02506000
FLCMCNUM EQU   PSA+149                                                  02507000
@NM00135 EQU   PSA+148                                                  02508000
FLCTEAA  EQU   FLCTEA+1                                                 02509000
@NM00134 EQU   FLCTEA                                                   02510000
PSAPIPC  EQU   PSAPICOD                                                 02511000
PSAPIMC  EQU   PSAPICOD                                                 02512000
PSAPIPER EQU   PSAPICOD                                                 02513000
PSARV049 EQU   FLCPICOD                                                 02514000
FLCPILCB EQU   FLCPIILC                                                 02515000
@NM00133 EQU   FLCPIILC                                                 02516000
@NM00132 EQU   PSAEPPSW                                                 02517000
FLCSVCN  EQU   PSAESPSW+2                                               02518000
FLCSILCB EQU   FLCSVILC                                                 02519000
@NM00131 EQU   FLCSVILC                                                 02520000
@NM00130 EQU   PSAESPSW                                                 02521000
FLCEICOD EQU   PSAEEPSW+2                                               02522000
PSASPAD  EQU   PSAEEPSW                                                 02523000
@NM00129 EQU   PSA+128                                                  02524000
FLCINPSW EQU   PSA+120                                                  02525000
FLCMNPSW EQU   PSA+112                                                  02526000
FLCPNPSW EQU   PSA+104                                                  02527000
FLCSNPSW EQU   PSA+96                                                   02528000
FLCENPSW EQU   PSA+88                                                   02529000
FLCTRACE EQU   PSA+84                                                   02530000
FLCTIMER EQU   PSA+80                                                   02531000
FLCCVT2  EQU   PSA+76                                                   02532000
FLCCAW   EQU   PSA+72                                                   02533000
FLCCSW   EQU   PSA+64                                                   02534000
FLCIOPSW EQU   PSA+56                                                   02535000
FLCMOPSW EQU   PSA+48                                                   02536000
FLCPOPSW EQU   PSA+40                                                   02537000
FLCSOPSW EQU   PSA+32                                                   02538000
FLCEOPSW EQU   PSA+24                                                   02539000
@NM00128 EQU   FLCICCW2+4                                               02540000
FLCICCW1 EQU   FLCROPSW                                                 02541000
FLCIPPSW EQU   FLCRNPSW                                                 02542000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02543000
@RT00078 EQU   #BCM0001                                                 02544000
@ENDDATA EQU   *                                                        02545000
         END   IKT93EST,(C'PLS1501',0702,80033)                         02546000
