         TITLE ' *** IKTASTPT: TSO/VTAM ASID TPUT ROUTINE ***'          00001000
IKTASTPT CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'IKTASTPT  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @12,0                                               0001 00009000
@PSTART  DS    0H                                                  0001 00010000
         USING @PSTART,@12                                         0001 00011000
RBPRFXLN EQU 64                                                         00012000
RBPRFLNA EQU 32                                                         00013000
PRBLEN   EQU 136                                                        00014000
SIRBLEN  EQU 200                                                        00015000
TIRBLEN  EQU 136                                                        00016000
IRBLEN   EQU 128                                                        00017000
SVRBLEN  EQU 224                                                        00018000
*                                      INDICATING THAT IKTXMTPTS FRR    00019000
*                                      WAS ENTERED                   */ 00020000
*                                                                  0083 00021000
*/********************************************************************/ 00022000
*/*                                                                  */ 00023000
*/*      START OF IKTASTPT...ENTERED WITH LOCAL LOCK HELD            */ 00024000
*/*      OBTAIN CMS LOCK BEFORE REFERENCING TARGET TSB, SINCE TSB    */ 00025000
*/*         IS FREEMAINED WHEN ITS ADDRESS SPACE TERMINATES          */ 00026000
*/*                                                                  */ 00027000
*/********************************************************************/ 00028000
*                                                                  0083 00029000
*   XSATCBA=TCBPTR;                 /* SAVE TCB ADDRESS              */ 00030000
         STCM  TCBPTR,7,XSATCBA(RBSECPTR)                          0083 00031000
*   RFY                                                            0084 00032000
*     TCB BASED(XSATCBA);                                          0084 00033000
*   RFY                                                            0085 00034000
*     TCBPTR UNRSTD;                /* FREE-UP REGISTER              */ 00035000
*   GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);         0086 00036000
         SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,REGS=USE,                --00037000
               RELATED=(TSB,IKTASTPT(INITDATA,RETURN))                  00038000
*   XSAIDENQ='0'B;                  /* CLEAR ENQUEUE INDICATOR       */ 00039000
         NI    XSAIDENQ(RBSECPTR),B'01111111'                      0087 00040000
*   XSATVCSP=0;                     /* CLEAR TVCS ADDRESS            */ 00041000
         SLR   @08,@08                                             0088 00042000
         STCM  @08,7,XSATVCSP(RBSECPTR)                            0088 00043000
*   XSALOCKS='1'B;                  /* INDICATE CMS&LOCAL LOCKS HELD */ 00044000
         OI    XSALOCKS(RBSECPTR),B'00000100'                      0089 00045000
*   XSARC=CONTINUE;                 /* INIT. CODE TO PROCESS TPUT    */ 00046000
         IC    @08,CONTINUE                                        0090 00047000
         STC   @08,XSARC(,RBSECPTR)                                0090 00048000
*   CALL TERMSTAT;                  /* CHECK TARGET TERMINALS STATUS    00049000
*                                      TERMSTAT SETS XSARC           */ 00050000
         BAL   @14,TERMSTAT                                        0091 00051000
*   IF XSARC^=SUCCESS THEN                                         0092 00052000
         CLC   XSARC(1,RBSECPTR),SUCCESS                           0092 00053000
         BNE   @RT00092                                            0092 00054000
*     ;                             /* IF NOT AVAILABLE, RETURN      */ 00055000
*   ELSE                            /* TERMINAL AVAILABLE 'DO'       */ 00056000
*     DO;                                                          0094 00057000
*                                                                  0094 00058000
*       /*************************************************************/ 00059000
*       /*                                                           */ 00060000
*       /* TEST IF OTHER TERMINAL IS ALLOWING INTER-TERMINAL         */ 00061000
*       /* COMMUNICATIONS. IF NOT, THE CALLER MUST BE AUTHORIZED AND */ 00062000
*       /* HAVE SPECIFIED HIPRI ON THE TPUT                          */ 00063000
*       /*                                                           */ 00064000
*       /*************************************************************/ 00065000
*                                                                  0095 00066000
*       RFY                                                        0095 00067000
*        (REG15,                                                   0095 00068000
*         REG0) RSTD;                                              0095 00069000
*       GEN SETS(REG14,REG15,REG1,REG2,REG3) REFS(CVTAPF,CVT);     0096 00070000
         TESTAUTH FCTN=1,KEY=YES,STATE=YES,RBLEVEL=2,BRANCH=YES         00071000
*       RFY                                                        0097 00072000
*         REG0 UNRSTD;                                             0097 00073000
*       IF REG15=0 THEN             /* IS CALLER AUTHORIZED          */ 00074000
         LTR   REG15,REG15                                         0098 00075000
         BNZ   @RF00098                                            0098 00076000
*         XSAAUTH='1'B;             /* YES...SET INDICATOR           */ 00077000
         OI    XSAAUTH(RBSECPTR),B'00000010'                       0099 00078000
*       ELSE                                                       0100 00079000
*         DO;                                                      0100 00080000
         B     @RC00098                                            0100 00081000
@RF00098 DS    0H                                                  0101 00082000
*           XSAAUTH='0'B;           /* NO....SET INDICATOR           */ 00083000
         NI    XSAAUTH(RBSECPTR),B'11111101'                       0101 00084000
*           XSAPRIOR='1'B;          /* FORCE LOW PRIORITY            */ 00085000
         OI    XSAPRIOR(RBSECPTR),B'00100000'                      0102 00086000
*         END;                                                     0103 00087000
*       RFY                                                        0104 00088000
*         REG15 UNRSTD;                                            0104 00089000
@RC00098 DS    0H                                                  0105 00090000
*       IF TSBITOFF='1'B&           /* IS INTER-TERM. TURNED OFF     */ 00091000
*           (XSAAUTH='0'B|XSAPRIOR='1'B) THEN/* AND NOT AUTHORIZED,     00092000
*                                      OR 'LOPRI' SPECIFIED          */ 00093000
         TM    TSBITOFF(TSBPTR),B'00001000'                        0105 00094000
         BNO   @RF00105                                            0105 00095000
         TM    XSAAUTH(RBSECPTR),B'00000010'                       0105 00096000
         BZ    @RT00105                                            0105 00097000
         TM    XSAPRIOR(RBSECPTR),B'00100000'                      0105 00098000
         BNO   @RF00105                                            0105 00099000
@RT00105 DS    0H                                                  0106 00100000
*         XSARC=ITOFF;              /* SET RETURN CODE AND RETURN    */ 00101000
         MVI   XSARC(RBSECPTR),X'0C'                               0106 00102000
*       ELSE                                                       0107 00103000
*         DO;                       /* OK TO SEND MSG. ENQ ON ASID OF   00104000
*                                      TARGET TERMINAL SO THAT ONLY     00105000
*                                      ONE TPUT ASID CAN OCCUR AT A     00106000
*                                      TIME                          */ 00107000
*                                                                  0107 00108000
         B     @RC00105                                            0107 00109000
@RF00105 DS    0H                                                  0108 00110000
*           /*********************************************************/ 00111000
*           /*                                                       */ 00112000
*           /* RELEASE LOCKS BEFORE ENQUEUE SVC                      */ 00113000
*           /*                                                       */ 00114000
*           /*********************************************************/ 00115000
*                                                                  0108 00116000
*           GEN REFS(PSALITA,FLC) SETS(RTNREG,ENTRYREG,REG0,REG1); 0108 00117000
         SETLOCK RELEASE,TYPE=CMS,REGS=USE,RELATED=(AFTER-ENQ)          00118000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(AFTER-ENQ)        00119000
*           XSALOCKS='0'B;          /* INDICATE LOCKS NOT HELD       */ 00120000
         NI    XSALOCKS(RBSECPTR),B'11111011'                      0109 00121000
*           RFY                                                    0110 00122000
*            (REG1,                                                0110 00123000
*             REG2,                                                0110 00124000
*             REG3,                                                0110 00125000
*             REG15) RSTD;                                         0110 00126000
*           XSAWD5='FF000000'X;     /* INDICATE END OF PARM LIST     */ 00127000
         MVC   XSAWD5(4,RBSECPTR),@CF02287                         0111 00128000
*           REG1=ADDR(XSAENQAD);    /* ADDRESS OF ENQ WORK AREA      */ 00129000
         LA    REG1,XSAENQAD(,RBSECPTR)                            0112 00130000
*           REG2=ADDR(QNAME);       /* QNAME FOR ENQ - SYSZIGGI      */ 00131000
         LA    REG2,QNAME                                          0113 00132000
*           REG3=ADDR(XSAASID);     /* RNAME FOR ENQ - TARGET ASID   */ 00133000
         LA    REG3,XSAASID(,RBSECPTR)                             0114 00134000
*           IF XSANOWT='1'B THEN    /* NOWAIT OPTION REQUESTED ?     */ 00135000
         TM    XSANOWT(RBSECPTR),B'00010000'                       0115 00136000
         BNO   @RF00115                                            0115 00137000
*             DO;                   /* YES...CONDITIONAL ENQ         */ 00138000
*               GEN SETS(RTNREG);                                  0117 00139000
         ENQ   ((REG2),(REG3),E,2,SYSTEM),RET=USE,MF=(E,(1))            00140000
*               RFY                                                0118 00141000
*                 RCREG RSTD;                                      0118 00142000
*               IF RCREG^=SUCCESS THEN                             0119 00143000
         SLR   @14,@14                                             0119 00144000
         IC    @14,SUCCESS                                         0119 00145000
         CR    RCREG,@14                                           0119 00146000
         BE    @RF00119                                            0119 00147000
*                 XSARC=NOWAIT;     /* SET RETURN CODE FOR TPUT    0120 00148000
*                                      CALLER                        */ 00149000
         MVI   XSARC(RBSECPTR),X'04'                               0120 00150000
*               ELSE                                               0121 00151000
*                 XSAIDENQ='1'B;    /* CONTINUE TPUT PROCESSING AFTER   00152000
*                                      SETTING ENQ ED FLAG           */ 00153000
         B     @RC00119                                            0121 00154000
@RF00119 OI    XSAIDENQ(RBSECPTR),B'10000000'                      0121 00155000
*               RFY                                                0122 00156000
*                 RCREG UNRSTD;                                    0122 00157000
@RC00119 DS    0H                                                  0123 00158000
*             END;                  /* END OF CONDITIONAL ENQ        */ 00159000
*           ELSE                                                   0124 00160000
*             DO;                   /* WAIT OPTION...UNCONDITIONAL 0124 00161000
*                                      ENQ                           */ 00162000
         B     @RC00115                                            0124 00163000
@RF00115 DS    0H                                                  0125 00164000
*               GEN SETS(RTNREG);                                  0125 00165000
*                                   /* REGS 1,2,3 ARE RSTD          */  00166000
         ENQ   ((REG2),(REG3),E,2,SYSTEM),RET=NONE,MF=(E,(1))           00167000
*               XSAIDENQ='1'B;      /* SET ENQ ED FLAG               */ 00168000
         OI    XSAIDENQ(RBSECPTR),B'10000000'                      0126 00169000
*             END;                                                 0127 00170000
*         END;                      /* END OK TO SEND MSG 'DO'       */ 00171000
@RC00115 DS    0H                                                  0129 00172000
*     END;                          /* END TERMINAL AVAILABLE 'DO'   */ 00173000
@RC00105 DS    0H                                                  0130 00174000
*   IF XSARC^=CONTINUE THEN                                        0130 00175000
@RT00092 CLC   XSARC(1,RBSECPTR),CONTINUE                          0130 00176000
         BNE   @RT00130                                            0130 00177000
*     ;                             /* IF COND. ENQ FAILED,        0131 00178000
*                                      NOINTERCOM OR TERMINAL GONE,     00179000
*                                      THEN DO NOT CONTINUE          */ 00180000
*   ELSE                                                           0132 00181000
*     DO;                                                          0132 00182000
*       CALL DATAEDIT;              /* EDIT DATA IF 'TPUT EDIT'      */ 00183000
         BAL   @14,DATAEDIT                                        0133 00184000
*/*                                                                  */ 00185000
*/********************************************************************/ 00186000
*/*           OBTAIN SALLOC LOCK FOR GLOBAL ENTRY TO GETMAIN         */ 00187000
*/********************************************************************/ 00188000
*                                                                  0134 00189000
*       RFY                                                        0134 00190000
*        (REG0,                                                    0134 00191000
*         REG1,                                                    0134 00192000
*         REG2) RSTD;                                              0134 00193000
*       REG2=LENGTH(TVCS)+XSAPRMSZ+1;/* GET LENGTH FOR GETMAIN       */ 00194000
         LA    REG2,117                                            0135 00195000
         AH    REG2,XSAPRMSZ(,RBSECPTR)                            0135 00196000
*       GEN CODE SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);     00197000
         SETLOCK OBTAIN,TYPE=SALLOC,MODE=UNCOND,REGS=USE,             --00198000
               RELATED=(TVCS,SRB)                                       00199000
*                                                                  0137 00200000
*       /*************************************************************/ 00201000
*       /*                                                           */ 00202000
*       /* OBTAIN STORAGE FOR DATA,ETC IN CSA                        */ 00203000
*       /*                                                           */ 00204000
*       /*************************************************************/ 00205000
*                                                                  0137 00206000
*       REG0=REG2;                  /* GET LENGTH FOR GETMAIN        */ 00207000
         LR    REG0,REG2                                           0137 00208000
*       GEN CODE SETS(RTNREG,ENTRYREG,REG1,REG3,REG4) REFS(CVTSPSA,     00209000
*           CVTMAP,CVTGLMN,WSAG,WSAGGMFM);                         0138 00210000
         GETMAIN RU,LV=(0),SP=TVCSSP,BRANCH=(YES,GLOBAL),KEY=TVCSKEY    00211000
*       REG2=REG1;                  /* SAVE THE ADDRESS              */ 00212000
         LR    REG2,REG1                                           0139 00213000
*                                                                  0140 00214000
*       /*************************************************************/ 00215000
*       /*                                                           */ 00216000
*       /* RELEASE SALLOC LOCK                                       */ 00217000
*       /*                                                           */ 00218000
*       /*************************************************************/ 00219000
*                                                                  0140 00220000
*       GEN CODE SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);     00221000
         SETLOCK RELEASE,TYPE=SALLOC,REGS=USE,RELATED=(TVCS,SRB)        00222000
*       XSATVCSP=REG2;              /* SAVE ADDRESS OF TVCS          */ 00223000
         STCM  REG2,7,XSATVCSP(RBSECPTR)                           0141 00224000
*       TVCSSRBA=0;                 /* INITIALIZE IN CASE GETMAIN FOR   00225000
*                                      SRB FAILS                     */ 00226000
         L     @14,XSATVCSP-1(,RBSECPTR)                           0142 00227000
         LA    @14,0(,@14)                                         0142 00228000
         SLR   @08,@08                                             0142 00229000
         STCM  @08,7,TVCSSRBA(@14)                                 0142 00230000
*       XSASCHED=0;                 /* INITIALIZE TO 'IKTXMTPT HAS 0143 00231000
*                                      NOT BEEN SCHEDULED'           */ 00232000
         MVI   XSASCHED(RBSECPTR),X'00'                            0143 00233000
*/*                                                                  */ 00234000
*/********************************************************************/ 00235000
*/*           OBTAIN SALLOC LOCK FOR GLOBAL ENTRY TO GETMAIN         */ 00236000
*/********************************************************************/ 00237000
*                                                                  0144 00238000
*       GEN CODE SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);     00239000
         SETLOCK OBTAIN,TYPE=SALLOC,MODE=UNCOND,REGS=USE,             --00240000
               RELATED=(TVCS,SRB)                                       00241000
*                                                                  0145 00242000
*       /*************************************************************/ 00243000
*       /*                                                           */ 00244000
*       /* OBTAIN STORAGE FOR SRB                                    */ 00245000
*       /*                                                           */ 00246000
*       /*************************************************************/ 00247000
*                                                                  0145 00248000
*       REG0=LENGTH(SRB);           /* GET LENGTH FOR GETMAIN        */ 00249000
         LA    REG0,44                                             0145 00250000
*       GEN CODE SETS(RTNREG,ENTRYREG,REG3,REG4) REFS(CVTSPSA,CVTMAP,   00251000
*           CVTGLMN,WSAG,WSAGGMFM);                                0146 00252000
         GETMAIN RU,LV=(0),SP=SRBSP,BRANCH=(YES,GLOBAL),KEY=SRBKEY      00253000
*       REG2=REG1;                  /* SAVE ADR OF SRB AREA          */ 00254000
         LR    REG2,REG1                                           0147 00255000
*       RFY                                                        0148 00256000
*         SRBSECT BASED(TVCSSRBA);                                 0148 00257000
*                                                                  0149 00258000
*       /*************************************************************/ 00259000
*       /*                                                           */ 00260000
*       /* RELEASE SALLOC LOCK                                       */ 00261000
*       /*                                                           */ 00262000
*       /*************************************************************/ 00263000
*                                                                  0149 00264000
*       GEN CODE SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);     00265000
         SETLOCK RELEASE,TYPE=SALLOC,REGS=USE,RELATED=(TVCS,SRB)        00266000
*       TVCSSRBA=REG2;              /* SAVE ADDRESS OF SRB           */ 00267000
         L     @14,XSATVCSP-1(,RBSECPTR)                           0150 00268000
         STCM  REG2,7,TVCSSRBA(@14)                                0150 00269000
*       RFY                                                        0151 00270000
*        (REG0,                                                    0151 00271000
*         REG2,                                                    0151 00272000
*         REG1) UNRSTD;                                            0151 00273000
*                                                                  0152 00274000
*       /*************************************************************/ 00275000
*       /*                                                           */ 00276000
*       /* RE-OBTAIN LOCAL AND CMS LOCKS                             */ 00277000
*       /*                                                           */ 00278000
*       /*************************************************************/ 00279000
*                                                                  0152 00280000
*       GEN CODE SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);     00281000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,              --00282000
               RELATED=(TSB)                                            00283000
         SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,REGS=USE,                --00284000
               RELATED=(TSB)                                            00285000
*       XSALOCKS='1'B;              /* SET LOCKS HELD FLAG           */ 00286000
         OI    XSALOCKS(RBSECPTR),B'00000100'                      0153 00287000
*       CALL TERMSTAT;              /* SEE IF TARGET TERMINAL WENT 0154 00288000
*                                      DOWN WHILE CMS LOCK WAS     0154 00289000
*                                      RELEASED - SETS XSARC         */ 00290000
         BAL   @14,TERMSTAT                                        0154 00291000
*       IF XSARC^=CONTINUE THEN                                    0155 00292000
         CLC   XSARC(1,RBSECPTR),CONTINUE                          0155 00293000
         BNE   @RT00155                                            0155 00294000
*         ;                         /* TERMINAL DOWN                 */ 00295000
*       ELSE                                                       0157 00296000
*         IF TSBXCSAP^=0 THEN                                      0157 00297000
         L     @14,TSBEXTNT(,TSBPTR)                               0157 00298000
         L     @14,TSBXCSAP(,@14)                                  0157 00299000
         LTR   @14,@14                                             0157 00300000
         BZ    @RF00157                                            0157 00301000
*           XSARC=TERMCNCL;         /* IF NON-ZERO, THEN AN ASID TPUT   00302000
*                                      IS IN PROGRESS, THE SOURCE  0158 00303000
*                                      ADDRESS SPACE HAS ABENDED,  0158 00304000
*                                      CAUSING A DEQ OF THE ASID,  0158 00305000
*                                      THUS ALLOWING THIS ADDRESS  0158 00306000
*                                      SPACE TO ENQ PREMATURLY. TELL    00307000
*                                      CALLER THAT TERMINAL COULD NOT   00308000
*                                      BE REACHED                    */ 00309000
         MVI   XSARC(RBSECPTR),X'14'                               0158 00310000
*     END;                                                         0159 00311000
@RF00157 DS    0H                                                  0159 00312000
@RT00155 DS    0H                                                  0160 00313000
*   IF XSARC^=CONTINUE THEN                                        0160 00314000
@RT00130 CLC   XSARC(1,RBSECPTR),CONTINUE                          0160 00315000
         BNE   @RT00160                                            0160 00316000
*     ;                             /* IF COND ENQ FAILED,         0161 00317000
*                                      NOINTERCOM, TERMINAL GONE, OR    00318000
*                                      TSBCSAP ^=0, THEN DO NOT    0161 00319000
*                                      CONTINUE                      */ 00320000
*   ELSE                                                           0162 00321000
*     DO;                           /* SET-UP FOR SCHEDULE 'DO'      */ 00322000
*       TSBWTCB=XSATCBA;            /* SET WAITING TCB FOR XMPOST    */ 00323000
         MVC   TSBWTCB(3,TSBPTR),XSATCBA(RBSECPTR)                 0163 00324000
*       TSBWTJID=ASCBASID;          /* SET WAITING ASID FOR XMPOST   */ 00325000
         L     @14,ASCBPTR                                         0164 00326000
         LH    @14,ASCBASID(,@14)                                  0164 00327000
         N     @14,@CF02335                                        0164 00328000
         STH   @14,TSBWTJID(,TSBPTR)                               0164 00329000
*       TSBXCSAP=XSATVCSP;          /* SET TVCS ADDRESS FOR IKTAY8   */ 00330000
         L     @14,TSBEXTNT(,TSBPTR)                               0165 00331000
         L     @08,XSATVCSP-1(,RBSECPTR)                           0165 00332000
         LA    @08,0(,@08)                                         0165 00333000
         ST    @08,TSBXCSAP(,@14)                                  0165 00334000
*                                                                  0166 00335000
*       /*************************************************************/ 00336000
*       /*                                                           */ 00337000
*       /* RELEASE LOCAL AND CMS LOCKS...NO LONGER NEEDED            */ 00338000
*       /*                                                           */ 00339000
*       /*************************************************************/ 00340000
*                                                                  0166 00341000
*       GEN CODE SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);     00342000
         SETLOCK RELEASE,TYPE=CMS,REGS=USE,RELATED=(TSB)                00343000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(TSB)              00344000
*       XSALOCKS='0'B;              /* SET LOCKS HELD FLAG TO NOT  0167 00345000
*                                      HELD                          */ 00346000
         NI    XSALOCKS(RBSECPTR),B'11111011'                      0167 00347000
*       CALL INITTVCS;              /* GO INITIALIZE TVCS AREA       */ 00348000
         BAL   @14,INITTVCS                                        0168 00349000
*       CALL INITSRB;               /* GO INITIALIZE SRB AREA        */ 00350000
         BAL   @14,INITSRB                                         0169 00351000
*       XSARETY='0'B;               /* CLEAR RETRY INDICATOR...FRR   */ 00352000
         NI    XSARETY(RBSECPTR),B'11111110'                       0170 00353000
*       DO UNTIL XSADOSWT='0'B;                                    0171 00354000
@DL00171 DS    0H                                                  0172 00355000
*         XSADOSWT='0'B;            /* CLEAR DO UNTIL SWITCH         */ 00356000
*                                                                  0172 00357000
         NI    XSADOSWT(RBSECPTR),B'11101111'                      0172 00358000
*         /***********************************************************/ 00359000
*         /*                                                         */ 00360000
*         /* SCHEDULE IKTXMTPT IN TARGET ADDRESS SPACE               */ 00361000
*         /*                                                         */ 00362000
*         /***********************************************************/ 00363000
*                                                                  0173 00364000
*         RFY                                                      0173 00365000
*           REG1 RSTD;                                             0173 00366000
*         TVCSECB=0;                /* CLEAR ECB             @ZA31080*/ 00367000
         L     @14,XSATVCSP-1(,RBSECPTR)                           0174 00368000
         LA    @14,0(,@14)                                         0174 00369000
         SLR   @08,@08                                             0174 00370000
         ST    @08,TVCSECB(,@14)                                   0174 00371000
*         REG1=TVCSSRBA;            /* SET SRB ADDRESS FOR SCHEDULE  */ 00372000
         L     REG1,TVCSSRBA-1(,@14)                               0175 00373000
         LA    REG1,0(,REG1)                                       0175 00374000
*         GEN CODE SETS(REG0,REG15) REFS(CVTLSMQ,CVTMAP,SRBFLNK,SRBSECT 00375000
*             ,SRBPTR)(SCHEDULE SRB=(1),SCOPE=LOCAL);              0176 00376000
         SCHEDULE SRB=(1),SCOPE=LOCAL                                   00377000
*         XSASCHED=1;               /* SET IKTXMTPT AS SCHEDULED     */ 00378000
         MVI   XSASCHED(RBSECPTR),X'01'                            0177 00379000
*                                                                  0178 00380000
*         /***********************************************************/ 00381000
*         /*                                                         */ 00382000
*         /* WAIT FOR TARGET ADDRESS SPACE TO POST THIS TASK         */ 00383000
*         /*                                                         */ 00384000
*         /***********************************************************/ 00385000
*                                                                  0178 00386000
*         REG1=ADDR(TVCSECB);       /* SET ECB ADDRESS FOR WAIT      */ 00387000
         L     REG1,XSATVCSP-1(,RBSECPTR)                          0178 00388000
         LA    REG1,0(,REG1)                                       0178 00389000
         LA    REG1,TVCSECB(,REG1)                                 0178 00390000
*         GEN CODE SETS(REG0) REFS(REG0)(WAIT ECB=(1),LONG=YES);   0179 00391000
         WAIT ECB=(1),LONG=YES                                          00392000
*         RFY                                                      0180 00393000
*           REG1 UNRSTD;                                           0180 00394000
*                                                                  0181 00395000
*         /***********************************************************/ 00396000
*         /*                                                         */ 00397000
*         /* CALLER HAS BEEN POSTED. CHECK POST CODE FOR UNSUCCESSFUL*/ 00398000
*         /* RETURN CODE                                             */ 00399000
*         /*                                                         */ 00400000
*         /***********************************************************/ 00401000
*                                                                  0181 00402000
*         IF TVCSCODE=TERMCNCL THEN                                0181 00403000
         L     @14,XSATVCSP-1(,RBSECPTR)                           0181 00404000
         CLC   TVCSCODE(3,@14),@CF01039+1                          0181 00405000
         BNE   @RF00181                                            0181 00406000
*           XSARC=TERMCNCL;         /* UNSUCCESSFUL...SET RETURN CODE   00407000
*                                      AND RETURN                    */ 00408000
         MVI   XSARC(RBSECPTR),X'14'                               0182 00409000
*         ELSE                                                     0183 00410000
*           DO;                     /* POST CODE NOT TERMCNCL 'DO'   */ 00411000
         B     @RC00181                                            0183 00412000
@RF00181 DS    0H                                                  0184 00413000
*                                                                  0184 00414000
*             /*******************************************************/ 00415000
*             /*                                                     */ 00416000
*             /* RE-OBTAIN LOCAL & CMS LOCKS AND VERIFY THAT TERMINAL*/ 00417000
*             /* IS STILL THERE                                      */ 00418000
*             /*                                                     */ 00419000
*             /*******************************************************/ 00420000
*                                                                  0184 00421000
*             GEN CODE SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC 00422000
*                 );                                               0184 00423000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,              --00424000
               RELATED=(TSB)                                            00425000
         SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,REGS=USE,                --00426000
               RELATED=(TSB)                                            00427000
*             XSALOCKS='1'B;        /* SET LOCKS HELD FLAG           */ 00428000
         OI    XSALOCKS(RBSECPTR),B'00000100'                      0185 00429000
*             CALL TERMSTAT;        /* VERIFY TERMINAL IS STILL THERE*/ 00430000
         BAL   @14,TERMSTAT                                        0186 00431000
*             IF XSARC^=CONTINUE THEN                              0187 00432000
         CLC   XSARC(1,RBSECPTR),CONTINUE                          0187 00433000
         BNE   @RT00187                                            0187 00434000
*               ;                   /* NO, RETURN                    */ 00435000
*             ELSE                                                 0189 00436000
*               IF TVCSCODE^=FRRENTRD THEN/* CODE=SUCCESS|NOWAIT?    */ 00437000
         L     @14,XSATVCSP-1(,RBSECPTR)                           0189 00438000
         L     @14,TVCSCODE-1(,@14)                                0189 00439000
         LA    @14,0(,@14)                                         0189 00440000
         C     @14,@CF00058                                        0189 00441000
         BE    @RF00189                                            0189 00442000
*                 DO;               /* YES...CLEAR TSB INDICATORS    */ 00443000
*                   TSBWTCB=0;      /* CLEAR CALLING TCB FIELD       */ 00444000
         SLR   @08,@08                                             0191 00445000
         STCM  @08,7,TSBWTCB(TSBPTR)                               0191 00446000
*                   TSBWTJID=0;     /* CLEAR CALLING ASID FIELD      */ 00447000
         STH   @08,TSBWTJID(,TSBPTR)                               0192 00448000
*                   TSBXCSAP=0;     /* CLEAR PTR TO TVCS             */ 00449000
         L     @04,TSBEXTNT(,TSBPTR)                               0193 00450000
         ST    @08,TSBXCSAP(,@04)                                  0193 00451000
*                   IF TVCSCODE=SUCCESS THEN/* IF SUCCESSFUL, UPDATE    00452000
*                                      SMF LINE COUNT                */ 00453000
         SLR   @04,@04                                             0194 00454000
         IC    @04,SUCCESS                                         0194 00455000
         CR    @14,@04                                             0194 00456000
         BNE   @RF00194                                            0194 00457000
*                     IF TCBTCT^=0 THEN/* IS SMF RUNNING ?           */ 00458000
         L     @14,XSATCBA-1(,RBSECPTR)                            0195 00459000
         L     @14,TCBTCT(,@14)                                    0195 00460000
         CR    @14,@08                                             0195 00461000
         BE    @RF00195                                            0195 00462000
*                       TCTLOUT=TCTLOUT+1;/* YES, INCREMENT LINE   0196 00463000
*                                      COUNT                         */ 00464000
         LA    @08,1                                               0196 00465000
         AL    @08,TCTLOUT(,@14)                                   0196 00466000
         ST    @08,TCTLOUT(,@14)                                   0196 00467000
*                     ELSE                                         0197 00468000
*                       ;                                          0197 00469000
@RF00195 DS    0H                                                  0198 00470000
*                   ELSE                                           0198 00471000
*                     XSARC=TVCSCODE;/* SET RC TO NOWAIT             */ 00472000
         B     @RC00194                                            0198 00473000
@RF00194 L     @14,XSATVCSP-1(,RBSECPTR)                           0198 00474000
         L     @14,TVCSCODE-1(,@14)                                0198 00475000
         STC   @14,XSARC(,RBSECPTR)                                0198 00476000
*                 END;              /* END SUCCESS OR NOWAIT         */ 00477000
*               ELSE                                               0200 00478000
*                 IF XSARETY='1'B THEN/* HAS REQUEST BEEN RETRYED ?  */ 00479000
         B     @RC00189                                            0200 00480000
@RF00189 TM    XSARETY(RBSECPTR),B'00000001'                       0200 00481000
         BNO   @RF00200                                            0200 00482000
*                   DO;             /* YES...TERMINAL CANT BE REACHED*/ 00483000
*                     XSARC=TERMCNCL;                              0202 00484000
         MVI   XSARC(RBSECPTR),X'14'                               0202 00485000
*                     TSBWTCB=0;    /* CLEAR CALLING TCB FIELD       */ 00486000
         SLR   @14,@14                                             0203 00487000
         STCM  @14,7,TSBWTCB(TSBPTR)                               0203 00488000
*                     TSBWTJID=0;   /* CLEAR CALLING ASID FIELD      */ 00489000
         STH   @14,TSBWTJID(,TSBPTR)                               0204 00490000
*                     TSBXCSAP=0;   /* CLEAR PTR TO TVCS             */ 00491000
         L     @08,TSBEXTNT(,TSBPTR)                               0205 00492000
         ST    @14,TSBXCSAP(,@08)                                  0205 00493000
*                   END;            /* END RETRY UNSUCCESSFUL        */ 00494000
*                 ELSE                                             0207 00495000
*                   DO;             /* RETRY THE                   0207 00496000
*                                      REQUEST...RE-SCHEDULE IKTXMTPT*/ 00497000
         B     @RC00200                                            0207 00498000
@RF00200 DS    0H                                                  0208 00499000
*                     XSARETY='1'B; /* SET RETRY FLAG                */ 00500000
*                     XSADOSWT='1'B;/* SET 'DO UNTIL' CONTROL TO   0209 00501000
*                                      CONTINUE                      */ 00502000
         OI    XSARETY(RBSECPTR),B'00010001'                       0209 00503000
*                     GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA, 00504000
*                         FLC);                                    0210 00505000
         SETLOCK RELEASE,TYPE=CMS,REGS=USE,RELATED=(TSB)                00506000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(TSB)              00507000
*                     XSALOCKS='0'B;/* LOCKS NOT HELD                */ 00508000
         NI    XSALOCKS(RBSECPTR),B'11111011'                      0211 00509000
*                   END;                                           0212 00510000
*           END;                    /* END 'POST CODE NOT TERMCNCL'  */ 00511000
@RC00200 DS    0H                                                  0213 00512000
@RC00189 DS    0H                                                  0213 00513000
@RT00187 DS    0H                                                  0214 00514000
*       END;                        /* END OF 'DO UNTIL'...LOOP    0214 00515000
*                                      CONTINUES ONLY FOR RE-SCHED OF   00516000
*                                      IKTXMTPT BECAUSE FRR WAS    0214 00517000
*                                      ENTERED                       */ 00518000
@RC00181 DS    0H                                                  0214 00519000
@DE00171 TM    XSADOSWT(RBSECPTR),B'00010000'                      0214 00520000
         BNZ   @DL00171                                            0214 00521000
*     END;                          /* END 'SET-UP FOR SCHED DO'     */ 00522000
*                                                                  0216 00523000
*/********************************************************************/ 00524000
*/*                                                                  */ 00525000
*/*      END OF ASID TPUT REQUEST PROCESSING.                        */ 00526000
*/*      FREE LOCKS AND CSA AREAS IF NECESSARY.                      */ 00527000
*/*      DEQUEUE THE ASID IF ENQUEUED.                               */ 00528000
*/*      RETURN TO CALLER                                            */ 00529000
*/*                                                                  */ 00530000
*/********************************************************************/ 00531000
*                                                                  0216 00532000
*   IF XSALOCKS='1'B THEN           /* IF LOCKS HELD, FREE THEM      */ 00533000
@RT00160 TM    XSALOCKS(RBSECPTR),B'00000100'                      0216 00534000
         BNO   @RF00216                                            0216 00535000
*     DO;                                                          0217 00536000
*       GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);     0218 00537000
         SETLOCK RELEASE,TYPE=CMS,REGS=USE,RELATED=(TSB)                00538000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,RELATED=(TSB)              00539000
*     END;                                                         0219 00540000
*   IF XSATVCSP^=0 THEN             /* CSA STORAGE OBTAINED ?        */ 00541000
@RF00216 L     @14,XSATVCSP-1(,RBSECPTR)                           0220 00542000
         LA    @14,0(,@14)                                         0220 00543000
         LTR   @14,@14                                             0220 00544000
         BZ    @RF00220                                            0220 00545000
*     DO;                           /* YES...FREE IT                 */ 00546000
*                                                                  0222 00547000
*       /*************************************************************/ 00548000
*       /*                                                           */ 00549000
*       /* OBTAIN SALLOC LOCK FOR GLOBAL FREEMAIN                    */ 00550000
*       /*                                                           */ 00551000
*       /*************************************************************/ 00552000
*                                                                  0222 00553000
*       RFY                                                        0222 00554000
*        (REG0,                                                    0222 00555000
*         REG2,                                                    0222 00556000
*         REG6,                                                    0222 00557000
*         REG7) RSTD;                                              0222 00558000
*       REG2=TVCSSRBA;              /* GET ADDRESS FOR SRB FREEMN    */ 00559000
         L     REG2,TVCSSRBA-1(,@14)                               0223 00560000
         LA    REG2,0(,REG2)                                       0223 00561000
*       REG6=TVCSGMSZ;              /* GET LENGTH FOR TVCS FREEMN    */ 00562000
         LH    REG6,TVCSGMSZ(,@14)                                 0224 00563000
*       REG7=XSATVCSP;              /* GET ADDR FOR TVCS FREEMN      */ 00564000
         LR    REG7,@14                                            0225 00565000
*       GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC);     0226 00566000
         SETLOCK OBTAIN,TYPE=SALLOC,MODE=UNCOND,REGS=USE,             --00567000
               RELATED=(TVCS,SRB)                                       00568000
*                                                                  0227 00569000
*       /*************************************************************/ 00570000
*       /*                                                           */ 00571000
*       /* FREE SRB AREA                                             */ 00572000
*       /*                                                           */ 00573000
*       /*************************************************************/ 00574000
*                                                                  0227 00575000
*       REG0=LENGTH(SRB);           /* GET LENGTH FOR FREEMAIN       */ 00576000
         LA    REG0,44                                             0227 00577000
*       GEN SETS(RTNREG,ENTRYREG,REG1,REG3,REG4) REFS(CVTSPSA,CVTMAP,   00578000
*           WSAGGMFM,WSAG,CVTGLMN);                                0228 00579000
         FREEMAIN RU,LV=(0),A=(REG2),SP=SRBSP,KEY=SRBKEY,             --00580000
               BRANCH=(YES,GLOBAL)                                      00581000
*                                                                  0229 00582000
*       /*************************************************************/ 00583000
*       /*                                                           */ 00584000
*       /* FREE TVCS AREA                                            */ 00585000
*       /*                                                           */ 00586000
*       /*************************************************************/ 00587000
*                                                                  0229 00588000
*       REG0=REG6;                  /* GET LENGTH FOR FREEMAIN       */ 00589000
         LR    REG0,REG6                                           0229 00590000
*       GEN SETS(RTNREG,ENTRYREG,REG1,REG3,REG4) REFS(CVTSPSA,CVTMAP,   00591000
*           WSAGGMFM,WSAG,CVTGLMN);                                0230 00592000
         FREEMAIN RU,LV=(0),A=(REG7),SP=TVCSSP,KEY=TVCSKEY,           --00593000
               BRANCH=(YES,GLOBAL)                                      00594000
*       RFY                                                        0231 00595000
*        (REG0,                                                    0231 00596000
*         REG2,                                                    0231 00597000
*         REG6,                                                    0231 00598000
*         REG7) UNRSTD;                                            0231 00599000
*                                                                  0232 00600000
*       /*************************************************************/ 00601000
*       /*                                                           */ 00602000
*       /* RELEASE SALLOC LOCK                                       */ 00603000
*       /*                                                           */ 00604000
*       /*************************************************************/ 00605000
*                                                                  0232 00606000
*       GEN SETS(RTNREG,ENTRYREG,REG0,REG1) REFS(PSALITA,FLC)      0232 00607000
*           (SETLOCK RELEASE,TYPE=SALLOC,REGS=USE,RELATED=(TVCS,SRB));  00608000
         SETLOCK RELEASE,TYPE=SALLOC,REGS=USE,RELATED=(TVCS,SRB)        00609000
*       XSATVCSP=0;                 /* CLEAR PTR SO 93EST WONT FREE  */ 00610000
         SLR   @14,@14                                             0233 00611000
         STCM  @14,7,XSATVCSP(RBSECPTR)                            0233 00612000
*     END;                          /* END FREE STORAGE 'DO'         */ 00613000
*   IF XSAIDENQ='1'B THEN           /* ASID ENQUEUED ?               */ 00614000
@RF00220 TM    XSAIDENQ(RBSECPTR),B'10000000'                      0235 00615000
         BNO   @RF00235                                            0235 00616000
*     DO;                           /* YES, DEQUEUE IT               */ 00617000
*       RFY                                                        0237 00618000
*        (REG1,                                                    0237 00619000
*         REG2,                                                    0237 00620000
*         REG3) RSTD;                                              0237 00621000
*       XSAWD5='FF000000'X;         /* INIT ENQ LIST FORM            */ 00622000
         MVC   XSAWD5(4,RBSECPTR),@CF02287                         0238 00623000
*       REG1=ADDR(XSAENQAD);        /* ADDRESS OF DEQ WORK AREA      */ 00624000
         LA    REG1,XSAENQAD(,RBSECPTR)                            0239 00625000
*       REG2=ADDR(QNAME);           /* GET QNAME ADDRESS FOR GEN     */ 00626000
         LA    REG2,QNAME                                          0240 00627000
*       REG3=ADDR(XSAASID);         /* GET RNAME ADDRESS FOR GEN     */ 00628000
         LA    REG3,XSAASID(,RBSECPTR)                             0241 00629000
*       GEN SETS(RTNREG)                                           0242 00630000
*           (DEQ ((REG2),(REG3),2,SYSTEM),RET=HAVE,MF=(E,(REG1)) );     00631000
         DEQ ((REG2),(REG3),2,SYSTEM),RET=HAVE,MF=(E,(REG1))            00632000
*     END;                                                         0243 00633000
*                                                                  0244 00634000
*/********************************************************************/ 00635000
*/*            RESET TCB INDICATORS & RETURN                         */ 00636000
*/********************************************************************/ 00637000
*                                                                  0244 00638000
*   TCBTIOTG='0'B;                  /* CLEAR ATTN INDICATOR IN TCB   */ 00639000
@RF00235 L     @14,XSATCBA-1(,RBSECPTR)                            0244 00640000
         LA    @14,0(,@14)                                         0244 00641000
         NI    TCBTIOTG(@14),B'11101111'                           0244 00642000
*   IF XSATCBFX='1'B THEN           /* WERE ASYNCHRONOUS EXITS     0245 00643000
*                                      ALLOWED ON ENTRY ?            */ 00644000
         TM    XSATCBFX(RBSECPTR),B'00100000'                      0245 00645000
         BNO   @RF00245                                            0245 00646000
*     TCBFX='0'B;                   /* YES, RESET TCB ASYN EXIT IND. */ 00647000
         NI    TCBFX(@14),B'11111110'                              0246 00648000
*   RFY                                                            0247 00649000
*     RTNREG RSTD;                                                 0247 00650000
@RF00245 DS    0H                                                  0248 00651000
*   RTNREG=XSARETG;                 /* RESTORE RETURN ADDRESS        */ 00652000
         L     RTNREG,XSARETG(,RBSECPTR)                           0248 00653000
*   RETURN CODE(XSARC);             /* RETURN TO ADDRESS THAT WAS IN    00654000
*                                      REG.14 ON SVC ENTRY, WITH TPUT   00655000
*                                      RETURN CODE IN REG15          */ 00656000
         SLR   @15,@15                                             0249 00657000
         IC    @15,XSARC(,RBSECPTR)                                0249 00658000
@EL00001 DS    0H                                                  0249 00659000
@EF00001 DS    0H                                                  0249 00660000
@ER00001 BR    @14                                                 0249 00661000
*   RFY                                                            0250 00662000
*     RTNREG UNRSTD;                                               0250 00663000
*TERMSTAT:                                                         0251 00664000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0251 00665000
TERMSTAT DS    0H                                                  0252 00666000
*                                                                  0252 00667000
*/********************************************************************/ 00668000
*/*                                                                  */ 00669000
*/*     TERMSTAT IS AN INTERNAL PROCEDURE THAT EXAMINES THE          */ 00670000
*/*     STATUS OF THE TARGET TERMINAL.                               */ 00671000
*/*     IT RETURNS A CODE OF 14HEX IF THE TARGET TERMINAL HAS GONE   */ 00672000
*/*     AND A CODE OF 0 OTHERWISE.                                   */ 00673000
*/*  ****TERMSTAT SAVES RETURN ADDRESS IN FIRST LEVEL                */ 00674000
*/*      'SAVE WORD' - XSASAVEA                                      */ 00675000
*/*                                                                  */ 00676000
*/********************************************************************/ 00677000
*                                                                  0252 00678000
*   RFY                                                            0252 00679000
*     RTNREG RSTD;                                                 0252 00680000
*   XSASAVEA=RTNREG;                /* SAVE RETURN ADDRESS           */ 00681000
         ST    RTNREG,XSASAVEA(,RBSECPTR)                          0253 00682000
*   RFY                                                            0254 00683000
*     RTNREG UNRSTD;                                               0254 00684000
*   XSARC=TERMCNCL;                 /* INITIALIZE RETURN CODE        */ 00685000
         MVI   XSARC(RBSECPTR),X'14'                               0255 00686000
*   RFY                                                            0256 00687000
*     ASCB BASED(ASVTENTY(XSAASID));/* THE ASVT POINTS TO THE ASCB S    00688000
*                                      ADDRESS. BASE THE ASCB ON THE    00689000
*                                      ENTRY SPECIFIED BY THE ASID   */ 00690000
*   IF CVTTCASP^=0 THEN             /* IS TSO/VTAM UP ? YES IT IS    */ 00691000
         L     @14,CVTPTR                                          0257 00692000
         L     @08,CVTTCASP(,@14)                                  0257 00693000
         LTR   @08,@08                                             0257 00694000
         BZ    @RF00257                                            0257 00695000
*     IF ASVTAVAL(XSAASID)='0'B THEN/* CHECK IF ASID SLOT IN ASVT  0258 00696000
*                                      INDICATES IT IS ASSIGNED      */ 00697000
         LH    @08,XSAASID(,RBSECPTR)                              0258 00698000
         SLA   @08,2                                               0258 00699000
         L     @14,ASVTPTR(,@14)                                   0258 00700000
         ALR   @08,@14                                             0258 00701000
         TM    ASVTAVAL-4(@08),B'10000000'                         0258 00702000
         BNZ   @RF00258                                            0258 00703000
*       IF ASCBTSB=TSBPTR THEN      /* TSB ADDRESS MATCHES THAT    0259 00704000
*                                      PASSED BY IKT0009C    @ZM43323*/ 00705000
         LH    @08,XSAASID(,RBSECPTR)                              0259 00706000
         SLA   @08,2                                               0259 00707000
         L     @14,ASVTENTY-4(@08,@14)                             0259 00708000
         C     TSBPTR,ASCBTSB(,@14)                                0259 00709000
         BNE   @RF00259                                            0259 00710000
*         DO;                                                      0260 00711000
*                                                                  0261 00712000
*           /*********************************************************/ 00713000
*           /*                                                       */ 00714000
*           /* YES...ADDRESSES AGREE. CONTINUE IF SESSION IS         */ 00715000
*           /* COMPLETELY INITIALIZED(TSBXACTV), SESSION ISNT BEING  */ 00716000
*           /* CANCELLED,OR ISNT DISCONNECTED WAITING FOR            */ 00717000
*           /* LOGON-RECONNECT                                       */ 00718000
*           /*                                                       */ 00719000
*           /*********************************************************/ 00720000
*                                                                  0261 00721000
*           XSATASCB=ASVTENTY(XSAASID);/* SAVE TARGET ASCB           */ 00722000
         ST    @14,XSATASCB(,RBSECPTR)                             0261 00723000
*           IF TSBCANC='0'B&TSBDISC='0'B&TSBXACTV='1'B THEN        0262 00724000
         TM    TSBCANC(TSBPTR),B'00000100'                         0262 00725000
         BNZ   @RF00262                                            0262 00726000
         TM    TSBDISC(TSBPTR),B'00000100'                         0262 00727000
         BNZ   @RF00262                                            0262 00728000
         L     @14,TSBEXTNT(,TSBPTR)                               0262 00729000
         TM    TSBXACTV(@14),B'01000000'                           0262 00730000
         BNO   @RF00262                                            0262 00731000
*             XSARC=CONTINUE;                                      0263 00732000
         IC    @14,CONTINUE                                        0263 00733000
         STC   @14,XSARC(,RBSECPTR)                                0263 00734000
*         END;                                                     0264 00735000
@RF00262 DS    0H                                                  0265 00736000
*   RFY                                                            0265 00737000
*     ASCB BASED(ASCBPTR);                                         0265 00738000
@RF00259 DS    0H                                                  0265 00739000
@RF00258 DS    0H                                                  0265 00740000
@RF00257 DS    0H                                                  0266 00741000
*   RFY                                                            0266 00742000
*     RTNREG RSTD;                                                 0266 00743000
*   RTNREG=XSASAVEA;                /* RESTORE RETURN ADDRESS        */ 00744000
         L     RTNREG,XSASAVEA(,RBSECPTR)                          0267 00745000
*   RFY                                                            0268 00746000
*     RTNREG UNRSTD;                                               0268 00747000
*   END TERMSTAT;                                                  0269 00748000
@EL00002 DS    0H                                                  0269 00749000
@EF00002 DS    0H                                                  0269 00750000
@ER00002 BR    @14                                                 0269 00751000
*INITTVCS:                                                         0270 00752000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0270 00753000
INITTVCS DS    0H                                                  0271 00754000
*                                                                  0271 00755000
*/********************************************************************/ 00756000
*/*                                                                  */ 00757000
*/*      INITTVCS INITIALIZES THE CSA DATA AREA 'TVCS', THAT IS      */ 00758000
*/*      USED TO MOVE THE TPUT DATA TO THE LOCAL AREA OF THE TARGET  */ 00759000
*/*      TERMINALS ADDRESS SPACE.                                    */ 00760000
*/*  ****INITTVCS SAVES RETURN ADDRESS IN FIRST LEVEL                */ 00761000
*/*      'SAVE WORD' - XSASAVEA                                      */ 00762000
*/*                                                                  */ 00763000
*/********************************************************************/ 00764000
*                                                                  0271 00765000
*   RFY                                                            0271 00766000
*     RTNREG RSTD;                                                 0271 00767000
*   XSASAVEA=RTNREG;                /* SAVE RETURN ADDRESS           */ 00768000
         ST    RTNREG,XSASAVEA(,RBSECPTR)                          0272 00769000
*   RFY                                                            0273 00770000
*     RTNREG UNRSTD;                                               0273 00771000
*   CALL VERIFY;                    /* VERIFY DATA IN CALLERS KEY    */ 00772000
         BAL   @14,VERIFY                                          0274 00773000
*                                                                  0275 00774000
*/**TVCSECB INITIALIZED BEFORE WAIT IS ISSUED****                    */ 00775000
*                                                                  0275 00776000
*   TVCSDASZ=XSAPRMSZ;              /* DEFINE TPUT DATA SIZE         */ 00777000
         L     @14,XSATVCSP-1(,RBSECPTR)                           0275 00778000
         LA    @14,0(,@14)                                         0275 00779000
         LH    @08,XSAPRMSZ(,RBSECPTR)                             0275 00780000
         STH   @08,TVCSDASZ(,@14)                                  0275 00781000
*   TVCSGMSZ=LENGTH(TVCS)+XSAPRMSZ+1;/* DEFINE TOTAL GETMAIN SIZE    */ 00782000
         LA    @04,117                                             0276 00783000
         ALR   @04,@08                                             0276 00784000
         STH   @04,TVCSGMSZ(,@14)                                  0276 00785000
*   TVCSOPTN=XSAOPTNS;              /* DEFINE TPUT OPTIONS           */ 00786000
         IC    @04,XSAOPTNS(,RBSECPTR)                             0277 00787000
         STC   @04,TVCSOPTN(,@14)                                  0277 00788000
*/**TVCSSRBA INITIALIZED AFTER GETMAIN FOR SRB********               */ 00789000
*                                                                  0278 00790000
*   TVCSASCB=ASCBPTR;               /* DEFINE CALLERS ASCB           */ 00791000
         L     @04,ASCBPTR                                         0278 00792000
         ST    @04,TVCSASCB(,@14)                                  0278 00793000
*   TVCSINDS=0;                     /* CLEAR INDICATORS              */ 00794000
         SLR   @04,@04                                             0279 00795000
         ST    @04,TVCSINDS(,@14)                                  0279 00796000
*                                                                  0280 00797000
*/********************************************************************/ 00798000
*/*      MOVE IN DATA. FIRST MOVE IN '+' IF CALLER                   */ 00799000
*/*      ISNT AUTHORIZED                                             */ 00800000
*/********************************************************************/ 00801000
*                                                                  0280 00802000
*   RFY                                                            0280 00803000
*    (REG0,                                                        0280 00804000
*     REG1,                                                        0280 00805000
*     REG2,                                                        0280 00806000
*     REG3) RSTD;                   /* RESTRICT FOR MVCL             */ 00807000
*   REG0=ADDR(TVCSDATA);            /* TARGET ADDRESS FOR MVCL       */ 00808000
         LA    REG0,TVCSDATA(,@14)                                 0281 00809000
*   REG1=XSAPRMSZ;                  /* TARGET SIZE FOR MVCL          */ 00810000
         LR    REG1,@08                                            0282 00811000
*   REG2=XSABFRAD;                  /* SOURCE ADDRESS FOR MVCL       */ 00812000
         L     REG2,XSABFRAD-1(,RBSECPTR)                          0283 00813000
         LA    REG2,0(,REG2)                                       0283 00814000
*   REG3=REG1;                      /* SOURCE SIZE FOR MVCL          */ 00815000
         LR    REG3,REG1                                           0284 00816000
*   IF XSAAUTH='0'B THEN            /* CALLER AUTHORIZED ?           */ 00817000
         TM    XSAAUTH(RBSECPTR),B'00000010'                       0285 00818000
         BNZ   @RF00285                                            0285 00819000
*     DO;                           /* NO                            */ 00820000
*       TVCSDATA(1:1)=PLUSSIGN;     /* INSERT '+'                    */ 00821000
         MVI   TVCSDATA(@14),C'+'                                  0287 00822000
*       TVCSDASZ=TVCSDASZ+1;        /* ADJUST SIZE OF TPUT           */ 00823000
         LA    @04,1                                               0288 00824000
         ALR   @08,@04                                             0288 00825000
         STH   @08,TVCSDASZ(,@14)                                  0288 00826000
*       REG0=REG0+1;                /* ADJUST TARGET ADDRESS OF MVCL    00827000
*                                      TO POINT PAST '+'             */ 00828000
         ALR   REG0,@04                                            0289 00829000
*     END;                                                         0290 00830000
*   MVCL(REG0,REG2);                /* MOVE DATA INTO TVCS           */ 00831000
@RF00285 MVCL  REG0,REG2                                           0291 00832000
*   RFY                                                            0292 00833000
*    (REG0,                                                        0292 00834000
*     REG1,                                                        0292 00835000
*     REG2,                                                        0292 00836000
*     REG3) UNRSTD;                                                0292 00837000
*   RFY                                                            0293 00838000
*     RTNREG RSTD;                                                 0293 00839000
*   RTNREG=XSASAVEA;                /* RESTORE RETURN ADDRESS        */ 00840000
         L     RTNREG,XSASAVEA(,RBSECPTR)                          0294 00841000
*   RETURN;                                                        0295 00842000
@EL00003 DS    0H                                                  0295 00843000
@EF00003 DS    0H                                                  0295 00844000
@ER00003 BR    @14                                                 0295 00845000
*   RFY                                                            0296 00846000
*     RTNREG UNRSTD;                                               0296 00847000
*   END INITTVCS;                                                  0297 00848000
*INITSRB:                                                          0298 00849000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0298 00850000
INITSRB  DS    0H                                                  0299 00851000
*                                                                  0299 00852000
*/********************************************************************/ 00853000
*/*                                                                  */ 00854000
*/*         INITSRB IS AN INTERNAL PROCEDURE THAT MOVES THE          */ 00855000
*/*         PROPER INFORMATION INTO THE SRB CONTROL BLOCK            */ 00856000
*/*         THAT IS USED TO SCHEDULE IKTXMTPT.                       */ 00857000
*/*      ****INITSRB SAVES RETURN ADDRESS IN FIRST LEVEL             */ 00858000
*/*          'SAVE WORD' - XSASAVEA                                  */ 00859000
*/*                                                                  */ 00860000
*/********************************************************************/ 00861000
*                                                                  0299 00862000
*   RFY                                                            0299 00863000
*     RTNREG RSTD;                                                 0299 00864000
*   XSASAVEA=RTNREG;                /* SAVE RETURN ADDRESS           */ 00865000
         ST    RTNREG,XSASAVEA(,RBSECPTR)                          0300 00866000
*   RFY                                                            0301 00867000
*     RTNREG UNRSTD;                                               0301 00868000
*   SRB=''B;                        /* ZERO OUT SRB                  */ 00869000
         L     @14,XSATVCSP-1(,RBSECPTR)                           0302 00870000
         LA    @14,0(,@14)                                         0302 00871000
         L     @08,TVCSSRBA-1(,@14)                                0302 00872000
         LA    @08,0(,@08)                                         0302 00873000
         XC    SRB(44,@08),SRB(@08)                                0302 00874000
*   SRBID='SRB ';                                                  0303 00875000
         MVC   SRBID(4,@08),@CC02308                               0303 00876000
*   SRBASCB=XSATASCB;               /* ADDRESS OF TARGET ASCB        */ 00877000
         L     @04,XSATASCB(,RBSECPTR)                             0304 00878000
         ST    @04,SRBASCB(,@08)                                   0304 00879000
*   SRBEP=ADDR(IKTXMTPT);           /* ADDRESS OF SRB ROUTINE        */ 00880000
         L     @04,@CV02269                                        0305 00881000
         ST    @04,SRBEP(,@08)                                     0305 00882000
*   SRBRMTR=ADDR(TCASBR14);         /* ADDRESS OF DUMMY RMTR. CLEANUP   00883000
*                                      IS DONE IN IKTAY8 AFTER PURGE */ 00884000
         L     @04,CVTPTR                                          0306 00885000
         L     @04,TCASTPTR(,@04)                                  0306 00886000
         LA    @04,TCASBR14(,@04)                                  0306 00887000
         ST    @04,SRBRMTR(,@08)                                   0306 00888000
*   SRBPARM=XSATVCSP;               /* SET FOR REG1=ADDR(TVCS) AT  0307 00889000
*                                      ENTRY TO IKTXMTPT             */ 00890000
         ST    @14,SRBPARM(,@08)                                   0307 00891000
*   SRBPASID=XSAASID;               /* PURGEDQ ASID IDENTIFIER       */ 00892000
         LH    @14,XSAASID(,RBSECPTR)                              0308 00893000
         STH   @14,SRBPASID(,@08)                                  0308 00894000
*   RFY                                                            0309 00895000
*     RTNREG RSTD;                                                 0309 00896000
*   RTNREG=XSASAVEA;                /* RESTORE RETURN ADDRESS        */ 00897000
         L     @08,XSASAVEA(,RBSECPTR)                             0310 00898000
         LR    RTNREG,@08                                          0310 00899000
*   RFY                                                            0311 00900000
*     RTNREG UNRSTD;                                               0311 00901000
*   END INITSRB;                                                   0312 00902000
@EL00004 DS    0H                                                  0312 00903000
@EF00004 DS    0H                                                  0312 00904000
@ER00004 BR    @14                                                 0312 00905000
*DATAEDIT:                                                         0313 00906000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0313 00907000
*                                                                  0313 00908000
DATAEDIT DS    0H                                                  0314 00909000
*/*                                                                  */ 00910000
*/********************************************************************/ 00911000
*/*                                                                  */ 00912000
*/*      DATA EDIT IS AN INTERNAL PROCEDURE THAT SCANS THE           */ 00913000
*/*      CALLER'S DATA AND REMOVES TRAILING BLANKS ADJUSTING         */ 00914000
*/*      THE BYTE COUNT ACCORDINGLY.                                 */ 00915000
*/*    **** DATAEDIT SAVES RETURN ADDRESS INTO THE LEVEL 'A'         */ 00916000
*/*         RETURN 'SAVE WORD' - XSASAVEA.                           */ 00917000
*/*                                                                  */ 00918000
*/********************************************************************/ 00919000
*/*                                                                  */ 00920000
*                                                                  0314 00921000
*   DCL                                                            0314 00922000
*     I REG(1);                                                    0314 00923000
*   DCL                                                            0315 00924000
*     BLANK CHAR(1) CONSTANT(' ');                                 0315 00925000
*   RFY                                                            0316 00926000
*     RTNREG RSTD;                                                 0316 00927000
*   XSASAVEA=RTNREG;                                               0317 00928000
         ST    RTNREG,XSASAVEA(,RBSECPTR)                          0317 00929000
*   RFY                                                            0318 00930000
*     RTNREG UNRSTD;                                               0318 00931000
*   IF XSAEDITO^='00'B THEN                                        0319 00932000
         TM    XSAEDITO(RBSECPTR),B'00000011'                      0319 00933000
         BNZ   @RT00319                                            0319 00934000
*     ;                             /* IF NOT EDIT, NO-OP            */ 00935000
*   ELSE                                                           0321 00936000
*     DO;                           /* EDIT OPTION-REMOVE TRAILING 0321 00937000
*                                      BLANKS                        */ 00938000
*       XSADMOVE='1'B;              /* SET DATA MOVE INDICATOR       */ 00939000
         OI    XSADMOVE(RBSECPTR),B'01000000'                      0322 00940000
*       RFY                                                        0323 00941000
*         REG2 RSTD;                                               0323 00942000
*       REG2=RBLINKB->RBOPSWB2;     /* POINT TO CALLERS KEY          */ 00943000
         L     @14,RBLINKB-1(,RBSECPTR)                            0324 00944000
         SLR   REG2,REG2                                           0324 00945000
         IC    REG2,RBOPSWB2(,@14)                                 0324 00946000
*       GEN SETS(REG2);                                            0325 00947000
        MODESET KEYADDR=(2),WORKREG=2                                   00948000
*       RFY                                                        0326 00949000
*         REG2 UNRSTD;                                             0326 00950000
*       RFY                                                        0327 00951000
*         I RSTD;                                                  0327 00952000
*       DO I=XSAPRMSZ TO 2 BY-1     /* SCAN FROM END OF DATA         */ 00953000
*             WHILE TPUTDATA(I)=BLANK;/* CONTINUE WHILE BLANK        */ 00954000
         LH    I,XSAPRMSZ(,RBSECPTR)                               0328 00955000
         B     @DE00328                                            0328 00956000
@DL00328 L     @14,XSABFRAD-1(,RBSECPTR)                           0328 00957000
         ALR   @14,I                                               0328 00958000
         BCTR  @14,0                                               0328 00959000
         CLI   TPUTDATA(@14),C' '                                  0328 00960000
         BNE   @DC00328                                            0328 00961000
*       END;                                                       0329 00962000
         BCTR  I,0                                                 0329 00963000
@DE00328 C     I,@CF00072                                          0329 00964000
         BNL   @DL00328                                            0329 00965000
@DC00328 DS    0H                                                  0330 00966000
*       RFY                                                        0330 00967000
*         REG2 RSTD;                                               0330 00968000
*       GEN SETS(REG2) REFS(RBLINK,RBOPSW,RBBASIC,TCBRBP);         0331 00969000
        MODESET EXTKEY=ZERO GET BACK INTO KEY 0                         00970000
*       RFY                                                        0332 00971000
*         REG2 UNRSTD;                                             0332 00972000
*       XSADMOVE='0'B;              /* CLEAR DATA MOVE INDICATOR     */ 00973000
         NI    XSADMOVE(RBSECPTR),B'10111111'                      0333 00974000
*       XSAPRMSZ=I;                 /* UPDATE TPUT SIZE. MIN VALUE IS   00975000
*                                      1, EVEN IF WHOLE TPUT IS BLANK*/ 00976000
         STH   I,XSAPRMSZ(,RBSECPTR)                               0334 00977000
*       RFY                                                        0335 00978000
*         I UNRSTD;                                                0335 00979000
*     END;                          /* END OF EDIT DO GROUP          */ 00980000
*   RFY                                                            0337 00981000
*     RTNREG RSTD;                                                 0337 00982000
@RT00319 DS    0H                                                  0338 00983000
*   RTNREG=XSASAVEA;                /* RESTORE RETURN ADDRESS        */ 00984000
         L     RTNREG,XSASAVEA(,RBSECPTR)                          0338 00985000
*   RETURN;                                                        0339 00986000
@EL00005 DS    0H                                                  0339 00987000
@EF00005 DS    0H                                                  0339 00988000
@ER00005 BR    @14                                                 0339 00989000
*   RFY                                                            0340 00990000
*     RTNREG UNRSTD;                                               0340 00991000
*   END DATAEDIT;                                                  0341 00992000
*VERIFY:                                                           0342 00993000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);                               0342 00994000
*                                                                  0342 00995000
VERIFY   DS    0H                                                  0343 00996000
*/*                                                                  */ 00997000
*/********************************************************************/ 00998000
*/*                                                                  */ 00999000
*/*      THIS TESTS IF CALLER'S DATA ADDRESS IS IN THE CALLER'S      */ 01000000
*/*      KEY. IT DOES SO BY REFERENCING THE FIRST BYTE OF EACH       */ 01001000
*/*      PAGE REQUIRED FOR THE TPUT.                                 */ 01002000
*/*    ***VERIFY SAVES RETURN ADDRESS INTO THE LEVEL 'B' RETURN      */ 01003000
*/*       'SAVE WORD' - XSASAVEB.                                    */ 01004000
*/*                                                                  */ 01005000
*/********************************************************************/ 01006000
*/*                                                                  */ 01007000
*                                                                  0343 01008000
*   DCL                                                            0343 01009000
*     APAGE FIXED(15) CONSTANT(4096);/* PAGE SIZE                    */ 01010000
*   DCL                                                            0344 01011000
*     MODULUS FIXED(8) CONSTANT(12);/* MODULUS OF A VS2 PAGE IS    0344 01012000
*                                      2**12=4096                    */ 01013000
*   RFY                                                            0345 01014000
*     RTNREG RSTD;                                                 0345 01015000
*   XSASAVEB=RTNREG;                /* SAVE RETURN ADDRESS           */ 01016000
         ST    RTNREG,XSASAVEB(,RBSECPTR)                          0346 01017000
*   RFY                                                            0347 01018000
*     RTNREG UNRSTD;                                               0347 01019000
*   XSADMOVE='1'B;                  /* INDICATE 'DATA VERIFICATION 0348 01020000
*                                      UNDERWAY'                     */ 01021000
         OI    XSADMOVE(RBSECPTR),B'01000000'                      0348 01022000
*/********************************************************************/ 01023000
*/*    GET INTO CALLER'S KEY TO VALIDATE DATA                        */ 01024000
*/********************************************************************/ 01025000
*                                                                  0349 01026000
*   RFY                                                            0349 01027000
*     REG2 RSTD;                                                   0349 01028000
*   REG2=RBLINKB->RBOPSWB2;         /* POINT TO KEY OF CALLER        */ 01029000
         L     @14,RBLINKB-1(,RBSECPTR)                            0350 01030000
         SLR   REG2,REG2                                           0350 01031000
         IC    REG2,RBOPSWB2(,@14)                                 0350 01032000
*   GEN SETS(REG2);                                                0351 01033000
        MODESET KEYADDR=(2),WORKREG=2                                   01034000
*   RFY                                                            0352 01035000
*     REG2 UNRSTD;                                                 0352 01036000
*   RFY                                                            0353 01037000
*     WORK1REG RSTD;                                               0353 01038000
*   WORK1REG=XSABFRAD;              /* GET INPUT BUFFER ADDRESS      */ 01039000
         L     WORK1REG,XSABFRAD-1(,RBSECPTR)                      0354 01040000
         LA    WORK1REG,0(,WORK1REG)                               0354 01041000
*   SRL(WORK1REG,MODULUS);          /* SHIFT OFF PARTIAL PAGE        */ 01042000
         SRL   WORK1REG,12                                         0355 01043000
*   SLL(WORK1REG,MODULUS);          /* SHIFT IN ZEROS                */ 01044000
         SLL   WORK1REG,12                                         0356 01045000
*/********************************************************************/ 01046000
*/*       LOOP THRU EACH PAGE, MOVING FIRST BYTE TO ITSELF           */ 01047000
*/*       ABEND WILL CAUSE IKT93EST TO GAIN CONTROL AND CHANGE       */ 01048000
*/*       CODE TO 15D X.                                             */ 01049000
*/********************************************************************/ 01050000
*                                                                  0357 01051000
*   RFY                                                            0357 01052000
*     WORK2REG RSTD;                                               0357 01053000
*   WORK2REG=XSABFRAD+XSAPRMSZ;     /* SET UP LOOP UPPER LIMIT       */ 01054000
         L     WORK2REG,XSABFRAD-1(,RBSECPTR)                      0358 01055000
         LA    WORK2REG,0(,WORK2REG)                               0358 01056000
         AH    WORK2REG,XSAPRMSZ(,RBSECPTR)                        0358 01057000
*   DO WHILE WORK1REG<WORK2REG;                                    0359 01058000
         B     @DE00359                                            0359 01059000
@DL00359 DS    0H                                                  0360 01060000
*     GEN REFS(WORK1REG)(CLC 0(1,WORK1REG),0(WORK1REG));/* REFERENCE    01061000
*                                      PAGE                          */ 01062000
         CLC 0(1,WORK1REG),0(WORK1REG)                                  01063000
*     WORK1REG=WORK1REG+APAGE;      /* INCREMENT BY PAGE SIZE        */ 01064000
         AL    WORK1REG,@CF02321                                   0361 01065000
*   END;                                                           0362 01066000
@DE00359 CR    WORK1REG,WORK2REG                                   0362 01067000
         BL    @DL00359                                            0362 01068000
*   RFY                                                            0363 01069000
*    (WORK1REG,                                                    0363 01070000
*     WORK2REG) UNRSTD;                                            0363 01071000
*                                                                  0363 01072000
*/********************************************************************/ 01073000
*/*         GET BACK INTO KEY 0                                      */ 01074000
*/********************************************************************/ 01075000
*                                                                  0364 01076000
*   GEN(MODESET EXTKEY=ZERO);                                      0364 01077000
         MODESET EXTKEY=ZERO                                            01078000
*   XSADMOVE='0'B;                  /* CLEAR INDICATOR THAT DATA   0365 01079000
*                                      VERIFICATION WAS GOING ON     */ 01080000
         NI    XSADMOVE(RBSECPTR),B'10111111'                      0365 01081000
*   RFY                                                            0366 01082000
*     RTNREG RSTD;                                                 0366 01083000
*   RTNREG=XSASAVEB;                                               0367 01084000
         L     RTNREG,XSASAVEB(,RBSECPTR)                          0367 01085000
*   RETURN;                                                        0368 01086000
@EL00006 DS    0H                                                  0368 01087000
@EF00006 DS    0H                                                  0368 01088000
@ER00006 BR    @14                                                 0368 01089000
*   RFY                                                            0369 01090000
*     RTNREG UNRSTD;                                               0369 01091000
*   END VERIFY;                                                    0370 01092000
*   END IKTASTPT                                                   0371 01093000
*                                                                  0371 01094000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01095000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01096000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 01097000
*/*%INCLUDE SYSLIB  (IHARB   )                                       */ 01098000
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */ 01099000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 01100000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 01101000
*/*%INCLUDE SYSLIB  (IEFTCT  )                                       */ 01102000
*/*%INCLUDE SYSLIB  (IHAASVT )                                       */ 01103000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 01104000
*/*%INCLUDE SYSLIB  (IHAWSAVT)                                       */ 01105000
*/*%INCLUDE SYSLIB  (IKTTCAST)                                       */ 01106000
*/*%INCLUDE SYSLIB  (IKJTSB  )                                       */ 01107000
*/*%INCLUDE SYSLIB  (IKTTSBX )                                       */ 01108000
*/*%INCLUDE SYSLIB  (IKTTVCS )                                       */ 01109000
*                                                                  0371 01110000
*       ;                                                          0371 01111000
@DATA    DS    0H                                                       01112000
@DATD    DSECT                                                          01113000
         DS    0F                                                       01114000
IKTASTPT CSECT                                                          01115000
         DS    0F                                                       01116000
@CF00072 DC    F'2'                                                     01117000
@CF00058 DC    F'8'                                                     01118000
@CF01039 DC    F'20'                                                    01119000
@CF02321 DC    F'4096'                                                  01120000
@CF02287 DC    XL4'FF000000'                                            01121000
@CF02335 DC    XL4'0000FFFF'                                            01122000
@DATD    DSECT                                                          01123000
         DS    0D                                                       01124000
IKTASTPT CSECT                                                          01125000
         NOPR  ((@ENDDATD-@DATD)*16)                                    01126000
         DS    0F                                                       01127000
@SIZDATD DC    AL1(0)                                                   01128000
         DC    AL3(@ENDDATD-@DATD)                                      01129000
@CV02269 DC    V(IKTXMTPT)                                              01130000
         DS    0D                                                       01131000
SUCCESS  DC    AL1(0)                                                   01132000
@CC02308 DC    C'SRB '                                                  01133000
QNAME    DC    CL8'SYSZIGGI'                                            01134000
         DS    CL3                                                      01135000
PATCHLBL DC    25F'0'                                                   01136000
@DATD    DSECT                                                          01137000
TVCSSP   EQU   231                                                      01138000
TVCSKEY  EQU   6                                                        01139000
SRBSP    EQU   239                                                      01140000
SRBKEY   EQU   0                                                        01141000
@DATD    DSECT                                                          01142000
@ENDDATD EQU   *                                                        01143000
IKTASTPT CSECT                                                          01144000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01145000
@01      EQU   01                                                       01146000
@02      EQU   02                                                       01147000
@03      EQU   03                                                       01148000
@04      EQU   04                                                       01149000
@05      EQU   05                                                       01150000
@06      EQU   06                                                       01151000
@07      EQU   07                                                       01152000
@08      EQU   08                                                       01153000
@09      EQU   09                                                       01154000
@10      EQU   10                                                       01155000
@11      EQU   11                                                       01156000
@12      EQU   12                                                       01157000
@13      EQU   13                                                       01158000
@14      EQU   14                                                       01159000
@15      EQU   15                                                       01160000
RBSECPTR EQU   @05                                                      01161000
TCBPTR   EQU   @04                                                      01162000
SRBPTR   EQU   @01                                                      01163000
TSBPTR   EQU   @09                                                      01164000
REG0     EQU   @00                                                      01165000
REG1     EQU   @01                                                      01166000
WORK1REG EQU   @01                                                      01167000
REG2     EQU   @02                                                      01168000
WORK2REG EQU   @02                                                      01169000
REG3     EQU   @03                                                      01170000
REG4     EQU   @04                                                      01171000
REG6     EQU   @06                                                      01172000
REG7     EQU   @07                                                      01173000
REG14    EQU   @14                                                      01174000
RTNREG   EQU   @14                                                      01175000
ENTRYREG EQU   @15                                                      01176000
RCREG    EQU   @15                                                      01177000
REG15    EQU   @15                                                      01178000
I        EQU   @01                                                      01179000
WORK3REG EQU   @03                                                      01180000
PSA      EQU   0                                                        01181000
FLCRNPSW EQU   PSA                                                      01182000
FLCROPSW EQU   PSA+8                                                    01183000
FLCICCW2 EQU   PSA+16                                                   01184000
FLCCVT   EQU   FLCICCW2                                                 01185000
PSAEEPSW EQU   PSA+132                                                  01186000
PSAESPSW EQU   PSA+136                                                  01187000
FLCSVILC EQU   PSAESPSW+1                                               01188000
PSAEPPSW EQU   PSA+140                                                  01189000
FLCPIILC EQU   PSAEPPSW+1                                               01190000
FLCPICOD EQU   PSAEPPSW+2                                               01191000
PSAPICOD EQU   FLCPICOD+1                                               01192000
FLCTEA   EQU   PSAEPPSW+4                                               01193000
FLCPER   EQU   PSA+152                                                  01194000
FLCMCLA  EQU   PSA+168                                                  01195000
FLCIOEL  EQU   FLCMCLA+4                                                01196000
FLCIOA   EQU   FLCMCLA+16                                               01197000
FLCFSA   EQU   FLCMCLA+80                                               01198000
PSAAOLD  EQU   PSA+548                                                  01199000
PSASUPER EQU   PSA+552                                                  01200000
PSASUP1  EQU   PSASUPER                                                 01201000
PSASUP2  EQU   PSASUPER+1                                               01202000
PSASUP3  EQU   PSASUPER+2                                               01203000
PSASUP4  EQU   PSASUPER+3                                               01204000
PSACLHT  EQU   PSA+640                                                  01205000
PSALKSA  EQU   PSA+696                                                  01206000
PSAHLHI  EQU   PSA+760                                                  01207000
PSALITA  EQU   PSA+764                                                  01208000
PSADSSFL EQU   PSA+836                                                  01209000
PSADSSF1 EQU   PSADSSFL                                                 01210000
PSADSSF3 EQU   PSADSSFL+2                                               01211000
PSADSSF4 EQU   PSADSSFL+3                                               01212000
PSARSVT  EQU   PSA+896                                                  01213000
CVTMAP   EQU   0                                                        01214000
CVT      EQU   CVTMAP                                                   01215000
CVTDAR   EQU   CVTMAP+72                                                01216000
CVTFLGS1 EQU   CVTDAR                                                   01217000
CVTDCB   EQU   CVTMAP+116                                               01218000
CVTIERLC EQU   CVTMAP+144                                               01219000
CVTOPTA  EQU   CVTMAP+182                                               01220000
CVTOPTB  EQU   CVTMAP+183                                               01221000
CVTGTF   EQU   CVTMAP+236                                               01222000
CVTGTFST EQU   CVTGTF                                                   01223000
CVTGTFS  EQU   CVTGTFST                                                 01224000
CVTSTATE EQU   CVTGTFST                                                 01225000
CVTTMODE EQU   CVTGTFST                                                 01226000
CVTFORM  EQU   CVTGTFST                                                 01227000
CVTAQAVT EQU   CVTMAP+240                                               01228000
CVTTCMFG EQU   CVTAQAVT                                                 01229000
CVTVOLM2 EQU   CVTMAP+244                                               01230000
CVTTATA  EQU   CVTVOLM2                                                 01231000
CVTTSKS  EQU   CVTTATA                                                  01232000
CVTVOLF2 EQU   CVTTSKS                                                  01233000
CVTTAT   EQU   CVTTATA+1                                                01234000
CVTATER  EQU   CVTMAP+248                                               01235000
CVTEXT1  EQU   CVTMAP+252                                               01236000
CVTPURG  EQU   CVTMAP+260                                               01237000
CVTQMSG  EQU   CVTMAP+268                                               01238000
CVTDMSR  EQU   CVTMAP+272                                               01239000
CVTRSV37 EQU   CVTDMSR                                                  01240000
CVTDMSRF EQU   CVTRSV37                                                 01241000
CVTERPV  EQU   CVTMAP+316                                               01242000
CVTINTLA EQU   CVTMAP+320                                               01243000
CVTAPF   EQU   CVTMAP+324                                               01244000
CVTEXT2  EQU   CVTMAP+328                                               01245000
CVTHJES  EQU   CVTMAP+332                                               01246000
CVTPGSIA EQU   CVTMAP+348                                               01247000
CVTA1F1  EQU   CVTMAP+356                                               01248000
CVTSYSK  EQU   CVTMAP+357                                               01249000
CVTVOLM1 EQU   CVTMAP+380                                               01250000
CVTVOLF1 EQU   CVTVOLM1                                                 01251000
CVTXTNT1 EQU   0                                                        01252000
CVTXTNT2 EQU   0                                                        01253000
CVTDSSV  EQU   CVTXTNT2                                                 01254000
CVTFLGBT EQU   CVTXTNT2+5                                               01255000
CVTQID   EQU   CVTXTNT2+24                                              01256000
CVTRV400 EQU   CVTXTNT2+52                                              01257000
CVTRV409 EQU   CVTXTNT2+53                                              01258000
CVTATCVT EQU   CVTXTNT2+64                                              01259000
CVTRV429 EQU   CVTXTNT2+84                                              01260000
CVTRV438 EQU   CVTXTNT2+85                                              01261000
CVTRV457 EQU   CVTXTNT2+112                                             01262000
CVTRV466 EQU   CVTXTNT2+113                                             01263000
CVTFIX   EQU   0                                                        01264000
CVTRELNO EQU   CVTFIX+252                                               01265000
ASCB     EQU   0                                                        01266000
ASCBSUPC EQU   ASCB+16                                                  01267000
ASCBASID EQU   ASCB+36                                                  01268000
ASCBTSB  EQU   ASCB+60                                                  01269000
ASCBFW1  EQU   ASCB+100                                                 01270000
ASCBRCTF EQU   ASCBFW1+2                                                01271000
ASCBFLG1 EQU   ASCBFW1+3                                                01272000
ASCBDSP1 EQU   ASCB+114                                                 01273000
ASCBFLG2 EQU   ASCB+115                                                 01274000
ASCBLKGP EQU   ASCB+128                                                 01275000
ASCBSRQ  EQU   ASCB+180                                                 01276000
ASCBSRQ1 EQU   ASCBSRQ                                                  01277000
ASCBSRQ2 EQU   ASCBSRQ+1                                                01278000
ASCBSRQ3 EQU   ASCBSRQ+2                                                01279000
ASCBSRQ4 EQU   ASCBSRQ+3                                                01280000
RBPRFX   EQU   0                                                        01281000
RBBASIC  EQU   0                                                        01282000
RBEXRTNM EQU   RBBASIC                                                  01283000
RBTMFLD  EQU   RBEXRTNM                                                 01284000
RBSTAB   EQU   RBBASIC+10                                               01285000
XSTAB    EQU   RBSTAB                                                   01286000
RBSTAB1  EQU   XSTAB                                                    01287000
XSTAB1   EQU   RBSTAB1                                                  01288000
RBFTCKPT EQU   XSTAB1                                                   01289000
RBSTAB2  EQU   XSTAB+1                                                  01290000
XSTAB2   EQU   RBSTAB2                                                  01291000
RBTCBNXT EQU   XSTAB2                                                   01292000
RBFACTV  EQU   XSTAB2                                                   01293000
RBFDYN   EQU   XSTAB2                                                   01294000
RBECBWT  EQU   XSTAB2                                                   01295000
RBOPSW   EQU   RBBASIC+16                                               01296000
XRBPSW   EQU   RBOPSW                                                   01297000
RBOPSWB2 EQU   XRBPSW+1                                                 01298000
RBLINK   EQU   RBBASIC+28                                               01299000
XRBLNK   EQU   RBLINK                                                   01300000
RBWCF    EQU   XRBLNK                                                   01301000
RBLINKB  EQU   XRBLNK+1                                                 01302000
RBGRSAVE EQU   RBBASIC+32                                               01303000
XRBREG   EQU   RBGRSAVE                                                 01304000
RBGRS0   EQU   XRBREG                                                   01305000
RBGRS1   EQU   XRBREG+4                                                 01306000
RBGRS2   EQU   XRBREG+8                                                 01307000
RBGRS3   EQU   XRBREG+12                                                01308000
RBGRS4   EQU   XRBREG+16                                                01309000
RBGRS5   EQU   XRBREG+20                                                01310000
RBGRS6   EQU   XRBREG+24                                                01311000
RBGRS7   EQU   XRBREG+28                                                01312000
RBGRS8   EQU   XRBREG+32                                                01313000
RBGRS9   EQU   XRBREG+36                                                01314000
RBGRS10  EQU   XRBREG+40                                                01315000
RBGRS11  EQU   XRBREG+44                                                01316000
RBGRS12  EQU   XRBREG+48                                                01317000
RBGRS13  EQU   XRBREG+52                                                01318000
RBGRS14  EQU   XRBREG+56                                                01319000
RBGRS15  EQU   XRBREG+60                                                01320000
XRBESA   EQU   RBBASIC+96                                               01321000
RBEXSAVE EQU   XRBESA                                                   01322000
RBPREFIX EQU   0                                                        01323000
RBRSV019 EQU   RBPREFIX+14                                              01324000
RBRSV028 EQU   RBPREFIX+15                                              01325000
RBRSV041 EQU   RBPREFIX+27                                              01326000
RBRSV054 EQU   RBPREFIX+39                                              01327000
RBRTOPSW EQU   RBPREFIX+40                                              01328000
RBRTPSW2 EQU   RBRTOPSW+8                                               01329000
RBRTICIL EQU   RBRTPSW2                                                 01330000
RBFLAGS1 EQU   RBPREFIX+56                                              01331000
RBINTCDA EQU   RBPREFIX+61                                              01332000
RBSECT   EQU   0                                                        01333000
RBPPSAV  EQU   RBSECT                                                   01334000
@NM00014 EQU   RBSECT+10                                                01335000
@NM00015 EQU   @NM00014                                                 01336000
RBTRSVRB EQU   @NM00015                                                 01337000
@NM00017 EQU   @NM00014+1                                               01338000
RBETXR   EQU   @NM00017                                                 01339000
RBEP     EQU   RBSECT+12                                                01340000
RBPGMQ   EQU   RBSECT+24                                                01341000
@NM00024 EQU   RBSECT+28                                                01342000
@NM00025 EQU   @NM00024                                                 01343000
IRBEND   EQU   RBSECT+96                                                01344000
@NM00028 EQU   RBSECT+96                                                01345000
RBRSV138 EQU   @NM00028+7                                               01346000
RBSCBB   EQU   RBSECT+144                                               01347000
RBSPARM  EQU   RBSCBB+8                                                 01348000
RBSFLGS1 EQU   RBSPARM                                                  01349000
RBSIOPRC EQU   RBSFLGS1                                                 01350000
RBSOWNR  EQU   RBSCBB+12                                                01351000
RBSFLGS2 EQU   RBSOWNR                                                  01352000
RBSDATA  EQU   RBSCBB+16                                                01353000
RBSFLG3  EQU   RBSDATA                                                  01354000
RBRSV150 EQU   RBSECT+167                                               01355000
TCBFIX   EQU   0                                                        01356000
TCBFRS   EQU   TCBFIX                                                   01357000
TCB      EQU   0                                                        01358000
TCBRBP   EQU   TCB                                                      01359000
TCBPIE   EQU   TCB+4                                                    01360000
TCBPMASK EQU   TCBPIE                                                   01361000
TCBCMP   EQU   TCB+16                                                   01362000
TCBCMPF  EQU   TCBCMP                                                   01363000
TCBCPP   EQU   TCBCMPF                                                  01364000
TCBSTCC  EQU   TCBCMPF                                                  01365000
TCBCDBL  EQU   TCBCMPF                                                  01366000
TCBCWTO  EQU   TCBCMPF                                                  01367000
TCBCIND  EQU   TCBCMPF                                                  01368000
TCBCMSG  EQU   TCBCMPF                                                  01369000
TCBTRN   EQU   TCB+20                                                   01370000
TCBABF   EQU   TCBTRN                                                   01371000
TCBMSS   EQU   TCB+24                                                   01372000
TCBPKF   EQU   TCB+28                                                   01373000
TCBFLGS  EQU   TCB+29                                                   01374000
TCBFLGS1 EQU   TCBFLGS                                                  01375000
TCBFX    EQU   TCBFLGS1                                                 01376000
TCBFLGS2 EQU   TCBFLGS+1                                                01377000
TCBFLGS3 EQU   TCBFLGS+2                                                01378000
TCBFLGS4 EQU   TCBFLGS+3                                                01379000
TCBFLGS5 EQU   TCBFLGS+4                                                01380000
TCBABWF  EQU   TCBFLGS5                                                 01381000
TCBJPQ   EQU   TCB+44                                                   01382000
TCBPURGE EQU   TCBJPQ                                                   01383000
TCBGRS   EQU   TCB+48                                                   01384000
TCBFSA   EQU   TCB+112                                                  01385000
TCBTME   EQU   TCB+120                                                  01386000
TCBJSTCB EQU   TCB+124                                                  01387000
TCBTSFLG EQU   TCB+148                                                  01388000
TCBTSTSK EQU   TCBTSFLG                                                 01389000
TCBTIOTG EQU   TCBTSFLG                                                 01390000
TCBSTAB  EQU   TCB+160                                                  01391000
TCBNSTAE EQU   TCBSTAB                                                  01392000
TCBTCT   EQU   TCB+164                                                  01393000
TCBTCTGF EQU   TCBTCT                                                   01394000
TCBSCNDY EQU   TCB+172                                                  01395000
TCBNDSP  EQU   TCBSCNDY                                                 01396000
TCBNDSP1 EQU   TCBNDSP+1                                                01397000
TCBNDSP2 EQU   TCBNDSP+2                                                01398000
TCBNDSP3 EQU   TCBNDSP+3                                                01399000
TCBJSCB  EQU   TCB+180                                                  01400000
TCBRECDE EQU   TCBJSCB                                                  01401000
TCBEXT1  EQU   TCB+196                                                  01402000
TCBBITS  EQU   TCB+200                                                  01403000
TCBNDSP4 EQU   TCBBITS                                                  01404000
TCBNDSP5 EQU   TCBBITS+1                                                01405000
TCBFLGS6 EQU   TCBBITS+2                                                01406000
TCBFLGS7 EQU   TCBBITS+3                                                01407000
TCBDAR   EQU   TCB+204                                                  01408000
TCBDARC  EQU   TCBDAR                                                   01409000
TCBEXT2  EQU   TCB+208                                                  01410000
TCBFOE   EQU   TCB+244                                                  01411000
TCBESTAE EQU   TCB+264                                                  01412000
TCBESTRM EQU   TCBESTAE+1                                               01413000
TCBFBYT1 EQU   TCB+276                                                  01414000
TCBFBYT2 EQU   TCB+277                                                  01415000
TCBRV124 EQU   TCB+278                                                  01416000
TCBRV133 EQU   TCB+279                                                  01417000
TCBXTNT2 EQU   0                                                        01418000
TCBGTF   EQU   TCBXTNT2                                                 01419000
TCBTFLG  EQU   TCBGTF                                                   01420000
TCBRV146 EQU   TCBXTNT2+28                                              01421000
TCBRV155 EQU   TCBXTNT2+29                                              01422000
TCBRV164 EQU   TCBXTNT2+30                                              01423000
TCBRV173 EQU   TCBXTNT2+31                                              01424000
SMFTCT   EQU   0                                                        01425000
TCTSW    EQU   SMFTCT+3                                                 01426000
TCTCRTBL EQU   SMFTCT+8                                                 01427000
TCTIOTBL EQU   SMFTCT+12                                                01428000
TCTPOOL  EQU   SMFTCT+16                                                01429000
TCTJSTX  EQU   SMFTCT+36                                                01430000
TCTTJLM  EQU   SMFTCT+40                                                01431000
TCTLOUT  EQU   SMFTCT+52                                                01432000
TCTPGSMF EQU   SMFTCT+64                                                01433000
TCTPGIN  EQU   TCTPGSMF                                                 01434000
TCTPGOUT EQU   TCTPGSMF+4                                               01435000
TCTCORE  EQU   0                                                        01436000
TCTTIOT  EQU   0                                                        01437000
TCTPLEXT EQU   TCTTIOT                                                  01438000
ASVT     EQU   0                                                        01439000
ASVTFRST EQU   ASVT+524                                                 01440000
ASVTENTY EQU   ASVT+528                                                 01441000
ASVTAVAL EQU   ASVTENTY                                                 01442000
SRBSECT  EQU   0                                                        01443000
SRBID    EQU   SRBSECT                                                  01444000
SRBFLNK  EQU   SRBSECT+4                                                01445000
SRBASCB  EQU   SRBSECT+8                                                01446000
SRBFLC   EQU   SRBSECT+12                                               01447000
SRBPASID EQU   SRBFLC+2                                                 01448000
SRBEP    EQU   SRBSECT+20                                               01449000
SRBRMTR  EQU   SRBSECT+24                                               01450000
SRBPARM  EQU   SRBSECT+28                                               01451000
WSAG     EQU   0                                                        01452000
WSAGGMFM EQU   WSAG+4                                                   01453000
TCAST    EQU   0                                                        01454000
TCASUSER EQU   TCAST+4                                                  01455000
TCASFLG1 EQU   TCAST+88                                                 01456000
TCASBR14 EQU   TCAST+116                                                01457000
TSB      EQU   0                                                        01458000
TSBASCBA EQU   TSB                                                      01459000
TSBSTAT  EQU   TSBASCBA                                                 01460000
TSBITOFF EQU   TSBSTAT                                                  01461000
TSBDISC  EQU   TSBSTAT                                                  01462000
TSBFLG1  EQU   TSB+4                                                    01463000
TSBWTCB  EQU   TSB+5                                                    01464000
TSBFLG2  EQU   TSB+16                                                   01465000
TSBFLG3  EQU   TSB+24                                                   01466000
TSBFLG5  EQU   TSB+25                                                   01467000
TSBTERMC EQU   TSB+26                                                   01468000
TSBTERM1 EQU   TSBTERMC                                                 01469000
TSBTERM2 EQU   TSBTERMC+1                                               01470000
TSBWTJID EQU   TSB+32                                                   01471000
TSBSTCC  EQU   TSB+34                                                   01472000
TSBFLG4  EQU   TSB+41                                                   01473000
TSBCANC  EQU   TSBFLG4                                                  01474000
TSBRCB   EQU   TSB+64                                                   01475000
TSBLINKA EQU   TSBRCB+4                                                 01476000
TSBTPOST EQU   TSB+72                                                   01477000
TSBTPFLG EQU   TSBTPOST                                                 01478000
TSBMINL  EQU   TSB+84                                                   01479000
TSBEXTNT EQU   TSB+96                                                   01480000
TSBX     EQU   0                                                        01481000
TSBXFLG1 EQU   TSBX+32                                                  01482000
TSBXACTV EQU   TSBXFLG1                                                 01483000
TSBXTIM  EQU   TSBX+40                                                  01484000
TSBXTOM  EQU   TSBX+44                                                  01485000
TSBXCSAP EQU   TSBX+60                                                  01486000
TSBXTERM EQU   TSBX+72                                                  01487000
TVCS     EQU   0                                                        01488000
TVCSECB  EQU   TVCS+96                                                  01489000
TVCSCODE EQU   TVCSECB+1                                                01490000
TVCSDASZ EQU   TVCS+100                                                 01491000
TVCSGMSZ EQU   TVCS+102                                                 01492000
TVCSOPTN EQU   TVCS+104                                                 01493000
TVCSSRBA EQU   TVCS+105                                                 01494000
TVCSASCB EQU   TVCS+108                                                 01495000
TVCSINDS EQU   TVCS+112                                                 01496000
TVCSDATA EQU   TVCS+116                                                 01497000
TPUTDATA EQU   0                                                        01498000
TVCSTGT  EQU   0                                                        01499000
CVTPTR   EQU   FLCCVT                                                   01500000
CVTS01   EQU   CVTPGSIA                                                 01501000
CVTLPDIA EQU   CVTS01+12                                                01502000
CVTDIRST EQU   CVTLPDIA                                                 01503000
CVTSLIDA EQU   CVTS01+24                                                01504000
CVTCTLFG EQU   CVTS01+50                                                01505000
CVTASVT  EQU   CVTS01+208                                               01506000
CVTLSMQ  EQU   CVTS01+268                                               01507000
CVTGLMN  EQU   CVTS01+332                                               01508000
CVTSPSA  EQU   CVTS01+336                                               01509000
CVTRV210 EQU   CVTS01+424                                               01510000
CVTRV219 EQU   CVTS01+425                                               01511000
CVTRV228 EQU   CVTS01+426                                               01512000
CVTRV237 EQU   CVTS01+427                                               01513000
CVTMFRTR EQU   CVTS01+452                                               01514000
CVTRV262 EQU   CVTS01+468                                               01515000
CVTRV271 EQU   CVTS01+469                                               01516000
CVTRV280 EQU   CVTS01+470                                               01517000
CVTRV289 EQU   CVTS01+471                                               01518000
CVTGSDA  EQU   CVTS01+600                                               01519000
CVTTCASP EQU   CVTS01+664                                               01520000
ASCBPTR  EQU   PSAAOLD                                                  01521000
RBSECS03 EQU   RBEP                                                     01522000
RBCDE    EQU   RBSECS03                                                 01523000
RBCDFLGS EQU   RBCDE                                                    01524000
RBSECS05 EQU   RBPGMQ                                                   01525000
RBSQE    EQU   RBSECS05                                                 01526000
RBSECS06 EQU   RBPGMQ                                                   01527000
RBIQE    EQU   RBSECS06                                                 01528000
RBSECS07 EQU   RBPGMQ                                                   01529000
RBIQE2   EQU   RBSECS07                                                 01530000
RBSECS08 EQU   IRBEND                                                   01531000
RBSECS09 EQU   IRBEND                                                   01532000
FLC      EQU   PSA                                                      01533000
PSARSVTE EQU   PSARSVT                                                  01534000
TCTIODSP EQU   TCTPLEXT+8                                               01535000
TCTDCBLE EQU   TCTIODSP+4                                               01536000
TCTDDENT EQU   TCTDCBLE+4                                               01537000
TCTFLGS  EQU   TCTDDENT+3                                               01538000
ASVTPTR  EQU   CVTASVT                                                  01539000
SRB      EQU   SRBSECT                                                  01540000
TCASTPTR EQU   CVTTCASP                                                 01541000
XSA      EQU   RBEXSAVE                                                 01542000
XSAPRM0  EQU   XSA                                                      01543000
XSAASID  EQU   XSAPRM0                                                  01544000
XSAPRMSZ EQU   XSAPRM0+2                                                01545000
XSAPRM1  EQU   XSA+4                                                    01546000
XSAOPTNS EQU   XSAPRM1                                                  01547000
XSAPRIOR EQU   XSAOPTNS                                                 01548000
XSANOWT  EQU   XSAOPTNS                                                 01549000
XSAEDITO EQU   XSAOPTNS                                                 01550000
XSABFRAD EQU   XSAPRM1+1                                                01551000
XSAWD3   EQU   XSA+8                                                    01552000
XSAFLAG  EQU   XSAWD3                                                   01553000
XSAIDENQ EQU   XSAFLAG                                                  01554000
XSADMOVE EQU   XSAFLAG                                                  01555000
XSATCBFX EQU   XSAFLAG                                                  01556000
XSADOSWT EQU   XSAFLAG                                                  01557000
XSALOCKS EQU   XSAFLAG                                                  01558000
XSAAUTH  EQU   XSAFLAG                                                  01559000
XSARETY  EQU   XSAFLAG                                                  01560000
XSATCBA  EQU   XSAWD3+1                                                 01561000
XSAWD4   EQU   XSA+12                                                   01562000
XSASAVEA EQU   XSAWD4                                                   01563000
XSAENQAD EQU   XSA+16                                                   01564000
XSAWD5   EQU   XSAENQAD                                                 01565000
XSAWD8   EQU   XSA+28                                                   01566000
XSASAVEB EQU   XSAWD8                                                   01567000
XSAUSERP EQU   XSA+32                                                   01568000
XSARETG  EQU   XSA+36                                                   01569000
XSAWD11  EQU   XSA+40                                                   01570000
XSARC    EQU   XSAWD11                                                  01571000
XSAWD12  EQU   XSA+44                                                   01572000
XSASCHED EQU   XSAWD12                                                  01573000
XSATVCSP EQU   XSAWD12+1                                                01574000
XSATASCB EQU   XSAWD5                                                   01575000
CONTINUE EQU   SUCCESS                                                  01576000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01577000
XSAIDAS  EQU   XSAWD11+2                                                01578000
@NM00089 EQU   XSAWD11+1                                                01579000
XSAWD10  EQU   XSARETG                                                  01580000
XSAWD9   EQU   XSAUSERP                                                 01581000
XSAWD7   EQU   XSAENQAD+8                                               01582000
XSAWD6   EQU   XSAENQAD+4                                               01583000
XSADATVF EQU   XSAFLAG                                                  01584000
XSABRK   EQU   XSAOPTNS                                                 01585000
XSAHOLD  EQU   XSAOPTNS                                                 01586000
XSAUSRID EQU   XSAOPTNS                                                 01587000
XSAPTGT  EQU   XSAOPTNS                                                 01588000
TCTTKRLD EQU   TCTDDENT+13                                              01589000
TCTEXRLD EQU   TCTDDENT+12                                              01590000
TCTRSV10 EQU   TCTDDENT+8                                               01591000
TCTDCTR  EQU   TCTDDENT+4                                               01592000
TCTRSV26 EQU   TCTFLGS                                                  01593000
TCTRSV25 EQU   TCTFLGS                                                  01594000
TCTRSV24 EQU   TCTFLGS                                                  01595000
TCTRSV23 EQU   TCTFLGS                                                  01596000
TCTRSV22 EQU   TCTFLGS                                                  01597000
TCTNOCNT EQU   TCTFLGS                                                  01598000
TCTVAMDS EQU   TCTFLGS                                                  01599000
TCTDDIND EQU   TCTFLGS                                                  01600000
TCTSCTR  EQU   TCTDDENT+2                                               01601000
TCTUCBP  EQU   TCTDDENT                                                 01602000
TCTIOTSD EQU   TCTIODSP+2                                               01603000
TCTDCBTD EQU   TCTIODSP                                                 01604000
PSARSAV  EQU   PSARSVTE+60                                              01605000
PSARSTK  EQU   PSARSVTE+56                                              01606000
PSAESAV3 EQU   PSARSVTE+52                                              01607000
PSAESTK3 EQU   PSARSVTE+48                                              01608000
PSAESAV2 EQU   PSARSVTE+44                                              01609000
PSAESTK2 EQU   PSARSVTE+40                                              01610000
PSAESAV1 EQU   PSARSVTE+36                                              01611000
PSAESTK1 EQU   PSARSVTE+32                                              01612000
PSAPSAV  EQU   PSARSVTE+28                                              01613000
PSAPSTK  EQU   PSARSVTE+24                                              01614000
PSAMSAV  EQU   PSARSVTE+20                                              01615000
PSAMSTK  EQU   PSARSVTE+16                                              01616000
PSASSAV  EQU   PSARSVTE+12                                              01617000
PSASSTK  EQU   PSARSVTE+8                                               01618000
PSANSTK  EQU   PSARSVTE+4                                               01619000
PSACSTK  EQU   PSARSVTE                                                 01620000
RBRSV161 EQU   RBSECS09+64                                              01621000
RBSIRBWA EQU   RBSECS09                                                 01622000
RBIQEWRK EQU   RBSECS08+4                                               01623000
RBNEXAV  EQU   RBSECS08                                                 01624000
RBIQEA   EQU   RBIQE2                                                   01625000
RBIQE1   EQU   RBIQE+1                                                  01626000
RBUSE    EQU   RBIQE                                                    01627000
RBSQEA   EQU   RBSQE+1                                                  01628000
@NM00029 EQU   RBSQE                                                    01629000
RBCDE1   EQU   RBCDE+1                                                  01630000
RBCDLOAD EQU   RBCDFLGS                                                 01631000
RBCDXCTL EQU   RBCDFLGS                                                 01632000
RBCDSYNC EQU   RBCDFLGS                                                 01633000
RBCDNODE EQU   RBCDFLGS                                                 01634000
RBRSV010 EQU   RBCDFLGS                                                 01635000
RBCDATCH EQU   RBCDFLGS                                                 01636000
RBRSV009 EQU   RBCDFLGS                                                 01637000
RBNOCELL EQU   RBCDFLGS                                                 01638000
CVTRV628 EQU   CVTS01+728                                               01639000
CVTRV627 EQU   CVTS01+724                                               01640000
CVTRV626 EQU   CVTS01+720                                               01641000
CVTRV625 EQU   CVTS01+716                                               01642000
CVTRV624 EQU   CVTS01+712                                               01643000
CVTRV623 EQU   CVTS01+708                                               01644000
CVTRV622 EQU   CVTS01+704                                               01645000
CVTRV621 EQU   CVTS01+700                                               01646000
CVTIHASU EQU   CVTS01+696                                               01647000
CVTSUSP  EQU   CVTS01+692                                               01648000
CVTT6SVC EQU   CVTS01+688                                               01649000
CVTCDAL  EQU   CVTS01+684                                               01650000
CVTTCTL  EQU   CVTS01+680                                               01651000
CVTRSUME EQU   CVTS01+676                                               01652000
CVTJTERM EQU   CVTS01+672                                               01653000
CVTASMRM EQU   CVTS01+668                                               01654000
CVT0PT03 EQU   CVTS01+660                                               01655000
CVT0PT0E EQU   CVTS01+656                                               01656000
CVTRV609 EQU   CVTS01+652                                               01657000
CVTCGK   EQU   CVTS01+648                                               01658000
CVTRAC   EQU   CVTS01+644                                               01659000
CVTRV606 EQU   CVTS01+640                                               01660000
CVTRV605 EQU   CVTS01+636                                               01661000
CVTRV604 EQU   CVTS01+632                                               01662000
CVTEFF02 EQU   CVTS01+628                                               01663000
CVTCBBR  EQU   CVTS01+624                                               01664000
CVTSSCR  EQU   CVTS01+620                                               01665000
CVTEVENT EQU   CVTS01+616                                               01666000
CVTCRCA  EQU   CVTS01+612                                               01667000
CVTTPIO  EQU   CVTS01+608                                               01668000
CVTADV   EQU   CVTS01+604                                               01669000
CVTGSDAB EQU   CVTGSDA                                                  01670000
CVTQV3   EQU   CVTS01+596                                               01671000
CVTQV2   EQU   CVTS01+592                                               01672000
CVTQV1   EQU   CVTS01+588                                               01673000
CVTRPT   EQU   CVTS01+584                                               01674000
CVTSSRB  EQU   CVTS01+580                                               01675000
CVTCSDRL EQU   CVTS01+576                                               01676000
CVTEXP1  EQU   CVTS01+572                                               01677000
CVTRMPMT EQU   CVTS01+568                                               01678000
CVTRMPTT EQU   CVTS01+564                                               01679000
CVTVPSA  EQU   CVTS01+560                                               01680000
CVTVSTOP EQU   CVTS01+556                                               01681000
CVTGTFR8 EQU   CVTS01+552                                               01682000
CVTQUIT  EQU   CVTS01+548                                               01683000
CVTVACR  EQU   CVTS01+544                                               01684000
CVTWTCB  EQU   CVTS01+540                                               01685000
CVTSTPRS EQU   CVTS01+536                                               01686000
CVT0PT02 EQU   CVTS01+532                                               01687000
CVTDARCM EQU   CVTS01+528                                               01688000
CVTIRECM EQU   CVTS01+524                                               01689000
CVTJRECM EQU   CVTS01+520                                               01690000
CVTVEMS0 EQU   CVTS01+516                                               01691000
CVTSPFRR EQU   CVTS01+512                                               01692000
CVTRLSTG EQU   CVTS01+508                                               01693000
CVT0TC0A EQU   CVTS01+504                                               01694000
CVTGMBR  EQU   CVTS01+500                                               01695000
CVTLFRM  EQU   CVTS01+496                                               01696000
CVTRMBR  EQU   CVTS01+492                                               01697000
CVTVIOP  EQU   CVTS01+488                                               01698000
CVTRV307 EQU   CVTS01+486                                               01699000
CVTRV306 EQU   CVTS01+484                                               01700000
CVTRV305 EQU   CVTS01+482                                               01701000
CVTRV304 EQU   CVTS01+480                                               01702000
CVTRV303 EQU   CVTS01+478                                               01703000
CVTRV302 EQU   CVTS01+476                                               01704000
CVTTRCA  EQU   CVTS01+472                                               01705000
CVTRV297 EQU   CVTRV289                                                 01706000
CVTRV296 EQU   CVTRV289                                                 01707000
CVTRV295 EQU   CVTRV289                                                 01708000
CVTRV294 EQU   CVTRV289                                                 01709000
CVTRV293 EQU   CVTRV289                                                 01710000
CVTRV292 EQU   CVTRV289                                                 01711000
CVTRV291 EQU   CVTRV289                                                 01712000
CVTRV290 EQU   CVTRV289                                                 01713000
CVTRV288 EQU   CVTRV280                                                 01714000
CVTRV287 EQU   CVTRV280                                                 01715000
CVTRV286 EQU   CVTRV280                                                 01716000
CVTRV285 EQU   CVTRV280                                                 01717000
CVTRV284 EQU   CVTRV280                                                 01718000
CVTRV283 EQU   CVTRV280                                                 01719000
CVTRV282 EQU   CVTRV280                                                 01720000
CVTRV281 EQU   CVTRV280                                                 01721000
CVTRV279 EQU   CVTRV271                                                 01722000
CVTRV278 EQU   CVTRV271                                                 01723000
CVTRV277 EQU   CVTRV271                                                 01724000
CVTRV276 EQU   CVTRV271                                                 01725000
CVTRV275 EQU   CVTRV271                                                 01726000
CVTRV274 EQU   CVTRV271                                                 01727000
CVTRV273 EQU   CVTRV271                                                 01728000
CVTRV272 EQU   CVTRV271                                                 01729000
CVTRV270 EQU   CVTRV262                                                 01730000
CVTRV269 EQU   CVTRV262                                                 01731000
CVTRV268 EQU   CVTRV262                                                 01732000
CVTRV267 EQU   CVTRV262                                                 01733000
CVTRV266 EQU   CVTRV262                                                 01734000
CVTRV265 EQU   CVTRV262                                                 01735000
CVTRV264 EQU   CVTRV262                                                 01736000
CVTRV263 EQU   CVTRV262                                                 01737000
CVTVFP   EQU   CVTS01+464                                               01738000
CVTVSI   EQU   CVTS01+460                                               01739000
CVTVPSIB EQU   CVTS01+456                                               01740000
CVTMFACT EQU   CVTMFRTR                                                 01741000
CVTMFCTL EQU   CVTS01+448                                               01742000
CVTPVBP  EQU   CVTS01+444                                               01743000
CVTPWI   EQU   CVTS01+440                                               01744000
CVTRV254 EQU   CVTS01+438                                               01745000
CVTRV253 EQU   CVTS01+436                                               01746000
CVTRV252 EQU   CVTS01+434                                               01747000
CVTRV251 EQU   CVTS01+433                                               01748000
CVTRV250 EQU   CVTS01+432                                               01749000
CVTRV249 EQU   CVTS01+431                                               01750000
CVTRV248 EQU   CVTS01+430                                               01751000
CVTRV247 EQU   CVTS01+429                                               01752000
CVTRV246 EQU   CVTS01+428                                               01753000
CVTRV245 EQU   CVTRV237                                                 01754000
CVTRV244 EQU   CVTRV237                                                 01755000
CVTRV243 EQU   CVTRV237                                                 01756000
CVTRV242 EQU   CVTRV237                                                 01757000
CVTRV241 EQU   CVTRV237                                                 01758000
CVTRV240 EQU   CVTRV237                                                 01759000
CVTRV239 EQU   CVTRV237                                                 01760000
CVTRV238 EQU   CVTRV237                                                 01761000
CVTRV236 EQU   CVTRV228                                                 01762000
CVTRV235 EQU   CVTRV228                                                 01763000
CVTRV234 EQU   CVTRV228                                                 01764000
CVTRV233 EQU   CVTRV228                                                 01765000
CVTRV232 EQU   CVTRV228                                                 01766000
CVTRV231 EQU   CVTRV228                                                 01767000
CVTRV230 EQU   CVTRV228                                                 01768000
CVTRV229 EQU   CVTRV228                                                 01769000
CVTRV227 EQU   CVTRV219                                                 01770000
CVTRV226 EQU   CVTRV219                                                 01771000
CVTRV225 EQU   CVTRV219                                                 01772000
CVTRV224 EQU   CVTRV219                                                 01773000
CVTRV223 EQU   CVTRV219                                                 01774000
CVTRV222 EQU   CVTRV219                                                 01775000
CVTRV221 EQU   CVTRV219                                                 01776000
CVTRV220 EQU   CVTRV219                                                 01777000
CVTRV218 EQU   CVTRV210                                                 01778000
CVTRV217 EQU   CVTRV210                                                 01779000
CVTRV216 EQU   CVTRV210                                                 01780000
CVTRV215 EQU   CVTRV210                                                 01781000
CVTRV214 EQU   CVTRV210                                                 01782000
CVTRV213 EQU   CVTRV210                                                 01783000
CVTRV212 EQU   CVTRV210                                                 01784000
CVTRV211 EQU   CVTRV210                                                 01785000
CVTLCCAT EQU   CVTS01+420                                               01786000
CVTPCCAT EQU   CVTS01+416                                               01787000
CVTIPCRP EQU   CVTS01+412                                               01788000
CVTIPCRI EQU   CVTS01+408                                               01789000
CVTIPCDS EQU   CVTS01+404                                               01790000
CVTAIDVT EQU   CVTS01+400                                               01791000
CVTSSAP  EQU   CVTS01+396                                               01792000
CVTEHCIR EQU   CVTS01+392                                               01793000
CVTEHDEF EQU   CVTS01+388                                               01794000
CVTDAIR  EQU   CVTS01+384                                               01795000
CVTPERFM EQU   CVTS01+380                                               01796000
CVT044R2 EQU   CVTS01+376                                               01797000
CVTFETCH EQU   CVTS01+372                                               01798000
CVTRSTWD EQU   CVTS01+368                                               01799000
CVTSPOST EQU   CVTS01+364                                               01800000
CVTIOBP  EQU   CVTS01+360                                               01801000
CVTASMVT EQU   CVTS01+356                                               01802000
CVTRECRQ EQU   CVTS01+352                                               01803000
CVTWSAC  EQU   CVTS01+348                                               01804000
CVTRV149 EQU   CVTS01+344                                               01805000
CVTWSAL  EQU   CVTS01+340                                               01806000
CVTVEAC0 EQU   CVTS01+328                                               01807000
CVT062R1 EQU   CVTS01+324                                               01808000
CVTRPOST EQU   CVTS01+320                                               01809000
CVTDQIQE EQU   CVTS01+316                                               01810000
CVTCSD   EQU   CVTS01+312                                               01811000
CVTLKRMA EQU   CVTS01+308                                               01812000
CVTRSPIE EQU   CVTS01+304                                               01813000
CVTRENQ  EQU   CVTS01+300                                               01814000
CVTLQCB  EQU   CVTS01+296                                               01815000
CVTFQCB  EQU   CVTS01+292                                               01816000
CVTQCS01 EQU   CVTS01+288                                               01817000
CVTAPFT  EQU   CVTS01+284                                               01818000
CVTPARRL EQU   CVTS01+280                                               01819000
CVTVWAIT EQU   CVTS01+276                                               01820000
CVTGSPL  EQU   CVTS01+272                                               01821000
CVTGSMQ  EQU   CVTS01+264                                               01822000
CVTEXPRO EQU   CVTS01+260                                               01823000
CVTOPCTP EQU   CVTS01+256                                               01824000
CVTSIC   EQU   CVTS01+252                                               01825000
CVTTPIOS EQU   CVTS01+248                                               01826000
CVTRTMS  EQU   CVTS01+244                                               01827000
CVTSDBF  EQU   CVTS01+240                                               01828000
CVTSCBP  EQU   CVTS01+236                                               01829000
CVTSDMP  EQU   CVTS01+232                                               01830000
CVTSV60  EQU   CVTS01+228                                               01831000
CVTRTMCT EQU   CVTS01+224                                               01832000
CVTASCBL EQU   CVTS01+220                                               01833000
CVTASCBH EQU   CVTS01+216                                               01834000
CVTGDA   EQU   CVTS01+212                                               01835000
CVTVVMDI EQU   CVTS01+204                                               01836000
CVTAQTOP EQU   CVTS01+200                                               01837000
CVTIOSCS EQU   CVTS01+196                                               01838000
CVTSDRM  EQU   CVTS01+192                                               01839000
CVTOPTE  EQU   CVTS01+188                                               01840000
CVTSTXU  EQU   CVTS01+184                                               01841000
CVTQUIS  EQU   CVTS01+180                                               01842000
CVTPARS  EQU   CVTS01+176                                               01843000
CVTS1EE  EQU   CVTS01+172                                               01844000
CVTFRAS  EQU   CVTS01+168                                               01845000
CVTQSAS  EQU   CVTS01+164                                               01846000
CVTCRAS  EQU   CVTS01+160                                               01847000
CVTCRMN  EQU   CVTS01+156                                               01848000
CVTDELCP EQU   CVTS01+152                                               01849000
CVTFRECL EQU   CVTS01+148                                               01850000
CVTGETCL EQU   CVTS01+144                                               01851000
CVTBLDCP EQU   CVTS01+140                                               01852000
CVTAUTHL EQU   CVTS01+136                                               01853000
CVTSCAN  EQU   CVTS01+132                                               01854000
CVTRV144 EQU   CVTS01+130                                               01855000
CVTMAXMP EQU   CVTS01+128                                               01856000
CVTSTCK  EQU   CVTS01+124                                               01857000
CVTRV139 EQU   CVTS01+123                                               01858000
CVTDSSAC EQU   CVTS01+122                                               01859000
CVTRV513 EQU   CVTS01+121                                               01860000
CVTIOSPL EQU   CVTS01+120                                               01861000
CVTPTGT  EQU   CVTS01+116                                               01862000
CVTCSPIE EQU   CVTS01+112                                               01863000
CVTSMFEX EQU   CVTS01+108                                               01864000
CVTOLT0A EQU   CVTS01+104                                               01865000
CVTSRBRT EQU   CVTS01+100                                               01866000
CVTPUTL  EQU   CVTS01+96                                                01867000
CVTASCRL EQU   CVTS01+92                                                01868000
CVTASCRF EQU   CVTS01+88                                                01869000
CVTRV326 EQU   CVTS01+84                                                01870000
CVTRV325 EQU   CVTS01+80                                                01871000
CVTRV324 EQU   CVTS01+76                                                01872000
CVT0VL01 EQU   CVTS01+72                                                01873000
CVTSHRVM EQU   CVTS01+68                                                01874000
CVTRV332 EQU   CVTS01+64                                                01875000
CVTTAS   EQU   CVTS01+60                                                01876000
CVTRSCN  EQU   CVTS01+56                                                01877000
CVTTRAC2 EQU   CVTS01+54                                                01878000
CVTTRACE EQU   CVTS01+52                                                01879000
CVTAPG   EQU   CVTS01+51                                                01880000
CVTSDTRC EQU   CVTCTLFG                                                 01881000
CVTGTRCE EQU   CVTCTLFG                                                 01882000
CVTNOMP  EQU   CVTCTLFG                                                 01883000
CVTRSV79 EQU   CVTCTLFG                                                 01884000
CVTDSTAT EQU   CVTCTLFG                                                 01885000
CVTRSV78 EQU   CVTCTLFG                                                 01886000
CVTRV333 EQU   CVTCTLFG                                                 01887000
CVTRV323 EQU   CVTCTLFG                                                 01888000
CVTSPVLK EQU   CVTS01+49                                                01889000
CVTRSV77 EQU   CVTS01+48                                                01890000
CVTRV331 EQU   CVTS01+44                                                01891000
CVTRV330 EQU   CVTS01+40                                                01892000
CVTRV329 EQU   CVTS01+36                                                01893000
CVTRV328 EQU   CVTS01+32                                                01894000
CVTRV322 EQU   CVTS01+28                                                01895000
CVTSLID  EQU   CVTSLIDA+1                                               01896000
CVTSYLK  EQU   CVTSLIDA                                                 01897000
CVTRV321 EQU   CVTS01+20                                                01898000
CVTRV320 EQU   CVTS01+16                                                01899000
CVTLPDIR EQU   CVTLPDIA+1                                               01900000
CVTRSV69 EQU   CVTDIRST                                                 01901000
CVTRSV68 EQU   CVTDIRST                                                 01902000
CVTRSV67 EQU   CVTDIRST                                                 01903000
CVTRSV66 EQU   CVTDIRST                                                 01904000
CVTRSV65 EQU   CVTDIRST                                                 01905000
CVTRSV64 EQU   CVTDIRST                                                 01906000
CVTRSV63 EQU   CVTDIRST                                                 01907000
CVTDICOM EQU   CVTDIRST                                                 01908000
CVTPVTP  EQU   CVTS01+8                                                 01909000
CVTLPDSR EQU   CVTS01+4                                                 01910000
CVTGETL  EQU   CVTS01                                                   01911000
@NM00088 EQU   TVCSINDS                                                 01912000
TVCSTGRC EQU   TVCSINDS                                                 01913000
TVCSRCRC EQU   TVCSINDS                                                 01914000
TVCSEDIT EQU   TVCSOPTN                                                 01915000
TVCSBRK  EQU   TVCSOPTN                                                 01916000
TVCSHOLD EQU   TVCSOPTN                                                 01917000
TVCSNOWT EQU   TVCSOPTN                                                 01918000
TVCSPRIO EQU   TVCSOPTN                                                 01919000
@NM00087 EQU   TVCSOPTN                                                 01920000
TVCSPTGT EQU   TVCSOPTN                                                 01921000
@NM00086 EQU   TVCSECB                                                  01922000
TVCSPOST EQU   TVCSECB                                                  01923000
TVCSWAIT EQU   TVCSECB                                                  01924000
TVCSOPRM EQU   TVCS+76                                                  01925000
TVCSPARM EQU   TVCS+72                                                  01926000
TVCSAVEA EQU   TVCS                                                     01927000
TSBXEND  EQU   TSBX+128                                                 01928000
@NM00085 EQU   TSBX+124                                                 01929000
TSBXDMMO EQU   TSBX+120                                                 01930000
TSBXDMMI EQU   TSBX+116                                                 01931000
TSBXBIND EQU   TSBX+80                                                  01932000
TSBXRPL  EQU   TSBX+76                                                  01933000
TSBXTMBF EQU   TSBXTERM+2                                               01934000
TSBXSUBT EQU   TSBXTERM+1                                               01935000
TSBXTMTP EQU   TSBXTERM                                                 01936000
TSBXAIND EQU   TSBX+70                                                  01937000
TSBXRSZO EQU   TSBX+69                                                  01938000
TSBXRSZI EQU   TSBX+68                                                  01939000
TSBXLBUF EQU   TSBX+64                                                  01940000
TSBXSRB  EQU   TSBX+56                                                  01941000
TSBXSRBI EQU   TSBX+52                                                  01942000
@NM00084 EQU   TSBX+48                                                  01943000
TSBXDPMO EQU   TSBXTOM                                                  01944000
TSBXDPMI EQU   TSBXTIM                                                  01945000
TSBXTVWA EQU   TSBX+36                                                  01946000
TSBXFLG4 EQU   TSBX+35                                                  01947000
TSBXFLG3 EQU   TSBX+34                                                  01948000
TSBXFLG2 EQU   TSBX+33                                                  01949000
@NM00083 EQU   TSBXFLG1                                                 01950000
TSBXTGTF EQU   TSBXFLG1                                                 01951000
TSBXNOSW EQU   TSBXFLG1                                                 01952000
TSBXWREC EQU   TSBXFLG1                                                 01953000
TSBXLOGF EQU   TSBXFLG1                                                 01954000
TSBXASCI EQU   TSBXFLG1                                                 01955000
TSBXUID  EQU   TSBX+24                                                  01956000
TSBXLMOD EQU   TSBX+16                                                  01957000
TSBXNIB  EQU   TSBX+12                                                  01958000
TSBXECB  EQU   TSBX+8                                                   01959000
TSBXBCK  EQU   TSBX+4                                                   01960000
TSBXFWD  EQU   TSBX                                                     01961000
TSBEND   EQU   TSB+120                                                  01962000
TSBSF1   EQU   TSB+112                                                  01963000
TSBTRMID EQU   TSB+104                                                  01964000
TSBALTC  EQU   TSB+103                                                  01965000
TSBALTR  EQU   TSB+102                                                  01966000
TSBPRMC  EQU   TSB+101                                                  01967000
TSBPRMR  EQU   TSB+100                                                  01968000
TSBPSWD  EQU   TSB+88                                                   01969000
TSBLECB  EQU   TSBMINL                                                  01970000
TSBLINE  EQU   TSB+82                                                   01971000
TSBSTAX  EQU   TSB+81                                                   01972000
TSBATTNC EQU   TSB+80                                                   01973000
TSBF1V   EQU   TSBTPOST+7                                               01974000
TSBF1M   EQU   TSBTPOST+6                                               01975000
TSBF2V   EQU   TSBTPOST+5                                               01976000
TSBF2M   EQU   TSBTPOST+4                                               01977000
TSBFLAGV EQU   TSBTPOST+3                                               01978000
TSBFLAGM EQU   TSBTPOST+2                                               01979000
@NM00082 EQU   TSBTPOST+1                                               01980000
@NM00081 EQU   TSBTPFLG                                                 01981000
@NM00080 EQU   TSBTPFLG                                                 01982000
@NM00079 EQU   TSBTPFLG                                                 01983000
@NM00078 EQU   TSBTPFLG                                                 01984000
TSBNEWID EQU   TSBTPFLG                                                 01985000
TSBTPAYI EQU   TSBTPFLG                                                 01986000
TSBTPQCB EQU   TSBTPFLG                                                 01987000
TSBPOSTO EQU   TSBTPFLG                                                 01988000
TSBLINKB EQU   TSBLINKA+1                                               01989000
TSBPRI   EQU   TSBLINKA                                                 01990000
TSBRQCB  EQU   TSBRCB                                                   01991000
TSBCTCB  EQU   TSB+60                                                   01992000
TSBERSDS EQU   TSB+56                                                   01993000
TSBAUTOI EQU   TSB+52                                                   01994000
TSBAUTOS EQU   TSB+48                                                   01995000
TSBATNCC EQU   TSB+44                                                   01996000
TSBASRCE EQU   TSB+42                                                   01997000
TSBHLDL  EQU   TSBFLG4                                                  01998000
TSBGETBF EQU   TSBFLG4                                                  01999000
TSBHOLD  EQU   TSBFLG4                                                  02000000
TSBHUNG  EQU   TSBFLG4                                                  02001000
TSBOWAIT EQU   TSBFLG4                                                  02002000
TSBIWAIT EQU   TSBFLG4                                                  02003000
TSBOCAB  EQU   TSBFLG4                                                  02004000
TSBLNNO  EQU   TSB+40                                                   02005000
TSBATNTC EQU   TSB+38                                                   02006000
TSBATNLC EQU   TSB+36                                                   02007000
TSBCHDCC EQU   TSBSTCC+1                                                02008000
TSBLNDCC EQU   TSBSTCC                                                  02009000
TSBECB   EQU   TSB+28                                                   02010000
TSBC1050 EQU   TSBTERM2                                                 02011000
@NM00077 EQU   TSBTERM2                                                 02012000
@NM00076 EQU   TSBTERM2                                                 02013000
@NM00075 EQU   TSBTERM2                                                 02014000
@NM00074 EQU   TSBTERM2                                                 02015000
TSBCTWX  EQU   TSBTERM2                                                 02016000
@NM00073 EQU   TSBTERM2                                                 02017000
@NM00072 EQU   TSBTERM2                                                 02018000
@NM00071 EQU   TSBTERM1                                                 02019000
@NM00070 EQU   TSBTERM1                                                 02020000
@NM00069 EQU   TSBTERM1                                                 02021000
TSBC2741 EQU   TSBTERM1                                                 02022000
TSBC5041 EQU   TSBTERM1                                                 02023000
TSBCATTN EQU   TSBTERM1                                                 02024000
TSBCBRK  EQU   TSBTERM1                                                 02025000
TSBCIHBN EQU   TSBTERM1                                                 02026000
TSBVTAM  EQU   TSBFLG5                                                  02027000
TSBKEYS  EQU   TSBFLG5                                                  02028000
TSBNEDIT EQU   TSBFLG5                                                  02029000
TSBQRY   EQU   TSBFLG5                                                  02030000
@NM00068 EQU   TSBFLG5                                                  02031000
TSBSPF   EQU   TSBFLG5                                                  02032000
TSBATMP  EQU   TSBFLG5                                                  02033000
TSBNFLOP EQU   TSBFLG3                                                  02034000
TSBNOBRK EQU   TSBFLG3                                                  02035000
TSBTPUT  EQU   TSBFLG3                                                  02036000
TSBAWOIP EQU   TSBFLG3                                                  02037000
TSBNBKSP EQU   TSBFLG3                                                  02038000
TSBSPIT  EQU   TSBFLG3                                                  02039000
TSBTJMSG EQU   TSBFLG3                                                  02040000
TSBATTN  EQU   TSBFLG3                                                  02041000
TSBIBFP  EQU   TSB+21                                                   02042000
TSBNIBF  EQU   TSB+20                                                   02043000
TSBITBFP EQU   TSB+17                                                   02044000
TSBSATN2 EQU   TSBFLG2                                                  02045000
TSBSATN1 EQU   TSBFLG2                                                  02046000
TSBSTAUT EQU   TSBFLG2                                                  02047000
TSBAUTOC EQU   TSBFLG2                                                  02048000
TSBAULST EQU   TSBFLG2                                                  02049000
TSBBRKIN EQU   TSBFLG2                                                  02050000
TSBAUTON EQU   TSBFLG2                                                  02051000
TSBBIPI  EQU   TSBFLG2                                                  02052000
TSBOBFP  EQU   TSB+13                                                   02053000
TSBNOBF  EQU   TSB+12                                                   02054000
TSBOTBFP EQU   TSB+9                                                    02055000
TSBLNSZ  EQU   TSB+8                                                    02056000
TSBTJBF  EQU   TSBFLG1                                                  02057000
TSBTJIP  EQU   TSBFLG1                                                  02058000
TSBTJOW  EQU   TSBFLG1                                                  02059000
TSBIFLSH EQU   TSBFLG1                                                  02060000
TSBWOWIP EQU   TSBFLG1                                                  02061000
TSBOWIP  EQU   TSBFLG1                                                  02062000
TSBOFLSH EQU   TSBFLG1                                                  02063000
TSBANSR  EQU   TSBFLG1                                                  02064000
TSBASCB  EQU   TSBASCBA+1                                               02065000
TSBATNLD EQU   TSBSTAT                                                  02066000
TSB3270  EQU   TSBSTAT                                                  02067000
TSBNOBUF EQU   TSBSTAT                                                  02068000
TSBDSPLY EQU   TSBSTAT                                                  02069000
TSBLWAIT EQU   TSBSTAT                                                  02070000
TSBINUSE EQU   TSBSTAT                                                  02071000
TCASTEND EQU   TCAST+148                                                02072000
TCASTTYO EQU   TCAST+144                                                02073000
TCAS767O EQU   TCAST+140                                                02074000
TCAS767I EQU   TCAST+136                                                02075000
TCASDUMP EQU   TCAST+132                                                02076000
TCASSCHD EQU   TCAST+128                                                02077000
TCASTPND EQU   TCAST+124                                                02078000
TCASOMJR EQU   TCAST+120                                                02079000
@NM00067 EQU   TCAST+118                                                02080000
TCASATTN EQU   TCAST+112                                                02081000
TCASASCI EQU   TCAST+108                                                02082000
TCASTTQH EQU   TCAST+104                                                02083000
@NM00066 EQU   TCAST+102                                                02084000
@NM00065 EQU   TCAST+100                                                02085000
TCASTGTF EQU   TCAST+96                                                 02086000
TCASASCB EQU   TCAST+92                                                 02087000
TCASFLG4 EQU   TCAST+91                                                 02088000
TCASFLG3 EQU   TCAST+90                                                 02089000
TCASFLG2 EQU   TCAST+89                                                 02090000
TCASCONF EQU   TCASFLG1                                                 02091000
@NM00064 EQU   TCASFLG1                                                 02092000
TCASHAST EQU   TCASFLG1                                                 02093000
TCASNACT EQU   TCASFLG1                                                 02094000
TCASVSD  EQU   TCASFLG1                                                 02095000
TCASABND EQU   TCASFLG1                                                 02096000
TCASMDSW EQU   TCASFLG1                                                 02097000
TCASBKMD EQU   TCASFLG1                                                 02098000
TCASLTE  EQU   TCAST+84                                                 02099000
TCASEXIT EQU   TCAST+80                                                 02100000
TCASOQM  EQU   TCAST+76                                                 02101000
TCASIQM  EQU   TCAST+72                                                 02102000
TCASTSB  EQU   TCAST+68                                                 02103000
TCASTTL  EQU   TCAST+64                                                 02104000
TCASWA   EQU   TCAST+60                                                 02105000
TCASFRR  EQU   TCAST+56                                                 02106000
TCASMSGS EQU   TCAST+52                                                 02107000
TCASDATO EQU   TCAST+48                                                 02108000
TCASDATI EQU   TCAST+44                                                 02109000
TCASXECB EQU   TCAST+40                                                 02110000
TCASTID  EQU   TCAST+32                                                 02111000
@NM00063 EQU   TCAST+31                                                 02112000
TCASCHNL EQU   TCAST+30                                                 02113000
TCASCRSZ EQU   TCAST+28                                                 02114000
TCASLBUF EQU   TCAST+24                                                 02115000
TCASHBUF EQU   TCAST+20                                                 02116000
TCASCLSZ EQU   TCAST+18                                                 02117000
TCASRCON EQU   TCAST+16                                                 02118000
TCASACBP EQU   TCAST+8                                                  02119000
TCASUMAX EQU   TCASUSER+2                                               02120000
TCASUSEC EQU   TCASUSER                                                 02121000
TCASID   EQU   TCAST                                                    02122000
WSAGSCHE EQU   WSAG+40                                                  02123000
WSAGREST EQU   WSAG+36                                                  02124000
WSAGNQDQ EQU   WSAG+32                                                  02125000
WSAGMEMT EQU   WSAG+28                                                  02126000
WSAGOPTM EQU   WSAG+24                                                  02127000
WSAGSTAT EQU   WSAG+20                                                  02128000
WSAGEMS0 EQU   WSAG+16                                                  02129000
WSAGSSRS EQU   WSAG+12                                                  02130000
WSAGRSM  EQU   WSAG+8                                                   02131000
WSAGPGIO EQU   WSAG                                                     02132000
@NM00062 EQU   SRBSECT+40                                               02133000
@NM00061 EQU   SRBSECT+38                                               02134000
SRBPRIOR EQU   SRBSECT+37                                               02135000
SRBPKF   EQU   SRBSECT+36                                               02136000
SRBSAVE  EQU   SRBSECT+32                                               02137000
SRBPTCB  EQU   SRBFLC+4                                                 02138000
SRBCPAFF EQU   SRBFLC                                                   02139000
ASVTEND  EQU   ASVT+528                                                 02140000
ASVTAVAI EQU   ASVTFRST                                                 02141000
ASVTRS00 EQU   ASVT+520                                                 02142000
ASVTMAXU EQU   ASVT+516                                                 02143000
ASVTASVT EQU   ASVT+512                                                 02144000
ASVTBEGN EQU   ASVT+512                                                 02145000
@NM00060 EQU   ASVT                                                     02146000
TCTRSV11 EQU   TCTTIOT+6                                                02147000
TCTSZLKP EQU   TCTTIOT+4                                                02148000
TCTSZEXT EQU   TCTPLEXT+2                                               02149000
@NM00059 EQU   TCTPLEXT                                                 02150000
TCTLCS   EQU   TCTCORE+16                                               02151000
TCTRBA   EQU   TCTCORE+12                                               02152000
TCTRSZ   EQU   TCTCORE+10                                               02153000
TCTMINC  EQU   TCTCORE+8                                                02154000
TCTHWM   EQU   TCTCORE+4                                                02155000
TCTLWM   EQU   TCTCORE                                                  02156000
TCTSOUT  EQU   TCTPGSMF+16                                              02157000
TCTSIN   EQU   TCTPGSMF+12                                              02158000
TCTRGNS  EQU   TCTPGSMF+8                                               02159000
TCTACT   EQU   TCTPGOUT                                                 02160000
TCTAJS   EQU   TCTPGIN                                                  02161000
TCTPPST  EQU   SMFTCT+60                                                02162000
TCTAST   EQU   SMFTCT+56                                                02163000
TCTLIN   EQU   SMFTCT+48                                                02164000
TCTWLMT  EQU   SMFTCT+44                                                02165000
TCTSACT  EQU   TCTTJLM                                                  02166000
TCTSTOF  EQU   TCTJSTX                                                  02167000
TCTRSV08 EQU   SMFTCT+32                                                02168000
TCTJMR   EQU   SMFTCT+28                                                02169000
TCTUDATA EQU   SMFTCT+24                                                02170000
TCTUTL   EQU   SMFTCT+20                                                02171000
TCTSZE   EQU   TCTPOOL+2                                                02172000
@NM00058 EQU   TCTPOOL                                                  02173000
TCTTCB   EQU   SMFTCT+4                                                 02174000
TCTRSV07 EQU   TCTSW                                                    02175000
TCTRSV06 EQU   TCTSW                                                    02176000
TCTRSV05 EQU   TCTSW                                                    02177000
TCTRSV04 EQU   TCTSW                                                    02178000
TCTRSV03 EQU   TCTSW                                                    02179000
TCTRSV02 EQU   TCTSW                                                    02180000
TCTIEX   EQU   TCTSW                                                    02181000
TCTJSTI  EQU   TCTSW                                                    02182000
TCTQA    EQU   SMFTCT                                                   02183000
@NM00057 EQU   TCBXTNT2+32                                              02184000
TCBRV181 EQU   TCBRV173                                                 02185000
TCBRV180 EQU   TCBRV173                                                 02186000
TCBRV179 EQU   TCBRV173                                                 02187000
TCBRV178 EQU   TCBRV173                                                 02188000
TCBRV177 EQU   TCBRV173                                                 02189000
TCBRV176 EQU   TCBRV173                                                 02190000
TCBRV175 EQU   TCBRV173                                                 02191000
TCBRV174 EQU   TCBRV173                                                 02192000
TCBRV172 EQU   TCBRV164                                                 02193000
TCBRV171 EQU   TCBRV164                                                 02194000
TCBRV170 EQU   TCBRV164                                                 02195000
TCBRV169 EQU   TCBRV164                                                 02196000
TCBRV168 EQU   TCBRV164                                                 02197000
TCBRV167 EQU   TCBRV164                                                 02198000
TCBRV166 EQU   TCBRV164                                                 02199000
TCBRV165 EQU   TCBRV164                                                 02200000
TCBRV163 EQU   TCBRV155                                                 02201000
TCBRV162 EQU   TCBRV155                                                 02202000
TCBRV161 EQU   TCBRV155                                                 02203000
TCBRV160 EQU   TCBRV155                                                 02204000
TCBRV159 EQU   TCBRV155                                                 02205000
TCBRV158 EQU   TCBRV155                                                 02206000
TCBRV157 EQU   TCBRV155                                                 02207000
TCBRV156 EQU   TCBRV155                                                 02208000
TCBRV154 EQU   TCBRV146                                                 02209000
TCBRV153 EQU   TCBRV146                                                 02210000
TCBRV152 EQU   TCBRV146                                                 02211000
TCBRV151 EQU   TCBRV146                                                 02212000
TCBRV150 EQU   TCBRV146                                                 02213000
TCBRV149 EQU   TCBRV146                                                 02214000
TCBRV148 EQU   TCBRV146                                                 02215000
TCBRV147 EQU   TCBRV146                                                 02216000
TCBRV145 EQU   TCBXTNT2+26                                              02217000
TCBRV144 EQU   TCBXTNT2+24                                              02218000
TCBRV143 EQU   TCBXTNT2+20                                              02219000
TCBRV142 EQU   TCBXTNT2+16                                              02220000
TCBRSV49 EQU   TCBXTNT2+12                                              02221000
TCBEVENT EQU   TCBXTNT2+8                                               02222000
TCBRCMP  EQU   TCBXTNT2+5                                               02223000
TCBRSVAB EQU   TCBXTNT2+4                                               02224000
TCBGTFA  EQU   TCBGTF+1                                                 02225000
TCBRSV47 EQU   TCBTFLG                                                  02226000
TCBRSV46 EQU   TCBTFLG                                                  02227000
TCBRSV45 EQU   TCBTFLG                                                  02228000
TCBRSV44 EQU   TCBTFLG                                                  02229000
TCBRSV43 EQU   TCBTFLG                                                  02230000
TCBDSPIT EQU   TCBTFLG                                                  02231000
TCBERRTN EQU   TCBTFLG                                                  02232000
TCBASYNC EQU   TCBTFLG                                                  02233000
@NM00056 EQU   TCB+296                                                  02234000
TCBSVCA2 EQU   TCB+292                                                  02235000
TCBSWASA EQU   TCB+288                                                  02236000
TCBDBTB  EQU   TCB+284                                                  02237000
TCBRPT   EQU   TCB+280                                                  02238000
TCBRV141 EQU   TCBRV133                                                 02239000
TCBRV140 EQU   TCBRV133                                                 02240000
TCBRV139 EQU   TCBRV133                                                 02241000
TCBRV138 EQU   TCBRV133                                                 02242000
TCBRV137 EQU   TCBRV133                                                 02243000
TCBRV136 EQU   TCBRV133                                                 02244000
TCBRV135 EQU   TCBRV133                                                 02245000
TCBRV134 EQU   TCBRV133                                                 02246000
TCBRV132 EQU   TCBRV124                                                 02247000
TCBRV131 EQU   TCBRV124                                                 02248000
TCBRV130 EQU   TCBRV124                                                 02249000
TCBRV129 EQU   TCBRV124                                                 02250000
TCBRV128 EQU   TCBRV124                                                 02251000
TCBRV127 EQU   TCBRV124                                                 02252000
TCBRV126 EQU   TCBRV124                                                 02253000
TCBRV125 EQU   TCBRV124                                                 02254000
TCBRV123 EQU   TCBFBYT2                                                 02255000
TCBRV122 EQU   TCBFBYT2                                                 02256000
TCBECBNV EQU   TCBFBYT2                                                 02257000
TCBSSSYN EQU   TCBFBYT2                                                 02258000
TCBFPRAP EQU   TCBFBYT2                                                 02259000
TCBFDW   EQU   TCBFBYT2                                                 02260000
TCBFMW   EQU   TCBFBYT2                                                 02261000
TCBCNCB  EQU   TCBFBYT2                                                 02262000
TCBLLH   EQU   TCBFBYT1                                                 02263000
TCBRV113 EQU   TCBFBYT1                                                 02264000
TCBEOT   EQU   TCBFBYT1                                                 02265000
TCBRTM2  EQU   TCBFBYT1                                                 02266000
TCBPGNLY EQU   TCBFBYT1                                                 02267000
TCBNDIOS EQU   TCBFBYT1                                                 02268000
TCBACTIV EQU   TCBFBYT1                                                 02269000
TCBEOTFM EQU   TCBFBYT1                                                 02270000
TCBAFFN  EQU   TCB+274                                                  02271000
TCBCCPVI EQU   TCB+272                                                  02272000
TCBUKYSP EQU   TCB+268                                                  02273000
TCBMODE  EQU   TCBESTAE+3                                               02274000
TCBERTYP EQU   TCBESTAE+2                                               02275000
TCBRV314 EQU   TCBESTRM                                                 02276000
TCBRV313 EQU   TCBESTRM                                                 02277000
TCBRV312 EQU   TCBESTRM                                                 02278000
TCBRV311 EQU   TCBESTRM                                                 02279000
TCBRV310 EQU   TCBESTRM                                                 02280000
TCBRV309 EQU   TCBESTRM                                                 02281000
TCBRV308 EQU   TCBESTRM                                                 02282000
TCBETERM EQU   TCBESTRM                                                 02283000
TCBSCBKY EQU   TCBESTAE                                                 02284000
TCBRTM12 EQU   TCB+260                                                  02285000
TCBTCBID EQU   TCB+256                                                  02286000
TCBRSV96 EQU   TCB+252                                                  02287000
TCBSWA   EQU   TCB+248                                                  02288000
TCBFOEA  EQU   TCBFOE+1                                                 02289000
TCBRSV42 EQU   TCBFOE                                                   02290000
TCBRV306 EQU   TCB+240                                                  02291000
TCBRSV41 EQU   TCB+239                                                  02292000
TCBTID   EQU   TCB+238                                                  02293000
TCBRSVAA EQU   TCB+237                                                  02294000
TCBABCUR EQU   TCB+236                                                  02295000
TCBTMSAV EQU   TCB+232                                                  02296000
TCBIOTIM EQU   TCB+228                                                  02297000
TCBRTWA  EQU   TCB+224                                                  02298000
TCBBACK  EQU   TCB+220                                                  02299000
TCBTIRB  EQU   TCB+216                                                  02300000
TCBAECB  EQU   TCB+212                                                  02301000
TCBEXT2A EQU   TCBEXT2+1                                                02302000
TCBRSV39 EQU   TCBEXT2                                                  02303000
TCBSTMCT EQU   TCB+207                                                  02304000
TCBSYSCT EQU   TCB+206                                                  02305000
TCBRSV37 EQU   TCB+205                                                  02306000
TCBEXSVC EQU   TCBDAR                                                   02307000
TCBDARMS EQU   TCBDAR                                                   02308000
TCBDARWT EQU   TCBDAR                                                   02309000
TCBDARO  EQU   TCBDAR                                                   02310000
TCBDARMC EQU   TCBDARC                                                  02311000
TCBDARD  EQU   TCBDAR                                                   02312000
TCBDARS  EQU   TCBDAR                                                   02313000
TCBDARP  EQU   TCBDAR                                                   02314000
TCBGTOFM EQU   TCBFLGS7                                                 02315000
TCBADMP  EQU   TCBFLGS7                                                 02316000
TCBRSTSK EQU   TCBFLGS7                                                 02317000
TCBSVCS  EQU   TCBFLGS7                                                 02318000
TCBSTACK EQU   TCBFLGS7                                                 02319000
TCBRSV34 EQU   TCBFLGS7                                                 02320000
TCBRSV33 EQU   TCBFLGS7                                                 02321000
TCBGPECB EQU   TCBFLGS7                                                 02322000
TCBNTJS  EQU   TCBFLGS6                                                 02323000
TCBAPG   EQU   TCBFLGS6                                                 02324000
TCBMIGR  EQU   TCBFLGS6                                                 02325000
TCBRV303 EQU   TCBFLGS6                                                 02326000
TCBSPVLK EQU   TCBFLGS6                                                 02327000
TCBCPU   EQU   TCBFLGS6                                                 02328000
TCBPIE17 EQU   TCBFLGS6                                                 02329000
TCBRV    EQU   TCBFLGS6                                                 02330000
TCBRSV79 EQU   TCBNDSP5                                                 02331000
TCBRSV78 EQU   TCBNDSP5                                                 02332000
TCBRSV77 EQU   TCBNDSP5                                                 02333000
TCBRSV76 EQU   TCBNDSP5                                                 02334000
TCBRSV75 EQU   TCBNDSP5                                                 02335000
TCBRSV74 EQU   TCBNDSP5                                                 02336000
TCBRSV95 EQU   TCBNDSP5                                                 02337000
TCBRSV94 EQU   TCBNDSP5                                                 02338000
TCBRSV93 EQU   TCBNDSP4                                                 02339000
TCBRSV92 EQU   TCBNDSP4                                                 02340000
TCBRSV91 EQU   TCBNDSP4                                                 02341000
TCBRSV90 EQU   TCBNDSP4                                                 02342000
TCBRSV89 EQU   TCBNDSP4                                                 02343000
TCBRSV88 EQU   TCBNDSP4                                                 02344000
TCBRSV87 EQU   TCBNDSP4                                                 02345000
TCBRSV86 EQU   TCBNDSP4                                                 02346000
TCBEXT1A EQU   TCBEXT1+1                                                02347000
TCBRSV32 EQU   TCBEXT1                                                  02348000
TCBEXCPD EQU   TCB+192                                                  02349000
TCBIOBRC EQU   TCB+188                                                  02350000
TCBDDWTC EQU   TCB+186                                                  02351000
TCBDDEXC EQU   TCB+184                                                  02352000
TCBJSCBB EQU   TCBJSCB+1                                                02353000
@NM00055 EQU   TCBRECDE                                                 02354000
TCBREC   EQU   TCBRECDE                                                 02355000
TCBMDIDS EQU   TCB+176                                                  02356000
TCBNDINT EQU   TCBNDSP3                                                 02357000
TCBRSV27 EQU   TCBNDSP3                                                 02358000
TCBRSV26 EQU   TCBNDSP3                                                 02359000
TCBRSV25 EQU   TCBNDSP3                                                 02360000
TCBRSV24 EQU   TCBNDSP3                                                 02361000
TCBSRBND EQU   TCBNDSP3                                                 02362000
TCBRV302 EQU   TCBNDSP3                                                 02363000
TCBLJSND EQU   TCBNDSP3                                                 02364000
TCBABE   EQU   TCBNDSP2                                                 02365000
TCBDSS   EQU   TCBNDSP2                                                 02366000
TCBOWAIT EQU   TCBNDSP2                                                 02367000
TCBIWAIT EQU   TCBNDSP2                                                 02368000
TCBNDTS  EQU   TCBNDSP2                                                 02369000
TCBNDSVC EQU   TCBNDSP2                                                 02370000
TCBSTPP  EQU   TCBNDSP2                                                 02371000
TCBABD   EQU   TCBNDSP2                                                 02372000
TCBRSV22 EQU   TCBNDSP1                                                 02373000
TCBPIEND EQU   TCBNDSP1                                                 02374000
TCBTPSP  EQU   TCBNDSP1                                                 02375000
TCBDDRND EQU   TCBNDSP1                                                 02376000
TCBRSPND EQU   TCBNDSP1                                                 02377000
TCBRSTND EQU   TCBNDSP1                                                 02378000
TCBDARPN EQU   TCBNDSP1                                                 02379000
TCBDARTN EQU   TCBNDSP1                                                 02380000
TCBNDSP0 EQU   TCBNDSP                                                  02381000
TCBUSER  EQU   TCB+168                                                  02382000
TCBTCTB  EQU   TCBTCT+1                                                 02383000
TCBRSV9C EQU   TCBTCTGF                                                 02384000
TCBRSV9B EQU   TCBTCTGF                                                 02385000
TCBRSV9A EQU   TCBTCTGF                                                 02386000
TCBRSV99 EQU   TCBTCTGF                                                 02387000
TCBRSV98 EQU   TCBTCTGF                                                 02388000
TCBRSV97 EQU   TCBTCTGF                                                 02389000
TCBRSV20 EQU   TCBTCTGF                                                 02390000
TCBSMFGF EQU   TCBTCTGF                                                 02391000
TCBSTABB EQU   TCBSTAB+1                                                02392000
TCBSTCUR EQU   TCBNSTAE                                                 02393000
TCBRV301 EQU   TCBNSTAE                                                 02394000
TCBSYNCH EQU   TCBNSTAE                                                 02395000
TCBHALT  EQU   TCBNSTAE                                                 02396000
TCBPPSUP EQU   TCBNSTAE                                                 02397000
TCB33E   EQU   TCBNSTAE                                                 02398000
TCBQUIES EQU   TCBNSTAE                                                 02399000
TCBSTABE EQU   TCBNSTAE                                                 02400000
TCBAQE   EQU   TCB+156                                                  02401000
TCBPQE   EQU   TCB+152                                                  02402000
TCBTSDP  EQU   TCB+151                                                  02403000
TCBTSLP  EQU   TCB+150                                                  02404000
TCBSTPCT EQU   TCB+149                                                  02405000
TCBCPUBN EQU   TCBTSFLG                                                 02406000
TCBDYDSP EQU   TCBTSFLG                                                 02407000
TCBRSV18 EQU   TCBTSFLG                                                 02408000
TCBRSV17 EQU   TCBTSFLG                                                 02409000
TCBATT   EQU   TCBTSFLG                                                 02410000
TCBSTPPR EQU   TCBTSFLG                                                 02411000
TCBRV300 EQU   TCBTSTSK                                                 02412000
TCBECB   EQU   TCB+144                                                  02413000
TCBIQE   EQU   TCB+140                                                  02414000
TCBLTC   EQU   TCB+136                                                  02415000
TCBOTC   EQU   TCB+132                                                  02416000
TCBNTC   EQU   TCB+128                                                  02417000
TCBJSTCA EQU   TCBJSTCB+1                                               02418000
TCBRSV16 EQU   TCBJSTCB                                                 02419000
TCBTQET  EQU   TCBTME                                                   02420000
TCBTCB   EQU   TCB+116                                                  02421000
TCBFSAB  EQU   TCBFSA+1                                                 02422000
TCBQEL   EQU   TCBFSA                                                   02423000
TCBGRS15 EQU   TCBGRS+60                                                02424000
TCBGRS14 EQU   TCBGRS+56                                                02425000
TCBGRS13 EQU   TCBGRS+52                                                02426000
TCBGRS12 EQU   TCBGRS+48                                                02427000
TCBGRS11 EQU   TCBGRS+44                                                02428000
TCBGRS10 EQU   TCBGRS+40                                                02429000
TCBGRS9  EQU   TCBGRS+36                                                02430000
TCBGRS8  EQU   TCBGRS+32                                                02431000
TCBGRS7  EQU   TCBGRS+28                                                02432000
TCBGRS6  EQU   TCBGRS+24                                                02433000
TCBGRS5  EQU   TCBGRS+20                                                02434000
TCBGRS4  EQU   TCBGRS+16                                                02435000
TCBGRS3  EQU   TCBGRS+12                                                02436000
TCBGRS2  EQU   TCBGRS+8                                                 02437000
TCBGRS1  EQU   TCBGRS+4                                                 02438000
TCBGRS0  EQU   TCBGRS                                                   02439000
TCBJPQB  EQU   TCBJPQ+1                                                 02440000
TCBRSV15 EQU   TCBPURGE                                                 02441000
TCBRSV14 EQU   TCBPURGE                                                 02442000
TCBRSV13 EQU   TCBPURGE                                                 02443000
TCBRSV12 EQU   TCBPURGE                                                 02444000
TCBRSV11 EQU   TCBPURGE                                                 02445000
TCBRSV10 EQU   TCBPURGE                                                 02446000
TCBRSV09 EQU   TCBPURGE                                                 02447000
TCBJPQF  EQU   TCBPURGE                                                 02448000
TCBJLB   EQU   TCB+40                                                   02449000
TCBLLS   EQU   TCB+36                                                   02450000
TCBDSP   EQU   TCB+35                                                   02451000
TCBLMP   EQU   TCB+34                                                   02452000
TCBPNDSP EQU   TCBFLGS5                                                 02453000
TCBFCD1  EQU   TCBFLGS5                                                 02454000
TCBSTP   EQU   TCBFLGS5                                                 02455000
TCBSYS   EQU   TCBFLGS5                                                 02456000
TCBANDSP EQU   TCBFLGS5                                                 02457000
TCBPAGE  EQU   TCBFLGS5                                                 02458000
TCBUXNDF EQU   TCBABWF                                                  02459000
TCBFC    EQU   TCBFLGS5                                                 02460000
TCBONDSP EQU   TCBFLGS4                                                 02461000
TCBMPCND EQU   TCBFLGS4                                                 02462000
TCBMPCVQ EQU   TCBFLGS4                                                 02463000
TCBUXNDV EQU   TCBFLGS4                                                 02464000
TCBHNDSP EQU   TCBFLGS4                                                 02465000
TCBRQENA EQU   TCBFLGS4                                                 02466000
TCBSER   EQU   TCBFLGS4                                                 02467000
TCBNDUMP EQU   TCBFLGS4                                                 02468000
TCBDWSTA EQU   TCBFLGS3                                                 02469000
TCBRSV08 EQU   TCBFLGS3                                                 02470000
TCBRSV07 EQU   TCBFLGS3                                                 02471000
TCBRSV06 EQU   TCBFLGS3                                                 02472000
TCBABGM  EQU   TCBFLGS3                                                 02473000
TCBABTRM EQU   TCBFLGS3                                                 02474000
TCBADINP EQU   TCBFLGS3                                                 02475000
TCBFSM   EQU   TCBFLGS3                                                 02476000
TCBFTS   EQU   TCBFLGS2                                                 02477000
TCBFETXR EQU   TCBFLGS2                                                 02478000
TCBFDSOP EQU   TCBFLGS2                                                 02479000
TCBFJMC  EQU   TCBFLGS2                                                 02480000
TCBFSMC  EQU   TCBFLGS2                                                 02481000
TCBFABOP EQU   TCBFLGS2                                                 02482000
TCBFSTI  EQU   TCBFLGS2                                                 02483000
TCBFOINP EQU   TCBFLGS2                                                 02484000
TCBFS    EQU   TCBFLGS1                                                 02485000
TCBFT    EQU   TCBFLGS1                                                 02486000
TCBPDUMP EQU   TCBFLGS1                                                 02487000
TCBNONPR EQU   TCBFLGS1                                                 02488000
TCBFERA  EQU   TCBFLGS1                                                 02489000
TCBFE    EQU   TCBFLGS1                                                 02490000
TCBFA    EQU   TCBFLGS1                                                 02491000
TCBZERO  EQU   TCBPKF                                                   02492000
TCBFLAG  EQU   TCBPKF                                                   02493000
TCBMSSB  EQU   TCBMSS+1                                                 02494000
TCBRSV03 EQU   TCBMSS                                                   02495000
TCBTRNB  EQU   TCBTRN+1                                                 02496000
TCBRSV02 EQU   TCBABF                                                   02497000
TCBOLTEP EQU   TCBABF                                                   02498000
TCBTCP   EQU   TCBABF                                                   02499000
TCBTCPP  EQU   TCBABF                                                   02500000
TCBRSV01 EQU   TCBABF                                                   02501000
TCBGRPH  EQU   TCBABF                                                   02502000
TCBNOCHK EQU   TCBABF                                                   02503000
TCBMOD91 EQU   TCBABF                                                   02504000
TCBCMPC  EQU   TCBCMP+1                                                 02505000
TCBRV318 EQU   TCBCMSG                                                  02506000
TCBRV317 EQU   TCBCIND                                                  02507000
TCBRV316 EQU   TCBCWTO                                                  02508000
TCBCASID EQU   TCBCDBL                                                  02509000
TCBNOCC  EQU   TCBSTCC                                                  02510000
TCBDMPO  EQU   TCBCPP                                                   02511000
TCBCSTEP EQU   TCBCMPF                                                  02512000
TCBCREQ  EQU   TCBCMPF                                                  02513000
TCBTIO   EQU   TCB+12                                                   02514000
TCBDEB   EQU   TCB+8                                                    02515000
TCBPIEA  EQU   TCBPIE+1                                                 02516000
TCBPM    EQU   TCBPMASK                                                 02517000
@NM00054 EQU   TCBPMASK                                                 02518000
TCBFRS6  EQU   TCBFRS+24                                                02519000
TCBFRS4  EQU   TCBFRS+16                                                02520000
TCBFRS2  EQU   TCBFRS+8                                                 02521000
TCBFRS0  EQU   TCBFRS                                                   02522000
SVRBEND  EQU   RBSECT+192                                               02523000
RBFEPARM EQU   RBSECT+168                                               02524000
SIRBEND  EQU   RBSECT+168                                               02525000
RBRSV158 EQU   RBRSV150                                                 02526000
RBRSV157 EQU   RBRSV150                                                 02527000
RBRSV156 EQU   RBRSV150                                                 02528000
RBRSV155 EQU   RBRSV150                                                 02529000
RBRSV154 EQU   RBRSV150                                                 02530000
RBRSV153 EQU   RBRSV150                                                 02531000
RBRSV152 EQU   RBRSV150                                                 02532000
RBRSV151 EQU   RBRSV150                                                 02533000
RBRSV149 EQU   RBSECT+166                                               02534000
RBRSV148 EQU   RBSECT+164                                               02535000
RBRSV169 EQU   RBSDATA+3                                                02536000
RBSID    EQU   RBSDATA+2                                                02537000
RBSPKEY  EQU   RBSDATA+1                                                02538000
RBRSV168 EQU   RBSFLG3                                                  02539000
RBSTERMO EQU   RBSFLG3                                                  02540000
RBSBRNTR EQU   RBSFLG3                                                  02541000
RBSPRNTR EQU   RBSFLG3                                                  02542000
RBSCNCEL EQU   RBSFLG3                                                  02543000
RBSRECRD EQU   RBSFLG3                                                  02544000
RBSTERMI EQU   RBSFLG3                                                  02545000
RBRSV167 EQU   RBSFLG3                                                  02546000
RBSOWNRA EQU   RBSOWNR+1                                                02547000
RBSSUPER EQU   RBSFLGS2                                                 02548000
RBSKEY0  EQU   RBSFLGS2                                                 02549000
RBRSV166 EQU   RBSFLGS2                                                 02550000
RBRSV165 EQU   RBSFLGS2                                                 02551000
RBSINUSE EQU   RBSFLGS2                                                 02552000
RBRSV164 EQU   RBSFLGS2                                                 02553000
RBSXCTL2 EQU   RBSFLGS2                                                 02554000
RBRSV163 EQU   RBSFLGS2                                                 02555000
RBSPARMA EQU   RBSPARM+1                                                02556000
RBSHALT  EQU   RBSIOPRC                                                 02557000
RBSNOIOP EQU   RBSIOPRC                                                 02558000
RBSASYNC EQU   RBSFLGS1                                                 02559000
RBRSV162 EQU   RBSFLGS1                                                 02560000
RBSESTAE EQU   RBSFLGS1                                                 02561000
RBSDUMMY EQU   RBSFLGS1                                                 02562000
RBSSTAR  EQU   RBSFLGS1                                                 02563000
RBSSTAI  EQU   RBSFLGS1                                                 02564000
RBSEXIT  EQU   RBSCBB+4                                                 02565000
RBSCHAIN EQU   RBSCBB                                                   02566000
TIRBEND  EQU   @NM00028+8                                               02567000
PRBEND   EQU   @NM00028+8                                               02568000
RBRSV146 EQU   RBRSV138                                                 02569000
RBRSV145 EQU   RBRSV138                                                 02570000
RBRSV144 EQU   RBRSV138                                                 02571000
RBRSV143 EQU   RBRSV138                                                 02572000
RBRSV142 EQU   RBRSV138                                                 02573000
RBRSV141 EQU   RBRSV138                                                 02574000
RBRSV140 EQU   RBRSV138                                                 02575000
RBRSV139 EQU   RBRSV138                                                 02576000
RBRSV137 EQU   @NM00028+6                                               02577000
RBRSV136 EQU   @NM00028+4                                               02578000
RBRSV135 EQU   @NM00028                                                 02579000
@NM00027 EQU   RBSECT+32                                                02580000
@NM00026 EQU   @NM00024+1                                               02581000
RBSCF    EQU   @NM00025                                                 02582000
RBPGMQ1  EQU   RBPGMQ+1                                                 02583000
@NM00023 EQU   RBPGMQ                                                   02584000
@NM00022 EQU   RBSECT+16                                                02585000
@NM00021 EQU   @NM00017                                                 02586000
@NM00020 EQU   @NM00017                                                 02587000
RBIQETP  EQU   @NM00017                                                 02588000
RBUSIQE  EQU   RBETXR                                                   02589000
RBATTN   EQU   @NM00017                                                 02590000
@NM00019 EQU   @NM00017                                                 02591000
@NM00018 EQU   @NM00017                                                 02592000
RBPMSVRB EQU   @NM00015                                                 02593000
RBATNXIT EQU   @NM00015                                                 02594000
@NM00016 EQU   @NM00015                                                 02595000
RBWAITP  EQU   @NM00015                                                 02596000
RBFNSVRB EQU   RBTRSVRB                                                 02597000
RBFTP    EQU   @NM00015                                                 02598000
RBSIZE   EQU   RBSECT+8                                                 02599000
RBABOPSW EQU   RBSECT+4                                                 02600000
RBPPSAV1 EQU   RBPPSAV+1                                                02601000
@NM00013 EQU   RBPPSAV                                                  02602000
RBPRFXND EQU   RBPREFIX+64                                              02603000
RBINTCOD EQU   RBINTCDA+1                                               02604000
RBINLNTH EQU   RBINTCDA                                                 02605000
RBWCSA   EQU   RBPREFIX+60                                              02606000
RBRSV004 EQU   RBPREFIX+57                                              02607000
RBSSSYN  EQU   RBFLAGS1                                                 02608000
RBSCB    EQU   RBFLAGS1                                                 02609000
RBLONGWT EQU   RBFLAGS1                                                 02610000
RBASIR   EQU   RBFLAGS1                                                 02611000
RBRSV159 EQU   RBFLAGS1                                                 02612000
RBABEND  EQU   RBFLAGS1                                                 02613000
RBXWAIT  EQU   RBFLAGS1                                                 02614000
RBSLOCK  EQU   RBFLAGS1                                                 02615000
RBRTRAN  EQU   RBRTPSW2+4                                               02616000
RBRTINCD EQU   RBRTICIL+2                                               02617000
RBRTILC  EQU   RBRTICIL+1                                               02618000
RBRSV160 EQU   RBRTICIL                                                 02619000
RBRTPSW1 EQU   RBRTOPSW                                                 02620000
RBRSV062 EQU   RBRSV054                                                 02621000
RBRSV061 EQU   RBRSV054                                                 02622000
RBRSV060 EQU   RBRSV054                                                 02623000
RBRSV059 EQU   RBRSV054                                                 02624000
RBRSV058 EQU   RBRSV054                                                 02625000
RBRSV057 EQU   RBRSV054                                                 02626000
RBRSV056 EQU   RBRSV054                                                 02627000
RBRSV055 EQU   RBRSV054                                                 02628000
RBRSV053 EQU   RBPREFIX+38                                              02629000
RBRSV052 EQU   RBPREFIX+36                                              02630000
RBRSV051 EQU   RBPREFIX+32                                              02631000
RBPRFXST EQU   RBPREFIX+32                                              02632000
RBRSV050 EQU   RBPREFIX+28                                              02633000
RBRSV049 EQU   RBRSV041                                                 02634000
RBRSV048 EQU   RBRSV041                                                 02635000
RBRSV047 EQU   RBRSV041                                                 02636000
RBRSV046 EQU   RBRSV041                                                 02637000
RBRSV045 EQU   RBRSV041                                                 02638000
RBRSV044 EQU   RBRSV041                                                 02639000
RBRSV043 EQU   RBRSV041                                                 02640000
RBRSV042 EQU   RBRSV041                                                 02641000
RBRSV040 EQU   RBPREFIX+26                                              02642000
RBRSV039 EQU   RBPREFIX+24                                              02643000
RBRSV038 EQU   RBPREFIX+20                                              02644000
RBRSV037 EQU   RBPREFIX+16                                              02645000
RBRSV036 EQU   RBRSV028                                                 02646000
RBRSV035 EQU   RBRSV028                                                 02647000
RBRSV034 EQU   RBRSV028                                                 02648000
RBRSV033 EQU   RBRSV028                                                 02649000
RBRSV032 EQU   RBRSV028                                                 02650000
RBRSV031 EQU   RBRSV028                                                 02651000
RBRSV030 EQU   RBRSV028                                                 02652000
RBRSV029 EQU   RBRSV028                                                 02653000
RBRSV027 EQU   RBRSV019                                                 02654000
RBRSV026 EQU   RBRSV019                                                 02655000
RBRSV025 EQU   RBRSV019                                                 02656000
RBRSV024 EQU   RBRSV019                                                 02657000
RBRSV023 EQU   RBRSV019                                                 02658000
RBRSV022 EQU   RBRSV019                                                 02659000
RBRSV021 EQU   RBRSV019                                                 02660000
RBRSV020 EQU   RBRSV019                                                 02661000
RBRSV018 EQU   RBPREFIX+13                                              02662000
RBRSV017 EQU   RBPREFIX+12                                              02663000
RBSRV016 EQU   RBPREFIX+11                                              02664000
RBRSV015 EQU   RBPREFIX+10                                              02665000
RBRSV014 EQU   RBPREFIX+8                                               02666000
RBRSV013 EQU   RBPREFIX+4                                               02667000
RBRSV012 EQU   RBPREFIX                                                 02668000
XRBREG15 EQU   RBGRS15                                                  02669000
XRBREG14 EQU   RBGRS14                                                  02670000
XRBREG13 EQU   RBGRS13                                                  02671000
XRBREG12 EQU   RBGRS12                                                  02672000
XRBREG11 EQU   RBGRS11                                                  02673000
XRBREG10 EQU   RBGRS10                                                  02674000
XRBREG9  EQU   RBGRS9                                                   02675000
XRBREG8  EQU   RBGRS8                                                   02676000
XRBREG7  EQU   RBGRS7                                                   02677000
XRBREG6  EQU   RBGRS6                                                   02678000
XRBREG5  EQU   RBGRS5                                                   02679000
XRBREG4  EQU   RBGRS4                                                   02680000
XRBREG3  EQU   RBGRS3                                                   02681000
XRBREG2  EQU   RBGRS2                                                   02682000
XRBREG1  EQU   RBGRS1                                                   02683000
XRBREG0  EQU   RBGRS0                                                   02684000
XRBLNKA  EQU   RBLINKB                                                  02685000
XRBWT    EQU   RBWCF                                                    02686000
@NM00012 EQU   RBBASIC+24                                               02687000
RBOPSWPS EQU   RBOPSWB2                                                 02688000
@NM00011 EQU   RBOPSWB2                                                 02689000
@NM00010 EQU   XRBPSW                                                   02690000
@NM00009 EQU   RBBASIC+12                                               02691000
XRBWAIT  EQU   RBECBWT                                                  02692000
XRBFRRB  EQU   RBFDYN                                                   02693000
@NM00008 EQU   XSTAB2                                                   02694000
XRBACTV  EQU   RBFACTV                                                  02695000
XRBTCBP  EQU   RBTCBNXT                                                 02696000
@NM00007 EQU   XSTAB1                                                   02697000
XRBCKPT  EQU   RBFTCKPT                                                 02698000
@NM00006 EQU   XSTAB1                                                   02699000
@NM00005 EQU   RBBASIC+8                                                02700000
@NM00004 EQU   RBEXRTNM+1                                               02701000
RBTMIND3 EQU   RBTMFLD                                                  02702000
RBTMIND2 EQU   RBTMFLD                                                  02703000
RBTMCMP  EQU   RBTMFLD                                                  02704000
RBWLIM   EQU   RBTMFLD                                                  02705000
RBRSV005 EQU   RBTMFLD                                                  02706000
RBTMTOD  EQU   RBTMFLD                                                  02707000
RBTMQUE  EQU   RBTMFLD                                                  02708000
@NM00003 EQU   RBPRFX                                                   02709000
ASCBEND  EQU   ASCB+208                                                 02710000
ASCBSRBT EQU   ASCB+200                                                 02711000
ASCBSWTL EQU   ASCB+196                                                 02712000
ASCBRS14 EQU   ASCB+195                                                 02713000
ASCBSMCT EQU   ASCB+194                                                 02714000
ASCBRS12 EQU   ASCB+192                                                 02715000
ASCBPCTT EQU   ASCB+188                                                 02716000
ASCBVGTT EQU   ASCB+184                                                 02717000
ASCBRV43 EQU   ASCBSRQ4                                                 02718000
ASCBRV42 EQU   ASCBSRQ4                                                 02719000
ASCBRV41 EQU   ASCBSRQ4                                                 02720000
ASCBRV40 EQU   ASCBSRQ4                                                 02721000
ASCBRV39 EQU   ASCBSRQ4                                                 02722000
ASCBRV38 EQU   ASCBSRQ4                                                 02723000
ASCBRV37 EQU   ASCBSRQ4                                                 02724000
ASCBRV36 EQU   ASCBSRQ4                                                 02725000
ASCBRV35 EQU   ASCBSRQ3                                                 02726000
ASCBRV34 EQU   ASCBSRQ3                                                 02727000
ASCBRV33 EQU   ASCBSRQ3                                                 02728000
ASCBRV32 EQU   ASCBSRQ3                                                 02729000
ASCBRV31 EQU   ASCBSRQ3                                                 02730000
ASCBRV30 EQU   ASCBSRQ3                                                 02731000
ASCBRV29 EQU   ASCBSRQ3                                                 02732000
ASCBRV28 EQU   ASCBSRQ3                                                 02733000
ASCBRV27 EQU   ASCBSRQ2                                                 02734000
ASCBRV26 EQU   ASCBSRQ2                                                 02735000
ASCBRV25 EQU   ASCBSRQ2                                                 02736000
ASCBRV24 EQU   ASCBSRQ2                                                 02737000
ASCBRV23 EQU   ASCBSRQ2                                                 02738000
ASCBRV22 EQU   ASCBSRQ2                                                 02739000
ASCBRV21 EQU   ASCBSRQ2                                                 02740000
ASCBRV20 EQU   ASCBSRQ2                                                 02741000
ASCBRV19 EQU   ASCBSRQ1                                                 02742000
ASCBRV18 EQU   ASCBSRQ1                                                 02743000
ASCBRV17 EQU   ASCBSRQ1                                                 02744000
ASCBRV16 EQU   ASCBSRQ1                                                 02745000
ASCBRV15 EQU   ASCBSRQ1                                                 02746000
ASCBRV14 EQU   ASCBSRQ1                                                 02747000
ASCBRV13 EQU   ASCBSRQ1                                                 02748000
ASCBSTA  EQU   ASCBSRQ1                                                 02749000
ASCBJBNS EQU   ASCB+176                                                 02750000
ASCBJBNI EQU   ASCB+172                                                 02751000
ASCBMCC  EQU   ASCB+168                                                 02752000
ASCBRTWA EQU   ASCB+164                                                 02753000
ASCBIQEA EQU   ASCB+160                                                 02754000
ASCBXMPQ EQU   ASCB+156                                                 02755000
ASCBRS01 EQU   ASCB+154                                                 02756000
ASCBFMCT EQU   ASCB+152                                                 02757000
ASCBOUXB EQU   ASCB+148                                                 02758000
ASCBOUCB EQU   ASCB+144                                                 02759000
ASCBMECB EQU   ASCB+140                                                 02760000
ASCBQECB EQU   ASCB+136                                                 02761000
ASCBLSQH EQU   ASCBLKGP+4                                               02762000
ASCBLOCK EQU   ASCBLKGP                                                 02763000
ASCBTCBS EQU   ASCB+124                                                 02764000
ASCBNVSC EQU   ASCB+122                                                 02765000
ASCBVSC  EQU   ASCB+120                                                 02766000
ASCBSRBS EQU   ASCB+118                                                 02767000
ASCBSSRB EQU   ASCB+116                                                 02768000
ASCBRV06 EQU   ASCBFLG2                                                 02769000
ASCBRV05 EQU   ASCBFLG2                                                 02770000
ASCBRV04 EQU   ASCBFLG2                                                 02771000
ASCBSNQS EQU   ASCBFLG2                                                 02772000
ASCBS2S  EQU   ASCBFLG2                                                 02773000
ASCBCEXT EQU   ASCBFLG2                                                 02774000
ASCBPXMT EQU   ASCBFLG2                                                 02775000
ASCBXMPT EQU   ASCBFLG2                                                 02776000
ASCBRF07 EQU   ASCBDSP1                                                 02777000
ASCBRF06 EQU   ASCBDSP1                                                 02778000
ASCBRF05 EQU   ASCBDSP1                                                 02779000
ASCBRF04 EQU   ASCBDSP1                                                 02780000
ASCBRF03 EQU   ASCBDSP1                                                 02781000
ASCBRF02 EQU   ASCBDSP1                                                 02782000
ASCBFAIL EQU   ASCBDSP1                                                 02783000
ASCBNOQ  EQU   ASCBDSP1                                                 02784000
ASCBSWCT EQU   ASCB+112                                                 02785000
ASCBASXB EQU   ASCB+108                                                 02786000
ASCBTMCH EQU   ASCB+104                                                 02787000
ASCBNSWP EQU   ASCBFLG1                                                 02788000
ASCBTYP1 EQU   ASCBFLG1                                                 02789000
ASCBSTND EQU   ASCBFLG1                                                 02790000
ASCBABNT EQU   ASCBFLG1                                                 02791000
ASCBTERM EQU   ASCBFLG1                                                 02792000
ASCBS3S  EQU   ASCBFLG1                                                 02793000
ASCBCMSH EQU   ASCBFLG1                                                 02794000
ASCBTOFF EQU   ASCBFLG1                                                 02795000
ASCBRF01 EQU   ASCBRCTF                                                 02796000
ASCBTMLW EQU   ASCBRCTF                                                 02797000
ASCBOUT  EQU   ASCBRCTF                                                 02798000
ASCBWAIT EQU   ASCBRCTF                                                 02799000
ASCBRV08 EQU   ASCBRCTF                                                 02800000
ASCBFQU  EQU   ASCBRCTF                                                 02801000
ASCBFRS  EQU   ASCBRCTF                                                 02802000
ASCBTMNO EQU   ASCBRCTF                                                 02803000
ASCBAFFN EQU   ASCBFW1                                                  02804000
ASCBDUMP EQU   ASCB+96                                                  02805000
ASCBQSVC EQU   ASCB+92                                                  02806000
ASCBUBET EQU   ASCB+88                                                  02807000
ASCBECB  EQU   ASCB+84                                                  02808000
ASCBJSTL EQU   ASCB+80                                                  02809000
ASCBEWST EQU   ASCB+72                                                  02810000
ASCBEJST EQU   ASCB+64                                                  02811000
ASCBCSCB EQU   ASCB+56                                                  02812000
ASCBRSM  EQU   ASCB+52                                                  02813000
ASCBLDA  EQU   ASCB+48                                                  02814000
ASCBSTOR EQU   ASCB+44                                                  02815000
ASCBDP   EQU   ASCB+43                                                  02816000
ASCBRV07 EQU   ASCB+42                                                  02817000
ASCBIOSM EQU   ASCB+40                                                  02818000
ASCBSEQN EQU   ASCB+38                                                  02819000
ASCBCPUS EQU   ASCB+32                                                  02820000
ASCBSPL  EQU   ASCB+28                                                  02821000
ASCBIOSP EQU   ASCB+24                                                  02822000
ASCBSYNC EQU   ASCBSUPC+4                                               02823000
ASCBSVRB EQU   ASCBSUPC                                                 02824000
ASCBCMSF EQU   ASCB+12                                                  02825000
ASCBBWDP EQU   ASCB+8                                                   02826000
ASCBFWDP EQU   ASCB+4                                                   02827000
ASCBASCB EQU   ASCB                                                     02828000
ASCBEGIN EQU   ASCB                                                     02829000
CVTLEVL  EQU   CVTRELNO+2                                               02830000
CVTNUMB  EQU   CVTRELNO                                                 02831000
CVTMDL   EQU   CVTFIX+250                                               02832000
@NM00002 EQU   CVTFIX+248                                               02833000
@NM00001 EQU   CVTFIX                                                   02834000
CVTRV482 EQU   CVTXTNT2+128                                             02835000
CVTRV481 EQU   CVTXTNT2+124                                             02836000
CVTRV480 EQU   CVTXTNT2+120                                             02837000
CVTRV479 EQU   CVTXTNT2+118                                             02838000
CVTRV478 EQU   CVTXTNT2+117                                             02839000
CVTRV477 EQU   CVTXTNT2+116                                             02840000
CVTRV476 EQU   CVTXTNT2+115                                             02841000
CVTRV475 EQU   CVTXTNT2+114                                             02842000
CVTRV474 EQU   CVTRV466                                                 02843000
CVTRV473 EQU   CVTRV466                                                 02844000
CVTRV472 EQU   CVTRV466                                                 02845000
CVTRV471 EQU   CVTRV466                                                 02846000
CVTRV470 EQU   CVTRV466                                                 02847000
CVTRV469 EQU   CVTRV466                                                 02848000
CVTRV468 EQU   CVTRV466                                                 02849000
CVTRV467 EQU   CVTRV466                                                 02850000
CVTRV465 EQU   CVTRV457                                                 02851000
CVTRV464 EQU   CVTRV457                                                 02852000
CVTRV463 EQU   CVTRV457                                                 02853000
CVTRV462 EQU   CVTRV457                                                 02854000
CVTRV461 EQU   CVTRV457                                                 02855000
CVTRV460 EQU   CVTRV457                                                 02856000
CVTRV459 EQU   CVTRV457                                                 02857000
CVTRV458 EQU   CVTRV457                                                 02858000
CVTRV456 EQU   CVTXTNT2+108                                             02859000
CVTRV455 EQU   CVTXTNT2+104                                             02860000
CVTRV454 EQU   CVTXTNT2+100                                             02861000
CVTRV453 EQU   CVTXTNT2+96                                              02862000
CVTRV452 EQU   CVTXTNT2+94                                              02863000
CVTRV451 EQU   CVTXTNT2+92                                              02864000
CVTRV450 EQU   CVTXTNT2+90                                              02865000
CVTRV449 EQU   CVTXTNT2+88                                              02866000
CVTRV448 EQU   CVTXTNT2+87                                              02867000
CVTRV447 EQU   CVTXTNT2+86                                              02868000
CVTRV446 EQU   CVTRV438                                                 02869000
CVTRV445 EQU   CVTRV438                                                 02870000
CVTRV444 EQU   CVTRV438                                                 02871000
CVTRV443 EQU   CVTRV438                                                 02872000
CVTRV442 EQU   CVTRV438                                                 02873000
CVTRV441 EQU   CVTRV438                                                 02874000
CVTRV440 EQU   CVTRV438                                                 02875000
CVTRV439 EQU   CVTRV438                                                 02876000
CVTRV437 EQU   CVTRV429                                                 02877000
CVTRV436 EQU   CVTRV429                                                 02878000
CVTRV435 EQU   CVTRV429                                                 02879000
CVTRV434 EQU   CVTRV429                                                 02880000
CVTRV433 EQU   CVTRV429                                                 02881000
CVTRV432 EQU   CVTRV429                                                 02882000
CVTRV431 EQU   CVTRV429                                                 02883000
CVTRV430 EQU   CVTRV429                                                 02884000
CVTRV428 EQU   CVTXTNT2+80                                              02885000
CVTRV427 EQU   CVTXTNT2+76                                              02886000
CVTRV426 EQU   CVTXTNT2+72                                              02887000
CVTRV425 EQU   CVTXTNT2+68                                              02888000
CVTATACT EQU   CVTATCVT                                                 02889000
CVTRV423 EQU   CVTXTNT2+62                                              02890000
CVTRV422 EQU   CVTXTNT2+60                                              02891000
CVTRV421 EQU   CVTXTNT2+58                                              02892000
CVTRV420 EQU   CVTXTNT2+56                                              02893000
CVTRV419 EQU   CVTXTNT2+55                                              02894000
CVTRV418 EQU   CVTXTNT2+54                                              02895000
CVTRV417 EQU   CVTRV409                                                 02896000
CVTRV416 EQU   CVTRV409                                                 02897000
CVTRV415 EQU   CVTRV409                                                 02898000
CVTRV414 EQU   CVTRV409                                                 02899000
CVTRV413 EQU   CVTRV409                                                 02900000
CVTRV412 EQU   CVTRV409                                                 02901000
CVTRV411 EQU   CVTRV409                                                 02902000
CVTRV410 EQU   CVTRV409                                                 02903000
CVTRV408 EQU   CVTRV400                                                 02904000
CVTRV407 EQU   CVTRV400                                                 02905000
CVTRV406 EQU   CVTRV400                                                 02906000
CVTRV405 EQU   CVTRV400                                                 02907000
CVTRV404 EQU   CVTRV400                                                 02908000
CVTRV403 EQU   CVTRV400                                                 02909000
CVTRV402 EQU   CVTRV400                                                 02910000
CVTRV401 EQU   CVTRV400                                                 02911000
CVTICB   EQU   CVTXTNT2+48                                              02912000
CVTSKTA  EQU   CVTXTNT2+44                                              02913000
CVTCCVT  EQU   CVTXTNT2+40                                              02914000
CVTRSV98 EQU   CVTXTNT2+36                                              02915000
CVTRSV97 EQU   CVTXTNT2+34                                              02916000
CVTRSV96 EQU   CVTXTNT2+32                                              02917000
CVTOLTEP EQU   CVTXTNT2+28                                              02918000
CVTQIDA  EQU   CVTQID+1                                                 02919000
CVTRSV95 EQU   CVTQID                                                   02920000
CVTRSV94 EQU   CVTXTNT2+20                                              02921000
CVTRSV93 EQU   CVTXTNT2+16                                              02922000
CVTRSV92 EQU   CVTXTNT2+12                                              02923000
CVTDEBVR EQU   CVTXTNT2+8                                               02924000
CVTRSV91 EQU   CVTXTNT2+6                                               02925000
CVTRSV9H EQU   CVTFLGBT                                                 02926000
CVTRSV9G EQU   CVTFLGBT                                                 02927000
CVTRSV9F EQU   CVTFLGBT                                                 02928000
CVTRSV9E EQU   CVTFLGBT                                                 02929000
CVTRSV9D EQU   CVTFLGBT                                                 02930000
CVTBAH   EQU   CVTFLGBT                                                 02931000
CVTVME   EQU   CVTFLGBT                                                 02932000
CVTNPE   EQU   CVTFLGBT                                                 02933000
CVTNUCLS EQU   CVTXTNT2+4                                               02934000
CVTDSSVA EQU   CVTDSSV+1                                                02935000
CVTRSV89 EQU   CVTDSSV                                                  02936000
CVTRSV88 EQU   CVTXTNT1+8                                               02937000
CVTRSV87 EQU   CVTXTNT1+4                                               02938000
CVTFACHN EQU   CVTXTNT1                                                 02939000
CVTRV488 EQU   CVTMAP+412                                               02940000
CVTRV487 EQU   CVTMAP+408                                               02941000
CVTRV486 EQU   CVTMAP+404                                               02942000
CVTRV485 EQU   CVTMAP+400                                               02943000
CVTACTAP EQU   CVTMAP+396                                               02944000
CVTAUTH  EQU   CVTMAP+392                                               02945000
CVTRV490 EQU   CVTMAP+388                                               02946000
CVTSU    EQU   CVTMAP+384                                               02947000
CVTVOLT1 EQU   CVTVOLM1+1                                               02948000
CVTVOLI1 EQU   CVTVOLF1                                                 02949000
CVTSTOA  EQU   CVTMAP+376                                               02950000
CVTRSV58 EQU   CVTMAP+374                                               02951000
CVTRSV57 EQU   CVTMAP+372                                               02952000
CVTDDCE  EQU   CVTMAP+368                                               02953000
CVTPNWFR EQU   CVTMAP+364                                               02954000
CVTSMF   EQU   CVTMAP+360                                               02955000
CVTSULK  EQU   CVTMAP+358                                               02956000
CVTSLKO  EQU   CVTSYSK                                                  02957000
CVTSLKP  EQU   CVTSYSK                                                  02958000
CVTSLKQ  EQU   CVTSYSK                                                  02959000
CVTSLKR  EQU   CVTSYSK                                                  02960000
CVTRSV56 EQU   CVTSYSK                                                  02961000
CVTRSV55 EQU   CVTSYSK                                                  02962000
CVTRSV54 EQU   CVTSYSK                                                  02963000
CVTRSV53 EQU   CVTSYSK                                                  02964000
CVTRSV52 EQU   CVTA1F1                                                  02965000
CVTRSV51 EQU   CVTA1F1                                                  02966000
CVTRSV50 EQU   CVTA1F1                                                  02967000
CVTRSV49 EQU   CVTA1F1                                                  02968000
CVTRSV48 EQU   CVTA1F1                                                  02969000
CVTRSV47 EQU   CVTA1F1                                                  02970000
CVTSRSW  EQU   CVTA1F1                                                  02971000
CVTPFSW  EQU   CVTA1F1                                                  02972000
CVTPCVT  EQU   CVTMAP+352                                               02973000
CVTRSV46 EQU   CVTMAP+344                                               02974000
CVTRSV45 EQU   CVTMAP+340                                               02975000
CVTRSV44 EQU   CVTMAP+338                                               02976000
CVTRSV43 EQU   CVTMAP+336                                               02977000
CVTHJESA EQU   CVTHJES+1                                                02978000
CVTRSV42 EQU   CVTHJES                                                  02979000
CVTEXT2A EQU   CVTEXT2+1                                                02980000
CVTRSV41 EQU   CVTEXT2                                                  02981000
CVTAPFA  EQU   CVTAPF+1                                                 02982000
CVTRSV40 EQU   CVTAPF                                                   02983000
CVTRV518 EQU   CVTINTLA                                                 02984000
CVTRV517 EQU   CVTERPV                                                  02985000
CVTEORM  EQU   CVTMAP+312                                               02986000
CVTMCHPR EQU   CVTMAP+308                                               02987000
CVTTZ    EQU   CVTMAP+304                                               02988000
CVTJEPS  EQU   CVTMAP+300                                               02989000
CVTJESCT EQU   CVTMAP+296                                               02990000
CVTMODE  EQU   CVTMAP+292                                               02991000
CVTPTRV  EQU   CVTMAP+288                                               02992000
CVTREAL  EQU   CVTMAP+284                                               02993000
CVTRSV39 EQU   CVTMAP+280                                               02994000
CVTRSV38 EQU   CVTMAP+276                                               02995000
CVTDMSRA EQU   CVTDMSR+1                                                02996000
CVTRV634 EQU   CVTDMSRF                                                 02997000
CVTRV633 EQU   CVTDMSRF                                                 02998000
CVTRV632 EQU   CVTDMSRF                                                 02999000
CVTRV631 EQU   CVTDMSRF                                                 03000000
CVTRV630 EQU   CVTDMSRF                                                 03001000
CVTRV629 EQU   CVTDMSRF                                                 03002000
CVTUDUMP EQU   CVTDMSRF                                                 03003000
CVTSDUMP EQU   CVTDMSRF                                                 03004000
CVTQMSGA EQU   CVTQMSG+1                                                03005000
CVTRSV36 EQU   CVTQMSG                                                  03006000
CVTAMFF  EQU   CVTMAP+264                                               03007000
CVTPURGA EQU   CVTPURG+1                                                03008000
CVTRSV35 EQU   CVTPURG                                                  03009000
CVTCBSP  EQU   CVTMAP+256                                               03010000
CVTATERA EQU   CVTATER+1                                                03011000
CVTSYST  EQU   CVTATER                                                  03012000
CVTVOLT2 EQU   CVTTAT                                                   03013000
CVTVOLI2 EQU   CVTVOLF2                                                 03014000
CVTAQAVB EQU   CVTAQAVT+1                                               03015000
CVTRSV34 EQU   CVTTCMFG                                                 03016000
CVTRSV33 EQU   CVTTCMFG                                                 03017000
CVTRSV32 EQU   CVTTCMFG                                                 03018000
CVTRSV31 EQU   CVTTCMFG                                                 03019000
CVTRSV30 EQU   CVTTCMFG                                                 03020000
CVTRSV29 EQU   CVTTCMFG                                                 03021000
CVTLDEV  EQU   CVTTCMFG                                                 03022000
CVTTCRDY EQU   CVTTCMFG                                                 03023000
CVTGTFA  EQU   CVTGTF+1                                                 03024000
CVTRSV27 EQU   CVTGTFST                                                 03025000
CVTRNIO  EQU   CVTGTFST                                                 03026000
CVTUSR   EQU   CVTGTFST                                                 03027000
CVTRV318 EQU   CVTFORM                                                  03028000
CVTRV317 EQU   CVTTMODE                                                 03029000
CVTRV316 EQU   CVTSTATE                                                 03030000
CVTRV315 EQU   CVTGTFS                                                  03031000
CVTGTFAV EQU   CVTGTFS                                                  03032000
CVT0SCR1 EQU   CVTMAP+232                                               03033000
CVTRV515 EQU   CVTMAP+228                                               03034000
CVTRMS   EQU   CVTMAP+224                                               03035000
CVTPATCH EQU   CVTMAP+220                                               03036000
CVTTSCE  EQU   CVTMAP+216                                               03037000
CVTLNKSC EQU   CVTMAP+214                                               03038000
CVTQABST EQU   CVTMAP+212                                               03039000
CVTMDLDS EQU   CVTMAP+208                                               03040000
CVTUSER  EQU   CVTMAP+204                                               03041000
CVTABEND EQU   CVTMAP+200                                               03042000
CVTSMCA  EQU   CVTMAP+196                                               03043000
CVTRSV18 EQU   CVTMAP+192                                               03044000
CVTQLPAQ EQU   CVTMAP+188                                               03045000
CVTQCDSR EQU   CVTMAP+184                                               03046000
CVTVS1B  EQU   CVTOPTB                                                  03047000
CVTVS1A  EQU   CVTOPTB                                                  03048000
CVTFP    EQU   CVTOPTB                                                  03049000
CVTAPTHR EQU   CVTOPTB                                                  03050000
CVTNLOG  EQU   CVTOPTB                                                  03051000
CVTTOD   EQU   CVTOPTB                                                  03052000
CVTCTIMS EQU   CVTOPTB                                                  03053000
CVTPROT  EQU   CVTOPTB                                                  03054000
CVTXPFP  EQU   CVTOPTA                                                  03055000
CVTASCII EQU   CVTOPTA                                                  03056000
CVTRSV13 EQU   CVTOPTA                                                  03057000
CVTRSV12 EQU   CVTOPTA                                                  03058000
CVTNIP   EQU   CVTOPTA                                                  03059000
CVTDDR   EQU   CVTOPTA                                                  03060000
CVTAPR   EQU   CVTOPTA                                                  03061000
CVTCCH   EQU   CVTOPTA                                                  03062000
CVTSNCTR EQU   CVTMAP+180                                               03063000
CVTQMWR  EQU   CVTMAP+176                                               03064000
CVTQOCR  EQU   CVTMAP+172                                               03065000
CVT1EF00 EQU   CVTMAP+168                                               03066000
CVTMZ00  EQU   CVTMAP+164                                               03067000
CVTHEAD  EQU   CVTMAP+160                                               03068000
CVTRSV11 EQU   CVTMAP+156                                               03069000
CVT0PT01 EQU   CVTMAP+152                                               03070000
CVTMSER  EQU   CVTMAP+148                                               03071000
CVTRV516 EQU   CVTIERLC                                                 03072000
CVTILCH  EQU   CVTMAP+140                                               03073000
CVT0DS   EQU   CVTMAP+136                                               03074000
CVTFBOSV EQU   CVTMAP+132                                               03075000
CVTNUCB  EQU   CVTMAP+128                                               03076000
CVTIXAVL EQU   CVTMAP+124                                               03077000
CVTIOQET EQU   CVTMAP+120                                               03078000
CVTDCBA  EQU   CVTMAP+117                                               03079000
CVTMVS2  EQU   CVTDCB                                                   03080000
CVT6DAT  EQU   CVTDCB                                                   03081000
CVT4MPS  EQU   CVTDCB                                                   03082000
CVTRSV09 EQU   CVTDCB                                                   03083000
CVT4MS1  EQU   CVTDCB                                                   03084000
CVT2SPS  EQU   CVTDCB                                                   03085000
CVT1SSS  EQU   CVTDCB                                                   03086000
CVTRSV08 EQU   CVTDCB                                                   03087000
CVTSTB   EQU   CVTMAP+112                                               03088000
CVTQTD00 EQU   CVTMAP+108                                               03089000
CVTQTE00 EQU   CVTMAP+104                                               03090000
CVTCUCB  EQU   CVTMAP+100                                               03091000
CVTSJQ   EQU   CVTMAP+96                                                03092000
CVTPBLDL EQU   CVTMAP+92                                                03093000
CVTTPC   EQU   CVTMAP+88                                                03094000
CVTSVDCB EQU   CVTMAP+84                                                03095000
CVTBRET  EQU   CVTMAP+82                                                03096000
CVTEXIT  EQU   CVTMAP+80                                                03097000
CVT0FN00 EQU   CVTMAP+76                                                03098000
CVTDARA  EQU   CVTDAR+1                                                 03099000
CVTRSV07 EQU   CVTFLGS1                                                 03100000
CVTRSV06 EQU   CVTFLGS1                                                 03101000
CVTRSV05 EQU   CVTFLGS1                                                 03102000
CVTRSV04 EQU   CVTFLGS1                                                 03103000
CVTRSV03 EQU   CVTFLGS1                                                 03104000
CVTRSV02 EQU   CVTFLGS1                                                 03105000
CVTRSV01 EQU   CVTFLGS1                                                 03106000
CVTDMPLK EQU   CVTFLGS1                                                 03107000
CVTXITP  EQU   CVTMAP+68                                                03108000
CVTZDTAB EQU   CVTMAP+64                                                03109000
CVTMSLT  EQU   CVTMAP+60                                                03110000
CVTDATE  EQU   CVTMAP+56                                                03111000
CVTBTERM EQU   CVTMAP+52                                                03112000
CVTSYSAD EQU   CVTMAP+48                                                03113000
CVTXTLER EQU   CVTMAP+44                                                03114000
CVTILK2  EQU   CVTMAP+40                                                03115000
CVTILK1  EQU   CVTMAP+36                                                03116000
CVTPRLTV EQU   CVTMAP+32                                                03117000
CVTPCNVT EQU   CVTMAP+28                                                03118000
CVT0VL00 EQU   CVTMAP+24                                                03119000
CVTXAPG  EQU   CVTMAP+20                                                03120000
CVTBUF   EQU   CVTMAP+16                                                03121000
CVTJOB   EQU   CVTMAP+12                                                03122000
CVTLINK  EQU   CVTMAP+8                                                 03123000
CVT0EF00 EQU   CVTMAP+4                                                 03124000
CVTTCBP  EQU   CVTMAP                                                   03125000
@NM00053 EQU   PSA+3668                                                 03126000
PSASTAK  EQU   PSA+3072                                                 03127000
@NM00052 EQU   PSA+1048                                                 03128000
PSAUSEND EQU   PSA+1048                                                 03129000
PSARV062 EQU   PSA+1044                                                 03130000
PSACDAL  EQU   PSA+1040                                                 03131000
PSAWTCOD EQU   PSA+1036                                                 03132000
PSAATCVT EQU   PSA+1032                                                 03133000
PSAPCPSW EQU   PSA+1024                                                 03134000
PSAPIR2  EQU   PSA+1020                                                 03135000
PSARV059 EQU   PSA+1018                                                 03136000
PSASVC13 EQU   PSA+1016                                                 03137000
PSALSFCC EQU   PSA+1012                                                 03138000
PSASFACC EQU   PSA+1008                                                 03139000
PSASTOP  EQU   PSA+992                                                  03140000
PSASTART EQU   PSA+976                                                  03141000
PSARSPSW EQU   PSA+968                                                  03142000
PSASRPSW EQU   PSA+960                                                  03143000
PSARV045 EQU   PSA+892                                                  03144000
PSARV044 EQU   PSA+888                                                  03145000
PSARV043 EQU   PSA+884                                                  03146000
PSARV042 EQU   PSA+880                                                  03147000
PSARV041 EQU   PSA+876                                                  03148000
PSARV040 EQU   PSA+872                                                  03149000
PSARV025 EQU   PSA+868                                                  03150000
PSADSSED EQU   PSA+868                                                  03151000
PSADSSPR EQU   PSA+864                                                  03152000
PSADSSFW EQU   PSA+860                                                  03153000
PSADSS14 EQU   PSA+856                                                  03154000
PSADSSPP EQU   PSA+848                                                  03155000
PSADSSRP EQU   PSA+840                                                  03156000
PSADSS05 EQU   PSADSSF4                                                 03157000
PSADSS10 EQU   PSADSSF4                                                 03158000
PSADSSVE EQU   PSADSSF4                                                 03159000
PSADSSDE EQU   PSADSSF4                                                 03160000
PSADSSC0 EQU   PSADSSF4                                                 03161000
PSADSSIE EQU   PSADSSF4                                                 03162000
PSADSS12 EQU   PSADSSF4                                                 03163000
PSADSSRC EQU   PSADSSF4                                                 03164000
PSARV057 EQU   PSADSSF3                                                 03165000
PSARV056 EQU   PSADSSF3                                                 03166000
PSARV055 EQU   PSADSSF3                                                 03167000
PSADSSMC EQU   PSADSSF3                                                 03168000
PSADSSRW EQU   PSADSSF3                                                 03169000
PSADSSNM EQU   PSADSSF3                                                 03170000
PSADSSES EQU   PSADSSF3                                                 03171000
PSADSSGP EQU   PSADSSF3                                                 03172000
PSADSSF2 EQU   PSADSSFL+1                                               03173000
PSADSSPI EQU   PSADSSF1                                                 03174000
PSADSSOI EQU   PSADSSF1                                                 03175000
PSADSSSP EQU   PSADSSF1                                                 03176000
PSADSSTP EQU   PSADSSF1                                                 03177000
PSADSSDW EQU   PSADSSF1                                                 03178000
PSADSSDD EQU   PSADSSF1                                                 03179000
PSADSSDM EQU   PSADSSF1                                                 03180000
PSADSSMV EQU   PSADSSF1                                                 03181000
PSADSSTS EQU   PSA+816                                                  03182000
PSADSSWK EQU   PSA+812                                                  03183000
PSADSSR3 EQU   PSA+808                                                  03184000
PSADSSR2 EQU   PSA+804                                                  03185000
PSADSSRS EQU   PSA+800                                                  03186000
PSASTOR  EQU   PSA+796                                                  03187000
PSACPUSA EQU   PSA+794                                                  03188000
PSAVSTAP EQU   PSA+792                                                  03189000
PSAWKVAP EQU   PSA+788                                                  03190000
PSAWKRAP EQU   PSA+784                                                  03191000
PSAMCHIC EQU   PSA+783                                                  03192000
PSARV061 EQU   PSA+782                                                  03193000
PSASYMSK EQU   PSA+781                                                  03194000
PSAMCHFL EQU   PSA+780                                                  03195000
PSACR0   EQU   PSA+776                                                  03196000
PSAPSWSV EQU   PSA+768                                                  03197000
PSACLHS  EQU   PSAHLHI                                                  03198000
PSALKR15 EQU   PSALKSA+60                                               03199000
PSALKR14 EQU   PSALKSA+56                                               03200000
PSALKR13 EQU   PSALKSA+52                                               03201000
PSALKR12 EQU   PSALKSA+48                                               03202000
PSALKR11 EQU   PSALKSA+44                                               03203000
PSALKR10 EQU   PSALKSA+40                                               03204000
PSALKR9  EQU   PSALKSA+36                                               03205000
PSALKR8  EQU   PSALKSA+32                                               03206000
PSALKR7  EQU   PSALKSA+28                                               03207000
PSALKR6  EQU   PSALKSA+24                                               03208000
PSALKR5  EQU   PSALKSA+20                                               03209000
PSALKR4  EQU   PSALKSA+16                                               03210000
PSALKR3  EQU   PSALKSA+12                                               03211000
PSALKR2  EQU   PSALKSA+8                                                03212000
PSALKR1  EQU   PSALKSA+4                                                03213000
PSALKR0  EQU   PSALKSA                                                  03214000
PSARV023 EQU   PSACLHT+52                                               03215000
PSALOCAL EQU   PSACLHT+48                                               03216000
PSACMSL  EQU   PSACLHT+44                                               03217000
PSAOPTL  EQU   PSACLHT+40                                               03218000
PSATPACL EQU   PSACLHT+36                                               03219000
PSATPDNL EQU   PSACLHT+32                                               03220000
PSATPNCL EQU   PSACLHT+28                                               03221000
PSAIOSLL EQU   PSACLHT+24                                               03222000
PSAIOSUL EQU   PSACLHT+20                                               03223000
PSAIOSCL EQU   PSACLHT+16                                               03224000
PSAIOSSL EQU   PSACLHT+12                                               03225000
PSASALCL EQU   PSACLHT+8                                                03226000
PSAASML  EQU   PSACLHT+4                                                03227000
PSADISPL EQU   PSACLHT                                                  03228000
PSASRSA  EQU   PSA+636                                                  03229000
PSARV050 EQU   PSA+634                                                  03230000
PSADSSGO EQU   PSA+633                                                  03231000
PSARECUR EQU   PSA+632                                                  03232000
PSAHLHIS EQU   PSA+628                                                  03233000
PSAIPCSA EQU   PSA+624                                                  03234000
@NM00051 EQU   PSA+621                                                  03235000
PSAIPCDM EQU   PSA+620                                                  03236000
PSAIPCD  EQU   PSA+616                                                  03237000
@NM00050 EQU   PSA+613                                                  03238000
PSAIPCRM EQU   PSA+612                                                  03239000
PSAIPCR  EQU   PSA+608                                                  03240000
PSAMCHEX EQU   PSA+600                                                  03241000
PSAMPSW  EQU   PSA+592                                                  03242000
PSAEXPS2 EQU   PSA+584                                                  03243000
PSAEXPS1 EQU   PSA+576                                                  03244000
PSAPIREG EQU   PSA+572                                                  03245000
PSARSREG EQU   PSA+568                                                  03246000
PSAGPREG EQU   PSA+556                                                  03247000
PSARV022 EQU   PSASUP4                                                  03248000
PSARV021 EQU   PSASUP4                                                  03249000
PSARV020 EQU   PSASUP4                                                  03250000
PSARV019 EQU   PSASUP4                                                  03251000
PSARV018 EQU   PSASUP4                                                  03252000
PSARV017 EQU   PSASUP4                                                  03253000
PSARV016 EQU   PSASUP4                                                  03254000
PSARV015 EQU   PSASUP4                                                  03255000
PSARV014 EQU   PSASUP3                                                  03256000
PSARV013 EQU   PSASUP3                                                  03257000
PSARV012 EQU   PSASUP3                                                  03258000
PSARV011 EQU   PSASUP3                                                  03259000
PSASPR   EQU   PSASUP3                                                  03260000
PSAPSREG EQU   PSASUP3                                                  03261000
PSAPI2   EQU   PSASUP3                                                  03262000
PSAIOSUP EQU   PSASUP3                                                  03263000
PSALCR   EQU   PSASUP2                                                  03264000
PSARTM   EQU   PSASUP2                                                  03265000
PSAACR   EQU   PSASUP2                                                  03266000
PSAIPCE2 EQU   PSASUP2                                                  03267000
PSAIPCES EQU   PSASUP2                                                  03268000
PSAIPCEC EQU   PSASUP2                                                  03269000
PSAGTF   EQU   PSASUP2                                                  03270000
PSAIPCRI EQU   PSASUP2                                                  03271000
PSARV063 EQU   PSASUP1                                                  03272000
PSATCTL  EQU   PSASUP1                                                  03273000
PSADISP  EQU   PSASUP1                                                  03274000
PSALOCK  EQU   PSASUP1                                                  03275000
PSAPI    EQU   PSASUP1                                                  03276000
PSAEXT   EQU   PSASUP1                                                  03277000
PSASVC   EQU   PSASUP1                                                  03278000
PSAIO    EQU   PSASUP1                                                  03279000
PSAANEW  EQU   PSA+544                                                  03280000
PSATOLD  EQU   PSA+540                                                  03281000
PSATNEW  EQU   PSA+536                                                  03282000
PSALCCAR EQU   PSA+532                                                  03283000
PSALCCAV EQU   PSA+528                                                  03284000
PSAPCCAR EQU   PSA+524                                                  03285000
PSAPCCAV EQU   PSA+520                                                  03286000
PSACPULA EQU   PSA+518                                                  03287000
PSACPUPA EQU   PSA+516                                                  03288000
PSAPSA   EQU   PSA+512                                                  03289000
FLCHDEND EQU   PSA+512                                                  03290000
FLCCRSAV EQU   FLCMCLA+280                                              03291000
FLCGRSAV EQU   FLCMCLA+216                                              03292000
FLCFPSAV EQU   FLCMCLA+184                                              03293000
FLCFLA   EQU   FLCMCLA+88                                               03294000
FLCRGNCD EQU   FLCMCLA+84                                               03295000
FLCFSAA  EQU   FLCFSA+1                                                 03296000
@NM00049 EQU   FLCFSA                                                   03297000
@NM00048 EQU   FLCMCLA+72                                               03298000
FLCMCIC  EQU   FLCMCLA+64                                               03299000
@NM00047 EQU   FLCMCLA+20                                               03300000
FLCIOAA  EQU   FLCIOA+1                                                 03301000
@NM00046 EQU   FLCIOA                                                   03302000
@NM00045 EQU   FLCMCLA+15                                               03303000
@NM00044 EQU   FLCMCLA+14                                               03304000
@NM00043 EQU   FLCMCLA+12                                               03305000
FLCLCL   EQU   FLCMCLA+8                                                03306000
FLCIOELA EQU   FLCIOEL+1                                                03307000
@NM00042 EQU   FLCIOEL                                                  03308000
FLCCHNID EQU   FLCMCLA                                                  03309000
@NM00041 EQU   PSA+160                                                  03310000
FLCMTRCD EQU   PSA+157                                                  03311000
@NM00040 EQU   PSA+156                                                  03312000
FLCPERA  EQU   FLCPER+1                                                 03313000
@NM00039 EQU   FLCPER                                                   03314000
@NM00038 EQU   PSA+151                                                  03315000
FLCPERCD EQU   PSA+150                                                  03316000
FLCMCNUM EQU   PSA+149                                                  03317000
@NM00037 EQU   PSA+148                                                  03318000
FLCTEAA  EQU   FLCTEA+1                                                 03319000
@NM00036 EQU   FLCTEA                                                   03320000
PSAPIPC  EQU   PSAPICOD                                                 03321000
PSAPIMC  EQU   PSAPICOD                                                 03322000
PSAPIPER EQU   PSAPICOD                                                 03323000
PSARV049 EQU   FLCPICOD                                                 03324000
FLCPILCB EQU   FLCPIILC                                                 03325000
@NM00035 EQU   FLCPIILC                                                 03326000
@NM00034 EQU   PSAEPPSW                                                 03327000
FLCSVCN  EQU   PSAESPSW+2                                               03328000
FLCSILCB EQU   FLCSVILC                                                 03329000
@NM00033 EQU   FLCSVILC                                                 03330000
@NM00032 EQU   PSAESPSW                                                 03331000
FLCEICOD EQU   PSAEEPSW+2                                               03332000
PSASPAD  EQU   PSAEEPSW                                                 03333000
@NM00031 EQU   PSA+128                                                  03334000
FLCINPSW EQU   PSA+120                                                  03335000
FLCMNPSW EQU   PSA+112                                                  03336000
FLCPNPSW EQU   PSA+104                                                  03337000
FLCSNPSW EQU   PSA+96                                                   03338000
FLCENPSW EQU   PSA+88                                                   03339000
FLCTRACE EQU   PSA+84                                                   03340000
FLCTIMER EQU   PSA+80                                                   03341000
FLCCVT2  EQU   PSA+76                                                   03342000
FLCCAW   EQU   PSA+72                                                   03343000
FLCCSW   EQU   PSA+64                                                   03344000
FLCIOPSW EQU   PSA+56                                                   03345000
FLCMOPSW EQU   PSA+48                                                   03346000
FLCPOPSW EQU   PSA+40                                                   03347000
FLCSOPSW EQU   PSA+32                                                   03348000
FLCEOPSW EQU   PSA+24                                                   03349000
@NM00030 EQU   FLCICCW2+4                                               03350000
FLCICCW1 EQU   FLCROPSW                                                 03351000
FLCIPPSW EQU   FLCRNPSW                                                 03352000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03353000
@RC00194 EQU   @RC00189                                                 03354000
@ENDDATA EQU   *                                                        03355000
         END   IKTASTPT,(C'PLS1900',0702,80232)                         03356000
