         TITLE 'IKTCAS33: CHAIN NEW TSB'                                00001000
IKTCAS33 CSECT ,                                                01S0001 00002000
@MAINENT DS    0H                                               01S0001 00003000
         USING *,@15                                            01S0001 00004000
         B     @PROLOG                                          01S0001 00005000
         DC    AL1(16)                                          01S0001 00006000
         DC    C'IKTCAS33  80.232'                              01S0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00009000
         BALR  @12,0                                            01S0001 00010000
@PSTART  DS    0H                                               01S0001 00011000
         USING @PSTART,@12                                      01S0001 00012000
         ST    @13,@SA00001+4                                   01S0001 00013000
         LA    @06,@SA00001                                     01S0001 00014000
         ST    @06,8(,@13)                                      01S0001 00015000
         LR    @13,@06                                          01S0001 00016000
         PRINT OFF                                                      00017000
         PRINT ON                                                       00018000
*                                                               01S0132 00019000
*/********************************************************************/ 00020000
*/*                                                                  */ 00021000
*/* SEGMENT-                                                         */ 00022000
*/*      IKTCAS33                                                    */ 00023000
*/*                                                                  */ 00024000
*/* FUNCTION-                                                        */ 00025000
*/*      MAINLINE CODE                                               */ 00026000
*/*                                                                  */ 00027000
*/********************************************************************/ 00028000
*                                                               01S0132 00029000
*   DO;                             /* BLOCK MAIN MAIN SEGMENT  01S0132 00030000
*                                                            @ZM45344*/ 00031000
*TMBEGIN:                           /* RETRY LABEL                   */ 00032000
*     TWAUEIFC(3)=FCUIMA;           /* SET FOOTPRINT IN ESTAI   01S0133 00033000
*                                      PARAMETER                     */ 00034000
TMBEGIN  MVI   TWAUEIFC+16(TWAPTR),X'31'                        01S0133 00035000
*     TWAUERA(3)=ADDR(TMBEGIN);     /* SPECIFY RETRY ADDRESS         */ 00036000
         LA    @06,TMBEGIN                                      01S0134 00037000
         STCM  @06,7,TWAUERA+16(TWAPTR)                         01S0134 00038000
*     TWAUERRS(3)=EVAL(R13+4)->TMWA3;/* STORE SAVE AREA ADDRESS      */ 00039000
         LA    @06,4                                            01S0135 00040000
         ALR   @06,R13                                          01S0135 00041000
         L     @06,TMWA3(,@06)                                  01S0135 00042000
         ST    @06,TWAUERRS+16(,TWAPTR)                         01S0135 00043000
*     TCASTPTR=TWATCAST;            /* GET TCAST ADDRESS             */ 00044000
         L     @06,TWATCAST(,TWAPTR)                            01S0136 00045000
         ST    @06,TCASTPTR                                     01S0136 00046000
*     GEN CODE REFS(PSALITA);                                   01S0137 00047000
*                                   /* GET CMS LOCK FOR TSB ACCESS   */ 00048000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,               C00049000
               RELATED=('CHAIN TSB')                                    00050000
         SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,REGS=USE,                 C00051000
               RELATED=('CHAIN TSB')                                    00052000
*     IF R8=FCUIMA THEN             /* IF TSB CHAIN REQUEST  @ZM45344*/ 00053000
         C     R8,@CF00476                                      01S0138 00054000
         BNE   @RF00138                                         01S0138 00055000
         EJECT                                                          00056000
*                                                               02S0139 00057000
*/********************************************************************/ 00058000
*/*                                                                  */ 00059000
*/* SEGMENT-                                                         */ 00060000
*/*      CHAINTSB                                                    */ 00061000
*/*                                                                  */ 00062000
*/* FUNCTION-                                                        */ 00063000
*/*      CHAIN THE NEW TSB INTO THE TSB CHAIN                        */ 00064000
*/*                                                          @ZM45344*/ 00065000
*/********************************************************************/ 00066000
*                                                               02S0139 00067000
*       DO;                         /* START OF CHAINTSB     @ZM45344*/ 00068000
*         TSBPTR=R9;                /* R9 POINTS TO NEW TSB          */ 00069000
         LR    TSBPTR,R9                                        02S0140 00070000
*         LASTTSB=0;                /* INITIALIZE ADDRESS OF PREVIOUS   00071000
*                                      TSB                   @ZM45344*/ 00072000
         SLR   @05,@05                                          02S0141 00073000
         ST    @05,LASTTSB                                      02S0141 00074000
*         NEXTTSB=TCASTSB;          /* INITIALIZE ADDRESS OF NEXT TSB   00075000
*                                                            @ZM45344*/ 00076000
         L     @05,TCASTPTR                                     02S0142 00077000
         L     @05,TCASTSB(,@05)                                02S0142 00078000
         ST    @05,NEXTTSB                                      02S0142 00079000
*/*    DOWHILE(NEXTTSB^=0)                                           */ 00080000
*                                                               02S0143 00081000
*         DO WHILE(NEXTTSB^=0);     /* CHECK FOR APPLID PLACE IN THE    00082000
*                                      TSB CHAIN             @ZM45344*/ 00083000
         B     @DE00143                                         02S0143 00084000
@DL00143 DS    0H                                               02S0144 00085000
*           NEXTEXT=NEXTTSB->TSBEXTNT;/* GET ADDRESS OF TSBX @ZM45344*/ 00086000
         L     @05,NEXTTSB                                      02S0144 00087000
         L     @04,TSBEXTNT(,@05)                               02S0144 00088000
         ST    @04,NEXTEXT                                      02S0144 00089000
*/*      LEAVE ON(NEXTEXT->TSBXAIND>TSBXAIND)                        */ 00090000
*                                                               02S0145 00091000
*           IF(NEXTEXT->TSBXAIND>TSBXAIND) THEN                 02S0145 00092000
         L     @03,TSBEXTNT(,TSBPTR)                            02S0145 00093000
         LH    @02,TSBXAIND(,@04)                               02S0145 00094000
         CH    @02,TSBXAIND(,@03)                               02S0145 00095000
         BH    @RT00145                                         02S0145 00096000
*             GOTO #DC00006;        /* LEAVE, UNUSED APPLID INDEX       00097000
*                                      FOUND IN CHAIN        @ZM45344*/ 00098000
*           LASTTSB=NEXTTSB;        /* SAVE CURRENT TSB ADDRESS 02S0147 00099000
*                                                            @ZM45344*/ 00100000
         ST    @05,LASTTSB                                      02S0147 00101000
*           NEXTTSB=NEXTEXT->TSBXFWD;/* POINT TO NEXT TSB    @ZM45344*/ 00102000
         L     @05,TSBXFWD(,@04)                                02S0148 00103000
         ST    @05,NEXTTSB                                      02S0148 00104000
*         END;                      /* END                           */ 00105000
@DE00143 L     @05,NEXTTSB                                      02S0149 00106000
         LTR   @05,@05                                          02S0149 00107000
         BNZ   @DL00143                                         02S0149 00108000
*#DC00006:                                                      02S0150 00109000
*         ;                         /* END, CHAIN SEARCH     @ZM45344*/ 00110000
#DC00006 DS    0H                                               02S0151 00111000
*         IF LASTTSB=0 THEN         /* TSB GOES AT HEAD OF TSB CHAIN    00112000
*                                                            @ZM45344*/ 00113000
         L     @05,LASTTSB                                      02S0151 00114000
         LTR   @05,@05                                          02S0151 00115000
         BNZ   @RF00151                                         02S0151 00116000
*           TCASTSB=TSBPTR;         /* INSERT NEW TSB ADDRESS INTO      00117000
*                                      TCAS TABLE            @ZM45344*/ 00118000
         L     @05,TCASTPTR                                     02S0152 00119000
         ST    TSBPTR,TCASTSB(,@05)                             02S0152 00120000
*         ELSE                      /* SET PREVIOUS FORWARD POINTER     00121000
*                                                            @ZM45344*/ 00122000
*           LASTTSB->TSBEXTNT->TSBXFWD=TSBPTR;/* SET FORWARD POINTER    00123000
*                                      IN PREVIOUS TSB       @ZM45344*/ 00124000
         B     @RC00151                                         02S0153 00125000
@RF00151 L     @05,LASTTSB                                      02S0153 00126000
         L     @05,TSBEXTNT(,@05)                               02S0153 00127000
         ST    TSBPTR,TSBXFWD(,@05)                             02S0153 00128000
*         TSBXFWD=NEXTTSB;          /* SET FORWARD POINTER IN NEW TSB   00129000
*                                                            @ZM45344*/ 00130000
@RC00151 L     @05,NEXTTSB                                      02S0154 00131000
         L     @04,TSBEXTNT(,TSBPTR)                            02S0154 00132000
         ST    @05,TSBXFWD(,@04)                                02S0154 00133000
*         TSBXBCK=LASTTSB;          /* SET BACKWARD POINTER IN NEW      00134000
*                                      TSB                   @ZM45344*/ 00135000
         L     @03,LASTTSB                                      02S0155 00136000
         ST    @03,TSBXBCK(,@04)                                02S0155 00137000
*         IF NEXTTSB^=0 THEN        /* NEXT TSB EXITS        @ZM45344*/ 00138000
         LTR   @05,@05                                          02S0156 00139000
         BZ    @RF00156                                         02S0156 00140000
*           NEXTTSB->TSBEXTNT->TSBXBCK=TSBPTR;/* SET BACKWARD POINTER   00141000
*                                      IN NEXT TSB           @ZM45344*/ 00142000
         L     @05,TSBEXTNT(,@05)                               02S0157 00143000
         ST    TSBPTR,TSBXBCK(,@05)                             02S0157 00144000
*/*    LEAVE(MAIN)                                                   */ 00145000
*                                                               02S0158 00146000
*         GOTO #BCM0005;            /* EXIT, TSB CHAIN PROCESS  02S0158 00147000
*                                      COMPLETE              @ZM45344*/ 00148000
         B     #BCM0005                                         02S0158 00149000
*       END;                        /* END OF SEGMENT CHAINTSB  02S0159 00150000
*                                                            @ZM45344*/ 00151000
*/********************************************************************/ 00152000
*/* END OF SEGMENT                                                   */ 00153000
*/********************************************************************/ 00154000
*                                                               02S0160 00155000
*     IF R8=FCUIAA THEN             /* ASCB ADDRESS LIST REQUEST        00156000
*                                                            @ZM45344*/ 00157000
@RF00138 C     R8,@CF00478                                      01S0160 00158000
         BNE   @RF00160                                         01S0160 00159000
         EJECT                                                          00160000
*                                                               02S0161 00161000
*/********************************************************************/ 00162000
*/*                                                                  */ 00163000
*/* SEGMENT-                                                         */ 00164000
*/*      ASCBLIST                                                    */ 00165000
*/*                                                                  */ 00166000
*/* FUNCTION-                                                        */ 00167000
*/*      STEP THROUGH THE TSB CHAIN, PICK UP THE ASCB ADDRESS AND    */ 00168000
*/*      STORE IT IN THE STORAGE PROVIDED BY THE CALLER              */ 00169000
*/*                                                          @ZM45344*/ 00170000
*/********************************************************************/ 00171000
*                                                               02S0161 00172000
*       DO;                         /* START OF ASCBLIST     @ZM45344*/ 00173000
*         TSBPTR=TCASTSB;           /* GET TSB CHAIN                 */ 00174000
         L     @05,TCASTPTR                                     02S0162 00175000
         L     TSBPTR,TCASTSB(,@05)                             02S0162 00176000
*         DO WHILE(TSBPTR^=0);      /* DO ENTIRE CHAIN               */ 00177000
         B     @DE00163                                         02S0163 00178000
@DL00163 DS    0H                                               02S0164 00179000
*           R9->TMWA3=TSBASCB;      /* GET ASCB ADDR                 */ 00180000
         L     @05,TSBASCB-1(,TSBPTR)                           02S0164 00181000
         LA    @05,0(,@05)                                      02S0164 00182000
         ST    @05,TMWA3(,R9)                                   02S0164 00183000
*           TSBPTR=TSBXFWD;         /* TO NEXT TSB                   */ 00184000
         L     @05,TSBEXTNT(,TSBPTR)                            02S0165 00185000
         L     @05,TSBXFWD(,@05)                                02S0165 00186000
         LR    TSBPTR,@05                                       02S0165 00187000
*           R9=R9+4;                /* POINTS TO NEXT SLOT           */ 00188000
         AL    R9,@CF00044                                      02S0166 00189000
*         END;                      /* DONE                          */ 00190000
@DE00163 SLR   @05,@05                                          02S0167 00191000
         CR    TSBPTR,@05                                       02S0167 00192000
         BNE   @DL00163                                         02S0167 00193000
*         R9->TMWA3=0;              /* ZERO LAST ENTRY               */ 00194000
         ST    @05,TMWA3(,R9)                                   02S0168 00195000
*       END;                        /* END OF SEGMENT ASCBLIST  02S0169 00196000
*                                                            @ZM45344*/ 00197000
*/********************************************************************/ 00198000
*/* END OF SEGMENT                                                   */ 00199000
*/********************************************************************/ 00200000
*                                                               02S0170 00201000
*   END;                            /* END(MAIN)                     */ 00202000
@RF00160 DS    0H                                               01S0171 00203000
*#BCM0005:                                                      01S0171 00204000
*   ;                               /* END OF MAIN SEGMENT   @ZM45344*/ 00205000
#BCM0005 DS    0H                                               01S0172 00206000
*                                                               01S0172 00207000
*/********************************************************************/ 00208000
*/* THIS CODE IS ENTERED FROM ANY LEAVE(MAIN) MACRO INSTRUCTION.     */ 00209000
*/********************************************************************/ 00210000
*                                                               01S0172 00211000
*   GEN CODE REFS(PSALITA);                                     01S0172 00212000
*                                   /* RELEASE LOCAL AND CMS LOCKS   */ 00213000
         SETLOCK RELEASE,TYPE=CMS,REGS=USE,                            C00214000
               RELATED=('CHAIN TSB')                                    00215000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                          C00216000
               RELATED=('CHAIN TSB')                                    00217000
*   TWAUEIFC(3)=0;                  /* CLEAR FOOTPRINT FOR EXIT      */ 00218000
         MVI   TWAUEIFC+16(TWAPTR),X'00'                        01S0173 00219000
*   RETURN CODE(0);                 /* RETURN TO CALLER      @ZM45344*/ 00220000
         SLR   @15,@15                                          01S0174 00221000
         L     @13,4(,@13)                                      01S0174 00222000
         L     @14,12(,@13)                                     01S0174 00223000
         LM    @00,@12,20(@13)                                  01S0174 00224000
         BR    @14                                              01S0174 00225000
*   END IKTCAS33                    /* END OF MODULE                 */ 00226000
*                                                               01S0175 00227000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00228000
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */ 00229000
*/*%INCLUDE SYSUT5  (IKTCAS33)                                       */ 00230000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00231000
*/*%INCLUDE SYSLIB  (IKTTCAST)                                       */ 00232000
*/*%INCLUDE SYSLIB  (IKTWESTD)                                       */ 00233000
*/*%INCLUDE SYSLIB  (IKJTSB  )                                       */ 00234000
*/*%INCLUDE SYSLIB  (IKTTSBX )                                       */ 00235000
*/*%INCLUDE SYSLIB  (IKTCASWA)                                       */ 00236000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 00237000
*/*%INCLUDE SYSLIB  (IFGRPLVS)                                       */ 00238000
*/*%INCLUDE SYSLIB  (ISTRPLEX)                                       */ 00239000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 00240000
*/*%INCLUDE SYSUT5  (CHAINTSB)                                       */ 00241000
*/*%INCLUDE SYSUT5  (ASCBLIST)                                       */ 00242000
*                                                               01S0175 00243000
*       ;                                                       01S0175 00244000
@DATA    DS    0H                                                       00245000
         DS    0F                                                       00246000
@SA00001 DS    18F                                                      00247000
         DS    0F                                                       00248000
@CF00044 DC    F'4'                                                     00249000
@CF00476 DC    XL4'31'                                                  00250000
@CF00478 DC    XL4'32'                                                  00251000
         DS    0D                                                       00252000
TCASTPTR DS    A                                                        00253000
LASTTSB  DS    A                                                        00254000
NEXTTSB  DS    A                                                        00255000
NEXTEXT  DS    A                                                        00256000
PATCH    DC    13F'0'                                                   00257000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00258000
@01      EQU   01                                                       00259000
@02      EQU   02                                                       00260000
@03      EQU   03                                                       00261000
@04      EQU   04                                                       00262000
@05      EQU   05                                                       00263000
@06      EQU   06                                                       00264000
@07      EQU   07                                                       00265000
@08      EQU   08                                                       00266000
@09      EQU   09                                                       00267000
@10      EQU   10                                                       00268000
@11      EQU   11                                                       00269000
@12      EQU   12                                                       00270000
@13      EQU   13                                                       00271000
@14      EQU   14                                                       00272000
@15      EQU   15                                                       00273000
TSBPTR   EQU   @06                                                      00274000
TWAPTR   EQU   @11                                                      00275000
R0       EQU   @00                                                      00276000
R1       EQU   @01                                                      00277000
RPLREG   EQU   @07                                                      00278000
R8       EQU   @08                                                      00279000
R9       EQU   @09                                                      00280000
WEPTR    EQU   @10                                                      00281000
R13      EQU   @13                                                      00282000
R14      EQU   @14                                                      00283000
R15      EQU   @15                                                      00284000
PSA      EQU   0                                                        00285000
FLCRNPSW EQU   PSA                                                      00286000
FLCROPSW EQU   PSA+8                                                    00287000
FLCICCW2 EQU   PSA+16                                                   00288000
PSAEEPSW EQU   PSA+132                                                  00289000
PSAESPSW EQU   PSA+136                                                  00290000
FLCSVILC EQU   PSAESPSW+1                                               00291000
PSAEPPSW EQU   PSA+140                                                  00292000
FLCPIILC EQU   PSAEPPSW+1                                               00293000
FLCPICOD EQU   PSAEPPSW+2                                               00294000
PSAPICOD EQU   FLCPICOD+1                                               00295000
FLCTEA   EQU   PSAEPPSW+4                                               00296000
FLCPER   EQU   PSA+152                                                  00297000
FLCMCLA  EQU   PSA+168                                                  00298000
FLCIOEL  EQU   FLCMCLA+4                                                00299000
FLCIOA   EQU   FLCMCLA+16                                               00300000
FLCFSA   EQU   FLCMCLA+80                                               00301000
PSASUPER EQU   PSA+552                                                  00302000
PSASUP1  EQU   PSASUPER                                                 00303000
PSASUP2  EQU   PSASUPER+1                                               00304000
PSASUP3  EQU   PSASUPER+2                                               00305000
PSASUP4  EQU   PSASUPER+3                                               00306000
PSACLHT  EQU   PSA+640                                                  00307000
PSALKSA  EQU   PSA+696                                                  00308000
PSAHLHI  EQU   PSA+760                                                  00309000
PSALITA  EQU   PSA+764                                                  00310000
PSADSSFL EQU   PSA+836                                                  00311000
PSADSSF1 EQU   PSADSSFL                                                 00312000
PSADSSF3 EQU   PSADSSFL+2                                               00313000
PSADSSF4 EQU   PSADSSFL+3                                               00314000
PSARSVT  EQU   PSA+896                                                  00315000
TCAST    EQU   0                                                        00316000
TCASUSER EQU   TCAST+4                                                  00317000
TCASTSB  EQU   TCAST+68                                                 00318000
TCASFLG1 EQU   TCAST+88                                                 00319000
WESTD    EQU   0                                                        00320000
WECODE1  EQU   WESTD                                                    00321000
WECODE1F EQU   WECODE1+1                                                00322000
WECODE2  EQU   WESTD+2                                                  00323000
WECODE2F EQU   WECODE2+1                                                00324000
WERC     EQU   WESTD+8                                                  00325000
WEVNIB   EQU   WESTD+16                                                 00326000
WEVRPL   EQU   WESTD+20                                                 00327000
WETERM   EQU   WESTD+28                                                 00328000
WETMFLG  EQU   WESTD+32                                                 00329000
TSB      EQU   0                                                        00330000
TSBASCBA EQU   TSB                                                      00331000
TSBSTAT  EQU   TSBASCBA                                                 00332000
TSBASCB  EQU   TSBASCBA+1                                               00333000
TSBFLG1  EQU   TSB+4                                                    00334000
TSBFLG2  EQU   TSB+16                                                   00335000
TSBFLG3  EQU   TSB+24                                                   00336000
TSBFLG5  EQU   TSB+25                                                   00337000
TSBTERMC EQU   TSB+26                                                   00338000
TSBTERM1 EQU   TSBTERMC                                                 00339000
TSBTERM2 EQU   TSBTERMC+1                                               00340000
TSBSTCC  EQU   TSB+34                                                   00341000
TSBFLG4  EQU   TSB+41                                                   00342000
TSBRCB   EQU   TSB+64                                                   00343000
TSBLINKA EQU   TSBRCB+4                                                 00344000
TSBTPOST EQU   TSB+72                                                   00345000
TSBTPFLG EQU   TSBTPOST                                                 00346000
TSBMINL  EQU   TSB+84                                                   00347000
TSBEXTNT EQU   TSB+96                                                   00348000
TSBX     EQU   0                                                        00349000
TSBXFWD  EQU   TSBX                                                     00350000
TSBXBCK  EQU   TSBX+4                                                   00351000
TSBXFLG1 EQU   TSBX+32                                                  00352000
TSBXTIM  EQU   TSBX+40                                                  00353000
TSBXTOM  EQU   TSBX+44                                                  00354000
TSBXAIND EQU   TSBX+70                                                  00355000
TSBXTERM EQU   TSBX+72                                                  00356000
TWAR     EQU   0                                                        00357000
TWATCAST EQU   TWAR+20                                                  00358000
TWAMFL   EQU   TWAR+80                                                  00359000
TWAVFL   EQU   TWAR+81                                                  00360000
TWAUFL   EQU   TWAR+82                                                  00361000
TWACFL   EQU   TWAR+83                                                  00362000
TWAM     EQU   TWAR+84                                                  00363000
TWAME    EQU   TWAM+68                                                  00364000
TWAMEI   EQU   TWAME                                                    00365000
TWAV     EQU   TWAR+184                                                 00366000
TWAVE    EQU   TWAV+68                                                  00367000
TWAVEI   EQU   TWAVE                                                    00368000
TWAVI    EQU   TWAR+284                                                 00369000
TWAU     EQU   TWAR+300                                                 00370000
TWAUE    EQU   TWAU+68                                                  00371000
TWAUEI   EQU   TWAUE                                                    00372000
TWAUEIFC EQU   TWAUEI                                                   00373000
TWAUERA  EQU   TWAUEI+1                                                 00374000
TWAUERRS EQU   TWAUE+4                                                  00375000
TWAUI    EQU   TWAR+400                                                 00376000
TWAC     EQU   TWAR+408                                                 00377000
TWACE    EQU   TWAC+68                                                  00378000
TWACEI   EQU   TWACE                                                    00379000
TWACI    EQU   TWAR+508                                                 00380000
IFGRPL   EQU   0                                                        00381000
RPLCOMN  EQU   IFGRPL                                                   00382000
RPLIDWD  EQU   RPLCOMN                                                  00383000
RPLLEN   EQU   RPLIDWD+3                                                00384000
RPLECB   EQU   RPLCOMN+8                                                00385000
RPLFDBWD EQU   RPLCOMN+12                                               00386000
RPLFDBK  EQU   RPLFDBWD+1                                               00387000
RPLRTNCD EQU   RPLFDBK                                                  00388000
RPLCNDCD EQU   RPLFDBK+1                                                00389000
RPLCMPON EQU   RPLCNDCD                                                 00390000
RPLFDB2  EQU   RPLCMPON                                                 00391000
RPLERRCD EQU   RPLCNDCD+1                                               00392000
RPLFDB3  EQU   RPLERRCD                                                 00393000
RPLKEYLE EQU   RPLCOMN+16                                               00394000
RPLARG   EQU   RPLCOMN+36                                               00395000
RPLOPTCD EQU   RPLCOMN+40                                               00396000
RPLOPT1  EQU   RPLOPTCD                                                 00397000
RPLECBSW EQU   RPLOPT1                                                  00398000
RPLOPT2  EQU   RPLOPTCD+1                                               00399000
RPLADR   EQU   RPLOPT2                                                  00400000
RPLOPT3  EQU   RPLOPTCD+2                                               00401000
RPLOPT4  EQU   RPLOPTCD+3                                               00402000
RPLNXTRP EQU   RPLCOMN+44                                               00403000
RPLOPTC2 EQU   RPLCOMN+56                                               00404000
RPLOPT5  EQU   RPLOPTC2                                                 00405000
RPLWRTYP EQU   RPLOPT5                                                  00406000
RPLOPT6  EQU   RPLOPTC2+1                                               00407000
RPLUNTYP EQU   RPLOPT6                                                  00408000
RPLOPT7  EQU   RPLOPTC2+2                                               00409000
RPLCNOPT EQU   RPLOPT7                                                  00410000
RPLOPT8  EQU   RPLOPTC2+3                                               00411000
RPLRBAR  EQU   RPLCOMN+60                                               00412000
RPLAIXID EQU   RPLRBAR+2                                                00413000
RPLEXTDS EQU   RPLCOMN+68                                               00414000
RPLEXTD1 EQU   RPLEXTDS                                                 00415000
RPLVTEXT EQU   IFGRPL+76                                                00416000
RPLFDBK2 EQU   RPLVTEXT+12                                              00417000
RPLSSNSI EQU   RPLFDBK2                                                 00418000
RPLDSB   EQU   RPLSSNSI                                                 00419000
RPLDSB1  EQU   RPLDSB                                                   00420000
RPLSSEI  EQU   RPLDSB1                                                  00421000
RPLDSB2  EQU   RPLDSB+1                                                 00422000
RPLUSNSI EQU   RPLFDBK2+2                                               00423000
RPLOPTC3 EQU   RPLVTEXT+20                                              00424000
RPLOPT9  EQU   RPLOPTC3                                                 00425000
RPLOPT10 EQU   RPLOPTC3+1                                               00426000
RPLOPT11 EQU   RPLOPTC3+2                                               00427000
RPLOPT12 EQU   RPLOPTC3+3                                               00428000
RPLOSENS EQU   RPLVTEXT+24                                              00429000
RPLSSNSO EQU   RPLOSENS                                                 00430000
RPLSSEO  EQU   RPLSSNSO                                                 00431000
RPLOF16  EQU   0                                                        00432000
RPLRH3   EQU   RPLOF16                                                  00433000
RPLSRTYP EQU   RPLOF16+1                                                00434000
RPLSTYPE EQU   RPLSRTYP                                                 00435000
RPLRTYPE EQU   RPLSRTYP                                                 00436000
RPLCHN   EQU   RPLOF16+2                                                00437000
RPLVTFL1 EQU   RPLOF16+3                                                00438000
RPLVTFL2 EQU   RPLOF16+4                                                00439000
RPLPOSTV EQU   RPLVTFL2                                                 00440000
RPLRESP  EQU   RPLVTFL2                                                 00441000
RPLCNTRL EQU   RPLOF16+5                                                00442000
RPLCNTDF EQU   RPLCNTRL                                                 00443000
RPLCNTDC EQU   RPLCNTRL+1                                               00444000
RPLCNTSC EQU   RPLCNTRL+2                                               00445000
RPLOF56  EQU   0                                                        00446000
RPLO5    EQU   RPLOF56                                                  00447000
RPLOF60  EQU   0                                                        00448000
RPLOBSQ  EQU   RPLOF60+4                                                00449000
RPLIBSQ  EQU   RPLOF60+5                                                00450000
ISTPROCD EQU   0                                                        00451000
PROPROC  EQU   ISTPROCD                                                 00452000
PROPROC1 EQU   PROPROC                                                  00453000
PROPROC2 EQU   PROPROC+1                                                00454000
PROPROC3 EQU   PROPROC+2                                                00455000
PROPROC4 EQU   PROPROC+3                                                00456000
PROPROCS EQU   0                                                        00457000
PROSETMS EQU   PROPROCS+1                                               00458000
PROSETM2 EQU   PROSETMS                                                 00459000
PROSETM3 EQU   PROSETMS+1                                               00460000
PROSETM4 EQU   PROSETMS+2                                               00461000
ISTDEVCH EQU   0                                                        00462000
DEVSHCH  EQU   ISTDEVCH                                                 00463000
DEVCHAR  EQU   DEVSHCH                                                  00464000
DEVTCODE EQU   ISTDEVCH+1                                               00465000
DEVFLAGS EQU   ISTDEVCH+3                                               00466000
DEVFCCTL EQU   DEVFLAGS                                                 00467000
DEVCHAR3 EQU   DEVFLAGS                                                 00468000
DEVMODE  EQU   ISTDEVCH+5                                               00469000
ISTNIB   EQU   0                                                        00470000
NIBFLGS  EQU   ISTNIB+40                                                00471000
NIBFLG1  EQU   NIBFLGS                                                  00472000
TMWA3    EQU   0                                                        00473000
ISTRPL   EQU   0                                                        00474000
PSARSVTE EQU   PSARSVT                                                  00475000
FLC      EQU   PSA                                                      00476000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00477000
PSARSAV  EQU   PSARSVTE+60                                              00478000
PSARSTK  EQU   PSARSVTE+56                                              00479000
PSAESAV3 EQU   PSARSVTE+52                                              00480000
PSAESTK3 EQU   PSARSVTE+48                                              00481000
PSAESAV2 EQU   PSARSVTE+44                                              00482000
PSAESTK2 EQU   PSARSVTE+40                                              00483000
PSAESAV1 EQU   PSARSVTE+36                                              00484000
PSAESTK1 EQU   PSARSVTE+32                                              00485000
PSAPSAV  EQU   PSARSVTE+28                                              00486000
PSAPSTK  EQU   PSARSVTE+24                                              00487000
PSAMSAV  EQU   PSARSVTE+20                                              00488000
PSAMSTK  EQU   PSARSVTE+16                                              00489000
PSASSAV  EQU   PSARSVTE+12                                              00490000
PSASSTK  EQU   PSARSVTE+8                                               00491000
PSANSTK  EQU   PSARSVTE+4                                               00492000
PSACSTK  EQU   PSARSVTE                                                 00493000
NIBRESV  EQU   ISTNIB+60                                                00494000
NIBNDAR  EQU   ISTNIB+56                                                00495000
NIBLMODE EQU   ISTNIB+48                                                00496000
NIBEXLST EQU   ISTNIB+44                                                00497000
NIBLIMIT EQU   ISTNIB+42                                                00498000
@NM00082 EQU   ISTNIB+41                                                00499000
@NM00081 EQU   NIBFLG1                                                  00500000
NIBTREQ  EQU   NIBFLG1                                                  00501000
NIBTSEL  EQU   NIBFLG1                                                  00502000
NIBNACLQ EQU   NIBFLG1                                                  00503000
NIBSHLTP EQU   NIBFLG1                                                  00504000
NIBSDAPP EQU   NIBFLG1                                                  00505000
NIBCON   EQU   NIBFLG1                                                  00506000
NIBLAST  EQU   NIBFLG1                                                  00507000
NIBPROCD EQU   ISTNIB+36                                                00508000
NIBDEVCH EQU   ISTNIB+28                                                00509000
NIBMODE  EQU   ISTNIB+20                                                00510000
NIBSYM   EQU   ISTNIB+12                                                00511000
NIBUSER  EQU   ISTNIB+8                                                 00512000
NIBCID   EQU   ISTNIB+4                                                 00513000
NIBLEN   EQU   ISTNIB+3                                                 00514000
NIBCONDN EQU   ISTNIB+2                                                 00515000
NIBRSV01 EQU   ISTNIB+1                                                 00516000
NIBID    EQU   ISTNIB                                                   00517000
DEVRSV01 EQU   ISTDEVCH+7                                               00518000
DEVAUXTP EQU   ISTDEVCH+6                                               00519000
DEVADVFE EQU   DEVMODE                                                  00520000
@NM00080 EQU   DEVMODE                                                  00521000
DEVBASIC EQU   DEVMODE                                                  00522000
DEVREC   EQU   DEVMODE                                                  00523000
DEVPHYSA EQU   ISTDEVCH+4                                               00524000
DEVCSLPN EQU   DEVCHAR3                                                 00525000
DEVCSTCL EQU   DEVCHAR3                                                 00526000
DEVCCHEK EQU   DEVCHAR3                                                 00527000
DEVCATTN EQU   DEVCHAR3                                                 00528000
DEVCSWL  EQU   DEVFCCTL                                                 00529000
DEVCRVB  EQU   DEVFCCTL                                                 00530000
DEVCSSL  EQU   DEVFCCTL                                                 00531000
DEVCBSC  EQU   DEVFCCTL                                                 00532000
DEVMCODE EQU   ISTDEVCH+2                                               00533000
DEVCHAR2 EQU   DEVTCODE                                                 00534000
DEVSPOLL EQU   DEVCHAR                                                  00535000
DEVCCTL  EQU   DEVCHAR                                                  00536000
DEVNNSPT EQU   DEVCHAR                                                  00537000
DEVSPS   EQU   DEVCHAR                                                  00538000
DEVSUBND EQU   DEVCHAR                                                  00539000
DEVCONVR EQU   DEVCHAR                                                  00540000
DEVOTPUT EQU   DEVCHAR                                                  00541000
DEVINPUT EQU   DEVCHAR                                                  00542000
PROSRDEF EQU   PROSETM4                                                 00543000
PRORSV47 EQU   PROSETM4                                                 00544000
PROSCON  EQU   PROSETM4                                                 00545000
PRORSV46 EQU   PROSETM3                                                 00546000
PROSMONT EQU   PROSETM3                                                 00547000
PRORSV45 EQU   PROSETM3                                                 00548000
PROSNTO  EQU   PROSETM3                                                 00549000
PRORSV44 EQU   PROSETM3                                                 00550000
PRORSV43 EQU   PROSETM2                                                 00551000
PROSNTFL EQU   PROSETM2                                                 00552000
PRORSV42 EQU   PROSETM2                                                 00553000
PRORSV41 EQU   PROPROCS                                                 00554000
PROMODC  EQU   PROPROC4                                                 00555000
PROMODT  EQU   PROPROC4                                                 00556000
PROMODM  EQU   PROPROC4                                                 00557000
PROMODB  EQU   PROPROC4                                                 00558000
PRORSV14 EQU   PROPROC4                                                 00559000
PRORSV13 EQU   PROPROC4                                                 00560000
PRORSV01 EQU   PROPROC4                                                 00561000
PROEIB   EQU   PROPROC4                                                 00562000
PROMONT3 EQU   PROPROC3                                                 00563000
PROMONT2 EQU   PROPROC3                                                 00564000
PROMONIT EQU   PROPROC3                                                 00565000
PROSUBLK EQU   PROPROC3                                                 00566000
PRONTO   EQU   PROPROC3                                                 00567000
PROLGIN  EQU   PROPROC3                                                 00568000
PROERPI  EQU   PROPROC3                                                 00569000
PROCPUID EQU   PROPROC3                                                 00570000
PROCFTX  EQU   PROPROC2                                                 00571000
PROEMLC  EQU   PROPROC2                                                 00572000
PRONTFL  EQU   PROPROC2                                                 00573000
PROFIFOR EQU   PROPROC2                                                 00574000
PROSYSR  EQU   PROPROC2                                                 00575000
PROLGOT  EQU   PROPROC2                                                 00576000
PROERPO  EQU   PROPROC2                                                 00577000
PRONEGBD EQU   PROPROC2                                                 00578000
PRORPLC  EQU   PROPROC1                                                 00579000
PROCS    EQU   PROPROC1                                                 00580000
PROCA    EQU   PROPROC1                                                 00581000
PRORESPX EQU   PROPROC1                                                 00582000
PRODFASY EQU   PROPROC1                                                 00583000
PROXPOPT EQU   PROPROC1                                                 00584000
PROTRUNC EQU   PROPROC1                                                 00585000
PROASYIP EQU   PROPROC1                                                 00586000
RPLSEQNO EQU   RPLOF60+6                                                00587000
@NM00079 EQU   RPLIBSQ                                                  00588000
RPLIINV  EQU   RPLIBSQ                                                  00589000
RPLINEG  EQU   RPLIBSQ                                                  00590000
RPLIPOS  EQU   RPLIBSQ                                                  00591000
RPLIIGN  EQU   RPLIBSQ                                                  00592000
RPLIRSET EQU   RPLIBSQ                                                  00593000
RPLITST  EQU   RPLIBSQ                                                  00594000
RPLISET  EQU   RPLIBSQ                                                  00595000
@NM00078 EQU   RPLOBSQ                                                  00596000
RPLOINV  EQU   RPLOBSQ                                                  00597000
RPLONEG  EQU   RPLOBSQ                                                  00598000
RPLOPOS  EQU   RPLOBSQ                                                  00599000
RPLOIGN  EQU   RPLOBSQ                                                  00600000
RPLORSET EQU   RPLOBSQ                                                  00601000
RPLOTST  EQU   RPLOBSQ                                                  00602000
RPLOSET  EQU   RPLOBSQ                                                  00603000
RPLIBSQV EQU   RPLOF60+2                                                00604000
RPLOBSQV EQU   RPLOF60                                                  00605000
@NM00077 EQU   RPLO5                                                    00606000
RPLTNFY  EQU   RPLO5                                                    00607000
@NM00076 EQU   RPLO5                                                    00608000
@NM00075 EQU   RPLCNTSC                                                 00609000
RPLRSHUT EQU   RPLCNTSC                                                 00610000
RPLRQR   EQU   RPLCNTSC                                                 00611000
RPLSHUTC EQU   RPLCNTSC                                                 00612000
RPLSHUTD EQU   RPLCNTSC                                                 00613000
RPLSTSN  EQU   RPLCNTSC                                                 00614000
RPLCLEAR EQU   RPLCNTSC                                                 00615000
RPLSDT   EQU   RPLCNTSC                                                 00616000
RPLBIS   EQU   RPLCNTDC                                                 00617000
RPLSBI   EQU   RPLCNTDC                                                 00618000
RPLTUNBD EQU   RPLCNTDC                                                 00619000
RPLTBIND EQU   RPLCNTDC                                                 00620000
RPLSIGNL EQU   RPLCNTDC                                                 00621000
RPLLUS   EQU   RPLCNTDC                                                 00622000
RPLRTR   EQU   RPLCNTDC                                                 00623000
RPLBID   EQU   RPLCNTDC                                                 00624000
@NM00074 EQU   RPLCNTDF                                                 00625000
RPLQI    EQU   RPLCNTDF                                                 00626000
RPLRELQ  EQU   RPLCNTDF                                                 00627000
RPLCHASE EQU   RPLCNTDF                                                 00628000
RPLQEC   EQU   RPLCNTDF                                                 00629000
RPLQC    EQU   RPLCNTDF                                                 00630000
RPLCNCEL EQU   RPLCNTDF                                                 00631000
RPLDATA  EQU   RPLCNTDF                                                 00632000
RPLRRN   EQU   RPLRESP                                                  00633000
RPLNFME  EQU   RPLRESP                                                  00634000
RPLEX    EQU   RPLRESP                                                  00635000
RPLQRI   EQU   RPLRESP                                                  00636000
@NM00073 EQU   RPLPOSTV                                                 00637000
RPLSCHED EQU   RPLPOSTV                                                 00638000
@NM00072 EQU   RPLVTFL1                                                 00639000
RPLTLGAC EQU   RPLVTFL1                                                 00640000
RPLTNDSP EQU   RPLVTFL1                                                 00641000
RPLAUTUS EQU   RPLVTFL1                                                 00642000
RPLVTUSE EQU   RPLVTFL1                                                 00643000
@NM00071 EQU   RPLVTFL1                                                 00644000
@NM00070 EQU   RPLCHN                                                   00645000
RPLONLY  EQU   RPLCHN                                                   00646000
RPLLAST  EQU   RPLCHN                                                   00647000
RPLMIDLE EQU   RPLCHN                                                   00648000
RPLFIRST EQU   RPLCHN                                                   00649000
@NM00069 EQU   RPLRTYPE                                                 00650000
RPLDFASY EQU   RPLRTYPE                                                 00651000
RPLNFSYN EQU   RPLRTYPE                                                 00652000
RPLRRESP EQU   RPLRTYPE                                                 00653000
@NM00068 EQU   RPLSTYPE                                                 00654000
RPLSRESP EQU   RPLSTYPE                                                 00655000
@NM00067 EQU   RPLRH3                                                   00656000
RPLCSI   EQU   RPLRH3                                                   00657000
RPLCHREQ EQU   RPLRH3                                                   00658000
RPLCMD   EQU   RPLRH3                                                   00659000
RPLEB    EQU   RPLRH3                                                   00660000
RPLBB    EQU   RPLRH3                                                   00661000
RPLSIGDA EQU   RPLVTEXT+32                                              00662000
RPLSAV13 EQU   RPLVTEXT+28                                              00663000
RPLUSNSO EQU   RPLOSENS+2                                               00664000
RPLSSMO  EQU   RPLSSNSO+1                                               00665000
@NM00066 EQU   RPLSSEO                                                  00666000
RPLRRO   EQU   RPLSSEO                                                  00667000
RPLFIO   EQU   RPLSSEO                                                  00668000
RPLSTATO EQU   RPLSSEO                                                  00669000
RPLCPMO  EQU   RPLSSEO                                                  00670000
@NM00065 EQU   RPLSSEO                                                  00671000
RPLFMHDR EQU   RPLOPT12                                                 00672000
@NM00064 EQU   RPLOPT12                                                 00673000
@NM00063 EQU   RPLOPT12                                                 00674000
@NM00062 EQU   RPLOPT12                                                 00675000
RPLNIBTK EQU   RPLOPT12                                                 00676000
RPLTRUNC EQU   RPLOPT12                                                 00677000
RPLKEEP  EQU   RPLOPT12                                                 00678000
@NM00061 EQU   RPLOPT12                                                 00679000
RPLRSVE8 EQU   RPLOPT11                                                 00680000
RPLRSVE7 EQU   RPLOPT11                                                 00681000
RPLRSVE6 EQU   RPLOPT11                                                 00682000
RPLRSVE5 EQU   RPLOPT11                                                 00683000
RPLRSVE4 EQU   RPLOPT11                                                 00684000
RPLSTOP  EQU   RPLOPT11                                                 00685000
RPLSTART EQU   RPLOPT11                                                 00686000
RPLQUIES EQU   RPLOPT11                                                 00687000
RPLRSVI6 EQU   RPLOPT10                                                 00688000
RPLRSVI5 EQU   RPLOPT10                                                 00689000
RPLRSVI4 EQU   RPLOPT10                                                 00690000
RPLRSVI3 EQU   RPLOPT10                                                 00691000
RPLTSKY  EQU   RPLOPT10                                                 00692000
RPLSPARM EQU   RPLOPT10                                                 00693000
RPLDSPLY EQU   RPLOPT10                                                 00694000
RPLBSCID EQU   RPLOPT10                                                 00695000
RPLTOPL  EQU   RPLOPT9                                                  00696000
RPLCIDE  EQU   RPLOPT9                                                  00697000
RPLRNNM  EQU   RPLOPT9                                                  00698000
RPLAPPST EQU   RPLOPT9                                                  00699000
RPLCOUNT EQU   RPLOPT9                                                  00700000
RPLTERMS EQU   RPLOPT9                                                  00701000
RPLDEVCH EQU   RPLOPT9                                                  00702000
RPLLOGON EQU   RPLOPT9                                                  00703000
RPLUSFLD EQU   RPLVTEXT+16                                              00704000
RPLESR2  EQU   RPLUSNSI+1                                               00705000
RPLESR1  EQU   RPLUSNSI                                                 00706000
RPLSSMI  EQU   RPLDSB2                                                  00707000
@NM00060 EQU   RPLSSEI                                                  00708000
RPLRRI   EQU   RPLSSEI                                                  00709000
RPLFII   EQU   RPLSSEI                                                  00710000
RPLSTATI EQU   RPLSSEI                                                  00711000
RPLCPMI  EQU   RPLSSEI                                                  00712000
RPLPATHI EQU   RPLSSEI                                                  00713000
RPLARCLN EQU   RPLVTEXT+8                                               00714000
RPLAARLN EQU   RPLVTEXT+4                                               00715000
RPLAAREA EQU   RPLVTEXT                                                 00716000
RPLERMSA EQU   RPLCOMN+72                                               00717000
RPLEMLEN EQU   RPLCOMN+70                                               00718000
RPLACTIV EQU   RPLCOMN+69                                               00719000
RPLBRANC EQU   RPLEXTD1                                                 00720000
RPLNIB   EQU   RPLEXTD1                                                 00721000
RPLTCRYP EQU   RPLEXTD1                                                 00722000
@NM00059 EQU   RPLEXTD1                                                 00723000
RPLEXIT  EQU   RPLEXTD1                                                 00724000
RPLNEXIT EQU   RPLEXTD1                                                 00725000
RPLEXSCH EQU   RPLEXTD1                                                 00726000
RPLDDDD  EQU   RPLRBAR+4                                                00727000
@NM00058 EQU   RPLRBAR+3                                                00728000
@NM00057 EQU   RPLAIXID                                                 00729000
RPLAXPKP EQU   RPLAIXID                                                 00730000
RPLAIXPC EQU   RPLRBAR                                                  00731000
RPLRSV88 EQU   RPLOPT8                                                  00732000
RPLUNCON EQU   RPLOPT8                                                  00733000
RPLACTV  EQU   RPLOPT8                                                  00734000
RPLSESS  EQU   RPLOPT8                                                  00735000
RPLPEND  EQU   RPLOPT8                                                  00736000
RPLODPRM EQU   RPLOPT8                                                  00737000
RPLODACP EQU   RPLOPT8                                                  00738000
RPLODACQ EQU   RPLOPT8                                                  00739000
RPLRSV78 EQU   RPLOPT7                                                  00740000
RPLTCRNO EQU   RPLOPT7                                                  00741000
RPLRLSOP EQU   RPLOPT7                                                  00742000
RPLTPOST EQU   RPLOPT7                                                  00743000
RPLQOPT  EQU   RPLOPT7                                                  00744000
RPLCNIMM EQU   RPLCNOPT                                                 00745000
RPLCNANY EQU   RPLCNOPT                                                 00746000
RPLCNALL EQU   RPLCNOPT                                                 00747000
RPLRSV68 EQU   RPLOPT6                                                  00748000
RPLRSV67 EQU   RPLOPT6                                                  00749000
RPLLOCK  EQU   RPLOPT6                                                  00750000
RPLNCOND EQU   RPLOPT6                                                  00751000
RPLCOND  EQU   RPLOPT6                                                  00752000
RPLEOT   EQU   RPLUNTYP                                                 00753000
RPLEOM   EQU   RPLUNTYP                                                 00754000
RPLEOB   EQU   RPLUNTYP                                                 00755000
RPLWROPT EQU   RPLOPT5                                                  00756000
RPLNODE  EQU   RPLOPT5                                                  00757000
RPLERACE EQU   RPLWRTYP                                                 00758000
RPLEAU   EQU   RPLWRTYP                                                 00759000
RPLNERAS EQU   RPLWRTYP                                                 00760000
RPLPSOPT EQU   RPLOPT5                                                  00761000
@NM00056 EQU   RPLOPT5                                                  00762000
RPLDLGIN EQU   RPLOPT5                                                  00763000
RPLBUFL  EQU   RPLCOMN+52                                               00764000
RPLRLEN  EQU   RPLCOMN+48                                               00765000
RPLCHAIN EQU   RPLNXTRP                                                 00766000
@NM00055 EQU   RPLOPT4                                                  00767000
RPLMKFRM EQU   RPLOPT4                                                  00768000
RPLENDTR EQU   RPLOPT4                                                  00769000
RPLALIGN EQU   RPLOPT3                                                  00770000
RPLFMT   EQU   RPLOPT3                                                  00771000
RPLFLD   EQU   RPLOPT3                                                  00772000
RPLVFY   EQU   RPLOPT3                                                  00773000
RPLBLK   EQU   RPLOPT3                                                  00774000
RPLSFORM EQU   RPLOPT3                                                  00775000
RPLEODS  EQU   RPLOPT3                                                  00776000
RPLNSP   EQU   RPLOPT2                                                  00777000
RPLUPD   EQU   RPLOPT2                                                  00778000
RPLWAITX EQU   RPLOPT2                                                  00779000
RPLLRD   EQU   RPLOPT2                                                  00780000
RPLBWD   EQU   RPLOPT2                                                  00781000
RPLCNV   EQU   RPLOPT2                                                  00782000
RPLADD   EQU   RPLADR                                                   00783000
RPLKEY   EQU   RPLOPT2                                                  00784000
RPLECBIN EQU   RPLECBSW                                                 00785000
RPLGEN   EQU   RPLOPT1                                                  00786000
RPLKGE   EQU   RPLOPT1                                                  00787000
RPLASY   EQU   RPLOPT1                                                  00788000
RPLSKP   EQU   RPLOPT1                                                  00789000
RPLSEQ   EQU   RPLOPT1                                                  00790000
RPLDIR   EQU   RPLOPT1                                                  00791000
RPLLOC   EQU   RPLOPT1                                                  00792000
RPLDAF   EQU   RPLARG+2                                                 00793000
RPLSAF   EQU   RPLARG                                                   00794000
RPLAREA  EQU   RPLCOMN+32                                               00795000
RPLTCBPT EQU   RPLCOMN+28                                               00796000
RPLDACB  EQU   RPLCOMN+24                                               00797000
RPLCCHAR EQU   RPLCOMN+20                                               00798000
RPLSTRID EQU   RPLCOMN+18                                               00799000
RPLKEYL  EQU   RPLKEYLE                                                 00800000
RPLRDSOH EQU   RPLFDB3                                                  00801000
RPLRLG   EQU   RPLFDB3                                                  00802000
RPLLGFRC EQU   RPLFDB3                                                  00803000
RPLREOT  EQU   RPLFDB3                                                  00804000
RPLREOM  EQU   RPLFDB3                                                  00805000
RPLREOB  EQU   RPLFDB3                                                  00806000
RPLSV32  EQU   RPLFDB3                                                  00807000
RPLUINPT EQU   RPLFDB3                                                  00808000
RPLSTSAV EQU   RPLFDB2                                                  00809000
RPLCUERR EQU   RPLFDB2                                                  00810000
RPLDLGFL EQU   RPLFDB2                                                  00811000
RPLIOERR EQU   RPLFDB2                                                  00812000
RPLDVUNS EQU   RPLFDB2                                                  00813000
RPLATND  EQU   RPLFDB2                                                  00814000
RPLRVID  EQU   RPLFDB2                                                  00815000
RPLERLK  EQU   RPLFDB2                                                  00816000
RPLERREG EQU   RPLRTNCD                                                 00817000
RPLSTAT  EQU   RPLFDBWD                                                 00818000
RPLPOST  EQU   RPLECB                                                   00819000
RPLWAIT  EQU   RPLECB                                                   00820000
RPLPLHPT EQU   RPLCOMN+4                                                00821000
RPLLEN2  EQU   RPLLEN                                                   00822000
RPLREQ   EQU   RPLIDWD+2                                                00823000
RPLSTYP  EQU   RPLIDWD+1                                                00824000
RPLID    EQU   RPLIDWD                                                  00825000
TWAEND   EQU   TWAR+536                                                 00826000
TWAWORKE EQU   TWAR+524                                                 00827000
@NM00054 EQU   TWACI+13                                                 00828000
TWACSKIP EQU   TWACI+12                                                 00829000
TWACMODQ EQU   TWACI+8                                                  00830000
TWACSTPQ EQU   TWACI+4                                                  00831000
TWACECB  EQU   TWACI                                                    00832000
TWACERRS EQU   TWACE+4                                                  00833000
TWACERA  EQU   TWACEI+1                                                 00834000
TWACEIFC EQU   TWACEI                                                   00835000
TWACRTFC EQU   TWAC+60                                                  00836000
TWACABFC EQU   TWAC+56                                                  00837000
TWACTWA  EQU   TWAC+52                                                  00838000
TWACEWA  EQU   TWAC+4                                                   00839000
TWACID   EQU   TWAC                                                     00840000
TWAUACQH EQU   TWAUI+4                                                  00841000
TWAUECB  EQU   TWAUI                                                    00842000
TWAURTFC EQU   TWAU+60                                                  00843000
TWAUABFC EQU   TWAU+56                                                  00844000
TWAUTWA  EQU   TWAU+52                                                  00845000
TWAUEWA  EQU   TWAU+4                                                   00846000
TWAUID   EQU   TWAU                                                     00847000
TWAVACQH EQU   TWAVI+12                                                 00848000
TWAVTHQH EQU   TWAVI+8                                                  00849000
TWAVTEQH EQU   TWAVI+4                                                  00850000
TWAVECB  EQU   TWAVI                                                    00851000
TWAVERRS EQU   TWAVE+4                                                  00852000
TWAVERA  EQU   TWAVEI+1                                                 00853000
TWAVEIFC EQU   TWAVEI                                                   00854000
TWAVRTFC EQU   TWAV+60                                                  00855000
TWAVABFC EQU   TWAV+56                                                  00856000
TWAVTWA  EQU   TWAV+52                                                  00857000
TWAVEWA  EQU   TWAV+4                                                   00858000
TWAVID   EQU   TWAV                                                     00859000
TWAMERRS EQU   TWAME+4                                                  00860000
TWAMERA  EQU   TWAMEI+1                                                 00861000
TWAMEIFC EQU   TWAMEI                                                   00862000
TWAMRTFC EQU   TWAM+60                                                  00863000
TWAMABFC EQU   TWAM+56                                                  00864000
TWAMTWA  EQU   TWAM+52                                                  00865000
TWAMEWA  EQU   TWAM+4                                                   00866000
TWAMID   EQU   TWAM                                                     00867000
@NM00053 EQU   TWACFL                                                   00868000
TWACFL4  EQU   TWACFL                                                   00869000
TWACFL2  EQU   TWACFL                                                   00870000
TWACFL1  EQU   TWACFL                                                   00871000
@NM00052 EQU   TWAUFL                                                   00872000
TWAUFL4  EQU   TWAUFL                                                   00873000
TWAUFL3  EQU   TWAUFL                                                   00874000
TWAUFL2  EQU   TWAUFL                                                   00875000
TWAUFL1  EQU   TWAUFL                                                   00876000
@NM00051 EQU   TWAVFL                                                   00877000
TWAVFL6  EQU   TWAVFL                                                   00878000
TWAVFL5  EQU   TWAVFL                                                   00879000
TWAVFL4  EQU   TWAVFL                                                   00880000
TWAVFL3  EQU   TWAVFL                                                   00881000
TWAVFL2  EQU   TWAVFL                                                   00882000
TWAVFL1  EQU   TWAVFL                                                   00883000
@NM00050 EQU   TWAMFL                                                   00884000
TWAMFL1  EQU   TWAMFL                                                   00885000
TWACCOMP EQU   TWAR+76                                                  00886000
TWAUCOMP EQU   TWAR+72                                                  00887000
TWAVCOMP EQU   TWAR+68                                                  00888000
TWAMECB  EQU   TWAR+64                                                  00889000
TWACTCB  EQU   TWAR+60                                                  00890000
TWAUTCB  EQU   TWAR+56                                                  00891000
TWAVTCB  EQU   TWAR+52                                                  00892000
TWAMSG   EQU   TWAR+48                                                  00893000
TWADEQAS EQU   TWAR+44                                                  00894000
TWAEESR  EQU   TWAR+40                                                  00895000
TWAPPSR  EQU   TWAR+36                                                  00896000
TWATCSR  EQU   TWAR+32                                                  00897000
TWATTSR  EQU   TWAR+28                                                  00898000
TWAINIT  EQU   TWAR+24                                                  00899000
TWACSCB  EQU   TWAR+16                                                  00900000
TWAASCB  EQU   TWAR+12                                                  00901000
TWAPASQH EQU   TWAR+8                                                   00902000
TWASYNQH EQU   TWAR+4                                                   00903000
TWARSON  EQU   TWAR+2                                                   00904000
TWACOMP  EQU   TWAR                                                     00905000
TSBXEND  EQU   TSBX+128                                                 00906000
@NM00049 EQU   TSBX+124                                                 00907000
TSBXDMMO EQU   TSBX+120                                                 00908000
TSBXDMMI EQU   TSBX+116                                                 00909000
TSBXBIND EQU   TSBX+80                                                  00910000
TSBXRPL  EQU   TSBX+76                                                  00911000
TSBXTMBF EQU   TSBXTERM+2                                               00912000
TSBXSUBT EQU   TSBXTERM+1                                               00913000
TSBXTMTP EQU   TSBXTERM                                                 00914000
TSBXRSZO EQU   TSBX+69                                                  00915000
TSBXRSZI EQU   TSBX+68                                                  00916000
TSBXLBUF EQU   TSBX+64                                                  00917000
TSBXCSAP EQU   TSBX+60                                                  00918000
TSBXSRB  EQU   TSBX+56                                                  00919000
TSBXSRBI EQU   TSBX+52                                                  00920000
@NM00048 EQU   TSBX+48                                                  00921000
TSBXDPMO EQU   TSBXTOM                                                  00922000
TSBXDPMI EQU   TSBXTIM                                                  00923000
TSBXTVWA EQU   TSBX+36                                                  00924000
TSBXFLG4 EQU   TSBX+35                                                  00925000
TSBXFLG3 EQU   TSBX+34                                                  00926000
TSBXFLG2 EQU   TSBX+33                                                  00927000
@NM00047 EQU   TSBXFLG1                                                 00928000
TSBXTGTF EQU   TSBXFLG1                                                 00929000
TSBXNOSW EQU   TSBXFLG1                                                 00930000
TSBXWREC EQU   TSBXFLG1                                                 00931000
TSBXLOGF EQU   TSBXFLG1                                                 00932000
TSBXACTV EQU   TSBXFLG1                                                 00933000
TSBXASCI EQU   TSBXFLG1                                                 00934000
TSBXUID  EQU   TSBX+24                                                  00935000
TSBXLMOD EQU   TSBX+16                                                  00936000
TSBXNIB  EQU   TSBX+12                                                  00937000
TSBXECB  EQU   TSBX+8                                                   00938000
TSBEND   EQU   TSB+120                                                  00939000
TSBSF1   EQU   TSB+112                                                  00940000
TSBTRMID EQU   TSB+104                                                  00941000
TSBALTC  EQU   TSB+103                                                  00942000
TSBALTR  EQU   TSB+102                                                  00943000
TSBPRMC  EQU   TSB+101                                                  00944000
TSBPRMR  EQU   TSB+100                                                  00945000
TSBPSWD  EQU   TSB+88                                                   00946000
TSBLECB  EQU   TSBMINL                                                  00947000
TSBLINE  EQU   TSB+82                                                   00948000
TSBSTAX  EQU   TSB+81                                                   00949000
TSBATTNC EQU   TSB+80                                                   00950000
TSBF1V   EQU   TSBTPOST+7                                               00951000
TSBF1M   EQU   TSBTPOST+6                                               00952000
TSBF2V   EQU   TSBTPOST+5                                               00953000
TSBF2M   EQU   TSBTPOST+4                                               00954000
TSBFLAGV EQU   TSBTPOST+3                                               00955000
TSBFLAGM EQU   TSBTPOST+2                                               00956000
@NM00046 EQU   TSBTPOST+1                                               00957000
@NM00045 EQU   TSBTPFLG                                                 00958000
@NM00044 EQU   TSBTPFLG                                                 00959000
@NM00043 EQU   TSBTPFLG                                                 00960000
@NM00042 EQU   TSBTPFLG                                                 00961000
TSBNEWID EQU   TSBTPFLG                                                 00962000
TSBTPAYI EQU   TSBTPFLG                                                 00963000
TSBTPQCB EQU   TSBTPFLG                                                 00964000
TSBPOSTO EQU   TSBTPFLG                                                 00965000
TSBLINKB EQU   TSBLINKA+1                                               00966000
TSBPRI   EQU   TSBLINKA                                                 00967000
TSBRQCB  EQU   TSBRCB                                                   00968000
TSBCTCB  EQU   TSB+60                                                   00969000
TSBERSDS EQU   TSB+56                                                   00970000
TSBAUTOI EQU   TSB+52                                                   00971000
TSBAUTOS EQU   TSB+48                                                   00972000
TSBATNCC EQU   TSB+44                                                   00973000
TSBASRCE EQU   TSB+42                                                   00974000
TSBHLDL  EQU   TSBFLG4                                                  00975000
TSBGETBF EQU   TSBFLG4                                                  00976000
TSBCANC  EQU   TSBFLG4                                                  00977000
TSBHOLD  EQU   TSBFLG4                                                  00978000
TSBHUNG  EQU   TSBFLG4                                                  00979000
TSBOWAIT EQU   TSBFLG4                                                  00980000
TSBIWAIT EQU   TSBFLG4                                                  00981000
TSBOCAB  EQU   TSBFLG4                                                  00982000
TSBLNNO  EQU   TSB+40                                                   00983000
TSBATNTC EQU   TSB+38                                                   00984000
TSBATNLC EQU   TSB+36                                                   00985000
TSBCHDCC EQU   TSBSTCC+1                                                00986000
TSBLNDCC EQU   TSBSTCC                                                  00987000
TSBWTJID EQU   TSB+32                                                   00988000
TSBECB   EQU   TSB+28                                                   00989000
TSBC1050 EQU   TSBTERM2                                                 00990000
@NM00041 EQU   TSBTERM2                                                 00991000
@NM00040 EQU   TSBTERM2                                                 00992000
@NM00039 EQU   TSBTERM2                                                 00993000
@NM00038 EQU   TSBTERM2                                                 00994000
TSBCTWX  EQU   TSBTERM2                                                 00995000
@NM00037 EQU   TSBTERM2                                                 00996000
@NM00036 EQU   TSBTERM2                                                 00997000
@NM00035 EQU   TSBTERM1                                                 00998000
@NM00034 EQU   TSBTERM1                                                 00999000
@NM00033 EQU   TSBTERM1                                                 01000000
TSBC2741 EQU   TSBTERM1                                                 01001000
TSBC5041 EQU   TSBTERM1                                                 01002000
TSBCATTN EQU   TSBTERM1                                                 01003000
TSBCBRK  EQU   TSBTERM1                                                 01004000
TSBCIHBN EQU   TSBTERM1                                                 01005000
TSBVTAM  EQU   TSBFLG5                                                  01006000
TSBKEYS  EQU   TSBFLG5                                                  01007000
TSBNEDIT EQU   TSBFLG5                                                  01008000
TSBQRY   EQU   TSBFLG5                                                  01009000
@NM00032 EQU   TSBFLG5                                                  01010000
TSBSPF   EQU   TSBFLG5                                                  01011000
TSBATMP  EQU   TSBFLG5                                                  01012000
TSBNFLOP EQU   TSBFLG3                                                  01013000
TSBNOBRK EQU   TSBFLG3                                                  01014000
TSBTPUT  EQU   TSBFLG3                                                  01015000
TSBAWOIP EQU   TSBFLG3                                                  01016000
TSBNBKSP EQU   TSBFLG3                                                  01017000
TSBSPIT  EQU   TSBFLG3                                                  01018000
TSBTJMSG EQU   TSBFLG3                                                  01019000
TSBATTN  EQU   TSBFLG3                                                  01020000
TSBIBFP  EQU   TSB+21                                                   01021000
TSBNIBF  EQU   TSB+20                                                   01022000
TSBITBFP EQU   TSB+17                                                   01023000
TSBSATN2 EQU   TSBFLG2                                                  01024000
TSBSATN1 EQU   TSBFLG2                                                  01025000
TSBSTAUT EQU   TSBFLG2                                                  01026000
TSBAUTOC EQU   TSBFLG2                                                  01027000
TSBAULST EQU   TSBFLG2                                                  01028000
TSBBRKIN EQU   TSBFLG2                                                  01029000
TSBAUTON EQU   TSBFLG2                                                  01030000
TSBBIPI  EQU   TSBFLG2                                                  01031000
TSBOBFP  EQU   TSB+13                                                   01032000
TSBNOBF  EQU   TSB+12                                                   01033000
TSBOTBFP EQU   TSB+9                                                    01034000
TSBLNSZ  EQU   TSB+8                                                    01035000
TSBWTCB  EQU   TSB+5                                                    01036000
TSBTJBF  EQU   TSBFLG1                                                  01037000
TSBTJIP  EQU   TSBFLG1                                                  01038000
TSBTJOW  EQU   TSBFLG1                                                  01039000
TSBIFLSH EQU   TSBFLG1                                                  01040000
TSBWOWIP EQU   TSBFLG1                                                  01041000
TSBOWIP  EQU   TSBFLG1                                                  01042000
TSBOFLSH EQU   TSBFLG1                                                  01043000
TSBANSR  EQU   TSBFLG1                                                  01044000
TSBATNLD EQU   TSBSTAT                                                  01045000
TSB3270  EQU   TSBSTAT                                                  01046000
TSBDISC  EQU   TSBSTAT                                                  01047000
TSBITOFF EQU   TSBSTAT                                                  01048000
TSBNOBUF EQU   TSBSTAT                                                  01049000
TSBDSPLY EQU   TSBSTAT                                                  01050000
TSBLWAIT EQU   TSBSTAT                                                  01051000
TSBINUSE EQU   TSBSTAT                                                  01052000
WELMODE  EQU   WESTD+76                                                 01053000
WEALTC   EQU   WESTD+75                                                 01054000
WEALTR   EQU   WESTD+74                                                 01055000
WEPRMC   EQU   WESTD+73                                                 01056000
WEPRMR   EQU   WESTD+72                                                 01057000
WEBIND   EQU   WESTD+36                                                 01058000
@NM00031 EQU   WESTD+35                                                 01059000
WERUSZO  EQU   WESTD+34                                                 01060000
WERUSZI  EQU   WESTD+33                                                 01061000
@NM00030 EQU   WETMFLG                                                  01062000
WENOSW   EQU   WETMFLG                                                  01063000
WEFLG1   EQU   WETMFLG                                                  01064000
WETMBF   EQU   WETERM+2                                                 01065000
WESUBT   EQU   WETERM+1                                                 01066000
WETMTP   EQU   WETERM                                                   01067000
WELBUF   EQU   WESTD+24                                                 01068000
WEUECB   EQU   WEVNIB                                                   01069000
WEUASCB  EQU   WESTD+12                                                 01070000
WELEN    EQU   WESTD+10                                                 01071000
WERC2    EQU   WERC+1                                                   01072000
WERC1    EQU   WERC                                                     01073000
WENEXT   EQU   WESTD+4                                                  01074000
WECD2MIF EQU   WECODE2F                                                 01075000
WECD2MAF EQU   WECODE2F                                                 01076000
WECODE2T EQU   WECODE2                                                  01077000
WECDMIF  EQU   WECODE1F                                                 01078000
WECDMAF  EQU   WECODE1F                                                 01079000
WECODE1T EQU   WECODE1                                                  01080000
TCASTEND EQU   TCAST+148                                                01081000
TCASTTYO EQU   TCAST+144                                                01082000
TCAS767O EQU   TCAST+140                                                01083000
TCAS767I EQU   TCAST+136                                                01084000
TCASDUMP EQU   TCAST+132                                                01085000
TCASSCHD EQU   TCAST+128                                                01086000
TCASTPND EQU   TCAST+124                                                01087000
TCASOMJR EQU   TCAST+120                                                01088000
@NM00029 EQU   TCAST+118                                                01089000
TCASBR14 EQU   TCAST+116                                                01090000
TCASATTN EQU   TCAST+112                                                01091000
TCASASCI EQU   TCAST+108                                                01092000
TCASTTQH EQU   TCAST+104                                                01093000
@NM00028 EQU   TCAST+102                                                01094000
@NM00027 EQU   TCAST+100                                                01095000
TCASTGTF EQU   TCAST+96                                                 01096000
TCASASCB EQU   TCAST+92                                                 01097000
TCASFLG4 EQU   TCAST+91                                                 01098000
TCASFLG3 EQU   TCAST+90                                                 01099000
TCASFLG2 EQU   TCAST+89                                                 01100000
TCASCONF EQU   TCASFLG1                                                 01101000
@NM00026 EQU   TCASFLG1                                                 01102000
TCASHAST EQU   TCASFLG1                                                 01103000
TCASNACT EQU   TCASFLG1                                                 01104000
TCASVSD  EQU   TCASFLG1                                                 01105000
TCASABND EQU   TCASFLG1                                                 01106000
TCASMDSW EQU   TCASFLG1                                                 01107000
TCASBKMD EQU   TCASFLG1                                                 01108000
TCASLTE  EQU   TCAST+84                                                 01109000
TCASEXIT EQU   TCAST+80                                                 01110000
TCASOQM  EQU   TCAST+76                                                 01111000
TCASIQM  EQU   TCAST+72                                                 01112000
TCASTTL  EQU   TCAST+64                                                 01113000
TCASWA   EQU   TCAST+60                                                 01114000
TCASFRR  EQU   TCAST+56                                                 01115000
TCASMSGS EQU   TCAST+52                                                 01116000
TCASDATO EQU   TCAST+48                                                 01117000
TCASDATI EQU   TCAST+44                                                 01118000
TCASXECB EQU   TCAST+40                                                 01119000
TCASTID  EQU   TCAST+32                                                 01120000
@NM00025 EQU   TCAST+31                                                 01121000
TCASCHNL EQU   TCAST+30                                                 01122000
TCASCRSZ EQU   TCAST+28                                                 01123000
TCASLBUF EQU   TCAST+24                                                 01124000
TCASHBUF EQU   TCAST+20                                                 01125000
TCASCLSZ EQU   TCAST+18                                                 01126000
TCASRCON EQU   TCAST+16                                                 01127000
TCASACBP EQU   TCAST+8                                                  01128000
TCASUMAX EQU   TCASUSER+2                                               01129000
TCASUSEC EQU   TCASUSER                                                 01130000
TCASID   EQU   TCAST                                                    01131000
@NM00024 EQU   PSA+3668                                                 01132000
PSASTAK  EQU   PSA+3072                                                 01133000
@NM00023 EQU   PSA+1048                                                 01134000
PSAUSEND EQU   PSA+1048                                                 01135000
PSARV062 EQU   PSA+1044                                                 01136000
PSACDAL  EQU   PSA+1040                                                 01137000
PSAWTCOD EQU   PSA+1036                                                 01138000
PSAATCVT EQU   PSA+1032                                                 01139000
PSAPCPSW EQU   PSA+1024                                                 01140000
PSAPIR2  EQU   PSA+1020                                                 01141000
PSARV059 EQU   PSA+1018                                                 01142000
PSASVC13 EQU   PSA+1016                                                 01143000
PSALSFCC EQU   PSA+1012                                                 01144000
PSASFACC EQU   PSA+1008                                                 01145000
PSASTOP  EQU   PSA+992                                                  01146000
PSASTART EQU   PSA+976                                                  01147000
PSARSPSW EQU   PSA+968                                                  01148000
PSASRPSW EQU   PSA+960                                                  01149000
PSARV045 EQU   PSA+892                                                  01150000
PSARV044 EQU   PSA+888                                                  01151000
PSARV043 EQU   PSA+884                                                  01152000
PSARV042 EQU   PSA+880                                                  01153000
PSARV041 EQU   PSA+876                                                  01154000
PSARV040 EQU   PSA+872                                                  01155000
PSARV025 EQU   PSA+868                                                  01156000
PSADSSED EQU   PSA+868                                                  01157000
PSADSSPR EQU   PSA+864                                                  01158000
PSADSSFW EQU   PSA+860                                                  01159000
PSADSS14 EQU   PSA+856                                                  01160000
PSADSSPP EQU   PSA+848                                                  01161000
PSADSSRP EQU   PSA+840                                                  01162000
PSADSS05 EQU   PSADSSF4                                                 01163000
PSADSS10 EQU   PSADSSF4                                                 01164000
PSADSSVE EQU   PSADSSF4                                                 01165000
PSADSSDE EQU   PSADSSF4                                                 01166000
PSADSSC0 EQU   PSADSSF4                                                 01167000
PSADSSIE EQU   PSADSSF4                                                 01168000
PSADSS12 EQU   PSADSSF4                                                 01169000
PSADSSRC EQU   PSADSSF4                                                 01170000
PSARV057 EQU   PSADSSF3                                                 01171000
PSARV056 EQU   PSADSSF3                                                 01172000
PSARV055 EQU   PSADSSF3                                                 01173000
PSADSSMC EQU   PSADSSF3                                                 01174000
PSADSSRW EQU   PSADSSF3                                                 01175000
PSADSSNM EQU   PSADSSF3                                                 01176000
PSADSSES EQU   PSADSSF3                                                 01177000
PSADSSGP EQU   PSADSSF3                                                 01178000
PSADSSF2 EQU   PSADSSFL+1                                               01179000
PSADSSPI EQU   PSADSSF1                                                 01180000
PSADSSOI EQU   PSADSSF1                                                 01181000
PSADSSSP EQU   PSADSSF1                                                 01182000
PSADSSTP EQU   PSADSSF1                                                 01183000
PSADSSDW EQU   PSADSSF1                                                 01184000
PSADSSDD EQU   PSADSSF1                                                 01185000
PSADSSDM EQU   PSADSSF1                                                 01186000
PSADSSMV EQU   PSADSSF1                                                 01187000
PSADSSTS EQU   PSA+816                                                  01188000
PSADSSWK EQU   PSA+812                                                  01189000
PSADSSR3 EQU   PSA+808                                                  01190000
PSADSSR2 EQU   PSA+804                                                  01191000
PSADSSRS EQU   PSA+800                                                  01192000
PSASTOR  EQU   PSA+796                                                  01193000
PSACPUSA EQU   PSA+794                                                  01194000
PSAVSTAP EQU   PSA+792                                                  01195000
PSAWKVAP EQU   PSA+788                                                  01196000
PSAWKRAP EQU   PSA+784                                                  01197000
PSAMCHIC EQU   PSA+783                                                  01198000
PSARV061 EQU   PSA+782                                                  01199000
PSASYMSK EQU   PSA+781                                                  01200000
PSAMCHFL EQU   PSA+780                                                  01201000
PSACR0   EQU   PSA+776                                                  01202000
PSAPSWSV EQU   PSA+768                                                  01203000
PSACLHS  EQU   PSAHLHI                                                  01204000
PSALKR15 EQU   PSALKSA+60                                               01205000
PSALKR14 EQU   PSALKSA+56                                               01206000
PSALKR13 EQU   PSALKSA+52                                               01207000
PSALKR12 EQU   PSALKSA+48                                               01208000
PSALKR11 EQU   PSALKSA+44                                               01209000
PSALKR10 EQU   PSALKSA+40                                               01210000
PSALKR9  EQU   PSALKSA+36                                               01211000
PSALKR8  EQU   PSALKSA+32                                               01212000
PSALKR7  EQU   PSALKSA+28                                               01213000
PSALKR6  EQU   PSALKSA+24                                               01214000
PSALKR5  EQU   PSALKSA+20                                               01215000
PSALKR4  EQU   PSALKSA+16                                               01216000
PSALKR3  EQU   PSALKSA+12                                               01217000
PSALKR2  EQU   PSALKSA+8                                                01218000
PSALKR1  EQU   PSALKSA+4                                                01219000
PSALKR0  EQU   PSALKSA                                                  01220000
PSARV023 EQU   PSACLHT+52                                               01221000
PSALOCAL EQU   PSACLHT+48                                               01222000
PSACMSL  EQU   PSACLHT+44                                               01223000
PSAOPTL  EQU   PSACLHT+40                                               01224000
PSATPACL EQU   PSACLHT+36                                               01225000
PSATPDNL EQU   PSACLHT+32                                               01226000
PSATPNCL EQU   PSACLHT+28                                               01227000
PSAIOSLL EQU   PSACLHT+24                                               01228000
PSAIOSUL EQU   PSACLHT+20                                               01229000
PSAIOSCL EQU   PSACLHT+16                                               01230000
PSAIOSSL EQU   PSACLHT+12                                               01231000
PSASALCL EQU   PSACLHT+8                                                01232000
PSAASML  EQU   PSACLHT+4                                                01233000
PSADISPL EQU   PSACLHT                                                  01234000
PSASRSA  EQU   PSA+636                                                  01235000
PSARV050 EQU   PSA+634                                                  01236000
PSADSSGO EQU   PSA+633                                                  01237000
PSARECUR EQU   PSA+632                                                  01238000
PSAHLHIS EQU   PSA+628                                                  01239000
PSAIPCSA EQU   PSA+624                                                  01240000
@NM00022 EQU   PSA+621                                                  01241000
PSAIPCDM EQU   PSA+620                                                  01242000
PSAIPCD  EQU   PSA+616                                                  01243000
@NM00021 EQU   PSA+613                                                  01244000
PSAIPCRM EQU   PSA+612                                                  01245000
PSAIPCR  EQU   PSA+608                                                  01246000
PSAMCHEX EQU   PSA+600                                                  01247000
PSAMPSW  EQU   PSA+592                                                  01248000
PSAEXPS2 EQU   PSA+584                                                  01249000
PSAEXPS1 EQU   PSA+576                                                  01250000
PSAPIREG EQU   PSA+572                                                  01251000
PSARSREG EQU   PSA+568                                                  01252000
PSAGPREG EQU   PSA+556                                                  01253000
PSARV022 EQU   PSASUP4                                                  01254000
PSARV021 EQU   PSASUP4                                                  01255000
PSARV020 EQU   PSASUP4                                                  01256000
PSARV019 EQU   PSASUP4                                                  01257000
PSARV018 EQU   PSASUP4                                                  01258000
PSARV017 EQU   PSASUP4                                                  01259000
PSARV016 EQU   PSASUP4                                                  01260000
PSARV015 EQU   PSASUP4                                                  01261000
PSARV014 EQU   PSASUP3                                                  01262000
PSARV013 EQU   PSASUP3                                                  01263000
PSARV012 EQU   PSASUP3                                                  01264000
PSARV011 EQU   PSASUP3                                                  01265000
PSASPR   EQU   PSASUP3                                                  01266000
PSAPSREG EQU   PSASUP3                                                  01267000
PSAPI2   EQU   PSASUP3                                                  01268000
PSAIOSUP EQU   PSASUP3                                                  01269000
PSALCR   EQU   PSASUP2                                                  01270000
PSARTM   EQU   PSASUP2                                                  01271000
PSAACR   EQU   PSASUP2                                                  01272000
PSAIPCE2 EQU   PSASUP2                                                  01273000
PSAIPCES EQU   PSASUP2                                                  01274000
PSAIPCEC EQU   PSASUP2                                                  01275000
PSAGTF   EQU   PSASUP2                                                  01276000
PSAIPCRI EQU   PSASUP2                                                  01277000
PSARV063 EQU   PSASUP1                                                  01278000
PSATCTL  EQU   PSASUP1                                                  01279000
PSADISP  EQU   PSASUP1                                                  01280000
PSALOCK  EQU   PSASUP1                                                  01281000
PSAPI    EQU   PSASUP1                                                  01282000
PSAEXT   EQU   PSASUP1                                                  01283000
PSASVC   EQU   PSASUP1                                                  01284000
PSAIO    EQU   PSASUP1                                                  01285000
PSAAOLD  EQU   PSA+548                                                  01286000
PSAANEW  EQU   PSA+544                                                  01287000
PSATOLD  EQU   PSA+540                                                  01288000
PSATNEW  EQU   PSA+536                                                  01289000
PSALCCAR EQU   PSA+532                                                  01290000
PSALCCAV EQU   PSA+528                                                  01291000
PSAPCCAR EQU   PSA+524                                                  01292000
PSAPCCAV EQU   PSA+520                                                  01293000
PSACPULA EQU   PSA+518                                                  01294000
PSACPUPA EQU   PSA+516                                                  01295000
PSAPSA   EQU   PSA+512                                                  01296000
FLCHDEND EQU   PSA+512                                                  01297000
FLCCRSAV EQU   FLCMCLA+280                                              01298000
FLCGRSAV EQU   FLCMCLA+216                                              01299000
FLCFPSAV EQU   FLCMCLA+184                                              01300000
FLCFLA   EQU   FLCMCLA+88                                               01301000
FLCRGNCD EQU   FLCMCLA+84                                               01302000
FLCFSAA  EQU   FLCFSA+1                                                 01303000
@NM00020 EQU   FLCFSA                                                   01304000
@NM00019 EQU   FLCMCLA+72                                               01305000
FLCMCIC  EQU   FLCMCLA+64                                               01306000
@NM00018 EQU   FLCMCLA+20                                               01307000
FLCIOAA  EQU   FLCIOA+1                                                 01308000
@NM00017 EQU   FLCIOA                                                   01309000
@NM00016 EQU   FLCMCLA+15                                               01310000
@NM00015 EQU   FLCMCLA+14                                               01311000
@NM00014 EQU   FLCMCLA+12                                               01312000
FLCLCL   EQU   FLCMCLA+8                                                01313000
FLCIOELA EQU   FLCIOEL+1                                                01314000
@NM00013 EQU   FLCIOEL                                                  01315000
FLCCHNID EQU   FLCMCLA                                                  01316000
@NM00012 EQU   PSA+160                                                  01317000
FLCMTRCD EQU   PSA+157                                                  01318000
@NM00011 EQU   PSA+156                                                  01319000
FLCPERA  EQU   FLCPER+1                                                 01320000
@NM00010 EQU   FLCPER                                                   01321000
@NM00009 EQU   PSA+151                                                  01322000
FLCPERCD EQU   PSA+150                                                  01323000
FLCMCNUM EQU   PSA+149                                                  01324000
@NM00008 EQU   PSA+148                                                  01325000
FLCTEAA  EQU   FLCTEA+1                                                 01326000
@NM00007 EQU   FLCTEA                                                   01327000
PSAPIPC  EQU   PSAPICOD                                                 01328000
PSAPIMC  EQU   PSAPICOD                                                 01329000
PSAPIPER EQU   PSAPICOD                                                 01330000
PSARV049 EQU   FLCPICOD                                                 01331000
FLCPILCB EQU   FLCPIILC                                                 01332000
@NM00006 EQU   FLCPIILC                                                 01333000
@NM00005 EQU   PSAEPPSW                                                 01334000
FLCSVCN  EQU   PSAESPSW+2                                               01335000
FLCSILCB EQU   FLCSVILC                                                 01336000
@NM00004 EQU   FLCSVILC                                                 01337000
@NM00003 EQU   PSAESPSW                                                 01338000
FLCEICOD EQU   PSAEEPSW+2                                               01339000
PSASPAD  EQU   PSAEEPSW                                                 01340000
@NM00002 EQU   PSA+128                                                  01341000
FLCINPSW EQU   PSA+120                                                  01342000
FLCMNPSW EQU   PSA+112                                                  01343000
FLCPNPSW EQU   PSA+104                                                  01344000
FLCSNPSW EQU   PSA+96                                                   01345000
FLCENPSW EQU   PSA+88                                                   01346000
FLCTRACE EQU   PSA+84                                                   01347000
FLCTIMER EQU   PSA+80                                                   01348000
FLCCVT2  EQU   PSA+76                                                   01349000
FLCCAW   EQU   PSA+72                                                   01350000
FLCCSW   EQU   PSA+64                                                   01351000
FLCIOPSW EQU   PSA+56                                                   01352000
FLCMOPSW EQU   PSA+48                                                   01353000
FLCPOPSW EQU   PSA+40                                                   01354000
FLCSOPSW EQU   PSA+32                                                   01355000
FLCEOPSW EQU   PSA+24                                                   01356000
@NM00001 EQU   FLCICCW2+4                                               01357000
FLCCVT   EQU   FLCICCW2                                                 01358000
FLCICCW1 EQU   FLCROPSW                                                 01359000
FLCIPPSW EQU   FLCRNPSW                                                 01360000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01361000
@RT00145 EQU   #DC00006                                                 01362000
@RF00156 EQU   #BCM0005                                                 01363000
@ENDDATA EQU   *                                                        01364000
         END   IKTCAS33,(C'PLS1956',0702,80232)                         01365000
