         TITLE '***** IKTCAS32 - ADDRESS SPACE TERMINATION *****'       00001000
IKTCAS32 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'IKTCAS32  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @14,@SA00001                                        0001 00014000
         ST    @14,8(,@13)                                         0001 00015000
         LR    @13,@14                                             0001 00016000
*                                                                  0026 00017000
*   /*****************************************************************/ 00018000
*   /*                                                               */ 00019000
*   /* PROCEDURE- IKTCAS32 FUNCITON- MAINLINE CODE                   */ 00020000
*   /*                                                               */ 00021000
*   /*****************************************************************/ 00022000
*                                                                  0026 00023000
*ASTERM:                                                           0026 00024000
*   IF TWAUEIFC(2)=FCUITC           /* IS THIS RETRY, BECAUSE      0026 00025000
*                                      FOOTPRINT ALREAD SET          */ 00026000
*     THEN                                                         0026 00027000
ASTERM   CLI   TWAUEIFC+8(TWAPTR),33                               0026 00028000
         BNE   @RF00026                                            0026 00029000
*     DO;                           /* YES                           */ 00030000
*       CALL FREE;                  /* FREE MAIN IF GETMAINED        */ 00031000
         BAL   @14,FREE                                            0028 00032000
*     END;                                                         0029 00033000
*   ELSE                                                           0030 00034000
*     DO;                           /* NORMAL ENTRY                  */ 00035000
         B     @RC00026                                            0030 00036000
@RF00026 DS    0H                                                  0031 00037000
*       TWAUEIFC(2)=FCUITC;         /* SET FOOTPRINT IN ESTAI PARA   */ 00038000
         MVI   TWAUEIFC+8(TWAPTR),X'21'                            0031 00039000
*       TWAUERA(2)=ADDR(ASTERM);    /* SPECIFY RETRY ADDR            */ 00040000
         LA    @15,ASTERM                                          0032 00041000
         STCM  @15,7,TWAUERA+8(TWAPTR)                             0032 00042000
*       TWAUERRS(2)=EVAL(R13+4)->P; /* STORE SAVE AREA ADDRESS       */ 00043000
         LA    @15,4                                               0033 00044000
         ALR   @15,R13                                             0033 00045000
         L     @15,P(,@15)                                         0033 00046000
         ST    @15,TWAUERRS+8(,TWAPTR)                             0033 00047000
*     END;                                                         0034 00048000
*   RFY                                                            0035 00049000
*     TCAST BASED(TWATCAST);        /* GET TCAST ADDR                */ 00050000
@RC00026 DS    0H                                                  0036 00051000
*   RFY                                                            0036 00052000
*     WESTD BASED(R10);                                            0036 00053000
*   IF TCASUSEC^=0                  /* IS USER COUNT NOT ZERO        */ 00054000
*     THEN                                                         0037 00055000
         L     @01,TWATCAST(,TWAPTR)                               0037 00056000
         LH    @15,TCASUSEC(,@01)                                  0037 00057000
         LTR   @15,@15                                             0037 00058000
         BZ    @RF00037                                            0037 00059000
*     DO;                           /* NO, PERFORM THE FUNCTION      */ 00060000
*       R8=TCASUSEC;                /* GET USER COUNT                */ 00061000
*                                                                  0039 00062000
         LR    R8,@15                                              0039 00063000
*       /*************************************************************/ 00064000
*       /*                                                           */ 00065000
*       /* GET STORAGE FOR A LIST OF ASCB ADDRESS                    */ 00066000
*       /*                                                           */ 00067000
*       /*************************************************************/ 00068000
*                                                                  0040 00069000
*       R8=(R8+4)*4;                /* CALCULATE GETMAIN LENGTH      */ 00070000
         LA    @15,4                                               0040 00071000
         ALR   @15,R8                                              0040 00072000
         SLA   @15,2                                               0040 00073000
         LR    R8,@15                                              0040 00074000
*       RFY                                                        0041 00075000
*        (R14,                                                     0041 00076000
*         R15,                                                     0041 00077000
*         R0,                                                      0041 00078000
*         R1) RSTD                  /* RESTRICT PARA REG             */ 00079000
*             ;                                                    0041 00080000
*       GEN CODE;                                                  0042 00081000
         GETMAIN R,LV=(8)         GETMAIN FOR LIST OF ASCB ADDR         00082000
*       AALISTP=R1;                 /* STORE POINTER                 */ 00083000
         ST    R1,AALISTP                                          0043 00084000
*       AALISTL=R8;                 /* STORE LENGTH                  */ 00085000
         ST    R8,AALISTL                                          0044 00086000
*       R9=AALISTP;                 /* LOAD LIST POINTER             */ 00087000
         L     @07,AALISTP                                         0045 00088000
         LR    R9,@07                                              0045 00089000
*       R8=FCUIAA;                  /* INDICATE EXTRACT ASCB ADDR    */ 00090000
*                                                                  0046 00091000
         LA    R8,50                                               0046 00092000
*       /*************************************************************/ 00093000
*       /*                                                           */ 00094000
*       /* CALL IKTCAS33 TO FILL IN ASCB ADDRESSES                   */ 00095000
*       /*                                                           */ 00096000
*       /*************************************************************/ 00097000
*                                                                  0047 00098000
*       GEN CODE;                                                  0047 00099000
         MODESET KEY=ZERO,MODE=SUP  GET INTO SUPV STATE KEY ZERO        00100000
*       RFY                                                        0048 00101000
*        (R14,                                                     0048 00102000
*         R15,                                                     0048 00103000
*         R0,                                                      0048 00104000
*         R1) UNRSTD                /* UNRESTRI PARA R               */ 00105000
*             ;                                                    0048 00106000
*       CALL IKTCAS33;              /* TO GET ASCB ADDR              */ 00107000
         L     @15,@CV01397                                        0049 00108000
         BALR  @14,@15                                             0049 00109000
*       RFY                                                        0050 00110000
*        (R14,                                                     0050 00111000
*         R15,                                                     0050 00112000
*         R0,                                                      0050 00113000
*         R1) RSTD                  /* RESTRICT PARA REG             */ 00114000
*             ;                                                    0050 00115000
*                                                                  0050 00116000
*       /*************************************************************/ 00117000
*       /*                                                           */ 00118000
*       /* ISSUE MEMORY TERMINATION BY CALLING RTM                   */ 00119000
*       /*                                                           */ 00120000
*       /*************************************************************/ 00121000
*                                                                  0051 00122000
*       IF WECODE1F=FCUITM          /* IS THIS MEMORY TERM           */ 00123000
*         THEN                                                     0051 00124000
         CLI   WECODE1F(R10),X'22'                                 0051 00125000
         BNE   @RF00051                                            0051 00126000
*         DO;                       /* YES                           */ 00127000
*           ASCBPTR=R9->P;          /* LOAD ASCB ADDR                */ 00128000
         L     ASCBPTR,P(,R9)                                      0053 00129000
*           DO WHILE(ASCBPTR^=0);   /* ISSUE MEMTERM FOR ALL A.S.    */ 00130000
         B     @DE00054                                            0054 00131000
@DL00054 DS    0H                                                  0055 00132000
*             R8=ASCBASID;          /* GET ASID                      */ 00133000
         LH    R8,ASCBASID(,ASCBPTR)                               0055 00134000
         N     R8,@CF01414                                         0055 00135000
*             GEN CODE REFS(CVTBTERM) SETS(R2,R7);                 0056 00136000
         L     7,4(13)       SAVE IT- RTM DESTROY SAVEAREA BACK PTR     00137000
         CALLRTM TYPE=MEMTERM,COMPCOD=X'622',ASID=(8)  TERM MEMORY      00138000
         ST    7,4(13)       RESTORE SAVEAREA PTR                       00139000
*             R9=R9+4;              /* NEXT ASCB ADDR                */ 00140000
         AL    R9,@CF00044                                         0057 00141000
*             ASCBPTR=R9->P;        /* LOAD ASCB ADDR                */ 00142000
         L     ASCBPTR,P(,R9)                                      0058 00143000
*           END;                    /* LOOP                          */ 00144000
@DE00054 LTR   ASCBPTR,ASCBPTR                                     0059 00145000
         BNZ   @DL00054                                            0059 00146000
*         END;                      /* DONE                          */ 00147000
*                                                                  0060 00148000
*       /*************************************************************/ 00149000
*       /*                                                           */ 00150000
*       /* ISSUE SYSTEM INITIATED CANCEL                             */ 00151000
*       /*                                                           */ 00152000
*       /*************************************************************/ 00153000
*                                                                  0061 00154000
*       IF WECODE1F=FCUITC          /* IS THIS SIC                   */ 00155000
*         THEN                                                     0061 00156000
@RF00051 CLI   WECODE1F(R10),X'21'                                 0061 00157000
         BNE   @RF00061                                            0061 00158000
*         DO;                       /* YES                           */ 00159000
*           GEN CODE REFS(PSALITA,FLC) SETS(R0,R1,R14,R15);        0063 00160000
*                                  /* GET LOCAL, CMS LOCKS  @ZA34387*/  00161000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,              **00162000
               RELATED=('CALL SIC')                         @ZA34387    00163000
         SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,REGS=USE,                **00164000
               RELATED=('CALL SIC')                         @ZA34387    00165000
*           R1=R9->P;               /* R1 CONTAIN ASCB ADDR          */ 00166000
         L     R1,P(,R9)                                           0064 00167000
*           DO WHILE(R1^=0);        /* SIC ALL USERS                 */ 00168000
         B     @DE00065                                            0065 00169000
@DL00065 DS    0H                                                  0066 00170000
*             R0=COMPCODE;          /* LOAD COMPLETION CODE          */ 00171000
         ICM   R0,15,COMPCODE                                      0066 00172000
*             CALL SIC;             /* BRANCH TO SIC ROUTINE         */ 00173000
         L     @07,CVTPTR                                          0067 00174000
         L     @15,CVTSIC(,@07)                                    0067 00175000
         BALR  @14,@15                                             0067 00176000
*             R9=R9+4;              /* POINTS TO NEXT ADDR           */ 00177000
         AL    R9,@CF00044                                         0068 00178000
*             R1=R9->P;             /* LOAD ASCB ADDR                */ 00179000
         L     R1,P(,R9)                                           0069 00180000
*           END;                    /* LOOP                          */ 00181000
@DE00065 LTR   R1,R1                                               0070 00182000
         BNZ   @DL00065                                            0070 00183000
*           GEN CODE REFS(PSALITA,FLC) SETS(R0,R1,R14,R15);        0071 00184000
*                                  /* GET LOCAL, CMS LOCKS  @ZA34387*/  00185000
         SETLOCK RELEASE,TYPE=CMS,REGS=USE,                           **00186000
               RELATED=('CALL SIC')                         @ZA34387    00187000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                         **00188000
               RELATED=('CALL SIC')                         @ZA34387    00189000
*         END;                                                     0072 00190000
*       GEN CODE;                                                  0073 00191000
@RF00061 DS    0H                                                  0073 00192000
         MODESET KEY=NZERO,MODE=PROB  BACK TO ORIGINAL                  00193000
*       CALL FREE;                  /* FREEMAIN STORAGE              */ 00194000
         BAL   @14,FREE                                            0074 00195000
*     END;                                                         0075 00196000
*   TWAUEIFC(2)=0;                  /* RESET FOOTPRINT FOR EXIT      */ 00197000
@RF00037 MVI   TWAUEIFC+8(TWAPTR),X'00'                            0076 00198000
*                                                                  0077 00199000
*   /*****************************************************************/ 00200000
*   /*                                                               */ 00201000
*   /* SUBPROCEDURE- FREEMAIN FUNCTION- FREE AREA USED FOR ASCB      */ 00202000
*   /* ADDRESSES                                                     */ 00203000
*   /*                                                               */ 00204000
*   /*****************************************************************/ 00205000
*                                                                  0077 00206000
*FREE:                                                             0077 00207000
*   PROC OPTIONS(SAVE(R14),NOSAVEAREA);                            0077 00208000
@EL00001 L     @13,4(,@13)                                         0077 00209000
@EF00001 DS    0H                                                  0077 00210000
@ER00001 LM    @14,@12,12(@13)                                     0077 00211000
         BR    @14                                                 0077 00212000
FREE     ST    @14,12(,@13)                                        0077 00213000
*   IF AALISTP^=0                   /* IS THERE GETMAIN AREA         */ 00214000
*     THEN                                                         0078 00215000
         L     @07,AALISTP                                         0078 00216000
         LTR   @07,@07                                             0078 00217000
         BZ    @RF00078                                            0078 00218000
*     DO;                           /* YES, BECAUSE PTR NOT ZERO     */ 00219000
*       RFY                                                        0080 00220000
*        (R14,                                                     0080 00221000
*         R15,                                                     0080 00222000
*         R0,                                                      0080 00223000
*         R1) RSTD                  /* RESTRICT PARA REG             */ 00224000
*             ;                                                    0080 00225000
*       R9=AALISTP;                 /* GET POINTER OF GETMAIN        */ 00226000
         LR    R9,@07                                              0081 00227000
*       R8=AALISTL;                 /* GET LENGTH                    */ 00228000
         L     R8,AALISTL                                          0082 00229000
*       GEN CODE;                                                  0083 00230000
         FREEMAIN R,LV=(R8),A=(R9)        FREEMAIN FOR TEMP STORAGE     00231000
*       RFY                                                        0084 00232000
*        (R14,                                                     0084 00233000
*         R15,                                                     0084 00234000
*         R0,                                                      0084 00235000
*         R1) UNRSTD                /* UNRESTRI PARA R               */ 00236000
*             ;                                                    0084 00237000
*       AALISTP=0;                  /* RESET PTR                     */ 00238000
         SLR   @15,@15                                             0085 00239000
         ST    @15,AALISTP                                         0085 00240000
*       AALISTL=0;                  /* DONT NEED ANY MORE LENGTH     */ 00241000
         ST    @15,AALISTL                                         0086 00242000
*     END;                                                         0087 00243000
*   END;                                                           0088 00244000
@EL00002 DS    0H                                                  0088 00245000
@EF00002 DS    0H                                                  0088 00246000
@ER00002 L     @14,12(,@13)                                        0088 00247000
         BR    @14                                                 0088 00248000
*   END IKTCAS32                                                   0089 00249000
*                                                                  0089 00250000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00251000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00252000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00253000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00254000
*/*%INCLUDE SYSLIB  (IKTTCAST)                                       */ 00255000
*/*%INCLUDE SYSLIB  (IKTCASWA)                                       */ 00256000
*/*%INCLUDE SYSLIB  (IKTWESTD)                                       */ 00257000
*                                                                  0089 00258000
*       ;                                                          0089 00259000
@DATA    DS    0H                                                       00260000
         DS    0F                                                       00261000
@SA00001 DS    18F                                                      00262000
         DS    0F                                                       00263000
@CF00044 DC    F'4'                                                     00264000
@CF01414 DC    XL4'0000FFFF'                                            00265000
@CV01397 DC    V(IKTCAS33)                                              00266000
         DS    0D                                                       00267000
TCASTPTR DS    A                                                        00268000
AALISTP  DC    A(0)                                                     00269000
AALISTL  DC    F'0'                                                     00270000
COMPCODE DC    X'00000622'                                              00271000
PATCH    DC    13F'0'                                                   00272000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00273000
@01      EQU   01                                                       00274000
@02      EQU   02                                                       00275000
@03      EQU   03                                                       00276000
@04      EQU   04                                                       00277000
@05      EQU   05                                                       00278000
@06      EQU   06                                                       00279000
@07      EQU   07                                                       00280000
@08      EQU   08                                                       00281000
@09      EQU   09                                                       00282000
@10      EQU   10                                                       00283000
@11      EQU   11                                                       00284000
@12      EQU   12                                                       00285000
@13      EQU   13                                                       00286000
@14      EQU   14                                                       00287000
@15      EQU   15                                                       00288000
ASCBPTR  EQU   @06                                                      00289000
TWAPTR   EQU   @11                                                      00290000
R0       EQU   @00                                                      00291000
R1       EQU   @01                                                      00292000
R2       EQU   @02                                                      00293000
R7       EQU   @07                                                      00294000
R8       EQU   @08                                                      00295000
R9       EQU   @09                                                      00296000
R10      EQU   @10                                                      00297000
R13      EQU   @13                                                      00298000
R14      EQU   @14                                                      00299000
R15      EQU   @15                                                      00300000
R12      EQU   @12                                                      00301000
PSA      EQU   0                                                        00302000
FLCRNPSW EQU   PSA                                                      00303000
FLCROPSW EQU   PSA+8                                                    00304000
FLCICCW2 EQU   PSA+16                                                   00305000
FLCCVT   EQU   FLCICCW2                                                 00306000
PSAEEPSW EQU   PSA+132                                                  00307000
PSAESPSW EQU   PSA+136                                                  00308000
FLCSVILC EQU   PSAESPSW+1                                               00309000
PSAEPPSW EQU   PSA+140                                                  00310000
FLCPIILC EQU   PSAEPPSW+1                                               00311000
FLCPICOD EQU   PSAEPPSW+2                                               00312000
PSAPICOD EQU   FLCPICOD+1                                               00313000
FLCTEA   EQU   PSAEPPSW+4                                               00314000
FLCPER   EQU   PSA+152                                                  00315000
FLCMCLA  EQU   PSA+168                                                  00316000
FLCIOEL  EQU   FLCMCLA+4                                                00317000
FLCIOA   EQU   FLCMCLA+16                                               00318000
FLCFSA   EQU   FLCMCLA+80                                               00319000
PSASUPER EQU   PSA+552                                                  00320000
PSASUP1  EQU   PSASUPER                                                 00321000
PSASUP2  EQU   PSASUPER+1                                               00322000
PSASUP3  EQU   PSASUPER+2                                               00323000
PSASUP4  EQU   PSASUPER+3                                               00324000
PSACLHT  EQU   PSA+640                                                  00325000
PSALKSA  EQU   PSA+696                                                  00326000
PSAHLHI  EQU   PSA+760                                                  00327000
PSALITA  EQU   PSA+764                                                  00328000
PSADSSFL EQU   PSA+836                                                  00329000
PSADSSF1 EQU   PSADSSFL                                                 00330000
PSADSSF3 EQU   PSADSSFL+2                                               00331000
PSADSSF4 EQU   PSADSSFL+3                                               00332000
PSARSVT  EQU   PSA+896                                                  00333000
CVTMAP   EQU   0                                                        00334000
CVTBTERM EQU   CVTMAP+52                                                00335000
CVTDAR   EQU   CVTMAP+72                                                00336000
CVTFLGS1 EQU   CVTDAR                                                   00337000
CVTDCB   EQU   CVTMAP+116                                               00338000
CVTIERLC EQU   CVTMAP+144                                               00339000
CVTOPTA  EQU   CVTMAP+182                                               00340000
CVTOPTB  EQU   CVTMAP+183                                               00341000
CVTGTF   EQU   CVTMAP+236                                               00342000
CVTGTFST EQU   CVTGTF                                                   00343000
CVTGTFS  EQU   CVTGTFST                                                 00344000
CVTSTATE EQU   CVTGTFST                                                 00345000
CVTTMODE EQU   CVTGTFST                                                 00346000
CVTFORM  EQU   CVTGTFST                                                 00347000
CVTAQAVT EQU   CVTMAP+240                                               00348000
CVTTCMFG EQU   CVTAQAVT                                                 00349000
CVTVOLM2 EQU   CVTMAP+244                                               00350000
CVTTATA  EQU   CVTVOLM2                                                 00351000
CVTTSKS  EQU   CVTTATA                                                  00352000
CVTVOLF2 EQU   CVTTSKS                                                  00353000
CVTTAT   EQU   CVTTATA+1                                                00354000
CVTATER  EQU   CVTMAP+248                                               00355000
CVTEXT1  EQU   CVTMAP+252                                               00356000
CVTPURG  EQU   CVTMAP+260                                               00357000
CVTQMSG  EQU   CVTMAP+268                                               00358000
CVTDMSR  EQU   CVTMAP+272                                               00359000
CVTRSV37 EQU   CVTDMSR                                                  00360000
CVTDMSRF EQU   CVTRSV37                                                 00361000
CVTERPV  EQU   CVTMAP+316                                               00362000
CVTINTLA EQU   CVTMAP+320                                               00363000
CVTAPF   EQU   CVTMAP+324                                               00364000
CVTEXT2  EQU   CVTMAP+328                                               00365000
CVTHJES  EQU   CVTMAP+332                                               00366000
CVTPGSIA EQU   CVTMAP+348                                               00367000
CVTA1F1  EQU   CVTMAP+356                                               00368000
CVTSYSK  EQU   CVTMAP+357                                               00369000
CVTVOLM1 EQU   CVTMAP+380                                               00370000
CVTVOLF1 EQU   CVTVOLM1                                                 00371000
CVTXTNT1 EQU   0                                                        00372000
CVTXTNT2 EQU   0                                                        00373000
CVTDSSV  EQU   CVTXTNT2                                                 00374000
CVTFLGBT EQU   CVTXTNT2+5                                               00375000
CVTQID   EQU   CVTXTNT2+24                                              00376000
CVTRV400 EQU   CVTXTNT2+52                                              00377000
CVTRV409 EQU   CVTXTNT2+53                                              00378000
CVTATCVT EQU   CVTXTNT2+64                                              00379000
CVTRV429 EQU   CVTXTNT2+84                                              00380000
CVTRV438 EQU   CVTXTNT2+85                                              00381000
CVTRV457 EQU   CVTXTNT2+112                                             00382000
CVTRV466 EQU   CVTXTNT2+113                                             00383000
CVTFIX   EQU   0                                                        00384000
CVTRELNO EQU   CVTFIX+252                                               00385000
ASCB     EQU   0                                                        00386000
ASCBSUPC EQU   ASCB+16                                                  00387000
ASCBASID EQU   ASCB+36                                                  00388000
ASCBFW1  EQU   ASCB+100                                                 00389000
ASCBRCTF EQU   ASCBFW1+2                                                00390000
ASCBFLG1 EQU   ASCBFW1+3                                                00391000
ASCBDSP1 EQU   ASCB+114                                                 00392000
ASCBFLG2 EQU   ASCB+115                                                 00393000
ASCBLKGP EQU   ASCB+128                                                 00394000
ASCBSRQ  EQU   ASCB+180                                                 00395000
ASCBSRQ1 EQU   ASCBSRQ                                                  00396000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00397000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00398000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00399000
TCAST    EQU   0                                                        00400000
TCASUSER EQU   TCAST+4                                                  00401000
TCASUSEC EQU   TCASUSER                                                 00402000
TCASFLG1 EQU   TCAST+88                                                 00403000
TWAR     EQU   0                                                        00404000
TWATCAST EQU   TWAR+20                                                  00405000
TWAMFL   EQU   TWAR+80                                                  00406000
TWAVFL   EQU   TWAR+81                                                  00407000
TWAUFL   EQU   TWAR+82                                                  00408000
TWACFL   EQU   TWAR+83                                                  00409000
TWAM     EQU   TWAR+84                                                  00410000
TWAME    EQU   TWAM+68                                                  00411000
TWAMEI   EQU   TWAME                                                    00412000
TWAV     EQU   TWAR+184                                                 00413000
TWAVE    EQU   TWAV+68                                                  00414000
TWAVEI   EQU   TWAVE                                                    00415000
TWAVI    EQU   TWAR+284                                                 00416000
TWAU     EQU   TWAR+300                                                 00417000
TWAUE    EQU   TWAU+68                                                  00418000
TWAUEI   EQU   TWAUE                                                    00419000
TWAUEIFC EQU   TWAUEI                                                   00420000
TWAUERA  EQU   TWAUEI+1                                                 00421000
TWAUERRS EQU   TWAUE+4                                                  00422000
TWAUI    EQU   TWAR+400                                                 00423000
TWAC     EQU   TWAR+408                                                 00424000
TWACE    EQU   TWAC+68                                                  00425000
TWACEI   EQU   TWACE                                                    00426000
TWACI    EQU   TWAR+508                                                 00427000
WESTD    EQU   0                                                        00428000
WECODE1  EQU   WESTD                                                    00429000
WECODE1F EQU   WECODE1+1                                                00430000
WECODE2  EQU   WESTD+2                                                  00431000
WECODE2F EQU   WECODE2+1                                                00432000
WERC     EQU   WESTD+8                                                  00433000
WEVNIB   EQU   WESTD+16                                                 00434000
WETERM   EQU   WESTD+28                                                 00435000
WETMFLG  EQU   WESTD+32                                                 00436000
SIC      EQU   0                                                        00437000
P        EQU   0                                                        00438000
FLC      EQU   PSA                                                      00439000
PSARSVTE EQU   PSARSVT                                                  00440000
CVTPTR   EQU   FLCCVT                                                   00441000
CVTS01   EQU   CVTPGSIA                                                 00442000
CVTLPDIA EQU   CVTS01+12                                                00443000
CVTDIRST EQU   CVTLPDIA                                                 00444000
CVTSLIDA EQU   CVTS01+24                                                00445000
CVTCTLFG EQU   CVTS01+50                                                00446000
CVTSIC   EQU   CVTS01+252                                               00447000
CVTRV210 EQU   CVTS01+424                                               00448000
CVTRV219 EQU   CVTS01+425                                               00449000
CVTRV228 EQU   CVTS01+426                                               00450000
CVTRV237 EQU   CVTS01+427                                               00451000
CVTMFRTR EQU   CVTS01+452                                               00452000
CVTRV262 EQU   CVTS01+468                                               00453000
CVTRV271 EQU   CVTS01+469                                               00454000
CVTRV280 EQU   CVTS01+470                                               00455000
CVTRV289 EQU   CVTS01+471                                               00456000
CVTGSDA  EQU   CVTS01+600                                               00457000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00458000
CVTRV628 EQU   CVTS01+728                                               00459000
CVTRV627 EQU   CVTS01+724                                               00460000
CVTRV626 EQU   CVTS01+720                                               00461000
CVTRV625 EQU   CVTS01+716                                               00462000
CVTRV624 EQU   CVTS01+712                                               00463000
CVTRV623 EQU   CVTS01+708                                               00464000
CVTRV622 EQU   CVTS01+704                                               00465000
CVTRV621 EQU   CVTS01+700                                               00466000
CVTIHASU EQU   CVTS01+696                                               00467000
CVTSUSP  EQU   CVTS01+692                                               00468000
CVTT6SVC EQU   CVTS01+688                                               00469000
CVTCDAL  EQU   CVTS01+684                                               00470000
CVTTCTL  EQU   CVTS01+680                                               00471000
CVTRSUME EQU   CVTS01+676                                               00472000
CVTJTERM EQU   CVTS01+672                                               00473000
CVTASMRM EQU   CVTS01+668                                               00474000
CVTTCASP EQU   CVTS01+664                                               00475000
CVT0PT03 EQU   CVTS01+660                                               00476000
CVT0PT0E EQU   CVTS01+656                                               00477000
CVTRV609 EQU   CVTS01+652                                               00478000
CVTCGK   EQU   CVTS01+648                                               00479000
CVTRAC   EQU   CVTS01+644                                               00480000
CVTRV606 EQU   CVTS01+640                                               00481000
CVTRV605 EQU   CVTS01+636                                               00482000
CVTRV604 EQU   CVTS01+632                                               00483000
CVTEFF02 EQU   CVTS01+628                                               00484000
CVTCBBR  EQU   CVTS01+624                                               00485000
CVTSSCR  EQU   CVTS01+620                                               00486000
CVTEVENT EQU   CVTS01+616                                               00487000
CVTCRCA  EQU   CVTS01+612                                               00488000
CVTTPIO  EQU   CVTS01+608                                               00489000
CVTADV   EQU   CVTS01+604                                               00490000
CVTGSDAB EQU   CVTGSDA                                                  00491000
CVTQV3   EQU   CVTS01+596                                               00492000
CVTQV2   EQU   CVTS01+592                                               00493000
CVTQV1   EQU   CVTS01+588                                               00494000
CVTRPT   EQU   CVTS01+584                                               00495000
CVTSSRB  EQU   CVTS01+580                                               00496000
CVTCSDRL EQU   CVTS01+576                                               00497000
CVTEXP1  EQU   CVTS01+572                                               00498000
CVTRMPMT EQU   CVTS01+568                                               00499000
CVTRMPTT EQU   CVTS01+564                                               00500000
CVTVPSA  EQU   CVTS01+560                                               00501000
CVTVSTOP EQU   CVTS01+556                                               00502000
CVTGTFR8 EQU   CVTS01+552                                               00503000
CVTQUIT  EQU   CVTS01+548                                               00504000
CVTVACR  EQU   CVTS01+544                                               00505000
CVTWTCB  EQU   CVTS01+540                                               00506000
CVTSTPRS EQU   CVTS01+536                                               00507000
CVT0PT02 EQU   CVTS01+532                                               00508000
CVTDARCM EQU   CVTS01+528                                               00509000
CVTIRECM EQU   CVTS01+524                                               00510000
CVTJRECM EQU   CVTS01+520                                               00511000
CVTVEMS0 EQU   CVTS01+516                                               00512000
CVTSPFRR EQU   CVTS01+512                                               00513000
CVTRLSTG EQU   CVTS01+508                                               00514000
CVT0TC0A EQU   CVTS01+504                                               00515000
CVTGMBR  EQU   CVTS01+500                                               00516000
CVTLFRM  EQU   CVTS01+496                                               00517000
CVTRMBR  EQU   CVTS01+492                                               00518000
CVTVIOP  EQU   CVTS01+488                                               00519000
CVTRV307 EQU   CVTS01+486                                               00520000
CVTRV306 EQU   CVTS01+484                                               00521000
CVTRV305 EQU   CVTS01+482                                               00522000
CVTRV304 EQU   CVTS01+480                                               00523000
CVTRV303 EQU   CVTS01+478                                               00524000
CVTRV302 EQU   CVTS01+476                                               00525000
CVTTRCA  EQU   CVTS01+472                                               00526000
CVTRV297 EQU   CVTRV289                                                 00527000
CVTRV296 EQU   CVTRV289                                                 00528000
CVTRV295 EQU   CVTRV289                                                 00529000
CVTRV294 EQU   CVTRV289                                                 00530000
CVTRV293 EQU   CVTRV289                                                 00531000
CVTRV292 EQU   CVTRV289                                                 00532000
CVTRV291 EQU   CVTRV289                                                 00533000
CVTRV290 EQU   CVTRV289                                                 00534000
CVTRV288 EQU   CVTRV280                                                 00535000
CVTRV287 EQU   CVTRV280                                                 00536000
CVTRV286 EQU   CVTRV280                                                 00537000
CVTRV285 EQU   CVTRV280                                                 00538000
CVTRV284 EQU   CVTRV280                                                 00539000
CVTRV283 EQU   CVTRV280                                                 00540000
CVTRV282 EQU   CVTRV280                                                 00541000
CVTRV281 EQU   CVTRV280                                                 00542000
CVTRV279 EQU   CVTRV271                                                 00543000
CVTRV278 EQU   CVTRV271                                                 00544000
CVTRV277 EQU   CVTRV271                                                 00545000
CVTRV276 EQU   CVTRV271                                                 00546000
CVTRV275 EQU   CVTRV271                                                 00547000
CVTRV274 EQU   CVTRV271                                                 00548000
CVTRV273 EQU   CVTRV271                                                 00549000
CVTRV272 EQU   CVTRV271                                                 00550000
CVTRV270 EQU   CVTRV262                                                 00551000
CVTRV269 EQU   CVTRV262                                                 00552000
CVTRV268 EQU   CVTRV262                                                 00553000
CVTRV267 EQU   CVTRV262                                                 00554000
CVTRV266 EQU   CVTRV262                                                 00555000
CVTRV265 EQU   CVTRV262                                                 00556000
CVTRV264 EQU   CVTRV262                                                 00557000
CVTRV263 EQU   CVTRV262                                                 00558000
CVTVFP   EQU   CVTS01+464                                               00559000
CVTVSI   EQU   CVTS01+460                                               00560000
CVTVPSIB EQU   CVTS01+456                                               00561000
CVTMFACT EQU   CVTMFRTR                                                 00562000
CVTMFCTL EQU   CVTS01+448                                               00563000
CVTPVBP  EQU   CVTS01+444                                               00564000
CVTPWI   EQU   CVTS01+440                                               00565000
CVTRV254 EQU   CVTS01+438                                               00566000
CVTRV253 EQU   CVTS01+436                                               00567000
CVTRV252 EQU   CVTS01+434                                               00568000
CVTRV251 EQU   CVTS01+433                                               00569000
CVTRV250 EQU   CVTS01+432                                               00570000
CVTRV249 EQU   CVTS01+431                                               00571000
CVTRV248 EQU   CVTS01+430                                               00572000
CVTRV247 EQU   CVTS01+429                                               00573000
CVTRV246 EQU   CVTS01+428                                               00574000
CVTRV245 EQU   CVTRV237                                                 00575000
CVTRV244 EQU   CVTRV237                                                 00576000
CVTRV243 EQU   CVTRV237                                                 00577000
CVTRV242 EQU   CVTRV237                                                 00578000
CVTRV241 EQU   CVTRV237                                                 00579000
CVTRV240 EQU   CVTRV237                                                 00580000
CVTRV239 EQU   CVTRV237                                                 00581000
CVTRV238 EQU   CVTRV237                                                 00582000
CVTRV236 EQU   CVTRV228                                                 00583000
CVTRV235 EQU   CVTRV228                                                 00584000
CVTRV234 EQU   CVTRV228                                                 00585000
CVTRV233 EQU   CVTRV228                                                 00586000
CVTRV232 EQU   CVTRV228                                                 00587000
CVTRV231 EQU   CVTRV228                                                 00588000
CVTRV230 EQU   CVTRV228                                                 00589000
CVTRV229 EQU   CVTRV228                                                 00590000
CVTRV227 EQU   CVTRV219                                                 00591000
CVTRV226 EQU   CVTRV219                                                 00592000
CVTRV225 EQU   CVTRV219                                                 00593000
CVTRV224 EQU   CVTRV219                                                 00594000
CVTRV223 EQU   CVTRV219                                                 00595000
CVTRV222 EQU   CVTRV219                                                 00596000
CVTRV221 EQU   CVTRV219                                                 00597000
CVTRV220 EQU   CVTRV219                                                 00598000
CVTRV218 EQU   CVTRV210                                                 00599000
CVTRV217 EQU   CVTRV210                                                 00600000
CVTRV216 EQU   CVTRV210                                                 00601000
CVTRV215 EQU   CVTRV210                                                 00602000
CVTRV214 EQU   CVTRV210                                                 00603000
CVTRV213 EQU   CVTRV210                                                 00604000
CVTRV212 EQU   CVTRV210                                                 00605000
CVTRV211 EQU   CVTRV210                                                 00606000
CVTLCCAT EQU   CVTS01+420                                               00607000
CVTPCCAT EQU   CVTS01+416                                               00608000
CVTIPCRP EQU   CVTS01+412                                               00609000
CVTIPCRI EQU   CVTS01+408                                               00610000
CVTIPCDS EQU   CVTS01+404                                               00611000
CVTAIDVT EQU   CVTS01+400                                               00612000
CVTSSAP  EQU   CVTS01+396                                               00613000
CVTEHCIR EQU   CVTS01+392                                               00614000
CVTEHDEF EQU   CVTS01+388                                               00615000
CVTDAIR  EQU   CVTS01+384                                               00616000
CVTPERFM EQU   CVTS01+380                                               00617000
CVT044R2 EQU   CVTS01+376                                               00618000
CVTFETCH EQU   CVTS01+372                                               00619000
CVTRSTWD EQU   CVTS01+368                                               00620000
CVTSPOST EQU   CVTS01+364                                               00621000
CVTIOBP  EQU   CVTS01+360                                               00622000
CVTASMVT EQU   CVTS01+356                                               00623000
CVTRECRQ EQU   CVTS01+352                                               00624000
CVTWSAC  EQU   CVTS01+348                                               00625000
CVTRV149 EQU   CVTS01+344                                               00626000
CVTWSAL  EQU   CVTS01+340                                               00627000
CVTSPSA  EQU   CVTS01+336                                               00628000
CVTGLMN  EQU   CVTS01+332                                               00629000
CVTVEAC0 EQU   CVTS01+328                                               00630000
CVT062R1 EQU   CVTS01+324                                               00631000
CVTRPOST EQU   CVTS01+320                                               00632000
CVTDQIQE EQU   CVTS01+316                                               00633000
CVTCSD   EQU   CVTS01+312                                               00634000
CVTLKRMA EQU   CVTS01+308                                               00635000
CVTRSPIE EQU   CVTS01+304                                               00636000
CVTRENQ  EQU   CVTS01+300                                               00637000
CVTLQCB  EQU   CVTS01+296                                               00638000
CVTFQCB  EQU   CVTS01+292                                               00639000
CVTQCS01 EQU   CVTS01+288                                               00640000
CVTAPFT  EQU   CVTS01+284                                               00641000
CVTPARRL EQU   CVTS01+280                                               00642000
CVTVWAIT EQU   CVTS01+276                                               00643000
CVTGSPL  EQU   CVTS01+272                                               00644000
CVTLSMQ  EQU   CVTS01+268                                               00645000
CVTGSMQ  EQU   CVTS01+264                                               00646000
CVTEXPRO EQU   CVTS01+260                                               00647000
CVTOPCTP EQU   CVTS01+256                                               00648000
CVTTPIOS EQU   CVTS01+248                                               00649000
CVTRTMS  EQU   CVTS01+244                                               00650000
CVTSDBF  EQU   CVTS01+240                                               00651000
CVTSCBP  EQU   CVTS01+236                                               00652000
CVTSDMP  EQU   CVTS01+232                                               00653000
CVTSV60  EQU   CVTS01+228                                               00654000
CVTRTMCT EQU   CVTS01+224                                               00655000
CVTASCBL EQU   CVTS01+220                                               00656000
CVTASCBH EQU   CVTS01+216                                               00657000
CVTGDA   EQU   CVTS01+212                                               00658000
CVTASVT  EQU   CVTS01+208                                               00659000
CVTVVMDI EQU   CVTS01+204                                               00660000
CVTAQTOP EQU   CVTS01+200                                               00661000
CVTIOSCS EQU   CVTS01+196                                               00662000
CVTSDRM  EQU   CVTS01+192                                               00663000
CVTOPTE  EQU   CVTS01+188                                               00664000
CVTSTXU  EQU   CVTS01+184                                               00665000
CVTQUIS  EQU   CVTS01+180                                               00666000
CVTPARS  EQU   CVTS01+176                                               00667000
CVTS1EE  EQU   CVTS01+172                                               00668000
CVTFRAS  EQU   CVTS01+168                                               00669000
CVTQSAS  EQU   CVTS01+164                                               00670000
CVTCRAS  EQU   CVTS01+160                                               00671000
CVTCRMN  EQU   CVTS01+156                                               00672000
CVTDELCP EQU   CVTS01+152                                               00673000
CVTFRECL EQU   CVTS01+148                                               00674000
CVTGETCL EQU   CVTS01+144                                               00675000
CVTBLDCP EQU   CVTS01+140                                               00676000
CVTAUTHL EQU   CVTS01+136                                               00677000
CVTSCAN  EQU   CVTS01+132                                               00678000
CVTRV144 EQU   CVTS01+130                                               00679000
CVTMAXMP EQU   CVTS01+128                                               00680000
CVTSTCK  EQU   CVTS01+124                                               00681000
CVTRV139 EQU   CVTS01+123                                               00682000
CVTDSSAC EQU   CVTS01+122                                               00683000
CVTRV513 EQU   CVTS01+121                                               00684000
CVTIOSPL EQU   CVTS01+120                                               00685000
CVTPTGT  EQU   CVTS01+116                                               00686000
CVTCSPIE EQU   CVTS01+112                                               00687000
CVTSMFEX EQU   CVTS01+108                                               00688000
CVTOLT0A EQU   CVTS01+104                                               00689000
CVTSRBRT EQU   CVTS01+100                                               00690000
CVTPUTL  EQU   CVTS01+96                                                00691000
CVTASCRL EQU   CVTS01+92                                                00692000
CVTASCRF EQU   CVTS01+88                                                00693000
CVTRV326 EQU   CVTS01+84                                                00694000
CVTRV325 EQU   CVTS01+80                                                00695000
CVTRV324 EQU   CVTS01+76                                                00696000
CVT0VL01 EQU   CVTS01+72                                                00697000
CVTSHRVM EQU   CVTS01+68                                                00698000
CVTRV332 EQU   CVTS01+64                                                00699000
CVTTAS   EQU   CVTS01+60                                                00700000
CVTRSCN  EQU   CVTS01+56                                                00701000
CVTTRAC2 EQU   CVTS01+54                                                00702000
CVTTRACE EQU   CVTS01+52                                                00703000
CVTAPG   EQU   CVTS01+51                                                00704000
CVTSDTRC EQU   CVTCTLFG                                                 00705000
CVTGTRCE EQU   CVTCTLFG                                                 00706000
CVTNOMP  EQU   CVTCTLFG                                                 00707000
CVTRSV79 EQU   CVTCTLFG                                                 00708000
CVTDSTAT EQU   CVTCTLFG                                                 00709000
CVTRSV78 EQU   CVTCTLFG                                                 00710000
CVTRV333 EQU   CVTCTLFG                                                 00711000
CVTRV323 EQU   CVTCTLFG                                                 00712000
CVTSPVLK EQU   CVTS01+49                                                00713000
CVTRSV77 EQU   CVTS01+48                                                00714000
CVTRV331 EQU   CVTS01+44                                                00715000
CVTRV330 EQU   CVTS01+40                                                00716000
CVTRV329 EQU   CVTS01+36                                                00717000
CVTRV328 EQU   CVTS01+32                                                00718000
CVTRV322 EQU   CVTS01+28                                                00719000
CVTSLID  EQU   CVTSLIDA+1                                               00720000
CVTSYLK  EQU   CVTSLIDA                                                 00721000
CVTRV321 EQU   CVTS01+20                                                00722000
CVTRV320 EQU   CVTS01+16                                                00723000
CVTLPDIR EQU   CVTLPDIA+1                                               00724000
CVTRSV69 EQU   CVTDIRST                                                 00725000
CVTRSV68 EQU   CVTDIRST                                                 00726000
CVTRSV67 EQU   CVTDIRST                                                 00727000
CVTRSV66 EQU   CVTDIRST                                                 00728000
CVTRSV65 EQU   CVTDIRST                                                 00729000
CVTRSV64 EQU   CVTDIRST                                                 00730000
CVTRSV63 EQU   CVTDIRST                                                 00731000
CVTDICOM EQU   CVTDIRST                                                 00732000
CVTPVTP  EQU   CVTS01+8                                                 00733000
CVTLPDSR EQU   CVTS01+4                                                 00734000
CVTGETL  EQU   CVTS01                                                   00735000
PSARSAV  EQU   PSARSVTE+60                                              00736000
PSARSTK  EQU   PSARSVTE+56                                              00737000
PSAESAV3 EQU   PSARSVTE+52                                              00738000
PSAESTK3 EQU   PSARSVTE+48                                              00739000
PSAESAV2 EQU   PSARSVTE+44                                              00740000
PSAESTK2 EQU   PSARSVTE+40                                              00741000
PSAESAV1 EQU   PSARSVTE+36                                              00742000
PSAESTK1 EQU   PSARSVTE+32                                              00743000
PSAPSAV  EQU   PSARSVTE+28                                              00744000
PSAPSTK  EQU   PSARSVTE+24                                              00745000
PSAMSAV  EQU   PSARSVTE+20                                              00746000
PSAMSTK  EQU   PSARSVTE+16                                              00747000
PSASSAV  EQU   PSARSVTE+12                                              00748000
PSASSTK  EQU   PSARSVTE+8                                               00749000
PSANSTK  EQU   PSARSVTE+4                                               00750000
PSACSTK  EQU   PSARSVTE                                                 00751000
WELMODE  EQU   WESTD+76                                                 00752000
WEALTC   EQU   WESTD+75                                                 00753000
WEALTR   EQU   WESTD+74                                                 00754000
WEPRMC   EQU   WESTD+73                                                 00755000
WEPRMR   EQU   WESTD+72                                                 00756000
WEBIND   EQU   WESTD+36                                                 00757000
@NM00038 EQU   WESTD+35                                                 00758000
WERUSZO  EQU   WESTD+34                                                 00759000
WERUSZI  EQU   WESTD+33                                                 00760000
@NM00037 EQU   WETMFLG                                                  00761000
WENOSW   EQU   WETMFLG                                                  00762000
WEFLG1   EQU   WETMFLG                                                  00763000
WETMBF   EQU   WETERM+2                                                 00764000
WESUBT   EQU   WETERM+1                                                 00765000
WETMTP   EQU   WETERM                                                   00766000
WELBUF   EQU   WESTD+24                                                 00767000
WEVRPL   EQU   WESTD+20                                                 00768000
WEUECB   EQU   WEVNIB                                                   00769000
WEUASCB  EQU   WESTD+12                                                 00770000
WELEN    EQU   WESTD+10                                                 00771000
WERC2    EQU   WERC+1                                                   00772000
WERC1    EQU   WERC                                                     00773000
WENEXT   EQU   WESTD+4                                                  00774000
WECD2MIF EQU   WECODE2F                                                 00775000
WECD2MAF EQU   WECODE2F                                                 00776000
WECODE2T EQU   WECODE2                                                  00777000
WECDMIF  EQU   WECODE1F                                                 00778000
WECDMAF  EQU   WECODE1F                                                 00779000
WECODE1T EQU   WECODE1                                                  00780000
TWAEND   EQU   TWAR+536                                                 00781000
TWAWORKE EQU   TWAR+524                                                 00782000
@NM00036 EQU   TWACI+13                                                 00783000
TWACSKIP EQU   TWACI+12                                                 00784000
TWACMODQ EQU   TWACI+8                                                  00785000
TWACSTPQ EQU   TWACI+4                                                  00786000
TWACECB  EQU   TWACI                                                    00787000
TWACERRS EQU   TWACE+4                                                  00788000
TWACERA  EQU   TWACEI+1                                                 00789000
TWACEIFC EQU   TWACEI                                                   00790000
TWACRTFC EQU   TWAC+60                                                  00791000
TWACABFC EQU   TWAC+56                                                  00792000
TWACTWA  EQU   TWAC+52                                                  00793000
TWACEWA  EQU   TWAC+4                                                   00794000
TWACID   EQU   TWAC                                                     00795000
TWAUACQH EQU   TWAUI+4                                                  00796000
TWAUECB  EQU   TWAUI                                                    00797000
TWAURTFC EQU   TWAU+60                                                  00798000
TWAUABFC EQU   TWAU+56                                                  00799000
TWAUTWA  EQU   TWAU+52                                                  00800000
TWAUEWA  EQU   TWAU+4                                                   00801000
TWAUID   EQU   TWAU                                                     00802000
TWAVACQH EQU   TWAVI+12                                                 00803000
TWAVTHQH EQU   TWAVI+8                                                  00804000
TWAVTEQH EQU   TWAVI+4                                                  00805000
TWAVECB  EQU   TWAVI                                                    00806000
TWAVERRS EQU   TWAVE+4                                                  00807000
TWAVERA  EQU   TWAVEI+1                                                 00808000
TWAVEIFC EQU   TWAVEI                                                   00809000
TWAVRTFC EQU   TWAV+60                                                  00810000
TWAVABFC EQU   TWAV+56                                                  00811000
TWAVTWA  EQU   TWAV+52                                                  00812000
TWAVEWA  EQU   TWAV+4                                                   00813000
TWAVID   EQU   TWAV                                                     00814000
TWAMERRS EQU   TWAME+4                                                  00815000
TWAMERA  EQU   TWAMEI+1                                                 00816000
TWAMEIFC EQU   TWAMEI                                                   00817000
TWAMRTFC EQU   TWAM+60                                                  00818000
TWAMABFC EQU   TWAM+56                                                  00819000
TWAMTWA  EQU   TWAM+52                                                  00820000
TWAMEWA  EQU   TWAM+4                                                   00821000
TWAMID   EQU   TWAM                                                     00822000
@NM00035 EQU   TWACFL                                                   00823000
TWACFL4  EQU   TWACFL                                                   00824000
TWACFL2  EQU   TWACFL                                                   00825000
TWACFL1  EQU   TWACFL                                                   00826000
@NM00034 EQU   TWAUFL                                                   00827000
TWAUFL4  EQU   TWAUFL                                                   00828000
TWAUFL3  EQU   TWAUFL                                                   00829000
TWAUFL2  EQU   TWAUFL                                                   00830000
TWAUFL1  EQU   TWAUFL                                                   00831000
@NM00033 EQU   TWAVFL                                                   00832000
TWAVFL6  EQU   TWAVFL                                                   00833000
TWAVFL5  EQU   TWAVFL                                                   00834000
TWAVFL4  EQU   TWAVFL                                                   00835000
TWAVFL3  EQU   TWAVFL                                                   00836000
TWAVFL2  EQU   TWAVFL                                                   00837000
TWAVFL1  EQU   TWAVFL                                                   00838000
@NM00032 EQU   TWAMFL                                                   00839000
TWAMFL1  EQU   TWAMFL                                                   00840000
TWACCOMP EQU   TWAR+76                                                  00841000
TWAUCOMP EQU   TWAR+72                                                  00842000
TWAVCOMP EQU   TWAR+68                                                  00843000
TWAMECB  EQU   TWAR+64                                                  00844000
TWACTCB  EQU   TWAR+60                                                  00845000
TWAUTCB  EQU   TWAR+56                                                  00846000
TWAVTCB  EQU   TWAR+52                                                  00847000
TWAMSG   EQU   TWAR+48                                                  00848000
TWADEQAS EQU   TWAR+44                                                  00849000
TWAEESR  EQU   TWAR+40                                                  00850000
TWAPPSR  EQU   TWAR+36                                                  00851000
TWATCSR  EQU   TWAR+32                                                  00852000
TWATTSR  EQU   TWAR+28                                                  00853000
TWAINIT  EQU   TWAR+24                                                  00854000
TWACSCB  EQU   TWAR+16                                                  00855000
TWAASCB  EQU   TWAR+12                                                  00856000
TWAPASQH EQU   TWAR+8                                                   00857000
TWASYNQH EQU   TWAR+4                                                   00858000
TWARSON  EQU   TWAR+2                                                   00859000
TWACOMP  EQU   TWAR                                                     00860000
TCASTEND EQU   TCAST+148                                                00861000
TCASTTYO EQU   TCAST+144                                                00862000
TCAS767O EQU   TCAST+140                                                00863000
TCAS767I EQU   TCAST+136                                                00864000
TCASDUMP EQU   TCAST+132                                                00865000
TCASSCHD EQU   TCAST+128                                                00866000
TCASTPND EQU   TCAST+124                                                00867000
TCASOMJR EQU   TCAST+120                                                00868000
@NM00031 EQU   TCAST+118                                                00869000
TCASBR14 EQU   TCAST+116                                                00870000
TCASATTN EQU   TCAST+112                                                00871000
TCASASCI EQU   TCAST+108                                                00872000
TCASTTQH EQU   TCAST+104                                                00873000
@NM00030 EQU   TCAST+102                                                00874000
@NM00029 EQU   TCAST+100                                                00875000
TCASTGTF EQU   TCAST+96                                                 00876000
TCASASCB EQU   TCAST+92                                                 00877000
TCASFLG4 EQU   TCAST+91                                                 00878000
TCASFLG3 EQU   TCAST+90                                                 00879000
TCASFLG2 EQU   TCAST+89                                                 00880000
TCASCONF EQU   TCASFLG1                                                 00881000
@NM00028 EQU   TCASFLG1                                                 00882000
TCASHAST EQU   TCASFLG1                                                 00883000
TCASNACT EQU   TCASFLG1                                                 00884000
TCASVSD  EQU   TCASFLG1                                                 00885000
TCASABND EQU   TCASFLG1                                                 00886000
TCASMDSW EQU   TCASFLG1                                                 00887000
TCASBKMD EQU   TCASFLG1                                                 00888000
TCASLTE  EQU   TCAST+84                                                 00889000
TCASEXIT EQU   TCAST+80                                                 00890000
TCASOQM  EQU   TCAST+76                                                 00891000
TCASIQM  EQU   TCAST+72                                                 00892000
TCASTSB  EQU   TCAST+68                                                 00893000
TCASTTL  EQU   TCAST+64                                                 00894000
TCASWA   EQU   TCAST+60                                                 00895000
TCASFRR  EQU   TCAST+56                                                 00896000
TCASMSGS EQU   TCAST+52                                                 00897000
TCASDATO EQU   TCAST+48                                                 00898000
TCASDATI EQU   TCAST+44                                                 00899000
TCASXECB EQU   TCAST+40                                                 00900000
TCASTID  EQU   TCAST+32                                                 00901000
@NM00027 EQU   TCAST+31                                                 00902000
TCASCHNL EQU   TCAST+30                                                 00903000
TCASCRSZ EQU   TCAST+28                                                 00904000
TCASLBUF EQU   TCAST+24                                                 00905000
TCASHBUF EQU   TCAST+20                                                 00906000
TCASCLSZ EQU   TCAST+18                                                 00907000
TCASRCON EQU   TCAST+16                                                 00908000
TCASACBP EQU   TCAST+8                                                  00909000
TCASUMAX EQU   TCASUSER+2                                               00910000
TCASID   EQU   TCAST                                                    00911000
ASCBEND  EQU   ASCB+208                                                 00912000
ASCBSRBT EQU   ASCB+200                                                 00913000
ASCBSWTL EQU   ASCB+196                                                 00914000
ASCBRS14 EQU   ASCB+195                                                 00915000
ASCBSMCT EQU   ASCB+194                                                 00916000
ASCBRS12 EQU   ASCB+192                                                 00917000
ASCBPCTT EQU   ASCB+188                                                 00918000
ASCBVGTT EQU   ASCB+184                                                 00919000
ASCBRV43 EQU   ASCBSRQ4                                                 00920000
ASCBRV42 EQU   ASCBSRQ4                                                 00921000
ASCBRV41 EQU   ASCBSRQ4                                                 00922000
ASCBRV40 EQU   ASCBSRQ4                                                 00923000
ASCBRV39 EQU   ASCBSRQ4                                                 00924000
ASCBRV38 EQU   ASCBSRQ4                                                 00925000
ASCBRV37 EQU   ASCBSRQ4                                                 00926000
ASCBRV36 EQU   ASCBSRQ4                                                 00927000
ASCBRV35 EQU   ASCBSRQ3                                                 00928000
ASCBRV34 EQU   ASCBSRQ3                                                 00929000
ASCBRV33 EQU   ASCBSRQ3                                                 00930000
ASCBRV32 EQU   ASCBSRQ3                                                 00931000
ASCBRV31 EQU   ASCBSRQ3                                                 00932000
ASCBRV30 EQU   ASCBSRQ3                                                 00933000
ASCBRV29 EQU   ASCBSRQ3                                                 00934000
ASCBRV28 EQU   ASCBSRQ3                                                 00935000
ASCBRV27 EQU   ASCBSRQ2                                                 00936000
ASCBRV26 EQU   ASCBSRQ2                                                 00937000
ASCBRV25 EQU   ASCBSRQ2                                                 00938000
ASCBRV24 EQU   ASCBSRQ2                                                 00939000
ASCBRV23 EQU   ASCBSRQ2                                                 00940000
ASCBRV22 EQU   ASCBSRQ2                                                 00941000
ASCBRV21 EQU   ASCBSRQ2                                                 00942000
ASCBRV20 EQU   ASCBSRQ2                                                 00943000
ASCBRV19 EQU   ASCBSRQ1                                                 00944000
ASCBRV18 EQU   ASCBSRQ1                                                 00945000
ASCBRV17 EQU   ASCBSRQ1                                                 00946000
ASCBRV16 EQU   ASCBSRQ1                                                 00947000
ASCBRV15 EQU   ASCBSRQ1                                                 00948000
ASCBRV14 EQU   ASCBSRQ1                                                 00949000
ASCBRV13 EQU   ASCBSRQ1                                                 00950000
ASCBSTA  EQU   ASCBSRQ1                                                 00951000
ASCBJBNS EQU   ASCB+176                                                 00952000
ASCBJBNI EQU   ASCB+172                                                 00953000
ASCBMCC  EQU   ASCB+168                                                 00954000
ASCBRTWA EQU   ASCB+164                                                 00955000
ASCBIQEA EQU   ASCB+160                                                 00956000
ASCBXMPQ EQU   ASCB+156                                                 00957000
ASCBRS01 EQU   ASCB+154                                                 00958000
ASCBFMCT EQU   ASCB+152                                                 00959000
ASCBOUXB EQU   ASCB+148                                                 00960000
ASCBOUCB EQU   ASCB+144                                                 00961000
ASCBMECB EQU   ASCB+140                                                 00962000
ASCBQECB EQU   ASCB+136                                                 00963000
ASCBLSQH EQU   ASCBLKGP+4                                               00964000
ASCBLOCK EQU   ASCBLKGP                                                 00965000
ASCBTCBS EQU   ASCB+124                                                 00966000
ASCBNVSC EQU   ASCB+122                                                 00967000
ASCBVSC  EQU   ASCB+120                                                 00968000
ASCBSRBS EQU   ASCB+118                                                 00969000
ASCBSSRB EQU   ASCB+116                                                 00970000
ASCBRV06 EQU   ASCBFLG2                                                 00971000
ASCBRV05 EQU   ASCBFLG2                                                 00972000
ASCBRV04 EQU   ASCBFLG2                                                 00973000
ASCBSNQS EQU   ASCBFLG2                                                 00974000
ASCBS2S  EQU   ASCBFLG2                                                 00975000
ASCBCEXT EQU   ASCBFLG2                                                 00976000
ASCBPXMT EQU   ASCBFLG2                                                 00977000
ASCBXMPT EQU   ASCBFLG2                                                 00978000
ASCBRF07 EQU   ASCBDSP1                                                 00979000
ASCBRF06 EQU   ASCBDSP1                                                 00980000
ASCBRF05 EQU   ASCBDSP1                                                 00981000
ASCBRF04 EQU   ASCBDSP1                                                 00982000
ASCBRF03 EQU   ASCBDSP1                                                 00983000
ASCBRF02 EQU   ASCBDSP1                                                 00984000
ASCBFAIL EQU   ASCBDSP1                                                 00985000
ASCBNOQ  EQU   ASCBDSP1                                                 00986000
ASCBSWCT EQU   ASCB+112                                                 00987000
ASCBASXB EQU   ASCB+108                                                 00988000
ASCBTMCH EQU   ASCB+104                                                 00989000
ASCBNSWP EQU   ASCBFLG1                                                 00990000
ASCBTYP1 EQU   ASCBFLG1                                                 00991000
ASCBSTND EQU   ASCBFLG1                                                 00992000
ASCBABNT EQU   ASCBFLG1                                                 00993000
ASCBTERM EQU   ASCBFLG1                                                 00994000
ASCBS3S  EQU   ASCBFLG1                                                 00995000
ASCBCMSH EQU   ASCBFLG1                                                 00996000
ASCBTOFF EQU   ASCBFLG1                                                 00997000
ASCBRF01 EQU   ASCBRCTF                                                 00998000
ASCBTMLW EQU   ASCBRCTF                                                 00999000
ASCBOUT  EQU   ASCBRCTF                                                 01000000
ASCBWAIT EQU   ASCBRCTF                                                 01001000
ASCBRV08 EQU   ASCBRCTF                                                 01002000
ASCBFQU  EQU   ASCBRCTF                                                 01003000
ASCBFRS  EQU   ASCBRCTF                                                 01004000
ASCBTMNO EQU   ASCBRCTF                                                 01005000
ASCBAFFN EQU   ASCBFW1                                                  01006000
ASCBDUMP EQU   ASCB+96                                                  01007000
ASCBQSVC EQU   ASCB+92                                                  01008000
ASCBUBET EQU   ASCB+88                                                  01009000
ASCBECB  EQU   ASCB+84                                                  01010000
ASCBJSTL EQU   ASCB+80                                                  01011000
ASCBEWST EQU   ASCB+72                                                  01012000
ASCBEJST EQU   ASCB+64                                                  01013000
ASCBTSB  EQU   ASCB+60                                                  01014000
ASCBCSCB EQU   ASCB+56                                                  01015000
ASCBRSM  EQU   ASCB+52                                                  01016000
ASCBLDA  EQU   ASCB+48                                                  01017000
ASCBSTOR EQU   ASCB+44                                                  01018000
ASCBDP   EQU   ASCB+43                                                  01019000
ASCBRV07 EQU   ASCB+42                                                  01020000
ASCBIOSM EQU   ASCB+40                                                  01021000
ASCBSEQN EQU   ASCB+38                                                  01022000
ASCBCPUS EQU   ASCB+32                                                  01023000
ASCBSPL  EQU   ASCB+28                                                  01024000
ASCBIOSP EQU   ASCB+24                                                  01025000
ASCBSYNC EQU   ASCBSUPC+4                                               01026000
ASCBSVRB EQU   ASCBSUPC                                                 01027000
ASCBCMSF EQU   ASCB+12                                                  01028000
ASCBBWDP EQU   ASCB+8                                                   01029000
ASCBFWDP EQU   ASCB+4                                                   01030000
ASCBASCB EQU   ASCB                                                     01031000
ASCBEGIN EQU   ASCB                                                     01032000
CVTLEVL  EQU   CVTRELNO+2                                               01033000
CVTNUMB  EQU   CVTRELNO                                                 01034000
CVTMDL   EQU   CVTFIX+250                                               01035000
@NM00026 EQU   CVTFIX+248                                               01036000
@NM00025 EQU   CVTFIX                                                   01037000
CVTRV482 EQU   CVTXTNT2+128                                             01038000
CVTRV481 EQU   CVTXTNT2+124                                             01039000
CVTRV480 EQU   CVTXTNT2+120                                             01040000
CVTRV479 EQU   CVTXTNT2+118                                             01041000
CVTRV478 EQU   CVTXTNT2+117                                             01042000
CVTRV477 EQU   CVTXTNT2+116                                             01043000
CVTRV476 EQU   CVTXTNT2+115                                             01044000
CVTRV475 EQU   CVTXTNT2+114                                             01045000
CVTRV474 EQU   CVTRV466                                                 01046000
CVTRV473 EQU   CVTRV466                                                 01047000
CVTRV472 EQU   CVTRV466                                                 01048000
CVTRV471 EQU   CVTRV466                                                 01049000
CVTRV470 EQU   CVTRV466                                                 01050000
CVTRV469 EQU   CVTRV466                                                 01051000
CVTRV468 EQU   CVTRV466                                                 01052000
CVTRV467 EQU   CVTRV466                                                 01053000
CVTRV465 EQU   CVTRV457                                                 01054000
CVTRV464 EQU   CVTRV457                                                 01055000
CVTRV463 EQU   CVTRV457                                                 01056000
CVTRV462 EQU   CVTRV457                                                 01057000
CVTRV461 EQU   CVTRV457                                                 01058000
CVTRV460 EQU   CVTRV457                                                 01059000
CVTRV459 EQU   CVTRV457                                                 01060000
CVTRV458 EQU   CVTRV457                                                 01061000
CVTRV456 EQU   CVTXTNT2+108                                             01062000
CVTRV455 EQU   CVTXTNT2+104                                             01063000
CVTRV454 EQU   CVTXTNT2+100                                             01064000
CVTRV453 EQU   CVTXTNT2+96                                              01065000
CVTRV452 EQU   CVTXTNT2+94                                              01066000
CVTRV451 EQU   CVTXTNT2+92                                              01067000
CVTRV450 EQU   CVTXTNT2+90                                              01068000
CVTRV449 EQU   CVTXTNT2+88                                              01069000
CVTRV448 EQU   CVTXTNT2+87                                              01070000
CVTRV447 EQU   CVTXTNT2+86                                              01071000
CVTRV446 EQU   CVTRV438                                                 01072000
CVTRV445 EQU   CVTRV438                                                 01073000
CVTRV444 EQU   CVTRV438                                                 01074000
CVTRV443 EQU   CVTRV438                                                 01075000
CVTRV442 EQU   CVTRV438                                                 01076000
CVTRV441 EQU   CVTRV438                                                 01077000
CVTRV440 EQU   CVTRV438                                                 01078000
CVTRV439 EQU   CVTRV438                                                 01079000
CVTRV437 EQU   CVTRV429                                                 01080000
CVTRV436 EQU   CVTRV429                                                 01081000
CVTRV435 EQU   CVTRV429                                                 01082000
CVTRV434 EQU   CVTRV429                                                 01083000
CVTRV433 EQU   CVTRV429                                                 01084000
CVTRV432 EQU   CVTRV429                                                 01085000
CVTRV431 EQU   CVTRV429                                                 01086000
CVTRV430 EQU   CVTRV429                                                 01087000
CVTRV428 EQU   CVTXTNT2+80                                              01088000
CVTRV427 EQU   CVTXTNT2+76                                              01089000
CVTRV426 EQU   CVTXTNT2+72                                              01090000
CVTRV425 EQU   CVTXTNT2+68                                              01091000
CVTATACT EQU   CVTATCVT                                                 01092000
CVTRV423 EQU   CVTXTNT2+62                                              01093000
CVTRV422 EQU   CVTXTNT2+60                                              01094000
CVTRV421 EQU   CVTXTNT2+58                                              01095000
CVTRV420 EQU   CVTXTNT2+56                                              01096000
CVTRV419 EQU   CVTXTNT2+55                                              01097000
CVTRV418 EQU   CVTXTNT2+54                                              01098000
CVTRV417 EQU   CVTRV409                                                 01099000
CVTRV416 EQU   CVTRV409                                                 01100000
CVTRV415 EQU   CVTRV409                                                 01101000
CVTRV414 EQU   CVTRV409                                                 01102000
CVTRV413 EQU   CVTRV409                                                 01103000
CVTRV412 EQU   CVTRV409                                                 01104000
CVTRV411 EQU   CVTRV409                                                 01105000
CVTRV410 EQU   CVTRV409                                                 01106000
CVTRV408 EQU   CVTRV400                                                 01107000
CVTRV407 EQU   CVTRV400                                                 01108000
CVTRV406 EQU   CVTRV400                                                 01109000
CVTRV405 EQU   CVTRV400                                                 01110000
CVTRV404 EQU   CVTRV400                                                 01111000
CVTRV403 EQU   CVTRV400                                                 01112000
CVTRV402 EQU   CVTRV400                                                 01113000
CVTRV401 EQU   CVTRV400                                                 01114000
CVTICB   EQU   CVTXTNT2+48                                              01115000
CVTSKTA  EQU   CVTXTNT2+44                                              01116000
CVTCCVT  EQU   CVTXTNT2+40                                              01117000
CVTRSV98 EQU   CVTXTNT2+36                                              01118000
CVTRSV97 EQU   CVTXTNT2+34                                              01119000
CVTRSV96 EQU   CVTXTNT2+32                                              01120000
CVTOLTEP EQU   CVTXTNT2+28                                              01121000
CVTQIDA  EQU   CVTQID+1                                                 01122000
CVTRSV95 EQU   CVTQID                                                   01123000
CVTRSV94 EQU   CVTXTNT2+20                                              01124000
CVTRSV93 EQU   CVTXTNT2+16                                              01125000
CVTRSV92 EQU   CVTXTNT2+12                                              01126000
CVTDEBVR EQU   CVTXTNT2+8                                               01127000
CVTRSV91 EQU   CVTXTNT2+6                                               01128000
CVTRSV9H EQU   CVTFLGBT                                                 01129000
CVTRSV9G EQU   CVTFLGBT                                                 01130000
CVTRSV9F EQU   CVTFLGBT                                                 01131000
CVTRSV9E EQU   CVTFLGBT                                                 01132000
CVTRSV9D EQU   CVTFLGBT                                                 01133000
CVTBAH   EQU   CVTFLGBT                                                 01134000
CVTVME   EQU   CVTFLGBT                                                 01135000
CVTNPE   EQU   CVTFLGBT                                                 01136000
CVTNUCLS EQU   CVTXTNT2+4                                               01137000
CVTDSSVA EQU   CVTDSSV+1                                                01138000
CVTRSV89 EQU   CVTDSSV                                                  01139000
CVTRSV88 EQU   CVTXTNT1+8                                               01140000
CVTRSV87 EQU   CVTXTNT1+4                                               01141000
CVTFACHN EQU   CVTXTNT1                                                 01142000
CVTRV488 EQU   CVTMAP+412                                               01143000
CVTRV487 EQU   CVTMAP+408                                               01144000
CVTRV486 EQU   CVTMAP+404                                               01145000
CVTRV485 EQU   CVTMAP+400                                               01146000
CVTACTAP EQU   CVTMAP+396                                               01147000
CVTAUTH  EQU   CVTMAP+392                                               01148000
CVTRV490 EQU   CVTMAP+388                                               01149000
CVTSU    EQU   CVTMAP+384                                               01150000
CVTVOLT1 EQU   CVTVOLM1+1                                               01151000
CVTVOLI1 EQU   CVTVOLF1                                                 01152000
CVTSTOA  EQU   CVTMAP+376                                               01153000
CVTRSV58 EQU   CVTMAP+374                                               01154000
CVTRSV57 EQU   CVTMAP+372                                               01155000
CVTDDCE  EQU   CVTMAP+368                                               01156000
CVTPNWFR EQU   CVTMAP+364                                               01157000
CVTSMF   EQU   CVTMAP+360                                               01158000
CVTSULK  EQU   CVTMAP+358                                               01159000
CVTSLKO  EQU   CVTSYSK                                                  01160000
CVTSLKP  EQU   CVTSYSK                                                  01161000
CVTSLKQ  EQU   CVTSYSK                                                  01162000
CVTSLKR  EQU   CVTSYSK                                                  01163000
CVTRSV56 EQU   CVTSYSK                                                  01164000
CVTRSV55 EQU   CVTSYSK                                                  01165000
CVTRSV54 EQU   CVTSYSK                                                  01166000
CVTRSV53 EQU   CVTSYSK                                                  01167000
CVTRSV52 EQU   CVTA1F1                                                  01168000
CVTRSV51 EQU   CVTA1F1                                                  01169000
CVTRSV50 EQU   CVTA1F1                                                  01170000
CVTRSV49 EQU   CVTA1F1                                                  01171000
CVTRSV48 EQU   CVTA1F1                                                  01172000
CVTRSV47 EQU   CVTA1F1                                                  01173000
CVTSRSW  EQU   CVTA1F1                                                  01174000
CVTPFSW  EQU   CVTA1F1                                                  01175000
CVTPCVT  EQU   CVTMAP+352                                               01176000
CVTRSV46 EQU   CVTMAP+344                                               01177000
CVTRSV45 EQU   CVTMAP+340                                               01178000
CVTRSV44 EQU   CVTMAP+338                                               01179000
CVTRSV43 EQU   CVTMAP+336                                               01180000
CVTHJESA EQU   CVTHJES+1                                                01181000
CVTRSV42 EQU   CVTHJES                                                  01182000
CVTEXT2A EQU   CVTEXT2+1                                                01183000
CVTRSV41 EQU   CVTEXT2                                                  01184000
CVTAPFA  EQU   CVTAPF+1                                                 01185000
CVTRSV40 EQU   CVTAPF                                                   01186000
CVTRV518 EQU   CVTINTLA                                                 01187000
CVTRV517 EQU   CVTERPV                                                  01188000
CVTEORM  EQU   CVTMAP+312                                               01189000
CVTMCHPR EQU   CVTMAP+308                                               01190000
CVTTZ    EQU   CVTMAP+304                                               01191000
CVTJEPS  EQU   CVTMAP+300                                               01192000
CVTJESCT EQU   CVTMAP+296                                               01193000
CVTMODE  EQU   CVTMAP+292                                               01194000
CVTPTRV  EQU   CVTMAP+288                                               01195000
CVTREAL  EQU   CVTMAP+284                                               01196000
CVTRSV39 EQU   CVTMAP+280                                               01197000
CVTRSV38 EQU   CVTMAP+276                                               01198000
CVTDMSRA EQU   CVTDMSR+1                                                01199000
CVTRV634 EQU   CVTDMSRF                                                 01200000
CVTRV633 EQU   CVTDMSRF                                                 01201000
CVTRV632 EQU   CVTDMSRF                                                 01202000
CVTRV631 EQU   CVTDMSRF                                                 01203000
CVTRV630 EQU   CVTDMSRF                                                 01204000
CVTRV629 EQU   CVTDMSRF                                                 01205000
CVTUDUMP EQU   CVTDMSRF                                                 01206000
CVTSDUMP EQU   CVTDMSRF                                                 01207000
CVTQMSGA EQU   CVTQMSG+1                                                01208000
CVTRSV36 EQU   CVTQMSG                                                  01209000
CVTAMFF  EQU   CVTMAP+264                                               01210000
CVTPURGA EQU   CVTPURG+1                                                01211000
CVTRSV35 EQU   CVTPURG                                                  01212000
CVTCBSP  EQU   CVTMAP+256                                               01213000
CVTATERA EQU   CVTATER+1                                                01214000
CVTSYST  EQU   CVTATER                                                  01215000
CVTVOLT2 EQU   CVTTAT                                                   01216000
CVTVOLI2 EQU   CVTVOLF2                                                 01217000
CVTAQAVB EQU   CVTAQAVT+1                                               01218000
CVTRSV34 EQU   CVTTCMFG                                                 01219000
CVTRSV33 EQU   CVTTCMFG                                                 01220000
CVTRSV32 EQU   CVTTCMFG                                                 01221000
CVTRSV31 EQU   CVTTCMFG                                                 01222000
CVTRSV30 EQU   CVTTCMFG                                                 01223000
CVTRSV29 EQU   CVTTCMFG                                                 01224000
CVTLDEV  EQU   CVTTCMFG                                                 01225000
CVTTCRDY EQU   CVTTCMFG                                                 01226000
CVTGTFA  EQU   CVTGTF+1                                                 01227000
CVTRSV27 EQU   CVTGTFST                                                 01228000
CVTRNIO  EQU   CVTGTFST                                                 01229000
CVTUSR   EQU   CVTGTFST                                                 01230000
CVTRV318 EQU   CVTFORM                                                  01231000
CVTRV317 EQU   CVTTMODE                                                 01232000
CVTRV316 EQU   CVTSTATE                                                 01233000
CVTRV315 EQU   CVTGTFS                                                  01234000
CVTGTFAV EQU   CVTGTFS                                                  01235000
CVT0SCR1 EQU   CVTMAP+232                                               01236000
CVTRV515 EQU   CVTMAP+228                                               01237000
CVTRMS   EQU   CVTMAP+224                                               01238000
CVTPATCH EQU   CVTMAP+220                                               01239000
CVTTSCE  EQU   CVTMAP+216                                               01240000
CVTLNKSC EQU   CVTMAP+214                                               01241000
CVTQABST EQU   CVTMAP+212                                               01242000
CVTMDLDS EQU   CVTMAP+208                                               01243000
CVTUSER  EQU   CVTMAP+204                                               01244000
CVTABEND EQU   CVTMAP+200                                               01245000
CVTSMCA  EQU   CVTMAP+196                                               01246000
CVTRSV18 EQU   CVTMAP+192                                               01247000
CVTQLPAQ EQU   CVTMAP+188                                               01248000
CVTQCDSR EQU   CVTMAP+184                                               01249000
CVTVS1B  EQU   CVTOPTB                                                  01250000
CVTVS1A  EQU   CVTOPTB                                                  01251000
CVTFP    EQU   CVTOPTB                                                  01252000
CVTAPTHR EQU   CVTOPTB                                                  01253000
CVTNLOG  EQU   CVTOPTB                                                  01254000
CVTTOD   EQU   CVTOPTB                                                  01255000
CVTCTIMS EQU   CVTOPTB                                                  01256000
CVTPROT  EQU   CVTOPTB                                                  01257000
CVTXPFP  EQU   CVTOPTA                                                  01258000
CVTASCII EQU   CVTOPTA                                                  01259000
CVTRSV13 EQU   CVTOPTA                                                  01260000
CVTRSV12 EQU   CVTOPTA                                                  01261000
CVTNIP   EQU   CVTOPTA                                                  01262000
CVTDDR   EQU   CVTOPTA                                                  01263000
CVTAPR   EQU   CVTOPTA                                                  01264000
CVTCCH   EQU   CVTOPTA                                                  01265000
CVTSNCTR EQU   CVTMAP+180                                               01266000
CVTQMWR  EQU   CVTMAP+176                                               01267000
CVTQOCR  EQU   CVTMAP+172                                               01268000
CVT1EF00 EQU   CVTMAP+168                                               01269000
CVTMZ00  EQU   CVTMAP+164                                               01270000
CVTHEAD  EQU   CVTMAP+160                                               01271000
CVTRSV11 EQU   CVTMAP+156                                               01272000
CVT0PT01 EQU   CVTMAP+152                                               01273000
CVTMSER  EQU   CVTMAP+148                                               01274000
CVTRV516 EQU   CVTIERLC                                                 01275000
CVTILCH  EQU   CVTMAP+140                                               01276000
CVT0DS   EQU   CVTMAP+136                                               01277000
CVTFBOSV EQU   CVTMAP+132                                               01278000
CVTNUCB  EQU   CVTMAP+128                                               01279000
CVTIXAVL EQU   CVTMAP+124                                               01280000
CVTIOQET EQU   CVTMAP+120                                               01281000
CVTDCBA  EQU   CVTMAP+117                                               01282000
CVTMVS2  EQU   CVTDCB                                                   01283000
CVT6DAT  EQU   CVTDCB                                                   01284000
CVT4MPS  EQU   CVTDCB                                                   01285000
CVTRSV09 EQU   CVTDCB                                                   01286000
CVT4MS1  EQU   CVTDCB                                                   01287000
CVT2SPS  EQU   CVTDCB                                                   01288000
CVT1SSS  EQU   CVTDCB                                                   01289000
CVTRSV08 EQU   CVTDCB                                                   01290000
CVTSTB   EQU   CVTMAP+112                                               01291000
CVTQTD00 EQU   CVTMAP+108                                               01292000
CVTQTE00 EQU   CVTMAP+104                                               01293000
CVTCUCB  EQU   CVTMAP+100                                               01294000
CVTSJQ   EQU   CVTMAP+96                                                01295000
CVTPBLDL EQU   CVTMAP+92                                                01296000
CVTTPC   EQU   CVTMAP+88                                                01297000
CVTSVDCB EQU   CVTMAP+84                                                01298000
CVTBRET  EQU   CVTMAP+82                                                01299000
CVTEXIT  EQU   CVTMAP+80                                                01300000
CVT0FN00 EQU   CVTMAP+76                                                01301000
CVTDARA  EQU   CVTDAR+1                                                 01302000
CVTRSV07 EQU   CVTFLGS1                                                 01303000
CVTRSV06 EQU   CVTFLGS1                                                 01304000
CVTRSV05 EQU   CVTFLGS1                                                 01305000
CVTRSV04 EQU   CVTFLGS1                                                 01306000
CVTRSV03 EQU   CVTFLGS1                                                 01307000
CVTRSV02 EQU   CVTFLGS1                                                 01308000
CVTRSV01 EQU   CVTFLGS1                                                 01309000
CVTDMPLK EQU   CVTFLGS1                                                 01310000
CVTXITP  EQU   CVTMAP+68                                                01311000
CVTZDTAB EQU   CVTMAP+64                                                01312000
CVTMSLT  EQU   CVTMAP+60                                                01313000
CVTDATE  EQU   CVTMAP+56                                                01314000
CVTSYSAD EQU   CVTMAP+48                                                01315000
CVTXTLER EQU   CVTMAP+44                                                01316000
CVTILK2  EQU   CVTMAP+40                                                01317000
CVTILK1  EQU   CVTMAP+36                                                01318000
CVTPRLTV EQU   CVTMAP+32                                                01319000
CVTPCNVT EQU   CVTMAP+28                                                01320000
CVT0VL00 EQU   CVTMAP+24                                                01321000
CVTXAPG  EQU   CVTMAP+20                                                01322000
CVTBUF   EQU   CVTMAP+16                                                01323000
CVTJOB   EQU   CVTMAP+12                                                01324000
CVTLINK  EQU   CVTMAP+8                                                 01325000
CVT0EF00 EQU   CVTMAP+4                                                 01326000
CVTTCBP  EQU   CVTMAP                                                   01327000
CVT      EQU   CVTMAP                                                   01328000
@NM00024 EQU   PSA+3668                                                 01329000
PSASTAK  EQU   PSA+3072                                                 01330000
@NM00023 EQU   PSA+1048                                                 01331000
PSAUSEND EQU   PSA+1048                                                 01332000
PSARV062 EQU   PSA+1044                                                 01333000
PSACDAL  EQU   PSA+1040                                                 01334000
PSAWTCOD EQU   PSA+1036                                                 01335000
PSAATCVT EQU   PSA+1032                                                 01336000
PSAPCPSW EQU   PSA+1024                                                 01337000
PSAPIR2  EQU   PSA+1020                                                 01338000
PSARV059 EQU   PSA+1018                                                 01339000
PSASVC13 EQU   PSA+1016                                                 01340000
PSALSFCC EQU   PSA+1012                                                 01341000
PSASFACC EQU   PSA+1008                                                 01342000
PSASTOP  EQU   PSA+992                                                  01343000
PSASTART EQU   PSA+976                                                  01344000
PSARSPSW EQU   PSA+968                                                  01345000
PSASRPSW EQU   PSA+960                                                  01346000
PSARV045 EQU   PSA+892                                                  01347000
PSARV044 EQU   PSA+888                                                  01348000
PSARV043 EQU   PSA+884                                                  01349000
PSARV042 EQU   PSA+880                                                  01350000
PSARV041 EQU   PSA+876                                                  01351000
PSARV040 EQU   PSA+872                                                  01352000
PSARV025 EQU   PSA+868                                                  01353000
PSADSSED EQU   PSA+868                                                  01354000
PSADSSPR EQU   PSA+864                                                  01355000
PSADSSFW EQU   PSA+860                                                  01356000
PSADSS14 EQU   PSA+856                                                  01357000
PSADSSPP EQU   PSA+848                                                  01358000
PSADSSRP EQU   PSA+840                                                  01359000
PSADSS05 EQU   PSADSSF4                                                 01360000
PSADSS10 EQU   PSADSSF4                                                 01361000
PSADSSVE EQU   PSADSSF4                                                 01362000
PSADSSDE EQU   PSADSSF4                                                 01363000
PSADSSC0 EQU   PSADSSF4                                                 01364000
PSADSSIE EQU   PSADSSF4                                                 01365000
PSADSS12 EQU   PSADSSF4                                                 01366000
PSADSSRC EQU   PSADSSF4                                                 01367000
PSARV057 EQU   PSADSSF3                                                 01368000
PSARV056 EQU   PSADSSF3                                                 01369000
PSARV055 EQU   PSADSSF3                                                 01370000
PSADSSMC EQU   PSADSSF3                                                 01371000
PSADSSRW EQU   PSADSSF3                                                 01372000
PSADSSNM EQU   PSADSSF3                                                 01373000
PSADSSES EQU   PSADSSF3                                                 01374000
PSADSSGP EQU   PSADSSF3                                                 01375000
PSADSSF2 EQU   PSADSSFL+1                                               01376000
PSADSSPI EQU   PSADSSF1                                                 01377000
PSADSSOI EQU   PSADSSF1                                                 01378000
PSADSSSP EQU   PSADSSF1                                                 01379000
PSADSSTP EQU   PSADSSF1                                                 01380000
PSADSSDW EQU   PSADSSF1                                                 01381000
PSADSSDD EQU   PSADSSF1                                                 01382000
PSADSSDM EQU   PSADSSF1                                                 01383000
PSADSSMV EQU   PSADSSF1                                                 01384000
PSADSSTS EQU   PSA+816                                                  01385000
PSADSSWK EQU   PSA+812                                                  01386000
PSADSSR3 EQU   PSA+808                                                  01387000
PSADSSR2 EQU   PSA+804                                                  01388000
PSADSSRS EQU   PSA+800                                                  01389000
PSASTOR  EQU   PSA+796                                                  01390000
PSACPUSA EQU   PSA+794                                                  01391000
PSAVSTAP EQU   PSA+792                                                  01392000
PSAWKVAP EQU   PSA+788                                                  01393000
PSAWKRAP EQU   PSA+784                                                  01394000
PSAMCHIC EQU   PSA+783                                                  01395000
PSARV061 EQU   PSA+782                                                  01396000
PSASYMSK EQU   PSA+781                                                  01397000
PSAMCHFL EQU   PSA+780                                                  01398000
PSACR0   EQU   PSA+776                                                  01399000
PSAPSWSV EQU   PSA+768                                                  01400000
PSACLHS  EQU   PSAHLHI                                                  01401000
PSALKR15 EQU   PSALKSA+60                                               01402000
PSALKR14 EQU   PSALKSA+56                                               01403000
PSALKR13 EQU   PSALKSA+52                                               01404000
PSALKR12 EQU   PSALKSA+48                                               01405000
PSALKR11 EQU   PSALKSA+44                                               01406000
PSALKR10 EQU   PSALKSA+40                                               01407000
PSALKR9  EQU   PSALKSA+36                                               01408000
PSALKR8  EQU   PSALKSA+32                                               01409000
PSALKR7  EQU   PSALKSA+28                                               01410000
PSALKR6  EQU   PSALKSA+24                                               01411000
PSALKR5  EQU   PSALKSA+20                                               01412000
PSALKR4  EQU   PSALKSA+16                                               01413000
PSALKR3  EQU   PSALKSA+12                                               01414000
PSALKR2  EQU   PSALKSA+8                                                01415000
PSALKR1  EQU   PSALKSA+4                                                01416000
PSALKR0  EQU   PSALKSA                                                  01417000
PSARV023 EQU   PSACLHT+52                                               01418000
PSALOCAL EQU   PSACLHT+48                                               01419000
PSACMSL  EQU   PSACLHT+44                                               01420000
PSAOPTL  EQU   PSACLHT+40                                               01421000
PSATPACL EQU   PSACLHT+36                                               01422000
PSATPDNL EQU   PSACLHT+32                                               01423000
PSATPNCL EQU   PSACLHT+28                                               01424000
PSAIOSLL EQU   PSACLHT+24                                               01425000
PSAIOSUL EQU   PSACLHT+20                                               01426000
PSAIOSCL EQU   PSACLHT+16                                               01427000
PSAIOSSL EQU   PSACLHT+12                                               01428000
PSASALCL EQU   PSACLHT+8                                                01429000
PSAASML  EQU   PSACLHT+4                                                01430000
PSADISPL EQU   PSACLHT                                                  01431000
PSASRSA  EQU   PSA+636                                                  01432000
PSARV050 EQU   PSA+634                                                  01433000
PSADSSGO EQU   PSA+633                                                  01434000
PSARECUR EQU   PSA+632                                                  01435000
PSAHLHIS EQU   PSA+628                                                  01436000
PSAIPCSA EQU   PSA+624                                                  01437000
@NM00022 EQU   PSA+621                                                  01438000
PSAIPCDM EQU   PSA+620                                                  01439000
PSAIPCD  EQU   PSA+616                                                  01440000
@NM00021 EQU   PSA+613                                                  01441000
PSAIPCRM EQU   PSA+612                                                  01442000
PSAIPCR  EQU   PSA+608                                                  01443000
PSAMCHEX EQU   PSA+600                                                  01444000
PSAMPSW  EQU   PSA+592                                                  01445000
PSAEXPS2 EQU   PSA+584                                                  01446000
PSAEXPS1 EQU   PSA+576                                                  01447000
PSAPIREG EQU   PSA+572                                                  01448000
PSARSREG EQU   PSA+568                                                  01449000
PSAGPREG EQU   PSA+556                                                  01450000
PSARV022 EQU   PSASUP4                                                  01451000
PSARV021 EQU   PSASUP4                                                  01452000
PSARV020 EQU   PSASUP4                                                  01453000
PSARV019 EQU   PSASUP4                                                  01454000
PSARV018 EQU   PSASUP4                                                  01455000
PSARV017 EQU   PSASUP4                                                  01456000
PSARV016 EQU   PSASUP4                                                  01457000
PSARV015 EQU   PSASUP4                                                  01458000
PSARV014 EQU   PSASUP3                                                  01459000
PSARV013 EQU   PSASUP3                                                  01460000
PSARV012 EQU   PSASUP3                                                  01461000
PSARV011 EQU   PSASUP3                                                  01462000
PSASPR   EQU   PSASUP3                                                  01463000
PSAPSREG EQU   PSASUP3                                                  01464000
PSAPI2   EQU   PSASUP3                                                  01465000
PSAIOSUP EQU   PSASUP3                                                  01466000
PSALCR   EQU   PSASUP2                                                  01467000
PSARTM   EQU   PSASUP2                                                  01468000
PSAACR   EQU   PSASUP2                                                  01469000
PSAIPCE2 EQU   PSASUP2                                                  01470000
PSAIPCES EQU   PSASUP2                                                  01471000
PSAIPCEC EQU   PSASUP2                                                  01472000
PSAGTF   EQU   PSASUP2                                                  01473000
PSAIPCRI EQU   PSASUP2                                                  01474000
PSARV063 EQU   PSASUP1                                                  01475000
PSATCTL  EQU   PSASUP1                                                  01476000
PSADISP  EQU   PSASUP1                                                  01477000
PSALOCK  EQU   PSASUP1                                                  01478000
PSAPI    EQU   PSASUP1                                                  01479000
PSAEXT   EQU   PSASUP1                                                  01480000
PSASVC   EQU   PSASUP1                                                  01481000
PSAIO    EQU   PSASUP1                                                  01482000
PSAAOLD  EQU   PSA+548                                                  01483000
PSAANEW  EQU   PSA+544                                                  01484000
PSATOLD  EQU   PSA+540                                                  01485000
PSATNEW  EQU   PSA+536                                                  01486000
PSALCCAR EQU   PSA+532                                                  01487000
PSALCCAV EQU   PSA+528                                                  01488000
PSAPCCAR EQU   PSA+524                                                  01489000
PSAPCCAV EQU   PSA+520                                                  01490000
PSACPULA EQU   PSA+518                                                  01491000
PSACPUPA EQU   PSA+516                                                  01492000
PSAPSA   EQU   PSA+512                                                  01493000
FLCHDEND EQU   PSA+512                                                  01494000
FLCCRSAV EQU   FLCMCLA+280                                              01495000
FLCGRSAV EQU   FLCMCLA+216                                              01496000
FLCFPSAV EQU   FLCMCLA+184                                              01497000
FLCFLA   EQU   FLCMCLA+88                                               01498000
FLCRGNCD EQU   FLCMCLA+84                                               01499000
FLCFSAA  EQU   FLCFSA+1                                                 01500000
@NM00020 EQU   FLCFSA                                                   01501000
@NM00019 EQU   FLCMCLA+72                                               01502000
FLCMCIC  EQU   FLCMCLA+64                                               01503000
@NM00018 EQU   FLCMCLA+20                                               01504000
FLCIOAA  EQU   FLCIOA+1                                                 01505000
@NM00017 EQU   FLCIOA                                                   01506000
@NM00016 EQU   FLCMCLA+15                                               01507000
@NM00015 EQU   FLCMCLA+14                                               01508000
@NM00014 EQU   FLCMCLA+12                                               01509000
FLCLCL   EQU   FLCMCLA+8                                                01510000
FLCIOELA EQU   FLCIOEL+1                                                01511000
@NM00013 EQU   FLCIOEL                                                  01512000
FLCCHNID EQU   FLCMCLA                                                  01513000
@NM00012 EQU   PSA+160                                                  01514000
FLCMTRCD EQU   PSA+157                                                  01515000
@NM00011 EQU   PSA+156                                                  01516000
FLCPERA  EQU   FLCPER+1                                                 01517000
@NM00010 EQU   FLCPER                                                   01518000
@NM00009 EQU   PSA+151                                                  01519000
FLCPERCD EQU   PSA+150                                                  01520000
FLCMCNUM EQU   PSA+149                                                  01521000
@NM00008 EQU   PSA+148                                                  01522000
FLCTEAA  EQU   FLCTEA+1                                                 01523000
@NM00007 EQU   FLCTEA                                                   01524000
PSAPIPC  EQU   PSAPICOD                                                 01525000
PSAPIMC  EQU   PSAPICOD                                                 01526000
PSAPIPER EQU   PSAPICOD                                                 01527000
PSARV049 EQU   FLCPICOD                                                 01528000
FLCPILCB EQU   FLCPIILC                                                 01529000
@NM00006 EQU   FLCPIILC                                                 01530000
@NM00005 EQU   PSAEPPSW                                                 01531000
FLCSVCN  EQU   PSAESPSW+2                                               01532000
FLCSILCB EQU   FLCSVILC                                                 01533000
@NM00004 EQU   FLCSVILC                                                 01534000
@NM00003 EQU   PSAESPSW                                                 01535000
FLCEICOD EQU   PSAEEPSW+2                                               01536000
PSASPAD  EQU   PSAEEPSW                                                 01537000
@NM00002 EQU   PSA+128                                                  01538000
FLCINPSW EQU   PSA+120                                                  01539000
FLCMNPSW EQU   PSA+112                                                  01540000
FLCPNPSW EQU   PSA+104                                                  01541000
FLCSNPSW EQU   PSA+96                                                   01542000
FLCENPSW EQU   PSA+88                                                   01543000
FLCTRACE EQU   PSA+84                                                   01544000
FLCTIMER EQU   PSA+80                                                   01545000
FLCCVT2  EQU   PSA+76                                                   01546000
FLCCAW   EQU   PSA+72                                                   01547000
FLCCSW   EQU   PSA+64                                                   01548000
FLCIOPSW EQU   PSA+56                                                   01549000
FLCMOPSW EQU   PSA+48                                                   01550000
FLCPOPSW EQU   PSA+40                                                   01551000
FLCSOPSW EQU   PSA+32                                                   01552000
FLCEOPSW EQU   PSA+24                                                   01553000
@NM00001 EQU   FLCICCW2+4                                               01554000
FLCICCW1 EQU   FLCROPSW                                                 01555000
FLCIPPSW EQU   FLCRNPSW                                                 01556000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01557000
@RF00078 EQU   @EL00002                                                 01558000
@PB00002 EQU   @EL00001                                                 01559000
@ENDDATA EQU   *                                                        01560000
         END   IKTCAS32,(C'PLS1953',0702,80232)                         01561000
