         TITLE 'IKTCAS52 - TCAS TERMINATION'                            00001000
IKTCAS52 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'IKTCAS52  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @14,@SA00001                                        0001 00014000
         ST    @14,8(,@13)                                         0001 00015000
         LR    @13,@14                                             0001 00016000
*                                                                  0022 00017000
*/********************************************************************/ 00018000
*/*                                                                  */ 00019000
*/* PROCEDURE-                                                       */ 00020000
*/*      IKTCAS52                                                    */ 00021000
*/*                                                                  */ 00022000
*/* FUNCTION-                                                        */ 00023000
*/*      MAINLINE CODE                                               */ 00024000
*/*                                                                  */ 00025000
*/********************************************************************/ 00026000
*                                                                  0022 00027000
*   R8=ADDR(TWAMFL);                /* MAIN TASK FLAG BYTE ADDR      */ 00028000
         LA    R8,TWAMFL(,TWAPTR)                                  0022 00029000
*   RFY                                                            0023 00030000
*    (R14,                                                         0023 00031000
*     R15,                                                         0023 00032000
*     R0,                                                          0023 00033000
*     R1) RSTD                      /* RESTRICT PARA REG             */ 00034000
*         ;                                                        0023 00035000
*   GEN CODE REFS(TTWACS);                                         0024 00036000
*                                      /* TURN ON BYPASS INDICATOR  */  00037000
         L     9,0(8)                  FLAG ADDR                        00038000
CSLOOP   LR    15,9                    LOAD FLAG BITS                   00039000
         O     15,TTWACS               TURN ON BYPASS BIT               00040000
         CS    9,15,0(8)               COMPARE SWAP                     00041000
         BNE   CSLOOP                  DO IT AGAIN IF NOT SUCCESSFUL    00042000
*   RFY                                                            0025 00043000
*    (R14,                                                         0025 00044000
*     R15,                                                         0025 00045000
*     R0,                                                          0025 00046000
*     R1) UNRSTD                    /* UNRESTRI PARA R               */ 00047000
*         ;                                                        0025 00048000
*   IF R9<0 THEN                    /* IF BYPASS BIT ALREADY ON TO 0026 00049000
*                                      PREVENT CONCURRENT EXECUTION     00050000
*                                      OF THIS MODULE                */ 00051000
         LTR   R9,R9                                               0026 00052000
         BM    @RT00026                                            0026 00053000
*     RETURN;                       /* RETURN TO CALLER              */ 00054000
*   ENTCODE=R1;                     /* STORE ENTRY CODE              */ 00055000
         STC   R1,ENTCODE                                          0028 00056000
*   IF ENTCDM='1'B THEN             /* IS DUMP SERVICE BIT ON        */ 00057000
         TM    ENTCDM,B'00000001'                                  0029 00058000
         BNO   @RF00029                                            0029 00059000
*     DO;                           /* YES                           */ 00060000
*       RFY                                                        0031 00061000
*         R1 RSTD;                                                 0031 00062000
*       R1=12;                      /* GET MSG 12-DUMP OPTION MSG    */ 00063000
         LA    R1,12                                               0032 00064000
*       CALL IKTCAS56;              /* CALL MSG ROUTINE              */ 00065000
         L     @15,TWAMSG(,TWAPTR)                                 0033 00066000
         BALR  @14,@15                                             0033 00067000
*       R8=R1+4;                    /* KEEP MSG ADDR                 */ 00068000
         LA    R8,4                                                0034 00069000
         ALR   R8,R1                                               0034 00070000
*       RFY                                                        0035 00071000
*        (R14,                                                     0035 00072000
*         R15,                                                     0035 00073000
*         R0,                                                      0035 00074000
*         R1) RSTD                  /* RESTRICT PARA REG             */ 00075000
*             ;                                                    0035 00076000
*       MSGRPY='';                  /* BLANK REPLY AREA              */ 00077000
         MVI   MSGRPY,C' '                                         0036 00078000
         MVC   MSGRPY+1(7),MSGRPY                                  0036 00079000
*       DO WHILE(MSGRPY^='DUMP'&    /* DO UNTIL VALID REPLY          */ 00080000
*             MSGRPY^='U');                                        0037 00081000
         B     @DE00037                                            0037 00082000
@DL00037 DS    0H                                                  0038 00083000
*         R1=R8;                    /* MSG TEXT ADDR RESTORED        */ 00084000
         LR    R1,R8                                               0038 00085000
*         MSGRPY='';                /* CLEAR MSG REPLY AREA          */ 00086000
         MVI   MSGRPY,C' '                                         0039 00087000
         MVC   MSGRPY+1(7),MSGRPY                                  0039 00088000
*         GEN SETS(MSGECB,MSGRPY);                                 0040 00089000
         XC    MSGECB,MSGECB           CLEAR ECB                        00090000
         WTOR  ,MSGRPY,8,MSGECB,MF=(E,(1))   ASK OP DUMP OR NOT         00091000
         WAIT  ECB=MSGECB              WAIT FOR REPLY                   00092000
*       END;                        /* LOOP                          */ 00093000
@DE00037 CLC   MSGRPY(4),@CC00989                                  0041 00094000
         BE    @DC00037                                            0041 00095000
         CLI   MSGRPY,C'U'                                         0041 00096000
         BNE   @DL00037                                            0041 00097000
@DC00037 DS    0H                                                  0042 00098000
*       IF MSGRPY='DUMP' THEN       /* IF REPLY DUMP                 */ 00099000
         CLC   MSGRPY(4),@CC00989                                  0042 00100000
         BNE   @RF00042                                            0042 00101000
*         DO;                       /* SCHEDULE SDUMP                */ 00102000
*           GEN;                                                   0044 00103000
         SDUMP HDR='TCAS SDUMP',                                      CC00104000
               SDATA=(SQA,ALLPSA,NUC,RGN,LPA,TRT,CSA),                CC00105000
               QUIESCE=YES                                              00106000
*         END;                                                     0045 00107000
*     END;                                                         0046 00108000
*                                                                  0046 00109000
@RF00042 DS    0H                                                  0047 00110000
*   /*****************************************************************/ 00111000
*   /*                                                               */ 00112000
*   /* DETACH ALL SUBTASK CALLING ROUTINE MUST BE MAIN TASK R10 MUST */ 00113000
*   /* CONTAIN THE ADDRESS OF WORK ELEMENT                           */ 00114000
*   /*                                                               */ 00115000
*   /*****************************************************************/ 00116000
*                                                                  0047 00117000
*   IF ENTCDT='1'B THEN             /* IS DETACH SPEC IN ENTRY C     */ 00118000
@RF00029 TM    ENTCDT,B'00000010'                                  0047 00119000
         BNO   @RF00047                                            0047 00120000
*     DO;                           /* YES                           */ 00121000
*       IF R10^=0 THEN              /* CHECK R10 MUST NOT ZERO       */ 00122000
         LTR   R10,R10                                             0049 00123000
         BZ    @RF00049                                            0049 00124000
*         DO;                       /* O.K.                          */ 00125000
*           IF TWASYNQH=R10 THEN    /* R10 MUST POINT FIRST W.E.     */ 00126000
         C     R10,TWASYNQH(,TWAPTR)                               0051 00127000
         BNE   @RF00051                                            0051 00128000
*             DO;                   /* YES                           */ 00129000
*               RFY                                                0053 00130000
*                 WESTD BASED(R10); /* ADDRESSIBILITY OF FIRST WE    */ 00131000
*               IF WECODE1T=TCML THEN/* IS TASK CODE MAIN TASK       */ 00132000
         CLI   WECODE1T(R10),X'01'                                 0054 00133000
         BNE   @RF00054                                            0054 00134000
*                 DO;               /* YES, PERFORM THE FOLLOWING    */ 00135000
*                                                                  0055 00136000
*                   /*************************************************/ 00137000
*                   /*                                               */ 00138000
*                   /* DETACH VTAM INTERFACE SUBTASK                 */ 00139000
*                   /*                                               */ 00140000
*                   /*************************************************/ 00141000
*                                                                  0056 00142000
*                   IF TWAVFL1='1'B&/* IS ATTACH BIT ON              */ 00143000
*                       TWAVFL2='0'B THEN/* NOT ABEND                */ 00144000
         TM    TWAVFL1(TWAPTR),B'10000000'                         0056 00145000
         BNO   @RF00056                                            0056 00146000
         TM    TWAVFL2(TWAPTR),B'01000000'                         0056 00147000
         BNZ   @RF00056                                            0056 00148000
*                     DO;           /* O.K. GO AHEAD DETACH          */ 00149000
*                       RFY                                        0058 00150000
*                         WESTD BASED(ADDR(EOTWE));/* TEMP WE ADDR   */ 00151000
*                       EOTWE=''B;  /* CLEAR END OF TASK WORK ELEMENT*/ 00152000
         XC    EOTWE(12),EOTWE                                     0059 00153000
*                       WECODE1T=TCVI;/* VTAM TASK CODE              */ 00154000
         LA    @07,EOTWE                                           0060 00155000
         MVI   WECODE1T(@07),X'02'                                 0060 00156000
*                       WECODE1F=FCVIDE;/* END OF TASK FUNC CODE     */ 00157000
         MVI   WECODE1F(@07),X'03'                                 0061 00158000
*                       WENEXT=R10; /* Q NEXT WE THE CURRENT ONE     */ 00159000
         ST    R10,WENEXT(,@07)                                    0062 00160000
*                       TWASYNQH=ADDR(EOTWE);/* PUT WE ON THE Q      */ 00161000
         ST    @07,TWASYNQH(,TWAPTR)                               0063 00162000
*                       R8=ADDR(TWAVECB);/* VTAM SUBTASK ECB ADDR    */ 00163000
         LA    R8,TWAVECB(,TWAPTR)                                 0064 00164000
*                       R9=ADDR(TWAVCOMP);/* VTAM SUBTASK COMP ECB A */ 00165000
         LA    R9,TWAVCOMP(,TWAPTR)                                0065 00166000
*                       RFY                                        0066 00167000
*                        (R14,                                     0066 00168000
*                         R15,                                     0066 00169000
*                         R0,                                      0066 00170000
*                         R1) RSTD  /* RESTRICT PARA REG             */ 00171000
*                             ;                                    0066 00172000
*                       GEN CODE;                                  0067 00173000
         POST  (8)                     POST VTAM INT SUBTASK            00174000
         WAIT  ECB=(9)                 WAIT ON EOT COMPLETION           00175000
*                       TWAVCOMP(1:8)='00'X;/* ZERO ECB              */ 00176000
         MVI   TWAVCOMP(TWAPTR),X'00'                              0068 00177000
*                       TWAVFL1='0'B;/* TURN OFF ATTACH BIT          */ 00178000
         NI    TWAVFL1(TWAPTR),B'01111111'                         0069 00179000
*                       R8=ADDR(TWAVTCB);/* VTAM SUBTASK TCB ADDR    */ 00180000
         LA    R8,TWAVTCB(,TWAPTR)                                 0070 00181000
*                       GEN CODE;                                  0071 00182000
         DETACH (8)                    DETACH VTAM SUBTASK              00183000
*                       RFY                                        0072 00184000
*                        (R14,                                     0072 00185000
*                         R15,                                     0072 00186000
*                         R0,                                      0072 00187000
*                         R1) UNRSTD/* UNRESTRI PARA R               */ 00188000
*                             ;                                    0072 00189000
*                     END;          /* DONE                          */ 00190000
*                                                                  0073 00191000
*                   /*************************************************/ 00192000
*                   /*                                               */ 00193000
*                   /* DETACH USER INTERFACE SUBTASK                 */ 00194000
*                   /*                                               */ 00195000
*                   /*************************************************/ 00196000
*                                                                  0074 00197000
*                   IF TWAUFL1='1'B&/* USER INT SUBTASK ATTACHED     */ 00198000
*                       TWAUFL2='0'B THEN/* NOT ABEND                */ 00199000
@RF00056 TM    TWAUFL1(TWAPTR),B'10000000'                         0074 00200000
         BNO   @RF00074                                            0074 00201000
         TM    TWAUFL2(TWAPTR),B'01000000'                         0074 00202000
         BNZ   @RF00074                                            0074 00203000
*                     DO;           /* O.K. DO IT                    */ 00204000
*                       EOTWE=''B;  /* CLEAR END OF TASK WORK ELEMENT*/ 00205000
         XC    EOTWE(12),EOTWE                                     0076 00206000
*                       WECODE1T=TCUI;/* USER SUBTASK                */ 00207000
         LA    @15,EOTWE                                           0077 00208000
         MVI   WECODE1T(@15),X'03'                                 0077 00209000
*                       WECODE1F=FCUIDE;/* EOT FUNCTION CODE         */ 00210000
         MVI   WECODE1F(@15),X'03'                                 0078 00211000
*                       WENEXT=R10; /* R10 THE CURRENT WE ADDR       */ 00212000
         ST    R10,WENEXT(,@15)                                    0079 00213000
*                       TWASYNQH=ADDR(EOTWE);/* Q THE EOT WE         */ 00214000
         ST    @15,TWASYNQH(,TWAPTR)                               0080 00215000
*                       R8=ADDR(TWAUECB);/* USER TASK ECB ADDR       */ 00216000
         LA    R8,TWAUECB(,TWAPTR)                                 0081 00217000
*                       R9=ADDR(TWAUCOMP);/* USER TASK COMP ECB ADDR */ 00218000
         LA    R9,TWAUCOMP(,TWAPTR)                                0082 00219000
*                       RFY                                        0083 00220000
*                        (R14,                                     0083 00221000
*                         R15,                                     0083 00222000
*                         R0,                                      0083 00223000
*                         R1) RSTD  /* RESTRICT PARA REG             */ 00224000
*                             ;                                    0083 00225000
*                       GEN CODE;                                  0084 00226000
         POST  (8)                     POST USER INT SUBTASK            00227000
         WAIT  ECB=(9)                 WAIT FOR EOT COMPLETION          00228000
*                       TWAUCOMP(1:8)='00'X;/* ZERO ECB              */ 00229000
         MVI   TWAUCOMP(TWAPTR),X'00'                              0085 00230000
*                       TWAUFL1='0'B;/* TURN OFF ATTACH BIT          */ 00231000
         NI    TWAUFL1(TWAPTR),B'01111111'                         0086 00232000
*                       R8=ADDR(TWAUTCB);/* USER INT SUBTASK TCB     */ 00233000
         LA    R8,TWAUTCB(,TWAPTR)                                 0087 00234000
*                       GEN CODE;                                  0088 00235000
         DETACH (8)                    DETACH USER INT SUBTASK          00236000
*                       RFY                                        0089 00237000
*                        (R14,                                     0089 00238000
*                         R15,                                     0089 00239000
*                         R0,                                      0089 00240000
*                         R1) UNRSTD/* UNRESTRI PARA R               */ 00241000
*                             ;                                    0089 00242000
*                     END;          /* DONE                          */ 00243000
*                                                                  0090 00244000
*                   /*************************************************/ 00245000
*                   /*                                               */ 00246000
*                   /* DETACH CONSOLE COMMUNICATION SUBTASK          */ 00247000
*                   /*                                               */ 00248000
*                   /*************************************************/ 00249000
*                                                                  0091 00250000
*                   IF TWACFL1='1'B&/* IS CON COMM SUBTASK ATTACH    */ 00251000
*                       TWACFL2='0'B THEN/* IS IT NOT ABENDED        */ 00252000
@RF00074 TM    TWACFL1(TWAPTR),B'10000000'                         0091 00253000
         BNO   @RF00091                                            0091 00254000
         TM    TWACFL2(TWAPTR),B'01000000'                         0091 00255000
         BNZ   @RF00091                                            0091 00256000
*                     DO;           /* ATTACHED AND NOT ABENDED      */ 00257000
*                       EOTWE=''B;  /* CLEAR AREA TO BUILD W.E.      */ 00258000
         XC    EOTWE(12),EOTWE                                     0093 00259000
*                       WECODE1T=TCCI;/* STORE TASK CODE-CON COMM    */ 00260000
         LA    @15,EOTWE                                           0094 00261000
         MVI   WECODE1T(@15),X'04'                                 0094 00262000
*                       WECODE1F=FCCIDE;/* STORE FUNC CODE-EOT       */ 00263000
         MVI   WECODE1F(@15),X'03'                                 0095 00264000
*                       WENEXT=R10; /* R10->CURRENT WE WHICH BECOME     00265000
*                                      NEXT WE                       */ 00266000
         ST    R10,WENEXT(,@15)                                    0096 00267000
*                       TWASYNQH=ADDR(EOTWE);/* PUT EOT WE ON THE  0097 00268000
*                                      QUEUE                         */ 00269000
         ST    @15,TWASYNQH(,TWAPTR)                               0097 00270000
*                       R8=ADDR(TWACECB);/* R8 POINTS TO C.C. ECB    */ 00271000
         LA    R8,TWACECB(,TWAPTR)                                 0098 00272000
*                       R9=ADDR(TWACCOMP);/* R9 POINTS TO COMP ECB   */ 00273000
         LA    R9,TWACCOMP(,TWAPTR)                                0099 00274000
*                       RFY                                        0100 00275000
*                        (R14,                                     0100 00276000
*                         R15,                                     0100 00277000
*                         R0,                                      0100 00278000
*                         R1) RSTD  /* RESTRICT PARA REG             */ 00279000
*                             ;                                    0100 00280000
*                       GEN CODE;                                  0101 00281000
         POST  (8)                     POST CON COMM SUBTASK ECB        00282000
         WAIT  ECB=(9)                 WAIT EOT COMPLETION              00283000
*                       TWACCOMP(1:8)='00'X;/* ZERO ECB              */ 00284000
         MVI   TWACCOMP(TWAPTR),X'00'                              0102 00285000
*                       TWACFL1='0'B;/* TURN ATTACH BIT OFF          */ 00286000
         NI    TWACFL1(TWAPTR),B'01111111'                         0103 00287000
*                       R8=ADDR(TWACTCB);/* R8 POINTS TO TCB ADDR    */ 00288000
         LA    R8,TWACTCB(,TWAPTR)                                 0104 00289000
*                       GEN CODE;                                  0105 00290000
         DETACH (8)                    DETACH CON COMM SUBTASK          00291000
*                       RFY                                        0106 00292000
*                        (R14,                                     0106 00293000
*                         R15,                                     0106 00294000
*                         R0,                                      0106 00295000
*                         R1) UNRSTD/* UNRESTRI PARA R               */ 00296000
*                             ;                                    0106 00297000
*                     END;                                         0107 00298000
*                 END;                                             0108 00299000
@RF00091 DS    0H                                                  0109 00300000
*             END;                                                 0109 00301000
@RF00054 DS    0H                                                  0110 00302000
*         END;                                                     0110 00303000
@RF00051 DS    0H                                                  0111 00304000
*     END;                                                         0111 00305000
@RF00049 DS    0H                                                  0112 00306000
*   TCASTPTR=TWATCAST;              /* TCAST ADDR            @ZA24777*/ 00307000
@RF00047 L     @15,TWATCAST(,TWAPTR)                               0112 00308000
         ST    @15,TCASTPTR                                        0112 00309000
*   IF TCASTPTR^=0 THEN             /* IF TCAS TABLE EXISTS  @ZA35563*/ 00310000
         LTR   @15,@15                                             0113 00311000
         BZ    @RF00113                                            0113 00312000
*     DO;                           /* DEQUEUE WORK ELEMENTS @ZA35563*/ 00313000
*       IF ENTCFR='1'B THEN         /* IS FREE CROSS MEMORY REQUEST     00314000
*                                      SPECIFIED IN ENTRY CODE       */ 00315000
         TM    ENTCFR,B'00000100'                                  0115 00316000
         BNO   @RF00115                                            0115 00317000
*         DO;                       /* YES                           */ 00318000
*           RFY                                                    0117 00319000
*            (R6,                                                  0117 00320000
*             R7) RSTD;             /* NEED MORE REGS                */ 00321000
*           R6=ADDR(TCASTTQH);      /* TERMINAL TRANSFER Q HEADER    */ 00322000
         LA    R6,TCASTTQH(,@15)                                   0118 00323000
*           R9=-1;                  /* -1 MEANS NO MORE QUEUING      */ 00324000
         SLR   R9,R9                                               0119 00325000
         BCTR  R9,0                                                0119 00326000
*           GEN;                                                   0120 00327000
CSLOP    CS   R8,R9,0(R6)            DEQ ALL W.E. FROM Q HEADER         00328000
         BNE CSLOP                LOOP UNTIL DEQ                        00329000
*           RFY                                                    0121 00330000
*             WESTD BASED(R8);      /* ESTABLISH ADDRESSIBILITY      */ 00331000
*           RFY                                                    0122 00332000
*            (R14,                                                 0122 00333000
*             R15,                                                 0122 00334000
*             R0,                                                  0122 00335000
*             R1) RSTD              /* RESTRICT PARA REG             */ 00336000
*                 ;                                                0122 00337000
*           IF R8>0 THEN                                           0123 00338000
         LTR   R8,R8                                               0123 00339000
         BNP   @RF00123                                            0123 00340000
*             DO;                   /* IF THERE IS W.E. QUEUED       */ 00341000
*               DO WHILE(R8^=0);    /* DO UNTIL DONE ALL THE W.E.    */ 00342000
         B     @DE00125                                            0125 00343000
@DL00125 DS    0H                                                  0126 00344000
*                 R6=WEUECB;        /* USER MEMORY ECB ADDR          */ 00345000
         L     R6,WEUECB(,R8)                                      0126 00346000
*                 R7=ADDR(CVTBRET); /* BR14 ADDR IN CVT              */ 00347000
         L     R7,CVTPTR                                           0127 00348000
         LA    R7,CVTBRET(,R7)                                     0127 00349000
*                 R9=WEUASCB;       /* USER ASCB ADDR                */ 00350000
         L     R9,WEUASCB(,R8)                                     0128 00351000
*                 GEN CODE;                                        0129 00352000
         POST (6),ASCB=(9),ERRET=(7) POST USER MEMORY                   00353000
*                 R9=WENEXT;        /* KEEP NEXT W.E. ADDR           */ 00354000
         L     R9,WENEXT(,R8)                                      0130 00355000
*                 R6=WELEN;         /* W.E. LENGTH                   */ 00356000
         LH    R6,WELEN(,R8)                                       0131 00357000
*                 WA1=R8;           /* FREEMAIN ADDR                 */ 00358000
         ST    R8,WA1                                              0132 00359000
*                 GEN CODE REFS(WA1);                              0133 00360000
         FREEMAIN E,LV=(6),A=WA1,SP=231 FREE THE W.E. STORAGE           00361000
*                 R8=R9;            /* RESTORE W.E. ADDR             */ 00362000
         LR    R8,R9                                               0134 00363000
*               END;                /* LOOP AROUND                   */ 00364000
@DE00125 LTR   R8,R8                                               0135 00365000
         BNZ   @DL00125                                            0135 00366000
*             END;                                                 0136 00367000
*         END;                                                     0137 00368000
@RF00123 DS    0H                                                  0138 00369000
*       TCASNACT='1'B;              /* TURN TCASNACT BIT ON  @ZA19908*/ 00370000
@RF00115 L     @05,TCASTPTR                                        0138 00371000
         OI    TCASNACT(@05),B'00001000'                           0138 00372000
*     END;                          /* END TCAST EXISTS      @ZA35563*/ 00373000
*   ELSE                                                           0140 00374000
*     ;                             /* TCAST TABLE DOES NOT EXIST  0140 00375000
*                                                            @ZA35563*/ 00376000
@RF00113 DS    0H                                                  0141 00377000
*   TWAMFL1='0'B;                   /* TURN OFF BY PASS BIT          */ 00378000
         NI    TWAMFL1(TWAPTR),B'01111111'                         0141 00379000
*   END IKTCAS52                                                   0142 00380000
*                                                                  0142 00381000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00382000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00383000
*/*%INCLUDE SYSLIB  (IKTTCAST)                                       */ 00384000
*/*%INCLUDE SYSLIB  (IKTCASWA)                                       */ 00385000
*/*%INCLUDE SYSLIB  (IKTWESTD)                                       */ 00386000
*                                                                  0142 00387000
*       ;                                                          0142 00388000
@EL00001 L     @13,4(,@13)                                         0142 00389000
@EF00001 DS    0H                                                  0142 00390000
@ER00001 LM    @14,@12,12(@13)                                     0142 00391000
         BR    @14                                                 0142 00392000
@DATA    DS    0H                                                       00393000
         DS    0F                                                       00394000
@SA00001 DS    18F                                                      00395000
         DS    0F                                                       00396000
         DS    0D                                                       00397000
TCASTPTR DS    A                                                        00398000
TTWACS   DC    XL4'80000000'                                            00399000
WA1      DS    F                                                        00400000
ENTCODE  DS    FL1                                                      00401000
         ORG   ENTCODE                                                  00402000
@NM00015 DS    BL1                                                      00403000
ENTCFR   EQU   ENTCODE+0                                                00404000
ENTCDT   EQU   ENTCODE+0                                                00405000
ENTCDM   EQU   ENTCODE+0                                                00406000
         ORG   ENTCODE+1                                                00407000
@CC00989 DC    C'DUMP'                                                  00408000
MSGRPY   DS    CL8                                                      00409000
         DS    CL3                                                      00410000
MSGECB   DS    BL4                                                      00411000
EOTWE    DS    CL12                                                     00412000
PATCH    DC    14F'0'                                                   00413000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00414000
@01      EQU   01                                                       00415000
@02      EQU   02                                                       00416000
@03      EQU   03                                                       00417000
@04      EQU   04                                                       00418000
@05      EQU   05                                                       00419000
@06      EQU   06                                                       00420000
@07      EQU   07                                                       00421000
@08      EQU   08                                                       00422000
@09      EQU   09                                                       00423000
@10      EQU   10                                                       00424000
@11      EQU   11                                                       00425000
@12      EQU   12                                                       00426000
@13      EQU   13                                                       00427000
@14      EQU   14                                                       00428000
@15      EQU   15                                                       00429000
TWAPTR   EQU   @11                                                      00430000
R0       EQU   @00                                                      00431000
R1       EQU   @01                                                      00432000
R6       EQU   @06                                                      00433000
R7       EQU   @07                                                      00434000
R8       EQU   @08                                                      00435000
R9       EQU   @09                                                      00436000
R10      EQU   @10                                                      00437000
R14      EQU   @14                                                      00438000
R15      EQU   @15                                                      00439000
R12      EQU   @12                                                      00440000
R13      EQU   @13                                                      00441000
CVTPTR   EQU   16                                                       00442000
CVTMAP   EQU   0                                                        00443000
CVTDAR   EQU   CVTMAP+72                                                00444000
CVTFLGS1 EQU   CVTDAR                                                   00445000
CVTBRET  EQU   CVTMAP+82                                                00446000
CVTDCB   EQU   CVTMAP+116                                               00447000
CVTIERLC EQU   CVTMAP+144                                               00448000
CVTOPTA  EQU   CVTMAP+182                                               00449000
CVTOPTB  EQU   CVTMAP+183                                               00450000
CVTGTF   EQU   CVTMAP+236                                               00451000
CVTGTFST EQU   CVTGTF                                                   00452000
CVTGTFS  EQU   CVTGTFST                                                 00453000
CVTSTATE EQU   CVTGTFST                                                 00454000
CVTTMODE EQU   CVTGTFST                                                 00455000
CVTFORM  EQU   CVTGTFST                                                 00456000
CVTAQAVT EQU   CVTMAP+240                                               00457000
CVTTCMFG EQU   CVTAQAVT                                                 00458000
CVTVOLM2 EQU   CVTMAP+244                                               00459000
CVTTATA  EQU   CVTVOLM2                                                 00460000
CVTTSKS  EQU   CVTTATA                                                  00461000
CVTVOLF2 EQU   CVTTSKS                                                  00462000
CVTTAT   EQU   CVTTATA+1                                                00463000
CVTATER  EQU   CVTMAP+248                                               00464000
CVTEXT1  EQU   CVTMAP+252                                               00465000
CVTPURG  EQU   CVTMAP+260                                               00466000
CVTQMSG  EQU   CVTMAP+268                                               00467000
CVTDMSR  EQU   CVTMAP+272                                               00468000
CVTRSV37 EQU   CVTDMSR                                                  00469000
CVTDMSRF EQU   CVTRSV37                                                 00470000
CVTERPV  EQU   CVTMAP+316                                               00471000
CVTINTLA EQU   CVTMAP+320                                               00472000
CVTAPF   EQU   CVTMAP+324                                               00473000
CVTEXT2  EQU   CVTMAP+328                                               00474000
CVTHJES  EQU   CVTMAP+332                                               00475000
CVTPGSIA EQU   CVTMAP+348                                               00476000
CVTA1F1  EQU   CVTMAP+356                                               00477000
CVTSYSK  EQU   CVTMAP+357                                               00478000
CVTVOLM1 EQU   CVTMAP+380                                               00479000
CVTVOLF1 EQU   CVTVOLM1                                                 00480000
CVTXTNT1 EQU   0                                                        00481000
CVTXTNT2 EQU   0                                                        00482000
CVTDSSV  EQU   CVTXTNT2                                                 00483000
CVTFLGBT EQU   CVTXTNT2+5                                               00484000
CVTQID   EQU   CVTXTNT2+24                                              00485000
CVTRV400 EQU   CVTXTNT2+52                                              00486000
CVTRV409 EQU   CVTXTNT2+53                                              00487000
CVTATCVT EQU   CVTXTNT2+64                                              00488000
CVTRV429 EQU   CVTXTNT2+84                                              00489000
CVTRV438 EQU   CVTXTNT2+85                                              00490000
CVTRV457 EQU   CVTXTNT2+112                                             00491000
CVTRV466 EQU   CVTXTNT2+113                                             00492000
CVTFIX   EQU   0                                                        00493000
CVTRELNO EQU   CVTFIX+252                                               00494000
TCAST    EQU   0                                                        00495000
TCASUSER EQU   TCAST+4                                                  00496000
TCASFLG1 EQU   TCAST+88                                                 00497000
TCASNACT EQU   TCASFLG1                                                 00498000
TCASTTQH EQU   TCAST+104                                                00499000
TWAR     EQU   0                                                        00500000
TWASYNQH EQU   TWAR+4                                                   00501000
TWATCAST EQU   TWAR+20                                                  00502000
TWAMSG   EQU   TWAR+48                                                  00503000
TWAVTCB  EQU   TWAR+52                                                  00504000
TWAUTCB  EQU   TWAR+56                                                  00505000
TWACTCB  EQU   TWAR+60                                                  00506000
TWAVCOMP EQU   TWAR+68                                                  00507000
TWAUCOMP EQU   TWAR+72                                                  00508000
TWACCOMP EQU   TWAR+76                                                  00509000
TWAMFL   EQU   TWAR+80                                                  00510000
TWAMFL1  EQU   TWAMFL                                                   00511000
TWAVFL   EQU   TWAR+81                                                  00512000
TWAVFL1  EQU   TWAVFL                                                   00513000
TWAVFL2  EQU   TWAVFL                                                   00514000
TWAUFL   EQU   TWAR+82                                                  00515000
TWAUFL1  EQU   TWAUFL                                                   00516000
TWAUFL2  EQU   TWAUFL                                                   00517000
TWACFL   EQU   TWAR+83                                                  00518000
TWACFL1  EQU   TWACFL                                                   00519000
TWACFL2  EQU   TWACFL                                                   00520000
TWAM     EQU   TWAR+84                                                  00521000
TWAME    EQU   TWAM+68                                                  00522000
TWAMEI   EQU   TWAME                                                    00523000
TWAV     EQU   TWAR+184                                                 00524000
TWAVE    EQU   TWAV+68                                                  00525000
TWAVEI   EQU   TWAVE                                                    00526000
TWAVI    EQU   TWAR+284                                                 00527000
TWAVECB  EQU   TWAVI                                                    00528000
TWAU     EQU   TWAR+300                                                 00529000
TWAUE    EQU   TWAU+68                                                  00530000
TWAUEI   EQU   TWAUE                                                    00531000
TWAUI    EQU   TWAR+400                                                 00532000
TWAUECB  EQU   TWAUI                                                    00533000
TWAC     EQU   TWAR+408                                                 00534000
TWACE    EQU   TWAC+68                                                  00535000
TWACEI   EQU   TWACE                                                    00536000
TWACI    EQU   TWAR+508                                                 00537000
TWACECB  EQU   TWACI                                                    00538000
WESTD    EQU   0                                                        00539000
WECODE1  EQU   WESTD                                                    00540000
WECODE1T EQU   WECODE1                                                  00541000
WECODE1F EQU   WECODE1+1                                                00542000
WECODE2  EQU   WESTD+2                                                  00543000
WECODE2F EQU   WECODE2+1                                                00544000
WENEXT   EQU   WESTD+4                                                  00545000
WERC     EQU   WESTD+8                                                  00546000
WELEN    EQU   WESTD+10                                                 00547000
WEUASCB  EQU   WESTD+12                                                 00548000
WEVNIB   EQU   WESTD+16                                                 00549000
WEUECB   EQU   WEVNIB                                                   00550000
WETERM   EQU   WESTD+28                                                 00551000
WETMFLG  EQU   WESTD+32                                                 00552000
IKTCAS56 EQU   0                                                        00553000
CVTS01   EQU   CVTPGSIA                                                 00554000
CVTLPDIA EQU   CVTS01+12                                                00555000
CVTDIRST EQU   CVTLPDIA                                                 00556000
CVTSLIDA EQU   CVTS01+24                                                00557000
CVTCTLFG EQU   CVTS01+50                                                00558000
CVTRV210 EQU   CVTS01+424                                               00559000
CVTRV219 EQU   CVTS01+425                                               00560000
CVTRV228 EQU   CVTS01+426                                               00561000
CVTRV237 EQU   CVTS01+427                                               00562000
CVTMFRTR EQU   CVTS01+452                                               00563000
CVTRV262 EQU   CVTS01+468                                               00564000
CVTRV271 EQU   CVTS01+469                                               00565000
CVTRV280 EQU   CVTS01+470                                               00566000
CVTRV289 EQU   CVTS01+471                                               00567000
CVTGSDA  EQU   CVTS01+600                                               00568000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00569000
CVTRV628 EQU   CVTS01+728                                               00570000
CVTRV627 EQU   CVTS01+724                                               00571000
CVTRV626 EQU   CVTS01+720                                               00572000
CVTRV625 EQU   CVTS01+716                                               00573000
CVTRV624 EQU   CVTS01+712                                               00574000
CVTRV623 EQU   CVTS01+708                                               00575000
CVTRV622 EQU   CVTS01+704                                               00576000
CVTRV621 EQU   CVTS01+700                                               00577000
CVTIHASU EQU   CVTS01+696                                               00578000
CVTSUSP  EQU   CVTS01+692                                               00579000
CVTT6SVC EQU   CVTS01+688                                               00580000
CVTCDAL  EQU   CVTS01+684                                               00581000
CVTTCTL  EQU   CVTS01+680                                               00582000
CVTRSUME EQU   CVTS01+676                                               00583000
CVTJTERM EQU   CVTS01+672                                               00584000
CVTASMRM EQU   CVTS01+668                                               00585000
CVTTCASP EQU   CVTS01+664                                               00586000
CVT0PT03 EQU   CVTS01+660                                               00587000
CVT0PT0E EQU   CVTS01+656                                               00588000
CVTRV609 EQU   CVTS01+652                                               00589000
CVTCGK   EQU   CVTS01+648                                               00590000
CVTRAC   EQU   CVTS01+644                                               00591000
CVTRV606 EQU   CVTS01+640                                               00592000
CVTRV605 EQU   CVTS01+636                                               00593000
CVTRV604 EQU   CVTS01+632                                               00594000
CVTEFF02 EQU   CVTS01+628                                               00595000
CVTCBBR  EQU   CVTS01+624                                               00596000
CVTSSCR  EQU   CVTS01+620                                               00597000
CVTEVENT EQU   CVTS01+616                                               00598000
CVTCRCA  EQU   CVTS01+612                                               00599000
CVTTPIO  EQU   CVTS01+608                                               00600000
CVTADV   EQU   CVTS01+604                                               00601000
CVTGSDAB EQU   CVTGSDA                                                  00602000
CVTQV3   EQU   CVTS01+596                                               00603000
CVTQV2   EQU   CVTS01+592                                               00604000
CVTQV1   EQU   CVTS01+588                                               00605000
CVTRPT   EQU   CVTS01+584                                               00606000
CVTSSRB  EQU   CVTS01+580                                               00607000
CVTCSDRL EQU   CVTS01+576                                               00608000
CVTEXP1  EQU   CVTS01+572                                               00609000
CVTRMPMT EQU   CVTS01+568                                               00610000
CVTRMPTT EQU   CVTS01+564                                               00611000
CVTVPSA  EQU   CVTS01+560                                               00612000
CVTVSTOP EQU   CVTS01+556                                               00613000
CVTGTFR8 EQU   CVTS01+552                                               00614000
CVTQUIT  EQU   CVTS01+548                                               00615000
CVTVACR  EQU   CVTS01+544                                               00616000
CVTWTCB  EQU   CVTS01+540                                               00617000
CVTSTPRS EQU   CVTS01+536                                               00618000
CVT0PT02 EQU   CVTS01+532                                               00619000
CVTDARCM EQU   CVTS01+528                                               00620000
CVTIRECM EQU   CVTS01+524                                               00621000
CVTJRECM EQU   CVTS01+520                                               00622000
CVTVEMS0 EQU   CVTS01+516                                               00623000
CVTSPFRR EQU   CVTS01+512                                               00624000
CVTRLSTG EQU   CVTS01+508                                               00625000
CVT0TC0A EQU   CVTS01+504                                               00626000
CVTGMBR  EQU   CVTS01+500                                               00627000
CVTLFRM  EQU   CVTS01+496                                               00628000
CVTRMBR  EQU   CVTS01+492                                               00629000
CVTVIOP  EQU   CVTS01+488                                               00630000
CVTRV307 EQU   CVTS01+486                                               00631000
CVTRV306 EQU   CVTS01+484                                               00632000
CVTRV305 EQU   CVTS01+482                                               00633000
CVTRV304 EQU   CVTS01+480                                               00634000
CVTRV303 EQU   CVTS01+478                                               00635000
CVTRV302 EQU   CVTS01+476                                               00636000
CVTTRCA  EQU   CVTS01+472                                               00637000
CVTRV297 EQU   CVTRV289                                                 00638000
CVTRV296 EQU   CVTRV289                                                 00639000
CVTRV295 EQU   CVTRV289                                                 00640000
CVTRV294 EQU   CVTRV289                                                 00641000
CVTRV293 EQU   CVTRV289                                                 00642000
CVTRV292 EQU   CVTRV289                                                 00643000
CVTRV291 EQU   CVTRV289                                                 00644000
CVTRV290 EQU   CVTRV289                                                 00645000
CVTRV288 EQU   CVTRV280                                                 00646000
CVTRV287 EQU   CVTRV280                                                 00647000
CVTRV286 EQU   CVTRV280                                                 00648000
CVTRV285 EQU   CVTRV280                                                 00649000
CVTRV284 EQU   CVTRV280                                                 00650000
CVTRV283 EQU   CVTRV280                                                 00651000
CVTRV282 EQU   CVTRV280                                                 00652000
CVTRV281 EQU   CVTRV280                                                 00653000
CVTRV279 EQU   CVTRV271                                                 00654000
CVTRV278 EQU   CVTRV271                                                 00655000
CVTRV277 EQU   CVTRV271                                                 00656000
CVTRV276 EQU   CVTRV271                                                 00657000
CVTRV275 EQU   CVTRV271                                                 00658000
CVTRV274 EQU   CVTRV271                                                 00659000
CVTRV273 EQU   CVTRV271                                                 00660000
CVTRV272 EQU   CVTRV271                                                 00661000
CVTRV270 EQU   CVTRV262                                                 00662000
CVTRV269 EQU   CVTRV262                                                 00663000
CVTRV268 EQU   CVTRV262                                                 00664000
CVTRV267 EQU   CVTRV262                                                 00665000
CVTRV266 EQU   CVTRV262                                                 00666000
CVTRV265 EQU   CVTRV262                                                 00667000
CVTRV264 EQU   CVTRV262                                                 00668000
CVTRV263 EQU   CVTRV262                                                 00669000
CVTVFP   EQU   CVTS01+464                                               00670000
CVTVSI   EQU   CVTS01+460                                               00671000
CVTVPSIB EQU   CVTS01+456                                               00672000
CVTMFACT EQU   CVTMFRTR                                                 00673000
CVTMFCTL EQU   CVTS01+448                                               00674000
CVTPVBP  EQU   CVTS01+444                                               00675000
CVTPWI   EQU   CVTS01+440                                               00676000
CVTRV254 EQU   CVTS01+438                                               00677000
CVTRV253 EQU   CVTS01+436                                               00678000
CVTRV252 EQU   CVTS01+434                                               00679000
CVTRV251 EQU   CVTS01+433                                               00680000
CVTRV250 EQU   CVTS01+432                                               00681000
CVTRV249 EQU   CVTS01+431                                               00682000
CVTRV248 EQU   CVTS01+430                                               00683000
CVTRV247 EQU   CVTS01+429                                               00684000
CVTRV246 EQU   CVTS01+428                                               00685000
CVTRV245 EQU   CVTRV237                                                 00686000
CVTRV244 EQU   CVTRV237                                                 00687000
CVTRV243 EQU   CVTRV237                                                 00688000
CVTRV242 EQU   CVTRV237                                                 00689000
CVTRV241 EQU   CVTRV237                                                 00690000
CVTRV240 EQU   CVTRV237                                                 00691000
CVTRV239 EQU   CVTRV237                                                 00692000
CVTRV238 EQU   CVTRV237                                                 00693000
CVTRV236 EQU   CVTRV228                                                 00694000
CVTRV235 EQU   CVTRV228                                                 00695000
CVTRV234 EQU   CVTRV228                                                 00696000
CVTRV233 EQU   CVTRV228                                                 00697000
CVTRV232 EQU   CVTRV228                                                 00698000
CVTRV231 EQU   CVTRV228                                                 00699000
CVTRV230 EQU   CVTRV228                                                 00700000
CVTRV229 EQU   CVTRV228                                                 00701000
CVTRV227 EQU   CVTRV219                                                 00702000
CVTRV226 EQU   CVTRV219                                                 00703000
CVTRV225 EQU   CVTRV219                                                 00704000
CVTRV224 EQU   CVTRV219                                                 00705000
CVTRV223 EQU   CVTRV219                                                 00706000
CVTRV222 EQU   CVTRV219                                                 00707000
CVTRV221 EQU   CVTRV219                                                 00708000
CVTRV220 EQU   CVTRV219                                                 00709000
CVTRV218 EQU   CVTRV210                                                 00710000
CVTRV217 EQU   CVTRV210                                                 00711000
CVTRV216 EQU   CVTRV210                                                 00712000
CVTRV215 EQU   CVTRV210                                                 00713000
CVTRV214 EQU   CVTRV210                                                 00714000
CVTRV213 EQU   CVTRV210                                                 00715000
CVTRV212 EQU   CVTRV210                                                 00716000
CVTRV211 EQU   CVTRV210                                                 00717000
CVTLCCAT EQU   CVTS01+420                                               00718000
CVTPCCAT EQU   CVTS01+416                                               00719000
CVTIPCRP EQU   CVTS01+412                                               00720000
CVTIPCRI EQU   CVTS01+408                                               00721000
CVTIPCDS EQU   CVTS01+404                                               00722000
CVTAIDVT EQU   CVTS01+400                                               00723000
CVTSSAP  EQU   CVTS01+396                                               00724000
CVTEHCIR EQU   CVTS01+392                                               00725000
CVTEHDEF EQU   CVTS01+388                                               00726000
CVTDAIR  EQU   CVTS01+384                                               00727000
CVTPERFM EQU   CVTS01+380                                               00728000
CVT044R2 EQU   CVTS01+376                                               00729000
CVTFETCH EQU   CVTS01+372                                               00730000
CVTRSTWD EQU   CVTS01+368                                               00731000
CVTSPOST EQU   CVTS01+364                                               00732000
CVTIOBP  EQU   CVTS01+360                                               00733000
CVTASMVT EQU   CVTS01+356                                               00734000
CVTRECRQ EQU   CVTS01+352                                               00735000
CVTWSAC  EQU   CVTS01+348                                               00736000
CVTRV149 EQU   CVTS01+344                                               00737000
CVTWSAL  EQU   CVTS01+340                                               00738000
CVTSPSA  EQU   CVTS01+336                                               00739000
CVTGLMN  EQU   CVTS01+332                                               00740000
CVTVEAC0 EQU   CVTS01+328                                               00741000
CVT062R1 EQU   CVTS01+324                                               00742000
CVTRPOST EQU   CVTS01+320                                               00743000
CVTDQIQE EQU   CVTS01+316                                               00744000
CVTCSD   EQU   CVTS01+312                                               00745000
CVTLKRMA EQU   CVTS01+308                                               00746000
CVTRSPIE EQU   CVTS01+304                                               00747000
CVTRENQ  EQU   CVTS01+300                                               00748000
CVTLQCB  EQU   CVTS01+296                                               00749000
CVTFQCB  EQU   CVTS01+292                                               00750000
CVTQCS01 EQU   CVTS01+288                                               00751000
CVTAPFT  EQU   CVTS01+284                                               00752000
CVTPARRL EQU   CVTS01+280                                               00753000
CVTVWAIT EQU   CVTS01+276                                               00754000
CVTGSPL  EQU   CVTS01+272                                               00755000
CVTLSMQ  EQU   CVTS01+268                                               00756000
CVTGSMQ  EQU   CVTS01+264                                               00757000
CVTEXPRO EQU   CVTS01+260                                               00758000
CVTOPCTP EQU   CVTS01+256                                               00759000
CVTSIC   EQU   CVTS01+252                                               00760000
CVTTPIOS EQU   CVTS01+248                                               00761000
CVTRTMS  EQU   CVTS01+244                                               00762000
CVTSDBF  EQU   CVTS01+240                                               00763000
CVTSCBP  EQU   CVTS01+236                                               00764000
CVTSDMP  EQU   CVTS01+232                                               00765000
CVTSV60  EQU   CVTS01+228                                               00766000
CVTRTMCT EQU   CVTS01+224                                               00767000
CVTASCBL EQU   CVTS01+220                                               00768000
CVTASCBH EQU   CVTS01+216                                               00769000
CVTGDA   EQU   CVTS01+212                                               00770000
CVTASVT  EQU   CVTS01+208                                               00771000
CVTVVMDI EQU   CVTS01+204                                               00772000
CVTAQTOP EQU   CVTS01+200                                               00773000
CVTIOSCS EQU   CVTS01+196                                               00774000
CVTSDRM  EQU   CVTS01+192                                               00775000
CVTOPTE  EQU   CVTS01+188                                               00776000
CVTSTXU  EQU   CVTS01+184                                               00777000
CVTQUIS  EQU   CVTS01+180                                               00778000
CVTPARS  EQU   CVTS01+176                                               00779000
CVTS1EE  EQU   CVTS01+172                                               00780000
CVTFRAS  EQU   CVTS01+168                                               00781000
CVTQSAS  EQU   CVTS01+164                                               00782000
CVTCRAS  EQU   CVTS01+160                                               00783000
CVTCRMN  EQU   CVTS01+156                                               00784000
CVTDELCP EQU   CVTS01+152                                               00785000
CVTFRECL EQU   CVTS01+148                                               00786000
CVTGETCL EQU   CVTS01+144                                               00787000
CVTBLDCP EQU   CVTS01+140                                               00788000
CVTAUTHL EQU   CVTS01+136                                               00789000
CVTSCAN  EQU   CVTS01+132                                               00790000
CVTRV144 EQU   CVTS01+130                                               00791000
CVTMAXMP EQU   CVTS01+128                                               00792000
CVTSTCK  EQU   CVTS01+124                                               00793000
CVTRV139 EQU   CVTS01+123                                               00794000
CVTDSSAC EQU   CVTS01+122                                               00795000
CVTRV513 EQU   CVTS01+121                                               00796000
CVTIOSPL EQU   CVTS01+120                                               00797000
CVTPTGT  EQU   CVTS01+116                                               00798000
CVTCSPIE EQU   CVTS01+112                                               00799000
CVTSMFEX EQU   CVTS01+108                                               00800000
CVTOLT0A EQU   CVTS01+104                                               00801000
CVTSRBRT EQU   CVTS01+100                                               00802000
CVTPUTL  EQU   CVTS01+96                                                00803000
CVTASCRL EQU   CVTS01+92                                                00804000
CVTASCRF EQU   CVTS01+88                                                00805000
CVTRV326 EQU   CVTS01+84                                                00806000
CVTRV325 EQU   CVTS01+80                                                00807000
CVTRV324 EQU   CVTS01+76                                                00808000
CVT0VL01 EQU   CVTS01+72                                                00809000
CVTSHRVM EQU   CVTS01+68                                                00810000
CVTRV332 EQU   CVTS01+64                                                00811000
CVTTAS   EQU   CVTS01+60                                                00812000
CVTRSCN  EQU   CVTS01+56                                                00813000
CVTTRAC2 EQU   CVTS01+54                                                00814000
CVTTRACE EQU   CVTS01+52                                                00815000
CVTAPG   EQU   CVTS01+51                                                00816000
CVTSDTRC EQU   CVTCTLFG                                                 00817000
CVTGTRCE EQU   CVTCTLFG                                                 00818000
CVTNOMP  EQU   CVTCTLFG                                                 00819000
CVTRSV79 EQU   CVTCTLFG                                                 00820000
CVTDSTAT EQU   CVTCTLFG                                                 00821000
CVTRSV78 EQU   CVTCTLFG                                                 00822000
CVTRV333 EQU   CVTCTLFG                                                 00823000
CVTRV323 EQU   CVTCTLFG                                                 00824000
CVTSPVLK EQU   CVTS01+49                                                00825000
CVTRSV77 EQU   CVTS01+48                                                00826000
CVTRV331 EQU   CVTS01+44                                                00827000
CVTRV330 EQU   CVTS01+40                                                00828000
CVTRV329 EQU   CVTS01+36                                                00829000
CVTRV328 EQU   CVTS01+32                                                00830000
CVTRV322 EQU   CVTS01+28                                                00831000
CVTSLID  EQU   CVTSLIDA+1                                               00832000
CVTSYLK  EQU   CVTSLIDA                                                 00833000
CVTRV321 EQU   CVTS01+20                                                00834000
CVTRV320 EQU   CVTS01+16                                                00835000
CVTLPDIR EQU   CVTLPDIA+1                                               00836000
CVTRSV69 EQU   CVTDIRST                                                 00837000
CVTRSV68 EQU   CVTDIRST                                                 00838000
CVTRSV67 EQU   CVTDIRST                                                 00839000
CVTRSV66 EQU   CVTDIRST                                                 00840000
CVTRSV65 EQU   CVTDIRST                                                 00841000
CVTRSV64 EQU   CVTDIRST                                                 00842000
CVTRSV63 EQU   CVTDIRST                                                 00843000
CVTDICOM EQU   CVTDIRST                                                 00844000
CVTPVTP  EQU   CVTS01+8                                                 00845000
CVTLPDSR EQU   CVTS01+4                                                 00846000
CVTGETL  EQU   CVTS01                                                   00847000
WELMODE  EQU   WESTD+76                                                 00848000
WEALTC   EQU   WESTD+75                                                 00849000
WEALTR   EQU   WESTD+74                                                 00850000
WEPRMC   EQU   WESTD+73                                                 00851000
WEPRMR   EQU   WESTD+72                                                 00852000
WEBIND   EQU   WESTD+36                                                 00853000
@NM00014 EQU   WESTD+35                                                 00854000
WERUSZO  EQU   WESTD+34                                                 00855000
WERUSZI  EQU   WESTD+33                                                 00856000
@NM00013 EQU   WETMFLG                                                  00857000
WENOSW   EQU   WETMFLG                                                  00858000
WEFLG1   EQU   WETMFLG                                                  00859000
WETMBF   EQU   WETERM+2                                                 00860000
WESUBT   EQU   WETERM+1                                                 00861000
WETMTP   EQU   WETERM                                                   00862000
WELBUF   EQU   WESTD+24                                                 00863000
WEVRPL   EQU   WESTD+20                                                 00864000
WERC2    EQU   WERC+1                                                   00865000
WERC1    EQU   WERC                                                     00866000
WECD2MIF EQU   WECODE2F                                                 00867000
WECD2MAF EQU   WECODE2F                                                 00868000
WECODE2T EQU   WECODE2                                                  00869000
WECDMIF  EQU   WECODE1F                                                 00870000
WECDMAF  EQU   WECODE1F                                                 00871000
TWAEND   EQU   TWAR+536                                                 00872000
TWAWORKE EQU   TWAR+524                                                 00873000
@NM00012 EQU   TWACI+13                                                 00874000
TWACSKIP EQU   TWACI+12                                                 00875000
TWACMODQ EQU   TWACI+8                                                  00876000
TWACSTPQ EQU   TWACI+4                                                  00877000
TWACERRS EQU   TWACE+4                                                  00878000
TWACERA  EQU   TWACEI+1                                                 00879000
TWACEIFC EQU   TWACEI                                                   00880000
TWACRTFC EQU   TWAC+60                                                  00881000
TWACABFC EQU   TWAC+56                                                  00882000
TWACTWA  EQU   TWAC+52                                                  00883000
TWACEWA  EQU   TWAC+4                                                   00884000
TWACID   EQU   TWAC                                                     00885000
TWAUACQH EQU   TWAUI+4                                                  00886000
TWAUERRS EQU   TWAUE+4                                                  00887000
TWAUERA  EQU   TWAUEI+1                                                 00888000
TWAUEIFC EQU   TWAUEI                                                   00889000
TWAURTFC EQU   TWAU+60                                                  00890000
TWAUABFC EQU   TWAU+56                                                  00891000
TWAUTWA  EQU   TWAU+52                                                  00892000
TWAUEWA  EQU   TWAU+4                                                   00893000
TWAUID   EQU   TWAU                                                     00894000
TWAVACQH EQU   TWAVI+12                                                 00895000
TWAVTHQH EQU   TWAVI+8                                                  00896000
TWAVTEQH EQU   TWAVI+4                                                  00897000
TWAVERRS EQU   TWAVE+4                                                  00898000
TWAVERA  EQU   TWAVEI+1                                                 00899000
TWAVEIFC EQU   TWAVEI                                                   00900000
TWAVRTFC EQU   TWAV+60                                                  00901000
TWAVABFC EQU   TWAV+56                                                  00902000
TWAVTWA  EQU   TWAV+52                                                  00903000
TWAVEWA  EQU   TWAV+4                                                   00904000
TWAVID   EQU   TWAV                                                     00905000
TWAMERRS EQU   TWAME+4                                                  00906000
TWAMERA  EQU   TWAMEI+1                                                 00907000
TWAMEIFC EQU   TWAMEI                                                   00908000
TWAMRTFC EQU   TWAM+60                                                  00909000
TWAMABFC EQU   TWAM+56                                                  00910000
TWAMTWA  EQU   TWAM+52                                                  00911000
TWAMEWA  EQU   TWAM+4                                                   00912000
TWAMID   EQU   TWAM                                                     00913000
@NM00011 EQU   TWACFL                                                   00914000
TWACFL4  EQU   TWACFL                                                   00915000
@NM00010 EQU   TWAUFL                                                   00916000
TWAUFL4  EQU   TWAUFL                                                   00917000
TWAUFL3  EQU   TWAUFL                                                   00918000
@NM00009 EQU   TWAVFL                                                   00919000
TWAVFL6  EQU   TWAVFL                                                   00920000
TWAVFL5  EQU   TWAVFL                                                   00921000
TWAVFL4  EQU   TWAVFL                                                   00922000
TWAVFL3  EQU   TWAVFL                                                   00923000
@NM00008 EQU   TWAMFL                                                   00924000
TWAMECB  EQU   TWAR+64                                                  00925000
TWADEQAS EQU   TWAR+44                                                  00926000
TWAEESR  EQU   TWAR+40                                                  00927000
TWAPPSR  EQU   TWAR+36                                                  00928000
TWATCSR  EQU   TWAR+32                                                  00929000
TWATTSR  EQU   TWAR+28                                                  00930000
TWAINIT  EQU   TWAR+24                                                  00931000
TWACSCB  EQU   TWAR+16                                                  00932000
TWAASCB  EQU   TWAR+12                                                  00933000
TWAPASQH EQU   TWAR+8                                                   00934000
TWARSON  EQU   TWAR+2                                                   00935000
TWACOMP  EQU   TWAR                                                     00936000
TCASTEND EQU   TCAST+148                                                00937000
TCASTTYO EQU   TCAST+144                                                00938000
TCAS767O EQU   TCAST+140                                                00939000
TCAS767I EQU   TCAST+136                                                00940000
TCASDUMP EQU   TCAST+132                                                00941000
TCASSCHD EQU   TCAST+128                                                00942000
TCASTPND EQU   TCAST+124                                                00943000
TCASOMJR EQU   TCAST+120                                                00944000
@NM00007 EQU   TCAST+118                                                00945000
TCASBR14 EQU   TCAST+116                                                00946000
TCASATTN EQU   TCAST+112                                                00947000
TCASASCI EQU   TCAST+108                                                00948000
@NM00006 EQU   TCAST+102                                                00949000
@NM00005 EQU   TCAST+100                                                00950000
TCASTGTF EQU   TCAST+96                                                 00951000
TCASASCB EQU   TCAST+92                                                 00952000
TCASFLG4 EQU   TCAST+91                                                 00953000
TCASFLG3 EQU   TCAST+90                                                 00954000
TCASFLG2 EQU   TCAST+89                                                 00955000
TCASCONF EQU   TCASFLG1                                                 00956000
@NM00004 EQU   TCASFLG1                                                 00957000
TCASHAST EQU   TCASFLG1                                                 00958000
TCASVSD  EQU   TCASFLG1                                                 00959000
TCASABND EQU   TCASFLG1                                                 00960000
TCASMDSW EQU   TCASFLG1                                                 00961000
TCASBKMD EQU   TCASFLG1                                                 00962000
TCASLTE  EQU   TCAST+84                                                 00963000
TCASEXIT EQU   TCAST+80                                                 00964000
TCASOQM  EQU   TCAST+76                                                 00965000
TCASIQM  EQU   TCAST+72                                                 00966000
TCASTSB  EQU   TCAST+68                                                 00967000
TCASTTL  EQU   TCAST+64                                                 00968000
TCASWA   EQU   TCAST+60                                                 00969000
TCASFRR  EQU   TCAST+56                                                 00970000
TCASMSGS EQU   TCAST+52                                                 00971000
TCASDATO EQU   TCAST+48                                                 00972000
TCASDATI EQU   TCAST+44                                                 00973000
TCASXECB EQU   TCAST+40                                                 00974000
TCASTID  EQU   TCAST+32                                                 00975000
@NM00003 EQU   TCAST+31                                                 00976000
TCASCHNL EQU   TCAST+30                                                 00977000
TCASCRSZ EQU   TCAST+28                                                 00978000
TCASLBUF EQU   TCAST+24                                                 00979000
TCASHBUF EQU   TCAST+20                                                 00980000
TCASCLSZ EQU   TCAST+18                                                 00981000
TCASRCON EQU   TCAST+16                                                 00982000
TCASACBP EQU   TCAST+8                                                  00983000
TCASUMAX EQU   TCASUSER+2                                               00984000
TCASUSEC EQU   TCASUSER                                                 00985000
TCASID   EQU   TCAST                                                    00986000
CVTLEVL  EQU   CVTRELNO+2                                               00987000
CVTNUMB  EQU   CVTRELNO                                                 00988000
CVTMDL   EQU   CVTFIX+250                                               00989000
@NM00002 EQU   CVTFIX+248                                               00990000
@NM00001 EQU   CVTFIX                                                   00991000
CVTRV482 EQU   CVTXTNT2+128                                             00992000
CVTRV481 EQU   CVTXTNT2+124                                             00993000
CVTRV480 EQU   CVTXTNT2+120                                             00994000
CVTRV479 EQU   CVTXTNT2+118                                             00995000
CVTRV478 EQU   CVTXTNT2+117                                             00996000
CVTRV477 EQU   CVTXTNT2+116                                             00997000
CVTRV476 EQU   CVTXTNT2+115                                             00998000
CVTRV475 EQU   CVTXTNT2+114                                             00999000
CVTRV474 EQU   CVTRV466                                                 01000000
CVTRV473 EQU   CVTRV466                                                 01001000
CVTRV472 EQU   CVTRV466                                                 01002000
CVTRV471 EQU   CVTRV466                                                 01003000
CVTRV470 EQU   CVTRV466                                                 01004000
CVTRV469 EQU   CVTRV466                                                 01005000
CVTRV468 EQU   CVTRV466                                                 01006000
CVTRV467 EQU   CVTRV466                                                 01007000
CVTRV465 EQU   CVTRV457                                                 01008000
CVTRV464 EQU   CVTRV457                                                 01009000
CVTRV463 EQU   CVTRV457                                                 01010000
CVTRV462 EQU   CVTRV457                                                 01011000
CVTRV461 EQU   CVTRV457                                                 01012000
CVTRV460 EQU   CVTRV457                                                 01013000
CVTRV459 EQU   CVTRV457                                                 01014000
CVTRV458 EQU   CVTRV457                                                 01015000
CVTRV456 EQU   CVTXTNT2+108                                             01016000
CVTRV455 EQU   CVTXTNT2+104                                             01017000
CVTRV454 EQU   CVTXTNT2+100                                             01018000
CVTRV453 EQU   CVTXTNT2+96                                              01019000
CVTRV452 EQU   CVTXTNT2+94                                              01020000
CVTRV451 EQU   CVTXTNT2+92                                              01021000
CVTRV450 EQU   CVTXTNT2+90                                              01022000
CVTRV449 EQU   CVTXTNT2+88                                              01023000
CVTRV448 EQU   CVTXTNT2+87                                              01024000
CVTRV447 EQU   CVTXTNT2+86                                              01025000
CVTRV446 EQU   CVTRV438                                                 01026000
CVTRV445 EQU   CVTRV438                                                 01027000
CVTRV444 EQU   CVTRV438                                                 01028000
CVTRV443 EQU   CVTRV438                                                 01029000
CVTRV442 EQU   CVTRV438                                                 01030000
CVTRV441 EQU   CVTRV438                                                 01031000
CVTRV440 EQU   CVTRV438                                                 01032000
CVTRV439 EQU   CVTRV438                                                 01033000
CVTRV437 EQU   CVTRV429                                                 01034000
CVTRV436 EQU   CVTRV429                                                 01035000
CVTRV435 EQU   CVTRV429                                                 01036000
CVTRV434 EQU   CVTRV429                                                 01037000
CVTRV433 EQU   CVTRV429                                                 01038000
CVTRV432 EQU   CVTRV429                                                 01039000
CVTRV431 EQU   CVTRV429                                                 01040000
CVTRV430 EQU   CVTRV429                                                 01041000
CVTRV428 EQU   CVTXTNT2+80                                              01042000
CVTRV427 EQU   CVTXTNT2+76                                              01043000
CVTRV426 EQU   CVTXTNT2+72                                              01044000
CVTRV425 EQU   CVTXTNT2+68                                              01045000
CVTATACT EQU   CVTATCVT                                                 01046000
CVTRV423 EQU   CVTXTNT2+62                                              01047000
CVTRV422 EQU   CVTXTNT2+60                                              01048000
CVTRV421 EQU   CVTXTNT2+58                                              01049000
CVTRV420 EQU   CVTXTNT2+56                                              01050000
CVTRV419 EQU   CVTXTNT2+55                                              01051000
CVTRV418 EQU   CVTXTNT2+54                                              01052000
CVTRV417 EQU   CVTRV409                                                 01053000
CVTRV416 EQU   CVTRV409                                                 01054000
CVTRV415 EQU   CVTRV409                                                 01055000
CVTRV414 EQU   CVTRV409                                                 01056000
CVTRV413 EQU   CVTRV409                                                 01057000
CVTRV412 EQU   CVTRV409                                                 01058000
CVTRV411 EQU   CVTRV409                                                 01059000
CVTRV410 EQU   CVTRV409                                                 01060000
CVTRV408 EQU   CVTRV400                                                 01061000
CVTRV407 EQU   CVTRV400                                                 01062000
CVTRV406 EQU   CVTRV400                                                 01063000
CVTRV405 EQU   CVTRV400                                                 01064000
CVTRV404 EQU   CVTRV400                                                 01065000
CVTRV403 EQU   CVTRV400                                                 01066000
CVTRV402 EQU   CVTRV400                                                 01067000
CVTRV401 EQU   CVTRV400                                                 01068000
CVTICB   EQU   CVTXTNT2+48                                              01069000
CVTSKTA  EQU   CVTXTNT2+44                                              01070000
CVTCCVT  EQU   CVTXTNT2+40                                              01071000
CVTRSV98 EQU   CVTXTNT2+36                                              01072000
CVTRSV97 EQU   CVTXTNT2+34                                              01073000
CVTRSV96 EQU   CVTXTNT2+32                                              01074000
CVTOLTEP EQU   CVTXTNT2+28                                              01075000
CVTQIDA  EQU   CVTQID+1                                                 01076000
CVTRSV95 EQU   CVTQID                                                   01077000
CVTRSV94 EQU   CVTXTNT2+20                                              01078000
CVTRSV93 EQU   CVTXTNT2+16                                              01079000
CVTRSV92 EQU   CVTXTNT2+12                                              01080000
CVTDEBVR EQU   CVTXTNT2+8                                               01081000
CVTRSV91 EQU   CVTXTNT2+6                                               01082000
CVTRSV9H EQU   CVTFLGBT                                                 01083000
CVTRSV9G EQU   CVTFLGBT                                                 01084000
CVTRSV9F EQU   CVTFLGBT                                                 01085000
CVTRSV9E EQU   CVTFLGBT                                                 01086000
CVTRSV9D EQU   CVTFLGBT                                                 01087000
CVTBAH   EQU   CVTFLGBT                                                 01088000
CVTVME   EQU   CVTFLGBT                                                 01089000
CVTNPE   EQU   CVTFLGBT                                                 01090000
CVTNUCLS EQU   CVTXTNT2+4                                               01091000
CVTDSSVA EQU   CVTDSSV+1                                                01092000
CVTRSV89 EQU   CVTDSSV                                                  01093000
CVTRSV88 EQU   CVTXTNT1+8                                               01094000
CVTRSV87 EQU   CVTXTNT1+4                                               01095000
CVTFACHN EQU   CVTXTNT1                                                 01096000
CVTRV488 EQU   CVTMAP+412                                               01097000
CVTRV487 EQU   CVTMAP+408                                               01098000
CVTRV486 EQU   CVTMAP+404                                               01099000
CVTRV485 EQU   CVTMAP+400                                               01100000
CVTACTAP EQU   CVTMAP+396                                               01101000
CVTAUTH  EQU   CVTMAP+392                                               01102000
CVTRV490 EQU   CVTMAP+388                                               01103000
CVTSU    EQU   CVTMAP+384                                               01104000
CVTVOLT1 EQU   CVTVOLM1+1                                               01105000
CVTVOLI1 EQU   CVTVOLF1                                                 01106000
CVTSTOA  EQU   CVTMAP+376                                               01107000
CVTRSV58 EQU   CVTMAP+374                                               01108000
CVTRSV57 EQU   CVTMAP+372                                               01109000
CVTDDCE  EQU   CVTMAP+368                                               01110000
CVTPNWFR EQU   CVTMAP+364                                               01111000
CVTSMF   EQU   CVTMAP+360                                               01112000
CVTSULK  EQU   CVTMAP+358                                               01113000
CVTSLKO  EQU   CVTSYSK                                                  01114000
CVTSLKP  EQU   CVTSYSK                                                  01115000
CVTSLKQ  EQU   CVTSYSK                                                  01116000
CVTSLKR  EQU   CVTSYSK                                                  01117000
CVTRSV56 EQU   CVTSYSK                                                  01118000
CVTRSV55 EQU   CVTSYSK                                                  01119000
CVTRSV54 EQU   CVTSYSK                                                  01120000
CVTRSV53 EQU   CVTSYSK                                                  01121000
CVTRSV52 EQU   CVTA1F1                                                  01122000
CVTRSV51 EQU   CVTA1F1                                                  01123000
CVTRSV50 EQU   CVTA1F1                                                  01124000
CVTRSV49 EQU   CVTA1F1                                                  01125000
CVTRSV48 EQU   CVTA1F1                                                  01126000
CVTRSV47 EQU   CVTA1F1                                                  01127000
CVTSRSW  EQU   CVTA1F1                                                  01128000
CVTPFSW  EQU   CVTA1F1                                                  01129000
CVTPCVT  EQU   CVTMAP+352                                               01130000
CVTRSV46 EQU   CVTMAP+344                                               01131000
CVTRSV45 EQU   CVTMAP+340                                               01132000
CVTRSV44 EQU   CVTMAP+338                                               01133000
CVTRSV43 EQU   CVTMAP+336                                               01134000
CVTHJESA EQU   CVTHJES+1                                                01135000
CVTRSV42 EQU   CVTHJES                                                  01136000
CVTEXT2A EQU   CVTEXT2+1                                                01137000
CVTRSV41 EQU   CVTEXT2                                                  01138000
CVTAPFA  EQU   CVTAPF+1                                                 01139000
CVTRSV40 EQU   CVTAPF                                                   01140000
CVTRV518 EQU   CVTINTLA                                                 01141000
CVTRV517 EQU   CVTERPV                                                  01142000
CVTEORM  EQU   CVTMAP+312                                               01143000
CVTMCHPR EQU   CVTMAP+308                                               01144000
CVTTZ    EQU   CVTMAP+304                                               01145000
CVTJEPS  EQU   CVTMAP+300                                               01146000
CVTJESCT EQU   CVTMAP+296                                               01147000
CVTMODE  EQU   CVTMAP+292                                               01148000
CVTPTRV  EQU   CVTMAP+288                                               01149000
CVTREAL  EQU   CVTMAP+284                                               01150000
CVTRSV39 EQU   CVTMAP+280                                               01151000
CVTRSV38 EQU   CVTMAP+276                                               01152000
CVTDMSRA EQU   CVTDMSR+1                                                01153000
CVTRV634 EQU   CVTDMSRF                                                 01154000
CVTRV633 EQU   CVTDMSRF                                                 01155000
CVTRV632 EQU   CVTDMSRF                                                 01156000
CVTRV631 EQU   CVTDMSRF                                                 01157000
CVTRV630 EQU   CVTDMSRF                                                 01158000
CVTRV629 EQU   CVTDMSRF                                                 01159000
CVTUDUMP EQU   CVTDMSRF                                                 01160000
CVTSDUMP EQU   CVTDMSRF                                                 01161000
CVTQMSGA EQU   CVTQMSG+1                                                01162000
CVTRSV36 EQU   CVTQMSG                                                  01163000
CVTAMFF  EQU   CVTMAP+264                                               01164000
CVTPURGA EQU   CVTPURG+1                                                01165000
CVTRSV35 EQU   CVTPURG                                                  01166000
CVTCBSP  EQU   CVTMAP+256                                               01167000
CVTATERA EQU   CVTATER+1                                                01168000
CVTSYST  EQU   CVTATER                                                  01169000
CVTVOLT2 EQU   CVTTAT                                                   01170000
CVTVOLI2 EQU   CVTVOLF2                                                 01171000
CVTAQAVB EQU   CVTAQAVT+1                                               01172000
CVTRSV34 EQU   CVTTCMFG                                                 01173000
CVTRSV33 EQU   CVTTCMFG                                                 01174000
CVTRSV32 EQU   CVTTCMFG                                                 01175000
CVTRSV31 EQU   CVTTCMFG                                                 01176000
CVTRSV30 EQU   CVTTCMFG                                                 01177000
CVTRSV29 EQU   CVTTCMFG                                                 01178000
CVTLDEV  EQU   CVTTCMFG                                                 01179000
CVTTCRDY EQU   CVTTCMFG                                                 01180000
CVTGTFA  EQU   CVTGTF+1                                                 01181000
CVTRSV27 EQU   CVTGTFST                                                 01182000
CVTRNIO  EQU   CVTGTFST                                                 01183000
CVTUSR   EQU   CVTGTFST                                                 01184000
CVTRV318 EQU   CVTFORM                                                  01185000
CVTRV317 EQU   CVTTMODE                                                 01186000
CVTRV316 EQU   CVTSTATE                                                 01187000
CVTRV315 EQU   CVTGTFS                                                  01188000
CVTGTFAV EQU   CVTGTFS                                                  01189000
CVT0SCR1 EQU   CVTMAP+232                                               01190000
CVTRV515 EQU   CVTMAP+228                                               01191000
CVTRMS   EQU   CVTMAP+224                                               01192000
CVTPATCH EQU   CVTMAP+220                                               01193000
CVTTSCE  EQU   CVTMAP+216                                               01194000
CVTLNKSC EQU   CVTMAP+214                                               01195000
CVTQABST EQU   CVTMAP+212                                               01196000
CVTMDLDS EQU   CVTMAP+208                                               01197000
CVTUSER  EQU   CVTMAP+204                                               01198000
CVTABEND EQU   CVTMAP+200                                               01199000
CVTSMCA  EQU   CVTMAP+196                                               01200000
CVTRSV18 EQU   CVTMAP+192                                               01201000
CVTQLPAQ EQU   CVTMAP+188                                               01202000
CVTQCDSR EQU   CVTMAP+184                                               01203000
CVTVS1B  EQU   CVTOPTB                                                  01204000
CVTVS1A  EQU   CVTOPTB                                                  01205000
CVTFP    EQU   CVTOPTB                                                  01206000
CVTAPTHR EQU   CVTOPTB                                                  01207000
CVTNLOG  EQU   CVTOPTB                                                  01208000
CVTTOD   EQU   CVTOPTB                                                  01209000
CVTCTIMS EQU   CVTOPTB                                                  01210000
CVTPROT  EQU   CVTOPTB                                                  01211000
CVTXPFP  EQU   CVTOPTA                                                  01212000
CVTASCII EQU   CVTOPTA                                                  01213000
CVTRSV13 EQU   CVTOPTA                                                  01214000
CVTRSV12 EQU   CVTOPTA                                                  01215000
CVTNIP   EQU   CVTOPTA                                                  01216000
CVTDDR   EQU   CVTOPTA                                                  01217000
CVTAPR   EQU   CVTOPTA                                                  01218000
CVTCCH   EQU   CVTOPTA                                                  01219000
CVTSNCTR EQU   CVTMAP+180                                               01220000
CVTQMWR  EQU   CVTMAP+176                                               01221000
CVTQOCR  EQU   CVTMAP+172                                               01222000
CVT1EF00 EQU   CVTMAP+168                                               01223000
CVTMZ00  EQU   CVTMAP+164                                               01224000
CVTHEAD  EQU   CVTMAP+160                                               01225000
CVTRSV11 EQU   CVTMAP+156                                               01226000
CVT0PT01 EQU   CVTMAP+152                                               01227000
CVTMSER  EQU   CVTMAP+148                                               01228000
CVTRV516 EQU   CVTIERLC                                                 01229000
CVTILCH  EQU   CVTMAP+140                                               01230000
CVT0DS   EQU   CVTMAP+136                                               01231000
CVTFBOSV EQU   CVTMAP+132                                               01232000
CVTNUCB  EQU   CVTMAP+128                                               01233000
CVTIXAVL EQU   CVTMAP+124                                               01234000
CVTIOQET EQU   CVTMAP+120                                               01235000
CVTDCBA  EQU   CVTMAP+117                                               01236000
CVTMVS2  EQU   CVTDCB                                                   01237000
CVT6DAT  EQU   CVTDCB                                                   01238000
CVT4MPS  EQU   CVTDCB                                                   01239000
CVTRSV09 EQU   CVTDCB                                                   01240000
CVT4MS1  EQU   CVTDCB                                                   01241000
CVT2SPS  EQU   CVTDCB                                                   01242000
CVT1SSS  EQU   CVTDCB                                                   01243000
CVTRSV08 EQU   CVTDCB                                                   01244000
CVTSTB   EQU   CVTMAP+112                                               01245000
CVTQTD00 EQU   CVTMAP+108                                               01246000
CVTQTE00 EQU   CVTMAP+104                                               01247000
CVTCUCB  EQU   CVTMAP+100                                               01248000
CVTSJQ   EQU   CVTMAP+96                                                01249000
CVTPBLDL EQU   CVTMAP+92                                                01250000
CVTTPC   EQU   CVTMAP+88                                                01251000
CVTSVDCB EQU   CVTMAP+84                                                01252000
CVTEXIT  EQU   CVTMAP+80                                                01253000
CVT0FN00 EQU   CVTMAP+76                                                01254000
CVTDARA  EQU   CVTDAR+1                                                 01255000
CVTRSV07 EQU   CVTFLGS1                                                 01256000
CVTRSV06 EQU   CVTFLGS1                                                 01257000
CVTRSV05 EQU   CVTFLGS1                                                 01258000
CVTRSV04 EQU   CVTFLGS1                                                 01259000
CVTRSV03 EQU   CVTFLGS1                                                 01260000
CVTRSV02 EQU   CVTFLGS1                                                 01261000
CVTRSV01 EQU   CVTFLGS1                                                 01262000
CVTDMPLK EQU   CVTFLGS1                                                 01263000
CVTXITP  EQU   CVTMAP+68                                                01264000
CVTZDTAB EQU   CVTMAP+64                                                01265000
CVTMSLT  EQU   CVTMAP+60                                                01266000
CVTDATE  EQU   CVTMAP+56                                                01267000
CVTBTERM EQU   CVTMAP+52                                                01268000
CVTSYSAD EQU   CVTMAP+48                                                01269000
CVTXTLER EQU   CVTMAP+44                                                01270000
CVTILK2  EQU   CVTMAP+40                                                01271000
CVTILK1  EQU   CVTMAP+36                                                01272000
CVTPRLTV EQU   CVTMAP+32                                                01273000
CVTPCNVT EQU   CVTMAP+28                                                01274000
CVT0VL00 EQU   CVTMAP+24                                                01275000
CVTXAPG  EQU   CVTMAP+20                                                01276000
CVTBUF   EQU   CVTMAP+16                                                01277000
CVTJOB   EQU   CVTMAP+12                                                01278000
CVTLINK  EQU   CVTMAP+8                                                 01279000
CVT0EF00 EQU   CVTMAP+4                                                 01280000
CVTTCBP  EQU   CVTMAP                                                   01281000
CVT      EQU   CVTMAP                                                   01282000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01283000
@RT00026 EQU   @EL00001                                                 01284000
@ENDDATA EQU   *                                                        01285000
         END   IKTCAS52,(C'PLS2011',0702,80232)                         01286000
