         TITLE '***** IKTCAS00 - TCAS MAIN TASK *****'                  00001000
IKTCAS00 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'IKTCAS00  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @07,@SA00001                                        0001 00014000
         ST    @07,8(,@13)                                         0001 00015000
         LR    @13,@07                                             0001 00016000
*                                      ADDRESS                       */ 00017000
*                                                                  0051 00018000
*/********************************************************************/ 00019000
*/*                                                                  */ 00020000
*/* PROCEDURE-                                                       */ 00021000
*/*    IKTCAS00                                                      */ 00022000
*/*                                                                  */ 00023000
*/* FUNCTION-                                                        */ 00024000
*/*    MAINLINE CODE                                                 */ 00025000
*/*                                                                  */ 00026000
*/********************************************************************/ 00027000
*                                                                  0051 00028000
*   CALL MLSCPF;                    /* INVOKE START COMMAND        0051 00029000
*                                      PROCESSING                    */ 00030000
         BAL   @14,MLSCPF                                          0051 00031000
*MLSLT:                             /* BEGIN SELECT WE ROUTIN        */ 00032000
*   DO WHILE(TWASYNQH^=0);          /* IS THERE WE                   */ 00033000
MLSLT    B     @DE00052                                            0052 00034000
@DL00052 DS    0H                                                  0053 00035000
*     RFY                                                          0053 00036000
*       WESTD BASED(TWASYNQH);      /* POINTS TO WE                  */ 00037000
*     R10=TWASYNQH;                 /* R10 PTR TO FIRST W.E.         */ 00038000
         L     @07,TWASYNQH(,TWAPTR)                               0054 00039000
         LR    R10,@07                                             0054 00040000
*     IF WECODE1T=TCML THEN         /* IS WE FOR MAINLINE            */ 00041000
         CLI   WECODE1T(@07),X'01'                                 0055 00042000
         BNE   @RF00055                                            0055 00043000
*       DO;                         /* YES                           */ 00044000
*         DO I=1 TO 8 BY 1          /* TRANSLATE FUNC CODE           */ 00045000
*               WHILE(WECODE1F^=FUNCODE(I));/* TO ROUTINE NUMBER     */ 00046000
         LA    I,1                                                 0057 00047000
@DL00057 L     @07,TWASYNQH(,TWAPTR)                               0057 00048000
         LA    @05,FUNCODE-1(I)                                    0057 00049000
         CLC   WECODE1F(1,@07),0(@05)                              0057 00050000
         BE    @DC00057                                            0057 00051000
*         END;                                                     0058 00052000
         AL    I,@CF00062                                          0058 00053000
         C     I,@CF00060                                          0058 00054000
         BNH   @DL00057                                            0058 00055000
@DC00057 DS    0H                                                  0059 00056000
*         IF I>0&I<8 THEN           /* CHECK VALID ROUTINE           */ 00057000
         LTR   I,I                                                 0059 00058000
         BNP   @RF00059                                            0059 00059000
         C     I,@CF00060                                          0059 00060000
         BNL   @RF00059                                            0059 00061000
*           DO;                     /* YES                           */ 00062000
*             MLWA1=WECODE1;        /* RETAIN WE CODE                */ 00063000
         L     @07,TWASYNQH(,TWAPTR)                               0061 00064000
         MVC   MLWA1(2),WECODE1(@07)                               0061 00065000
*             CALL FUNCTION;        /* CALL THE FUNCTION             */ 00066000
         LR    @07,I                                               0062 00067000
         SLA   @07,2                                               0062 00068000
         L     @15,FUNADD-4(@07)                                   0062 00069000
         BALR  @14,@15                                             0062 00070000
*             IF MLWA1^=WECODE1 THEN/* IS SAME WE                    */ 00071000
         L     @07,TWASYNQH(,TWAPTR)                               0063 00072000
         CLC   MLWA1(2),WECODE1(@07)                               0063 00073000
         BNE   @RT00063                                            0063 00074000
*               GOTO MLSLTEND;      /* NO PROCESS AGAIN              */ 00075000
*           END;                                                   0065 00076000
*       END;                                                       0066 00077000
*     ELSE                          /* NOT FOR MAINLINE              */ 00078000
*       IF WECODE1T=TCVI THEN       /* IS IT FOR VTAM INT            */ 00079000
         B     @RC00055                                            0067 00080000
@RF00055 L     @07,TWASYNQH(,TWAPTR)                               0067 00081000
         CLI   WECODE1T(@07),X'02'                                 0067 00082000
         BNE   @RF00067                                            0067 00083000
*         DO;                       /* YES                           */ 00084000
*           R1=ADDR(TWAVECB);       /* GET ECB ADDR                  */ 00085000
         LA    R1,TWAVECB(,TWAPTR)                                 0069 00086000
*           GEN(POST (1));          /* ISSUE POST                    */ 00087000
         POST (1)                                                       00088000
*           GOTO MLWAIT;            /* GOTO WAIT                     */ 00089000
         B     MLWAIT                                              0071 00090000
*         END;                                                     0072 00091000
*       ELSE                        /* NOT VTAM                      */ 00092000
*         IF WECODE1T=TCUI THEN     /* IS IT FOR USER INT            */ 00093000
@RF00067 L     @07,TWASYNQH(,TWAPTR)                               0073 00094000
         CLI   WECODE1T(@07),X'03'                                 0073 00095000
         BNE   @RF00073                                            0073 00096000
*           DO;                     /* YES                           */ 00097000
*             R1=ADDR(TWAUECB);     /* GET ECB ADDR                  */ 00098000
         LA    R1,TWAUECB(,TWAPTR)                                 0075 00099000
*             GEN(POST (1));        /* ISSUE POST                    */ 00100000
         POST (1)                                                       00101000
*             GOTO MLWAIT;          /* GOTO WAIT                     */ 00102000
         B     MLWAIT                                              0077 00103000
*           END;                                                   0078 00104000
*         ELSE                      /* NOT USER                      */ 00105000
*           IF WECODE1T=TCCI THEN   /* IS IT FOR CON COMM            */ 00106000
@RF00073 L     @07,TWASYNQH(,TWAPTR)                               0079 00107000
         CLI   WECODE1T(@07),X'04'                                 0079 00108000
         BNE   @RF00079                                            0079 00109000
*             DO;                   /* YES                           */ 00110000
*               R1=ADDR(TWACECB);   /* GET ECB ADDR                  */ 00111000
         LA    R1,TWACECB(,TWAPTR)                                 0081 00112000
*               GEN(POST (1));      /* ISSUE POST                    */ 00113000
         POST (1)                                                       00114000
*               GOTO MLWAIT;        /* GOTO WAIT                     */ 00115000
         B     MLWAIT                                              0083 00116000
*             END;                                                 0084 00117000
*     R1=ADDR(TWASYNQH);            /* DEQUEUE THE WE                */ 00118000
@RF00079 DS    0H                                                  0085 00119000
@RC00055 LA    R1,TWASYNQH(,TWAPTR)                                0085 00120000
*     GEN;                                                         0086 00121000
CSLOOP   L     9,4(10)             /* GET WENEXT                    */  00122000
         CS    10,9,0(1)           /* CHAIN WITH COMPARE AND SWAP   */  00123000
         BNE   CSLOOP              /* REPEAT IF NOT SUCCESSFUL      */  00124000
*MLSLTEND:                                                         0087 00125000
*   END;                            /* END OF LOOP                   */ 00126000
MLSLTEND DS    0H                                                  0087 00127000
@DE00052 L     @07,TWASYNQH(,TWAPTR)                               0087 00128000
         LTR   @07,@07                                             0087 00129000
         BNZ   @DL00052                                            0087 00130000
*MLWAIT:                            /* WAIT                          */ 00131000
*   IF TWAUACQH^=0&                 /* ADDRESS SPACE QUEUE NOT EMPTY    00132000
*                                                            @ZA34195*/ 00133000
*       ADDR(TWAUECB)->ECBPOSTB='0'B THEN/* USER TASK NOT POSTED YET    00134000
*                                                            @ZA34195*/ 00135000
MLWAIT   L     @07,TWAUACQH(,TWAPTR)                               0088 00136000
         LTR   @07,@07                                             0088 00137000
         BZ    @RF00088                                            0088 00138000
         TM    ECBPOSTB+400(TWAPTR),B'01000000'                    0088 00139000
         BNZ   @RF00088                                            0088 00140000
*     DO;                           /* POST THE USER TASK    @ZA34195*/ 00141000
*       R1=ADDR(TWAUECB);           /* GET ECB ADDRESS       @ZA34195*/ 00142000
         LA    R1,TWAUECB(,TWAPTR)                                 0090 00143000
*       GEN(POST (1));              /* POST USER TASK ECB    @ZA34195*/ 00144000
         POST (1)                                                       00145000
*     END;                          /* END POST USER TASK    @ZA34195*/ 00146000
*   GEN REFS(MLECBSA) SETS(R0,R1);                                 0093 00147000
*                                                                  0093 00148000
@RF00088 DS    0H                                                  0093 00149000
         WAIT  ECBLIST=MLECBSA        WAIT ON ECB LIST                  00150000
*/********************************************************************/ 00151000
*/*        THE FOLLOWING CODE CHECKS IF ANY SUBTASK ABENDED AND      */ 00152000
*/*        ESTAE EXIT ROUTINE DID NOT COMPLETE THE WORK. IN THAT CASE*/ 00153000
*/*        MAIN TASK IS TO BE ABENDED BY CALLING MAINLINE EOT        */ 00154000
*/*        ROUTINE .                                                 */ 00155000
*/********************************************************************/ 00156000
*                                                                  0094 00157000
*   R10=0;                          /* INIT R10 FOR CALLING EOT      */ 00158000
         SLR   R10,R10                                             0094 00159000
*   R8=FCMLAT;                      /* SET CODE TO ABEND             */ 00160000
         LA    R8,146                                              0095 00161000
*   RFY                                                            0096 00162000
*     ECB BASED(ADDR(TWAVCOMP));                                   0096 00163000
*   IF ECBPOSTB='1'B THEN           /* IS VTAM INT SUBTASK ABEND     */ 00164000
         LA    @07,68                                              0097 00165000
         ALR   @07,TWAPTR                                          0097 00166000
         TM    ECBPOSTB(@07),B'01000000'                           0097 00167000
         BNO   @RF00097                                            0097 00168000
*     DO;                           /* YES                           */ 00169000
*       ECBPOSTB='0'B;              /* ZERO ECB                      */ 00170000
         NI    ECBPOSTB(@07),B'10111111'                           0099 00171000
*       R1=ADDR(TWAVTCB);           /* VTAM INT TASK TCB ADDR        */ 00172000
         LA    R1,TWAVTCB(,TWAPTR)                                 0100 00173000
*       GEN;                                                       0101 00174000
         DETACH (R1)      DETACH VTAM INT SUBTASK                       00175000
*       TWAVFL1='0'B;               /* RESET ATTACH BET              */ 00176000
*       TWAVFL2='1'B;               /* SET ABEND BIT ON              */ 00177000
         OI    TWAVFL2(TWAPTR),B'01000000'                         0103 00178000
         NI    TWAVFL1(TWAPTR),B'01111111'                         0103 00179000
*       IF TWAVFL4='0'B THEN        /* DID ESTAE NOT COMPLETE        */ 00180000
         TM    TWAVFL4(TWAPTR),B'00010000'                         0104 00181000
         BNZ   @RF00104                                            0104 00182000
*         DO;                       /* NO                            */ 00183000
*           R9=RCVABE;              /* STORE ABEND REASON CODE       */ 00184000
         LA    R9,48                                               0106 00185000
*           CALL MLEOT;             /* CALL END OF TASK ROUTINE      */ 00186000
         BAL   @14,MLEOT                                           0107 00187000
*         END;                                                     0108 00188000
*       ELSE                                                       0109 00189000
*         TWAVFL4='0'B;             /* RESET ESTAE COMP BIT          */ 00190000
         B     @RC00104                                            0109 00191000
@RF00104 NI    TWAVFL4(TWAPTR),B'11101111'                         0109 00192000
*     END;                                                         0110 00193000
@RC00104 DS    0H                                                  0111 00194000
*   RFY                                                            0111 00195000
*     ECB BASED(ADDR(TWAUCOMP));                                   0111 00196000
@RF00097 DS    0H                                                  0112 00197000
*   IF ECBPOSTB='1'B THEN           /* IS USER INT SUBTASK ABEND     */ 00198000
         LA    @07,72                                              0112 00199000
         ALR   @07,TWAPTR                                          0112 00200000
         TM    ECBPOSTB(@07),B'01000000'                           0112 00201000
         BNO   @RF00112                                            0112 00202000
*     DO;                           /* YES                           */ 00203000
*       ECBPOSTB='0'B;              /* ZERO ECB                      */ 00204000
         NI    ECBPOSTB(@07),B'10111111'                           0114 00205000
*       R1=ADDR(TWAUTCB);           /* USER IN SUBTASK TCB ADDR      */ 00206000
         LA    R1,TWAUTCB(,TWAPTR)                                 0115 00207000
*       GEN;                                                       0116 00208000
         DETACH (R1)      DETACH USER INT SUBTASK                       00209000
*       TWAUFL1='0'B;               /* RESET ATTACH BIT              */ 00210000
*       TWAUFL2='1'B;               /* SET ABEND BIT ON              */ 00211000
         OI    TWAUFL2(TWAPTR),B'01000000'                         0118 00212000
         NI    TWAUFL1(TWAPTR),B'01111111'                         0118 00213000
*       IF TWAUFL4='0'B THEN        /* DID ESTAE NOT COMPLETE        */ 00214000
         TM    TWAUFL4(TWAPTR),B'00010000'                         0119 00215000
         BNZ   @RF00119                                            0119 00216000
*         DO;                       /* NO                            */ 00217000
*           R9=RCUABE;              /* SET ABEND REASON CODE         */ 00218000
         LA    R9,52                                               0121 00219000
*           CALL MLEOT;             /* CALL EOT ROUTINE              */ 00220000
         BAL   @14,MLEOT                                           0122 00221000
*         END;                                                     0123 00222000
*       ELSE                                                       0124 00223000
*         TWAUFL4='0'B;             /* RESET COMP BIT                */ 00224000
         B     @RC00119                                            0124 00225000
@RF00119 NI    TWAUFL4(TWAPTR),B'11101111'                         0124 00226000
*     END;                                                         0125 00227000
@RC00119 DS    0H                                                  0126 00228000
*   RFY                                                            0126 00229000
*     ECB BASED(ADDR(TWACCOMP));                                   0126 00230000
@RF00112 DS    0H                                                  0127 00231000
*   IF ECBPOSTB='1'B THEN           /* IS CON COMM SUBTASK ABEND     */ 00232000
         LA    @07,76                                              0127 00233000
         ALR   @07,TWAPTR                                          0127 00234000
         TM    ECBPOSTB(@07),B'01000000'                           0127 00235000
         BNO   @RF00127                                            0127 00236000
*     DO;                           /* YES                           */ 00237000
*       ECBPOSTB='0'B;              /* ZERO ECB                      */ 00238000
         NI    ECBPOSTB(@07),B'10111111'                           0129 00239000
*       R1=ADDR(TWACTCB);           /* CON COMM SUBTASK TCB ADDR     */ 00240000
         LA    R1,TWACTCB(,TWAPTR)                                 0130 00241000
*       GEN;                                                       0131 00242000
         DETACH (R1)        DETACH CON COMM SUBTASK                     00243000
*       TWACFL1='0'B;               /* RESET ATTACH BIT              */ 00244000
*       TWACFL2='1'B;               /* SET ABEND BIT ON              */ 00245000
         OI    TWACFL2(TWAPTR),B'01000000'                         0133 00246000
         NI    TWACFL1(TWAPTR),B'01111111'                         0133 00247000
*       IF TWACFL4='0'B THEN        /* DID ESTAE NOT COMPLETE        */ 00248000
         TM    TWACFL4(TWAPTR),B'00100000'                         0134 00249000
         BNZ   @RF00134                                            0134 00250000
*         DO;                       /* NO                            */ 00251000
*           R9=RCCABE;              /* SET ABEND REASON CODE         */ 00252000
         LA    R9,56                                               0136 00253000
*           CALL MLEOT;             /* CALL EOT ROUTINE              */ 00254000
         BAL   @14,MLEOT                                           0137 00255000
*         END;                                                     0138 00256000
*       ELSE                                                       0139 00257000
*         TWACFL4='0'B;             /* RESET ESTAE COMP BIT          */ 00258000
         B     @RC00134                                            0139 00259000
@RF00134 NI    TWACFL4(TWAPTR),B'11011111'                         0139 00260000
*     END;                                                         0140 00261000
@RC00134 DS    0H                                                  0141 00262000
*   TWAMECB='00'X;                  /* ZERO ECB                      */ 00263000
@RF00127 XC    TWAMECB+1(3,TWAPTR),TWAMECB+1(TWAPTR)               0141 00264000
         MVI   TWAMECB(TWAPTR),X'00'                               0141 00265000
*   GOTO MLSLT;                     /* GOTO SELECT WE ROUTINE        */ 00266000
         B     MLSLT                                               0142 00267000
*                                                                  0143 00268000
*/********************************************************************/ 00269000
*/*                                                                  */ 00270000
*/*     SUBPROCEDURE-                                                */ 00271000
*/*         MLSCPF                                                   */ 00272000
*/*                                                                  */ 00273000
*/*     FUNCTION-                                                    */ 00274000
*/*         START COMMAND PROCESSING, FRONT END                      */ 00275000
*/*                                                                  */ 00276000
*/********************************************************************/ 00277000
*                                                                  0143 00278000
*MLSCPF:                                                           0143 00279000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0143 00280000
MLSCPF   DS    0H                                                  0144 00281000
*   MLSAVE1=R14;                    /* SAVE RETURN ADDR              */ 00282000
         LR    MLSAVE1,R14                                         0144 00283000
*   GEN CODE REFS(PSALITA) SETS(R0,R1,R14,R15);                    0145 00284000
         MODESET KEY=ZERO,MODE=SUP  GET INTO SUPV STATE KEY ZERO        00285000
         SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,REGS=USE,              CC00286000
               RELATED=('CHECK TCAST')                                  00287000
         SETLOCK OBTAIN,TYPE=CMS,MODE=UNCOND,REGS=USE,                CC00288000
               RELATED=('CHECK TCAST')                                  00289000
*   ASCBPTR=PSAAOLD;                /* ESTABLISH ASCB ADDR           */ 00290000
         L     ASCBPTR,PSAAOLD                                     0146 00291000
*   CSCBPTR=ASCBCSCB;               /* GET CSCB ADDR                 */ 00292000
         L     @05,ASCBCSCB(,ASCBPTR)                              0147 00293000
         ST    @05,CSCBPTR                                         0147 00294000
*   IF CVTTCASP=0 THEN              /* IS TCAST POINTER ZERO         */ 00295000
         L     @05,CVTPTR                                          0148 00296000
         L     @05,CVTTCASP(,@05)                                  0148 00297000
         LTR   @05,@05                                             0148 00298000
         BNZ   @RF00148                                            0148 00299000
*     MLNOTB='1'B;                  /* INDICATE NO TCAS TABLE        */ 00300000
         OI    MLNOTB,B'10000000'                                  0149 00301000
*   ELSE                                                           0150 00302000
*     DO;                           /* THERE IS TABLE                */ 00303000
         B     @RC00148                                            0150 00304000
@RF00148 DS    0H                                                  0151 00305000
*       TCASTPTR=CVTTCASP;          /* TCAST POINTER                 */ 00306000
         L     @05,CVTPTR                                          0151 00307000
         L     @05,CVTTCASP(,@05)                                  0151 00308000
         ST    @05,TCASTPTR                                        0151 00309000
*       IF TCASNACT='1'B THEN       /* IS TCAS ACTIVE                */ 00310000
         TM    TCASNACT(@05),B'00001000'                           0152 00311000
         BNO   @RF00152                                            0152 00312000
*         DO;                       /* NO                            */ 00313000
*           TCASNACT='0'B;          /* INDICATE ACTIVE               */ 00314000
*           TCASABND='0'B;          /* CLEAR ABEND           @YM03216*/ 00315000
         NI    TCASNACT(@05),B'11010111'                           0155 00316000
*           TCASASCB=ASCBPTR;       /* STORE ASCB ADDRESS            */ 00317000
         ST    ASCBPTR,TCASASCB(,@05)                              0156 00318000
*         END;                                                     0157 00319000
*       ELSE                                                       0158 00320000
*         DO;                       /* YES TCAS ACTIVE               */ 00321000
         B     @RC00152                                            0158 00322000
@RF00152 DS    0H                                                  0159 00323000
*           GEN CODE REFS(PSALITA) SETS(R0,R1,R14,R15);            0159 00324000
         SETLOCK RELEASE,TYPE=CMS,REGS=USE,                           CC00325000
               RELATED=('CHECK TCAST')                                  00326000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                         CC00327000
               RELATED=('CHECK TCAST')                                  00328000
         MODESET KEY=NZERO,MODE=PROB  BACK TO ORIGINAL                  00329000
*           R10=0;                  /* NO WE                         */ 00330000
         SLR   R10,R10                                             0160 00331000
*           TWAPTR=0;               /* INDICATE NO TWA               */ 00332000
         SLR   TWAPTR,TWAPTR                                       0161 00333000
*           R9=RCINVS;              /* INVALID START COMM            */ 00334000
         LA    R9,4                                                0162 00335000
*           R8=FCMLET;              /* NORMAL END                    */ 00336000
         LA    R8,145                                              0163 00337000
*           CALL MLEOT;             /* CALL END OF TASK              */ 00338000
         BAL   @14,MLEOT                                           0164 00339000
*         END;                                                     0165 00340000
*     END;                                                         0166 00341000
@RC00152 DS    0H                                                  0167 00342000
*   GEN CODE REFS(PSALITA) SETS(R0,R1,R14,R15);                    0167 00343000
@RC00148 DS    0H                                                  0167 00344000
         SETLOCK RELEASE,TYPE=CMS,REGS=USE,                           CC00345000
               RELATED=('CHECK TCAST')                                  00346000
         SETLOCK RELEASE,TYPE=LOCAL,REGS=USE,                         CC00347000
               RELATED=('CHECK TCAST')                                  00348000
         MODESET KEY=NZERO,MODE=PROB  BACK TO ORIGINAL                  00349000
         LOAD  EP=IKTCAS51         /* LOAD TCAS INIT ROUTINE        */  00350000
         LR    15,0                   BRANCH TO TCAS INIT ROUTINE       00351000
         BALR  14,15                                                    00352000
*   TWAPTR=R1;                      /* STORE TWA ADDRESS             */ 00353000
         LR    TWAPTR,R1                                           0168 00354000
*   MLTCASWA=R1;                    /* STORE TWA ADDRESS             */ 00355000
         ST    R1,MLTCASWA                                         0169 00356000
*   TWAASCB=ASCBPTR;                /* STORE ASCB PTR IN TWA         */ 00357000
         ST    ASCBPTR,TWAASCB(,TWAPTR)                            0170 00358000
*   TWACSCB=CSCBPTR;                /* STORE CSCB PTR IN TWA         */ 00359000
         L     @07,CSCBPTR                                         0171 00360000
         ST    @07,TWACSCB(,TWAPTR)                                0171 00361000
*   MLQECBA=ADDR(TWAMECB);          /* MAIN TASK ECB ADDR            */ 00362000
         LA    @07,TWAMECB(,TWAPTR)                                0172 00363000
         ST    @07,MLQECBA                                         0172 00364000
*   MLVECBA=ADDR(TWAVCOMP);         /* VTAM INT SUBTASK COMP ECB     */ 00365000
         LA    @07,TWAVCOMP(,TWAPTR)                               0173 00366000
         ST    @07,MLVECBA                                         0173 00367000
*   MLUECBA=ADDR(TWAUCOMP);         /* USER INT SUBTASK COMP ECB     */ 00368000
         LA    @07,TWAUCOMP(,TWAPTR)                               0174 00369000
         ST    @07,MLUECBA                                         0174 00370000
*   MLCECBA=ADDR(TWACCOMP);         /* CON COOM SUBTASK COMP ECB     */ 00371000
*                                                                  0175 00372000
         LA    @07,TWACCOMP(,TWAPTR)                               0175 00373000
         STCM  @07,7,MLCECBA                                       0175 00374000
*   /*****************************************************************/ 00375000
*   /*                                                               */ 00376000
*   /* ESTABLISH ESTAE EXIT ROUTINE                                  */ 00377000
*   /*                                                               */ 00378000
*   /*****************************************************************/ 00379000
*                                                                  0176 00380000
*   R8=TWAEESR;                     /* ESTAE EXIT ADDR               */ 00381000
         L     R8,TWAEESR(,TWAPTR)                                 0176 00382000
*   R9=ADDR(TWAM);                  /* ADDR OF PARAMETER WHICH IS IN    00383000
*                                      TWA PASSED TO ESTAE           */ 00384000
         LA    R9,TWAM(,TWAPTR)                                    0177 00385000
*   GEN;                                                           0178 00386000
         ESTAE (R8),PARAM=(R9)                                          00387000
*   IF MLNOTB='1'B THEN             /* IS THERE TCAST                */ 00388000
         TM    MLNOTB,B'10000000'                                  0179 00389000
         BNO   @RF00179                                            0179 00390000
*     DO;                           /* NO TABLE                      */ 00391000
*       CALL IKTCAS53;              /* CALL TCAST CREATE             */ 00392000
         L     @15,TWATCSR(,TWAPTR)                                0181 00393000
         BALR  @14,@15                                             0181 00394000
*       R9=R15;                     /* GET RETURN CODE               */ 00395000
         LR    R9,R15                                              0182 00396000
*       IF R9^=0 THEN               /* CHECK RETURN CODE             */ 00397000
         LTR   R9,R9                                               0183 00398000
         BZ    @RF00183                                            0183 00399000
*         DO;                       /* NOT ZERO                      */ 00400000
*           IF R9=RCINVS THEN       /* IS INVALID START COMM         */ 00401000
         C     R9,@CF01440                                         0185 00402000
         BNE   @RF00185                                            0185 00403000
*             R8=FCMLET;            /* YES GOTO END OF TASK          */ 00404000
         LA    R8,145                                              0186 00405000
*           ELSE                                                   0187 00406000
*             R8=FCMLAT;            /* NO ABEND                      */ 00407000
         B     @RC00185                                            0187 00408000
@RF00185 LA    R8,146                                              0187 00409000
*           R10=0;                  /* NO WE                         */ 00410000
@RC00185 SLR   R10,R10                                             0188 00411000
*           CALL MLEOT;             /* CALL END OF TASK              */ 00412000
         BAL   @14,MLEOT                                           0189 00413000
*         END;                                                     0190 00414000
*       TCASTPTR=R1;                /* STORE TCAST ADDRESS           */ 00415000
@RF00183 ST    R1,TCASTPTR                                         0191 00416000
*     END;                                                         0192 00417000
*   TWATCAST=TCASTPTR;              /* STORE TCAST A IN TWA          */ 00418000
@RF00179 L     @07,TCASTPTR                                        0193 00419000
         ST    @07,TWATCAST(,TWAPTR)                               0193 00420000
*   TCASWA=TWAPTR;                  /* STORE TWA PTR IN TCAST        */ 00421000
         ST    TWAPTR,TCASWA(,@07)                                 0194 00422000
*   TCASXECB=ADDR(TWAVECB);         /* TERMINAL REQ ECB ADDR         */ 00423000
         LA    @05,TWAVECB(,TWAPTR)                                0195 00424000
         ST    @05,TCASXECB(,@07)                                  0195 00425000
*                                                                  0196 00426000
*   /*****************************************************************/ 00427000
*   /*                                                               */ 00428000
*   /* PARAMETER PROCESSING PARAMETER PROCESSING ROUTINE IS CALLED TO*/ 00429000
*   /* PROCESS TCAS PARAMETERS. THE PARAMETERS FROM CIB IF ANY IS    */ 00430000
*   /* PASSED TO P.P. ROUTINE, PARAMETERS FROM PARMLIB ARE READ, AND */ 00431000
*   /* TCAS TABLE IS UPDATED ACCORDING TO THE PARAMETERS. INDICATORS */ 00432000
*   /* ARE SET IN 'MLPMPML' AND PASSED TO THE P.P. ROUTINE.          */ 00433000
*   /*                                                               */ 00434000
*   /*****************************************************************/ 00435000
*                                                                  0196 00436000
*   MLPMPML=MLPMPML&&MLPMPML;       /* ZERO PARAM AREA               */ 00437000
         XC    MLPMPML(8),MLPMPML                                  0196 00438000
*   IF CHCIBP^=0 THEN               /* IS THERE CIB                  */ 00439000
         L     @07,CSCBPTR                                         0197 00440000
         L     @07,CHCIBP(,@07)                                    0197 00441000
         LTR   @07,@07                                             0197 00442000
         BZ    @RF00197                                            0197 00443000
*     DO;                           /* YES                           */ 00444000
*       MLPMSCA=CHCIBP;             /* SET CIB ADDR                  */ 00445000
         ST    @07,MLPMSCA                                         0199 00446000
*       MLPMCIB='1'B;               /* INDICATE SCAN CIB             */ 00447000
*       MLPMSTC='1'B;               /* START COMM INDICATOR          */ 00448000
         OI    MLPMCIB,B'00100001'                                 0201 00449000
*     END;                                                         0202 00450000
*   MLPMRLIB='1'B;                  /* INDICATE READ LIB             */ 00451000
@RF00197 DS    0H                                                  0204 00452000
*   MLPMUPTB='1'B;                  /* UPDATE TCAST                  */ 00453000
*   MLPMWPM='1'B;                   /* WRITE OUTPUT                  */ 00454000
         OI    MLPMRLIB,B'00011100'                                0205 00455000
*   R9=ADDR(MLPMPML);               /* PARAMETER REG                 */ 00456000
         LA    R9,MLPMPML                                          0206 00457000
*   CALL IKTCAS54;                  /* CALL PARM PROC ROUTINE        */ 00458000
         L     @15,TWAPPSR(,TWAPTR)                                0207 00459000
         BALR  @14,@15                                             0207 00460000
*   DO WHILE(MLPMINV='1'B);         /* INVALID PARM PASSED           */ 00461000
         B     @DE00208                                            0208 00462000
@DL00208 DS    0H                                                  0209 00463000
*     R1=4;                         /* MSG 4                         */ 00464000
         LA    R1,4                                                0209 00465000
*     CALL MSGBLK;                  /* CALL MSG BLOCK GET M          */ 00466000
         L     @15,TWAMSG(,TWAPTR)                                 0210 00467000
         BALR  @14,@15                                             0210 00468000
*     R8=R1->MLWA3;                 /* GET LENGTH                    */ 00469000
         L     R8,MLWA3(,R1)                                       0211 00470000
*     R1=R1+4;                      /* SKIP LEN FIELD                */ 00471000
         AL    R1,@CF00080                                         0212 00472000
*     MSGTXT=R1->AREA(1:R8);        /* MOVE MSG OUT                  */ 00473000
         MVI   MSGTXT+1,C' '                                       0213 00474000
         MVC   MSGTXT+2(98),MSGTXT+1                               0213 00475000
         LR    @07,R8                                              0213 00476000
         BCTR  @07,0                                               0213 00477000
         EX    @07,@SM01694                                        0213 00478000
*     MSGRPY='';                    /* BLANK MSG REPLY A             */ 00479000
         MVI   MSGRPY,C' '                                         0214 00480000
         MVC   MSGRPY+1(47),MSGRPY                                 0214 00481000
*     GEN;                                                         0215 00482000
         XC    MSGECB,MSGECB          ZERO ECB                          00483000
         WTOR  ,MSGRPY,48,MSGECB,MF=(E,MSGTXT) SEND INVALID MSG         00484000
         WAIT  ECB=MSGECB              WAIT FOR REPLY                   00485000
*     MLPMCIB='0'B;                 /* TURN OFF CIB SCAN BIT         */ 00486000
*     MLPMBUF='1'B;                 /* TURN ON BUFFER SCAN           */ 00487000
         OI    MLPMBUF,B'00000010'                                 0217 00488000
         NI    MLPMCIB,B'11111110'                                 0217 00489000
*     MLPMINV='0'B;                 /* ZERO INVALID BIT              */ 00490000
         NI    MLPMINV,B'10111111'                                 0218 00491000
*     MLPMSCA=ADDR(MSGRPY);         /* SET SCAN THE REPLY            */ 00492000
         LA    @07,MSGRPY                                          0219 00493000
         ST    @07,MLPMSCA                                         0219 00494000
*     CALL IKTCAS54;                /* SCAN AGAIN                    */ 00495000
         L     @15,TWAPPSR(,TWAPTR)                                0220 00496000
         BALR  @14,@15                                             0220 00497000
*   END;                                                           0221 00498000
@DE00208 TM    MLPMINV,B'01000000'                                 0221 00499000
         BO    @DL00208                                            0221 00500000
*   IF MLPMUZ='1'B THEN             /* USERMAX=0                     */ 00501000
         TM    MLPMUZ,B'00010000'                                  0222 00502000
         BNO   @RF00222                                            0222 00503000
*     MLUZ='1'B;                    /* SET INDICATOR                 */ 00504000
         OI    MLUZ,B'01000000'                                    0223 00505000
*/********************************************************************/ 00506000
*/*    CREATE SYNCHRONOUS QUEUE  AND THE WE   TO START TCAS          */ 00507000
*/********************************************************************/ 00508000
*                                                                  0224 00509000
*   STCGSL=8*LENGTH(WESTD);         /* KEEP RECORD OF LENGTH @ZM42690*/ 00510000
@RF00222 LA    STCGSL,672                                          0224 00511000
*   R8=STCGSL;                      /* GETMAIN AREA LENGTH           */ 00512000
         LR    R8,STCGSL                                           0225 00513000
*   GEN CODE SETS(STCGSP,STCGSPN);                                 0226 00514000
         GETMAIN R,LV=(8),SP=1     GETMAIN FOR STORAGE OF WE            00515000
         ST    1,STCGSP                STORE ADDR                       00516000
         ST    1,STCGSPN ;                                              00517000
*   RFY                                                            0227 00518000
*     AREA BASED(R1);               /* R1 PTR GETMAIN AREA           */ 00519000
*   AREA(1:R8)=AREA(1:R8)&&AREA(1:R8);/* ZERO GETMAIN AREA           */ 00520000
         LR    @07,R8                                              0228 00521000
         BCTR  @07,0                                               0228 00522000
         EX    @07,@SX01697                                        0228 00523000
*/********************************************************************/ 00524000
*/*          CREATE  WE  FOR  ATTACH USER INTERFACE                  */ 00525000
*/********************************************************************/ 00526000
*                                                                  0229 00527000
*   RFY                                                            0229 00528000
*     WESTD BASED(STCGSPN);         /* GET WE                        */ 00529000
*   WECODE1T=TCML;                  /* TASK CODE MAINLINE            */ 00530000
         L     @07,STCGSPN                                         0230 00531000
         MVI   WECODE1T(@07),X'01'                                 0230 00532000
*   WECODE1F=FCMLAU;                /* FUNC CODE ATT USER            */ 00533000
         MVI   WECODE1F(@07),X'60'                                 0231 00534000
*   WECODE2T=TCML;                  /* REQUESTOR TASK CODE           */ 00535000
         MVI   WECODE2T(@07),X'01'                                 0232 00536000
*   WECODE2F=FCMLAT;                /* SECOND DESTINATION IF FAIL    */ 00537000
         MVI   WECODE2F(@07),X'92'                                 0233 00538000
*   WELEN=LENGTH(WESTD);            /* LENGTH                @ZM42690*/ 00539000
         MVC   WELEN(2,@07),@CH01676                               0234 00540000
*/********************************************************************/ 00541000
*/*    CREATE ADDRESS SPACE TERMINATION WE IF REQUIRED               */ 00542000
*/********************************************************************/ 00543000
*                                                                  0235 00544000
*   IF MLNOTB='0'B THEN             /* IS THERE TCAST                */ 00545000
         TM    MLNOTB,B'10000000'                                  0235 00546000
         BNZ   @RF00235                                            0235 00547000
*     DO;                           /* YES THERE IS                  */ 00548000
*       IF TCASUSEC^=0 THEN         /* IS USER COUNT ZERO            */ 00549000
         L     @07,TCASTPTR                                        0237 00550000
         LH    @07,TCASUSEC(,@07)                                  0237 00551000
         LTR   @07,@07                                             0237 00552000
         BZ    @RF00237                                            0237 00553000
*         DO;                       /* NO                            */ 00554000
*           CVD(TCASUSEC,MLWAD);    /* CONVERT TO DECIMAL            */ 00555000
         CVD   @07,MLWAD                                           0239 00556000
*           R1=1;                   /* MSG 1                         */ 00557000
         LA    R1,1                                                0240 00558000
*           CALL MSGBLK;            /* CALL MSG BLOCK GET M          */ 00559000
         L     @15,TWAMSG(,TWAPTR)                                 0241 00560000
         BALR  @14,@15                                             0241 00561000
*           R8=R1->MLWA3;           /* GET LENGTH                    */ 00562000
         L     R8,MLWA3(,R1)                                       0242 00563000
*           R1=R1+4;                /* SKIP LEN FIELD                */ 00564000
         AL    R1,@CF00080                                         0243 00565000
*           MSGTXT=R1->AREA(1:R8);  /* MOVE MSG OUT                  */ 00566000
         MVI   MSGTXT+1,C' '                                       0244 00567000
         MVC   MSGTXT+2(98),MSGTXT+1                               0244 00568000
         LR    @07,R8                                              0244 00569000
         BCTR  @07,0                                               0244 00570000
         EX    @07,@SM01694                                        0244 00571000
*           MSGRPY='';              /* BLANK MSG REPLY A             */ 00572000
         MVI   MSGRPY,C' '                                         0245 00573000
         MVC   MSGRPY+1(47),MSGRPY                                 0245 00574000
*           GEN;                                                   0246 00575000
         UNPK  MSGTXT+21(4),MLWAD(8)    UNPACK CURRENT # OF USERS       00576000
         OI    MSGTXT+24,X'F0'     PRINTABLE LAST CHAR                  00577000
         XC    MSGECB,MSGECB          ZERO ECB                          00578000
         WTOR  ,MSGRPY,48,MSGECB,MF=(E,MSGTXT)   SEND MSG IKT001D       00579000
         WAIT  ECB=MSGECB              WAIT FOR REPLY                   00580000
*           MLPMPML=MLPMPML&&MLPMPML;/* CLEAR AREA                   */ 00581000
         XC    MLPMPML(8),MLPMPML                                  0247 00582000
*           MLPMBUF='1'B;           /* SCAN BUFFER                   */ 00583000
         OI    MLPMBUF,B'00000010'                                 0248 00584000
*           MLPMSCA=ADDR(MSGRPY);   /* SET SCAN THE REPLY            */ 00585000
         LA    @07,MSGRPY                                          0249 00586000
         ST    @07,MLPMSCA                                         0249 00587000
*           R9=ADDR(MLPMPML);       /* PARAM POINTER                 */ 00588000
         LA    R9,MLPMPML                                          0250 00589000
*           CALL IKTCAS54;          /* TO SCAN THE REPLY             */ 00590000
         L     @15,TWAPPSR(,TWAPTR)                                0251 00591000
         BALR  @14,@15                                             0251 00592000
*           DO WHILE(MLPMFL2C^=PMIGN&/* DO UNTILL                    */ 00593000
*                 MLPMFL2C^=PMSIC&  /* RIGHT                         */ 00594000
*                 MLPMFL2C^=PMFS);  /* REPLY                         */ 00595000
         B     @DE00252                                            0252 00596000
@DL00252 DS    0H                                                  0253 00597000
*             R1=4;                 /* MSG 4                         */ 00598000
         LA    R1,4                                                0253 00599000
*             CALL MSGBLK;          /* CALL MSG BLOCK GET M          */ 00600000
         L     @15,TWAMSG(,TWAPTR)                                 0254 00601000
         BALR  @14,@15                                             0254 00602000
*             R8=R1->MLWA3;         /* GET LENGTH                    */ 00603000
         L     R8,MLWA3(,R1)                                       0255 00604000
*             R1=R1+4;              /* SKIP LEN FIELD                */ 00605000
         AL    R1,@CF00080                                         0256 00606000
*             MSGTXT=R1->AREA(1:R8);/* MOVE MSG OUT                  */ 00607000
         MVI   MSGTXT+1,C' '                                       0257 00608000
         MVC   MSGTXT+2(98),MSGTXT+1                               0257 00609000
         LR    @07,R8                                              0257 00610000
         BCTR  @07,0                                               0257 00611000
         EX    @07,@SM01694                                        0257 00612000
*             MSGRPY='';            /* BLANK                         */ 00613000
         MVI   MSGRPY,C' '                                         0258 00614000
         MVC   MSGRPY+1(47),MSGRPY                                 0258 00615000
*             GEN CODE;                                            0259 00616000
         XC    MSGECB,MSGECB          ZERO ECB                          00617000
         WTOR  ,MSGRPY,48,MSGECB,MF=(E,MSGTXT) SEND INVALID MSG         00618000
         WAIT  ECB=MSGECB              WAIT FOR REPLY                   00619000
*             MLPMSCA=ADDR(MSGRPY); /* STORE SCAN ADDR               */ 00620000
         LA    @07,MSGRPY                                          0260 00621000
         ST    @07,MLPMSCA                                         0260 00622000
*             MLPMFL2='00000000'B;  /* ZERO INDICATORS               */ 00623000
         MVI   MLPMFL2,B'00000000'                                 0261 00624000
*             CALL IKTCAS54;        /* CALL SCAN ROUTINE             */ 00625000
         L     @15,TWAPPSR(,TWAPTR)                                0262 00626000
         BALR  @14,@15                                             0262 00627000
*           END;                                                   0263 00628000
@DE00252 CLI   MLPMFL2C,1                                          0263 00629000
         BE    @DC00252                                            0263 00630000
         CLI   MLPMFL2C,2                                          0263 00631000
         BE    @DC00252                                            0263 00632000
         CLI   MLPMFL2C,4                                          0263 00633000
         BNE   @DL00252                                            0263 00634000
@DC00252 DS    0H                                                  0264 00635000
*           IF MLPMFS='1'B|MLPMSIC='1'B THEN/* IF SIC OR FSTOP       */ 00636000
         TM    MLPMFS,B'00000110'                                  0264 00637000
         BZ    @RF00264                                            0264 00638000
*             DO;                                                  0265 00639000
*               EVAL(STCGSPN+WELEN)->WESTD=WESTD;/* COPY CURRENT   0266 00640000
*                                      VALUE TO NEXT W.E.            */ 00641000
         L     @07,STCGSPN                                         0266 00642000
         LH    @05,WELEN(,@07)                                     0266 00643000
         LR    @04,@07                                             0266 00644000
         ALR   @04,@05                                             0266 00645000
         MVC   WESTD(84,@04),WESTD(@07)                            0266 00646000
*               WENEXT=STCGSPN+WELEN;/* NEXT WE ADDR                 */ 00647000
         ALR   @05,@07                                             0267 00648000
         ST    @05,WENEXT(,@07)                                    0267 00649000
*               STCGSPN=STCGSPN+WELEN;/* UPDATE POSITION             */ 00650000
         ST    @05,STCGSPN                                         0268 00651000
*               WECODE1T=TCUI;      /* TASK CODE USER INT            */ 00652000
         MVI   WECODE1T(@05),X'03'                                 0269 00653000
*               IF MLPMFS='1'B THEN /* IS FSTOP SPECIFIED            */ 00654000
         TM    MLPMFS,B'00000100'                                  0270 00655000
         BNO   @RF00270                                            0270 00656000
*                 WECODE1F=FCUITM;  /* FSTOP FUNCTION CODE           */ 00657000
         MVI   WECODE1F(@05),X'22'                                 0271 00658000
*               ELSE                                               0272 00659000
*                 WECODE1F=FCUITC;  /* SIC FUNCTION CODE             */ 00660000
         B     @RC00270                                            0272 00661000
@RF00270 L     @07,STCGSPN                                         0272 00662000
         MVI   WECODE1F(@07),X'21'                                 0272 00663000
*               WECODE2T=TCML;      /* REQUESTOR TASK CODE           */ 00664000
@RC00270 L     @07,STCGSPN                                         0273 00665000
         MVI   WECODE2T(@07),X'01'                                 0273 00666000
*               WECODE2F=FCMLSC;    /* REQUESTOR FUNC CODE           */ 00667000
         MVI   WECODE2F(@07),X'10'                                 0274 00668000
*             END;                                                 0275 00669000
*         END;                                                     0276 00670000
@RF00264 DS    0H                                                  0277 00671000
*     END;                                                         0277 00672000
*                                                                  0277 00673000
@RF00237 DS    0H                                                  0278 00674000
*/********************************************************************/ 00675000
*/*          CREATE  WE  FOR  ATTACH VTAM INTERFACE                  */ 00676000
*/********************************************************************/ 00677000
*                                                                  0278 00678000
*   EVAL(STCGSPN+WELEN)->WESTD=WESTD;/* COPY CURRENT VALUE TO NEXT 0278 00679000
*                                      W.E.                          */ 00680000
@RF00235 L     @07,STCGSPN                                         0278 00681000
         LH    @05,WELEN(,@07)                                     0278 00682000
         LR    @04,@07                                             0278 00683000
         ALR   @04,@05                                             0278 00684000
         MVC   WESTD(84,@04),WESTD(@07)                            0278 00685000
*   WENEXT=STCGSPN+WELEN;           /* NEXT WE ADDR                  */ 00686000
         ALR   @05,@07                                             0279 00687000
         ST    @05,WENEXT(,@07)                                    0279 00688000
*   STCGSPN=STCGSPN+WELEN;          /* UPDATE POSITION               */ 00689000
         ST    @05,STCGSPN                                         0280 00690000
*   WECODE1T=TCML;                  /* TASK CODE MAINLINE            */ 00691000
         MVI   WECODE1T(@05),X'01'                                 0281 00692000
*   WECODE1F=FCMLAV;                /* FUNC CODE ATT VTAM            */ 00693000
         MVI   WECODE1F(@05),X'50'                                 0282 00694000
*   WECODE2F=FCMLAT;                /* SECOND DESTINATION IF FAIL    */ 00695000
         MVI   WECODE2F(@05),X'92'                                 0283 00696000
*/********************************************************************/ 00697000
*/*          CREATE WE FOR ATTACH CONSOLE COMMUNICATION INTERFACE    */ 00698000
*/********************************************************************/ 00699000
*                                                                  0284 00700000
*   EVAL(STCGSPN+WELEN)->WESTD=WESTD;/* COPY CURRENT VALUE TO NEXT 0284 00701000
*                                      W.E.                          */ 00702000
         LH    @07,WELEN(,@05)                                     0284 00703000
         LR    @04,@05                                             0284 00704000
         ALR   @04,@07                                             0284 00705000
         MVC   WESTD(84,@04),WESTD(@05)                            0284 00706000
*   WENEXT=STCGSPN+WELEN;           /* NEXT WE ADDR                  */ 00707000
         ALR   @07,@05                                             0285 00708000
         ST    @07,WENEXT(,@05)                                    0285 00709000
*   STCGSPN=STCGSPN+WELEN;          /* UPDATE POSITION               */ 00710000
         ST    @07,STCGSPN                                         0286 00711000
*   WECODE1T=TCML;                  /* TASK CODE MAINLINE            */ 00712000
         MVI   WECODE1T(@07),X'01'                                 0287 00713000
*   WECODE1F=FCMLAC;                /* FUNC CODE ATT CON COM         */ 00714000
         MVI   WECODE1F(@07),X'70'                                 0288 00715000
*/********************************************************************/ 00716000
*/*          CREATE  WE  FOR  STARTING  LOGON                        */ 00717000
*/********************************************************************/ 00718000
*                                                                  0289 00719000
*   IF MLUZ='0'B THEN               /* IS USERMAX SET TO ZERO        */ 00720000
         TM    MLUZ,B'01000000'                                    0289 00721000
         BNZ   @RF00289                                            0289 00722000
*     DO;                           /* NO, TO START LOGON            */ 00723000
*       EVAL(STCGSPN+WELEN)->WESTD=WESTD;/* COPY CURRENT VALUE TO  0291 00724000
*                                      NEXT W.E.                     */ 00725000
         LH    @05,WELEN(,@07)                                     0291 00726000
         LR    @04,@07                                             0291 00727000
         ALR   @04,@05                                             0291 00728000
         MVC   WESTD(84,@04),WESTD(@07)                            0291 00729000
*       WENEXT=STCGSPN+WELEN;       /* NEXT WE ADDR                  */ 00730000
         ALR   @05,@07                                             0292 00731000
         ST    @05,WENEXT(,@07)                                    0292 00732000
*       STCGSPN=STCGSPN+WELEN;      /* UPDATE POSITION               */ 00733000
         ST    @05,STCGSPN                                         0293 00734000
*       WECODE1T=TCVI;              /* TASK CODE VTAM                */ 00735000
         MVI   WECODE1T(@05),X'02'                                 0294 00736000
*       WECODE1F=FCVIAS;            /* FUNC CODE START LOGON         */ 00737000
         MVI   WECODE1F(@05),X'14'                                 0295 00738000
*       WECODE2F=FCMLSC;            /* REQUESTOR FUNC CODE           */ 00739000
         MVI   WECODE2F(@05),X'10'                                 0296 00740000
*     END;                                                         0297 00741000
*                                                                  0297 00742000
*/********************************************************************/ 00743000
*/*          CREATE  RETURN  WE INDICATING START COMPLETE            */ 00744000
*/********************************************************************/ 00745000
*                                                                  0298 00746000
*   WENEXT=ADDR(COMPWE);            /* STORE NEXT W.E. ADDR          */ 00747000
@RF00289 LA    @07,COMPWE                                          0298 00748000
         L     @05,STCGSPN                                         0298 00749000
         ST    @07,WENEXT(,@05)                                    0298 00750000
*   RFY                                                            0299 00751000
*     WESTD BASED(ADDR(COMPWE));    /* COMPLETION W.E. ADDR          */ 00752000
*   WECODE1T=TCML;                  /* TASK CODE MAINLINE            */ 00753000
         MVI   WECODE1T(@07),X'01'                                 0300 00754000
*   WECODE1F=FCMLSC;                /* FUNC CODE START COMM          */ 00755000
         MVI   WECODE1F(@07),X'10'                                 0301 00756000
*   WECODE2F=FCRTN;                 /* FUNC CODE RETURN              */ 00757000
         MVI   WECODE2F(@07),X'FF'                                 0302 00758000
*   TWASYNQH=STCGSP;                /* QUEUE WORK ELEMENTS ON THE  0303 00759000
*                                      SYNCHRONOUS QUEUE             */ 00760000
         L     @07,STCGSP                                          0303 00761000
         ST    @07,TWASYNQH(,TWAPTR)                               0303 00762000
*   R14=MLSAVE1;                    /* RESTORE RETURN ADDR           */ 00763000
         LR    R14,MLSAVE1                                         0304 00764000
*   END MLSCPF;                                                    0305 00765000
@EL00002 DS    0H                                                  0305 00766000
@EF00002 DS    0H                                                  0305 00767000
@ER00002 BR    @14                                                 0305 00768000
*                                                                  0306 00769000
*/********************************************************************/ 00770000
*/*                                                                  */ 00771000
*/* SUBPROCEDURE-                                                    */ 00772000
*/*    MLSCPB                                                        */ 00773000
*/*                                                                  */ 00774000
*/* FUNCTION-                                                        */ 00775000
*/*    START COMMAND PROCESSING, BACK END                            */ 00776000
*/*                                                                  */ 00777000
*/********************************************************************/ 00778000
*                                                                  0306 00779000
*MLSCPB:                                                           0306 00780000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0306 00781000
MLSCPB   DS    0H                                                  0307 00782000
*   MLSAVE1=R14;                    /* SAVE RETURN ADDR              */ 00783000
         LR    MLSAVE1,R14                                         0307 00784000
*   RFY                                                            0308 00785000
*     WESTD BASED(R10);             /* GET WE BASE                   */ 00786000
*   IF WECODE2F=FCRTN THEN          /* IS THIS COMPLETE INDI         */ 00787000
         CLI   WECODE2F(R10),X'FF'                                 0309 00788000
         BNE   @RF00309                                            0309 00789000
*     DO;                           /* YES                           */ 00790000
*       IF R10=ADDR(TWAWORKE) THEN                                 0311 00791000
         LA    @07,TWAWORKE(,TWAPTR)                               0311 00792000
         CR    R10,@07                                             0311 00793000
         BE    @RT00311                                            0311 00794000
*         ;                         /* IS IT WE FROM CAS55?  @ZA24763*/ 00795000
*       ELSE                        /* NOT FROM CAS55        @ZA24763*/ 00796000
*         DO;                       /* FREE THE WE           @ZA24763*/ 00797000
*           R9=STCGSP;              /* FREEMAIN ADDR                 */ 00798000
         L     R9,STCGSP                                           0314 00799000
*           R8=8*LENGTH(WESTD);     /* FREEMAIN LENGTH       @ZM42690*/ 00800000
         LA    R8,672                                              0315 00801000
*           R1=5;                   /* MSG 5                         */ 00802000
         LA    R1,5                                                0316 00803000
*           CALL MSGBLK;            /* CALL MSG BLOCK GET M          */ 00804000
         L     @15,TWAMSG(,TWAPTR)                                 0317 00805000
         BALR  @14,@15                                             0317 00806000
*           R1=R1+4;                /* SKIP LEN FIELD                */ 00807000
         AL    R1,@CF00080                                         0318 00808000
*           GEN CODE;                                              0319 00809000
               WTO MF=(E,(1))         SEND COMPLETION  MSG              00810000
               FREEMAIN R,LV=(R8),A=(R9),SP=1   FREE WORK ELEMENTS      00811000
*         END;                      /*                       @ZA24763*/ 00812000
*     END;                                                         0321 00813000
@RT00311 DS    0H                                                  0322 00814000
*   IF WECODE2T=TCVI&               /* IF THIS W.E. RETURN FROM      */ 00815000
*       WECODE2F=FCVIAS THEN        /* START LOGON FUNCTION          */ 00816000
@RF00309 CLI   WECODE2T(R10),X'02'                                 0322 00817000
         BNE   @RF00322                                            0322 00818000
         CLI   WECODE2F(R10),X'14'                                 0322 00819000
         BNE   @RF00322                                            0322 00820000
*     DO;                           /* YES, IT MEANS ST LOGON FAIL   */ 00821000
*       R1=3;                       /* MSG # 3 - ASK OPERATOR START     00822000
*                                      LOGON TO BE RETRIED OR      0324 00823000
*                                      TERMINATE TCAS                */ 00824000
         LA    R1,3                                                0324 00825000
*       CALL MSGBLK;                /* CALL MSG SERVICE TO GET MSG   */ 00826000
         L     @15,TWAMSG(,TWAPTR)                                 0325 00827000
         BALR  @14,@15                                             0325 00828000
*       R8=R1->MLWA3;               /* GET LENGTH                    */ 00829000
         L     R8,MLWA3(,R1)                                       0326 00830000
*       R1=R1+4;                    /* SKIP LEN FIELD                */ 00831000
         AL    R1,@CF00080                                         0327 00832000
*       MSGTXT=R1->AREA(1:R8);      /* MOVE MSG OUT                  */ 00833000
         MVI   MSGTXT+1,C' '                                       0328 00834000
         MVC   MSGTXT+2(98),MSGTXT+1                               0328 00835000
         LR    @07,R8                                              0328 00836000
         BCTR  @07,0                                               0328 00837000
         EX    @07,@SM01694                                        0328 00838000
*       R8=WERC;                    /* GET VTAM RETURN CODE          */ 00839000
         LH    R8,WERC(,R10)                                       0329 00840000
         N     R8,@CF01700                                         0329 00841000
*       CVD(R8,MLWAD);              /* CONVERT TO DECIMAL            */ 00842000
         CVD   R8,MLWAD                                            0330 00843000
*       DO UNTIL(MSGRPY='RETRY'|    /* DO UNTIL VALID REPLY          */ 00844000
*             MSGRPY='TERM');                                      0331 00845000
@DL00331 DS    0H                                                  0332 00846000
*         MSGRPY='';                /* BLANK MSG REPLY A             */ 00847000
         MVI   MSGRPY,C' '                                         0332 00848000
         MVC   MSGRPY+1(47),MSGRPY                                 0332 00849000
*         GEN REFS(MLWAD);                                         0333 00850000
         UNPK  MSGTXT+62(4),MLWAD(8)   UNPACK REASON CODE               00851000
         OI    MSGTXT+65,X'F0'     PRINTABLE LAST CHAR                  00852000
         XC    MSGECB,MSGECB          ZERO ECB                          00853000
         WTOR  ,MSGRPY,48,MSGECB,MF=(E,MSGTXT)   SEND MSG IKT003D       00854000
         WAIT  ECB=MSGECB              WAIT FOR REPLY                   00855000
*       END;                                                       0334 00856000
@DE00331 CLC   MSGRPY(5),@CC01654                                  0334 00857000
         BE    @DC00331                                            0334 00858000
         CLC   MSGRPY(4),@CC01655                                  0334 00859000
         BNE   @DL00331                                            0334 00860000
@DC00331 DS    0H                                                  0335 00861000
*       IF MSGRPY='RETRY' THEN      /* IF REPLY IS RETRY             */ 00862000
         CLC   MSGRPY(5),@CC01654                                  0335 00863000
         BNE   @RF00335                                            0335 00864000
*         DO;                       /* YES                           */ 00865000
*           MLWA2=WECODE1;          /* SWAP THE TASK AND FUNCTION    */ 00866000
         MVC   MLWA2(2),WECODE1(R10)                               0337 00867000
*           WECODE1=WECODE2;        /* CODE TO RETRY START           */ 00868000
         MVC   WECODE1(2,R10),WECODE2(R10)                         0338 00869000
*           WECODE2=MLWA2;          /* LOGON FUNCTION                */ 00870000
         MVC   WECODE2(2,R10),MLWA2                                0339 00871000
*         END;                                                     0340 00872000
*       ELSE                                                       0341 00873000
*         DO;                       /* NOT RETRY, TERMINATE          */ 00874000
         B     @RC00335                                            0341 00875000
@RF00335 DS    0H                                                  0342 00876000
*           WECODE1F=FCMLTT;        /* TCAS TERM F.C.                */ 00877000
         MVI   WECODE1F(R10),X'80'                                 0342 00878000
*           WERC2='02'X;            /* DETACH SUBTASK ENTRY CODE     */ 00879000
         MVI   WERC2(R10),X'02'                                    0343 00880000
*           R10=WENEXT;             /* MAKE NEXT WE END OF MAIN T    */ 00881000
         L     R10,WENEXT(,R10)                                    0344 00882000
*           WECODE1F=FCMLET;        /* END OF MAIN TASK F.C.         */ 00883000
         MVI   WECODE1F(R10),X'91'                                 0345 00884000
*         END;                                                     0346 00885000
*     END;                                                         0347 00886000
@RC00335 DS    0H                                                  0348 00887000
*   R14=MLSAVE1;                    /* RESTORE RETURN ADDR           */ 00888000
@RF00322 LR    R14,MLSAVE1                                         0348 00889000
*   END MLSCPB;                                                    0349 00890000
@EL00003 DS    0H                                                  0349 00891000
@EF00003 DS    0H                                                  0349 00892000
@ER00003 BR    @14                                                 0349 00893000
*                                                                  0350 00894000
*/********************************************************************/ 00895000
*/*                                                                  */ 00896000
*/* SUBPROCEDURE-                                                    */ 00897000
*/*    MLACIF                                                        */ 00898000
*/*                                                                  */ 00899000
*/* FUNCTION-                                                        */ 00900000
*/*    ATTACH CONSOLE COMMUNICATION INTERFACE FUNCTION               */ 00901000
*/*                                                                  */ 00902000
*/********************************************************************/ 00903000
*                                                                  0350 00904000
*MLACIF:                                                           0350 00905000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0350 00906000
MLACIF   DS    0H                                                  0351 00907000
*   MLSAVE1=R14;                    /* SAVE RETURN ADDR              */ 00908000
         LR    MLSAVE1,R14                                         0351 00909000
*   TWACECB=TWACECB&&TWACECB;       /* CLEAR ECB                     */ 00910000
         XC    TWACECB(4,TWAPTR),TWACECB(TWAPTR)                   0352 00911000
*   TWACCOMP=TWACCOMP&&TWACCOMP;    /* CLEAR COMPLETION ECB          */ 00912000
         XC    TWACCOMP(4,TWAPTR),TWACCOMP(TWAPTR)                 0353 00913000
*   R1=TWAPTR;                      /* PASS TWA ADDRESS TO    SUBTASK*/ 00914000
         LR    R1,TWAPTR                                           0354 00915000
*   TWACFL1='0'B;                   /* INITIALIZE ATTACH INDICATOR   */ 00916000
*   TWACFL2='0'B;                   /* INITIALIZE ABEND INDICATOR    */ 00917000
         NI    TWACFL1(TWAPTR),B'00111111'                         0356 00918000
*   RFY                                                            0357 00919000
*     R7 RSTD;                                                     0357 00920000
*   R7=ADDR(TWACCOMP);              /* ADDR OF COMPLETION ECB        */ 00921000
         LA    R7,TWACCOMP(,TWAPTR)                                0358 00922000
*   R8=TWAEESR;                     /* ESTAE EXIT ADDR               */ 00923000
         L     R8,TWAEESR(,TWAPTR)                                 0359 00924000
*   R9=ADDR(TWAC);                  /* ADDR OF PARAMETER WHICH IS IN    00925000
*                                      TWA PASSED TO ESTAE           */ 00926000
         LA    R9,TWAC(,TWAPTR)                                    0360 00927000
*   GEN;                                                           0361 00928000
         ATTACH EP=IKTCAS40,ESTAI=((R8),(R9)),ECB=(R7),SHSPV=4          00929000
*   RFY                                                            0362 00930000
*     R7 UNRSTD;                                                   0362 00931000
*   IF R15=0 THEN                   /* TEST RETURN CODE              */ 00932000
         LTR   R15,R15                                             0363 00933000
         BNZ   @RF00363                                            0363 00934000
*     DO;                           /* NORMAL                        */ 00935000
*       TWACTCB=R1;                 /* STORE TCB ADDR                */ 00936000
         ST    R1,TWACTCB(,TWAPTR)                                 0365 00937000
*       TWACFL1='1'B;               /* FLAG ATTACHED                 */ 00938000
         OI    TWACFL1(TWAPTR),B'10000000'                         0366 00939000
*     END;                                                         0367 00940000
*   ELSE                                                           0368 00941000
*     DO;                           /* NOT OK                        */ 00942000
         B     @RC00363                                            0368 00943000
@RF00363 DS    0H                                                  0369 00944000
*       WERC2=RCACF;                /* STORE REASON CODE             */ 00945000
         MVI   WERC2(R10),X'18'                                    0369 00946000
*       WERC1=R15;                  /* RETURN CODE FROM ATT          */ 00947000
         STC   R15,WERC1(,R10)                                     0370 00948000
*       MLWA2=WECODE2;              /* DIRECT WE                     */ 00949000
         MVC   MLWA2(2),WECODE2(R10)                               0371 00950000
*       WECODE2=WECODE1;            /* TO SECOND DESTINATION         */ 00951000
         MVC   WECODE2(2,R10),WECODE1(R10)                         0372 00952000
*       WECODE1=MLWA2;              /* WHICH IS EOT                  */ 00953000
         MVC   WECODE1(2,R10),MLWA2                                0373 00954000
*     END;                                                         0374 00955000
*   R14=MLSAVE1;                    /* RESTORE RETURN ADDR           */ 00956000
@RC00363 LR    R14,MLSAVE1                                         0375 00957000
*   END MLACIF;                                                    0376 00958000
@EL00004 DS    0H                                                  0376 00959000
@EF00004 DS    0H                                                  0376 00960000
@ER00004 BR    @14                                                 0376 00961000
*                                                                  0377 00962000
*/********************************************************************/ 00963000
*/*                                                                  */ 00964000
*/* SUBPROCEDURE-                                                    */ 00965000
*/*    MLAVIF                                                        */ 00966000
*/*                                                                  */ 00967000
*/* FUCNTION-                                                        */ 00968000
*/*    ATTACH VTAM INTERFACE FUNCTION                                */ 00969000
*/*                                                                  */ 00970000
*/********************************************************************/ 00971000
*                                                                  0377 00972000
*MLAVIF:                                                           0377 00973000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0377 00974000
MLAVIF   DS    0H                                                  0378 00975000
*   MLSAVE1=R14;                    /* SAVE RETURN ADDR              */ 00976000
         LR    MLSAVE1,R14                                         0378 00977000
*   TWAVECB=TWAVECB&&TWAVECB;       /* CLEAR ECB                     */ 00978000
         XC    TWAVECB(4,TWAPTR),TWAVECB(TWAPTR)                   0379 00979000
*   TWAVCOMP=TWAVCOMP&&TWAVCOMP;    /* CLEAR COMPLETION ECB          */ 00980000
         XC    TWAVCOMP(4,TWAPTR),TWAVCOMP(TWAPTR)                 0380 00981000
*   R1=TWAPTR;                      /* PASS TWA ADDRESS TO    SUBTASK*/ 00982000
         LR    R1,TWAPTR                                           0381 00983000
*   TWAVFL1='0'B;                   /* INITIALIZE ATTACH INDICATOR   */ 00984000
*   TWAVFL2='0'B;                   /* INITIALIZE ABEND INDICATOR    */ 00985000
         NI    TWAVFL1(TWAPTR),B'00111111'                         0383 00986000
*   RFY                                                            0384 00987000
*     R7 RSTD;                                                     0384 00988000
*   R7=ADDR(TWAVCOMP);              /* ADDR OF COMPLETION ECB        */ 00989000
         LA    R7,TWAVCOMP(,TWAPTR)                                0385 00990000
*   R8=TWAEESR;                     /* ESTAE EXIT ADDR               */ 00991000
         L     R8,TWAEESR(,TWAPTR)                                 0386 00992000
*   R9=ADDR(TWAV);                  /* ADDR OF PARAMETER WHICH IS IN    00993000
*                                      TWA PASSED TO ESTAE           */ 00994000
         LA    R9,TWAV(,TWAPTR)                                    0387 00995000
*   GEN;                                                           0388 00996000
         ATTACH EP=IKTCAS20,ESTAI=((R8),(R9)),ECB=(R7),SHSPV=5          00997000
*   RFY                                                            0389 00998000
*     R7 UNRSTD;                                                   0389 00999000
*   IF R15=0 THEN                   /* TEST RETURN CODE              */ 01000000
         LTR   R15,R15                                             0390 01001000
         BNZ   @RF00390                                            0390 01002000
*     DO;                           /* NORMAL                        */ 01003000
*       TWAVTCB=R1;                 /* STORE TCB ADDR                */ 01004000
         ST    R1,TWAVTCB(,TWAPTR)                                 0392 01005000
*       TWAVFL1='1'B;               /* FLAG ATTACHED                 */ 01006000
         OI    TWAVFL1(TWAPTR),B'10000000'                         0393 01007000
*     END;                                                         0394 01008000
*   ELSE                                                           0395 01009000
*     DO;                           /* NOT OK                        */ 01010000
         B     @RC00390                                            0395 01011000
@RF00390 DS    0H                                                  0396 01012000
*       WERC2=RCAVF;                /* STORE REASON CODE             */ 01013000
         MVI   WERC2(R10),X'10'                                    0396 01014000
*       WERC1=R15;                  /* RETURN CODE FROM ATT          */ 01015000
         STC   R15,WERC1(,R10)                                     0397 01016000
*       MLWA2=WECODE2;              /* DIRECT WE                     */ 01017000
         MVC   MLWA2(2),WECODE2(R10)                               0398 01018000
*       WECODE2=WECODE1;            /* TO SECOND DESTINATION         */ 01019000
         MVC   WECODE2(2,R10),WECODE1(R10)                         0399 01020000
*       WECODE1=MLWA2;              /* WHICH IS EOT                  */ 01021000
         MVC   WECODE1(2,R10),MLWA2                                0400 01022000
*     END;                                                         0401 01023000
*   R14=MLSAVE1;                    /* RESTORE RETURN ADDR           */ 01024000
@RC00390 LR    R14,MLSAVE1                                         0402 01025000
*   END MLAVIF;                                                    0403 01026000
@EL00005 DS    0H                                                  0403 01027000
@EF00005 DS    0H                                                  0403 01028000
@ER00005 BR    @14                                                 0403 01029000
*                                                                  0404 01030000
*/********************************************************************/ 01031000
*/*                                                                  */ 01032000
*/* SUBPROCEDURE-                                                    */ 01033000
*/*    MLAUIF                                                        */ 01034000
*/*                                                                  */ 01035000
*/* FUNCTION-                                                        */ 01036000
*/*    ATTACH USER INTERFACE FUNCTION                                */ 01037000
*/*                                                                  */ 01038000
*/********************************************************************/ 01039000
*                                                                  0404 01040000
*MLAUIF:                                                           0404 01041000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0404 01042000
MLAUIF   DS    0H                                                  0405 01043000
*   MLSAVE1=R14;                    /* SAVE RETURN ADDR              */ 01044000
         LR    MLSAVE1,R14                                         0405 01045000
*   TWAUECB=TWAUECB&&TWAUECB;       /* CLEAR ECB                     */ 01046000
         XC    TWAUECB(4,TWAPTR),TWAUECB(TWAPTR)                   0406 01047000
*   TWAUCOMP=TWAUCOMP&&TWAUCOMP;    /* CLEAR COMPLETION ECB          */ 01048000
         XC    TWAUCOMP(4,TWAPTR),TWAUCOMP(TWAPTR)                 0407 01049000
*   R1=TWAPTR;                      /* PASS TWA ADDRESS TO    SUBTASK*/ 01050000
         LR    R1,TWAPTR                                           0408 01051000
*   TWAUFL1='0'B;                   /* INITIALIZE ATTACH INDICATOR   */ 01052000
*   TWAUFL2='0'B;                   /* INITIALIZE ABEND INDICATOR    */ 01053000
         NI    TWAUFL1(TWAPTR),B'00111111'                         0410 01054000
*   RFY                                                            0411 01055000
*     R7 RSTD;                                                     0411 01056000
*   R7=ADDR(TWAUCOMP);              /* ADDR OF COMPLETION ECB        */ 01057000
         LA    R7,TWAUCOMP(,TWAPTR)                                0412 01058000
*   R8=TWAEESR;                     /* ESTAE EXIT ADDR               */ 01059000
         L     R8,TWAEESR(,TWAPTR)                                 0413 01060000
*   R9=ADDR(TWAU);                  /* ADDR OF PARAMETER WHICH IS IN    01061000
*                                      TWA PASSED TO ESTAE           */ 01062000
         LA    R9,TWAU(,TWAPTR)                                    0414 01063000
*   GEN;                                                           0415 01064000
         ATTACH EP=IKTCAS30,ESTAI=((R8),(R9)),ECB=(R7)                  01065000
*   RFY                                                            0416 01066000
*     R7 UNRSTD;                                                   0416 01067000
*   IF R15=0 THEN                   /* TEST RETURN CODE              */ 01068000
         LTR   R15,R15                                             0417 01069000
         BNZ   @RF00417                                            0417 01070000
*     DO;                           /* NORMAL                        */ 01071000
*       TWAUTCB=R1;                 /* STORE TCB ADDR                */ 01072000
         ST    R1,TWAUTCB(,TWAPTR)                                 0419 01073000
*       TWAUFL1='1'B;               /* FLAG ATTACHED                 */ 01074000
         OI    TWAUFL1(TWAPTR),B'10000000'                         0420 01075000
*     END;                                                         0421 01076000
*   ELSE                                                           0422 01077000
*     DO;                           /* NOT OK                        */ 01078000
         B     @RC00417                                            0422 01079000
@RF00417 DS    0H                                                  0423 01080000
*       WERC2=RCAUF;                /* STORE REASON CODE             */ 01081000
         MVI   WERC2(R10),X'14'                                    0423 01082000
*       WERC1=R15;                  /* RETURN CODE FROM ATT          */ 01083000
         STC   R15,WERC1(,R10)                                     0424 01084000
*       MLWA2=WECODE2;              /* DIRECT WE                     */ 01085000
         MVC   MLWA2(2),WECODE2(R10)                               0425 01086000
*       WECODE2=WECODE1;            /* TO SECOND DESTINATION         */ 01087000
         MVC   WECODE2(2,R10),WECODE1(R10)                         0426 01088000
*       WECODE1=MLWA2;              /* WHICH IS EOT                  */ 01089000
         MVC   WECODE1(2,R10),MLWA2                                0427 01090000
*     END;                                                         0428 01091000
*   R14=MLSAVE1;                    /* RESTORE RETURN ADDR           */ 01092000
@RC00417 LR    R14,MLSAVE1                                         0429 01093000
*   END MLAUIF;                                                    0430 01094000
@EL00006 DS    0H                                                  0430 01095000
@EF00006 DS    0H                                                  0430 01096000
@ER00006 BR    @14                                                 0430 01097000
*                                                                  0431 01098000
*/********************************************************************/ 01099000
*/*                                                                  */ 01100000
*/* SUBPROCEDURE-                                                    */ 01101000
*/*    MLCTTF                                                        */ 01102000
*/*                                                                  */ 01103000
*/* FUNCTION-                                                        */ 01104000
*/*    CALL TCAS TERMINATION SERVICE ROUTINE FUNCTION                */ 01105000
*/*                                                                  */ 01106000
*/********************************************************************/ 01107000
*                                                                  0431 01108000
*MLCTTF:                                                           0431 01109000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0431 01110000
MLCTTF   DS    0H                                                  0432 01111000
*   MLSAVE1=R14;                    /* SAVE RETURN ADDR              */ 01112000
         LR    MLSAVE1,R14                                         0432 01113000
*   R1=WERC2;                       /* INSERT ENTRY CODE             */ 01114000
         SLR   R1,R1                                               0433 01115000
         IC    R1,WERC2(,R10)                                      0433 01116000
*   CALL IKTCAS52;                  /* CALL TCAS TERMINATION         */ 01117000
         L     @15,TWATTSR(,TWAPTR)                                0434 01118000
         BALR  @14,@15                                             0434 01119000
*   R14=MLSAVE1;                    /* RESTORE RETURN ADDR           */ 01120000
         LR    R14,MLSAVE1                                         0435 01121000
*   END MLCTTF;                                                    0436 01122000
@EL00007 DS    0H                                                  0436 01123000
@EF00007 DS    0H                                                  0436 01124000
@ER00007 BR    @14                                                 0436 01125000
*                                                                  0437 01126000
*/********************************************************************/ 01127000
*/*                                                                  */ 01128000
*/* SUBPROCEDURE-                                                    */ 01129000
*/*    MLEOT                                                         */ 01130000
*/*                                                                  */ 01131000
*/* FUNCTION-                                                        */ 01132000
*/*    MAINLINE TASK TERMINATION                                     */ 01133000
*/*                                                                  */ 01134000
*/* INPUT : R10=ADDRESS OF WE OR ZERO                                */ 01135000
*/*         R8=FUNCTION CODE: ABEND OR NORMAL END IF R10=0           */ 01136000
*/*         R9 =TERMINATION REASON CODE IF R10=0                     */ 01137000
*/*                                                                  */ 01138000
*/* THIS ROUTINE GENERATES CODE TO NORMAL END OR                     */ 01139000
*/* ABEND THE TASK. THE CONTROL DOES NOT RETURN TO                   */ 01140000
*/* MAINLINE .                                                       */ 01141000
*/*                                                                  */ 01142000
*/********************************************************************/ 01143000
*                                                                  0437 01144000
*MLEOT:                                                            0437 01145000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0437 01146000
MLEOT    DS    0H                                                  0438 01147000
*   IF R10^=0 THEN                  /* IS THERE WE PASSED            */ 01148000
         LTR   R10,R10                                             0438 01149000
         BZ    @RF00438                                            0438 01150000
*     DO;                           /* YES                           */ 01151000
*       RFY                                                        0440 01152000
*         WESTD BASED(R10);         /* GET WE BASE                   */ 01153000
*       R9=WERC;                    /* RETURN CODE                   */ 01154000
         LH    R9,WERC(,R10)                                       0441 01155000
         N     R9,@CF01700                                         0441 01156000
*       R8=WECODE1F;                /* WHAT TYPE OF END              */ 01157000
         SLR   R8,R8                                               0442 01158000
         IC    R8,WECODE1F(,R10)                                   0442 01159000
*     END;                          /* REASON CODE                   */ 01160000
*   IF TWAPTR^=0 THEN               /* IF THERE IS TWA               */ 01161000
@RF00438 LTR   TWAPTR,TWAPTR                                       0444 01162000
         BZ    @RF00444                                            0444 01163000
*     TWARSON=R9;                   /* YES STORE REASON CODE         */ 01164000
         STH   R9,TWARSON(,TWAPTR)                                 0445 01165000
*   MLWA22=R9;                      /* USE LAST BYTE AS RETURN       */ 01166000
@RF00444 STC   R9,MLWA22                                           0446 01167000
*   R9=MLWA22;                      /* CODE AND REASON CODE          */ 01168000
         SLR   @05,@05                                             0447 01169000
         IC    @05,MLWA22                                          0447 01170000
         LR    R9,@05                                              0447 01171000
*   IF R8=FCMLAT THEN               /* IS IT ABEND                   */ 01172000
         C     R8,@CF01460                                         0448 01173000
         BNE   @RF00448                                            0448 01174000
*     DO;                           /* YES                           */ 01175000
*       R1=2;                       /* MSG 2                         */ 01176000
         LA    R1,2                                                0450 01177000
*       CALL MSGBLK;                /* CALL MSG BLOCK GET M          */ 01178000
         L     @15,TWAMSG(,TWAPTR)                                 0451 01179000
         BALR  @14,@15                                             0451 01180000
*       R8=R1->MLWA3;               /* GET LENGTH                    */ 01181000
         L     R8,MLWA3(,R1)                                       0452 01182000
*       R1=R1+4;                    /* SKIP LEN FIELD                */ 01183000
         AL    R1,@CF00080                                         0453 01184000
*       MSGTXT=R1->AREA(1:R8);      /* MOVE MSG OUT                  */ 01185000
         MVI   MSGTXT+1,C' '                                       0454 01186000
         MVC   MSGTXT+2(98),MSGTXT+1                               0454 01187000
         LR    @05,R8                                              0454 01188000
         BCTR  @05,0                                               0454 01189000
         EX    @05,@SM01694                                        0454 01190000
*       CVD(R9,MLWAD);              /* FOR MSG TERM REASON           */ 01191000
         CVD   R9,MLWAD                                            0455 01192000
*       GEN;                                                       0456 01193000
         UNPK  MSGTXT+45(4),MLWAD  UNPACK                               01194000
         OI    MSGTXT+48,X'F0'     PRINTABLE LAST CHAR                  01195000
         WTO   MF=(E,MSGTXT)       SEND TERMINATING MSG                 01196000
         LR    R15,R9              REG 15 REASON              @ZA26725  01197000
         ABEND X'0AC',DUMP,,SYSTEM    ISSUE SYSTEM ABEND                01198000
*     END;                                                         0457 01199000
*   GEN;                                                           0458 01200000
@RF00448 DS    0H                                                  0458 01201000
         WTO   MF=(E,MSG6)            ISSUE TERMINATION MSG             01202000
*   GEN;                                                           0459 01203000
*                                          /* NO NORMAL TERM        */  01204000
         L     13,4(13)                LOAD SAVE AREA ADDR              01205000
         ST    9,16(13)                STORE RETURN CODE IN R15         01206000
         LM    14,12,12(13)            RESTORE REG                      01207000
         BR    14                      RETURN                           01208000
*   END MLEOT;                                                     0460 01209000
@EL00008 DS    0H                                                  0460 01210000
@EF00008 DS    0H                                                  0460 01211000
@ER00008 BR    @14                                                 0460 01212000
*   GEN DATA;                                                      0461 01213000
*   END IKTCAS00                                                   0462 01214000
*                                                                  0462 01215000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01216000
*/*%INCLUDE SYSLIB  (IKTCASWA)                                       */ 01217000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 01218000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 01219000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01220000
*/*%INCLUDE SYSLIB  (IEECHAIN)                                       */ 01221000
*/*%INCLUDE SYSLIB  (IKTTCAST)                                       */ 01222000
*/*%INCLUDE SYSLIB  (IKTWESTD)                                       */ 01223000
*/*%INCLUDE SYSLIB  (IEZCIB  )                                       */ 01224000
*/*%INCLUDE SYSLIB  (IHAECB  )                                       */ 01225000
*                                                                  0462 01226000
*       ;                                                          0462 01227000
@DATA    DS    0H                                                       01228000
@CH01676 DC    H'84'                                                    01229000
@SM01694 MVC   MSGTXT(0),AREA(R1)                                       01230000
@SX01697 XC    AREA(0,R1),AREA(R1)                                      01231000
         DS    0F                                                       01232000
@SA00001 DS    18F                                                      01233000
         DS    0F                                                       01234000
@CF00062 DC    F'1'                                                     01235000
@CF00080 DC    F'4'                                                     01236000
@CF00060 DC    F'8'                                                     01237000
@CF01700 DC    XL4'0000FFFF'                                            01238000
@CF01440 DC    XL4'04'                                                  01239000
@CF01460 DC    XL4'92'                                                  01240000
         DS    0D                                                       01241000
CSCBPTR  DS    A                                                        01242000
TCASTPTR DS    A                                                        01243000
CIBPTR   DS    A                                                        01244000
ECBPTR   DS    A                                                        01245000
MLTCASWA DS    A                                                        01246000
STCGSP   DS    A                                                        01247000
STCGSPN  DS    A                                                        01248000
@CC01654 DC    C'RETRY'                                                 01249000
@CC01655 DC    C'TERM'                                                  01250000
         DS    CL3                                                      01251000
MLWAD    DS    CL8                                                      01252000
MLWA     DS    BL4                                                      01253000
         ORG   MLWA                                                     01254000
MLWA1    DS    BL2                                                      01255000
         ORG   MLWA1                                                    01256000
MLWA11   DS    BL1                                                      01257000
MLWA12   DS    BL1                                                      01258000
         ORG   MLWA+2                                                   01259000
MLWA2    DS    BL2                                                      01260000
         ORG   MLWA2                                                    01261000
MLWA21   DS    FL1                                                      01262000
MLWA22   DS    FL1                                                      01263000
         ORG   MLWA+4                                                   01264000
MLECBSA  DS    CL16                                                     01265000
         ORG   MLECBSA                                                  01266000
MLQECBA  DS    AL4                                                      01267000
MLVECBA  DS    AL4                                                      01268000
MLUECBA  DS    AL4                                                      01269000
MLCECB   DS    AL4                                                      01270000
         ORG   MLCECB                                                   01271000
MLECBEND DC    X'80'                                                    01272000
MLCECBA  DS    AL3                                                      01273000
         ORG   MLECBSA+16                                               01274000
MLPMPML  DS    CL8                                                      01275000
         ORG   MLPMPML                                                  01276000
MLPMFL1  DS    BL1                                                      01277000
         ORG   MLPMFL1                                                  01278000
@NM00046 DS    BL1                                                      01279000
MLPMSTC  EQU   MLPMFL1+0                                                01280000
MLPMWPM  EQU   MLPMFL1+0                                                01281000
MLPMUPTB EQU   MLPMFL1+0                                                01282000
MLPMRLIB EQU   MLPMFL1+0                                                01283000
MLPMBUF  EQU   MLPMFL1+0                                                01284000
MLPMCIB  EQU   MLPMFL1+0                                                01285000
         ORG   MLPMPML+1                                                01286000
MLPMFL2  DS    BL1                                                      01287000
         ORG   MLPMFL2                                                  01288000
@NM00047 DS    BL1                                                      01289000
MLPMINV  EQU   MLPMFL2+0                                                01290000
MLPMERR  EQU   MLPMFL2+0                                                01291000
MLPMUZ   EQU   MLPMFL2+0                                                01292000
MLPMUNZ  EQU   MLPMFL2+0                                                01293000
MLPMFS   EQU   MLPMFL2+0                                                01294000
MLPMSIC  EQU   MLPMFL2+0                                                01295000
MLPMIGN  EQU   MLPMFL2+0                                                01296000
         ORG   MLPMPML+2                                                01297000
@NM00048 DS    BL2                                                      01298000
MLPMSCA  DS    AL4                                                      01299000
         ORG   MLPMPML+8                                                01300000
MLFL     DC    X'00'                                                    01301000
         ORG   MLFL                                                     01302000
MLNOTB   DS    BL1                                                      01303000
MLUZ     EQU   MLFL+0                                                   01304000
@NM00049 EQU   MLFL+0                                                   01305000
         ORG   MLFL+1                                                   01306000
         DS    CL3                                                      01307000
MSGTXT   DC    CL100' '                                                 01308000
MSGRPY   DC    CL48' '                                                  01309000
PATCH    DC    75A(0)                                                   01310000
COMPWE   DC    3F'0'                                                    01311000
FUNADD   DC    AL4(MLSCPB)                                              01312000
         DC    AL4(MLAVIF)                                              01313000
         DC    AL4(MLAUIF)                                              01314000
         DC    AL4(MLACIF)                                              01315000
         DC    AL4(MLCTTF)                                              01316000
         DC    AL4(MLEOT)                                               01317000
         DC    AL4(MLEOT)                                               01318000
         DC    A(0)                                                     01319000
FUNCODE  DC    X'10'                                                    01320000
         DC    X'50'                                                    01321000
         DC    X'60'                                                    01322000
         DC    X'70'                                                    01323000
         DC    X'80'                                                    01324000
         DC    X'91'                                                    01325000
         DC    X'92'                                                    01326000
         DC    X'00'                                                    01327000
IKTCAS00 CSECT                                                          01328000
MSGECB   DC    A(0)                                                     01329000
MSG6     WTO   'IKT006I  TCAS ENDED',                                 CC01330000
               ROUTCDE=(1,8),                                         CC01331000
               MF=L                                                     01332000
IKTCAS00 CSECT                                                          01333000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01334000
@01      EQU   01                                                       01335000
@02      EQU   02                                                       01336000
@03      EQU   03                                                       01337000
@04      EQU   04                                                       01338000
@05      EQU   05                                                       01339000
@06      EQU   06                                                       01340000
@07      EQU   07                                                       01341000
@08      EQU   08                                                       01342000
@09      EQU   09                                                       01343000
@10      EQU   10                                                       01344000
@11      EQU   11                                                       01345000
@12      EQU   12                                                       01346000
@13      EQU   13                                                       01347000
@14      EQU   14                                                       01348000
@15      EQU   15                                                       01349000
I        EQU   @06                                                      01350000
MLSAVE1  EQU   @06                                                      01351000
STCGSL   EQU   @07                                                      01352000
ASCBPTR  EQU   @07                                                      01353000
TWAPTR   EQU   @11                                                      01354000
R0       EQU   @00                                                      01355000
R1       EQU   @01                                                      01356000
R7       EQU   @07                                                      01357000
R8       EQU   @08                                                      01358000
R9       EQU   @09                                                      01359000
R10      EQU   @10                                                      01360000
R14      EQU   @14                                                      01361000
R15      EQU   @15                                                      01362000
R12      EQU   @12                                                      01363000
R13      EQU   @13                                                      01364000
PSA      EQU   0                                                        01365000
FLCRNPSW EQU   PSA                                                      01366000
FLCROPSW EQU   PSA+8                                                    01367000
FLCICCW2 EQU   PSA+16                                                   01368000
PSAEEPSW EQU   PSA+132                                                  01369000
PSAESPSW EQU   PSA+136                                                  01370000
FLCSVILC EQU   PSAESPSW+1                                               01371000
PSAEPPSW EQU   PSA+140                                                  01372000
FLCPIILC EQU   PSAEPPSW+1                                               01373000
FLCPICOD EQU   PSAEPPSW+2                                               01374000
PSAPICOD EQU   FLCPICOD+1                                               01375000
FLCTEA   EQU   PSAEPPSW+4                                               01376000
FLCPER   EQU   PSA+152                                                  01377000
FLCMCLA  EQU   PSA+168                                                  01378000
FLCIOEL  EQU   FLCMCLA+4                                                01379000
FLCIOA   EQU   FLCMCLA+16                                               01380000
FLCFSA   EQU   FLCMCLA+80                                               01381000
PSAAOLD  EQU   PSA+548                                                  01382000
PSASUPER EQU   PSA+552                                                  01383000
PSASUP1  EQU   PSASUPER                                                 01384000
PSASUP2  EQU   PSASUPER+1                                               01385000
PSASUP3  EQU   PSASUPER+2                                               01386000
PSASUP4  EQU   PSASUPER+3                                               01387000
PSACLHT  EQU   PSA+640                                                  01388000
PSALKSA  EQU   PSA+696                                                  01389000
PSAHLHI  EQU   PSA+760                                                  01390000
PSALITA  EQU   PSA+764                                                  01391000
PSADSSFL EQU   PSA+836                                                  01392000
PSADSSF1 EQU   PSADSSFL                                                 01393000
PSADSSF3 EQU   PSADSSFL+2                                               01394000
PSADSSF4 EQU   PSADSSFL+3                                               01395000
PSARSVT  EQU   PSA+896                                                  01396000
CVTPTR   EQU   16                                                       01397000
TWAR     EQU   0                                                        01398000
TWARSON  EQU   TWAR+2                                                   01399000
TWASYNQH EQU   TWAR+4                                                   01400000
TWAASCB  EQU   TWAR+12                                                  01401000
TWACSCB  EQU   TWAR+16                                                  01402000
TWATCAST EQU   TWAR+20                                                  01403000
TWATTSR  EQU   TWAR+28                                                  01404000
TWATCSR  EQU   TWAR+32                                                  01405000
TWAPPSR  EQU   TWAR+36                                                  01406000
TWAEESR  EQU   TWAR+40                                                  01407000
TWAMSG   EQU   TWAR+48                                                  01408000
TWAVTCB  EQU   TWAR+52                                                  01409000
TWAUTCB  EQU   TWAR+56                                                  01410000
TWACTCB  EQU   TWAR+60                                                  01411000
TWAMECB  EQU   TWAR+64                                                  01412000
TWAVCOMP EQU   TWAR+68                                                  01413000
TWAUCOMP EQU   TWAR+72                                                  01414000
TWACCOMP EQU   TWAR+76                                                  01415000
TWAMFL   EQU   TWAR+80                                                  01416000
TWAVFL   EQU   TWAR+81                                                  01417000
TWAVFL1  EQU   TWAVFL                                                   01418000
TWAVFL2  EQU   TWAVFL                                                   01419000
TWAVFL4  EQU   TWAVFL                                                   01420000
TWAUFL   EQU   TWAR+82                                                  01421000
TWAUFL1  EQU   TWAUFL                                                   01422000
TWAUFL2  EQU   TWAUFL                                                   01423000
TWAUFL4  EQU   TWAUFL                                                   01424000
TWACFL   EQU   TWAR+83                                                  01425000
TWACFL1  EQU   TWACFL                                                   01426000
TWACFL2  EQU   TWACFL                                                   01427000
TWACFL4  EQU   TWACFL                                                   01428000
TWAM     EQU   TWAR+84                                                  01429000
TWAME    EQU   TWAM+68                                                  01430000
TWAMEI   EQU   TWAME                                                    01431000
TWAV     EQU   TWAR+184                                                 01432000
TWAVE    EQU   TWAV+68                                                  01433000
TWAVEI   EQU   TWAVE                                                    01434000
TWAVI    EQU   TWAR+284                                                 01435000
TWAVECB  EQU   TWAVI                                                    01436000
TWAU     EQU   TWAR+300                                                 01437000
TWAUE    EQU   TWAU+68                                                  01438000
TWAUEI   EQU   TWAUE                                                    01439000
TWAUI    EQU   TWAR+400                                                 01440000
TWAUECB  EQU   TWAUI                                                    01441000
TWAUACQH EQU   TWAUI+4                                                  01442000
TWAC     EQU   TWAR+408                                                 01443000
TWACE    EQU   TWAC+68                                                  01444000
TWACEI   EQU   TWACE                                                    01445000
TWACI    EQU   TWAR+508                                                 01446000
TWACECB  EQU   TWACI                                                    01447000
TWAWORKE EQU   TWAR+524                                                 01448000
ASCB     EQU   0                                                        01449000
ASCBSUPC EQU   ASCB+16                                                  01450000
ASCBCSCB EQU   ASCB+56                                                  01451000
ASCBFW1  EQU   ASCB+100                                                 01452000
ASCBRCTF EQU   ASCBFW1+2                                                01453000
ASCBFLG1 EQU   ASCBFW1+3                                                01454000
ASCBDSP1 EQU   ASCB+114                                                 01455000
ASCBFLG2 EQU   ASCB+115                                                 01456000
ASCBLKGP EQU   ASCB+128                                                 01457000
ASCBSRQ  EQU   ASCB+180                                                 01458000
ASCBSRQ1 EQU   ASCBSRQ                                                  01459000
ASCBSRQ2 EQU   ASCBSRQ+1                                                01460000
ASCBSRQ3 EQU   ASCBSRQ+2                                                01461000
ASCBSRQ4 EQU   ASCBSRQ+3                                                01462000
CVTMAP   EQU   0                                                        01463000
CVTDAR   EQU   CVTMAP+72                                                01464000
CVTFLGS1 EQU   CVTDAR                                                   01465000
CVTDCB   EQU   CVTMAP+116                                               01466000
CVTIERLC EQU   CVTMAP+144                                               01467000
CVTOPTA  EQU   CVTMAP+182                                               01468000
CVTOPTB  EQU   CVTMAP+183                                               01469000
CVTGTF   EQU   CVTMAP+236                                               01470000
CVTGTFST EQU   CVTGTF                                                   01471000
CVTGTFS  EQU   CVTGTFST                                                 01472000
CVTSTATE EQU   CVTGTFST                                                 01473000
CVTTMODE EQU   CVTGTFST                                                 01474000
CVTFORM  EQU   CVTGTFST                                                 01475000
CVTAQAVT EQU   CVTMAP+240                                               01476000
CVTTCMFG EQU   CVTAQAVT                                                 01477000
CVTVOLM2 EQU   CVTMAP+244                                               01478000
CVTTATA  EQU   CVTVOLM2                                                 01479000
CVTTSKS  EQU   CVTTATA                                                  01480000
CVTVOLF2 EQU   CVTTSKS                                                  01481000
CVTTAT   EQU   CVTTATA+1                                                01482000
CVTATER  EQU   CVTMAP+248                                               01483000
CVTEXT1  EQU   CVTMAP+252                                               01484000
CVTPURG  EQU   CVTMAP+260                                               01485000
CVTQMSG  EQU   CVTMAP+268                                               01486000
CVTDMSR  EQU   CVTMAP+272                                               01487000
CVTRSV37 EQU   CVTDMSR                                                  01488000
CVTDMSRF EQU   CVTRSV37                                                 01489000
CVTERPV  EQU   CVTMAP+316                                               01490000
CVTINTLA EQU   CVTMAP+320                                               01491000
CVTAPF   EQU   CVTMAP+324                                               01492000
CVTEXT2  EQU   CVTMAP+328                                               01493000
CVTHJES  EQU   CVTMAP+332                                               01494000
CVTPGSIA EQU   CVTMAP+348                                               01495000
CVTA1F1  EQU   CVTMAP+356                                               01496000
CVTSYSK  EQU   CVTMAP+357                                               01497000
CVTVOLM1 EQU   CVTMAP+380                                               01498000
CVTVOLF1 EQU   CVTVOLM1                                                 01499000
CVTXTNT1 EQU   0                                                        01500000
CVTXTNT2 EQU   0                                                        01501000
CVTDSSV  EQU   CVTXTNT2                                                 01502000
CVTFLGBT EQU   CVTXTNT2+5                                               01503000
CVTQID   EQU   CVTXTNT2+24                                              01504000
CVTRV400 EQU   CVTXTNT2+52                                              01505000
CVTRV409 EQU   CVTXTNT2+53                                              01506000
CVTATCVT EQU   CVTXTNT2+64                                              01507000
CVTRV429 EQU   CVTXTNT2+84                                              01508000
CVTRV438 EQU   CVTXTNT2+85                                              01509000
CVTRV457 EQU   CVTXTNT2+112                                             01510000
CVTRV466 EQU   CVTXTNT2+113                                             01511000
CVTFIX   EQU   0                                                        01512000
CVTRELNO EQU   CVTFIX+252                                               01513000
CHAIN    EQU   0                                                        01514000
CHFLG    EQU   CHAIN+4                                                  01515000
CHSTS    EQU   CHFLG+2                                                  01516000
CHACT    EQU   CHFLG+3                                                  01517000
CHKEY    EQU   CHAIN+8                                                  01518000
CHPARM   EQU   CHKEY                                                    01519000
CHPKE    EQU   CHAIN+28                                                 01520000
CHTJID   EQU   CHAIN+30                                                 01521000
CHPROCSN EQU   CHAIN+32                                                 01522000
CHACT1   EQU   CHPROCSN+3                                               01523000
CHASM    EQU   CHAIN+40                                                 01524000
CHCIBP   EQU   CHASM+4                                                  01525000
CHRGNSZ  EQU   CHASM+8                                                  01526000
CHSTEP   EQU   CHASM+24                                                 01527000
CHSWT    EQU   CHSTEP                                                   01528000
CHSHORT  EQU   CHASM+32                                                 01529000
TCAST    EQU   0                                                        01530000
TCASUSER EQU   TCAST+4                                                  01531000
TCASUSEC EQU   TCASUSER                                                 01532000
TCASXECB EQU   TCAST+40                                                 01533000
TCASWA   EQU   TCAST+60                                                 01534000
TCASFLG1 EQU   TCAST+88                                                 01535000
TCASABND EQU   TCASFLG1                                                 01536000
TCASNACT EQU   TCASFLG1                                                 01537000
TCASASCB EQU   TCAST+92                                                 01538000
WESTD    EQU   0                                                        01539000
WECODE1  EQU   WESTD                                                    01540000
WECODE1T EQU   WECODE1                                                  01541000
WECODE1F EQU   WECODE1+1                                                01542000
WECODE2  EQU   WESTD+2                                                  01543000
WECODE2T EQU   WECODE2                                                  01544000
WECODE2F EQU   WECODE2+1                                                01545000
WENEXT   EQU   WESTD+4                                                  01546000
WERC     EQU   WESTD+8                                                  01547000
WERC1    EQU   WERC                                                     01548000
WERC2    EQU   WERC+1                                                   01549000
WELEN    EQU   WESTD+10                                                 01550000
WEVNIB   EQU   WESTD+16                                                 01551000
WETERM   EQU   WESTD+28                                                 01552000
WETMFLG  EQU   WESTD+32                                                 01553000
CIBNAME  EQU   0                                                        01554000
CIBASID  EQU   CIBNAME+10                                               01555000
ECB      EQU   0                                                        01556000
ECBRB    EQU   ECB                                                      01557000
ECBEVTB  EQU   ECBRB                                                    01558000
ECBCC    EQU   ECBEVTB                                                  01559000
ECBEVNT  EQU   ECBCC                                                    01560000
ECBPOSTB EQU   ECBEVNT                                                  01561000
ECBCCCNT EQU   ECBEVTB+1                                                01562000
ECBRBA   EQU   ECBCCCNT                                                 01563000
MLWA3    EQU   0                                                        01564000
AREA     EQU   0                                                        01565000
FUNCTION EQU   0                                                        01566000
IKTCAS52 EQU   0                                                        01567000
IKTCAS53 EQU   0                                                        01568000
IKTCAS54 EQU   0                                                        01569000
MSGBLK   EQU   0                                                        01570000
IKTCAS55 EQU   0                                                        01571000
PSARSVTE EQU   PSARSVT                                                  01572000
CVTS01   EQU   CVTPGSIA                                                 01573000
CVTLPDIA EQU   CVTS01+12                                                01574000
CVTDIRST EQU   CVTLPDIA                                                 01575000
CVTSLIDA EQU   CVTS01+24                                                01576000
CVTCTLFG EQU   CVTS01+50                                                01577000
CVTRV210 EQU   CVTS01+424                                               01578000
CVTRV219 EQU   CVTS01+425                                               01579000
CVTRV228 EQU   CVTS01+426                                               01580000
CVTRV237 EQU   CVTS01+427                                               01581000
CVTMFRTR EQU   CVTS01+452                                               01582000
CVTRV262 EQU   CVTS01+468                                               01583000
CVTRV271 EQU   CVTS01+469                                               01584000
CVTRV280 EQU   CVTS01+470                                               01585000
CVTRV289 EQU   CVTS01+471                                               01586000
CVTGSDA  EQU   CVTS01+600                                               01587000
CVTTCASP EQU   CVTS01+664                                               01588000
CHAINS01 EQU   CHASM                                                    01589000
CHTYPE   EQU   CHAINS01+124                                             01590000
CHTRSTAT EQU   CHAINS01+125                                             01591000
CHCSYSO  EQU   CHAINS01+134                                             01592000
MLPMFL2C EQU   MLPMFL2                                                  01593000
FLC      EQU   PSA                                                      01594000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01595000
CHLAST   EQU   CHAINS01+136                                             01596000
CHSPA    EQU   CHAINS01+135                                             01597000
CHUSERID EQU   CHCSYSO                                                  01598000
CHJB     EQU   CHCSYSO                                                  01599000
CHDUMP   EQU   CHCSYSO                                                  01600000
CHQUE    EQU   CHCSYSO                                                  01601000
CHHOLD   EQU   CHCSYSO                                                  01602000
CHOUT    EQU   CHCSYSO                                                  01603000
CHINN    EQU   CHCSYSO                                                  01604000
CHALL    EQU   CHCSYSO                                                  01605000
CHINC    EQU   CHAINS01+132                                             01606000
CHPEND   EQU   CHAINS01+128                                             01607000
CHARID   EQU   CHAINS01+127                                             01608000
CHCNID   EQU   CHAINS01+126                                             01609000
@NM00035 EQU   CHTRSTAT                                                 01610000
CHTSL    EQU   CHTRSTAT                                                 01611000
CHTS     EQU   CHTRSTAT                                                 01612000
CHINITL  EQU   CHTRSTAT                                                 01613000
CHINIT   EQU   CHTRSTAT                                                 01614000
CHJOBSL  EQU   CHTRSTAT                                                 01615000
CHJOBS   EQU   CHTRSTAT                                                 01616000
CHDEF    EQU   CHTYPE                                                   01617000
CHHIAR   EQU   CHTYPE                                                   01618000
CHARSV29 EQU   CHTYPE                                                   01619000
CHARSV28 EQU   CHTYPE                                                   01620000
CHARSV27 EQU   CHTYPE                                                   01621000
CHARSV26 EQU   CHTYPE                                                   01622000
CHARSV25 EQU   CHTYPE                                                   01623000
CHDSTAT  EQU   CHTYPE                                                   01624000
CHBUF    EQU   CHAINS01                                                 01625000
CVTRV628 EQU   CVTS01+728                                               01626000
CVTRV627 EQU   CVTS01+724                                               01627000
CVTRV626 EQU   CVTS01+720                                               01628000
CVTRV625 EQU   CVTS01+716                                               01629000
CVTRV624 EQU   CVTS01+712                                               01630000
CVTRV623 EQU   CVTS01+708                                               01631000
CVTRV622 EQU   CVTS01+704                                               01632000
CVTRV621 EQU   CVTS01+700                                               01633000
CVTIHASU EQU   CVTS01+696                                               01634000
CVTSUSP  EQU   CVTS01+692                                               01635000
CVTT6SVC EQU   CVTS01+688                                               01636000
CVTCDAL  EQU   CVTS01+684                                               01637000
CVTTCTL  EQU   CVTS01+680                                               01638000
CVTRSUME EQU   CVTS01+676                                               01639000
CVTJTERM EQU   CVTS01+672                                               01640000
CVTASMRM EQU   CVTS01+668                                               01641000
CVT0PT03 EQU   CVTS01+660                                               01642000
CVT0PT0E EQU   CVTS01+656                                               01643000
CVTRV609 EQU   CVTS01+652                                               01644000
CVTCGK   EQU   CVTS01+648                                               01645000
CVTRAC   EQU   CVTS01+644                                               01646000
CVTRV606 EQU   CVTS01+640                                               01647000
CVTRV605 EQU   CVTS01+636                                               01648000
CVTRV604 EQU   CVTS01+632                                               01649000
CVTEFF02 EQU   CVTS01+628                                               01650000
CVTCBBR  EQU   CVTS01+624                                               01651000
CVTSSCR  EQU   CVTS01+620                                               01652000
CVTEVENT EQU   CVTS01+616                                               01653000
CVTCRCA  EQU   CVTS01+612                                               01654000
CVTTPIO  EQU   CVTS01+608                                               01655000
CVTADV   EQU   CVTS01+604                                               01656000
CVTGSDAB EQU   CVTGSDA                                                  01657000
CVTQV3   EQU   CVTS01+596                                               01658000
CVTQV2   EQU   CVTS01+592                                               01659000
CVTQV1   EQU   CVTS01+588                                               01660000
CVTRPT   EQU   CVTS01+584                                               01661000
CVTSSRB  EQU   CVTS01+580                                               01662000
CVTCSDRL EQU   CVTS01+576                                               01663000
CVTEXP1  EQU   CVTS01+572                                               01664000
CVTRMPMT EQU   CVTS01+568                                               01665000
CVTRMPTT EQU   CVTS01+564                                               01666000
CVTVPSA  EQU   CVTS01+560                                               01667000
CVTVSTOP EQU   CVTS01+556                                               01668000
CVTGTFR8 EQU   CVTS01+552                                               01669000
CVTQUIT  EQU   CVTS01+548                                               01670000
CVTVACR  EQU   CVTS01+544                                               01671000
CVTWTCB  EQU   CVTS01+540                                               01672000
CVTSTPRS EQU   CVTS01+536                                               01673000
CVT0PT02 EQU   CVTS01+532                                               01674000
CVTDARCM EQU   CVTS01+528                                               01675000
CVTIRECM EQU   CVTS01+524                                               01676000
CVTJRECM EQU   CVTS01+520                                               01677000
CVTVEMS0 EQU   CVTS01+516                                               01678000
CVTSPFRR EQU   CVTS01+512                                               01679000
CVTRLSTG EQU   CVTS01+508                                               01680000
CVT0TC0A EQU   CVTS01+504                                               01681000
CVTGMBR  EQU   CVTS01+500                                               01682000
CVTLFRM  EQU   CVTS01+496                                               01683000
CVTRMBR  EQU   CVTS01+492                                               01684000
CVTVIOP  EQU   CVTS01+488                                               01685000
CVTRV307 EQU   CVTS01+486                                               01686000
CVTRV306 EQU   CVTS01+484                                               01687000
CVTRV305 EQU   CVTS01+482                                               01688000
CVTRV304 EQU   CVTS01+480                                               01689000
CVTRV303 EQU   CVTS01+478                                               01690000
CVTRV302 EQU   CVTS01+476                                               01691000
CVTTRCA  EQU   CVTS01+472                                               01692000
CVTRV297 EQU   CVTRV289                                                 01693000
CVTRV296 EQU   CVTRV289                                                 01694000
CVTRV295 EQU   CVTRV289                                                 01695000
CVTRV294 EQU   CVTRV289                                                 01696000
CVTRV293 EQU   CVTRV289                                                 01697000
CVTRV292 EQU   CVTRV289                                                 01698000
CVTRV291 EQU   CVTRV289                                                 01699000
CVTRV290 EQU   CVTRV289                                                 01700000
CVTRV288 EQU   CVTRV280                                                 01701000
CVTRV287 EQU   CVTRV280                                                 01702000
CVTRV286 EQU   CVTRV280                                                 01703000
CVTRV285 EQU   CVTRV280                                                 01704000
CVTRV284 EQU   CVTRV280                                                 01705000
CVTRV283 EQU   CVTRV280                                                 01706000
CVTRV282 EQU   CVTRV280                                                 01707000
CVTRV281 EQU   CVTRV280                                                 01708000
CVTRV279 EQU   CVTRV271                                                 01709000
CVTRV278 EQU   CVTRV271                                                 01710000
CVTRV277 EQU   CVTRV271                                                 01711000
CVTRV276 EQU   CVTRV271                                                 01712000
CVTRV275 EQU   CVTRV271                                                 01713000
CVTRV274 EQU   CVTRV271                                                 01714000
CVTRV273 EQU   CVTRV271                                                 01715000
CVTRV272 EQU   CVTRV271                                                 01716000
CVTRV270 EQU   CVTRV262                                                 01717000
CVTRV269 EQU   CVTRV262                                                 01718000
CVTRV268 EQU   CVTRV262                                                 01719000
CVTRV267 EQU   CVTRV262                                                 01720000
CVTRV266 EQU   CVTRV262                                                 01721000
CVTRV265 EQU   CVTRV262                                                 01722000
CVTRV264 EQU   CVTRV262                                                 01723000
CVTRV263 EQU   CVTRV262                                                 01724000
CVTVFP   EQU   CVTS01+464                                               01725000
CVTVSI   EQU   CVTS01+460                                               01726000
CVTVPSIB EQU   CVTS01+456                                               01727000
CVTMFACT EQU   CVTMFRTR                                                 01728000
CVTMFCTL EQU   CVTS01+448                                               01729000
CVTPVBP  EQU   CVTS01+444                                               01730000
CVTPWI   EQU   CVTS01+440                                               01731000
CVTRV254 EQU   CVTS01+438                                               01732000
CVTRV253 EQU   CVTS01+436                                               01733000
CVTRV252 EQU   CVTS01+434                                               01734000
CVTRV251 EQU   CVTS01+433                                               01735000
CVTRV250 EQU   CVTS01+432                                               01736000
CVTRV249 EQU   CVTS01+431                                               01737000
CVTRV248 EQU   CVTS01+430                                               01738000
CVTRV247 EQU   CVTS01+429                                               01739000
CVTRV246 EQU   CVTS01+428                                               01740000
CVTRV245 EQU   CVTRV237                                                 01741000
CVTRV244 EQU   CVTRV237                                                 01742000
CVTRV243 EQU   CVTRV237                                                 01743000
CVTRV242 EQU   CVTRV237                                                 01744000
CVTRV241 EQU   CVTRV237                                                 01745000
CVTRV240 EQU   CVTRV237                                                 01746000
CVTRV239 EQU   CVTRV237                                                 01747000
CVTRV238 EQU   CVTRV237                                                 01748000
CVTRV236 EQU   CVTRV228                                                 01749000
CVTRV235 EQU   CVTRV228                                                 01750000
CVTRV234 EQU   CVTRV228                                                 01751000
CVTRV233 EQU   CVTRV228                                                 01752000
CVTRV232 EQU   CVTRV228                                                 01753000
CVTRV231 EQU   CVTRV228                                                 01754000
CVTRV230 EQU   CVTRV228                                                 01755000
CVTRV229 EQU   CVTRV228                                                 01756000
CVTRV227 EQU   CVTRV219                                                 01757000
CVTRV226 EQU   CVTRV219                                                 01758000
CVTRV225 EQU   CVTRV219                                                 01759000
CVTRV224 EQU   CVTRV219                                                 01760000
CVTRV223 EQU   CVTRV219                                                 01761000
CVTRV222 EQU   CVTRV219                                                 01762000
CVTRV221 EQU   CVTRV219                                                 01763000
CVTRV220 EQU   CVTRV219                                                 01764000
CVTRV218 EQU   CVTRV210                                                 01765000
CVTRV217 EQU   CVTRV210                                                 01766000
CVTRV216 EQU   CVTRV210                                                 01767000
CVTRV215 EQU   CVTRV210                                                 01768000
CVTRV214 EQU   CVTRV210                                                 01769000
CVTRV213 EQU   CVTRV210                                                 01770000
CVTRV212 EQU   CVTRV210                                                 01771000
CVTRV211 EQU   CVTRV210                                                 01772000
CVTLCCAT EQU   CVTS01+420                                               01773000
CVTPCCAT EQU   CVTS01+416                                               01774000
CVTIPCRP EQU   CVTS01+412                                               01775000
CVTIPCRI EQU   CVTS01+408                                               01776000
CVTIPCDS EQU   CVTS01+404                                               01777000
CVTAIDVT EQU   CVTS01+400                                               01778000
CVTSSAP  EQU   CVTS01+396                                               01779000
CVTEHCIR EQU   CVTS01+392                                               01780000
CVTEHDEF EQU   CVTS01+388                                               01781000
CVTDAIR  EQU   CVTS01+384                                               01782000
CVTPERFM EQU   CVTS01+380                                               01783000
CVT044R2 EQU   CVTS01+376                                               01784000
CVTFETCH EQU   CVTS01+372                                               01785000
CVTRSTWD EQU   CVTS01+368                                               01786000
CVTSPOST EQU   CVTS01+364                                               01787000
CVTIOBP  EQU   CVTS01+360                                               01788000
CVTASMVT EQU   CVTS01+356                                               01789000
CVTRECRQ EQU   CVTS01+352                                               01790000
CVTWSAC  EQU   CVTS01+348                                               01791000
CVTRV149 EQU   CVTS01+344                                               01792000
CVTWSAL  EQU   CVTS01+340                                               01793000
CVTSPSA  EQU   CVTS01+336                                               01794000
CVTGLMN  EQU   CVTS01+332                                               01795000
CVTVEAC0 EQU   CVTS01+328                                               01796000
CVT062R1 EQU   CVTS01+324                                               01797000
CVTRPOST EQU   CVTS01+320                                               01798000
CVTDQIQE EQU   CVTS01+316                                               01799000
CVTCSD   EQU   CVTS01+312                                               01800000
CVTLKRMA EQU   CVTS01+308                                               01801000
CVTRSPIE EQU   CVTS01+304                                               01802000
CVTRENQ  EQU   CVTS01+300                                               01803000
CVTLQCB  EQU   CVTS01+296                                               01804000
CVTFQCB  EQU   CVTS01+292                                               01805000
CVTQCS01 EQU   CVTS01+288                                               01806000
CVTAPFT  EQU   CVTS01+284                                               01807000
CVTPARRL EQU   CVTS01+280                                               01808000
CVTVWAIT EQU   CVTS01+276                                               01809000
CVTGSPL  EQU   CVTS01+272                                               01810000
CVTLSMQ  EQU   CVTS01+268                                               01811000
CVTGSMQ  EQU   CVTS01+264                                               01812000
CVTEXPRO EQU   CVTS01+260                                               01813000
CVTOPCTP EQU   CVTS01+256                                               01814000
CVTSIC   EQU   CVTS01+252                                               01815000
CVTTPIOS EQU   CVTS01+248                                               01816000
CVTRTMS  EQU   CVTS01+244                                               01817000
CVTSDBF  EQU   CVTS01+240                                               01818000
CVTSCBP  EQU   CVTS01+236                                               01819000
CVTSDMP  EQU   CVTS01+232                                               01820000
CVTSV60  EQU   CVTS01+228                                               01821000
CVTRTMCT EQU   CVTS01+224                                               01822000
CVTASCBL EQU   CVTS01+220                                               01823000
CVTASCBH EQU   CVTS01+216                                               01824000
CVTGDA   EQU   CVTS01+212                                               01825000
CVTASVT  EQU   CVTS01+208                                               01826000
CVTVVMDI EQU   CVTS01+204                                               01827000
CVTAQTOP EQU   CVTS01+200                                               01828000
CVTIOSCS EQU   CVTS01+196                                               01829000
CVTSDRM  EQU   CVTS01+192                                               01830000
CVTOPTE  EQU   CVTS01+188                                               01831000
CVTSTXU  EQU   CVTS01+184                                               01832000
CVTQUIS  EQU   CVTS01+180                                               01833000
CVTPARS  EQU   CVTS01+176                                               01834000
CVTS1EE  EQU   CVTS01+172                                               01835000
CVTFRAS  EQU   CVTS01+168                                               01836000
CVTQSAS  EQU   CVTS01+164                                               01837000
CVTCRAS  EQU   CVTS01+160                                               01838000
CVTCRMN  EQU   CVTS01+156                                               01839000
CVTDELCP EQU   CVTS01+152                                               01840000
CVTFRECL EQU   CVTS01+148                                               01841000
CVTGETCL EQU   CVTS01+144                                               01842000
CVTBLDCP EQU   CVTS01+140                                               01843000
CVTAUTHL EQU   CVTS01+136                                               01844000
CVTSCAN  EQU   CVTS01+132                                               01845000
CVTRV144 EQU   CVTS01+130                                               01846000
CVTMAXMP EQU   CVTS01+128                                               01847000
CVTSTCK  EQU   CVTS01+124                                               01848000
CVTRV139 EQU   CVTS01+123                                               01849000
CVTDSSAC EQU   CVTS01+122                                               01850000
CVTRV513 EQU   CVTS01+121                                               01851000
CVTIOSPL EQU   CVTS01+120                                               01852000
CVTPTGT  EQU   CVTS01+116                                               01853000
CVTCSPIE EQU   CVTS01+112                                               01854000
CVTSMFEX EQU   CVTS01+108                                               01855000
CVTOLT0A EQU   CVTS01+104                                               01856000
CVTSRBRT EQU   CVTS01+100                                               01857000
CVTPUTL  EQU   CVTS01+96                                                01858000
CVTASCRL EQU   CVTS01+92                                                01859000
CVTASCRF EQU   CVTS01+88                                                01860000
CVTRV326 EQU   CVTS01+84                                                01861000
CVTRV325 EQU   CVTS01+80                                                01862000
CVTRV324 EQU   CVTS01+76                                                01863000
CVT0VL01 EQU   CVTS01+72                                                01864000
CVTSHRVM EQU   CVTS01+68                                                01865000
CVTRV332 EQU   CVTS01+64                                                01866000
CVTTAS   EQU   CVTS01+60                                                01867000
CVTRSCN  EQU   CVTS01+56                                                01868000
CVTTRAC2 EQU   CVTS01+54                                                01869000
CVTTRACE EQU   CVTS01+52                                                01870000
CVTAPG   EQU   CVTS01+51                                                01871000
CVTSDTRC EQU   CVTCTLFG                                                 01872000
CVTGTRCE EQU   CVTCTLFG                                                 01873000
CVTNOMP  EQU   CVTCTLFG                                                 01874000
CVTRSV79 EQU   CVTCTLFG                                                 01875000
CVTDSTAT EQU   CVTCTLFG                                                 01876000
CVTRSV78 EQU   CVTCTLFG                                                 01877000
CVTRV333 EQU   CVTCTLFG                                                 01878000
CVTRV323 EQU   CVTCTLFG                                                 01879000
CVTSPVLK EQU   CVTS01+49                                                01880000
CVTRSV77 EQU   CVTS01+48                                                01881000
CVTRV331 EQU   CVTS01+44                                                01882000
CVTRV330 EQU   CVTS01+40                                                01883000
CVTRV329 EQU   CVTS01+36                                                01884000
CVTRV328 EQU   CVTS01+32                                                01885000
CVTRV322 EQU   CVTS01+28                                                01886000
CVTSLID  EQU   CVTSLIDA+1                                               01887000
CVTSYLK  EQU   CVTSLIDA                                                 01888000
CVTRV321 EQU   CVTS01+20                                                01889000
CVTRV320 EQU   CVTS01+16                                                01890000
CVTLPDIR EQU   CVTLPDIA+1                                               01891000
CVTRSV69 EQU   CVTDIRST                                                 01892000
CVTRSV68 EQU   CVTDIRST                                                 01893000
CVTRSV67 EQU   CVTDIRST                                                 01894000
CVTRSV66 EQU   CVTDIRST                                                 01895000
CVTRSV65 EQU   CVTDIRST                                                 01896000
CVTRSV64 EQU   CVTDIRST                                                 01897000
CVTRSV63 EQU   CVTDIRST                                                 01898000
CVTDICOM EQU   CVTDIRST                                                 01899000
CVTPVTP  EQU   CVTS01+8                                                 01900000
CVTLPDSR EQU   CVTS01+4                                                 01901000
CVTGETL  EQU   CVTS01                                                   01902000
PSARSAV  EQU   PSARSVTE+60                                              01903000
PSARSTK  EQU   PSARSVTE+56                                              01904000
PSAESAV3 EQU   PSARSVTE+52                                              01905000
PSAESTK3 EQU   PSARSVTE+48                                              01906000
PSAESAV2 EQU   PSARSVTE+44                                              01907000
PSAESTK2 EQU   PSARSVTE+40                                              01908000
PSAESAV1 EQU   PSARSVTE+36                                              01909000
PSAESTK1 EQU   PSARSVTE+32                                              01910000
PSAPSAV  EQU   PSARSVTE+28                                              01911000
PSAPSTK  EQU   PSARSVTE+24                                              01912000
PSAMSAV  EQU   PSARSVTE+20                                              01913000
PSAMSTK  EQU   PSARSVTE+16                                              01914000
PSASSAV  EQU   PSARSVTE+12                                              01915000
PSASSTK  EQU   PSARSVTE+8                                               01916000
PSANSTK  EQU   PSARSVTE+4                                               01917000
PSACSTK  EQU   PSARSVTE                                                 01918000
ECBEVTBA EQU   ECBRBA                                                   01919000
@NM00045 EQU   ECBCC                                                    01920000
ECBWAITB EQU   ECBEVNT                                                  01921000
CIBDATA  EQU   CIBNAME+16                                               01922000
CIBDATLN EQU   CIBNAME+14                                               01923000
@NM00044 EQU   CIBNAME+13                                               01924000
CIBCONID EQU   CIBNAME+12                                               01925000
CIBTJID  EQU   CIBASID                                                  01926000
@NM00043 EQU   CIBNAME+6                                                01927000
CIBLEN   EQU   CIBNAME+5                                                01928000
CIBVERB  EQU   CIBNAME+4                                                01929000
CIBNEXT  EQU   CIBNAME                                                  01930000
WELMODE  EQU   WESTD+76                                                 01931000
WEALTC   EQU   WESTD+75                                                 01932000
WEALTR   EQU   WESTD+74                                                 01933000
WEPRMC   EQU   WESTD+73                                                 01934000
WEPRMR   EQU   WESTD+72                                                 01935000
WEBIND   EQU   WESTD+36                                                 01936000
@NM00042 EQU   WESTD+35                                                 01937000
WERUSZO  EQU   WESTD+34                                                 01938000
WERUSZI  EQU   WESTD+33                                                 01939000
@NM00041 EQU   WETMFLG                                                  01940000
WENOSW   EQU   WETMFLG                                                  01941000
WEFLG1   EQU   WETMFLG                                                  01942000
WETMBF   EQU   WETERM+2                                                 01943000
WESUBT   EQU   WETERM+1                                                 01944000
WETMTP   EQU   WETERM                                                   01945000
WELBUF   EQU   WESTD+24                                                 01946000
WEVRPL   EQU   WESTD+20                                                 01947000
WEUECB   EQU   WEVNIB                                                   01948000
WEUASCB  EQU   WESTD+12                                                 01949000
WECD2MIF EQU   WECODE2F                                                 01950000
WECD2MAF EQU   WECODE2F                                                 01951000
WECDMIF  EQU   WECODE1F                                                 01952000
WECDMAF  EQU   WECODE1F                                                 01953000
TCASTEND EQU   TCAST+148                                                01954000
TCASTTYO EQU   TCAST+144                                                01955000
TCAS767O EQU   TCAST+140                                                01956000
TCAS767I EQU   TCAST+136                                                01957000
TCASDUMP EQU   TCAST+132                                                01958000
TCASSCHD EQU   TCAST+128                                                01959000
TCASTPND EQU   TCAST+124                                                01960000
TCASOMJR EQU   TCAST+120                                                01961000
@NM00040 EQU   TCAST+118                                                01962000
TCASBR14 EQU   TCAST+116                                                01963000
TCASATTN EQU   TCAST+112                                                01964000
TCASASCI EQU   TCAST+108                                                01965000
TCASTTQH EQU   TCAST+104                                                01966000
@NM00039 EQU   TCAST+102                                                01967000
@NM00038 EQU   TCAST+100                                                01968000
TCASTGTF EQU   TCAST+96                                                 01969000
TCASFLG4 EQU   TCAST+91                                                 01970000
TCASFLG3 EQU   TCAST+90                                                 01971000
TCASFLG2 EQU   TCAST+89                                                 01972000
TCASCONF EQU   TCASFLG1                                                 01973000
@NM00037 EQU   TCASFLG1                                                 01974000
TCASHAST EQU   TCASFLG1                                                 01975000
TCASVSD  EQU   TCASFLG1                                                 01976000
TCASMDSW EQU   TCASFLG1                                                 01977000
TCASBKMD EQU   TCASFLG1                                                 01978000
TCASLTE  EQU   TCAST+84                                                 01979000
TCASEXIT EQU   TCAST+80                                                 01980000
TCASOQM  EQU   TCAST+76                                                 01981000
TCASIQM  EQU   TCAST+72                                                 01982000
TCASTSB  EQU   TCAST+68                                                 01983000
TCASTTL  EQU   TCAST+64                                                 01984000
TCASFRR  EQU   TCAST+56                                                 01985000
TCASMSGS EQU   TCAST+52                                                 01986000
TCASDATO EQU   TCAST+48                                                 01987000
TCASDATI EQU   TCAST+44                                                 01988000
TCASTID  EQU   TCAST+32                                                 01989000
@NM00036 EQU   TCAST+31                                                 01990000
TCASCHNL EQU   TCAST+30                                                 01991000
TCASCRSZ EQU   TCAST+28                                                 01992000
TCASLBUF EQU   TCAST+24                                                 01993000
TCASHBUF EQU   TCAST+20                                                 01994000
TCASCLSZ EQU   TCAST+18                                                 01995000
TCASRCON EQU   TCAST+16                                                 01996000
TCASACBP EQU   TCAST+8                                                  01997000
TCASUMAX EQU   TCASUSER+2                                               01998000
TCASID   EQU   TCAST                                                    01999000
CHARSV16 EQU   CHSHORT+100                                              02000000
CHARSV15 EQU   CHSHORT+96                                               02001000
CHJSCBVS EQU   CHSHORT+92                                               02002000
CHUSCVS  EQU   CHSHORT+88                                               02003000
@NM00034 EQU   CHSHORT+84                                               02004000
@NM00033 EQU   CHSHORT+80                                               02005000
CHSQA    EQU   CHSHORT+44                                               02006000
CHQPA    EQU   CHSHORT+8                                                02007000
CHJCL    EQU   CHSHORT+4                                                02008000
CHSPC    EQU   CHSHORT                                                  02009000
CHSPB    EQU   CHSTEP+4                                                 02010000
CHTCB    EQU   CHSTEP+1                                                 02011000
CHARSV23 EQU   CHSWT                                                    02012000
CHARSV22 EQU   CHSWT                                                    02013000
CHARSV21 EQU   CHSWT                                                    02014000
CHAC     EQU   CHSWT                                                    02015000
CHPSF    EQU   CHSWT                                                    02016000
CHPSD    EQU   CHSWT                                                    02017000
CHJCT    EQU   CHSWT                                                    02018000
CHARSV20 EQU   CHSWT                                                    02019000
CHCECB   EQU   CHASM+20                                                 02020000
CHECB    EQU   CHASM+16                                                 02021000
CHRGNAD  EQU   CHASM+12                                                 02022000
CHARSV18 EQU   CHRGNSZ+1                                                02023000
CHRPRTY  EQU   CHRGNSZ                                                  02024000
@NM00032 EQU   CHCIBP                                                   02025000
CHEND    EQU   CHCIBP                                                   02026000
CHECBP   EQU   CHASM                                                    02027000
CHDER    EQU   CHPROCSN+4                                               02028000
CHARSV10 EQU   CHACT1                                                   02029000
CHARSV09 EQU   CHACT1                                                   02030000
CHARSV08 EQU   CHACT1                                                   02031000
CHARSV07 EQU   CHACT1                                                   02032000
CHARSV06 EQU   CHACT1                                                   02033000
CHARSV05 EQU   CHACT1                                                   02034000
CHARSV04 EQU   CHACT1                                                   02035000
CHRDWTR  EQU   CHACT1                                                   02036000
CHARSV30 EQU   CHPROCSN+2                                               02037000
CHQID    EQU   CHPROCSN                                                 02038000
CHASID   EQU   CHTJID                                                   02039000
CHUCMP   EQU   CHAIN+29                                                 02040000
CHTRKID  EQU   CHPKE                                                    02041000
CHCIBCTR EQU   CHAIN+27                                                 02042000
CHUNIT   EQU   CHAIN+24                                                 02043000
CHCLS    EQU   CHAIN+16                                                 02044000
CHPCOI   EQU   CHPARM                                                   02045000
CHIFY    EQU   CHACT                                                    02046000
CHAIFX   EQU   CHACT                                                    02047000
CHCLD    EQU   CHACT                                                    02048000
CHCL     EQU   CHACT                                                    02049000
CHDSI    EQU   CHACT                                                    02050000
CHDISC   EQU   CHACT                                                    02051000
CHTERM   EQU   CHACT                                                    02052000
CHSWAP   EQU   CHACT                                                    02053000
CHABTERM EQU   CHSTS                                                    02054000
CHFC     EQU   CHSTS                                                    02055000
CHDL     EQU   CHSTS                                                    02056000
CHAD     EQU   CHSTS                                                    02057000
CHQSPC   EQU   CHSTS                                                    02058000
CHSOUT   EQU   CHSTS                                                    02059000
CHSYS    EQU   CHSTS                                                    02060000
CHAP     EQU   CHSTS                                                    02061000
CHSZE    EQU   CHFLG+1                                                  02062000
CHVCD    EQU   CHFLG                                                    02063000
CHPTR    EQU   CHAIN                                                    02064000
CVTLEVL  EQU   CVTRELNO+2                                               02065000
CVTNUMB  EQU   CVTRELNO                                                 02066000
CVTMDL   EQU   CVTFIX+250                                               02067000
@NM00031 EQU   CVTFIX+248                                               02068000
@NM00030 EQU   CVTFIX                                                   02069000
CVTRV482 EQU   CVTXTNT2+128                                             02070000
CVTRV481 EQU   CVTXTNT2+124                                             02071000
CVTRV480 EQU   CVTXTNT2+120                                             02072000
CVTRV479 EQU   CVTXTNT2+118                                             02073000
CVTRV478 EQU   CVTXTNT2+117                                             02074000
CVTRV477 EQU   CVTXTNT2+116                                             02075000
CVTRV476 EQU   CVTXTNT2+115                                             02076000
CVTRV475 EQU   CVTXTNT2+114                                             02077000
CVTRV474 EQU   CVTRV466                                                 02078000
CVTRV473 EQU   CVTRV466                                                 02079000
CVTRV472 EQU   CVTRV466                                                 02080000
CVTRV471 EQU   CVTRV466                                                 02081000
CVTRV470 EQU   CVTRV466                                                 02082000
CVTRV469 EQU   CVTRV466                                                 02083000
CVTRV468 EQU   CVTRV466                                                 02084000
CVTRV467 EQU   CVTRV466                                                 02085000
CVTRV465 EQU   CVTRV457                                                 02086000
CVTRV464 EQU   CVTRV457                                                 02087000
CVTRV463 EQU   CVTRV457                                                 02088000
CVTRV462 EQU   CVTRV457                                                 02089000
CVTRV461 EQU   CVTRV457                                                 02090000
CVTRV460 EQU   CVTRV457                                                 02091000
CVTRV459 EQU   CVTRV457                                                 02092000
CVTRV458 EQU   CVTRV457                                                 02093000
CVTRV456 EQU   CVTXTNT2+108                                             02094000
CVTRV455 EQU   CVTXTNT2+104                                             02095000
CVTRV454 EQU   CVTXTNT2+100                                             02096000
CVTRV453 EQU   CVTXTNT2+96                                              02097000
CVTRV452 EQU   CVTXTNT2+94                                              02098000
CVTRV451 EQU   CVTXTNT2+92                                              02099000
CVTRV450 EQU   CVTXTNT2+90                                              02100000
CVTRV449 EQU   CVTXTNT2+88                                              02101000
CVTRV448 EQU   CVTXTNT2+87                                              02102000
CVTRV447 EQU   CVTXTNT2+86                                              02103000
CVTRV446 EQU   CVTRV438                                                 02104000
CVTRV445 EQU   CVTRV438                                                 02105000
CVTRV444 EQU   CVTRV438                                                 02106000
CVTRV443 EQU   CVTRV438                                                 02107000
CVTRV442 EQU   CVTRV438                                                 02108000
CVTRV441 EQU   CVTRV438                                                 02109000
CVTRV440 EQU   CVTRV438                                                 02110000
CVTRV439 EQU   CVTRV438                                                 02111000
CVTRV437 EQU   CVTRV429                                                 02112000
CVTRV436 EQU   CVTRV429                                                 02113000
CVTRV435 EQU   CVTRV429                                                 02114000
CVTRV434 EQU   CVTRV429                                                 02115000
CVTRV433 EQU   CVTRV429                                                 02116000
CVTRV432 EQU   CVTRV429                                                 02117000
CVTRV431 EQU   CVTRV429                                                 02118000
CVTRV430 EQU   CVTRV429                                                 02119000
CVTRV428 EQU   CVTXTNT2+80                                              02120000
CVTRV427 EQU   CVTXTNT2+76                                              02121000
CVTRV426 EQU   CVTXTNT2+72                                              02122000
CVTRV425 EQU   CVTXTNT2+68                                              02123000
CVTATACT EQU   CVTATCVT                                                 02124000
CVTRV423 EQU   CVTXTNT2+62                                              02125000
CVTRV422 EQU   CVTXTNT2+60                                              02126000
CVTRV421 EQU   CVTXTNT2+58                                              02127000
CVTRV420 EQU   CVTXTNT2+56                                              02128000
CVTRV419 EQU   CVTXTNT2+55                                              02129000
CVTRV418 EQU   CVTXTNT2+54                                              02130000
CVTRV417 EQU   CVTRV409                                                 02131000
CVTRV416 EQU   CVTRV409                                                 02132000
CVTRV415 EQU   CVTRV409                                                 02133000
CVTRV414 EQU   CVTRV409                                                 02134000
CVTRV413 EQU   CVTRV409                                                 02135000
CVTRV412 EQU   CVTRV409                                                 02136000
CVTRV411 EQU   CVTRV409                                                 02137000
CVTRV410 EQU   CVTRV409                                                 02138000
CVTRV408 EQU   CVTRV400                                                 02139000
CVTRV407 EQU   CVTRV400                                                 02140000
CVTRV406 EQU   CVTRV400                                                 02141000
CVTRV405 EQU   CVTRV400                                                 02142000
CVTRV404 EQU   CVTRV400                                                 02143000
CVTRV403 EQU   CVTRV400                                                 02144000
CVTRV402 EQU   CVTRV400                                                 02145000
CVTRV401 EQU   CVTRV400                                                 02146000
CVTICB   EQU   CVTXTNT2+48                                              02147000
CVTSKTA  EQU   CVTXTNT2+44                                              02148000
CVTCCVT  EQU   CVTXTNT2+40                                              02149000
CVTRSV98 EQU   CVTXTNT2+36                                              02150000
CVTRSV97 EQU   CVTXTNT2+34                                              02151000
CVTRSV96 EQU   CVTXTNT2+32                                              02152000
CVTOLTEP EQU   CVTXTNT2+28                                              02153000
CVTQIDA  EQU   CVTQID+1                                                 02154000
CVTRSV95 EQU   CVTQID                                                   02155000
CVTRSV94 EQU   CVTXTNT2+20                                              02156000
CVTRSV93 EQU   CVTXTNT2+16                                              02157000
CVTRSV92 EQU   CVTXTNT2+12                                              02158000
CVTDEBVR EQU   CVTXTNT2+8                                               02159000
CVTRSV91 EQU   CVTXTNT2+6                                               02160000
CVTRSV9H EQU   CVTFLGBT                                                 02161000
CVTRSV9G EQU   CVTFLGBT                                                 02162000
CVTRSV9F EQU   CVTFLGBT                                                 02163000
CVTRSV9E EQU   CVTFLGBT                                                 02164000
CVTRSV9D EQU   CVTFLGBT                                                 02165000
CVTBAH   EQU   CVTFLGBT                                                 02166000
CVTVME   EQU   CVTFLGBT                                                 02167000
CVTNPE   EQU   CVTFLGBT                                                 02168000
CVTNUCLS EQU   CVTXTNT2+4                                               02169000
CVTDSSVA EQU   CVTDSSV+1                                                02170000
CVTRSV89 EQU   CVTDSSV                                                  02171000
CVTRSV88 EQU   CVTXTNT1+8                                               02172000
CVTRSV87 EQU   CVTXTNT1+4                                               02173000
CVTFACHN EQU   CVTXTNT1                                                 02174000
CVTRV488 EQU   CVTMAP+412                                               02175000
CVTRV487 EQU   CVTMAP+408                                               02176000
CVTRV486 EQU   CVTMAP+404                                               02177000
CVTRV485 EQU   CVTMAP+400                                               02178000
CVTACTAP EQU   CVTMAP+396                                               02179000
CVTAUTH  EQU   CVTMAP+392                                               02180000
CVTRV490 EQU   CVTMAP+388                                               02181000
CVTSU    EQU   CVTMAP+384                                               02182000
CVTVOLT1 EQU   CVTVOLM1+1                                               02183000
CVTVOLI1 EQU   CVTVOLF1                                                 02184000
CVTSTOA  EQU   CVTMAP+376                                               02185000
CVTRSV58 EQU   CVTMAP+374                                               02186000
CVTRSV57 EQU   CVTMAP+372                                               02187000
CVTDDCE  EQU   CVTMAP+368                                               02188000
CVTPNWFR EQU   CVTMAP+364                                               02189000
CVTSMF   EQU   CVTMAP+360                                               02190000
CVTSULK  EQU   CVTMAP+358                                               02191000
CVTSLKO  EQU   CVTSYSK                                                  02192000
CVTSLKP  EQU   CVTSYSK                                                  02193000
CVTSLKQ  EQU   CVTSYSK                                                  02194000
CVTSLKR  EQU   CVTSYSK                                                  02195000
CVTRSV56 EQU   CVTSYSK                                                  02196000
CVTRSV55 EQU   CVTSYSK                                                  02197000
CVTRSV54 EQU   CVTSYSK                                                  02198000
CVTRSV53 EQU   CVTSYSK                                                  02199000
CVTRSV52 EQU   CVTA1F1                                                  02200000
CVTRSV51 EQU   CVTA1F1                                                  02201000
CVTRSV50 EQU   CVTA1F1                                                  02202000
CVTRSV49 EQU   CVTA1F1                                                  02203000
CVTRSV48 EQU   CVTA1F1                                                  02204000
CVTRSV47 EQU   CVTA1F1                                                  02205000
CVTSRSW  EQU   CVTA1F1                                                  02206000
CVTPFSW  EQU   CVTA1F1                                                  02207000
CVTPCVT  EQU   CVTMAP+352                                               02208000
CVTRSV46 EQU   CVTMAP+344                                               02209000
CVTRSV45 EQU   CVTMAP+340                                               02210000
CVTRSV44 EQU   CVTMAP+338                                               02211000
CVTRSV43 EQU   CVTMAP+336                                               02212000
CVTHJESA EQU   CVTHJES+1                                                02213000
CVTRSV42 EQU   CVTHJES                                                  02214000
CVTEXT2A EQU   CVTEXT2+1                                                02215000
CVTRSV41 EQU   CVTEXT2                                                  02216000
CVTAPFA  EQU   CVTAPF+1                                                 02217000
CVTRSV40 EQU   CVTAPF                                                   02218000
CVTRV518 EQU   CVTINTLA                                                 02219000
CVTRV517 EQU   CVTERPV                                                  02220000
CVTEORM  EQU   CVTMAP+312                                               02221000
CVTMCHPR EQU   CVTMAP+308                                               02222000
CVTTZ    EQU   CVTMAP+304                                               02223000
CVTJEPS  EQU   CVTMAP+300                                               02224000
CVTJESCT EQU   CVTMAP+296                                               02225000
CVTMODE  EQU   CVTMAP+292                                               02226000
CVTPTRV  EQU   CVTMAP+288                                               02227000
CVTREAL  EQU   CVTMAP+284                                               02228000
CVTRSV39 EQU   CVTMAP+280                                               02229000
CVTRSV38 EQU   CVTMAP+276                                               02230000
CVTDMSRA EQU   CVTDMSR+1                                                02231000
CVTRV634 EQU   CVTDMSRF                                                 02232000
CVTRV633 EQU   CVTDMSRF                                                 02233000
CVTRV632 EQU   CVTDMSRF                                                 02234000
CVTRV631 EQU   CVTDMSRF                                                 02235000
CVTRV630 EQU   CVTDMSRF                                                 02236000
CVTRV629 EQU   CVTDMSRF                                                 02237000
CVTUDUMP EQU   CVTDMSRF                                                 02238000
CVTSDUMP EQU   CVTDMSRF                                                 02239000
CVTQMSGA EQU   CVTQMSG+1                                                02240000
CVTRSV36 EQU   CVTQMSG                                                  02241000
CVTAMFF  EQU   CVTMAP+264                                               02242000
CVTPURGA EQU   CVTPURG+1                                                02243000
CVTRSV35 EQU   CVTPURG                                                  02244000
CVTCBSP  EQU   CVTMAP+256                                               02245000
CVTATERA EQU   CVTATER+1                                                02246000
CVTSYST  EQU   CVTATER                                                  02247000
CVTVOLT2 EQU   CVTTAT                                                   02248000
CVTVOLI2 EQU   CVTVOLF2                                                 02249000
CVTAQAVB EQU   CVTAQAVT+1                                               02250000
CVTRSV34 EQU   CVTTCMFG                                                 02251000
CVTRSV33 EQU   CVTTCMFG                                                 02252000
CVTRSV32 EQU   CVTTCMFG                                                 02253000
CVTRSV31 EQU   CVTTCMFG                                                 02254000
CVTRSV30 EQU   CVTTCMFG                                                 02255000
CVTRSV29 EQU   CVTTCMFG                                                 02256000
CVTLDEV  EQU   CVTTCMFG                                                 02257000
CVTTCRDY EQU   CVTTCMFG                                                 02258000
CVTGTFA  EQU   CVTGTF+1                                                 02259000
CVTRSV27 EQU   CVTGTFST                                                 02260000
CVTRNIO  EQU   CVTGTFST                                                 02261000
CVTUSR   EQU   CVTGTFST                                                 02262000
CVTRV318 EQU   CVTFORM                                                  02263000
CVTRV317 EQU   CVTTMODE                                                 02264000
CVTRV316 EQU   CVTSTATE                                                 02265000
CVTRV315 EQU   CVTGTFS                                                  02266000
CVTGTFAV EQU   CVTGTFS                                                  02267000
CVT0SCR1 EQU   CVTMAP+232                                               02268000
CVTRV515 EQU   CVTMAP+228                                               02269000
CVTRMS   EQU   CVTMAP+224                                               02270000
CVTPATCH EQU   CVTMAP+220                                               02271000
CVTTSCE  EQU   CVTMAP+216                                               02272000
CVTLNKSC EQU   CVTMAP+214                                               02273000
CVTQABST EQU   CVTMAP+212                                               02274000
CVTMDLDS EQU   CVTMAP+208                                               02275000
CVTUSER  EQU   CVTMAP+204                                               02276000
CVTABEND EQU   CVTMAP+200                                               02277000
CVTSMCA  EQU   CVTMAP+196                                               02278000
CVTRSV18 EQU   CVTMAP+192                                               02279000
CVTQLPAQ EQU   CVTMAP+188                                               02280000
CVTQCDSR EQU   CVTMAP+184                                               02281000
CVTVS1B  EQU   CVTOPTB                                                  02282000
CVTVS1A  EQU   CVTOPTB                                                  02283000
CVTFP    EQU   CVTOPTB                                                  02284000
CVTAPTHR EQU   CVTOPTB                                                  02285000
CVTNLOG  EQU   CVTOPTB                                                  02286000
CVTTOD   EQU   CVTOPTB                                                  02287000
CVTCTIMS EQU   CVTOPTB                                                  02288000
CVTPROT  EQU   CVTOPTB                                                  02289000
CVTXPFP  EQU   CVTOPTA                                                  02290000
CVTASCII EQU   CVTOPTA                                                  02291000
CVTRSV13 EQU   CVTOPTA                                                  02292000
CVTRSV12 EQU   CVTOPTA                                                  02293000
CVTNIP   EQU   CVTOPTA                                                  02294000
CVTDDR   EQU   CVTOPTA                                                  02295000
CVTAPR   EQU   CVTOPTA                                                  02296000
CVTCCH   EQU   CVTOPTA                                                  02297000
CVTSNCTR EQU   CVTMAP+180                                               02298000
CVTQMWR  EQU   CVTMAP+176                                               02299000
CVTQOCR  EQU   CVTMAP+172                                               02300000
CVT1EF00 EQU   CVTMAP+168                                               02301000
CVTMZ00  EQU   CVTMAP+164                                               02302000
CVTHEAD  EQU   CVTMAP+160                                               02303000
CVTRSV11 EQU   CVTMAP+156                                               02304000
CVT0PT01 EQU   CVTMAP+152                                               02305000
CVTMSER  EQU   CVTMAP+148                                               02306000
CVTRV516 EQU   CVTIERLC                                                 02307000
CVTILCH  EQU   CVTMAP+140                                               02308000
CVT0DS   EQU   CVTMAP+136                                               02309000
CVTFBOSV EQU   CVTMAP+132                                               02310000
CVTNUCB  EQU   CVTMAP+128                                               02311000
CVTIXAVL EQU   CVTMAP+124                                               02312000
CVTIOQET EQU   CVTMAP+120                                               02313000
CVTDCBA  EQU   CVTMAP+117                                               02314000
CVTMVS2  EQU   CVTDCB                                                   02315000
CVT6DAT  EQU   CVTDCB                                                   02316000
CVT4MPS  EQU   CVTDCB                                                   02317000
CVTRSV09 EQU   CVTDCB                                                   02318000
CVT4MS1  EQU   CVTDCB                                                   02319000
CVT2SPS  EQU   CVTDCB                                                   02320000
CVT1SSS  EQU   CVTDCB                                                   02321000
CVTRSV08 EQU   CVTDCB                                                   02322000
CVTSTB   EQU   CVTMAP+112                                               02323000
CVTQTD00 EQU   CVTMAP+108                                               02324000
CVTQTE00 EQU   CVTMAP+104                                               02325000
CVTCUCB  EQU   CVTMAP+100                                               02326000
CVTSJQ   EQU   CVTMAP+96                                                02327000
CVTPBLDL EQU   CVTMAP+92                                                02328000
CVTTPC   EQU   CVTMAP+88                                                02329000
CVTSVDCB EQU   CVTMAP+84                                                02330000
CVTBRET  EQU   CVTMAP+82                                                02331000
CVTEXIT  EQU   CVTMAP+80                                                02332000
CVT0FN00 EQU   CVTMAP+76                                                02333000
CVTDARA  EQU   CVTDAR+1                                                 02334000
CVTRSV07 EQU   CVTFLGS1                                                 02335000
CVTRSV06 EQU   CVTFLGS1                                                 02336000
CVTRSV05 EQU   CVTFLGS1                                                 02337000
CVTRSV04 EQU   CVTFLGS1                                                 02338000
CVTRSV03 EQU   CVTFLGS1                                                 02339000
CVTRSV02 EQU   CVTFLGS1                                                 02340000
CVTRSV01 EQU   CVTFLGS1                                                 02341000
CVTDMPLK EQU   CVTFLGS1                                                 02342000
CVTXITP  EQU   CVTMAP+68                                                02343000
CVTZDTAB EQU   CVTMAP+64                                                02344000
CVTMSLT  EQU   CVTMAP+60                                                02345000
CVTDATE  EQU   CVTMAP+56                                                02346000
CVTBTERM EQU   CVTMAP+52                                                02347000
CVTSYSAD EQU   CVTMAP+48                                                02348000
CVTXTLER EQU   CVTMAP+44                                                02349000
CVTILK2  EQU   CVTMAP+40                                                02350000
CVTILK1  EQU   CVTMAP+36                                                02351000
CVTPRLTV EQU   CVTMAP+32                                                02352000
CVTPCNVT EQU   CVTMAP+28                                                02353000
CVT0VL00 EQU   CVTMAP+24                                                02354000
CVTXAPG  EQU   CVTMAP+20                                                02355000
CVTBUF   EQU   CVTMAP+16                                                02356000
CVTJOB   EQU   CVTMAP+12                                                02357000
CVTLINK  EQU   CVTMAP+8                                                 02358000
CVT0EF00 EQU   CVTMAP+4                                                 02359000
CVTTCBP  EQU   CVTMAP                                                   02360000
CVT      EQU   CVTMAP                                                   02361000
ASCBEND  EQU   ASCB+208                                                 02362000
ASCBSRBT EQU   ASCB+200                                                 02363000
ASCBSWTL EQU   ASCB+196                                                 02364000
ASCBRS14 EQU   ASCB+195                                                 02365000
ASCBSMCT EQU   ASCB+194                                                 02366000
ASCBRS12 EQU   ASCB+192                                                 02367000
ASCBPCTT EQU   ASCB+188                                                 02368000
ASCBVGTT EQU   ASCB+184                                                 02369000
ASCBRV43 EQU   ASCBSRQ4                                                 02370000
ASCBRV42 EQU   ASCBSRQ4                                                 02371000
ASCBRV41 EQU   ASCBSRQ4                                                 02372000
ASCBRV40 EQU   ASCBSRQ4                                                 02373000
ASCBRV39 EQU   ASCBSRQ4                                                 02374000
ASCBRV38 EQU   ASCBSRQ4                                                 02375000
ASCBRV37 EQU   ASCBSRQ4                                                 02376000
ASCBRV36 EQU   ASCBSRQ4                                                 02377000
ASCBRV35 EQU   ASCBSRQ3                                                 02378000
ASCBRV34 EQU   ASCBSRQ3                                                 02379000
ASCBRV33 EQU   ASCBSRQ3                                                 02380000
ASCBRV32 EQU   ASCBSRQ3                                                 02381000
ASCBRV31 EQU   ASCBSRQ3                                                 02382000
ASCBRV30 EQU   ASCBSRQ3                                                 02383000
ASCBRV29 EQU   ASCBSRQ3                                                 02384000
ASCBRV28 EQU   ASCBSRQ3                                                 02385000
ASCBRV27 EQU   ASCBSRQ2                                                 02386000
ASCBRV26 EQU   ASCBSRQ2                                                 02387000
ASCBRV25 EQU   ASCBSRQ2                                                 02388000
ASCBRV24 EQU   ASCBSRQ2                                                 02389000
ASCBRV23 EQU   ASCBSRQ2                                                 02390000
ASCBRV22 EQU   ASCBSRQ2                                                 02391000
ASCBRV21 EQU   ASCBSRQ2                                                 02392000
ASCBRV20 EQU   ASCBSRQ2                                                 02393000
ASCBRV19 EQU   ASCBSRQ1                                                 02394000
ASCBRV18 EQU   ASCBSRQ1                                                 02395000
ASCBRV17 EQU   ASCBSRQ1                                                 02396000
ASCBRV16 EQU   ASCBSRQ1                                                 02397000
ASCBRV15 EQU   ASCBSRQ1                                                 02398000
ASCBRV14 EQU   ASCBSRQ1                                                 02399000
ASCBRV13 EQU   ASCBSRQ1                                                 02400000
ASCBSTA  EQU   ASCBSRQ1                                                 02401000
ASCBJBNS EQU   ASCB+176                                                 02402000
ASCBJBNI EQU   ASCB+172                                                 02403000
ASCBMCC  EQU   ASCB+168                                                 02404000
ASCBRTWA EQU   ASCB+164                                                 02405000
ASCBIQEA EQU   ASCB+160                                                 02406000
ASCBXMPQ EQU   ASCB+156                                                 02407000
ASCBRS01 EQU   ASCB+154                                                 02408000
ASCBFMCT EQU   ASCB+152                                                 02409000
ASCBOUXB EQU   ASCB+148                                                 02410000
ASCBOUCB EQU   ASCB+144                                                 02411000
ASCBMECB EQU   ASCB+140                                                 02412000
ASCBQECB EQU   ASCB+136                                                 02413000
ASCBLSQH EQU   ASCBLKGP+4                                               02414000
ASCBLOCK EQU   ASCBLKGP                                                 02415000
ASCBTCBS EQU   ASCB+124                                                 02416000
ASCBNVSC EQU   ASCB+122                                                 02417000
ASCBVSC  EQU   ASCB+120                                                 02418000
ASCBSRBS EQU   ASCB+118                                                 02419000
ASCBSSRB EQU   ASCB+116                                                 02420000
ASCBRV06 EQU   ASCBFLG2                                                 02421000
ASCBRV05 EQU   ASCBFLG2                                                 02422000
ASCBRV04 EQU   ASCBFLG2                                                 02423000
ASCBSNQS EQU   ASCBFLG2                                                 02424000
ASCBS2S  EQU   ASCBFLG2                                                 02425000
ASCBCEXT EQU   ASCBFLG2                                                 02426000
ASCBPXMT EQU   ASCBFLG2                                                 02427000
ASCBXMPT EQU   ASCBFLG2                                                 02428000
ASCBRF07 EQU   ASCBDSP1                                                 02429000
ASCBRF06 EQU   ASCBDSP1                                                 02430000
ASCBRF05 EQU   ASCBDSP1                                                 02431000
ASCBRF04 EQU   ASCBDSP1                                                 02432000
ASCBRF03 EQU   ASCBDSP1                                                 02433000
ASCBRF02 EQU   ASCBDSP1                                                 02434000
ASCBFAIL EQU   ASCBDSP1                                                 02435000
ASCBNOQ  EQU   ASCBDSP1                                                 02436000
ASCBSWCT EQU   ASCB+112                                                 02437000
ASCBASXB EQU   ASCB+108                                                 02438000
ASCBTMCH EQU   ASCB+104                                                 02439000
ASCBNSWP EQU   ASCBFLG1                                                 02440000
ASCBTYP1 EQU   ASCBFLG1                                                 02441000
ASCBSTND EQU   ASCBFLG1                                                 02442000
ASCBABNT EQU   ASCBFLG1                                                 02443000
ASCBTERM EQU   ASCBFLG1                                                 02444000
ASCBS3S  EQU   ASCBFLG1                                                 02445000
ASCBCMSH EQU   ASCBFLG1                                                 02446000
ASCBTOFF EQU   ASCBFLG1                                                 02447000
ASCBRF01 EQU   ASCBRCTF                                                 02448000
ASCBTMLW EQU   ASCBRCTF                                                 02449000
ASCBOUT  EQU   ASCBRCTF                                                 02450000
ASCBWAIT EQU   ASCBRCTF                                                 02451000
ASCBRV08 EQU   ASCBRCTF                                                 02452000
ASCBFQU  EQU   ASCBRCTF                                                 02453000
ASCBFRS  EQU   ASCBRCTF                                                 02454000
ASCBTMNO EQU   ASCBRCTF                                                 02455000
ASCBAFFN EQU   ASCBFW1                                                  02456000
ASCBDUMP EQU   ASCB+96                                                  02457000
ASCBQSVC EQU   ASCB+92                                                  02458000
ASCBUBET EQU   ASCB+88                                                  02459000
ASCBECB  EQU   ASCB+84                                                  02460000
ASCBJSTL EQU   ASCB+80                                                  02461000
ASCBEWST EQU   ASCB+72                                                  02462000
ASCBEJST EQU   ASCB+64                                                  02463000
ASCBTSB  EQU   ASCB+60                                                  02464000
ASCBRSM  EQU   ASCB+52                                                  02465000
ASCBLDA  EQU   ASCB+48                                                  02466000
ASCBSTOR EQU   ASCB+44                                                  02467000
ASCBDP   EQU   ASCB+43                                                  02468000
ASCBRV07 EQU   ASCB+42                                                  02469000
ASCBIOSM EQU   ASCB+40                                                  02470000
ASCBSEQN EQU   ASCB+38                                                  02471000
ASCBASID EQU   ASCB+36                                                  02472000
ASCBCPUS EQU   ASCB+32                                                  02473000
ASCBSPL  EQU   ASCB+28                                                  02474000
ASCBIOSP EQU   ASCB+24                                                  02475000
ASCBSYNC EQU   ASCBSUPC+4                                               02476000
ASCBSVRB EQU   ASCBSUPC                                                 02477000
ASCBCMSF EQU   ASCB+12                                                  02478000
ASCBBWDP EQU   ASCB+8                                                   02479000
ASCBFWDP EQU   ASCB+4                                                   02480000
ASCBASCB EQU   ASCB                                                     02481000
ASCBEGIN EQU   ASCB                                                     02482000
TWAEND   EQU   TWAR+536                                                 02483000
@NM00005 EQU   TWACI+13                                                 02484000
TWACSKIP EQU   TWACI+12                                                 02485000
TWACMODQ EQU   TWACI+8                                                  02486000
TWACSTPQ EQU   TWACI+4                                                  02487000
TWACERRS EQU   TWACE+4                                                  02488000
TWACERA  EQU   TWACEI+1                                                 02489000
TWACEIFC EQU   TWACEI                                                   02490000
TWACRTFC EQU   TWAC+60                                                  02491000
TWACABFC EQU   TWAC+56                                                  02492000
TWACTWA  EQU   TWAC+52                                                  02493000
TWACEWA  EQU   TWAC+4                                                   02494000
TWACID   EQU   TWAC                                                     02495000
TWAUERRS EQU   TWAUE+4                                                  02496000
TWAUERA  EQU   TWAUEI+1                                                 02497000
TWAUEIFC EQU   TWAUEI                                                   02498000
TWAURTFC EQU   TWAU+60                                                  02499000
TWAUABFC EQU   TWAU+56                                                  02500000
TWAUTWA  EQU   TWAU+52                                                  02501000
TWAUEWA  EQU   TWAU+4                                                   02502000
TWAUID   EQU   TWAU                                                     02503000
TWAVACQH EQU   TWAVI+12                                                 02504000
TWAVTHQH EQU   TWAVI+8                                                  02505000
TWAVTEQH EQU   TWAVI+4                                                  02506000
TWAVERRS EQU   TWAVE+4                                                  02507000
TWAVERA  EQU   TWAVEI+1                                                 02508000
TWAVEIFC EQU   TWAVEI                                                   02509000
TWAVRTFC EQU   TWAV+60                                                  02510000
TWAVABFC EQU   TWAV+56                                                  02511000
TWAVTWA  EQU   TWAV+52                                                  02512000
TWAVEWA  EQU   TWAV+4                                                   02513000
TWAVID   EQU   TWAV                                                     02514000
TWAMERRS EQU   TWAME+4                                                  02515000
TWAMERA  EQU   TWAMEI+1                                                 02516000
TWAMEIFC EQU   TWAMEI                                                   02517000
TWAMRTFC EQU   TWAM+60                                                  02518000
TWAMABFC EQU   TWAM+56                                                  02519000
TWAMTWA  EQU   TWAM+52                                                  02520000
TWAMEWA  EQU   TWAM+4                                                   02521000
TWAMID   EQU   TWAM                                                     02522000
@NM00004 EQU   TWACFL                                                   02523000
@NM00003 EQU   TWAUFL                                                   02524000
TWAUFL3  EQU   TWAUFL                                                   02525000
@NM00002 EQU   TWAVFL                                                   02526000
TWAVFL6  EQU   TWAVFL                                                   02527000
TWAVFL5  EQU   TWAVFL                                                   02528000
TWAVFL3  EQU   TWAVFL                                                   02529000
@NM00001 EQU   TWAMFL                                                   02530000
TWAMFL1  EQU   TWAMFL                                                   02531000
TWADEQAS EQU   TWAR+44                                                  02532000
TWAINIT  EQU   TWAR+24                                                  02533000
TWAPASQH EQU   TWAR+8                                                   02534000
TWACOMP  EQU   TWAR                                                     02535000
@NM00029 EQU   PSA+3668                                                 02536000
PSASTAK  EQU   PSA+3072                                                 02537000
@NM00028 EQU   PSA+1048                                                 02538000
PSAUSEND EQU   PSA+1048                                                 02539000
PSARV062 EQU   PSA+1044                                                 02540000
PSACDAL  EQU   PSA+1040                                                 02541000
PSAWTCOD EQU   PSA+1036                                                 02542000
PSAATCVT EQU   PSA+1032                                                 02543000
PSAPCPSW EQU   PSA+1024                                                 02544000
PSAPIR2  EQU   PSA+1020                                                 02545000
PSARV059 EQU   PSA+1018                                                 02546000
PSASVC13 EQU   PSA+1016                                                 02547000
PSALSFCC EQU   PSA+1012                                                 02548000
PSASFACC EQU   PSA+1008                                                 02549000
PSASTOP  EQU   PSA+992                                                  02550000
PSASTART EQU   PSA+976                                                  02551000
PSARSPSW EQU   PSA+968                                                  02552000
PSASRPSW EQU   PSA+960                                                  02553000
PSARV045 EQU   PSA+892                                                  02554000
PSARV044 EQU   PSA+888                                                  02555000
PSARV043 EQU   PSA+884                                                  02556000
PSARV042 EQU   PSA+880                                                  02557000
PSARV041 EQU   PSA+876                                                  02558000
PSARV040 EQU   PSA+872                                                  02559000
PSARV025 EQU   PSA+868                                                  02560000
PSADSSED EQU   PSA+868                                                  02561000
PSADSSPR EQU   PSA+864                                                  02562000
PSADSSFW EQU   PSA+860                                                  02563000
PSADSS14 EQU   PSA+856                                                  02564000
PSADSSPP EQU   PSA+848                                                  02565000
PSADSSRP EQU   PSA+840                                                  02566000
PSADSS05 EQU   PSADSSF4                                                 02567000
PSADSS10 EQU   PSADSSF4                                                 02568000
PSADSSVE EQU   PSADSSF4                                                 02569000
PSADSSDE EQU   PSADSSF4                                                 02570000
PSADSSC0 EQU   PSADSSF4                                                 02571000
PSADSSIE EQU   PSADSSF4                                                 02572000
PSADSS12 EQU   PSADSSF4                                                 02573000
PSADSSRC EQU   PSADSSF4                                                 02574000
PSARV057 EQU   PSADSSF3                                                 02575000
PSARV056 EQU   PSADSSF3                                                 02576000
PSARV055 EQU   PSADSSF3                                                 02577000
PSADSSMC EQU   PSADSSF3                                                 02578000
PSADSSRW EQU   PSADSSF3                                                 02579000
PSADSSNM EQU   PSADSSF3                                                 02580000
PSADSSES EQU   PSADSSF3                                                 02581000
PSADSSGP EQU   PSADSSF3                                                 02582000
PSADSSF2 EQU   PSADSSFL+1                                               02583000
PSADSSPI EQU   PSADSSF1                                                 02584000
PSADSSOI EQU   PSADSSF1                                                 02585000
PSADSSSP EQU   PSADSSF1                                                 02586000
PSADSSTP EQU   PSADSSF1                                                 02587000
PSADSSDW EQU   PSADSSF1                                                 02588000
PSADSSDD EQU   PSADSSF1                                                 02589000
PSADSSDM EQU   PSADSSF1                                                 02590000
PSADSSMV EQU   PSADSSF1                                                 02591000
PSADSSTS EQU   PSA+816                                                  02592000
PSADSSWK EQU   PSA+812                                                  02593000
PSADSSR3 EQU   PSA+808                                                  02594000
PSADSSR2 EQU   PSA+804                                                  02595000
PSADSSRS EQU   PSA+800                                                  02596000
PSASTOR  EQU   PSA+796                                                  02597000
PSACPUSA EQU   PSA+794                                                  02598000
PSAVSTAP EQU   PSA+792                                                  02599000
PSAWKVAP EQU   PSA+788                                                  02600000
PSAWKRAP EQU   PSA+784                                                  02601000
PSAMCHIC EQU   PSA+783                                                  02602000
PSARV061 EQU   PSA+782                                                  02603000
PSASYMSK EQU   PSA+781                                                  02604000
PSAMCHFL EQU   PSA+780                                                  02605000
PSACR0   EQU   PSA+776                                                  02606000
PSAPSWSV EQU   PSA+768                                                  02607000
PSACLHS  EQU   PSAHLHI                                                  02608000
PSALKR15 EQU   PSALKSA+60                                               02609000
PSALKR14 EQU   PSALKSA+56                                               02610000
PSALKR13 EQU   PSALKSA+52                                               02611000
PSALKR12 EQU   PSALKSA+48                                               02612000
PSALKR11 EQU   PSALKSA+44                                               02613000
PSALKR10 EQU   PSALKSA+40                                               02614000
PSALKR9  EQU   PSALKSA+36                                               02615000
PSALKR8  EQU   PSALKSA+32                                               02616000
PSALKR7  EQU   PSALKSA+28                                               02617000
PSALKR6  EQU   PSALKSA+24                                               02618000
PSALKR5  EQU   PSALKSA+20                                               02619000
PSALKR4  EQU   PSALKSA+16                                               02620000
PSALKR3  EQU   PSALKSA+12                                               02621000
PSALKR2  EQU   PSALKSA+8                                                02622000
PSALKR1  EQU   PSALKSA+4                                                02623000
PSALKR0  EQU   PSALKSA                                                  02624000
PSARV023 EQU   PSACLHT+52                                               02625000
PSALOCAL EQU   PSACLHT+48                                               02626000
PSACMSL  EQU   PSACLHT+44                                               02627000
PSAOPTL  EQU   PSACLHT+40                                               02628000
PSATPACL EQU   PSACLHT+36                                               02629000
PSATPDNL EQU   PSACLHT+32                                               02630000
PSATPNCL EQU   PSACLHT+28                                               02631000
PSAIOSLL EQU   PSACLHT+24                                               02632000
PSAIOSUL EQU   PSACLHT+20                                               02633000
PSAIOSCL EQU   PSACLHT+16                                               02634000
PSAIOSSL EQU   PSACLHT+12                                               02635000
PSASALCL EQU   PSACLHT+8                                                02636000
PSAASML  EQU   PSACLHT+4                                                02637000
PSADISPL EQU   PSACLHT                                                  02638000
PSASRSA  EQU   PSA+636                                                  02639000
PSARV050 EQU   PSA+634                                                  02640000
PSADSSGO EQU   PSA+633                                                  02641000
PSARECUR EQU   PSA+632                                                  02642000
PSAHLHIS EQU   PSA+628                                                  02643000
PSAIPCSA EQU   PSA+624                                                  02644000
@NM00027 EQU   PSA+621                                                  02645000
PSAIPCDM EQU   PSA+620                                                  02646000
PSAIPCD  EQU   PSA+616                                                  02647000
@NM00026 EQU   PSA+613                                                  02648000
PSAIPCRM EQU   PSA+612                                                  02649000
PSAIPCR  EQU   PSA+608                                                  02650000
PSAMCHEX EQU   PSA+600                                                  02651000
PSAMPSW  EQU   PSA+592                                                  02652000
PSAEXPS2 EQU   PSA+584                                                  02653000
PSAEXPS1 EQU   PSA+576                                                  02654000
PSAPIREG EQU   PSA+572                                                  02655000
PSARSREG EQU   PSA+568                                                  02656000
PSAGPREG EQU   PSA+556                                                  02657000
PSARV022 EQU   PSASUP4                                                  02658000
PSARV021 EQU   PSASUP4                                                  02659000
PSARV020 EQU   PSASUP4                                                  02660000
PSARV019 EQU   PSASUP4                                                  02661000
PSARV018 EQU   PSASUP4                                                  02662000
PSARV017 EQU   PSASUP4                                                  02663000
PSARV016 EQU   PSASUP4                                                  02664000
PSARV015 EQU   PSASUP4                                                  02665000
PSARV014 EQU   PSASUP3                                                  02666000
PSARV013 EQU   PSASUP3                                                  02667000
PSARV012 EQU   PSASUP3                                                  02668000
PSARV011 EQU   PSASUP3                                                  02669000
PSASPR   EQU   PSASUP3                                                  02670000
PSAPSREG EQU   PSASUP3                                                  02671000
PSAPI2   EQU   PSASUP3                                                  02672000
PSAIOSUP EQU   PSASUP3                                                  02673000
PSALCR   EQU   PSASUP2                                                  02674000
PSARTM   EQU   PSASUP2                                                  02675000
PSAACR   EQU   PSASUP2                                                  02676000
PSAIPCE2 EQU   PSASUP2                                                  02677000
PSAIPCES EQU   PSASUP2                                                  02678000
PSAIPCEC EQU   PSASUP2                                                  02679000
PSAGTF   EQU   PSASUP2                                                  02680000
PSAIPCRI EQU   PSASUP2                                                  02681000
PSARV063 EQU   PSASUP1                                                  02682000
PSATCTL  EQU   PSASUP1                                                  02683000
PSADISP  EQU   PSASUP1                                                  02684000
PSALOCK  EQU   PSASUP1                                                  02685000
PSAPI    EQU   PSASUP1                                                  02686000
PSAEXT   EQU   PSASUP1                                                  02687000
PSASVC   EQU   PSASUP1                                                  02688000
PSAIO    EQU   PSASUP1                                                  02689000
PSAANEW  EQU   PSA+544                                                  02690000
PSATOLD  EQU   PSA+540                                                  02691000
PSATNEW  EQU   PSA+536                                                  02692000
PSALCCAR EQU   PSA+532                                                  02693000
PSALCCAV EQU   PSA+528                                                  02694000
PSAPCCAR EQU   PSA+524                                                  02695000
PSAPCCAV EQU   PSA+520                                                  02696000
PSACPULA EQU   PSA+518                                                  02697000
PSACPUPA EQU   PSA+516                                                  02698000
PSAPSA   EQU   PSA+512                                                  02699000
FLCHDEND EQU   PSA+512                                                  02700000
FLCCRSAV EQU   FLCMCLA+280                                              02701000
FLCGRSAV EQU   FLCMCLA+216                                              02702000
FLCFPSAV EQU   FLCMCLA+184                                              02703000
FLCFLA   EQU   FLCMCLA+88                                               02704000
FLCRGNCD EQU   FLCMCLA+84                                               02705000
FLCFSAA  EQU   FLCFSA+1                                                 02706000
@NM00025 EQU   FLCFSA                                                   02707000
@NM00024 EQU   FLCMCLA+72                                               02708000
FLCMCIC  EQU   FLCMCLA+64                                               02709000
@NM00023 EQU   FLCMCLA+20                                               02710000
FLCIOAA  EQU   FLCIOA+1                                                 02711000
@NM00022 EQU   FLCIOA                                                   02712000
@NM00021 EQU   FLCMCLA+15                                               02713000
@NM00020 EQU   FLCMCLA+14                                               02714000
@NM00019 EQU   FLCMCLA+12                                               02715000
FLCLCL   EQU   FLCMCLA+8                                                02716000
FLCIOELA EQU   FLCIOEL+1                                                02717000
@NM00018 EQU   FLCIOEL                                                  02718000
FLCCHNID EQU   FLCMCLA                                                  02719000
@NM00017 EQU   PSA+160                                                  02720000
FLCMTRCD EQU   PSA+157                                                  02721000
@NM00016 EQU   PSA+156                                                  02722000
FLCPERA  EQU   FLCPER+1                                                 02723000
@NM00015 EQU   FLCPER                                                   02724000
@NM00014 EQU   PSA+151                                                  02725000
FLCPERCD EQU   PSA+150                                                  02726000
FLCMCNUM EQU   PSA+149                                                  02727000
@NM00013 EQU   PSA+148                                                  02728000
FLCTEAA  EQU   FLCTEA+1                                                 02729000
@NM00012 EQU   FLCTEA                                                   02730000
PSAPIPC  EQU   PSAPICOD                                                 02731000
PSAPIMC  EQU   PSAPICOD                                                 02732000
PSAPIPER EQU   PSAPICOD                                                 02733000
PSARV049 EQU   FLCPICOD                                                 02734000
FLCPILCB EQU   FLCPIILC                                                 02735000
@NM00011 EQU   FLCPIILC                                                 02736000
@NM00010 EQU   PSAEPPSW                                                 02737000
FLCSVCN  EQU   PSAESPSW+2                                               02738000
FLCSILCB EQU   FLCSVILC                                                 02739000
@NM00009 EQU   FLCSVILC                                                 02740000
@NM00008 EQU   PSAESPSW                                                 02741000
FLCEICOD EQU   PSAEEPSW+2                                               02742000
PSASPAD  EQU   PSAEEPSW                                                 02743000
@NM00007 EQU   PSA+128                                                  02744000
FLCINPSW EQU   PSA+120                                                  02745000
FLCMNPSW EQU   PSA+112                                                  02746000
FLCPNPSW EQU   PSA+104                                                  02747000
FLCSNPSW EQU   PSA+96                                                   02748000
FLCENPSW EQU   PSA+88                                                   02749000
FLCTRACE EQU   PSA+84                                                   02750000
FLCTIMER EQU   PSA+80                                                   02751000
FLCCVT2  EQU   PSA+76                                                   02752000
FLCCAW   EQU   PSA+72                                                   02753000
FLCCSW   EQU   PSA+64                                                   02754000
FLCIOPSW EQU   PSA+56                                                   02755000
FLCMOPSW EQU   PSA+48                                                   02756000
FLCPOPSW EQU   PSA+40                                                   02757000
FLCSOPSW EQU   PSA+32                                                   02758000
FLCEOPSW EQU   PSA+24                                                   02759000
@NM00006 EQU   FLCICCW2+4                                               02760000
FLCCVT   EQU   FLCICCW2                                                 02761000
FLCICCW1 EQU   FLCROPSW                                                 02762000
FLCIPPSW EQU   FLCRNPSW                                                 02763000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02764000
@RT00063 EQU   MLSLTEND                                                 02765000
@RF00059 EQU   @RC00055                                                 02766000
@ENDDATA EQU   *                                                        02767000
         END   IKTCAS00,(C'PLS1919',0702,80232)                         02768000
