         TITLE '*** IKTCASOX: BIND ASYNCHRONOUS EXIT ***'               00001000
IKTCASOX CSECT ,                                                01S0001 00002000
@MAINENT DS    0H                                               01S0001 00003000
         USING *,@15                                            01S0001 00004000
         B     @PROLOG                                          01S0001 00005000
         DC    AL1(16)                                          01S0001 00006000
         DC    C'IKTCASOX  80.192'                              01S0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @12,0                                            01S0001 00009000
@PSTART  DS    0H                                               01S0001 00010000
         USING @PSTART,@12                                      01S0001 00011000
         ST    @13,@SA00001+4                                   01S0001 00012000
         LA    @03,@SA00001                                     01S0001 00013000
         LR    @13,@03                                          01S0001 00014000
         PRINT OFF                                                      00015000
         PRINT ON                                                       00016000
*                                                               01S0144 00017000
*/********************************************************************/ 00018000
*/*                                                                  */ 00019000
*/* SEGMENT-                                                         */ 00020000
*/*      IKTCASOX                                                    */ 00021000
*/*                                                                  */ 00022000
*/* FUNCTION-                                                        */ 00023000
*/*      MAINLINE CODE.                                              */ 00024000
*/*                                                                  */ 00025000
*/********************************************************************/ 00026000
*                                                               01S0144 00027000
*   DO;                             /* BLOCK MAIN MAIN SEGMENT       */ 00028000
*/********************************************************************/ 00029000
*/*     INITIALIZE THE REGISTERS USED                                */ 00030000
*/********************************************************************/ 00031000
*                                                               01S0145 00032000
*     SAVREG14=REG14;               /* SAVE RETURN ADDRESS           */ 00033000
         LR    SAVREG14,REG14                                   01S0145 00034000
*     RFY                                                       01S0146 00035000
*       REG14 UNRSTD;               /* UNRESTRICT REGISTER 14        */ 00036000
*     RPLBASE=REG1;                 /* INSERT ADDRESS OF RPL IN TO      00037000
*                                      BASE REGISTER                 */ 00038000
         LR    RPLBASE,REG1                                     01S0147 00039000
*/****************************************************************** */ 00040000
*/*     ESTABLISH THE CONDITION OF THE REQUEST VIA CHECK             */ 00041000
*/********************************************************************/ 00042000
*                                                               01S0148 00043000
*     GENERATE CODE;                                            01S0148 00044000
         CHECK RPL=(RPLBASE)                                            00045000
*     RFY                                                       01S0149 00046000
*       RETCODE RSTD;               /* RESTRICT THE RETURN CODE 01S0149 00047000
*                                      REGISTER                      */ 00048000
*     DO WHILE(RETCODE^=0|NIBCON='0'B);/* OPNDST FAILED      @ZM21166*/ 00049000
         B     @DE00150                                         01S0150 00050000
@DL00150 DS    0H                                               01S0151 00051000
*       WSMACRTC=RETCODE;           /* SAVE RETURN CODE              */ 00052000
         STC   RETCODE,WSMACRTC(,RPLBASE)                       01S0151 00053000
*       WSMACRSC=REG0;              /* SAVE REASON CODE              */ 00054000
         STC   REG0,WSMACRSC(,RPLBASE)                          01S0152 00055000
*       IF RETCODE=4&REG0=8 THEN    /* CHECK FOR A STORAGE SHORTAGE  */ 00056000
         C     RETCODE,@CF00043                                 01S0153 00057000
         BNE   @RF00153                                         01S0153 00058000
         C     REG0,@CF00035                                    01S0153 00059000
         BNE   @RF00153                                         01S0153 00060000
*         DO;                                                   01S0154 00061000
*           WSRETRY=WSRETRY+1;      /* INCREMENT COUNTER             */ 00062000
         LA    @14,1                                            01S0155 00063000
         SLR   @08,@08                                          01S0155 00064000
         IC    @08,WSRETRY(,RPLBASE)                            01S0155 00065000
         ALR   @14,@08                                          01S0155 00066000
         STC   @14,WSRETRY(,RPLBASE)                            01S0155 00067000
*           WSRETRYB='1'B;          /* TURN ON RETRY BIT             */ 00068000
         OI    WSRETRYB(RPLBASE),B'00001000'                    01S0156 00069000
*           IF WSRETRY>RETRYMAX THEN/* TEST FOR RETRY COUNTER   01S0157 00070000
*                                      EXCEEDED                      */ 00071000
         CLI   WSRETRY(RPLBASE),10                              01S0157 00072000
         BNH   @RF00157                                         01S0157 00073000
*             DO;                                               01S0158 00074000
*               CALL TERMREL;                                   01S0159 00075000
*                                                               01S0159 00076000
         BAL   @14,TERMREL                                      01S0159 00077000
*/*            LEAVE(MAIN)                                           */ 00078000
*                                                               01S0160 00079000
*               GOTO #BCM0005;      /* EXIT, NO MORE RETRIES @ZA35513*/ 00080000
         B     #BCM0005                                         01S0160 00081000
*             END;                                              01S0161 00082000
*           GENERATE CODE;                                      01S0162 00083000
*                                                               01S0162 00084000
@RF00157 DS    0H                                               01S0162 00085000
         EXECRPL RPL=(RPLBASE)                                          00086000
*/*        LEAVE(MAIN) ON(RETCODE=0)                                 */ 00087000
*                                                               01S0163 00088000
*           IF(RETCODE=0) THEN                                  01S0163 00089000
         LTR   RETCODE,RETCODE                                  01S0163 00090000
         BZ    @RT00163                                         01S0163 00091000
*             GOTO #BCM0005;        /* EXIT, GOOD INITIAL RETURN CODE   00092000
*                                                            @ZA35513*/ 00093000
*         END;                                                  01S0165 00094000
*       ELSE                        /* ERROR CODE NOT RETRYABLE      */ 00095000
*         DO;                                                   01S0166 00096000
         B     @RC00153                                         01S0166 00097000
@RF00153 DS    0H                                               01S0167 00098000
*           CALL TERMREL;           /* RELEASE THE TERMINAL          */ 00099000
         BAL   @14,TERMREL                                      01S0167 00100000
*/*        LEAVE(MAIN)                                               */ 00101000
*                                                               01S0168 00102000
*           GOTO #BCM0005;          /* EXIT, ERROR NOT RETRYABLE        00103000
*                                                            @ZA35513*/ 00104000
         B     #BCM0005                                         01S0168 00105000
*         END;                                                  01S0169 00106000
*     END;                          /* END OF LOOP                   */ 00107000
@RC00153 DS    0H                                               01S0170 00108000
@DE00150 SLR   @14,@14                                          01S0170 00109000
         CR    RETCODE,@14                                      01S0170 00110000
         BNE   @DL00150                                         01S0170 00111000
         L     @08,RPLAREA(,RPLBASE)                            01S0170 00112000
         TM    NIBCON(@08),B'01000000'                          01S0170 00113000
         BZ    @DL00150                                         01S0170 00114000
*/********************************************************************/ 00115000
*/*            CHECK FOR NO TERMINAL TO BIND                         */ 00116000
*/****************************************************************** */ 00117000
*                                                               01S0171 00118000
*     IF REG0=0&RPLFDB2=9 THEN      /* CHECK RPL FEED BACK FIELDS    */ 00119000
         CR    REG0,@14                                         01S0171 00120000
         BNE   @RF00171                                         01S0171 00121000
         CLI   RPLFDB2(RPLBASE),9                               01S0171 00122000
         BNE   @RF00171                                         01S0171 00123000
*       DO;                                                     01S0172 00124000
*         CALL TERMREL;                                         01S0173 00125000
*                                                               01S0173 00126000
         BAL   @14,TERMREL                                      01S0173 00127000
*/*        LEAVE(MAIN)                                               */ 00128000
*                                                               01S0174 00129000
*         GOTO #BCM0005;            /* EXIT, NO TERMINAL TO BIND        00130000
*                                                            @ZA35513*/ 00131000
         B     #BCM0005                                         01S0174 00132000
*       END;                                                    01S0175 00133000
         EJECT                                                          00134000
*                                                               02S0176 00135000
*/********************************************************************/ 00136000
*/*                                                                  */ 00137000
*/* SEGMENT-                                                         */ 00138000
*/*      MEMREQ                                                      */ 00139000
*/*                                                                  */ 00140000
*/* FUNCTION-                                                        */ 00141000
*/*      QUEUE ADDRESS SPACE REQUEST WORK ELEMENT ON TCAS QUEUE      */ 00142000
*/*      POST TCAS USER TASK TO CREATE THE USER ADDRESS SPACE        */ 00143000
*/*                                                                  */ 00144000
*/********************************************************************/ 00145000
*                                                               02S0176 00146000
*     DO;                           /* START OF BLOCK        @ZA35513*/ 00147000
@RF00171 DS    0H                                               02S0177 00148000
*       WORKBASE=RPLBASE-LENGTH(WESTD);/* COMPUTE ADDRESS OF WORK       00149000
*                                      ELEMENT                       */ 00150000
         LR    WORKBASE,RPLBASE                                 02S0177 00151000
         SL    WORKBASE,@CF01908                                02S0177 00152000
*       RFY                                                     02S0178 00153000
*         WESTD BASED(WORKBASE);    /* BASE WORK ELEMENT ON PARAMETER*/ 00154000
*       RFY                                                     02S0179 00155000
*        (QBASEREG,                                             02S0179 00156000
*         QHREG,                                                02S0179 00157000
*         WEREG) RSTD;              /* RESTRICT REGISTERS    @ZA35513*/ 00158000
*       QBASEREG=ADDR(TWAUACQH);    /* LOAD THE ADDRESS OF THE QUEUE    00159000
*                                      INTO A REGI ER                */ 00160000
         L     @14,CVTPTR                                       02S0180 00161000
         L     @14,TCASTPTR(,@14)                               02S0180 00162000
         L     @14,TWAPTR(,@14)                                 02S0180 00163000
         LA    QBASEREG,TWAUACQH(,@14)                          02S0180 00164000
*       QHREG=TWAUACQH;             /* LOAD THE ADDRESS OF CURRENT      00165000
*                                      WORK ELEMENT                  */ 00166000
         L     QHREG,TWAUACQH(,@14)                             02S0181 00167000
*       WEREG=WORKBASE;             /* LOAD THE ADDRESS OF THE NEW      00168000
*                                      WORK ELEMENT INTO A REGISTER  */ 00169000
         LR    WEREG,WORKBASE                                   02S0182 00170000
*       WECODE1T=MEMREQNM;          /* LOAD THE FUNCTION CODE INTO      00171000
*                                      THE WORK ELEMENT              */ 00172000
         MVI   WECODE1T(WORKBASE),X'11'                         02S0183 00173000
*       GENERATE CODE               /* INSERT ON QUEUE               */ 00174000
*           REFS(WENEXT);                                       02S0184 00175000
REDO     ST    QHREG,WENEXT(WEREG) STORE PRESENT WORK ELEMENT ADDRESS  *00176000
                              INTO NEW WORK ELEMENT                     00177000
         CS    QHREG,WEREG,0(QBASEREG) COMPARE AND SWAP INTO QUEUE     *00178000
                              ANCHOR                                    00179000
         BNE   REDO          DO IT UNTIL YOU GET IT RIGHT               00180000
*       RFY                                                     02S0185 00181000
*        (QBASEREG,                                             02S0185 00182000
*         QHREG,                                                02S0185 00183000
*         WEREG) UNRSTD;            /* FREE UP WORK REGS     @ZA35513*/ 00184000
*/********************************************************************/ 00185000
*/*            AFTER WORK ELEMENT IS ON THE CHAIN                    */ 00186000
*/*            POST TASK RESPONSIBLE FOR THE QUEUE                   */ 00187000
*/********************************************************************/ 00188000
*                                                               02S0186 00189000
*       RFY                                                     02S0186 00190000
*         REG4 RSTD;                /* RESTRICT WORK REGSITER        */ 00191000
*       REG4=ADDR(TWAUECB);         /* LOAD THE ADDRESS OF THE ECB      00192000
*                                      INTO A REGISTER               */ 00193000
         L     @14,CVTPTR                                       02S0187 00194000
         L     @14,TCASTPTR(,@14)                               02S0187 00195000
         L     REG4,TWAPTR(,@14)                                02S0187 00196000
         LA    REG4,TWAUECB(,REG4)                              02S0187 00197000
*       GENERATE CODE;                                          02S0188 00198000
         POST  (4),X'0'                                                 00199000
*       RFY                                                     02S0189 00200000
*         REG4 UNRSTD;              /* FREE UP WORK REGISTER         */ 00201000
*     END;                          /* END OF SEGMENT        @ZA35513*/ 00202000
*/********************************************************************/ 00203000
*/* END OF SEGMENT                                                   */ 00204000
*/********************************************************************/ 00205000
*                                                               02S0191 00206000
*   END;                            /* END(MAIN)                     */ 00207000
*#BCM0005:                                                      01S0192 00208000
*   ;                               /* END OF MAIN SEGMENT           */ 00209000
#BCM0005 DS    0H                                               01S0193 00210000
*/********************************************************************/ 00211000
*/* THIS CODE IS ENTERED FROM ANY LEAVE(MAIN) MACRO INSTRUCTION.     */ 00212000
*/********************************************************************/ 00213000
*                                                               01S0193 00214000
*   RFY                                                         01S0193 00215000
*     REG14 RSTD;                   /* RESTRICT RETURN REGISTER      */ 00216000
*   REG14=SAVREG14;                 /* LOAD RETURN ADDRESS           */ 00217000
         LR    REG14,SAVREG14                                   01S0194 00218000
*   RFY                                                         01S0195 00219000
*     REG14 UNRSTD;                 /* UNRESTRICT RETURN REGISTER    */ 00220000
*   RETURN;                         /* RETURN TO VTAM        @ZA35513*/ 00221000
@EL00001 L     @13,4(,@13)                                      01S0196 00222000
@EF00001 DS    0H                                               01S0196 00223000
@ER00001 BR    @14                                              01S0196 00224000
         EJECT                                                          00225000
*                                                               01S0197 00226000
*/********************************************************************/ 00227000
*/*                                                                  */ 00228000
*/* SUBROUTINE-                                                      */ 00229000
*/*      TERMREL                                                     */ 00230000
*/*                                                                  */ 00231000
*/* FUNCTION-                                                        */ 00232000
*/*      RELEASE TERMINAL                                            */ 00233000
*/*      ISSUE ERROR MESSAGE IKT019I IF NECESSARY                    */ 00234000
*/*                                                                  */ 00235000
*/********************************************************************/ 00236000
*                                                               01S0197 00237000
*TERMREL:                                                       01S0197 00238000
*   PROC OPTIONS(SAVE(14));                                     01S0197 00239000
TERMREL  ST    @14,@SA00002                                     01S0197 00240000
*   WSRETRYB='1'B;                  /* INDICATE RETRY                */ 00241000
         OI    WSRETRYB(RPLBASE),B'00001000'                    01S0198 00242000
*/* CHECK CONDITIONS OF RPL                                          */ 00243000
*                                                               01S0199 00244000
*   IF RPLRTNCD=16&RPLFDB2=10 THEN  /* CHECK FOR ERROR IN VTAM       */ 00245000
         CLI   RPLRTNCD(RPLBASE),16                             01S0199 00246000
         BNE   @RF00199                                         01S0199 00247000
         CLI   RPLFDB2(RPLBASE),10                              01S0199 00248000
         BNE   @RF00199                                         01S0199 00249000
*     DO;                                                       01S0200 00250000
*       CALL SENDMSG;               /* SEND MESSAGE IKT019I TO  01S0201 00251000
*                                      OPERATOR              @ZA35513*/ 00252000
         BAL   @14,SENDMSG                                      01S0201 00253000
*       WSRETRYB='0'B;              /* INDICATE NO RETRY POSSIBLE    */ 00254000
         NI    WSRETRYB(RPLBASE),B'11110111'                    01S0202 00255000
*     END;                                                      01S0203 00256000
*   ELSE                            /* NOT VTAM DISABLED ERROR       */ 00257000
*     DO;                                                       01S0204 00258000
         B     @RC00199                                         01S0204 00259000
@RF00199 DS    0H                                               01S0205 00260000
*       RFY                                                     01S0205 00261000
*         EXITREG RSTD;             /* RESTRICT EXIT REGISTER        */ 00262000
*       EXITREG=ADDR(IKTCASCX);     /* LOAD THE ADDRESS OF CLSDST       00263000
*                                      ROUTINE                       */ 00264000
         L     EXITREG,@CV01887                                 01S0206 00265000
*       WSCLSREL='1'B;              /* TURN CLSDST RELEASE INDICATOR */ 00266000
         OI    WSCLSREL(RPLBASE),B'00100000'                    01S0207 00267000
*       WSRETRY=0;                  /* INITIALIZE RETRY COUNTER      */ 00268000
         MVI   WSRETRY(RPLBASE),X'00'                           01S0208 00269000
*       GENERATE CODE;                                          01S0209 00270000
         CLSDST RPL=(RPLBASE),                                         *00271000
               OPTCD=(ASY,RELEASE),                                    *00272000
               EXIT=(EXITREG)                                           00273000
*       RFY                                                     01S0210 00274000
*         EXITREG UNRSTD;           /* UNRESTRICT WORK REGISTER      */ 00275000
*       RFY                                                     01S0211 00276000
*         RETCODE RSTD;             /* RESTRICT RETURN CODE REGISTER */ 00277000
*       DO WHILE RETCODE^=0;        /* TEST RETURN CODE              */ 00278000
         B     @DE00212                                         01S0212 00279000
@DL00212 DS    0H                                               01S0213 00280000
*         IF RETCODE=4&REG0=8 THEN  /* CHECK FOR RETRYABLE ERROR     */ 00281000
         C     RETCODE,@CF00043                                 01S0213 00282000
         BNE   @RF00213                                         01S0213 00283000
         C     REG0,@CF00035                                    01S0213 00284000
         BNE   @RF00213                                         01S0213 00285000
*           DO;                                                 01S0214 00286000
*             WSRETRY=WSRETRY+1;    /* INCREMENT COUNTER             */ 00287000
         LA    @14,1                                            01S0215 00288000
         SLR   @08,@08                                          01S0215 00289000
         IC    @08,WSRETRY(,RPLBASE)                            01S0215 00290000
         ALR   @14,@08                                          01S0215 00291000
         STC   @14,WSRETRY(,RPLBASE)                            01S0215 00292000
*             IF WSRETRY>RETRYMAX THEN/* CHECK FOR RETRY MAXIMUM        00293000
*                                      EXCEEDED                      */ 00294000
         CLI   WSRETRY(RPLBASE),10                              01S0216 00295000
         BNH   @RF00216                                         01S0216 00296000
*               DO;                                             01S0217 00297000
*                 CALL SENDMSG;     /* SEND MESSAGE IKT019I TO  01S0218 00298000
*                                      OPERATOR              @ZA35513*/ 00299000
         BAL   @14,SENDMSG                                      01S0218 00300000
*                 RETCODE=0;        /* STOP RECURSION                */ 00301000
         SLR   RETCODE,RETCODE                                  01S0219 00302000
*                 WSRETRYB='0'B;    /* TURN OFF RETRY BIT TO INDICATE   00303000
*                                      RETRY IMPOSSIBLE              */ 00304000
         NI    WSRETRYB(RPLBASE),B'11110111'                    01S0220 00305000
*               END;                                            01S0221 00306000
*             ELSE                  /* RETRY MAXIMUM NOT EXCEEDED    */ 00307000
*               DO;                                             01S0222 00308000
         B     @RC00216                                         01S0222 00309000
@RF00216 DS    0H                                               01S0223 00310000
*                 GENERATE CODE;                                01S0223 00311000
         EXECRPL RPL=(RPLBASE)                                          00312000
*               END;                                            01S0224 00313000
*           END;                                                01S0225 00314000
*         ELSE                      /* NON RETRYABLE ERROR CODE      */ 00315000
*           DO;                                                 01S0226 00316000
         B     @RC00213                                         01S0226 00317000
@RF00213 DS    0H                                               01S0227 00318000
*             CALL SENDMSG;         /* SEND MESSAGE IKT019I TO  01S0227 00319000
*                                      OPERATOR              @ZA35513*/ 00320000
         BAL   @14,SENDMSG                                      01S0227 00321000
*             RETCODE=0;            /* STOP CYCLE                    */ 00322000
         SLR   RETCODE,RETCODE                                  01S0228 00323000
*             WSRETRYB='0'B;        /* TURN OFF RETRY BIT TO INDICATE   00324000
*                                      RETRY IMPOSSIBLE              */ 00325000
         NI    WSRETRYB(RPLBASE),B'11110111'                    01S0229 00326000
*           END;                                                01S0230 00327000
*       END;                        /* END OF LOOP                   */ 00328000
@RC00213 DS    0H                                               01S0231 00329000
@DE00212 LTR   RETCODE,RETCODE                                  01S0231 00330000
         BNZ   @DL00212                                         01S0231 00331000
*     END;                                                      01S0232 00332000
*   IF WSRETRYB='0'B THEN           /* NO MORE RETRIES TO BE    01S0233 00333000
*                                      ATTEMPTED             @ZA35513*/ 00334000
@RC00199 TM    WSRETRYB(RPLBASE),B'00001000'                    01S0233 00335000
         BNZ   @RF00233                                         01S0233 00336000
*     DO;                           /* FREE WORK ELEMENT AND RPL        00337000
*                                                            @ZA35513*/ 00338000
*       REG0=WSSIZE|'02000000'X;    /* STORE AREA SIZE AND SUBPOOL ID*/ 00339000
         L     REG0,WSSIZE(,RPLBASE)                            01S0235 00340000
         O     REG0,@CF01899                                    01S0235 00341000
*       REG1=RPLBASE-LENGTH(WESTD); /* COMPUTE STARTING ADDRESS 01S0236 00342000
*                                                            @ZM44192*/ 00343000
         LR    REG1,RPLBASE                                     01S0236 00344000
         SL    REG1,@CF01908                                    01S0236 00345000
*       GENERATE CODE;                                          01S0237 00346000
         FREEMAIN R,LV=(0),A=(1)                                        00347000
*     END;                          /* END OF FREE WORK ELEMENT AND     00348000
*                                      RPL                   @ZA35513*/ 00349000
*   END TERMREL;                                                01S0239 00350000
*                                                               01S0239 00351000
@EL00002 DS    0H                                               01S0239 00352000
@EF00002 DS    0H                                               01S0239 00353000
@ER00002 L     @14,@SA00002                                     01S0239 00354000
         BR    @14                                              01S0239 00355000
*/********************************************************************/ 00356000
*/* END OF SUBROUTINE                                                */ 00357000
*/********************************************************************/ 00358000
*                                                               01S0240 00359000
         EJECT                                                          00360000
*                                                               01S0240 00361000
*/********************************************************************/ 00362000
*/*                                                                  */ 00363000
*/* SUBROUTINE-                                                      */ 00364000
*/*      SENDMSG                                                     */ 00365000
*/*                                                                  */ 00366000
*/* FUNCTION-                                                        */ 00367000
*/*      SET UP MESSAGE IKT019I WITH RPLRTNCD AND RPLFDB2 AND SEND   */ 00368000
*/*      TO THE OPERATOR                                             */ 00369000
*/*                                                          @ZA35513*/ 00370000
*/********************************************************************/ 00371000
*                                                               01S0240 00372000
*SENDMSG:                                                       01S0240 00373000
*   PROC OPTIONS(SAVE(14));         /* START OF SUBROUTINE   @ZA35513*/ 00374000
SENDMSG  ST    @14,@SA00003                                     01S0240 00375000
*   REG1=IKT019I;                   /* INSERT MESSAGE INDEX VALUE       00376000
*                                                            @ZA35513*/ 00377000
         LA    REG1,19                                          01S0241 00378000
*   CALL IKTCAS56;                  /* GET MSG DSECT         @ZA35513*/ 00379000
         L     @08,CVTPTR                                       01S0242 00380000
         L     @08,TCASTPTR(,@08)                               01S0242 00381000
         L     @08,TWAPTR(,@08)                                 01S0242 00382000
         L     @15,TWAMSG(,@08)                                 01S0242 00383000
         BALR  @14,@15                                          01S0242 00384000
*   RFY                                                         01S0243 00385000
*     MSGENTRY BASED(REG1);         /* ADDRESS MESSAGE TEXT  @ZA35513*/ 00386000
*   MACTERM=NIBSYM;                 /* INSERT TERMINAL ID    @ZA35513*/ 00387000
         L     @14,RPLAREA(,RPLBASE)                            01S0244 00388000
         MVC   MACTERM(8,REG1),NIBSYM(@14)                      01S0244 00389000
*   UNPK(REASON(3:7),REASNRPL);     /* UNPACK RETURN CODE AND   01S0245 00390000
*                                      FEEDBACK              @ZA38162*/ 00391000
         UNPK  REASON+2(5,REG1),REASNRPL(3,RPLBASE)             01S0245 00392000
*   UNPK(SENSE,SENSERPL);           /* UNPACK SYSTEM AND USER SENSE     00393000
*                                                            @ZA38162*/ 00394000
         UNPK  SENSE(9,REG1),SENSERPL(5,RPLBASE)                01S0246 00395000
*   REASON(3:6)=REASON(3:6)&&ZEROS; /* ZERO OUT HIGH ORDER NIBBLE       00396000
*                                                            @ZA38162*/ 00397000
         XC    REASON+2(4,REG1),@CC01848                        01S0247 00398000
*   SENSE(1:8)=SENSE(1:8)&&ZEROS;   /* ZERO OUT HIGH ORDER NIBBLE       00399000
*                                                            @ZA38162*/ 00400000
         XC    SENSE(8,REG1),@CC01848                           01S0248 00401000
*   TR(REASON(3:6),TRANTAB);        /* CONVERT TO PRINTABLE     01S0249 00402000
*                                      CHARACTERS            @ZA38162*/ 00403000
         TR    REASON+2(4,REG1),TRANTAB                         01S0249 00404000
*   TR(SENSE(1:8),TRANTAB);         /* CONVERT TO PRINTABLE     01S0250 00405000
*                                      CHARACTERS            @ZA38162*/ 00406000
         TR    SENSE(8,REG1),TRANTAB                            01S0250 00407000
*   REASON(7)='';                   /* INSERT BLANK IN LAST POSITION    00408000
*                                                            @ZA35513*/ 00409000
         MVI   REASON+6(REG1),C' '                              01S0251 00410000
*   SENSE(9)='';                    /* INSERT BLANK IN LAST POSITION    00411000
*                                                            @ZA38162*/ 00412000
         MVI   SENSE+8(REG1),C' '                               01S0252 00413000
*   REASON(1:2)='01';               /* INSERT REASON CODE INTO  01S0253 00414000
*                                      MESSAGE (CLSDST FAILED)  01S0253 00415000
*                                                            @ZA35513*/ 00416000
         MVC   REASON(2,REG1),@CC01907                          01S0253 00417000
*   RFY                                                         01S0254 00418000
*     REG7 RSTD;                    /* RESTRICT WORK REGISTER   01S0254 00419000
*                                                            @ZA35513*/ 00420000
*   REG7=ADDR(MSGLIST);             /* LOAD ADDRESS OF LIST FORM OF     00421000
*                                      WTO                   @ZA35513*/ 00422000
         LA    REG7,MSGLIST(,REG1)                              01S0255 00423000
*   GENERATE CODE( WTO DESC=3,MF=(E,(7)));/* ISSUE MESSAGE   @ZA35513*/ 00424000
          WTO DESC=3,MF=(E,(7))                                         00425000
*   RFY                                                         01S0257 00426000
*     REG7 UNRSTD;                  /* FREE UP WORK REGISTER @ZA35513*/ 00427000
*   END SENDMSG;                    /* END OF SUBROUTINE             */ 00428000
@EL00003 DS    0H                                               01S0258 00429000
@EF00003 DS    0H                                               01S0258 00430000
@ER00003 L     @14,@SA00003                                     01S0258 00431000
         BR    @14                                              01S0258 00432000
*/********************************************************************/ 00433000
*/* END OF SUBROUTINE                                                */ 00434000
*/********************************************************************/ 00435000
*                                                               01S0259 00436000
*   END IKTCASOX                    /* END OF MODULE                 */ 00437000
*                                                               01S0259 00438000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00439000
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */ 00440000
*/*%INCLUDE SYSUT5  (IKTCASOX)                                       */ 00441000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00442000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00443000
*/*%INCLUDE SYSLIB  (IKTTCAST)                                       */ 00444000
*/*%INCLUDE SYSLIB  (IKTCASWA)                                       */ 00445000
*/*%INCLUDE SYSLIB  (IKTWESTD)                                       */ 00446000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 00447000
*/*%INCLUDE SYSLIB  (IFGRPLVS)                                       */ 00448000
*/*%INCLUDE SYSLIB  (ISTRPLEX)                                       */ 00449000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 00450000
*/*%INCLUDE SYSUT5  (MEMREQ  )                                       */ 00451000
*/*%INCLUDE SYSUT5  (TERMREL )                                       */ 00452000
*/*%INCLUDE SYSUT5  (SENDMSG )                                       */ 00453000
*                                                               01S0259 00454000
*       ;                                                       01S0259 00455000
@DATA    DS    0H                                                       00456000
         DS    0F                                                       00457000
@SA00001 DS    18F                                                      00458000
@SA00002 DS    1F                                                       00459000
@SA00003 DS    1F                                                       00460000
         DS    0F                                                       00461000
@CF00043 DC    F'4'                                                     00462000
@CF00035 DC    F'8'                                                     00463000
@CF01908 DC    F'84'                                                    00464000
@CF01899 DC    XL4'02000000'                                            00465000
@CV01887 DC    V(IKTCASCX)                                              00466000
         DS    0D                                                       00467000
@CC01848 DC    C'00000000'                                              00468000
@CC01907 DC    C'01'                                                    00469000
TRANTAB  DC    CL16'0123456789ABCDEF'                                   00470000
PATAREA  DC    25H'0'                                                   00471000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00472000
@01      EQU   01                                                       00473000
@02      EQU   02                                                       00474000
@03      EQU   03                                                       00475000
@04      EQU   04                                                       00476000
@05      EQU   05                                                       00477000
@06      EQU   06                                                       00478000
@07      EQU   07                                                       00479000
@08      EQU   08                                                       00480000
@09      EQU   09                                                       00481000
@10      EQU   10                                                       00482000
@11      EQU   11                                                       00483000
@12      EQU   12                                                       00484000
@13      EQU   13                                                       00485000
@14      EQU   14                                                       00486000
@15      EQU   15                                                       00487000
SAVREG14 EQU   @09                                                      00488000
WORKBASE EQU   @07                                                      00489000
REG0     EQU   @00                                                      00490000
REG1     EQU   @01                                                      00491000
RPLBASE  EQU   @02                                                      00492000
REG4     EQU   @04                                                      00493000
QHREG    EQU   @04                                                      00494000
WEREG    EQU   @05                                                      00495000
QBASEREG EQU   @06                                                      00496000
REG7     EQU   @07                                                      00497000
EXITREG  EQU   @10                                                      00498000
REG14    EQU   @14                                                      00499000
RETCODE  EQU   @15                                                      00500000
PSA      EQU   0                                                        00501000
FLCRNPSW EQU   PSA                                                      00502000
FLCROPSW EQU   PSA+8                                                    00503000
FLCICCW2 EQU   PSA+16                                                   00504000
FLCCVT   EQU   FLCICCW2                                                 00505000
PSAEEPSW EQU   PSA+132                                                  00506000
PSAESPSW EQU   PSA+136                                                  00507000
FLCSVILC EQU   PSAESPSW+1                                               00508000
PSAEPPSW EQU   PSA+140                                                  00509000
FLCPIILC EQU   PSAEPPSW+1                                               00510000
FLCPICOD EQU   PSAEPPSW+2                                               00511000
PSAPICOD EQU   FLCPICOD+1                                               00512000
FLCTEA   EQU   PSAEPPSW+4                                               00513000
FLCPER   EQU   PSA+152                                                  00514000
FLCMCLA  EQU   PSA+168                                                  00515000
FLCIOEL  EQU   FLCMCLA+4                                                00516000
FLCIOA   EQU   FLCMCLA+16                                               00517000
FLCFSA   EQU   FLCMCLA+80                                               00518000
PSASUPER EQU   PSA+552                                                  00519000
PSASUP1  EQU   PSASUPER                                                 00520000
PSASUP2  EQU   PSASUPER+1                                               00521000
PSASUP3  EQU   PSASUPER+2                                               00522000
PSASUP4  EQU   PSASUPER+3                                               00523000
PSACLHT  EQU   PSA+640                                                  00524000
PSALKSA  EQU   PSA+696                                                  00525000
PSAHLHI  EQU   PSA+760                                                  00526000
PSADSSFL EQU   PSA+836                                                  00527000
PSADSSF1 EQU   PSADSSFL                                                 00528000
PSADSSF3 EQU   PSADSSFL+2                                               00529000
PSADSSF4 EQU   PSADSSFL+3                                               00530000
PSARSVT  EQU   PSA+896                                                  00531000
CVTMAP   EQU   0                                                        00532000
CVTDAR   EQU   CVTMAP+72                                                00533000
CVTFLGS1 EQU   CVTDAR                                                   00534000
CVTDCB   EQU   CVTMAP+116                                               00535000
CVTIERLC EQU   CVTMAP+144                                               00536000
CVTOPTA  EQU   CVTMAP+182                                               00537000
CVTOPTB  EQU   CVTMAP+183                                               00538000
CVTGTF   EQU   CVTMAP+236                                               00539000
CVTGTFST EQU   CVTGTF                                                   00540000
CVTGTFS  EQU   CVTGTFST                                                 00541000
CVTSTATE EQU   CVTGTFST                                                 00542000
CVTTMODE EQU   CVTGTFST                                                 00543000
CVTFORM  EQU   CVTGTFST                                                 00544000
CVTAQAVT EQU   CVTMAP+240                                               00545000
CVTTCMFG EQU   CVTAQAVT                                                 00546000
CVTVOLM2 EQU   CVTMAP+244                                               00547000
CVTTATA  EQU   CVTVOLM2                                                 00548000
CVTTSKS  EQU   CVTTATA                                                  00549000
CVTVOLF2 EQU   CVTTSKS                                                  00550000
CVTTAT   EQU   CVTTATA+1                                                00551000
CVTATER  EQU   CVTMAP+248                                               00552000
CVTEXT1  EQU   CVTMAP+252                                               00553000
CVTPURG  EQU   CVTMAP+260                                               00554000
CVTQMSG  EQU   CVTMAP+268                                               00555000
CVTDMSR  EQU   CVTMAP+272                                               00556000
CVTRSV37 EQU   CVTDMSR                                                  00557000
CVTDMSRF EQU   CVTRSV37                                                 00558000
CVTERPV  EQU   CVTMAP+316                                               00559000
CVTINTLA EQU   CVTMAP+320                                               00560000
CVTAPF   EQU   CVTMAP+324                                               00561000
CVTEXT2  EQU   CVTMAP+328                                               00562000
CVTHJES  EQU   CVTMAP+332                                               00563000
CVTPGSIA EQU   CVTMAP+348                                               00564000
CVTA1F1  EQU   CVTMAP+356                                               00565000
CVTSYSK  EQU   CVTMAP+357                                               00566000
CVTVOLM1 EQU   CVTMAP+380                                               00567000
CVTVOLF1 EQU   CVTVOLM1                                                 00568000
CVTXTNT1 EQU   0                                                        00569000
CVTXTNT2 EQU   0                                                        00570000
CVTDSSV  EQU   CVTXTNT2                                                 00571000
CVTFLGBT EQU   CVTXTNT2+5                                               00572000
CVTQID   EQU   CVTXTNT2+24                                              00573000
CVTRV400 EQU   CVTXTNT2+52                                              00574000
CVTRV409 EQU   CVTXTNT2+53                                              00575000
CVTATCVT EQU   CVTXTNT2+64                                              00576000
CVTRV429 EQU   CVTXTNT2+84                                              00577000
CVTRV438 EQU   CVTXTNT2+85                                              00578000
CVTRV457 EQU   CVTXTNT2+112                                             00579000
CVTRV466 EQU   CVTXTNT2+113                                             00580000
CVTFIX   EQU   0                                                        00581000
CVTRELNO EQU   CVTFIX+252                                               00582000
TCAST    EQU   0                                                        00583000
TCASUSER EQU   TCAST+4                                                  00584000
TCASWA   EQU   TCAST+60                                                 00585000
TCASFLG1 EQU   TCAST+88                                                 00586000
TWAR     EQU   0                                                        00587000
TWAMSG   EQU   TWAR+48                                                  00588000
TWAMFL   EQU   TWAR+80                                                  00589000
TWAVFL   EQU   TWAR+81                                                  00590000
TWAUFL   EQU   TWAR+82                                                  00591000
TWACFL   EQU   TWAR+83                                                  00592000
TWAM     EQU   TWAR+84                                                  00593000
TWAME    EQU   TWAM+68                                                  00594000
TWAMEI   EQU   TWAME                                                    00595000
TWAV     EQU   TWAR+184                                                 00596000
TWAVE    EQU   TWAV+68                                                  00597000
TWAVEI   EQU   TWAVE                                                    00598000
TWAVI    EQU   TWAR+284                                                 00599000
TWAU     EQU   TWAR+300                                                 00600000
TWAUE    EQU   TWAU+68                                                  00601000
TWAUEI   EQU   TWAUE                                                    00602000
TWAUI    EQU   TWAR+400                                                 00603000
TWAUECB  EQU   TWAUI                                                    00604000
TWAUACQH EQU   TWAUI+4                                                  00605000
TWAC     EQU   TWAR+408                                                 00606000
TWACE    EQU   TWAC+68                                                  00607000
TWACEI   EQU   TWACE                                                    00608000
TWACI    EQU   TWAR+508                                                 00609000
WESTD    EQU   0                                                        00610000
WECODE1  EQU   WESTD                                                    00611000
WECODE1T EQU   WECODE1                                                  00612000
WECODE1F EQU   WECODE1+1                                                00613000
WECODE2  EQU   WESTD+2                                                  00614000
WECODE2F EQU   WECODE2+1                                                00615000
WENEXT   EQU   WESTD+4                                                  00616000
WERC     EQU   WESTD+8                                                  00617000
WEVNIB   EQU   WESTD+16                                                 00618000
WETERM   EQU   WESTD+28                                                 00619000
WETMFLG  EQU   WESTD+32                                                 00620000
IFGRPL   EQU   0                                                        00621000
RPLCOMN  EQU   IFGRPL                                                   00622000
RPLIDWD  EQU   RPLCOMN                                                  00623000
RPLLEN   EQU   RPLIDWD+3                                                00624000
RPLECB   EQU   RPLCOMN+8                                                00625000
RPLFDBWD EQU   RPLCOMN+12                                               00626000
RPLFDBK  EQU   RPLFDBWD+1                                               00627000
RPLRTNCD EQU   RPLFDBK                                                  00628000
RPLCNDCD EQU   RPLFDBK+1                                                00629000
RPLCMPON EQU   RPLCNDCD                                                 00630000
RPLFDB2  EQU   RPLCMPON                                                 00631000
RPLERRCD EQU   RPLCNDCD+1                                               00632000
RPLFDB3  EQU   RPLERRCD                                                 00633000
RPLKEYLE EQU   RPLCOMN+16                                               00634000
RPLAREA  EQU   RPLCOMN+32                                               00635000
RPLARG   EQU   RPLCOMN+36                                               00636000
RPLOPTCD EQU   RPLCOMN+40                                               00637000
RPLOPT1  EQU   RPLOPTCD                                                 00638000
RPLECBSW EQU   RPLOPT1                                                  00639000
RPLOPT2  EQU   RPLOPTCD+1                                               00640000
RPLADR   EQU   RPLOPT2                                                  00641000
RPLOPT3  EQU   RPLOPTCD+2                                               00642000
RPLOPT4  EQU   RPLOPTCD+3                                               00643000
RPLNXTRP EQU   RPLCOMN+44                                               00644000
RPLOPTC2 EQU   RPLCOMN+56                                               00645000
RPLOPT5  EQU   RPLOPTC2                                                 00646000
RPLWRTYP EQU   RPLOPT5                                                  00647000
RPLOPT6  EQU   RPLOPTC2+1                                               00648000
RPLUNTYP EQU   RPLOPT6                                                  00649000
RPLOPT7  EQU   RPLOPTC2+2                                               00650000
RPLCNOPT EQU   RPLOPT7                                                  00651000
RPLOPT8  EQU   RPLOPTC2+3                                               00652000
RPLRBAR  EQU   RPLCOMN+60                                               00653000
RPLAIXID EQU   RPLRBAR+2                                                00654000
RPLEXTDS EQU   RPLCOMN+68                                               00655000
RPLEXTD1 EQU   RPLEXTDS                                                 00656000
RPLVTEXT EQU   IFGRPL+76                                                00657000
RPLFDBK2 EQU   RPLVTEXT+12                                              00658000
RPLSSNSI EQU   RPLFDBK2                                                 00659000
RPLDSB   EQU   RPLSSNSI                                                 00660000
RPLDSB1  EQU   RPLDSB                                                   00661000
RPLSSEI  EQU   RPLDSB1                                                  00662000
RPLDSB2  EQU   RPLDSB+1                                                 00663000
RPLUSNSI EQU   RPLFDBK2+2                                               00664000
RPLOPTC3 EQU   RPLVTEXT+20                                              00665000
RPLOPT9  EQU   RPLOPTC3                                                 00666000
RPLOPT10 EQU   RPLOPTC3+1                                               00667000
RPLOPT11 EQU   RPLOPTC3+2                                               00668000
RPLOPT12 EQU   RPLOPTC3+3                                               00669000
RPLOSENS EQU   RPLVTEXT+24                                              00670000
RPLSSNSO EQU   RPLOSENS                                                 00671000
RPLSSEO  EQU   RPLSSNSO                                                 00672000
RPLOF16  EQU   0                                                        00673000
RPLRH3   EQU   RPLOF16                                                  00674000
RPLSRTYP EQU   RPLOF16+1                                                00675000
RPLSTYPE EQU   RPLSRTYP                                                 00676000
RPLRTYPE EQU   RPLSRTYP                                                 00677000
RPLCHN   EQU   RPLOF16+2                                                00678000
RPLVTFL1 EQU   RPLOF16+3                                                00679000
RPLVTFL2 EQU   RPLOF16+4                                                00680000
RPLPOSTV EQU   RPLVTFL2                                                 00681000
RPLRESP  EQU   RPLVTFL2                                                 00682000
RPLCNTRL EQU   RPLOF16+5                                                00683000
RPLCNTDF EQU   RPLCNTRL                                                 00684000
RPLCNTDC EQU   RPLCNTRL+1                                               00685000
RPLCNTSC EQU   RPLCNTRL+2                                               00686000
RPLOF56  EQU   0                                                        00687000
RPLO5    EQU   RPLOF56                                                  00688000
RPLOF60  EQU   0                                                        00689000
RPLOBSQ  EQU   RPLOF60+4                                                00690000
RPLIBSQ  EQU   RPLOF60+5                                                00691000
ISTPROCD EQU   0                                                        00692000
PROPROC  EQU   ISTPROCD                                                 00693000
PROPROC1 EQU   PROPROC                                                  00694000
PROPROC2 EQU   PROPROC+1                                                00695000
PROPROC3 EQU   PROPROC+2                                                00696000
PROPROC4 EQU   PROPROC+3                                                00697000
PROPROCS EQU   0                                                        00698000
PROSETMS EQU   PROPROCS+1                                               00699000
PROSETM2 EQU   PROSETMS                                                 00700000
PROSETM3 EQU   PROSETMS+1                                               00701000
PROSETM4 EQU   PROSETMS+2                                               00702000
ISTDEVCH EQU   0                                                        00703000
DEVSHCH  EQU   ISTDEVCH                                                 00704000
DEVCHAR  EQU   DEVSHCH                                                  00705000
DEVTCODE EQU   ISTDEVCH+1                                               00706000
DEVFLAGS EQU   ISTDEVCH+3                                               00707000
DEVFCCTL EQU   DEVFLAGS                                                 00708000
DEVCHAR3 EQU   DEVFLAGS                                                 00709000
DEVMODE  EQU   ISTDEVCH+5                                               00710000
ISTNIB   EQU   0                                                        00711000
NIBSYM   EQU   ISTNIB+12                                                00712000
NIBFLGS  EQU   ISTNIB+40                                                00713000
NIBFLG1  EQU   NIBFLGS                                                  00714000
NIBCON   EQU   NIBFLG1                                                  00715000
MSGENTRY EQU   0                                                        00716000
MSGLIST  EQU   MSGENTRY+4                                               00717000
REASON   EQU   MSGLIST+15                                               00718000
SENSE    EQU   MSGLIST+28                                               00719000
MACTERM  EQU   MSGLIST+46                                               00720000
WORKSPAC EQU   112                                                      00721000
WSFLG1   EQU   WORKSPAC                                                 00722000
WSCLSREL EQU   WSFLG1                                                   00723000
WSRETRYB EQU   WSFLG1                                                   00724000
WSRETRY  EQU   WORKSPAC+1                                               00725000
WSCOND   EQU   WORKSPAC+2                                               00726000
WSMACRTC EQU   WSCOND                                                   00727000
WSMACRSC EQU   WSCOND+1                                                 00728000
WSSIZE   EQU   WORKSPAC+4                                               00729000
IKTCAS56 EQU   0                                                        00730000
ISTRPL   EQU   0                                                        00731000
PSARSVTE EQU   PSARSVT                                                  00732000
CVTPTR   EQU   FLCCVT                                                   00733000
CVTS01   EQU   CVTPGSIA                                                 00734000
CVTLPDIA EQU   CVTS01+12                                                00735000
CVTDIRST EQU   CVTLPDIA                                                 00736000
CVTSLIDA EQU   CVTS01+24                                                00737000
CVTCTLFG EQU   CVTS01+50                                                00738000
CVTRV210 EQU   CVTS01+424                                               00739000
CVTRV219 EQU   CVTS01+425                                               00740000
CVTRV228 EQU   CVTS01+426                                               00741000
CVTRV237 EQU   CVTS01+427                                               00742000
CVTMFRTR EQU   CVTS01+452                                               00743000
CVTRV262 EQU   CVTS01+468                                               00744000
CVTRV271 EQU   CVTS01+469                                               00745000
CVTRV280 EQU   CVTS01+470                                               00746000
CVTRV289 EQU   CVTS01+471                                               00747000
CVTGSDA  EQU   CVTS01+600                                               00748000
CVTTCASP EQU   CVTS01+664                                               00749000
TCASTPTR EQU   CVTTCASP                                                 00750000
TWAPTR   EQU   TCASWA                                                   00751000
REASNRPL EQU   RPLFDBK                                                  00752000
SENSERPL EQU   RPLFDBK2                                                 00753000
FLC      EQU   PSA                                                      00754000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00755000
CVTRV628 EQU   CVTS01+728                                               00756000
CVTRV627 EQU   CVTS01+724                                               00757000
CVTRV626 EQU   CVTS01+720                                               00758000
CVTRV625 EQU   CVTS01+716                                               00759000
CVTRV624 EQU   CVTS01+712                                               00760000
CVTRV623 EQU   CVTS01+708                                               00761000
CVTRV622 EQU   CVTS01+704                                               00762000
CVTRV621 EQU   CVTS01+700                                               00763000
CVTIHASU EQU   CVTS01+696                                               00764000
CVTSUSP  EQU   CVTS01+692                                               00765000
CVTT6SVC EQU   CVTS01+688                                               00766000
CVTCDAL  EQU   CVTS01+684                                               00767000
CVTTCTL  EQU   CVTS01+680                                               00768000
CVTRSUME EQU   CVTS01+676                                               00769000
CVTJTERM EQU   CVTS01+672                                               00770000
CVTASMRM EQU   CVTS01+668                                               00771000
CVT0PT03 EQU   CVTS01+660                                               00772000
CVT0PT0E EQU   CVTS01+656                                               00773000
CVTRV609 EQU   CVTS01+652                                               00774000
CVTCGK   EQU   CVTS01+648                                               00775000
CVTRAC   EQU   CVTS01+644                                               00776000
CVTRV606 EQU   CVTS01+640                                               00777000
CVTRV605 EQU   CVTS01+636                                               00778000
CVTRV604 EQU   CVTS01+632                                               00779000
CVTEFF02 EQU   CVTS01+628                                               00780000
CVTCBBR  EQU   CVTS01+624                                               00781000
CVTSSCR  EQU   CVTS01+620                                               00782000
CVTEVENT EQU   CVTS01+616                                               00783000
CVTCRCA  EQU   CVTS01+612                                               00784000
CVTTPIO  EQU   CVTS01+608                                               00785000
CVTADV   EQU   CVTS01+604                                               00786000
CVTGSDAB EQU   CVTGSDA                                                  00787000
CVTQV3   EQU   CVTS01+596                                               00788000
CVTQV2   EQU   CVTS01+592                                               00789000
CVTQV1   EQU   CVTS01+588                                               00790000
CVTRPT   EQU   CVTS01+584                                               00791000
CVTSSRB  EQU   CVTS01+580                                               00792000
CVTCSDRL EQU   CVTS01+576                                               00793000
CVTEXP1  EQU   CVTS01+572                                               00794000
CVTRMPMT EQU   CVTS01+568                                               00795000
CVTRMPTT EQU   CVTS01+564                                               00796000
CVTVPSA  EQU   CVTS01+560                                               00797000
CVTVSTOP EQU   CVTS01+556                                               00798000
CVTGTFR8 EQU   CVTS01+552                                               00799000
CVTQUIT  EQU   CVTS01+548                                               00800000
CVTVACR  EQU   CVTS01+544                                               00801000
CVTWTCB  EQU   CVTS01+540                                               00802000
CVTSTPRS EQU   CVTS01+536                                               00803000
CVT0PT02 EQU   CVTS01+532                                               00804000
CVTDARCM EQU   CVTS01+528                                               00805000
CVTIRECM EQU   CVTS01+524                                               00806000
CVTJRECM EQU   CVTS01+520                                               00807000
CVTVEMS0 EQU   CVTS01+516                                               00808000
CVTSPFRR EQU   CVTS01+512                                               00809000
CVTRLSTG EQU   CVTS01+508                                               00810000
CVT0TC0A EQU   CVTS01+504                                               00811000
CVTGMBR  EQU   CVTS01+500                                               00812000
CVTLFRM  EQU   CVTS01+496                                               00813000
CVTRMBR  EQU   CVTS01+492                                               00814000
CVTVIOP  EQU   CVTS01+488                                               00815000
CVTRV307 EQU   CVTS01+486                                               00816000
CVTRV306 EQU   CVTS01+484                                               00817000
CVTRV305 EQU   CVTS01+482                                               00818000
CVTRV304 EQU   CVTS01+480                                               00819000
CVTRV303 EQU   CVTS01+478                                               00820000
CVTRV302 EQU   CVTS01+476                                               00821000
CVTTRCA  EQU   CVTS01+472                                               00822000
CVTRV297 EQU   CVTRV289                                                 00823000
CVTRV296 EQU   CVTRV289                                                 00824000
CVTRV295 EQU   CVTRV289                                                 00825000
CVTRV294 EQU   CVTRV289                                                 00826000
CVTRV293 EQU   CVTRV289                                                 00827000
CVTRV292 EQU   CVTRV289                                                 00828000
CVTRV291 EQU   CVTRV289                                                 00829000
CVTRV290 EQU   CVTRV289                                                 00830000
CVTRV288 EQU   CVTRV280                                                 00831000
CVTRV287 EQU   CVTRV280                                                 00832000
CVTRV286 EQU   CVTRV280                                                 00833000
CVTRV285 EQU   CVTRV280                                                 00834000
CVTRV284 EQU   CVTRV280                                                 00835000
CVTRV283 EQU   CVTRV280                                                 00836000
CVTRV282 EQU   CVTRV280                                                 00837000
CVTRV281 EQU   CVTRV280                                                 00838000
CVTRV279 EQU   CVTRV271                                                 00839000
CVTRV278 EQU   CVTRV271                                                 00840000
CVTRV277 EQU   CVTRV271                                                 00841000
CVTRV276 EQU   CVTRV271                                                 00842000
CVTRV275 EQU   CVTRV271                                                 00843000
CVTRV274 EQU   CVTRV271                                                 00844000
CVTRV273 EQU   CVTRV271                                                 00845000
CVTRV272 EQU   CVTRV271                                                 00846000
CVTRV270 EQU   CVTRV262                                                 00847000
CVTRV269 EQU   CVTRV262                                                 00848000
CVTRV268 EQU   CVTRV262                                                 00849000
CVTRV267 EQU   CVTRV262                                                 00850000
CVTRV266 EQU   CVTRV262                                                 00851000
CVTRV265 EQU   CVTRV262                                                 00852000
CVTRV264 EQU   CVTRV262                                                 00853000
CVTRV263 EQU   CVTRV262                                                 00854000
CVTVFP   EQU   CVTS01+464                                               00855000
CVTVSI   EQU   CVTS01+460                                               00856000
CVTVPSIB EQU   CVTS01+456                                               00857000
CVTMFACT EQU   CVTMFRTR                                                 00858000
CVTMFCTL EQU   CVTS01+448                                               00859000
CVTPVBP  EQU   CVTS01+444                                               00860000
CVTPWI   EQU   CVTS01+440                                               00861000
CVTRV254 EQU   CVTS01+438                                               00862000
CVTRV253 EQU   CVTS01+436                                               00863000
CVTRV252 EQU   CVTS01+434                                               00864000
CVTRV251 EQU   CVTS01+433                                               00865000
CVTRV250 EQU   CVTS01+432                                               00866000
CVTRV249 EQU   CVTS01+431                                               00867000
CVTRV248 EQU   CVTS01+430                                               00868000
CVTRV247 EQU   CVTS01+429                                               00869000
CVTRV246 EQU   CVTS01+428                                               00870000
CVTRV245 EQU   CVTRV237                                                 00871000
CVTRV244 EQU   CVTRV237                                                 00872000
CVTRV243 EQU   CVTRV237                                                 00873000
CVTRV242 EQU   CVTRV237                                                 00874000
CVTRV241 EQU   CVTRV237                                                 00875000
CVTRV240 EQU   CVTRV237                                                 00876000
CVTRV239 EQU   CVTRV237                                                 00877000
CVTRV238 EQU   CVTRV237                                                 00878000
CVTRV236 EQU   CVTRV228                                                 00879000
CVTRV235 EQU   CVTRV228                                                 00880000
CVTRV234 EQU   CVTRV228                                                 00881000
CVTRV233 EQU   CVTRV228                                                 00882000
CVTRV232 EQU   CVTRV228                                                 00883000
CVTRV231 EQU   CVTRV228                                                 00884000
CVTRV230 EQU   CVTRV228                                                 00885000
CVTRV229 EQU   CVTRV228                                                 00886000
CVTRV227 EQU   CVTRV219                                                 00887000
CVTRV226 EQU   CVTRV219                                                 00888000
CVTRV225 EQU   CVTRV219                                                 00889000
CVTRV224 EQU   CVTRV219                                                 00890000
CVTRV223 EQU   CVTRV219                                                 00891000
CVTRV222 EQU   CVTRV219                                                 00892000
CVTRV221 EQU   CVTRV219                                                 00893000
CVTRV220 EQU   CVTRV219                                                 00894000
CVTRV218 EQU   CVTRV210                                                 00895000
CVTRV217 EQU   CVTRV210                                                 00896000
CVTRV216 EQU   CVTRV210                                                 00897000
CVTRV215 EQU   CVTRV210                                                 00898000
CVTRV214 EQU   CVTRV210                                                 00899000
CVTRV213 EQU   CVTRV210                                                 00900000
CVTRV212 EQU   CVTRV210                                                 00901000
CVTRV211 EQU   CVTRV210                                                 00902000
CVTLCCAT EQU   CVTS01+420                                               00903000
CVTPCCAT EQU   CVTS01+416                                               00904000
CVTIPCRP EQU   CVTS01+412                                               00905000
CVTIPCRI EQU   CVTS01+408                                               00906000
CVTIPCDS EQU   CVTS01+404                                               00907000
CVTAIDVT EQU   CVTS01+400                                               00908000
CVTSSAP  EQU   CVTS01+396                                               00909000
CVTEHCIR EQU   CVTS01+392                                               00910000
CVTEHDEF EQU   CVTS01+388                                               00911000
CVTDAIR  EQU   CVTS01+384                                               00912000
CVTPERFM EQU   CVTS01+380                                               00913000
CVT044R2 EQU   CVTS01+376                                               00914000
CVTFETCH EQU   CVTS01+372                                               00915000
CVTRSTWD EQU   CVTS01+368                                               00916000
CVTSPOST EQU   CVTS01+364                                               00917000
CVTIOBP  EQU   CVTS01+360                                               00918000
CVTASMVT EQU   CVTS01+356                                               00919000
CVTRECRQ EQU   CVTS01+352                                               00920000
CVTWSAC  EQU   CVTS01+348                                               00921000
CVTRV149 EQU   CVTS01+344                                               00922000
CVTWSAL  EQU   CVTS01+340                                               00923000
CVTSPSA  EQU   CVTS01+336                                               00924000
CVTGLMN  EQU   CVTS01+332                                               00925000
CVTVEAC0 EQU   CVTS01+328                                               00926000
CVT062R1 EQU   CVTS01+324                                               00927000
CVTRPOST EQU   CVTS01+320                                               00928000
CVTDQIQE EQU   CVTS01+316                                               00929000
CVTCSD   EQU   CVTS01+312                                               00930000
CVTLKRMA EQU   CVTS01+308                                               00931000
CVTRSPIE EQU   CVTS01+304                                               00932000
CVTRENQ  EQU   CVTS01+300                                               00933000
CVTLQCB  EQU   CVTS01+296                                               00934000
CVTFQCB  EQU   CVTS01+292                                               00935000
CVTQCS01 EQU   CVTS01+288                                               00936000
CVTAPFT  EQU   CVTS01+284                                               00937000
CVTPARRL EQU   CVTS01+280                                               00938000
CVTVWAIT EQU   CVTS01+276                                               00939000
CVTGSPL  EQU   CVTS01+272                                               00940000
CVTLSMQ  EQU   CVTS01+268                                               00941000
CVTGSMQ  EQU   CVTS01+264                                               00942000
CVTEXPRO EQU   CVTS01+260                                               00943000
CVTOPCTP EQU   CVTS01+256                                               00944000
CVTSIC   EQU   CVTS01+252                                               00945000
CVTTPIOS EQU   CVTS01+248                                               00946000
CVTRTMS  EQU   CVTS01+244                                               00947000
CVTSDBF  EQU   CVTS01+240                                               00948000
CVTSCBP  EQU   CVTS01+236                                               00949000
CVTSDMP  EQU   CVTS01+232                                               00950000
CVTSV60  EQU   CVTS01+228                                               00951000
CVTRTMCT EQU   CVTS01+224                                               00952000
CVTASCBL EQU   CVTS01+220                                               00953000
CVTASCBH EQU   CVTS01+216                                               00954000
CVTGDA   EQU   CVTS01+212                                               00955000
CVTASVT  EQU   CVTS01+208                                               00956000
CVTVVMDI EQU   CVTS01+204                                               00957000
CVTAQTOP EQU   CVTS01+200                                               00958000
CVTIOSCS EQU   CVTS01+196                                               00959000
CVTSDRM  EQU   CVTS01+192                                               00960000
CVTOPTE  EQU   CVTS01+188                                               00961000
CVTSTXU  EQU   CVTS01+184                                               00962000
CVTQUIS  EQU   CVTS01+180                                               00963000
CVTPARS  EQU   CVTS01+176                                               00964000
CVTS1EE  EQU   CVTS01+172                                               00965000
CVTFRAS  EQU   CVTS01+168                                               00966000
CVTQSAS  EQU   CVTS01+164                                               00967000
CVTCRAS  EQU   CVTS01+160                                               00968000
CVTCRMN  EQU   CVTS01+156                                               00969000
CVTDELCP EQU   CVTS01+152                                               00970000
CVTFRECL EQU   CVTS01+148                                               00971000
CVTGETCL EQU   CVTS01+144                                               00972000
CVTBLDCP EQU   CVTS01+140                                               00973000
CVTAUTHL EQU   CVTS01+136                                               00974000
CVTSCAN  EQU   CVTS01+132                                               00975000
CVTRV144 EQU   CVTS01+130                                               00976000
CVTMAXMP EQU   CVTS01+128                                               00977000
CVTSTCK  EQU   CVTS01+124                                               00978000
CVTRV139 EQU   CVTS01+123                                               00979000
CVTDSSAC EQU   CVTS01+122                                               00980000
CVTRV513 EQU   CVTS01+121                                               00981000
CVTIOSPL EQU   CVTS01+120                                               00982000
CVTPTGT  EQU   CVTS01+116                                               00983000
CVTCSPIE EQU   CVTS01+112                                               00984000
CVTSMFEX EQU   CVTS01+108                                               00985000
CVTOLT0A EQU   CVTS01+104                                               00986000
CVTSRBRT EQU   CVTS01+100                                               00987000
CVTPUTL  EQU   CVTS01+96                                                00988000
CVTASCRL EQU   CVTS01+92                                                00989000
CVTASCRF EQU   CVTS01+88                                                00990000
CVTRV326 EQU   CVTS01+84                                                00991000
CVTRV325 EQU   CVTS01+80                                                00992000
CVTRV324 EQU   CVTS01+76                                                00993000
CVT0VL01 EQU   CVTS01+72                                                00994000
CVTSHRVM EQU   CVTS01+68                                                00995000
CVTRV332 EQU   CVTS01+64                                                00996000
CVTTAS   EQU   CVTS01+60                                                00997000
CVTRSCN  EQU   CVTS01+56                                                00998000
CVTTRAC2 EQU   CVTS01+54                                                00999000
CVTTRACE EQU   CVTS01+52                                                01000000
CVTAPG   EQU   CVTS01+51                                                01001000
CVTSDTRC EQU   CVTCTLFG                                                 01002000
CVTGTRCE EQU   CVTCTLFG                                                 01003000
CVTNOMP  EQU   CVTCTLFG                                                 01004000
CVTRSV79 EQU   CVTCTLFG                                                 01005000
CVTDSTAT EQU   CVTCTLFG                                                 01006000
CVTRSV78 EQU   CVTCTLFG                                                 01007000
CVTRV333 EQU   CVTCTLFG                                                 01008000
CVTRV323 EQU   CVTCTLFG                                                 01009000
CVTSPVLK EQU   CVTS01+49                                                01010000
CVTRSV77 EQU   CVTS01+48                                                01011000
CVTRV331 EQU   CVTS01+44                                                01012000
CVTRV330 EQU   CVTS01+40                                                01013000
CVTRV329 EQU   CVTS01+36                                                01014000
CVTRV328 EQU   CVTS01+32                                                01015000
CVTRV322 EQU   CVTS01+28                                                01016000
CVTSLID  EQU   CVTSLIDA+1                                               01017000
CVTSYLK  EQU   CVTSLIDA                                                 01018000
CVTRV321 EQU   CVTS01+20                                                01019000
CVTRV320 EQU   CVTS01+16                                                01020000
CVTLPDIR EQU   CVTLPDIA+1                                               01021000
CVTRSV69 EQU   CVTDIRST                                                 01022000
CVTRSV68 EQU   CVTDIRST                                                 01023000
CVTRSV67 EQU   CVTDIRST                                                 01024000
CVTRSV66 EQU   CVTDIRST                                                 01025000
CVTRSV65 EQU   CVTDIRST                                                 01026000
CVTRSV64 EQU   CVTDIRST                                                 01027000
CVTRSV63 EQU   CVTDIRST                                                 01028000
CVTDICOM EQU   CVTDIRST                                                 01029000
CVTPVTP  EQU   CVTS01+8                                                 01030000
CVTLPDSR EQU   CVTS01+4                                                 01031000
CVTGETL  EQU   CVTS01                                                   01032000
PSARSAV  EQU   PSARSVTE+60                                              01033000
PSARSTK  EQU   PSARSVTE+56                                              01034000
PSAESAV3 EQU   PSARSVTE+52                                              01035000
PSAESTK3 EQU   PSARSVTE+48                                              01036000
PSAESAV2 EQU   PSARSVTE+44                                              01037000
PSAESTK2 EQU   PSARSVTE+40                                              01038000
PSAESAV1 EQU   PSARSVTE+36                                              01039000
PSAESTK1 EQU   PSARSVTE+32                                              01040000
PSAPSAV  EQU   PSARSVTE+28                                              01041000
PSAPSTK  EQU   PSARSVTE+24                                              01042000
PSAMSAV  EQU   PSARSVTE+20                                              01043000
PSAMSTK  EQU   PSARSVTE+16                                              01044000
PSASSAV  EQU   PSARSVTE+12                                              01045000
PSASSTK  EQU   PSARSVTE+8                                               01046000
PSANSTK  EQU   PSARSVTE+4                                               01047000
PSACSTK  EQU   PSARSVTE                                                 01048000
WSDUMBUF EQU   WORKSPAC+8                                               01049000
@NM00070 EQU   WSFLG1                                                   01050000
WSYNCH   EQU   WSFLG1                                                   01051000
WSCLSPAS EQU   WSFLG1                                                   01052000
WSOPNDST EQU   WSFLG1                                                   01053000
WSALLOCD EQU   WSFLG1                                                   01054000
@NM00069 EQU   MSGLIST+37                                               01055000
@NM00068 EQU   MSGLIST+22                                               01056000
@NM00067 EQU   MSGLIST+4                                                01057000
MACFLAG  EQU   MSGLIST+2                                                01058000
TEXTLEN  EQU   MSGLIST                                                  01059000
MSGLEN   EQU   MSGENTRY                                                 01060000
NIBRESV  EQU   ISTNIB+60                                                01061000
NIBNDAR  EQU   ISTNIB+56                                                01062000
NIBLMODE EQU   ISTNIB+48                                                01063000
NIBEXLST EQU   ISTNIB+44                                                01064000
NIBLIMIT EQU   ISTNIB+42                                                01065000
@NM00066 EQU   ISTNIB+41                                                01066000
@NM00065 EQU   NIBFLG1                                                  01067000
NIBTREQ  EQU   NIBFLG1                                                  01068000
NIBTSEL  EQU   NIBFLG1                                                  01069000
NIBNACLQ EQU   NIBFLG1                                                  01070000
NIBSHLTP EQU   NIBFLG1                                                  01071000
NIBSDAPP EQU   NIBFLG1                                                  01072000
NIBLAST  EQU   NIBFLG1                                                  01073000
NIBPROCD EQU   ISTNIB+36                                                01074000
NIBDEVCH EQU   ISTNIB+28                                                01075000
NIBMODE  EQU   ISTNIB+20                                                01076000
NIBUSER  EQU   ISTNIB+8                                                 01077000
NIBCID   EQU   ISTNIB+4                                                 01078000
NIBLEN   EQU   ISTNIB+3                                                 01079000
NIBCONDN EQU   ISTNIB+2                                                 01080000
NIBRSV01 EQU   ISTNIB+1                                                 01081000
NIBID    EQU   ISTNIB                                                   01082000
DEVRSV01 EQU   ISTDEVCH+7                                               01083000
DEVAUXTP EQU   ISTDEVCH+6                                               01084000
DEVADVFE EQU   DEVMODE                                                  01085000
@NM00064 EQU   DEVMODE                                                  01086000
DEVBASIC EQU   DEVMODE                                                  01087000
DEVREC   EQU   DEVMODE                                                  01088000
DEVPHYSA EQU   ISTDEVCH+4                                               01089000
DEVCSLPN EQU   DEVCHAR3                                                 01090000
DEVCSTCL EQU   DEVCHAR3                                                 01091000
DEVCCHEK EQU   DEVCHAR3                                                 01092000
DEVCATTN EQU   DEVCHAR3                                                 01093000
DEVCSWL  EQU   DEVFCCTL                                                 01094000
DEVCRVB  EQU   DEVFCCTL                                                 01095000
DEVCSSL  EQU   DEVFCCTL                                                 01096000
DEVCBSC  EQU   DEVFCCTL                                                 01097000
DEVMCODE EQU   ISTDEVCH+2                                               01098000
DEVCHAR2 EQU   DEVTCODE                                                 01099000
DEVSPOLL EQU   DEVCHAR                                                  01100000
DEVCCTL  EQU   DEVCHAR                                                  01101000
DEVNNSPT EQU   DEVCHAR                                                  01102000
DEVSPS   EQU   DEVCHAR                                                  01103000
DEVSUBND EQU   DEVCHAR                                                  01104000
DEVCONVR EQU   DEVCHAR                                                  01105000
DEVOTPUT EQU   DEVCHAR                                                  01106000
DEVINPUT EQU   DEVCHAR                                                  01107000
PROSRDEF EQU   PROSETM4                                                 01108000
PRORSV47 EQU   PROSETM4                                                 01109000
PROSCON  EQU   PROSETM4                                                 01110000
PRORSV46 EQU   PROSETM3                                                 01111000
PROSMONT EQU   PROSETM3                                                 01112000
PRORSV45 EQU   PROSETM3                                                 01113000
PROSNTO  EQU   PROSETM3                                                 01114000
PRORSV44 EQU   PROSETM3                                                 01115000
PRORSV43 EQU   PROSETM2                                                 01116000
PROSNTFL EQU   PROSETM2                                                 01117000
PRORSV42 EQU   PROSETM2                                                 01118000
PRORSV41 EQU   PROPROCS                                                 01119000
PROMODC  EQU   PROPROC4                                                 01120000
PROMODT  EQU   PROPROC4                                                 01121000
PROMODM  EQU   PROPROC4                                                 01122000
PROMODB  EQU   PROPROC4                                                 01123000
PRORSV14 EQU   PROPROC4                                                 01124000
PRORSV13 EQU   PROPROC4                                                 01125000
PRORSV01 EQU   PROPROC4                                                 01126000
PROEIB   EQU   PROPROC4                                                 01127000
PROMONT3 EQU   PROPROC3                                                 01128000
PROMONT2 EQU   PROPROC3                                                 01129000
PROMONIT EQU   PROPROC3                                                 01130000
PROSUBLK EQU   PROPROC3                                                 01131000
PRONTO   EQU   PROPROC3                                                 01132000
PROLGIN  EQU   PROPROC3                                                 01133000
PROERPI  EQU   PROPROC3                                                 01134000
PROCPUID EQU   PROPROC3                                                 01135000
PROCFTX  EQU   PROPROC2                                                 01136000
PROEMLC  EQU   PROPROC2                                                 01137000
PRONTFL  EQU   PROPROC2                                                 01138000
PROFIFOR EQU   PROPROC2                                                 01139000
PROSYSR  EQU   PROPROC2                                                 01140000
PROLGOT  EQU   PROPROC2                                                 01141000
PROERPO  EQU   PROPROC2                                                 01142000
PRONEGBD EQU   PROPROC2                                                 01143000
PRORPLC  EQU   PROPROC1                                                 01144000
PROCS    EQU   PROPROC1                                                 01145000
PROCA    EQU   PROPROC1                                                 01146000
PRORESPX EQU   PROPROC1                                                 01147000
PRODFASY EQU   PROPROC1                                                 01148000
PROXPOPT EQU   PROPROC1                                                 01149000
PROTRUNC EQU   PROPROC1                                                 01150000
PROASYIP EQU   PROPROC1                                                 01151000
RPLSEQNO EQU   RPLOF60+6                                                01152000
@NM00063 EQU   RPLIBSQ                                                  01153000
RPLIINV  EQU   RPLIBSQ                                                  01154000
RPLINEG  EQU   RPLIBSQ                                                  01155000
RPLIPOS  EQU   RPLIBSQ                                                  01156000
RPLIIGN  EQU   RPLIBSQ                                                  01157000
RPLIRSET EQU   RPLIBSQ                                                  01158000
RPLITST  EQU   RPLIBSQ                                                  01159000
RPLISET  EQU   RPLIBSQ                                                  01160000
@NM00062 EQU   RPLOBSQ                                                  01161000
RPLOINV  EQU   RPLOBSQ                                                  01162000
RPLONEG  EQU   RPLOBSQ                                                  01163000
RPLOPOS  EQU   RPLOBSQ                                                  01164000
RPLOIGN  EQU   RPLOBSQ                                                  01165000
RPLORSET EQU   RPLOBSQ                                                  01166000
RPLOTST  EQU   RPLOBSQ                                                  01167000
RPLOSET  EQU   RPLOBSQ                                                  01168000
RPLIBSQV EQU   RPLOF60+2                                                01169000
RPLOBSQV EQU   RPLOF60                                                  01170000
@NM00061 EQU   RPLO5                                                    01171000
RPLTNFY  EQU   RPLO5                                                    01172000
@NM00060 EQU   RPLO5                                                    01173000
@NM00059 EQU   RPLCNTSC                                                 01174000
RPLRSHUT EQU   RPLCNTSC                                                 01175000
RPLRQR   EQU   RPLCNTSC                                                 01176000
RPLSHUTC EQU   RPLCNTSC                                                 01177000
RPLSHUTD EQU   RPLCNTSC                                                 01178000
RPLSTSN  EQU   RPLCNTSC                                                 01179000
RPLCLEAR EQU   RPLCNTSC                                                 01180000
RPLSDT   EQU   RPLCNTSC                                                 01181000
RPLBIS   EQU   RPLCNTDC                                                 01182000
RPLSBI   EQU   RPLCNTDC                                                 01183000
RPLTUNBD EQU   RPLCNTDC                                                 01184000
RPLTBIND EQU   RPLCNTDC                                                 01185000
RPLSIGNL EQU   RPLCNTDC                                                 01186000
RPLLUS   EQU   RPLCNTDC                                                 01187000
RPLRTR   EQU   RPLCNTDC                                                 01188000
RPLBID   EQU   RPLCNTDC                                                 01189000
@NM00058 EQU   RPLCNTDF                                                 01190000
RPLQI    EQU   RPLCNTDF                                                 01191000
RPLRELQ  EQU   RPLCNTDF                                                 01192000
RPLCHASE EQU   RPLCNTDF                                                 01193000
RPLQEC   EQU   RPLCNTDF                                                 01194000
RPLQC    EQU   RPLCNTDF                                                 01195000
RPLCNCEL EQU   RPLCNTDF                                                 01196000
RPLDATA  EQU   RPLCNTDF                                                 01197000
RPLRRN   EQU   RPLRESP                                                  01198000
RPLNFME  EQU   RPLRESP                                                  01199000
RPLEX    EQU   RPLRESP                                                  01200000
RPLQRI   EQU   RPLRESP                                                  01201000
@NM00057 EQU   RPLPOSTV                                                 01202000
RPLSCHED EQU   RPLPOSTV                                                 01203000
@NM00056 EQU   RPLVTFL1                                                 01204000
RPLTLGAC EQU   RPLVTFL1                                                 01205000
RPLTNDSP EQU   RPLVTFL1                                                 01206000
RPLAUTUS EQU   RPLVTFL1                                                 01207000
RPLVTUSE EQU   RPLVTFL1                                                 01208000
@NM00055 EQU   RPLVTFL1                                                 01209000
@NM00054 EQU   RPLCHN                                                   01210000
RPLONLY  EQU   RPLCHN                                                   01211000
RPLLAST  EQU   RPLCHN                                                   01212000
RPLMIDLE EQU   RPLCHN                                                   01213000
RPLFIRST EQU   RPLCHN                                                   01214000
@NM00053 EQU   RPLRTYPE                                                 01215000
RPLDFASY EQU   RPLRTYPE                                                 01216000
RPLNFSYN EQU   RPLRTYPE                                                 01217000
RPLRRESP EQU   RPLRTYPE                                                 01218000
@NM00052 EQU   RPLSTYPE                                                 01219000
RPLSRESP EQU   RPLSTYPE                                                 01220000
@NM00051 EQU   RPLRH3                                                   01221000
RPLCSI   EQU   RPLRH3                                                   01222000
RPLCHREQ EQU   RPLRH3                                                   01223000
RPLCMD   EQU   RPLRH3                                                   01224000
RPLEB    EQU   RPLRH3                                                   01225000
RPLBB    EQU   RPLRH3                                                   01226000
RPLSIGDA EQU   RPLVTEXT+32                                              01227000
RPLSAV13 EQU   RPLVTEXT+28                                              01228000
RPLUSNSO EQU   RPLOSENS+2                                               01229000
RPLSSMO  EQU   RPLSSNSO+1                                               01230000
@NM00050 EQU   RPLSSEO                                                  01231000
RPLRRO   EQU   RPLSSEO                                                  01232000
RPLFIO   EQU   RPLSSEO                                                  01233000
RPLSTATO EQU   RPLSSEO                                                  01234000
RPLCPMO  EQU   RPLSSEO                                                  01235000
@NM00049 EQU   RPLSSEO                                                  01236000
RPLFMHDR EQU   RPLOPT12                                                 01237000
@NM00048 EQU   RPLOPT12                                                 01238000
@NM00047 EQU   RPLOPT12                                                 01239000
@NM00046 EQU   RPLOPT12                                                 01240000
RPLNIBTK EQU   RPLOPT12                                                 01241000
RPLTRUNC EQU   RPLOPT12                                                 01242000
RPLKEEP  EQU   RPLOPT12                                                 01243000
@NM00045 EQU   RPLOPT12                                                 01244000
RPLRSVE8 EQU   RPLOPT11                                                 01245000
RPLRSVE7 EQU   RPLOPT11                                                 01246000
RPLRSVE6 EQU   RPLOPT11                                                 01247000
RPLRSVE5 EQU   RPLOPT11                                                 01248000
RPLRSVE4 EQU   RPLOPT11                                                 01249000
RPLSTOP  EQU   RPLOPT11                                                 01250000
RPLSTART EQU   RPLOPT11                                                 01251000
RPLQUIES EQU   RPLOPT11                                                 01252000
RPLRSVI6 EQU   RPLOPT10                                                 01253000
RPLRSVI5 EQU   RPLOPT10                                                 01254000
RPLRSVI4 EQU   RPLOPT10                                                 01255000
RPLRSVI3 EQU   RPLOPT10                                                 01256000
RPLTSKY  EQU   RPLOPT10                                                 01257000
RPLSPARM EQU   RPLOPT10                                                 01258000
RPLDSPLY EQU   RPLOPT10                                                 01259000
RPLBSCID EQU   RPLOPT10                                                 01260000
RPLTOPL  EQU   RPLOPT9                                                  01261000
RPLCIDE  EQU   RPLOPT9                                                  01262000
RPLRNNM  EQU   RPLOPT9                                                  01263000
RPLAPPST EQU   RPLOPT9                                                  01264000
RPLCOUNT EQU   RPLOPT9                                                  01265000
RPLTERMS EQU   RPLOPT9                                                  01266000
RPLDEVCH EQU   RPLOPT9                                                  01267000
RPLLOGON EQU   RPLOPT9                                                  01268000
RPLUSFLD EQU   RPLVTEXT+16                                              01269000
RPLESR2  EQU   RPLUSNSI+1                                               01270000
RPLESR1  EQU   RPLUSNSI                                                 01271000
RPLSSMI  EQU   RPLDSB2                                                  01272000
@NM00044 EQU   RPLSSEI                                                  01273000
RPLRRI   EQU   RPLSSEI                                                  01274000
RPLFII   EQU   RPLSSEI                                                  01275000
RPLSTATI EQU   RPLSSEI                                                  01276000
RPLCPMI  EQU   RPLSSEI                                                  01277000
RPLPATHI EQU   RPLSSEI                                                  01278000
RPLARCLN EQU   RPLVTEXT+8                                               01279000
RPLAARLN EQU   RPLVTEXT+4                                               01280000
RPLAAREA EQU   RPLVTEXT                                                 01281000
RPLERMSA EQU   RPLCOMN+72                                               01282000
RPLEMLEN EQU   RPLCOMN+70                                               01283000
RPLACTIV EQU   RPLCOMN+69                                               01284000
RPLBRANC EQU   RPLEXTD1                                                 01285000
RPLNIB   EQU   RPLEXTD1                                                 01286000
RPLTCRYP EQU   RPLEXTD1                                                 01287000
@NM00043 EQU   RPLEXTD1                                                 01288000
RPLEXIT  EQU   RPLEXTD1                                                 01289000
RPLNEXIT EQU   RPLEXTD1                                                 01290000
RPLEXSCH EQU   RPLEXTD1                                                 01291000
RPLDDDD  EQU   RPLRBAR+4                                                01292000
@NM00042 EQU   RPLRBAR+3                                                01293000
@NM00041 EQU   RPLAIXID                                                 01294000
RPLAXPKP EQU   RPLAIXID                                                 01295000
RPLAIXPC EQU   RPLRBAR                                                  01296000
RPLRSV88 EQU   RPLOPT8                                                  01297000
RPLUNCON EQU   RPLOPT8                                                  01298000
RPLACTV  EQU   RPLOPT8                                                  01299000
RPLSESS  EQU   RPLOPT8                                                  01300000
RPLPEND  EQU   RPLOPT8                                                  01301000
RPLODPRM EQU   RPLOPT8                                                  01302000
RPLODACP EQU   RPLOPT8                                                  01303000
RPLODACQ EQU   RPLOPT8                                                  01304000
RPLRSV78 EQU   RPLOPT7                                                  01305000
RPLTCRNO EQU   RPLOPT7                                                  01306000
RPLRLSOP EQU   RPLOPT7                                                  01307000
RPLTPOST EQU   RPLOPT7                                                  01308000
RPLQOPT  EQU   RPLOPT7                                                  01309000
RPLCNIMM EQU   RPLCNOPT                                                 01310000
RPLCNANY EQU   RPLCNOPT                                                 01311000
RPLCNALL EQU   RPLCNOPT                                                 01312000
RPLRSV68 EQU   RPLOPT6                                                  01313000
RPLRSV67 EQU   RPLOPT6                                                  01314000
RPLLOCK  EQU   RPLOPT6                                                  01315000
RPLNCOND EQU   RPLOPT6                                                  01316000
RPLCOND  EQU   RPLOPT6                                                  01317000
RPLEOT   EQU   RPLUNTYP                                                 01318000
RPLEOM   EQU   RPLUNTYP                                                 01319000
RPLEOB   EQU   RPLUNTYP                                                 01320000
RPLWROPT EQU   RPLOPT5                                                  01321000
RPLNODE  EQU   RPLOPT5                                                  01322000
RPLERACE EQU   RPLWRTYP                                                 01323000
RPLEAU   EQU   RPLWRTYP                                                 01324000
RPLNERAS EQU   RPLWRTYP                                                 01325000
RPLPSOPT EQU   RPLOPT5                                                  01326000
@NM00040 EQU   RPLOPT5                                                  01327000
RPLDLGIN EQU   RPLOPT5                                                  01328000
RPLBUFL  EQU   RPLCOMN+52                                               01329000
RPLRLEN  EQU   RPLCOMN+48                                               01330000
RPLCHAIN EQU   RPLNXTRP                                                 01331000
@NM00039 EQU   RPLOPT4                                                  01332000
RPLMKFRM EQU   RPLOPT4                                                  01333000
RPLENDTR EQU   RPLOPT4                                                  01334000
RPLALIGN EQU   RPLOPT3                                                  01335000
RPLFMT   EQU   RPLOPT3                                                  01336000
RPLFLD   EQU   RPLOPT3                                                  01337000
RPLVFY   EQU   RPLOPT3                                                  01338000
RPLBLK   EQU   RPLOPT3                                                  01339000
RPLSFORM EQU   RPLOPT3                                                  01340000
RPLEODS  EQU   RPLOPT3                                                  01341000
RPLNSP   EQU   RPLOPT2                                                  01342000
RPLUPD   EQU   RPLOPT2                                                  01343000
RPLWAITX EQU   RPLOPT2                                                  01344000
RPLLRD   EQU   RPLOPT2                                                  01345000
RPLBWD   EQU   RPLOPT2                                                  01346000
RPLCNV   EQU   RPLOPT2                                                  01347000
RPLADD   EQU   RPLADR                                                   01348000
RPLKEY   EQU   RPLOPT2                                                  01349000
RPLECBIN EQU   RPLECBSW                                                 01350000
RPLGEN   EQU   RPLOPT1                                                  01351000
RPLKGE   EQU   RPLOPT1                                                  01352000
RPLASY   EQU   RPLOPT1                                                  01353000
RPLSKP   EQU   RPLOPT1                                                  01354000
RPLSEQ   EQU   RPLOPT1                                                  01355000
RPLDIR   EQU   RPLOPT1                                                  01356000
RPLLOC   EQU   RPLOPT1                                                  01357000
RPLDAF   EQU   RPLARG+2                                                 01358000
RPLSAF   EQU   RPLARG                                                   01359000
RPLTCBPT EQU   RPLCOMN+28                                               01360000
RPLDACB  EQU   RPLCOMN+24                                               01361000
RPLCCHAR EQU   RPLCOMN+20                                               01362000
RPLSTRID EQU   RPLCOMN+18                                               01363000
RPLKEYL  EQU   RPLKEYLE                                                 01364000
RPLRDSOH EQU   RPLFDB3                                                  01365000
RPLRLG   EQU   RPLFDB3                                                  01366000
RPLLGFRC EQU   RPLFDB3                                                  01367000
RPLREOT  EQU   RPLFDB3                                                  01368000
RPLREOM  EQU   RPLFDB3                                                  01369000
RPLREOB  EQU   RPLFDB3                                                  01370000
RPLSV32  EQU   RPLFDB3                                                  01371000
RPLUINPT EQU   RPLFDB3                                                  01372000
RPLSTSAV EQU   RPLFDB2                                                  01373000
RPLCUERR EQU   RPLFDB2                                                  01374000
RPLDLGFL EQU   RPLFDB2                                                  01375000
RPLIOERR EQU   RPLFDB2                                                  01376000
RPLDVUNS EQU   RPLFDB2                                                  01377000
RPLATND  EQU   RPLFDB2                                                  01378000
RPLRVID  EQU   RPLFDB2                                                  01379000
RPLERLK  EQU   RPLFDB2                                                  01380000
RPLERREG EQU   RPLRTNCD                                                 01381000
RPLSTAT  EQU   RPLFDBWD                                                 01382000
RPLPOST  EQU   RPLECB                                                   01383000
RPLWAIT  EQU   RPLECB                                                   01384000
RPLPLHPT EQU   RPLCOMN+4                                                01385000
RPLLEN2  EQU   RPLLEN                                                   01386000
RPLREQ   EQU   RPLIDWD+2                                                01387000
RPLSTYP  EQU   RPLIDWD+1                                                01388000
RPLID    EQU   RPLIDWD                                                  01389000
WELMODE  EQU   WESTD+76                                                 01390000
WEALTC   EQU   WESTD+75                                                 01391000
WEALTR   EQU   WESTD+74                                                 01392000
WEPRMC   EQU   WESTD+73                                                 01393000
WEPRMR   EQU   WESTD+72                                                 01394000
WEBIND   EQU   WESTD+36                                                 01395000
@NM00038 EQU   WESTD+35                                                 01396000
WERUSZO  EQU   WESTD+34                                                 01397000
WERUSZI  EQU   WESTD+33                                                 01398000
@NM00037 EQU   WETMFLG                                                  01399000
WENOSW   EQU   WETMFLG                                                  01400000
WEFLG1   EQU   WETMFLG                                                  01401000
WETMBF   EQU   WETERM+2                                                 01402000
WESUBT   EQU   WETERM+1                                                 01403000
WETMTP   EQU   WETERM                                                   01404000
WELBUF   EQU   WESTD+24                                                 01405000
WEVRPL   EQU   WESTD+20                                                 01406000
WEUECB   EQU   WEVNIB                                                   01407000
WEUASCB  EQU   WESTD+12                                                 01408000
WELEN    EQU   WESTD+10                                                 01409000
WERC2    EQU   WERC+1                                                   01410000
WERC1    EQU   WERC                                                     01411000
WECD2MIF EQU   WECODE2F                                                 01412000
WECD2MAF EQU   WECODE2F                                                 01413000
WECODE2T EQU   WECODE2                                                  01414000
WECDMIF  EQU   WECODE1F                                                 01415000
WECDMAF  EQU   WECODE1F                                                 01416000
TWAEND   EQU   TWAR+536                                                 01417000
TWAWORKE EQU   TWAR+524                                                 01418000
@NM00036 EQU   TWACI+13                                                 01419000
TWACSKIP EQU   TWACI+12                                                 01420000
TWACMODQ EQU   TWACI+8                                                  01421000
TWACSTPQ EQU   TWACI+4                                                  01422000
TWACECB  EQU   TWACI                                                    01423000
TWACERRS EQU   TWACE+4                                                  01424000
TWACERA  EQU   TWACEI+1                                                 01425000
TWACEIFC EQU   TWACEI                                                   01426000
TWACRTFC EQU   TWAC+60                                                  01427000
TWACABFC EQU   TWAC+56                                                  01428000
TWACTWA  EQU   TWAC+52                                                  01429000
TWACEWA  EQU   TWAC+4                                                   01430000
TWACID   EQU   TWAC                                                     01431000
TWAUERRS EQU   TWAUE+4                                                  01432000
TWAUERA  EQU   TWAUEI+1                                                 01433000
TWAUEIFC EQU   TWAUEI                                                   01434000
TWAURTFC EQU   TWAU+60                                                  01435000
TWAUABFC EQU   TWAU+56                                                  01436000
TWAUTWA  EQU   TWAU+52                                                  01437000
TWAUEWA  EQU   TWAU+4                                                   01438000
TWAUID   EQU   TWAU                                                     01439000
TWAVACQH EQU   TWAVI+12                                                 01440000
TWAVTHQH EQU   TWAVI+8                                                  01441000
TWAVTEQH EQU   TWAVI+4                                                  01442000
TWAVECB  EQU   TWAVI                                                    01443000
TWAVERRS EQU   TWAVE+4                                                  01444000
TWAVERA  EQU   TWAVEI+1                                                 01445000
TWAVEIFC EQU   TWAVEI                                                   01446000
TWAVRTFC EQU   TWAV+60                                                  01447000
TWAVABFC EQU   TWAV+56                                                  01448000
TWAVTWA  EQU   TWAV+52                                                  01449000
TWAVEWA  EQU   TWAV+4                                                   01450000
TWAVID   EQU   TWAV                                                     01451000
TWAMERRS EQU   TWAME+4                                                  01452000
TWAMERA  EQU   TWAMEI+1                                                 01453000
TWAMEIFC EQU   TWAMEI                                                   01454000
TWAMRTFC EQU   TWAM+60                                                  01455000
TWAMABFC EQU   TWAM+56                                                  01456000
TWAMTWA  EQU   TWAM+52                                                  01457000
TWAMEWA  EQU   TWAM+4                                                   01458000
TWAMID   EQU   TWAM                                                     01459000
@NM00035 EQU   TWACFL                                                   01460000
TWACFL4  EQU   TWACFL                                                   01461000
TWACFL2  EQU   TWACFL                                                   01462000
TWACFL1  EQU   TWACFL                                                   01463000
@NM00034 EQU   TWAUFL                                                   01464000
TWAUFL4  EQU   TWAUFL                                                   01465000
TWAUFL3  EQU   TWAUFL                                                   01466000
TWAUFL2  EQU   TWAUFL                                                   01467000
TWAUFL1  EQU   TWAUFL                                                   01468000
@NM00033 EQU   TWAVFL                                                   01469000
TWAVFL6  EQU   TWAVFL                                                   01470000
TWAVFL5  EQU   TWAVFL                                                   01471000
TWAVFL4  EQU   TWAVFL                                                   01472000
TWAVFL3  EQU   TWAVFL                                                   01473000
TWAVFL2  EQU   TWAVFL                                                   01474000
TWAVFL1  EQU   TWAVFL                                                   01475000
@NM00032 EQU   TWAMFL                                                   01476000
TWAMFL1  EQU   TWAMFL                                                   01477000
TWACCOMP EQU   TWAR+76                                                  01478000
TWAUCOMP EQU   TWAR+72                                                  01479000
TWAVCOMP EQU   TWAR+68                                                  01480000
TWAMECB  EQU   TWAR+64                                                  01481000
TWACTCB  EQU   TWAR+60                                                  01482000
TWAUTCB  EQU   TWAR+56                                                  01483000
TWAVTCB  EQU   TWAR+52                                                  01484000
TWADEQAS EQU   TWAR+44                                                  01485000
TWAEESR  EQU   TWAR+40                                                  01486000
TWAPPSR  EQU   TWAR+36                                                  01487000
TWATCSR  EQU   TWAR+32                                                  01488000
TWATTSR  EQU   TWAR+28                                                  01489000
TWAINIT  EQU   TWAR+24                                                  01490000
TWATCAST EQU   TWAR+20                                                  01491000
TWACSCB  EQU   TWAR+16                                                  01492000
TWAASCB  EQU   TWAR+12                                                  01493000
TWAPASQH EQU   TWAR+8                                                   01494000
TWASYNQH EQU   TWAR+4                                                   01495000
TWARSON  EQU   TWAR+2                                                   01496000
TWACOMP  EQU   TWAR                                                     01497000
TCASTEND EQU   TCAST+148                                                01498000
TCASTTYO EQU   TCAST+144                                                01499000
TCAS767O EQU   TCAST+140                                                01500000
TCAS767I EQU   TCAST+136                                                01501000
TCASDUMP EQU   TCAST+132                                                01502000
TCASSCHD EQU   TCAST+128                                                01503000
TCASTPND EQU   TCAST+124                                                01504000
TCASOMJR EQU   TCAST+120                                                01505000
@NM00031 EQU   TCAST+118                                                01506000
TCASBR14 EQU   TCAST+116                                                01507000
TCASATTN EQU   TCAST+112                                                01508000
TCASASCI EQU   TCAST+108                                                01509000
TCASTTQH EQU   TCAST+104                                                01510000
@NM00030 EQU   TCAST+102                                                01511000
@NM00029 EQU   TCAST+100                                                01512000
TCASTGTF EQU   TCAST+96                                                 01513000
TCASASCB EQU   TCAST+92                                                 01514000
TCASFLG4 EQU   TCAST+91                                                 01515000
TCASFLG3 EQU   TCAST+90                                                 01516000
TCASFLG2 EQU   TCAST+89                                                 01517000
TCASCONF EQU   TCASFLG1                                                 01518000
@NM00028 EQU   TCASFLG1                                                 01519000
TCASHAST EQU   TCASFLG1                                                 01520000
TCASNACT EQU   TCASFLG1                                                 01521000
TCASVSD  EQU   TCASFLG1                                                 01522000
TCASABND EQU   TCASFLG1                                                 01523000
TCASMDSW EQU   TCASFLG1                                                 01524000
TCASBKMD EQU   TCASFLG1                                                 01525000
TCASLTE  EQU   TCAST+84                                                 01526000
TCASEXIT EQU   TCAST+80                                                 01527000
TCASOQM  EQU   TCAST+76                                                 01528000
TCASIQM  EQU   TCAST+72                                                 01529000
TCASTSB  EQU   TCAST+68                                                 01530000
TCASTTL  EQU   TCAST+64                                                 01531000
TCASFRR  EQU   TCAST+56                                                 01532000
TCASMSGS EQU   TCAST+52                                                 01533000
TCASDATO EQU   TCAST+48                                                 01534000
TCASDATI EQU   TCAST+44                                                 01535000
TCASXECB EQU   TCAST+40                                                 01536000
TCASTID  EQU   TCAST+32                                                 01537000
@NM00027 EQU   TCAST+31                                                 01538000
TCASCHNL EQU   TCAST+30                                                 01539000
TCASCRSZ EQU   TCAST+28                                                 01540000
TCASLBUF EQU   TCAST+24                                                 01541000
TCASHBUF EQU   TCAST+20                                                 01542000
TCASCLSZ EQU   TCAST+18                                                 01543000
TCASRCON EQU   TCAST+16                                                 01544000
TCASACBP EQU   TCAST+8                                                  01545000
TCASUMAX EQU   TCASUSER+2                                               01546000
TCASUSEC EQU   TCASUSER                                                 01547000
TCASID   EQU   TCAST                                                    01548000
CVTLEVL  EQU   CVTRELNO+2                                               01549000
CVTNUMB  EQU   CVTRELNO                                                 01550000
CVTMDL   EQU   CVTFIX+250                                               01551000
@NM00026 EQU   CVTFIX+248                                               01552000
@NM00025 EQU   CVTFIX                                                   01553000
CVTRV482 EQU   CVTXTNT2+128                                             01554000
CVTRV481 EQU   CVTXTNT2+124                                             01555000
CVTRV480 EQU   CVTXTNT2+120                                             01556000
CVTRV479 EQU   CVTXTNT2+118                                             01557000
CVTRV478 EQU   CVTXTNT2+117                                             01558000
CVTRV477 EQU   CVTXTNT2+116                                             01559000
CVTRV476 EQU   CVTXTNT2+115                                             01560000
CVTRV475 EQU   CVTXTNT2+114                                             01561000
CVTRV474 EQU   CVTRV466                                                 01562000
CVTRV473 EQU   CVTRV466                                                 01563000
CVTRV472 EQU   CVTRV466                                                 01564000
CVTRV471 EQU   CVTRV466                                                 01565000
CVTRV470 EQU   CVTRV466                                                 01566000
CVTRV469 EQU   CVTRV466                                                 01567000
CVTRV468 EQU   CVTRV466                                                 01568000
CVTRV467 EQU   CVTRV466                                                 01569000
CVTRV465 EQU   CVTRV457                                                 01570000
CVTRV464 EQU   CVTRV457                                                 01571000
CVTRV463 EQU   CVTRV457                                                 01572000
CVTRV462 EQU   CVTRV457                                                 01573000
CVTRV461 EQU   CVTRV457                                                 01574000
CVTRV460 EQU   CVTRV457                                                 01575000
CVTRV459 EQU   CVTRV457                                                 01576000
CVTRV458 EQU   CVTRV457                                                 01577000
CVTRV456 EQU   CVTXTNT2+108                                             01578000
CVTRV455 EQU   CVTXTNT2+104                                             01579000
CVTRV454 EQU   CVTXTNT2+100                                             01580000
CVTRV453 EQU   CVTXTNT2+96                                              01581000
CVTRV452 EQU   CVTXTNT2+94                                              01582000
CVTRV451 EQU   CVTXTNT2+92                                              01583000
CVTRV450 EQU   CVTXTNT2+90                                              01584000
CVTRV449 EQU   CVTXTNT2+88                                              01585000
CVTRV448 EQU   CVTXTNT2+87                                              01586000
CVTRV447 EQU   CVTXTNT2+86                                              01587000
CVTRV446 EQU   CVTRV438                                                 01588000
CVTRV445 EQU   CVTRV438                                                 01589000
CVTRV444 EQU   CVTRV438                                                 01590000
CVTRV443 EQU   CVTRV438                                                 01591000
CVTRV442 EQU   CVTRV438                                                 01592000
CVTRV441 EQU   CVTRV438                                                 01593000
CVTRV440 EQU   CVTRV438                                                 01594000
CVTRV439 EQU   CVTRV438                                                 01595000
CVTRV437 EQU   CVTRV429                                                 01596000
CVTRV436 EQU   CVTRV429                                                 01597000
CVTRV435 EQU   CVTRV429                                                 01598000
CVTRV434 EQU   CVTRV429                                                 01599000
CVTRV433 EQU   CVTRV429                                                 01600000
CVTRV432 EQU   CVTRV429                                                 01601000
CVTRV431 EQU   CVTRV429                                                 01602000
CVTRV430 EQU   CVTRV429                                                 01603000
CVTRV428 EQU   CVTXTNT2+80                                              01604000
CVTRV427 EQU   CVTXTNT2+76                                              01605000
CVTRV426 EQU   CVTXTNT2+72                                              01606000
CVTRV425 EQU   CVTXTNT2+68                                              01607000
CVTATACT EQU   CVTATCVT                                                 01608000
CVTRV423 EQU   CVTXTNT2+62                                              01609000
CVTRV422 EQU   CVTXTNT2+60                                              01610000
CVTRV421 EQU   CVTXTNT2+58                                              01611000
CVTRV420 EQU   CVTXTNT2+56                                              01612000
CVTRV419 EQU   CVTXTNT2+55                                              01613000
CVTRV418 EQU   CVTXTNT2+54                                              01614000
CVTRV417 EQU   CVTRV409                                                 01615000
CVTRV416 EQU   CVTRV409                                                 01616000
CVTRV415 EQU   CVTRV409                                                 01617000
CVTRV414 EQU   CVTRV409                                                 01618000
CVTRV413 EQU   CVTRV409                                                 01619000
CVTRV412 EQU   CVTRV409                                                 01620000
CVTRV411 EQU   CVTRV409                                                 01621000
CVTRV410 EQU   CVTRV409                                                 01622000
CVTRV408 EQU   CVTRV400                                                 01623000
CVTRV407 EQU   CVTRV400                                                 01624000
CVTRV406 EQU   CVTRV400                                                 01625000
CVTRV405 EQU   CVTRV400                                                 01626000
CVTRV404 EQU   CVTRV400                                                 01627000
CVTRV403 EQU   CVTRV400                                                 01628000
CVTRV402 EQU   CVTRV400                                                 01629000
CVTRV401 EQU   CVTRV400                                                 01630000
CVTICB   EQU   CVTXTNT2+48                                              01631000
CVTSKTA  EQU   CVTXTNT2+44                                              01632000
CVTCCVT  EQU   CVTXTNT2+40                                              01633000
CVTRSV98 EQU   CVTXTNT2+36                                              01634000
CVTRSV97 EQU   CVTXTNT2+34                                              01635000
CVTRSV96 EQU   CVTXTNT2+32                                              01636000
CVTOLTEP EQU   CVTXTNT2+28                                              01637000
CVTQIDA  EQU   CVTQID+1                                                 01638000
CVTRSV95 EQU   CVTQID                                                   01639000
CVTRSV94 EQU   CVTXTNT2+20                                              01640000
CVTRSV93 EQU   CVTXTNT2+16                                              01641000
CVTRSV92 EQU   CVTXTNT2+12                                              01642000
CVTDEBVR EQU   CVTXTNT2+8                                               01643000
CVTRSV91 EQU   CVTXTNT2+6                                               01644000
CVTRSV9H EQU   CVTFLGBT                                                 01645000
CVTRSV9G EQU   CVTFLGBT                                                 01646000
CVTRSV9F EQU   CVTFLGBT                                                 01647000
CVTRSV9E EQU   CVTFLGBT                                                 01648000
CVTRSV9D EQU   CVTFLGBT                                                 01649000
CVTBAH   EQU   CVTFLGBT                                                 01650000
CVTVME   EQU   CVTFLGBT                                                 01651000
CVTNPE   EQU   CVTFLGBT                                                 01652000
CVTNUCLS EQU   CVTXTNT2+4                                               01653000
CVTDSSVA EQU   CVTDSSV+1                                                01654000
CVTRSV89 EQU   CVTDSSV                                                  01655000
CVTRSV88 EQU   CVTXTNT1+8                                               01656000
CVTRSV87 EQU   CVTXTNT1+4                                               01657000
CVTFACHN EQU   CVTXTNT1                                                 01658000
CVTRV488 EQU   CVTMAP+412                                               01659000
CVTRV487 EQU   CVTMAP+408                                               01660000
CVTRV486 EQU   CVTMAP+404                                               01661000
CVTRV485 EQU   CVTMAP+400                                               01662000
CVTACTAP EQU   CVTMAP+396                                               01663000
CVTAUTH  EQU   CVTMAP+392                                               01664000
CVTRV490 EQU   CVTMAP+388                                               01665000
CVTSU    EQU   CVTMAP+384                                               01666000
CVTVOLT1 EQU   CVTVOLM1+1                                               01667000
CVTVOLI1 EQU   CVTVOLF1                                                 01668000
CVTSTOA  EQU   CVTMAP+376                                               01669000
CVTRSV58 EQU   CVTMAP+374                                               01670000
CVTRSV57 EQU   CVTMAP+372                                               01671000
CVTDDCE  EQU   CVTMAP+368                                               01672000
CVTPNWFR EQU   CVTMAP+364                                               01673000
CVTSMF   EQU   CVTMAP+360                                               01674000
CVTSULK  EQU   CVTMAP+358                                               01675000
CVTSLKO  EQU   CVTSYSK                                                  01676000
CVTSLKP  EQU   CVTSYSK                                                  01677000
CVTSLKQ  EQU   CVTSYSK                                                  01678000
CVTSLKR  EQU   CVTSYSK                                                  01679000
CVTRSV56 EQU   CVTSYSK                                                  01680000
CVTRSV55 EQU   CVTSYSK                                                  01681000
CVTRSV54 EQU   CVTSYSK                                                  01682000
CVTRSV53 EQU   CVTSYSK                                                  01683000
CVTRSV52 EQU   CVTA1F1                                                  01684000
CVTRSV51 EQU   CVTA1F1                                                  01685000
CVTRSV50 EQU   CVTA1F1                                                  01686000
CVTRSV49 EQU   CVTA1F1                                                  01687000
CVTRSV48 EQU   CVTA1F1                                                  01688000
CVTRSV47 EQU   CVTA1F1                                                  01689000
CVTSRSW  EQU   CVTA1F1                                                  01690000
CVTPFSW  EQU   CVTA1F1                                                  01691000
CVTPCVT  EQU   CVTMAP+352                                               01692000
CVTRSV46 EQU   CVTMAP+344                                               01693000
CVTRSV45 EQU   CVTMAP+340                                               01694000
CVTRSV44 EQU   CVTMAP+338                                               01695000
CVTRSV43 EQU   CVTMAP+336                                               01696000
CVTHJESA EQU   CVTHJES+1                                                01697000
CVTRSV42 EQU   CVTHJES                                                  01698000
CVTEXT2A EQU   CVTEXT2+1                                                01699000
CVTRSV41 EQU   CVTEXT2                                                  01700000
CVTAPFA  EQU   CVTAPF+1                                                 01701000
CVTRSV40 EQU   CVTAPF                                                   01702000
CVTRV518 EQU   CVTINTLA                                                 01703000
CVTRV517 EQU   CVTERPV                                                  01704000
CVTEORM  EQU   CVTMAP+312                                               01705000
CVTMCHPR EQU   CVTMAP+308                                               01706000
CVTTZ    EQU   CVTMAP+304                                               01707000
CVTJEPS  EQU   CVTMAP+300                                               01708000
CVTJESCT EQU   CVTMAP+296                                               01709000
CVTMODE  EQU   CVTMAP+292                                               01710000
CVTPTRV  EQU   CVTMAP+288                                               01711000
CVTREAL  EQU   CVTMAP+284                                               01712000
CVTRSV39 EQU   CVTMAP+280                                               01713000
CVTRSV38 EQU   CVTMAP+276                                               01714000
CVTDMSRA EQU   CVTDMSR+1                                                01715000
CVTRV634 EQU   CVTDMSRF                                                 01716000
CVTRV633 EQU   CVTDMSRF                                                 01717000
CVTRV632 EQU   CVTDMSRF                                                 01718000
CVTRV631 EQU   CVTDMSRF                                                 01719000
CVTRV630 EQU   CVTDMSRF                                                 01720000
CVTRV629 EQU   CVTDMSRF                                                 01721000
CVTUDUMP EQU   CVTDMSRF                                                 01722000
CVTSDUMP EQU   CVTDMSRF                                                 01723000
CVTQMSGA EQU   CVTQMSG+1                                                01724000
CVTRSV36 EQU   CVTQMSG                                                  01725000
CVTAMFF  EQU   CVTMAP+264                                               01726000
CVTPURGA EQU   CVTPURG+1                                                01727000
CVTRSV35 EQU   CVTPURG                                                  01728000
CVTCBSP  EQU   CVTMAP+256                                               01729000
CVTATERA EQU   CVTATER+1                                                01730000
CVTSYST  EQU   CVTATER                                                  01731000
CVTVOLT2 EQU   CVTTAT                                                   01732000
CVTVOLI2 EQU   CVTVOLF2                                                 01733000
CVTAQAVB EQU   CVTAQAVT+1                                               01734000
CVTRSV34 EQU   CVTTCMFG                                                 01735000
CVTRSV33 EQU   CVTTCMFG                                                 01736000
CVTRSV32 EQU   CVTTCMFG                                                 01737000
CVTRSV31 EQU   CVTTCMFG                                                 01738000
CVTRSV30 EQU   CVTTCMFG                                                 01739000
CVTRSV29 EQU   CVTTCMFG                                                 01740000
CVTLDEV  EQU   CVTTCMFG                                                 01741000
CVTTCRDY EQU   CVTTCMFG                                                 01742000
CVTGTFA  EQU   CVTGTF+1                                                 01743000
CVTRSV27 EQU   CVTGTFST                                                 01744000
CVTRNIO  EQU   CVTGTFST                                                 01745000
CVTUSR   EQU   CVTGTFST                                                 01746000
CVTRV318 EQU   CVTFORM                                                  01747000
CVTRV317 EQU   CVTTMODE                                                 01748000
CVTRV316 EQU   CVTSTATE                                                 01749000
CVTRV315 EQU   CVTGTFS                                                  01750000
CVTGTFAV EQU   CVTGTFS                                                  01751000
CVT0SCR1 EQU   CVTMAP+232                                               01752000
CVTRV515 EQU   CVTMAP+228                                               01753000
CVTRMS   EQU   CVTMAP+224                                               01754000
CVTPATCH EQU   CVTMAP+220                                               01755000
CVTTSCE  EQU   CVTMAP+216                                               01756000
CVTLNKSC EQU   CVTMAP+214                                               01757000
CVTQABST EQU   CVTMAP+212                                               01758000
CVTMDLDS EQU   CVTMAP+208                                               01759000
CVTUSER  EQU   CVTMAP+204                                               01760000
CVTABEND EQU   CVTMAP+200                                               01761000
CVTSMCA  EQU   CVTMAP+196                                               01762000
CVTRSV18 EQU   CVTMAP+192                                               01763000
CVTQLPAQ EQU   CVTMAP+188                                               01764000
CVTQCDSR EQU   CVTMAP+184                                               01765000
CVTVS1B  EQU   CVTOPTB                                                  01766000
CVTVS1A  EQU   CVTOPTB                                                  01767000
CVTFP    EQU   CVTOPTB                                                  01768000
CVTAPTHR EQU   CVTOPTB                                                  01769000
CVTNLOG  EQU   CVTOPTB                                                  01770000
CVTTOD   EQU   CVTOPTB                                                  01771000
CVTCTIMS EQU   CVTOPTB                                                  01772000
CVTPROT  EQU   CVTOPTB                                                  01773000
CVTXPFP  EQU   CVTOPTA                                                  01774000
CVTASCII EQU   CVTOPTA                                                  01775000
CVTRSV13 EQU   CVTOPTA                                                  01776000
CVTRSV12 EQU   CVTOPTA                                                  01777000
CVTNIP   EQU   CVTOPTA                                                  01778000
CVTDDR   EQU   CVTOPTA                                                  01779000
CVTAPR   EQU   CVTOPTA                                                  01780000
CVTCCH   EQU   CVTOPTA                                                  01781000
CVTSNCTR EQU   CVTMAP+180                                               01782000
CVTQMWR  EQU   CVTMAP+176                                               01783000
CVTQOCR  EQU   CVTMAP+172                                               01784000
CVT1EF00 EQU   CVTMAP+168                                               01785000
CVTMZ00  EQU   CVTMAP+164                                               01786000
CVTHEAD  EQU   CVTMAP+160                                               01787000
CVTRSV11 EQU   CVTMAP+156                                               01788000
CVT0PT01 EQU   CVTMAP+152                                               01789000
CVTMSER  EQU   CVTMAP+148                                               01790000
CVTRV516 EQU   CVTIERLC                                                 01791000
CVTILCH  EQU   CVTMAP+140                                               01792000
CVT0DS   EQU   CVTMAP+136                                               01793000
CVTFBOSV EQU   CVTMAP+132                                               01794000
CVTNUCB  EQU   CVTMAP+128                                               01795000
CVTIXAVL EQU   CVTMAP+124                                               01796000
CVTIOQET EQU   CVTMAP+120                                               01797000
CVTDCBA  EQU   CVTMAP+117                                               01798000
CVTMVS2  EQU   CVTDCB                                                   01799000
CVT6DAT  EQU   CVTDCB                                                   01800000
CVT4MPS  EQU   CVTDCB                                                   01801000
CVTRSV09 EQU   CVTDCB                                                   01802000
CVT4MS1  EQU   CVTDCB                                                   01803000
CVT2SPS  EQU   CVTDCB                                                   01804000
CVT1SSS  EQU   CVTDCB                                                   01805000
CVTRSV08 EQU   CVTDCB                                                   01806000
CVTSTB   EQU   CVTMAP+112                                               01807000
CVTQTD00 EQU   CVTMAP+108                                               01808000
CVTQTE00 EQU   CVTMAP+104                                               01809000
CVTCUCB  EQU   CVTMAP+100                                               01810000
CVTSJQ   EQU   CVTMAP+96                                                01811000
CVTPBLDL EQU   CVTMAP+92                                                01812000
CVTTPC   EQU   CVTMAP+88                                                01813000
CVTSVDCB EQU   CVTMAP+84                                                01814000
CVTBRET  EQU   CVTMAP+82                                                01815000
CVTEXIT  EQU   CVTMAP+80                                                01816000
CVT0FN00 EQU   CVTMAP+76                                                01817000
CVTDARA  EQU   CVTDAR+1                                                 01818000
CVTRSV07 EQU   CVTFLGS1                                                 01819000
CVTRSV06 EQU   CVTFLGS1                                                 01820000
CVTRSV05 EQU   CVTFLGS1                                                 01821000
CVTRSV04 EQU   CVTFLGS1                                                 01822000
CVTRSV03 EQU   CVTFLGS1                                                 01823000
CVTRSV02 EQU   CVTFLGS1                                                 01824000
CVTRSV01 EQU   CVTFLGS1                                                 01825000
CVTDMPLK EQU   CVTFLGS1                                                 01826000
CVTXITP  EQU   CVTMAP+68                                                01827000
CVTZDTAB EQU   CVTMAP+64                                                01828000
CVTMSLT  EQU   CVTMAP+60                                                01829000
CVTDATE  EQU   CVTMAP+56                                                01830000
CVTBTERM EQU   CVTMAP+52                                                01831000
CVTSYSAD EQU   CVTMAP+48                                                01832000
CVTXTLER EQU   CVTMAP+44                                                01833000
CVTILK2  EQU   CVTMAP+40                                                01834000
CVTILK1  EQU   CVTMAP+36                                                01835000
CVTPRLTV EQU   CVTMAP+32                                                01836000
CVTPCNVT EQU   CVTMAP+28                                                01837000
CVT0VL00 EQU   CVTMAP+24                                                01838000
CVTXAPG  EQU   CVTMAP+20                                                01839000
CVTBUF   EQU   CVTMAP+16                                                01840000
CVTJOB   EQU   CVTMAP+12                                                01841000
CVTLINK  EQU   CVTMAP+8                                                 01842000
CVT0EF00 EQU   CVTMAP+4                                                 01843000
CVTTCBP  EQU   CVTMAP                                                   01844000
CVT      EQU   CVTMAP                                                   01845000
@NM00024 EQU   PSA+3668                                                 01846000
PSASTAK  EQU   PSA+3072                                                 01847000
@NM00023 EQU   PSA+1048                                                 01848000
PSAUSEND EQU   PSA+1048                                                 01849000
PSARV062 EQU   PSA+1044                                                 01850000
PSACDAL  EQU   PSA+1040                                                 01851000
PSAWTCOD EQU   PSA+1036                                                 01852000
PSAATCVT EQU   PSA+1032                                                 01853000
PSAPCPSW EQU   PSA+1024                                                 01854000
PSAPIR2  EQU   PSA+1020                                                 01855000
PSARV059 EQU   PSA+1018                                                 01856000
PSASVC13 EQU   PSA+1016                                                 01857000
PSALSFCC EQU   PSA+1012                                                 01858000
PSASFACC EQU   PSA+1008                                                 01859000
PSASTOP  EQU   PSA+992                                                  01860000
PSASTART EQU   PSA+976                                                  01861000
PSARSPSW EQU   PSA+968                                                  01862000
PSASRPSW EQU   PSA+960                                                  01863000
PSARV045 EQU   PSA+892                                                  01864000
PSARV044 EQU   PSA+888                                                  01865000
PSARV043 EQU   PSA+884                                                  01866000
PSARV042 EQU   PSA+880                                                  01867000
PSARV041 EQU   PSA+876                                                  01868000
PSARV040 EQU   PSA+872                                                  01869000
PSARV025 EQU   PSA+868                                                  01870000
PSADSSED EQU   PSA+868                                                  01871000
PSADSSPR EQU   PSA+864                                                  01872000
PSADSSFW EQU   PSA+860                                                  01873000
PSADSS14 EQU   PSA+856                                                  01874000
PSADSSPP EQU   PSA+848                                                  01875000
PSADSSRP EQU   PSA+840                                                  01876000
PSADSS05 EQU   PSADSSF4                                                 01877000
PSADSS10 EQU   PSADSSF4                                                 01878000
PSADSSVE EQU   PSADSSF4                                                 01879000
PSADSSDE EQU   PSADSSF4                                                 01880000
PSADSSC0 EQU   PSADSSF4                                                 01881000
PSADSSIE EQU   PSADSSF4                                                 01882000
PSADSS12 EQU   PSADSSF4                                                 01883000
PSADSSRC EQU   PSADSSF4                                                 01884000
PSARV057 EQU   PSADSSF3                                                 01885000
PSARV056 EQU   PSADSSF3                                                 01886000
PSARV055 EQU   PSADSSF3                                                 01887000
PSADSSMC EQU   PSADSSF3                                                 01888000
PSADSSRW EQU   PSADSSF3                                                 01889000
PSADSSNM EQU   PSADSSF3                                                 01890000
PSADSSES EQU   PSADSSF3                                                 01891000
PSADSSGP EQU   PSADSSF3                                                 01892000
PSADSSF2 EQU   PSADSSFL+1                                               01893000
PSADSSPI EQU   PSADSSF1                                                 01894000
PSADSSOI EQU   PSADSSF1                                                 01895000
PSADSSSP EQU   PSADSSF1                                                 01896000
PSADSSTP EQU   PSADSSF1                                                 01897000
PSADSSDW EQU   PSADSSF1                                                 01898000
PSADSSDD EQU   PSADSSF1                                                 01899000
PSADSSDM EQU   PSADSSF1                                                 01900000
PSADSSMV EQU   PSADSSF1                                                 01901000
PSADSSTS EQU   PSA+816                                                  01902000
PSADSSWK EQU   PSA+812                                                  01903000
PSADSSR3 EQU   PSA+808                                                  01904000
PSADSSR2 EQU   PSA+804                                                  01905000
PSADSSRS EQU   PSA+800                                                  01906000
PSASTOR  EQU   PSA+796                                                  01907000
PSACPUSA EQU   PSA+794                                                  01908000
PSAVSTAP EQU   PSA+792                                                  01909000
PSAWKVAP EQU   PSA+788                                                  01910000
PSAWKRAP EQU   PSA+784                                                  01911000
PSAMCHIC EQU   PSA+783                                                  01912000
PSARV061 EQU   PSA+782                                                  01913000
PSASYMSK EQU   PSA+781                                                  01914000
PSAMCHFL EQU   PSA+780                                                  01915000
PSACR0   EQU   PSA+776                                                  01916000
PSAPSWSV EQU   PSA+768                                                  01917000
PSALITA  EQU   PSA+764                                                  01918000
PSACLHS  EQU   PSAHLHI                                                  01919000
PSALKR15 EQU   PSALKSA+60                                               01920000
PSALKR14 EQU   PSALKSA+56                                               01921000
PSALKR13 EQU   PSALKSA+52                                               01922000
PSALKR12 EQU   PSALKSA+48                                               01923000
PSALKR11 EQU   PSALKSA+44                                               01924000
PSALKR10 EQU   PSALKSA+40                                               01925000
PSALKR9  EQU   PSALKSA+36                                               01926000
PSALKR8  EQU   PSALKSA+32                                               01927000
PSALKR7  EQU   PSALKSA+28                                               01928000
PSALKR6  EQU   PSALKSA+24                                               01929000
PSALKR5  EQU   PSALKSA+20                                               01930000
PSALKR4  EQU   PSALKSA+16                                               01931000
PSALKR3  EQU   PSALKSA+12                                               01932000
PSALKR2  EQU   PSALKSA+8                                                01933000
PSALKR1  EQU   PSALKSA+4                                                01934000
PSALKR0  EQU   PSALKSA                                                  01935000
PSARV023 EQU   PSACLHT+52                                               01936000
PSALOCAL EQU   PSACLHT+48                                               01937000
PSACMSL  EQU   PSACLHT+44                                               01938000
PSAOPTL  EQU   PSACLHT+40                                               01939000
PSATPACL EQU   PSACLHT+36                                               01940000
PSATPDNL EQU   PSACLHT+32                                               01941000
PSATPNCL EQU   PSACLHT+28                                               01942000
PSAIOSLL EQU   PSACLHT+24                                               01943000
PSAIOSUL EQU   PSACLHT+20                                               01944000
PSAIOSCL EQU   PSACLHT+16                                               01945000
PSAIOSSL EQU   PSACLHT+12                                               01946000
PSASALCL EQU   PSACLHT+8                                                01947000
PSAASML  EQU   PSACLHT+4                                                01948000
PSADISPL EQU   PSACLHT                                                  01949000
PSASRSA  EQU   PSA+636                                                  01950000
PSARV050 EQU   PSA+634                                                  01951000
PSADSSGO EQU   PSA+633                                                  01952000
PSARECUR EQU   PSA+632                                                  01953000
PSAHLHIS EQU   PSA+628                                                  01954000
PSAIPCSA EQU   PSA+624                                                  01955000
@NM00022 EQU   PSA+621                                                  01956000
PSAIPCDM EQU   PSA+620                                                  01957000
PSAIPCD  EQU   PSA+616                                                  01958000
@NM00021 EQU   PSA+613                                                  01959000
PSAIPCRM EQU   PSA+612                                                  01960000
PSAIPCR  EQU   PSA+608                                                  01961000
PSAMCHEX EQU   PSA+600                                                  01962000
PSAMPSW  EQU   PSA+592                                                  01963000
PSAEXPS2 EQU   PSA+584                                                  01964000
PSAEXPS1 EQU   PSA+576                                                  01965000
PSAPIREG EQU   PSA+572                                                  01966000
PSARSREG EQU   PSA+568                                                  01967000
PSAGPREG EQU   PSA+556                                                  01968000
PSARV022 EQU   PSASUP4                                                  01969000
PSARV021 EQU   PSASUP4                                                  01970000
PSARV020 EQU   PSASUP4                                                  01971000
PSARV019 EQU   PSASUP4                                                  01972000
PSARV018 EQU   PSASUP4                                                  01973000
PSARV017 EQU   PSASUP4                                                  01974000
PSARV016 EQU   PSASUP4                                                  01975000
PSARV015 EQU   PSASUP4                                                  01976000
PSARV014 EQU   PSASUP3                                                  01977000
PSARV013 EQU   PSASUP3                                                  01978000
PSARV012 EQU   PSASUP3                                                  01979000
PSARV011 EQU   PSASUP3                                                  01980000
PSASPR   EQU   PSASUP3                                                  01981000
PSAPSREG EQU   PSASUP3                                                  01982000
PSAPI2   EQU   PSASUP3                                                  01983000
PSAIOSUP EQU   PSASUP3                                                  01984000
PSALCR   EQU   PSASUP2                                                  01985000
PSARTM   EQU   PSASUP2                                                  01986000
PSAACR   EQU   PSASUP2                                                  01987000
PSAIPCE2 EQU   PSASUP2                                                  01988000
PSAIPCES EQU   PSASUP2                                                  01989000
PSAIPCEC EQU   PSASUP2                                                  01990000
PSAGTF   EQU   PSASUP2                                                  01991000
PSAIPCRI EQU   PSASUP2                                                  01992000
PSARV063 EQU   PSASUP1                                                  01993000
PSATCTL  EQU   PSASUP1                                                  01994000
PSADISP  EQU   PSASUP1                                                  01995000
PSALOCK  EQU   PSASUP1                                                  01996000
PSAPI    EQU   PSASUP1                                                  01997000
PSAEXT   EQU   PSASUP1                                                  01998000
PSASVC   EQU   PSASUP1                                                  01999000
PSAIO    EQU   PSASUP1                                                  02000000
PSAAOLD  EQU   PSA+548                                                  02001000
PSAANEW  EQU   PSA+544                                                  02002000
PSATOLD  EQU   PSA+540                                                  02003000
PSATNEW  EQU   PSA+536                                                  02004000
PSALCCAR EQU   PSA+532                                                  02005000
PSALCCAV EQU   PSA+528                                                  02006000
PSAPCCAR EQU   PSA+524                                                  02007000
PSAPCCAV EQU   PSA+520                                                  02008000
PSACPULA EQU   PSA+518                                                  02009000
PSACPUPA EQU   PSA+516                                                  02010000
PSAPSA   EQU   PSA+512                                                  02011000
FLCHDEND EQU   PSA+512                                                  02012000
FLCCRSAV EQU   FLCMCLA+280                                              02013000
FLCGRSAV EQU   FLCMCLA+216                                              02014000
FLCFPSAV EQU   FLCMCLA+184                                              02015000
FLCFLA   EQU   FLCMCLA+88                                               02016000
FLCRGNCD EQU   FLCMCLA+84                                               02017000
FLCFSAA  EQU   FLCFSA+1                                                 02018000
@NM00020 EQU   FLCFSA                                                   02019000
@NM00019 EQU   FLCMCLA+72                                               02020000
FLCMCIC  EQU   FLCMCLA+64                                               02021000
@NM00018 EQU   FLCMCLA+20                                               02022000
FLCIOAA  EQU   FLCIOA+1                                                 02023000
@NM00017 EQU   FLCIOA                                                   02024000
@NM00016 EQU   FLCMCLA+15                                               02025000
@NM00015 EQU   FLCMCLA+14                                               02026000
@NM00014 EQU   FLCMCLA+12                                               02027000
FLCLCL   EQU   FLCMCLA+8                                                02028000
FLCIOELA EQU   FLCIOEL+1                                                02029000
@NM00013 EQU   FLCIOEL                                                  02030000
FLCCHNID EQU   FLCMCLA                                                  02031000
@NM00012 EQU   PSA+160                                                  02032000
FLCMTRCD EQU   PSA+157                                                  02033000
@NM00011 EQU   PSA+156                                                  02034000
FLCPERA  EQU   FLCPER+1                                                 02035000
@NM00010 EQU   FLCPER                                                   02036000
@NM00009 EQU   PSA+151                                                  02037000
FLCPERCD EQU   PSA+150                                                  02038000
FLCMCNUM EQU   PSA+149                                                  02039000
@NM00008 EQU   PSA+148                                                  02040000
FLCTEAA  EQU   FLCTEA+1                                                 02041000
@NM00007 EQU   FLCTEA                                                   02042000
PSAPIPC  EQU   PSAPICOD                                                 02043000
PSAPIMC  EQU   PSAPICOD                                                 02044000
PSAPIPER EQU   PSAPICOD                                                 02045000
PSARV049 EQU   FLCPICOD                                                 02046000
FLCPILCB EQU   FLCPIILC                                                 02047000
@NM00006 EQU   FLCPIILC                                                 02048000
@NM00005 EQU   PSAEPPSW                                                 02049000
FLCSVCN  EQU   PSAESPSW+2                                               02050000
FLCSILCB EQU   FLCSVILC                                                 02051000
@NM00004 EQU   FLCSVILC                                                 02052000
@NM00003 EQU   PSAESPSW                                                 02053000
FLCEICOD EQU   PSAEEPSW+2                                               02054000
PSASPAD  EQU   PSAEEPSW                                                 02055000
@NM00002 EQU   PSA+128                                                  02056000
FLCINPSW EQU   PSA+120                                                  02057000
FLCMNPSW EQU   PSA+112                                                  02058000
FLCPNPSW EQU   PSA+104                                                  02059000
FLCSNPSW EQU   PSA+96                                                   02060000
FLCENPSW EQU   PSA+88                                                   02061000
FLCTRACE EQU   PSA+84                                                   02062000
FLCTIMER EQU   PSA+80                                                   02063000
FLCCVT2  EQU   PSA+76                                                   02064000
FLCCAW   EQU   PSA+72                                                   02065000
FLCCSW   EQU   PSA+64                                                   02066000
FLCIOPSW EQU   PSA+56                                                   02067000
FLCMOPSW EQU   PSA+48                                                   02068000
FLCPOPSW EQU   PSA+40                                                   02069000
FLCSOPSW EQU   PSA+32                                                   02070000
FLCEOPSW EQU   PSA+24                                                   02071000
@NM00001 EQU   FLCICCW2+4                                               02072000
FLCICCW1 EQU   FLCROPSW                                                 02073000
FLCIPPSW EQU   FLCRNPSW                                                 02074000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02075000
@RT00163 EQU   #BCM0005                                                 02076000
@RC00216 EQU   @RC00213                                                 02077000
@RF00233 EQU   @EL00002                                                 02078000
@ENDDATA EQU   *                                                        02079000
         END   IKTCASOX,(C'PLS1829',0702,80192)                         02080000
