         TITLE '  OPNDST RPL EXIT'                                      00001000
IKTRPLXT CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'IKTRPLXT  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @12,0                                               0001 00009000
@PSTART  DS    0H                                                  0001 00010000
         USING @PSTART,@12                                         0001 00011000
         PRINT OFF                                                      00012000
         PRINT ON                                                       00013000
         LR    RPLREG,1      LOAD ADDRESS OF RPL FROM REG1              00014000
         MODESET EXTKEY=ZERO GET KEY ZERO STORAGE                       00015000
         L     0,@SIZDATD    LOAD AREA SIZE FOR GETMAIN                 00016000
         GETMAIN R,LV=(0)    ISSUE GETMAIN                              00017000
         LR    SVAREG,1      LOAD ADDRESS OF SAVEAREA INTO REG13        00018000
         LR    SAVREG,14     LOAD RETURN ADDRESS INTO SAVE REGISTER     00019000
         CHECK RPL=(RPLREG)                                             00020000
*   DO;                             /* BLOCK MAIN START OF MAIN BLOCK   00021000
*                                                            @ZA28191*/ 00022000
*     DO WHILE(RETCODE^=0|NIBCON='0'B);/* OPNDST FAILED      @ZM21166*/ 00023000
         B     @DE00135                                            0135 00024000
@DL00135 DS    0H                                                  0136 00025000
*       IF RETCODE=4&REG0=8 THEN    /* CHECK FOR RETRYABLE ERROR     */ 00026000
         C     RETCODE,@CF00055                                    0136 00027000
         BNE   @RF00136                                            0136 00028000
         C     REG0,@CF00047                                       0136 00029000
         BNE   @RF00136                                            0136 00030000
*         DO;                                                      0137 00031000
*           TVWARTR=TVWARTR-1;      /* DECREMENT COUNTER             */ 00032000
         L     @10,ASCBPTR                                         0138 00033000
         L     @01,TSBPTR(,@10)                                    0138 00034000
         L     @10,TSBEXTNT(,@01)                                  0138 00035000
         L     @08,TVWAPTR(,@10)                                   0138 00036000
         LH    @01,TVWARTR(,@08)                                   0138 00037000
         BCTR  @01,0                                               0138 00038000
         STH   @01,TVWARTR(,@08)                                   0138 00039000
*           IF TVWARTR<=0 THEN      /* CHECK FOR RETRY EXCEEDED      */ 00040000
         LTR   @01,@01                                             0139 00041000
         BP    @RF00139                                            0139 00042000
*             DO;                                                  0140 00043000
*               RFY                                                0141 00044000
*                 ECBREG RSTD;      /* RESTRICT ECB POINTER REGSITER */ 00045000
*               ECBREG=ADDR(TSBXECB);/* LOAD ADDRESS OF TSO/VTAM   0142 00046000
*                                      CANCEL ECB                    */ 00047000
         LA    ECBREG,TSBXECB(,@10)                                0142 00048000
*               GENERATE CODE REFS(ECBREG);                        0143 00049000
*                                                                  0143 00050000
         POST (ECBREG),X'0'     ISSUE POST TO CANCEL APPLICATION        00051000
*                                                           @ZA28191*/  00052000
*/*             LEAVE(MAIN)                                          */ 00053000
*                                                                  0144 00054000
*               GOTO #BCM0002;      /* EXIT TO VTAM          @ZA28191*/ 00055000
         B     #BCM0002                                            0144 00056000
*               RFY                                                0145 00057000
*                 ECBREG UNRSTD;    /* UNRESTRICT ECB POINTER      0145 00058000
*                                      REGISTER                      */ 00059000
*             END;                                                 0146 00060000
*           ELSE                    /* RETRY LIMIT NOT EXCEEDED      */ 00061000
*             DO;                                                  0147 00062000
@RF00139 DS    0H                                                  0148 00063000
*               GENERATE CODE;                                     0148 00064000
*                                                                  0148 00065000
*                                  /* REISSUE COMMAND FOR BIND      */  00066000
         EXECRPL RPL=(RPLREG)                                           00067000
*/*             LEAVE(MAIN) ON(RETCODE=0)                            */ 00068000
*                                                                  0149 00069000
*               IF(RETCODE=0) THEN                                 0149 00070000
         LTR   RETCODE,RETCODE                                     0149 00071000
         BZ    @RT00149                                            0149 00072000
*                 GOTO #BCM0002;    /* CHECK FOR INITIAL COMPLETION     00073000
*                                                            @ZA28191*/ 00074000
*             END;                                                 0151 00075000
*         END;                                                     0152 00076000
*       ELSE                        /* RETCODE INDICATES UNRETRYABLE    00077000
*                                      ERROR                         */ 00078000
*         DO;                                                      0153 00079000
         B     @RC00136                                            0153 00080000
@RF00136 DS    0H                                                  0154 00081000
*           RFY                                                    0154 00082000
*             ECBREG RSTD;          /* RESTRICT ECB POINTER REGSITER */ 00083000
*           ECBREG=ADDR(TSBXECB);   /* LOAD ADDRESS OF TSO/VTAM    0155 00084000
*                                      CANCEL ECB                    */ 00085000
         L     @10,ASCBPTR                                         0155 00086000
         L     @01,TSBPTR(,@10)                                    0155 00087000
         L     ECBREG,TSBEXTNT(,@01)                               0155 00088000
         LA    ECBREG,TSBXECB(,ECBREG)                             0155 00089000
*           GENERATE CODE REFS(ECBREG);                            0156 00090000
*                                                                  0156 00091000
*                                    /*                    @ZM21120*/   00092000
         POST (ECBREG),X'0'    ISSUE POST TO CANCEL APPLICATION         00093000
*                                                           @ZA28191*/  00094000
*/*         LEAVE(MAIN)                                              */ 00095000
*                                                                  0157 00096000
*           GOTO #BCM0002;          /* EXIT TO VTAM          @ZA28191*/ 00097000
         B     #BCM0002                                            0157 00098000
*           RFY                                                    0158 00099000
*             ECBREG UNRSTD;        /* UNRESTRICT ECB POINTER      0158 00100000
*                                      REGISTER                      */ 00101000
*         END;                                                     0159 00102000
*     END;                          /* END OF LOOP                   */ 00103000
@RC00136 DS    0H                                                  0160 00104000
@DE00135 LTR   RETCODE,RETCODE                                     0160 00105000
         BNZ   @DL00135                                            0160 00106000
         L     @01,RPLAREA(,RPLREG)                                0160 00107000
         TM    NIBCON(@01),B'01000000'                             0160 00108000
         BZ    @DL00135                                            0160 00109000
*     RFY                                                          0161 00110000
*      (RETCODE,                                                   0161 00111000
*       RPLREG) UNRSTD;             /* UNRESTRICT RETURN CODE      0161 00112000
*                                      REGISTER AND RPL REGISTER     */ 00113000
*     RFY                                                          0162 00114000
*       ECBREG RSTD;                /* RESTRICT ECB POINTER REGISTER */ 00115000
*     ECBREG=ADDR(TVWAECB);         /* INSERT ADDRESS OF TERMINAL  0163 00116000
*                                      CONTROL ECB INTO REGISTER 3   */ 00117000
         L     @15,ASCBPTR                                         0163 00118000
         L     @01,TSBPTR(,@15)                                    0163 00119000
         L     @01,TSBEXTNT(,@01)                                  0163 00120000
         L     ECBREG,TVWAPTR(,@01)                                0163 00121000
         LA    ECBREG,TVWAECB(,ECBREG)                             0163 00122000
*     GENERATE CODE                 /* POST TERMINAL CONTROL AND   0164 00123000
*                                      CHANGE PROTECT KEY BACK       */ 00124000
*         REFS(ECBREG,SAVREG);                                     0164 00125000
*                                  /*                       @ZM21120*/  00126000
         POST (ECBREG),X'0'     ISSUE POST MACRO                        00127000
*     RFY                                                          0165 00128000
*       ECBREG UNRSTD;              /* UNRESTRICT REGISTER           */ 00129000
*   END;                            /* END(MAIN)                     */ 00130000
*#BCM0002:                                                         0167 00131000
*   ;                               /*                       @ZA28191*/ 00132000
#BCM0002 DS    0H                                                  0168 00133000
*/********************************************************************/ 00134000
*/* THIS CODE IS ENTERED FROM ANY LEAVE(MAIN) MACRO ABOVE.   @ZA28191*/ 00135000
*/********************************************************************/ 00136000
*                                                                  0168 00137000
*   GEN CODE EXIT REFS(SAVREG);                                    0168 00138000
*                                     /* PERFORM EXIT CODE  @ZA28191*/  00139000
         L     @00,@SIZDATD           /* SIZE FOR FREEMAIN  @ZA28191*/  00140000
         LR    @01,@13                /* ADDRESS OF AREA    @ZA28191*/  00141000
         FREEMAIN R,LV=(0),A=(1)      /* FREE AUTO AREA     @ZA28191*/  00142000
         MODESET EXTKEY=VTAM          /* RETURN TO KEY 6    @ZA28191*/  00143000
         LR    @14,SAVREG             /* SET RETURN ADDRESS @ZA28191*/  00144000
         BR    @14                    /* RETURN TO VTAM     @ZA28191*/  00145000
*   END IKTRPLXT                                                   0169 00146000
*                                                                  0169 00147000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00148000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00149000
*/*%INCLUDE SYSLIB  (IHAASCB )                                       */ 00150000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 00151000
*/*%INCLUDE SYSLIB  (IFGRPLVS)                                       */ 00152000
*/*%INCLUDE SYSLIB  (ISTRPLEX)                                       */ 00153000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 00154000
*/*%INCLUDE SYSLIB  (IKJTSB  )                                       */ 00155000
*/*%INCLUDE SYSLIB  (IKTTSBX )                                       */ 00156000
*/*%INCLUDE SYSLIB  (IKTTVWA )                                       */ 00157000
*                                                                  0169 00158000
*       ;                                                          0169 00159000
@DATA    DS    0H                                                       00160000
@DATD    DSECT                                                          00161000
         DS    0F                                                       00162000
@SA00001 DS    18F                                                      00163000
IKTRPLXT CSECT                                                          00164000
         DS    0F                                                       00165000
@CF00055 DC    F'4'                                                     00166000
@CF00047 DC    F'8'                                                     00167000
@DATD    DSECT                                                          00168000
         DS    0D                                                       00169000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00170000
@ENDDATD EQU   *                                                        00171000
IKTRPLXT CSECT                                                          00172000
         DS    0F                                                       00173000
@SIZDATD DC    AL1(0)                                                   00174000
         DC    AL3(@ENDDATD-@DATD)                                      00175000
         DS    0D                                                       00176000
DUMAREA  DC    30H'0'                                                   00177000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00178000
@01      EQU   01                                                       00179000
@02      EQU   02                                                       00180000
@03      EQU   03                                                       00181000
@04      EQU   04                                                       00182000
@05      EQU   05                                                       00183000
@06      EQU   06                                                       00184000
@07      EQU   07                                                       00185000
@08      EQU   08                                                       00186000
@09      EQU   09                                                       00187000
@10      EQU   10                                                       00188000
@11      EQU   11                                                       00189000
@12      EQU   12                                                       00190000
@13      EQU   13                                                       00191000
@14      EQU   14                                                       00192000
@15      EQU   15                                                       00193000
RPLREG   EQU   @09                                                      00194000
RETUREG  EQU   @14                                                      00195000
SAVREG   EQU   @11                                                      00196000
SVAREG   EQU   @13                                                      00197000
ECBREG   EQU   @03                                                      00198000
REG0     EQU   @00                                                      00199000
RETCODE  EQU   @15                                                      00200000
PSA      EQU   0                                                        00201000
FLCRNPSW EQU   PSA                                                      00202000
FLCROPSW EQU   PSA+8                                                    00203000
FLCICCW2 EQU   PSA+16                                                   00204000
PSAEEPSW EQU   PSA+132                                                  00205000
PSAESPSW EQU   PSA+136                                                  00206000
FLCSVILC EQU   PSAESPSW+1                                               00207000
PSAEPPSW EQU   PSA+140                                                  00208000
FLCPIILC EQU   PSAEPPSW+1                                               00209000
FLCPICOD EQU   PSAEPPSW+2                                               00210000
PSAPICOD EQU   FLCPICOD+1                                               00211000
FLCTEA   EQU   PSAEPPSW+4                                               00212000
FLCPER   EQU   PSA+152                                                  00213000
FLCMCLA  EQU   PSA+168                                                  00214000
FLCIOEL  EQU   FLCMCLA+4                                                00215000
FLCIOA   EQU   FLCMCLA+16                                               00216000
FLCFSA   EQU   FLCMCLA+80                                               00217000
PSAAOLD  EQU   PSA+548                                                  00218000
PSASUPER EQU   PSA+552                                                  00219000
PSASUP1  EQU   PSASUPER                                                 00220000
PSASUP2  EQU   PSASUPER+1                                               00221000
PSASUP3  EQU   PSASUPER+2                                               00222000
PSASUP4  EQU   PSASUPER+3                                               00223000
PSACLHT  EQU   PSA+640                                                  00224000
PSALKSA  EQU   PSA+696                                                  00225000
PSAHLHI  EQU   PSA+760                                                  00226000
PSADSSFL EQU   PSA+836                                                  00227000
PSADSSF1 EQU   PSADSSFL                                                 00228000
PSADSSF3 EQU   PSADSSFL+2                                               00229000
PSADSSF4 EQU   PSADSSFL+3                                               00230000
PSARSVT  EQU   PSA+896                                                  00231000
ASCB     EQU   0                                                        00232000
ASCBSUPC EQU   ASCB+16                                                  00233000
ASCBTSB  EQU   ASCB+60                                                  00234000
ASCBFW1  EQU   ASCB+100                                                 00235000
ASCBRCTF EQU   ASCBFW1+2                                                00236000
ASCBFLG1 EQU   ASCBFW1+3                                                00237000
ASCBDSP1 EQU   ASCB+114                                                 00238000
ASCBFLG2 EQU   ASCB+115                                                 00239000
ASCBLKGP EQU   ASCB+128                                                 00240000
ASCBSRQ  EQU   ASCB+180                                                 00241000
ASCBSRQ1 EQU   ASCBSRQ                                                  00242000
ASCBSRQ2 EQU   ASCBSRQ+1                                                00243000
ASCBSRQ3 EQU   ASCBSRQ+2                                                00244000
ASCBSRQ4 EQU   ASCBSRQ+3                                                00245000
IFGRPL   EQU   0                                                        00246000
RPLCOMN  EQU   IFGRPL                                                   00247000
RPLIDWD  EQU   RPLCOMN                                                  00248000
RPLLEN   EQU   RPLIDWD+3                                                00249000
RPLECB   EQU   RPLCOMN+8                                                00250000
RPLFDBWD EQU   RPLCOMN+12                                               00251000
RPLFDBK  EQU   RPLFDBWD+1                                               00252000
RPLRTNCD EQU   RPLFDBK                                                  00253000
RPLCNDCD EQU   RPLFDBK+1                                                00254000
RPLCMPON EQU   RPLCNDCD                                                 00255000
RPLFDB2  EQU   RPLCMPON                                                 00256000
RPLERRCD EQU   RPLCNDCD+1                                               00257000
RPLFDB3  EQU   RPLERRCD                                                 00258000
RPLKEYLE EQU   RPLCOMN+16                                               00259000
RPLAREA  EQU   RPLCOMN+32                                               00260000
RPLARG   EQU   RPLCOMN+36                                               00261000
RPLOPTCD EQU   RPLCOMN+40                                               00262000
RPLOPT1  EQU   RPLOPTCD                                                 00263000
RPLECBSW EQU   RPLOPT1                                                  00264000
RPLOPT2  EQU   RPLOPTCD+1                                               00265000
RPLADR   EQU   RPLOPT2                                                  00266000
RPLOPT3  EQU   RPLOPTCD+2                                               00267000
RPLOPT4  EQU   RPLOPTCD+3                                               00268000
RPLNXTRP EQU   RPLCOMN+44                                               00269000
RPLOPTC2 EQU   RPLCOMN+56                                               00270000
RPLOPT5  EQU   RPLOPTC2                                                 00271000
RPLWRTYP EQU   RPLOPT5                                                  00272000
RPLOPT6  EQU   RPLOPTC2+1                                               00273000
RPLUNTYP EQU   RPLOPT6                                                  00274000
RPLOPT7  EQU   RPLOPTC2+2                                               00275000
RPLCNOPT EQU   RPLOPT7                                                  00276000
RPLOPT8  EQU   RPLOPTC2+3                                               00277000
RPLRBAR  EQU   RPLCOMN+60                                               00278000
RPLAIXID EQU   RPLRBAR+2                                                00279000
RPLEXTDS EQU   RPLCOMN+68                                               00280000
RPLEXTD1 EQU   RPLEXTDS                                                 00281000
RPLVTEXT EQU   IFGRPL+76                                                00282000
RPLFDBK2 EQU   RPLVTEXT+12                                              00283000
RPLSSNSI EQU   RPLFDBK2                                                 00284000
RPLDSB   EQU   RPLSSNSI                                                 00285000
RPLDSB1  EQU   RPLDSB                                                   00286000
RPLSSEI  EQU   RPLDSB1                                                  00287000
RPLDSB2  EQU   RPLDSB+1                                                 00288000
RPLUSNSI EQU   RPLFDBK2+2                                               00289000
RPLOPTC3 EQU   RPLVTEXT+20                                              00290000
RPLOPT9  EQU   RPLOPTC3                                                 00291000
RPLOPT10 EQU   RPLOPTC3+1                                               00292000
RPLOPT11 EQU   RPLOPTC3+2                                               00293000
RPLOPT12 EQU   RPLOPTC3+3                                               00294000
RPLOSENS EQU   RPLVTEXT+24                                              00295000
RPLSSNSO EQU   RPLOSENS                                                 00296000
RPLSSEO  EQU   RPLSSNSO                                                 00297000
RPLOF16  EQU   0                                                        00298000
RPLRH3   EQU   RPLOF16                                                  00299000
RPLSRTYP EQU   RPLOF16+1                                                00300000
RPLSTYPE EQU   RPLSRTYP                                                 00301000
RPLRTYPE EQU   RPLSRTYP                                                 00302000
RPLCHN   EQU   RPLOF16+2                                                00303000
RPLVTFL1 EQU   RPLOF16+3                                                00304000
RPLVTFL2 EQU   RPLOF16+4                                                00305000
RPLPOSTV EQU   RPLVTFL2                                                 00306000
RPLRESP  EQU   RPLVTFL2                                                 00307000
RPLCNTRL EQU   RPLOF16+5                                                00308000
RPLCNTDF EQU   RPLCNTRL                                                 00309000
RPLCNTDC EQU   RPLCNTRL+1                                               00310000
RPLCNTSC EQU   RPLCNTRL+2                                               00311000
RPLOF56  EQU   0                                                        00312000
RPLO5    EQU   RPLOF56                                                  00313000
RPLOF60  EQU   0                                                        00314000
RPLOBSQ  EQU   RPLOF60+4                                                00315000
RPLIBSQ  EQU   RPLOF60+5                                                00316000
ISTPROCD EQU   0                                                        00317000
PROPROC  EQU   ISTPROCD                                                 00318000
PROPROC1 EQU   PROPROC                                                  00319000
PROPROC2 EQU   PROPROC+1                                                00320000
PROPROC3 EQU   PROPROC+2                                                00321000
PROPROC4 EQU   PROPROC+3                                                00322000
PROPROCS EQU   0                                                        00323000
PROSETMS EQU   PROPROCS+1                                               00324000
PROSETM2 EQU   PROSETMS                                                 00325000
PROSETM3 EQU   PROSETMS+1                                               00326000
PROSETM4 EQU   PROSETMS+2                                               00327000
ISTDEVCH EQU   0                                                        00328000
DEVSHCH  EQU   ISTDEVCH                                                 00329000
DEVCHAR  EQU   DEVSHCH                                                  00330000
DEVTCODE EQU   ISTDEVCH+1                                               00331000
DEVFLAGS EQU   ISTDEVCH+3                                               00332000
DEVFCCTL EQU   DEVFLAGS                                                 00333000
DEVCHAR3 EQU   DEVFLAGS                                                 00334000
DEVMODE  EQU   ISTDEVCH+5                                               00335000
ISTNIB   EQU   0                                                        00336000
NIBFLGS  EQU   ISTNIB+40                                                00337000
NIBFLG1  EQU   NIBFLGS                                                  00338000
NIBCON   EQU   NIBFLG1                                                  00339000
TSB      EQU   0                                                        00340000
TSBASCBA EQU   TSB                                                      00341000
TSBSTAT  EQU   TSBASCBA                                                 00342000
TSBFLG1  EQU   TSB+4                                                    00343000
TSBFLG2  EQU   TSB+16                                                   00344000
TSBFLG3  EQU   TSB+24                                                   00345000
TSBFLG5  EQU   TSB+25                                                   00346000
TSBTERMC EQU   TSB+26                                                   00347000
TSBTERM1 EQU   TSBTERMC                                                 00348000
TSBTERM2 EQU   TSBTERMC+1                                               00349000
TSBSTCC  EQU   TSB+34                                                   00350000
TSBFLG4  EQU   TSB+41                                                   00351000
TSBRCB   EQU   TSB+64                                                   00352000
TSBLINKA EQU   TSBRCB+4                                                 00353000
TSBTPOST EQU   TSB+72                                                   00354000
TSBTPFLG EQU   TSBTPOST                                                 00355000
TSBMINL  EQU   TSB+84                                                   00356000
TSBEXTNT EQU   TSB+96                                                   00357000
TSBX     EQU   0                                                        00358000
TSBXECB  EQU   TSBX+8                                                   00359000
TSBXFLG1 EQU   TSBX+32                                                  00360000
TSBXTVWA EQU   TSBX+36                                                  00361000
TSBXTIM  EQU   TSBX+40                                                  00362000
TSBXTOM  EQU   TSBX+44                                                  00363000
TSBXTERM EQU   TSBX+72                                                  00364000
TVWA     EQU   0                                                        00365000
TVWADLST EQU   TVWA+108                                                 00366000
TVWAECB  EQU   TVWA+152                                                 00367000
TVWAECBL EQU   TVWA+160                                                 00368000
TVWARTR  EQU   TVWA+216                                                 00369000
TVWAFLAG EQU   TVWA+232                                                 00370000
TVWAFLG1 EQU   TVWAFLAG+1                                               00371000
TVWAFLG2 EQU   TVWAFLAG+2                                               00372000
TVWAFLG3 EQU   TVWAFLAG+3                                               00373000
TVWAFLG4 EQU   TVWAFLAG+4                                               00374000
TVWAFLG5 EQU   TVWAFLAG+5                                               00375000
TVWAFLG6 EQU   TVWAFLAG+6                                               00376000
TVWAFLG7 EQU   TVWAFLAG+7                                               00377000
TVWAFLG8 EQU   TVWAFLAG+8                                               00378000
TVWAKEYB EQU   TVWAFLG8                                                 00379000
ISTRPL   EQU   0                                                        00380000
PSARSVTE EQU   PSARSVT                                                  00381000
ASCBPTR  EQU   PSAAOLD                                                  00382000
TSBPTR   EQU   ASCBTSB                                                  00383000
TVWAPTR  EQU   TSBXTVWA                                                 00384000
FLC      EQU   PSA                                                      00385000
PATAREA  EQU   DUMAREA                                                  00386000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00387000
PSARSAV  EQU   PSARSVTE+60                                              00388000
PSARSTK  EQU   PSARSVTE+56                                              00389000
PSAESAV3 EQU   PSARSVTE+52                                              00390000
PSAESTK3 EQU   PSARSVTE+48                                              00391000
PSAESAV2 EQU   PSARSVTE+44                                              00392000
PSAESTK2 EQU   PSARSVTE+40                                              00393000
PSAESAV1 EQU   PSARSVTE+36                                              00394000
PSAESTK1 EQU   PSARSVTE+32                                              00395000
PSAPSAV  EQU   PSARSVTE+28                                              00396000
PSAPSTK  EQU   PSARSVTE+24                                              00397000
PSAMSAV  EQU   PSARSVTE+20                                              00398000
PSAMSTK  EQU   PSARSVTE+16                                              00399000
PSASSAV  EQU   PSARSVTE+12                                              00400000
PSASSTK  EQU   PSARSVTE+8                                               00401000
PSANSTK  EQU   PSARSVTE+4                                               00402000
PSACSTK  EQU   PSARSVTE                                                 00403000
TVWAEND  EQU   TVWA+248                                                 00404000
TVWAFLGF EQU   TVWAFLAG+15                                              00405000
TVWAFLGE EQU   TVWAFLAG+14                                              00406000
TVWAFLGD EQU   TVWAFLAG+13                                              00407000
TVWAFLGC EQU   TVWAFLAG+12                                              00408000
TVWAFLGB EQU   TVWAFLAG+11                                              00409000
TVWAFLGA EQU   TVWAFLAG+10                                              00410000
TVWAFLG9 EQU   TVWAFLAG+9                                               00411000
@NM00088 EQU   TVWAFLG8                                                 00412000
TVWAKEYP EQU   TVWAKEYB                                                 00413000
TVWAKEYL EQU   TVWAKEYB                                                 00414000
TVWADIRS EQU   TVWAFLG8                                                 00415000
TVWABRKT EQU   TVWAFLG8                                                 00416000
TVWAFRRR EQU   TVWAFLG7                                                 00417000
@NM00087 EQU   TVWAFLG7                                                 00418000
@NM00086 EQU   TVWAFLG7                                                 00419000
TVWARISW EQU   TVWAFLG7                                                 00420000
@NM00085 EQU   TVWAFLG7                                                 00421000
TVWARDBF EQU   TVWAFLG7                                                 00422000
TVWATGET EQU   TVWAFLG7                                                 00423000
TVWABKPG EQU   TVWAFLG7                                                 00424000
TVWASCSW EQU   TVWAFLG6                                                 00425000
TVWALTS  EQU   TVWAFLG6                                                 00426000
@NM00084 EQU   TVWAFLG6                                                 00427000
TVWAFMEW EQU   TVWAFLG6                                                 00428000
TVWARCDT EQU   TVWAFLG6                                                 00429000
@NM00083 EQU   TVWAFLG6                                                 00430000
TVWAIOTR EQU   TVWAFLG6                                                 00431000
TVWAISYS EQU   TVWAFLG6                                                 00432000
TVWAP1ST EQU   TVWAFLG5                                                 00433000
TVWAPRMT EQU   TVWAFLG5                                                 00434000
TVWANFSP EQU   TVWAFLG5                                                 00435000
TVWATIR  EQU   TVWAFLG5                                                 00436000
TVWAFSW  EQU   TVWAFLG5                                                 00437000
@NM00082 EQU   TVWAFLG5                                                 00438000
TVWAFSM  EQU   TVWAFLG5                                                 00439000
@NM00081 EQU   TVWAFLG5                                                 00440000
@NM00080 EQU   TVWAFLG4                                                 00441000
TVWARCRS EQU   TVWAFLG4                                                 00442000
TVWAQMEV EQU   TVWAFLG4                                                 00443000
@NM00079 EQU   TVWAFLG4                                                 00444000
TVWANOFB EQU   TVWAFLG4                                                 00445000
@NM00078 EQU   TVWAFLG4                                                 00446000
TVWADOOQ EQU   TVWAFLG4                                                 00447000
TVWAFMSC EQU   TVWAFLG4                                                 00448000
TVWATRDF EQU   TVWAFLG3                                                 00449000
TVWATRAN EQU   TVWAFLG3                                                 00450000
@NM00077 EQU   TVWAFLG3                                                 00451000
TVWAQMIO EQU   TVWAFLG3                                                 00452000
TVWAQMRT EQU   TVWAFLG3                                                 00453000
TVWAAIGN EQU   TVWAFLG3                                                 00454000
TVWASDSG EQU   TVWAFLG3                                                 00455000
TVWABRIN EQU   TVWAFLG3                                                 00456000
TVWABIR  EQU   TVWAFLG2                                                 00457000
TVWACRRQ EQU   TVWAFLG2                                                 00458000
TVWANLRQ EQU   TVWAFLG2                                                 00459000
TVWAERMG EQU   TVWAFLG2                                                 00460000
@NM00076 EQU   TVWAFLG2                                                 00461000
@NM00075 EQU   TVWAFLG2                                                 00462000
TVWAPGN  EQU   TVWAFLG2                                                 00463000
TVWAENDS EQU   TVWAFLG2                                                 00464000
TVWAOOPS EQU   TVWAFLG1                                                 00465000
TVWALTE  EQU   TVWAFLG1                                                 00466000
TVWAILE  EQU   TVWAFLG1                                                 00467000
TVWAXSCD EQU   TVWAFLG1                                                 00468000
TVWATID  EQU   TVWAFLG1                                                 00469000
TVWATAS  EQU   TVWAFLG1                                                 00470000
TVWATIS  EQU   TVWAFLG1                                                 00471000
TVWATOD  EQU   TVWAFLG1                                                 00472000
TVWAFLG0 EQU   TVWAFLAG                                                 00473000
TVWAUSRA EQU   TVWA+224                                                 00474000
@NM00074 EQU   TVWA+220                                                 00475000
TVWANCNT EQU   TVWA+218                                                 00476000
TVWARMAX EQU   TVWA+214                                                 00477000
TVWAATTN EQU   TVWA+212                                                 00478000
@NM00073 EQU   TVWA+205                                                 00479000
TVWARSHW EQU   TVWA+204                                                 00480000
TVWAWLSZ EQU   TVWA+202                                                 00481000
TVWAWLNO EQU   TVWA+200                                                 00482000
TVWALNCT EQU   TVWA+198                                                 00483000
TVWALNSV EQU   TVWA+196                                                 00484000
TVWATRNM EQU   TVWA+188                                                 00485000
TVWAATBO EQU   TVWA+184                                                 00486000
TVWAATBI EQU   TVWA+180                                                 00487000
TVWATABO EQU   TVWA+176                                                 00488000
TVWATABI EQU   TVWA+172                                                 00489000
TVWAECB3 EQU   TVWAECBL+8                                               00490000
TVWAECB2 EQU   TVWAECBL+4                                               00491000
TVWAECB1 EQU   TVWAECBL                                                 00492000
TVWATECB EQU   TVWA+156                                                 00493000
@NM00072 EQU   TVWA+124                                                 00494000
TVWATGTF EQU   TVWA+120                                                 00495000
TVWADIN3 EQU   TVWADLST+8                                               00496000
TVWADIN2 EQU   TVWADLST+4                                               00497000
TVWADIN1 EQU   TVWADLST                                                 00498000
TVWAVSZ  EQU   TVWA+104                                                 00499000
TVWAVST  EQU   TVWA+100                                                 00500000
TVWAEXL  EQU   TVWA+96                                                  00501000
TVWARPL  EQU   TVWA+92                                                  00502000
TVWANIB  EQU   TVWA+88                                                  00503000
TVWAACB  EQU   TVWA+84                                                  00504000
TVWAFRWO EQU   TVWA+80                                                  00505000
TVWAFRWI EQU   TVWA+76                                                  00506000
TVWACHNL EQU   TVWA+74                                                  00507000
TVWACLSZ EQU   TVWA+72                                                  00508000
TVWALBUF EQU   TVWA+68                                                  00509000
TVWAHBUF EQU   TVWA+64                                                  00510000
TVWATCB  EQU   TVWA+60                                                  00511000
TVWAUSMN EQU   TVWA+56                                                  00512000
@NM00071 EQU   TVWA+52                                                  00513000
TVWACPID EQU   TVWA+48                                                  00514000
TVWAEOQ  EQU   TVWA+44                                                  00515000
TVWANOM  EQU   TVWA+40                                                  00516000
TVWABOQ  EQU   TVWA+36                                                  00517000
TVWAEIQ  EQU   TVWA+32                                                  00518000
TVWANIM  EQU   TVWA+28                                                  00519000
TVWABIQ  EQU   TVWA+24                                                  00520000
TVWAQMWA EQU   TVWA+20                                                  00521000
TVWALLWA EQU   TVWA+16                                                  00522000
TVWATOMW EQU   TVWA+12                                                  00523000
TVWATIMW EQU   TVWA+8                                                   00524000
TVWAPPL  EQU   TVWA                                                     00525000
TSBXEND  EQU   TSBX+128                                                 00526000
@NM00070 EQU   TSBX+124                                                 00527000
TSBXDMMO EQU   TSBX+120                                                 00528000
TSBXDMMI EQU   TSBX+116                                                 00529000
TSBXBIND EQU   TSBX+80                                                  00530000
TSBXRPL  EQU   TSBX+76                                                  00531000
TSBXTMBF EQU   TSBXTERM+2                                               00532000
TSBXSUBT EQU   TSBXTERM+1                                               00533000
TSBXTMTP EQU   TSBXTERM                                                 00534000
TSBXAIND EQU   TSBX+70                                                  00535000
TSBXRSZO EQU   TSBX+69                                                  00536000
TSBXRSZI EQU   TSBX+68                                                  00537000
TSBXLBUF EQU   TSBX+64                                                  00538000
TSBXCSAP EQU   TSBX+60                                                  00539000
TSBXSRB  EQU   TSBX+56                                                  00540000
TSBXSRBI EQU   TSBX+52                                                  00541000
@NM00069 EQU   TSBX+48                                                  00542000
TSBXDPMO EQU   TSBXTOM                                                  00543000
TSBXDPMI EQU   TSBXTIM                                                  00544000
TSBXFLG4 EQU   TSBX+35                                                  00545000
TSBXFLG3 EQU   TSBX+34                                                  00546000
TSBXFLG2 EQU   TSBX+33                                                  00547000
@NM00068 EQU   TSBXFLG1                                                 00548000
TSBXTGTF EQU   TSBXFLG1                                                 00549000
TSBXNOSW EQU   TSBXFLG1                                                 00550000
TSBXWREC EQU   TSBXFLG1                                                 00551000
TSBXLOGF EQU   TSBXFLG1                                                 00552000
TSBXACTV EQU   TSBXFLG1                                                 00553000
TSBXASCI EQU   TSBXFLG1                                                 00554000
TSBXUID  EQU   TSBX+24                                                  00555000
TSBXLMOD EQU   TSBX+16                                                  00556000
TSBXNIB  EQU   TSBX+12                                                  00557000
TSBXBCK  EQU   TSBX+4                                                   00558000
TSBXFWD  EQU   TSBX                                                     00559000
TSBEND   EQU   TSB+120                                                  00560000
TSBSF1   EQU   TSB+112                                                  00561000
TSBTRMID EQU   TSB+104                                                  00562000
TSBALTC  EQU   TSB+103                                                  00563000
TSBALTR  EQU   TSB+102                                                  00564000
TSBPRMC  EQU   TSB+101                                                  00565000
TSBPRMR  EQU   TSB+100                                                  00566000
TSBPSWD  EQU   TSB+88                                                   00567000
TSBLECB  EQU   TSBMINL                                                  00568000
TSBLINE  EQU   TSB+82                                                   00569000
TSBSTAX  EQU   TSB+81                                                   00570000
TSBATTNC EQU   TSB+80                                                   00571000
TSBF1V   EQU   TSBTPOST+7                                               00572000
TSBF1M   EQU   TSBTPOST+6                                               00573000
TSBF2V   EQU   TSBTPOST+5                                               00574000
TSBF2M   EQU   TSBTPOST+4                                               00575000
TSBFLAGV EQU   TSBTPOST+3                                               00576000
TSBFLAGM EQU   TSBTPOST+2                                               00577000
@NM00067 EQU   TSBTPOST+1                                               00578000
@NM00066 EQU   TSBTPFLG                                                 00579000
@NM00065 EQU   TSBTPFLG                                                 00580000
@NM00064 EQU   TSBTPFLG                                                 00581000
@NM00063 EQU   TSBTPFLG                                                 00582000
TSBNEWID EQU   TSBTPFLG                                                 00583000
TSBTPAYI EQU   TSBTPFLG                                                 00584000
TSBTPQCB EQU   TSBTPFLG                                                 00585000
TSBPOSTO EQU   TSBTPFLG                                                 00586000
TSBLINKB EQU   TSBLINKA+1                                               00587000
TSBPRI   EQU   TSBLINKA                                                 00588000
TSBRQCB  EQU   TSBRCB                                                   00589000
TSBCTCB  EQU   TSB+60                                                   00590000
TSBERSDS EQU   TSB+56                                                   00591000
TSBAUTOI EQU   TSB+52                                                   00592000
TSBAUTOS EQU   TSB+48                                                   00593000
TSBATNCC EQU   TSB+44                                                   00594000
TSBASRCE EQU   TSB+42                                                   00595000
TSBHLDL  EQU   TSBFLG4                                                  00596000
TSBGETBF EQU   TSBFLG4                                                  00597000
TSBCANC  EQU   TSBFLG4                                                  00598000
TSBHOLD  EQU   TSBFLG4                                                  00599000
TSBHUNG  EQU   TSBFLG4                                                  00600000
TSBOWAIT EQU   TSBFLG4                                                  00601000
TSBIWAIT EQU   TSBFLG4                                                  00602000
TSBOCAB  EQU   TSBFLG4                                                  00603000
TSBLNNO  EQU   TSB+40                                                   00604000
TSBATNTC EQU   TSB+38                                                   00605000
TSBATNLC EQU   TSB+36                                                   00606000
TSBCHDCC EQU   TSBSTCC+1                                                00607000
TSBLNDCC EQU   TSBSTCC                                                  00608000
TSBWTJID EQU   TSB+32                                                   00609000
TSBECB   EQU   TSB+28                                                   00610000
TSBC1050 EQU   TSBTERM2                                                 00611000
@NM00062 EQU   TSBTERM2                                                 00612000
@NM00061 EQU   TSBTERM2                                                 00613000
@NM00060 EQU   TSBTERM2                                                 00614000
@NM00059 EQU   TSBTERM2                                                 00615000
TSBCTWX  EQU   TSBTERM2                                                 00616000
@NM00058 EQU   TSBTERM2                                                 00617000
@NM00057 EQU   TSBTERM2                                                 00618000
@NM00056 EQU   TSBTERM1                                                 00619000
@NM00055 EQU   TSBTERM1                                                 00620000
@NM00054 EQU   TSBTERM1                                                 00621000
TSBC2741 EQU   TSBTERM1                                                 00622000
TSBC5041 EQU   TSBTERM1                                                 00623000
TSBCATTN EQU   TSBTERM1                                                 00624000
TSBCBRK  EQU   TSBTERM1                                                 00625000
TSBCIHBN EQU   TSBTERM1                                                 00626000
TSBVTAM  EQU   TSBFLG5                                                  00627000
TSBKEYS  EQU   TSBFLG5                                                  00628000
TSBNEDIT EQU   TSBFLG5                                                  00629000
TSBQRY   EQU   TSBFLG5                                                  00630000
@NM00053 EQU   TSBFLG5                                                  00631000
TSBSPF   EQU   TSBFLG5                                                  00632000
TSBATMP  EQU   TSBFLG5                                                  00633000
TSBNFLOP EQU   TSBFLG3                                                  00634000
TSBNOBRK EQU   TSBFLG3                                                  00635000
TSBTPUT  EQU   TSBFLG3                                                  00636000
TSBAWOIP EQU   TSBFLG3                                                  00637000
TSBNBKSP EQU   TSBFLG3                                                  00638000
TSBSPIT  EQU   TSBFLG3                                                  00639000
TSBTJMSG EQU   TSBFLG3                                                  00640000
TSBATTN  EQU   TSBFLG3                                                  00641000
TSBIBFP  EQU   TSB+21                                                   00642000
TSBNIBF  EQU   TSB+20                                                   00643000
TSBITBFP EQU   TSB+17                                                   00644000
TSBSATN2 EQU   TSBFLG2                                                  00645000
TSBSATN1 EQU   TSBFLG2                                                  00646000
TSBSTAUT EQU   TSBFLG2                                                  00647000
TSBAUTOC EQU   TSBFLG2                                                  00648000
TSBAULST EQU   TSBFLG2                                                  00649000
TSBBRKIN EQU   TSBFLG2                                                  00650000
TSBAUTON EQU   TSBFLG2                                                  00651000
TSBBIPI  EQU   TSBFLG2                                                  00652000
TSBOBFP  EQU   TSB+13                                                   00653000
TSBNOBF  EQU   TSB+12                                                   00654000
TSBOTBFP EQU   TSB+9                                                    00655000
TSBLNSZ  EQU   TSB+8                                                    00656000
TSBWTCB  EQU   TSB+5                                                    00657000
TSBTJBF  EQU   TSBFLG1                                                  00658000
TSBTJIP  EQU   TSBFLG1                                                  00659000
TSBTJOW  EQU   TSBFLG1                                                  00660000
TSBIFLSH EQU   TSBFLG1                                                  00661000
TSBWOWIP EQU   TSBFLG1                                                  00662000
TSBOWIP  EQU   TSBFLG1                                                  00663000
TSBOFLSH EQU   TSBFLG1                                                  00664000
TSBANSR  EQU   TSBFLG1                                                  00665000
TSBASCB  EQU   TSBASCBA+1                                               00666000
TSBATNLD EQU   TSBSTAT                                                  00667000
TSB3270  EQU   TSBSTAT                                                  00668000
TSBDISC  EQU   TSBSTAT                                                  00669000
TSBITOFF EQU   TSBSTAT                                                  00670000
TSBNOBUF EQU   TSBSTAT                                                  00671000
TSBDSPLY EQU   TSBSTAT                                                  00672000
TSBLWAIT EQU   TSBSTAT                                                  00673000
TSBINUSE EQU   TSBSTAT                                                  00674000
NIBRESV  EQU   ISTNIB+60                                                00675000
NIBNDAR  EQU   ISTNIB+56                                                00676000
NIBLMODE EQU   ISTNIB+48                                                00677000
NIBEXLST EQU   ISTNIB+44                                                00678000
NIBLIMIT EQU   ISTNIB+42                                                00679000
@NM00052 EQU   ISTNIB+41                                                00680000
@NM00051 EQU   NIBFLG1                                                  00681000
NIBTREQ  EQU   NIBFLG1                                                  00682000
NIBTSEL  EQU   NIBFLG1                                                  00683000
NIBNACLQ EQU   NIBFLG1                                                  00684000
NIBSHLTP EQU   NIBFLG1                                                  00685000
NIBSDAPP EQU   NIBFLG1                                                  00686000
NIBLAST  EQU   NIBFLG1                                                  00687000
NIBPROCD EQU   ISTNIB+36                                                00688000
NIBDEVCH EQU   ISTNIB+28                                                00689000
NIBMODE  EQU   ISTNIB+20                                                00690000
NIBSYM   EQU   ISTNIB+12                                                00691000
NIBUSER  EQU   ISTNIB+8                                                 00692000
NIBCID   EQU   ISTNIB+4                                                 00693000
NIBLEN   EQU   ISTNIB+3                                                 00694000
NIBCONDN EQU   ISTNIB+2                                                 00695000
NIBRSV01 EQU   ISTNIB+1                                                 00696000
NIBID    EQU   ISTNIB                                                   00697000
DEVRSV01 EQU   ISTDEVCH+7                                               00698000
DEVAUXTP EQU   ISTDEVCH+6                                               00699000
DEVADVFE EQU   DEVMODE                                                  00700000
@NM00050 EQU   DEVMODE                                                  00701000
DEVBASIC EQU   DEVMODE                                                  00702000
DEVREC   EQU   DEVMODE                                                  00703000
DEVPHYSA EQU   ISTDEVCH+4                                               00704000
DEVCSLPN EQU   DEVCHAR3                                                 00705000
DEVCSTCL EQU   DEVCHAR3                                                 00706000
DEVCCHEK EQU   DEVCHAR3                                                 00707000
DEVCATTN EQU   DEVCHAR3                                                 00708000
DEVCSWL  EQU   DEVFCCTL                                                 00709000
DEVCRVB  EQU   DEVFCCTL                                                 00710000
DEVCSSL  EQU   DEVFCCTL                                                 00711000
DEVCBSC  EQU   DEVFCCTL                                                 00712000
DEVMCODE EQU   ISTDEVCH+2                                               00713000
DEVCHAR2 EQU   DEVTCODE                                                 00714000
DEVSPOLL EQU   DEVCHAR                                                  00715000
DEVCCTL  EQU   DEVCHAR                                                  00716000
DEVNNSPT EQU   DEVCHAR                                                  00717000
DEVSPS   EQU   DEVCHAR                                                  00718000
DEVSUBND EQU   DEVCHAR                                                  00719000
DEVCONVR EQU   DEVCHAR                                                  00720000
DEVOTPUT EQU   DEVCHAR                                                  00721000
DEVINPUT EQU   DEVCHAR                                                  00722000
PROSRDEF EQU   PROSETM4                                                 00723000
PRORSV47 EQU   PROSETM4                                                 00724000
PROSCON  EQU   PROSETM4                                                 00725000
PRORSV46 EQU   PROSETM3                                                 00726000
PROSMONT EQU   PROSETM3                                                 00727000
PRORSV45 EQU   PROSETM3                                                 00728000
PROSNTO  EQU   PROSETM3                                                 00729000
PRORSV44 EQU   PROSETM3                                                 00730000
PRORSV43 EQU   PROSETM2                                                 00731000
PROSNTFL EQU   PROSETM2                                                 00732000
PRORSV42 EQU   PROSETM2                                                 00733000
PRORSV41 EQU   PROPROCS                                                 00734000
PROMODC  EQU   PROPROC4                                                 00735000
PROMODT  EQU   PROPROC4                                                 00736000
PROMODM  EQU   PROPROC4                                                 00737000
PROMODB  EQU   PROPROC4                                                 00738000
PRORSV14 EQU   PROPROC4                                                 00739000
PRORSV13 EQU   PROPROC4                                                 00740000
PRORSV01 EQU   PROPROC4                                                 00741000
PROEIB   EQU   PROPROC4                                                 00742000
PROMONT3 EQU   PROPROC3                                                 00743000
PROMONT2 EQU   PROPROC3                                                 00744000
PROMONIT EQU   PROPROC3                                                 00745000
PROSUBLK EQU   PROPROC3                                                 00746000
PRONTO   EQU   PROPROC3                                                 00747000
PROLGIN  EQU   PROPROC3                                                 00748000
PROERPI  EQU   PROPROC3                                                 00749000
PROCPUID EQU   PROPROC3                                                 00750000
PROCFTX  EQU   PROPROC2                                                 00751000
PROEMLC  EQU   PROPROC2                                                 00752000
PRONTFL  EQU   PROPROC2                                                 00753000
PROFIFOR EQU   PROPROC2                                                 00754000
PROSYSR  EQU   PROPROC2                                                 00755000
PROLGOT  EQU   PROPROC2                                                 00756000
PROERPO  EQU   PROPROC2                                                 00757000
PRONEGBD EQU   PROPROC2                                                 00758000
PRORPLC  EQU   PROPROC1                                                 00759000
PROCS    EQU   PROPROC1                                                 00760000
PROCA    EQU   PROPROC1                                                 00761000
PRORESPX EQU   PROPROC1                                                 00762000
PRODFASY EQU   PROPROC1                                                 00763000
PROXPOPT EQU   PROPROC1                                                 00764000
PROTRUNC EQU   PROPROC1                                                 00765000
PROASYIP EQU   PROPROC1                                                 00766000
RPLSEQNO EQU   RPLOF60+6                                                00767000
@NM00049 EQU   RPLIBSQ                                                  00768000
RPLIINV  EQU   RPLIBSQ                                                  00769000
RPLINEG  EQU   RPLIBSQ                                                  00770000
RPLIPOS  EQU   RPLIBSQ                                                  00771000
RPLIIGN  EQU   RPLIBSQ                                                  00772000
RPLIRSET EQU   RPLIBSQ                                                  00773000
RPLITST  EQU   RPLIBSQ                                                  00774000
RPLISET  EQU   RPLIBSQ                                                  00775000
@NM00048 EQU   RPLOBSQ                                                  00776000
RPLOINV  EQU   RPLOBSQ                                                  00777000
RPLONEG  EQU   RPLOBSQ                                                  00778000
RPLOPOS  EQU   RPLOBSQ                                                  00779000
RPLOIGN  EQU   RPLOBSQ                                                  00780000
RPLORSET EQU   RPLOBSQ                                                  00781000
RPLOTST  EQU   RPLOBSQ                                                  00782000
RPLOSET  EQU   RPLOBSQ                                                  00783000
RPLIBSQV EQU   RPLOF60+2                                                00784000
RPLOBSQV EQU   RPLOF60                                                  00785000
@NM00047 EQU   RPLO5                                                    00786000
RPLTNFY  EQU   RPLO5                                                    00787000
@NM00046 EQU   RPLO5                                                    00788000
@NM00045 EQU   RPLCNTSC                                                 00789000
RPLRSHUT EQU   RPLCNTSC                                                 00790000
RPLRQR   EQU   RPLCNTSC                                                 00791000
RPLSHUTC EQU   RPLCNTSC                                                 00792000
RPLSHUTD EQU   RPLCNTSC                                                 00793000
RPLSTSN  EQU   RPLCNTSC                                                 00794000
RPLCLEAR EQU   RPLCNTSC                                                 00795000
RPLSDT   EQU   RPLCNTSC                                                 00796000
RPLBIS   EQU   RPLCNTDC                                                 00797000
RPLSBI   EQU   RPLCNTDC                                                 00798000
RPLTUNBD EQU   RPLCNTDC                                                 00799000
RPLTBIND EQU   RPLCNTDC                                                 00800000
RPLSIGNL EQU   RPLCNTDC                                                 00801000
RPLLUS   EQU   RPLCNTDC                                                 00802000
RPLRTR   EQU   RPLCNTDC                                                 00803000
RPLBID   EQU   RPLCNTDC                                                 00804000
@NM00044 EQU   RPLCNTDF                                                 00805000
RPLQI    EQU   RPLCNTDF                                                 00806000
RPLRELQ  EQU   RPLCNTDF                                                 00807000
RPLCHASE EQU   RPLCNTDF                                                 00808000
RPLQEC   EQU   RPLCNTDF                                                 00809000
RPLQC    EQU   RPLCNTDF                                                 00810000
RPLCNCEL EQU   RPLCNTDF                                                 00811000
RPLDATA  EQU   RPLCNTDF                                                 00812000
RPLRRN   EQU   RPLRESP                                                  00813000
RPLNFME  EQU   RPLRESP                                                  00814000
RPLEX    EQU   RPLRESP                                                  00815000
RPLQRI   EQU   RPLRESP                                                  00816000
@NM00043 EQU   RPLPOSTV                                                 00817000
RPLSCHED EQU   RPLPOSTV                                                 00818000
@NM00042 EQU   RPLVTFL1                                                 00819000
RPLTLGAC EQU   RPLVTFL1                                                 00820000
RPLTNDSP EQU   RPLVTFL1                                                 00821000
RPLAUTUS EQU   RPLVTFL1                                                 00822000
RPLVTUSE EQU   RPLVTFL1                                                 00823000
@NM00041 EQU   RPLVTFL1                                                 00824000
@NM00040 EQU   RPLCHN                                                   00825000
RPLONLY  EQU   RPLCHN                                                   00826000
RPLLAST  EQU   RPLCHN                                                   00827000
RPLMIDLE EQU   RPLCHN                                                   00828000
RPLFIRST EQU   RPLCHN                                                   00829000
@NM00039 EQU   RPLRTYPE                                                 00830000
RPLDFASY EQU   RPLRTYPE                                                 00831000
RPLNFSYN EQU   RPLRTYPE                                                 00832000
RPLRRESP EQU   RPLRTYPE                                                 00833000
@NM00038 EQU   RPLSTYPE                                                 00834000
RPLSRESP EQU   RPLSTYPE                                                 00835000
@NM00037 EQU   RPLRH3                                                   00836000
RPLCSI   EQU   RPLRH3                                                   00837000
RPLCHREQ EQU   RPLRH3                                                   00838000
RPLCMD   EQU   RPLRH3                                                   00839000
RPLEB    EQU   RPLRH3                                                   00840000
RPLBB    EQU   RPLRH3                                                   00841000
RPLSIGDA EQU   RPLVTEXT+32                                              00842000
RPLSAV13 EQU   RPLVTEXT+28                                              00843000
RPLUSNSO EQU   RPLOSENS+2                                               00844000
RPLSSMO  EQU   RPLSSNSO+1                                               00845000
@NM00036 EQU   RPLSSEO                                                  00846000
RPLRRO   EQU   RPLSSEO                                                  00847000
RPLFIO   EQU   RPLSSEO                                                  00848000
RPLSTATO EQU   RPLSSEO                                                  00849000
RPLCPMO  EQU   RPLSSEO                                                  00850000
@NM00035 EQU   RPLSSEO                                                  00851000
RPLFMHDR EQU   RPLOPT12                                                 00852000
@NM00034 EQU   RPLOPT12                                                 00853000
@NM00033 EQU   RPLOPT12                                                 00854000
@NM00032 EQU   RPLOPT12                                                 00855000
RPLNIBTK EQU   RPLOPT12                                                 00856000
RPLTRUNC EQU   RPLOPT12                                                 00857000
RPLKEEP  EQU   RPLOPT12                                                 00858000
@NM00031 EQU   RPLOPT12                                                 00859000
RPLRSVE8 EQU   RPLOPT11                                                 00860000
RPLRSVE7 EQU   RPLOPT11                                                 00861000
RPLRSVE6 EQU   RPLOPT11                                                 00862000
RPLRSVE5 EQU   RPLOPT11                                                 00863000
RPLRSVE4 EQU   RPLOPT11                                                 00864000
RPLSTOP  EQU   RPLOPT11                                                 00865000
RPLSTART EQU   RPLOPT11                                                 00866000
RPLQUIES EQU   RPLOPT11                                                 00867000
RPLRSVI6 EQU   RPLOPT10                                                 00868000
RPLRSVI5 EQU   RPLOPT10                                                 00869000
RPLRSVI4 EQU   RPLOPT10                                                 00870000
RPLRSVI3 EQU   RPLOPT10                                                 00871000
RPLTSKY  EQU   RPLOPT10                                                 00872000
RPLSPARM EQU   RPLOPT10                                                 00873000
RPLDSPLY EQU   RPLOPT10                                                 00874000
RPLBSCID EQU   RPLOPT10                                                 00875000
RPLTOPL  EQU   RPLOPT9                                                  00876000
RPLCIDE  EQU   RPLOPT9                                                  00877000
RPLRNNM  EQU   RPLOPT9                                                  00878000
RPLAPPST EQU   RPLOPT9                                                  00879000
RPLCOUNT EQU   RPLOPT9                                                  00880000
RPLTERMS EQU   RPLOPT9                                                  00881000
RPLDEVCH EQU   RPLOPT9                                                  00882000
RPLLOGON EQU   RPLOPT9                                                  00883000
RPLUSFLD EQU   RPLVTEXT+16                                              00884000
RPLESR2  EQU   RPLUSNSI+1                                               00885000
RPLESR1  EQU   RPLUSNSI                                                 00886000
RPLSSMI  EQU   RPLDSB2                                                  00887000
@NM00030 EQU   RPLSSEI                                                  00888000
RPLRRI   EQU   RPLSSEI                                                  00889000
RPLFII   EQU   RPLSSEI                                                  00890000
RPLSTATI EQU   RPLSSEI                                                  00891000
RPLCPMI  EQU   RPLSSEI                                                  00892000
RPLPATHI EQU   RPLSSEI                                                  00893000
RPLARCLN EQU   RPLVTEXT+8                                               00894000
RPLAARLN EQU   RPLVTEXT+4                                               00895000
RPLAAREA EQU   RPLVTEXT                                                 00896000
RPLERMSA EQU   RPLCOMN+72                                               00897000
RPLEMLEN EQU   RPLCOMN+70                                               00898000
RPLACTIV EQU   RPLCOMN+69                                               00899000
RPLBRANC EQU   RPLEXTD1                                                 00900000
RPLNIB   EQU   RPLEXTD1                                                 00901000
RPLTCRYP EQU   RPLEXTD1                                                 00902000
@NM00029 EQU   RPLEXTD1                                                 00903000
RPLEXIT  EQU   RPLEXTD1                                                 00904000
RPLNEXIT EQU   RPLEXTD1                                                 00905000
RPLEXSCH EQU   RPLEXTD1                                                 00906000
RPLDDDD  EQU   RPLRBAR+4                                                00907000
@NM00028 EQU   RPLRBAR+3                                                00908000
@NM00027 EQU   RPLAIXID                                                 00909000
RPLAXPKP EQU   RPLAIXID                                                 00910000
RPLAIXPC EQU   RPLRBAR                                                  00911000
RPLRSV88 EQU   RPLOPT8                                                  00912000
RPLUNCON EQU   RPLOPT8                                                  00913000
RPLACTV  EQU   RPLOPT8                                                  00914000
RPLSESS  EQU   RPLOPT8                                                  00915000
RPLPEND  EQU   RPLOPT8                                                  00916000
RPLODPRM EQU   RPLOPT8                                                  00917000
RPLODACP EQU   RPLOPT8                                                  00918000
RPLODACQ EQU   RPLOPT8                                                  00919000
RPLRSV78 EQU   RPLOPT7                                                  00920000
RPLTCRNO EQU   RPLOPT7                                                  00921000
RPLRLSOP EQU   RPLOPT7                                                  00922000
RPLTPOST EQU   RPLOPT7                                                  00923000
RPLQOPT  EQU   RPLOPT7                                                  00924000
RPLCNIMM EQU   RPLCNOPT                                                 00925000
RPLCNANY EQU   RPLCNOPT                                                 00926000
RPLCNALL EQU   RPLCNOPT                                                 00927000
RPLRSV68 EQU   RPLOPT6                                                  00928000
RPLRSV67 EQU   RPLOPT6                                                  00929000
RPLLOCK  EQU   RPLOPT6                                                  00930000
RPLNCOND EQU   RPLOPT6                                                  00931000
RPLCOND  EQU   RPLOPT6                                                  00932000
RPLEOT   EQU   RPLUNTYP                                                 00933000
RPLEOM   EQU   RPLUNTYP                                                 00934000
RPLEOB   EQU   RPLUNTYP                                                 00935000
RPLWROPT EQU   RPLOPT5                                                  00936000
RPLNODE  EQU   RPLOPT5                                                  00937000
RPLERACE EQU   RPLWRTYP                                                 00938000
RPLEAU   EQU   RPLWRTYP                                                 00939000
RPLNERAS EQU   RPLWRTYP                                                 00940000
RPLPSOPT EQU   RPLOPT5                                                  00941000
@NM00026 EQU   RPLOPT5                                                  00942000
RPLDLGIN EQU   RPLOPT5                                                  00943000
RPLBUFL  EQU   RPLCOMN+52                                               00944000
RPLRLEN  EQU   RPLCOMN+48                                               00945000
RPLCHAIN EQU   RPLNXTRP                                                 00946000
@NM00025 EQU   RPLOPT4                                                  00947000
RPLMKFRM EQU   RPLOPT4                                                  00948000
RPLENDTR EQU   RPLOPT4                                                  00949000
RPLALIGN EQU   RPLOPT3                                                  00950000
RPLFMT   EQU   RPLOPT3                                                  00951000
RPLFLD   EQU   RPLOPT3                                                  00952000
RPLVFY   EQU   RPLOPT3                                                  00953000
RPLBLK   EQU   RPLOPT3                                                  00954000
RPLSFORM EQU   RPLOPT3                                                  00955000
RPLEODS  EQU   RPLOPT3                                                  00956000
RPLNSP   EQU   RPLOPT2                                                  00957000
RPLUPD   EQU   RPLOPT2                                                  00958000
RPLWAITX EQU   RPLOPT2                                                  00959000
RPLLRD   EQU   RPLOPT2                                                  00960000
RPLBWD   EQU   RPLOPT2                                                  00961000
RPLCNV   EQU   RPLOPT2                                                  00962000
RPLADD   EQU   RPLADR                                                   00963000
RPLKEY   EQU   RPLOPT2                                                  00964000
RPLECBIN EQU   RPLECBSW                                                 00965000
RPLGEN   EQU   RPLOPT1                                                  00966000
RPLKGE   EQU   RPLOPT1                                                  00967000
RPLASY   EQU   RPLOPT1                                                  00968000
RPLSKP   EQU   RPLOPT1                                                  00969000
RPLSEQ   EQU   RPLOPT1                                                  00970000
RPLDIR   EQU   RPLOPT1                                                  00971000
RPLLOC   EQU   RPLOPT1                                                  00972000
RPLDAF   EQU   RPLARG+2                                                 00973000
RPLSAF   EQU   RPLARG                                                   00974000
RPLTCBPT EQU   RPLCOMN+28                                               00975000
RPLDACB  EQU   RPLCOMN+24                                               00976000
RPLCCHAR EQU   RPLCOMN+20                                               00977000
RPLSTRID EQU   RPLCOMN+18                                               00978000
RPLKEYL  EQU   RPLKEYLE                                                 00979000
RPLRDSOH EQU   RPLFDB3                                                  00980000
RPLRLG   EQU   RPLFDB3                                                  00981000
RPLLGFRC EQU   RPLFDB3                                                  00982000
RPLREOT  EQU   RPLFDB3                                                  00983000
RPLREOM  EQU   RPLFDB3                                                  00984000
RPLREOB  EQU   RPLFDB3                                                  00985000
RPLSV32  EQU   RPLFDB3                                                  00986000
RPLUINPT EQU   RPLFDB3                                                  00987000
RPLSTSAV EQU   RPLFDB2                                                  00988000
RPLCUERR EQU   RPLFDB2                                                  00989000
RPLDLGFL EQU   RPLFDB2                                                  00990000
RPLIOERR EQU   RPLFDB2                                                  00991000
RPLDVUNS EQU   RPLFDB2                                                  00992000
RPLATND  EQU   RPLFDB2                                                  00993000
RPLRVID  EQU   RPLFDB2                                                  00994000
RPLERLK  EQU   RPLFDB2                                                  00995000
RPLERREG EQU   RPLRTNCD                                                 00996000
RPLSTAT  EQU   RPLFDBWD                                                 00997000
RPLPOST  EQU   RPLECB                                                   00998000
RPLWAIT  EQU   RPLECB                                                   00999000
RPLPLHPT EQU   RPLCOMN+4                                                01000000
RPLLEN2  EQU   RPLLEN                                                   01001000
RPLREQ   EQU   RPLIDWD+2                                                01002000
RPLSTYP  EQU   RPLIDWD+1                                                01003000
RPLID    EQU   RPLIDWD                                                  01004000
ASCBEND  EQU   ASCB+208                                                 01005000
ASCBSRBT EQU   ASCB+200                                                 01006000
ASCBSWTL EQU   ASCB+196                                                 01007000
ASCBRS14 EQU   ASCB+195                                                 01008000
ASCBSMCT EQU   ASCB+194                                                 01009000
ASCBRS12 EQU   ASCB+192                                                 01010000
ASCBPCTT EQU   ASCB+188                                                 01011000
ASCBVGTT EQU   ASCB+184                                                 01012000
ASCBRV43 EQU   ASCBSRQ4                                                 01013000
ASCBRV42 EQU   ASCBSRQ4                                                 01014000
ASCBRV41 EQU   ASCBSRQ4                                                 01015000
ASCBRV40 EQU   ASCBSRQ4                                                 01016000
ASCBRV39 EQU   ASCBSRQ4                                                 01017000
ASCBRV38 EQU   ASCBSRQ4                                                 01018000
ASCBRV37 EQU   ASCBSRQ4                                                 01019000
ASCBRV36 EQU   ASCBSRQ4                                                 01020000
ASCBRV35 EQU   ASCBSRQ3                                                 01021000
ASCBRV34 EQU   ASCBSRQ3                                                 01022000
ASCBRV33 EQU   ASCBSRQ3                                                 01023000
ASCBRV32 EQU   ASCBSRQ3                                                 01024000
ASCBRV31 EQU   ASCBSRQ3                                                 01025000
ASCBRV30 EQU   ASCBSRQ3                                                 01026000
ASCBRV29 EQU   ASCBSRQ3                                                 01027000
ASCBRV28 EQU   ASCBSRQ3                                                 01028000
ASCBRV27 EQU   ASCBSRQ2                                                 01029000
ASCBRV26 EQU   ASCBSRQ2                                                 01030000
ASCBRV25 EQU   ASCBSRQ2                                                 01031000
ASCBRV24 EQU   ASCBSRQ2                                                 01032000
ASCBRV23 EQU   ASCBSRQ2                                                 01033000
ASCBRV22 EQU   ASCBSRQ2                                                 01034000
ASCBRV21 EQU   ASCBSRQ2                                                 01035000
ASCBRV20 EQU   ASCBSRQ2                                                 01036000
ASCBRV19 EQU   ASCBSRQ1                                                 01037000
ASCBRV18 EQU   ASCBSRQ1                                                 01038000
ASCBRV17 EQU   ASCBSRQ1                                                 01039000
ASCBRV16 EQU   ASCBSRQ1                                                 01040000
ASCBRV15 EQU   ASCBSRQ1                                                 01041000
ASCBRV14 EQU   ASCBSRQ1                                                 01042000
ASCBRV13 EQU   ASCBSRQ1                                                 01043000
ASCBSTA  EQU   ASCBSRQ1                                                 01044000
ASCBJBNS EQU   ASCB+176                                                 01045000
ASCBJBNI EQU   ASCB+172                                                 01046000
ASCBMCC  EQU   ASCB+168                                                 01047000
ASCBRTWA EQU   ASCB+164                                                 01048000
ASCBIQEA EQU   ASCB+160                                                 01049000
ASCBXMPQ EQU   ASCB+156                                                 01050000
ASCBRS01 EQU   ASCB+154                                                 01051000
ASCBFMCT EQU   ASCB+152                                                 01052000
ASCBOUXB EQU   ASCB+148                                                 01053000
ASCBOUCB EQU   ASCB+144                                                 01054000
ASCBMECB EQU   ASCB+140                                                 01055000
ASCBQECB EQU   ASCB+136                                                 01056000
ASCBLSQH EQU   ASCBLKGP+4                                               01057000
ASCBLOCK EQU   ASCBLKGP                                                 01058000
ASCBTCBS EQU   ASCB+124                                                 01059000
ASCBNVSC EQU   ASCB+122                                                 01060000
ASCBVSC  EQU   ASCB+120                                                 01061000
ASCBSRBS EQU   ASCB+118                                                 01062000
ASCBSSRB EQU   ASCB+116                                                 01063000
ASCBRV06 EQU   ASCBFLG2                                                 01064000
ASCBRV05 EQU   ASCBFLG2                                                 01065000
ASCBRV04 EQU   ASCBFLG2                                                 01066000
ASCBSNQS EQU   ASCBFLG2                                                 01067000
ASCBS2S  EQU   ASCBFLG2                                                 01068000
ASCBCEXT EQU   ASCBFLG2                                                 01069000
ASCBPXMT EQU   ASCBFLG2                                                 01070000
ASCBXMPT EQU   ASCBFLG2                                                 01071000
ASCBRF07 EQU   ASCBDSP1                                                 01072000
ASCBRF06 EQU   ASCBDSP1                                                 01073000
ASCBRF05 EQU   ASCBDSP1                                                 01074000
ASCBRF04 EQU   ASCBDSP1                                                 01075000
ASCBRF03 EQU   ASCBDSP1                                                 01076000
ASCBRF02 EQU   ASCBDSP1                                                 01077000
ASCBFAIL EQU   ASCBDSP1                                                 01078000
ASCBNOQ  EQU   ASCBDSP1                                                 01079000
ASCBSWCT EQU   ASCB+112                                                 01080000
ASCBASXB EQU   ASCB+108                                                 01081000
ASCBTMCH EQU   ASCB+104                                                 01082000
ASCBNSWP EQU   ASCBFLG1                                                 01083000
ASCBTYP1 EQU   ASCBFLG1                                                 01084000
ASCBSTND EQU   ASCBFLG1                                                 01085000
ASCBABNT EQU   ASCBFLG1                                                 01086000
ASCBTERM EQU   ASCBFLG1                                                 01087000
ASCBS3S  EQU   ASCBFLG1                                                 01088000
ASCBCMSH EQU   ASCBFLG1                                                 01089000
ASCBTOFF EQU   ASCBFLG1                                                 01090000
ASCBRF01 EQU   ASCBRCTF                                                 01091000
ASCBTMLW EQU   ASCBRCTF                                                 01092000
ASCBOUT  EQU   ASCBRCTF                                                 01093000
ASCBWAIT EQU   ASCBRCTF                                                 01094000
ASCBRV08 EQU   ASCBRCTF                                                 01095000
ASCBFQU  EQU   ASCBRCTF                                                 01096000
ASCBFRS  EQU   ASCBRCTF                                                 01097000
ASCBTMNO EQU   ASCBRCTF                                                 01098000
ASCBAFFN EQU   ASCBFW1                                                  01099000
ASCBDUMP EQU   ASCB+96                                                  01100000
ASCBQSVC EQU   ASCB+92                                                  01101000
ASCBUBET EQU   ASCB+88                                                  01102000
ASCBECB  EQU   ASCB+84                                                  01103000
ASCBJSTL EQU   ASCB+80                                                  01104000
ASCBEWST EQU   ASCB+72                                                  01105000
ASCBEJST EQU   ASCB+64                                                  01106000
ASCBCSCB EQU   ASCB+56                                                  01107000
ASCBRSM  EQU   ASCB+52                                                  01108000
ASCBLDA  EQU   ASCB+48                                                  01109000
ASCBSTOR EQU   ASCB+44                                                  01110000
ASCBDP   EQU   ASCB+43                                                  01111000
ASCBRV07 EQU   ASCB+42                                                  01112000
ASCBIOSM EQU   ASCB+40                                                  01113000
ASCBSEQN EQU   ASCB+38                                                  01114000
ASCBASID EQU   ASCB+36                                                  01115000
ASCBCPUS EQU   ASCB+32                                                  01116000
ASCBSPL  EQU   ASCB+28                                                  01117000
ASCBIOSP EQU   ASCB+24                                                  01118000
ASCBSYNC EQU   ASCBSUPC+4                                               01119000
ASCBSVRB EQU   ASCBSUPC                                                 01120000
ASCBCMSF EQU   ASCB+12                                                  01121000
ASCBBWDP EQU   ASCB+8                                                   01122000
ASCBFWDP EQU   ASCB+4                                                   01123000
ASCBASCB EQU   ASCB                                                     01124000
ASCBEGIN EQU   ASCB                                                     01125000
@NM00024 EQU   PSA+3668                                                 01126000
PSASTAK  EQU   PSA+3072                                                 01127000
@NM00023 EQU   PSA+1048                                                 01128000
PSAUSEND EQU   PSA+1048                                                 01129000
PSARV062 EQU   PSA+1044                                                 01130000
PSACDAL  EQU   PSA+1040                                                 01131000
PSAWTCOD EQU   PSA+1036                                                 01132000
PSAATCVT EQU   PSA+1032                                                 01133000
PSAPCPSW EQU   PSA+1024                                                 01134000
PSAPIR2  EQU   PSA+1020                                                 01135000
PSARV059 EQU   PSA+1018                                                 01136000
PSASVC13 EQU   PSA+1016                                                 01137000
PSALSFCC EQU   PSA+1012                                                 01138000
PSASFACC EQU   PSA+1008                                                 01139000
PSASTOP  EQU   PSA+992                                                  01140000
PSASTART EQU   PSA+976                                                  01141000
PSARSPSW EQU   PSA+968                                                  01142000
PSASRPSW EQU   PSA+960                                                  01143000
PSARV045 EQU   PSA+892                                                  01144000
PSARV044 EQU   PSA+888                                                  01145000
PSARV043 EQU   PSA+884                                                  01146000
PSARV042 EQU   PSA+880                                                  01147000
PSARV041 EQU   PSA+876                                                  01148000
PSARV040 EQU   PSA+872                                                  01149000
PSARV025 EQU   PSA+868                                                  01150000
PSADSSED EQU   PSA+868                                                  01151000
PSADSSPR EQU   PSA+864                                                  01152000
PSADSSFW EQU   PSA+860                                                  01153000
PSADSS14 EQU   PSA+856                                                  01154000
PSADSSPP EQU   PSA+848                                                  01155000
PSADSSRP EQU   PSA+840                                                  01156000
PSADSS05 EQU   PSADSSF4                                                 01157000
PSADSS10 EQU   PSADSSF4                                                 01158000
PSADSSVE EQU   PSADSSF4                                                 01159000
PSADSSDE EQU   PSADSSF4                                                 01160000
PSADSSC0 EQU   PSADSSF4                                                 01161000
PSADSSIE EQU   PSADSSF4                                                 01162000
PSADSS12 EQU   PSADSSF4                                                 01163000
PSADSSRC EQU   PSADSSF4                                                 01164000
PSARV057 EQU   PSADSSF3                                                 01165000
PSARV056 EQU   PSADSSF3                                                 01166000
PSARV055 EQU   PSADSSF3                                                 01167000
PSADSSMC EQU   PSADSSF3                                                 01168000
PSADSSRW EQU   PSADSSF3                                                 01169000
PSADSSNM EQU   PSADSSF3                                                 01170000
PSADSSES EQU   PSADSSF3                                                 01171000
PSADSSGP EQU   PSADSSF3                                                 01172000
PSADSSF2 EQU   PSADSSFL+1                                               01173000
PSADSSPI EQU   PSADSSF1                                                 01174000
PSADSSOI EQU   PSADSSF1                                                 01175000
PSADSSSP EQU   PSADSSF1                                                 01176000
PSADSSTP EQU   PSADSSF1                                                 01177000
PSADSSDW EQU   PSADSSF1                                                 01178000
PSADSSDD EQU   PSADSSF1                                                 01179000
PSADSSDM EQU   PSADSSF1                                                 01180000
PSADSSMV EQU   PSADSSF1                                                 01181000
PSADSSTS EQU   PSA+816                                                  01182000
PSADSSWK EQU   PSA+812                                                  01183000
PSADSSR3 EQU   PSA+808                                                  01184000
PSADSSR2 EQU   PSA+804                                                  01185000
PSADSSRS EQU   PSA+800                                                  01186000
PSASTOR  EQU   PSA+796                                                  01187000
PSACPUSA EQU   PSA+794                                                  01188000
PSAVSTAP EQU   PSA+792                                                  01189000
PSAWKVAP EQU   PSA+788                                                  01190000
PSAWKRAP EQU   PSA+784                                                  01191000
PSAMCHIC EQU   PSA+783                                                  01192000
PSARV061 EQU   PSA+782                                                  01193000
PSASYMSK EQU   PSA+781                                                  01194000
PSAMCHFL EQU   PSA+780                                                  01195000
PSACR0   EQU   PSA+776                                                  01196000
PSAPSWSV EQU   PSA+768                                                  01197000
PSALITA  EQU   PSA+764                                                  01198000
PSACLHS  EQU   PSAHLHI                                                  01199000
PSALKR15 EQU   PSALKSA+60                                               01200000
PSALKR14 EQU   PSALKSA+56                                               01201000
PSALKR13 EQU   PSALKSA+52                                               01202000
PSALKR12 EQU   PSALKSA+48                                               01203000
PSALKR11 EQU   PSALKSA+44                                               01204000
PSALKR10 EQU   PSALKSA+40                                               01205000
PSALKR9  EQU   PSALKSA+36                                               01206000
PSALKR8  EQU   PSALKSA+32                                               01207000
PSALKR7  EQU   PSALKSA+28                                               01208000
PSALKR6  EQU   PSALKSA+24                                               01209000
PSALKR5  EQU   PSALKSA+20                                               01210000
PSALKR4  EQU   PSALKSA+16                                               01211000
PSALKR3  EQU   PSALKSA+12                                               01212000
PSALKR2  EQU   PSALKSA+8                                                01213000
PSALKR1  EQU   PSALKSA+4                                                01214000
PSALKR0  EQU   PSALKSA                                                  01215000
PSARV023 EQU   PSACLHT+52                                               01216000
PSALOCAL EQU   PSACLHT+48                                               01217000
PSACMSL  EQU   PSACLHT+44                                               01218000
PSAOPTL  EQU   PSACLHT+40                                               01219000
PSATPACL EQU   PSACLHT+36                                               01220000
PSATPDNL EQU   PSACLHT+32                                               01221000
PSATPNCL EQU   PSACLHT+28                                               01222000
PSAIOSLL EQU   PSACLHT+24                                               01223000
PSAIOSUL EQU   PSACLHT+20                                               01224000
PSAIOSCL EQU   PSACLHT+16                                               01225000
PSAIOSSL EQU   PSACLHT+12                                               01226000
PSASALCL EQU   PSACLHT+8                                                01227000
PSAASML  EQU   PSACLHT+4                                                01228000
PSADISPL EQU   PSACLHT                                                  01229000
PSASRSA  EQU   PSA+636                                                  01230000
PSARV050 EQU   PSA+634                                                  01231000
PSADSSGO EQU   PSA+633                                                  01232000
PSARECUR EQU   PSA+632                                                  01233000
PSAHLHIS EQU   PSA+628                                                  01234000
PSAIPCSA EQU   PSA+624                                                  01235000
@NM00022 EQU   PSA+621                                                  01236000
PSAIPCDM EQU   PSA+620                                                  01237000
PSAIPCD  EQU   PSA+616                                                  01238000
@NM00021 EQU   PSA+613                                                  01239000
PSAIPCRM EQU   PSA+612                                                  01240000
PSAIPCR  EQU   PSA+608                                                  01241000
PSAMCHEX EQU   PSA+600                                                  01242000
PSAMPSW  EQU   PSA+592                                                  01243000
PSAEXPS2 EQU   PSA+584                                                  01244000
PSAEXPS1 EQU   PSA+576                                                  01245000
PSAPIREG EQU   PSA+572                                                  01246000
PSARSREG EQU   PSA+568                                                  01247000
PSAGPREG EQU   PSA+556                                                  01248000
PSARV022 EQU   PSASUP4                                                  01249000
PSARV021 EQU   PSASUP4                                                  01250000
PSARV020 EQU   PSASUP4                                                  01251000
PSARV019 EQU   PSASUP4                                                  01252000
PSARV018 EQU   PSASUP4                                                  01253000
PSARV017 EQU   PSASUP4                                                  01254000
PSARV016 EQU   PSASUP4                                                  01255000
PSARV015 EQU   PSASUP4                                                  01256000
PSARV014 EQU   PSASUP3                                                  01257000
PSARV013 EQU   PSASUP3                                                  01258000
PSARV012 EQU   PSASUP3                                                  01259000
PSARV011 EQU   PSASUP3                                                  01260000
PSASPR   EQU   PSASUP3                                                  01261000
PSAPSREG EQU   PSASUP3                                                  01262000
PSAPI2   EQU   PSASUP3                                                  01263000
PSAIOSUP EQU   PSASUP3                                                  01264000
PSALCR   EQU   PSASUP2                                                  01265000
PSARTM   EQU   PSASUP2                                                  01266000
PSAACR   EQU   PSASUP2                                                  01267000
PSAIPCE2 EQU   PSASUP2                                                  01268000
PSAIPCES EQU   PSASUP2                                                  01269000
PSAIPCEC EQU   PSASUP2                                                  01270000
PSAGTF   EQU   PSASUP2                                                  01271000
PSAIPCRI EQU   PSASUP2                                                  01272000
PSARV063 EQU   PSASUP1                                                  01273000
PSATCTL  EQU   PSASUP1                                                  01274000
PSADISP  EQU   PSASUP1                                                  01275000
PSALOCK  EQU   PSASUP1                                                  01276000
PSAPI    EQU   PSASUP1                                                  01277000
PSAEXT   EQU   PSASUP1                                                  01278000
PSASVC   EQU   PSASUP1                                                  01279000
PSAIO    EQU   PSASUP1                                                  01280000
PSAANEW  EQU   PSA+544                                                  01281000
PSATOLD  EQU   PSA+540                                                  01282000
PSATNEW  EQU   PSA+536                                                  01283000
PSALCCAR EQU   PSA+532                                                  01284000
PSALCCAV EQU   PSA+528                                                  01285000
PSAPCCAR EQU   PSA+524                                                  01286000
PSAPCCAV EQU   PSA+520                                                  01287000
PSACPULA EQU   PSA+518                                                  01288000
PSACPUPA EQU   PSA+516                                                  01289000
PSAPSA   EQU   PSA+512                                                  01290000
FLCHDEND EQU   PSA+512                                                  01291000
FLCCRSAV EQU   FLCMCLA+280                                              01292000
FLCGRSAV EQU   FLCMCLA+216                                              01293000
FLCFPSAV EQU   FLCMCLA+184                                              01294000
FLCFLA   EQU   FLCMCLA+88                                               01295000
FLCRGNCD EQU   FLCMCLA+84                                               01296000
FLCFSAA  EQU   FLCFSA+1                                                 01297000
@NM00020 EQU   FLCFSA                                                   01298000
@NM00019 EQU   FLCMCLA+72                                               01299000
FLCMCIC  EQU   FLCMCLA+64                                               01300000
@NM00018 EQU   FLCMCLA+20                                               01301000
FLCIOAA  EQU   FLCIOA+1                                                 01302000
@NM00017 EQU   FLCIOA                                                   01303000
@NM00016 EQU   FLCMCLA+15                                               01304000
@NM00015 EQU   FLCMCLA+14                                               01305000
@NM00014 EQU   FLCMCLA+12                                               01306000
FLCLCL   EQU   FLCMCLA+8                                                01307000
FLCIOELA EQU   FLCIOEL+1                                                01308000
@NM00013 EQU   FLCIOEL                                                  01309000
FLCCHNID EQU   FLCMCLA                                                  01310000
@NM00012 EQU   PSA+160                                                  01311000
FLCMTRCD EQU   PSA+157                                                  01312000
@NM00011 EQU   PSA+156                                                  01313000
FLCPERA  EQU   FLCPER+1                                                 01314000
@NM00010 EQU   FLCPER                                                   01315000
@NM00009 EQU   PSA+151                                                  01316000
FLCPERCD EQU   PSA+150                                                  01317000
FLCMCNUM EQU   PSA+149                                                  01318000
@NM00008 EQU   PSA+148                                                  01319000
FLCTEAA  EQU   FLCTEA+1                                                 01320000
@NM00007 EQU   FLCTEA                                                   01321000
PSAPIPC  EQU   PSAPICOD                                                 01322000
PSAPIMC  EQU   PSAPICOD                                                 01323000
PSAPIPER EQU   PSAPICOD                                                 01324000
PSARV049 EQU   FLCPICOD                                                 01325000
FLCPILCB EQU   FLCPIILC                                                 01326000
@NM00006 EQU   FLCPIILC                                                 01327000
@NM00005 EQU   PSAEPPSW                                                 01328000
FLCSVCN  EQU   PSAESPSW+2                                               01329000
FLCSILCB EQU   FLCSVILC                                                 01330000
@NM00004 EQU   FLCSVILC                                                 01331000
@NM00003 EQU   PSAESPSW                                                 01332000
FLCEICOD EQU   PSAEEPSW+2                                               01333000
PSASPAD  EQU   PSAEEPSW                                                 01334000
@NM00002 EQU   PSA+128                                                  01335000
FLCINPSW EQU   PSA+120                                                  01336000
FLCMNPSW EQU   PSA+112                                                  01337000
FLCPNPSW EQU   PSA+104                                                  01338000
FLCSNPSW EQU   PSA+96                                                   01339000
FLCENPSW EQU   PSA+88                                                   01340000
FLCTRACE EQU   PSA+84                                                   01341000
FLCTIMER EQU   PSA+80                                                   01342000
FLCCVT2  EQU   PSA+76                                                   01343000
FLCCAW   EQU   PSA+72                                                   01344000
FLCCSW   EQU   PSA+64                                                   01345000
FLCIOPSW EQU   PSA+56                                                   01346000
FLCMOPSW EQU   PSA+48                                                   01347000
FLCPOPSW EQU   PSA+40                                                   01348000
FLCSOPSW EQU   PSA+32                                                   01349000
FLCEOPSW EQU   PSA+24                                                   01350000
@NM00001 EQU   FLCICCW2+4                                               01351000
FLCCVT   EQU   FLCICCW2                                                 01352000
FLCICCW1 EQU   FLCROPSW                                                 01353000
FLCIPPSW EQU   FLCRNPSW                                                 01354000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01355000
@RT00149 EQU   #BCM0002                                                 01356000
@ENDDATA EQU   *                                                        01357000
         END   IKTRPLXT,(C'PLS2018',0702,80232)                         01358000
