SVTM     TITLE 'ISTAUCAG - CSC ACCOUNTING EXIT DUMMY ROUTINE'           00001000
ISTAUCAG CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTAUCAG  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  ST    @14,12(,@13)                                        0001 00009000
         STM   @00,@12,20(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
*   RETURN CODE(CAGRTVAL);          /* SET RTRN CODE AND           0003 00014000
*                                      RETURN TO CALLER              */ 00015000
*                                                                  0003 00016000
         SLR   @15,@15                                             0003 00017000
@EL00001 DS    0H                                                  0003 00018000
@EF00001 DS    0H                                                  0003 00019000
@ER00001 L     @14,12(,@13)                                        0003 00020000
         LM    @00,@12,20(@13)                                     0003 00021000
         BR    @14                                                 0003 00022000
*   END ISTAUCAG;                                                  0004 00023000
@DATA    DS    0H                                                       00024000
@DATD    DSECT                                                          00025000
         DS    0F                                                       00026000
ISTAUCAG CSECT                                                          00027000
         DS    0F                                                       00028000
@DATD    DSECT                                                          00029000
         DS    0D                                                       00030000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00031000
@ENDDATD EQU   *                                                        00032000
ISTAUCAG CSECT                                                          00033000
         DS    0F                                                       00034000
@SIZDATD DC    AL1(0)                                                   00035000
         DC    AL3(@ENDDATD-@DATD)                                      00036000
         DS    0D                                                       00037000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00038000
@01      EQU   01                                                       00039000
@02      EQU   02                                                       00040000
@03      EQU   03                                                       00041000
@04      EQU   04                                                       00042000
@05      EQU   05                                                       00043000
@06      EQU   06                                                       00044000
@07      EQU   07                                                       00045000
@08      EQU   08                                                       00046000
@09      EQU   09                                                       00047000
@10      EQU   10                                                       00048000
@11      EQU   11                                                       00049000
@12      EQU   12                                                       00050000
@13      EQU   13                                                       00051000
@14      EQU   14                                                       00052000
@15      EQU   15                                                       00053000
CAGBASER EQU   @12                                                      00054000
CAGRTREG EQU   @15                                                      00055000
@ENDDATA EQU   *                                                        00056000
         END   ISTAUCAG,(C'PLS2023',0702,80232)                         00057000
