         TITLE 'RESOURCE MANAGER-ISTCC014'                              00001000
*         IBM DISK OPERATING SYSTEM                                     00002000
*         TOLTEP-5745-SC-TLT                                            00003000
          ISEQ 73,80                                                    00004000
ISTCC014 CSECT ,                                                   0002 00005000
@MAINENT DS    0H                                                  0002 00006000
         USING *,@15                                               0002 00007000
         B     @PROLOG                                             0002 00008000
         DC    AL1(16)                                             0002 00009000
         DC    C'ISTCC014  80.158'                                 0002 00010000
         DROP  @15                                                      00011000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00012000
         BALR  @12,0                                               0002 00013000
@PSTART  DS    0H                                                  0002 00014000
         USING @PSTART,@12                                         0002 00015000
         ST    @13,@SA00001+4                                      0002 00016000
         LA    @14,@SA00001                                        0002 00017000
         ST    @14,8(,@13)                                         0002 00018000
         LR    @13,@14                                             0002 00019000
         PRINT OFF                                                      00020000
         PRINT ON                                                       00021000
         PRINT OFF                                                      00022000
         PRINT ON                                                       00023000
*                                                                  0100 00024000
*/********************************************************************  00025000
*                                                                    */ 00026000
*/*      SAVE  CALLERS REG 13 IN T.W.A                               */ 00027000
*/********************************************************************/ 00028000
*                                                                  0101 00029000
*   BASEREG=R12;                    /* SVEBASE REG FOR C14C0020      */ 00030000
         ST    R12,BASEREG                                         0101 00031000
*   SAVEDR13=R13;                   /* SAVE FOR LATER        @DA04678*/ 00032000
         ST    R13,SAVEDR13                                        0102 00033000
*   GEN;                                                           0103 00034000
         L     R4,L4(R13)               /* PICK UP CALLERS SAVE REG  */ 00035000
L4        EQU   4                                                       00036000
L12      EQU   12                                                       00037000
L16       EQU   16                                                      00038000
L20       EQU   20                                                      00039000
*   IF $TEP2ND='1'B                 /* IS THIS THIRD PASS THOUGH     */ 00040000
*     THEN                                                         0104 00041000
         TM    $TEP2ND(WAPTR),B'00000001'                          0104 00042000
         BNO   @RF00104                                            0104 00043000
*     DO;                                                          0105 00044000
*       $TEP3RD='1'B;               /* SET 3RD IND                   */ 00045000
         OI    $TEP3RD(WAPTR),B'10000000'                          0106 00046000
*       $R13PR3=R4;                 /* SAVE RETURN REG               */ 00047000
         ST    R4,$R13PR3(,WAPTR)                                  0107 00048000
*     END;                                                         0108 00049000
*   ELSE                            /* IF NOT 3RD CHK FOR 2ND/1ST    */ 00050000
*     IF $TEP1ST='1'B               /* IS THIS A CALL FROM           */ 00051000
*       THEN                        /* TOLTEP AS A RESULT OF AN      */ 00052000
         B     @RC00104                                            0109 00053000
@RF00104 TM    $TEP1ST(WAPTR),B'00000010'                          0109 00054000
         BNO   @RF00109                                            0109 00055000
*       DO;                         /* OLT MACRO CALL                */ 00056000
*         $R13PTRT=R4;              /* IF YES SAVE R13 IN DIFFT      */ 00057000
         ST    R4,$R13PTRT(,WAPTR)                                 0111 00058000
*         $TEP2ND='1'B;             /* AREA & SET RECALL BIT ON      */ 00059000
         OI    $TEP2ND(WAPTR),B'00000001'                          0112 00060000
*       END;                                                       0113 00061000
*     ELSE                          /* IF NOT THE SECOND PASS        */ 00062000
*       DO;                         /* THRU SAVE R13 IN NORMAL       */ 00063000
         B     @RC00109                                            0114 00064000
@RF00109 DS    0H                                                  0115 00065000
*         $R13PTR=R4;               /* SPOT                          */ 00066000
         ST    R4,$R13PTR(,WAPTR)                                  0115 00067000
*         $TEP1ST='1'B;             /* SET ON FIRST CALL BIT         */ 00068000
         OI    $TEP1ST(WAPTR),B'00000010'                          0116 00069000
*         IF $TCECM='0'B&           /* TEST FOR 1ST OLT OR           */ 00070000
*             FLAGS='00'X           /* TCEC CALL                     */ 00071000
*           THEN                    /* IF OLT CALL SET BIT ON        */ 00072000
         TM    $TCECM(WAPTR),B'00000001'                           0117 00073000
         BNZ   @RF00117                                            0117 00074000
         CLI   FLAGS(R1),X'00'                                     0117 00075000
         BNE   @RF00117                                            0117 00076000
*           $OLTMACC='1'B;                                         0118 00077000
         OI    $OLTMACC(WAPTR),B'00100000'                         0118 00078000
*         ELSE                      /* IF NO SET BIT OFF             */ 00079000
*           $OLTMACC='0'B;                                         0119 00080000
         B     @RC00117                                            0119 00081000
@RF00117 NI    $OLTMACC(WAPTR),B'11011111'                         0119 00082000
*       END;                                                       0120 00083000
@RC00117 DS    0H                                                  0121 00084000
*   R3=$RCA;                        /* GET PTR TO RES.COMM.AREA      */ 00085000
@RC00109 DS    0H                                                  0121 00086000
@RC00104 L     R3,$RCA(,WAPTR)                                     0121 00087000
*   $INBND='1'B;                    /* SET INBOUND SWITCH            */ 00088000
         OI    $INBND(WAPTR),B'00100000'                           0122 00089000
*   R2=SAVEDR2;                     /* RESET*R2*TO*LAST*USED******   */ 00090000
         L     R2,SAVEDR2                                          0123 00091000
*   IF R2^=0                        /* IF*ZERO*START*OVER*AGAIN***   */ 00092000
*     THEN                          /* IF*NOT*ZERO*START*WHERE****   */ 00093000
         LTR   R2,R2                                               0124 00094000
         BNZ   @RT00124                                            0124 00095000
*     GOTO C14C0002;                /* LAST*LEFT*OFF**************   */ 00096000
*C14C0001:                                                         0126 00097000
*   ;                                                              0126 00098000
C14C0001 DS    0H                                                  0127 00099000
*   R2=$FSTAREA;                    /* SET R2 TO BASE OF T.W.A.      */ 00100000
         L     R2,$FSTAREA(,RCAPTR)                                0127 00101000
*   IF R2=0 THEN                                                   0128 00102000
         LTR   R2,R2                                               0128 00103000
         BNZ   @RF00128                                            0128 00104000
*     DO;                           /* IF NO TWA, THEN PROCESS IS  0129 00105000
*                                      ENDING AND WE SHOULD EXIT.  0129 00106000
*                                                            @XA15990*/ 00107000
*       R13=SAVEDR13;               /* RESTORE R13           @XA15990*/ 00108000
         L     R13,SAVEDR13                                        0130 00109000
*       RETURN;                     /* RETURN TO CALLER      @XA15990*/ 00110000
@EL00001 L     @13,4(,@13)                                         0131 00111000
@EF00001 DS    0H                                                  0131 00112000
@ER00001 LM    @14,@12,12(@13)                                     0131 00113000
         BR    @14                                                 0131 00114000
*     END;                          /*                       @XA15990*/ 00115000
*   BUSYCNT=0;                      /* SET BUSY COUNT BACK TO ZERO   */ 00116000
@RF00128 SLR   @11,@11                                             0133 00117000
         STH   @11,BUSYCNT                                         0133 00118000
*C14C0002:                                                         0134 00119000
*   ;                                                              0134 00120000
C14C0002 DS    0H                                                  0135 00121000
*   $CURRTWA=R2;                    /* SAVE CURRENT USER ADDRESS     */ 00122000
         ST    R2,$CURRTWA(,RCAPTR)                                0135 00123000
*   R15=R13;                        /* SAVE CALLERS SAVE REG         */ 00124000
         LR    R15,R13                                             0136 00125000
*   R13=ADDR(SVECC014(1));          /* PICK UP MY SAVE REG AREA      */ 00126000
         LA    R13,SVECC014(,WAPTR)                                0137 00127000
*   SVECC014(2)=R15;                /* CHAIN AREAS TOGETHER          */ 00128000
         ST    R15,SVECC014+4(,WAPTR)                              0138 00129000
*   BACKSAVE(3)=R13;                                               0139 00130000
         ST    R13,BACKSAVE+8(,R15)                                0139 00131000
*   R4=ATCLCPTR;                    /*                        @MAK4WX*/ 00132000
         L     R4,ATCLCPTR                                         0140 00133000
*   RESPECIFY                                                      0141 00134000
*     ISTATCVT BASED(R4);                                          0141 00135000
*   IF ATCMTST='1'B                 /* ** IS A CONSOLE INIT WANTED   */ 00136000
*     THEN                          /* ** IF YES GOTO SIM LOGON      */ 00137000
         TM    ATCMTST(R4),B'10000000'                             0142 00138000
         BNO   @RF00142                                            0142 00139000
*     DO;                           /* **                            */ 00140000
*       ATCECTLP=0;                 /* SET ECB TO 0                  */ 00141000
         SLR   @11,@11                                             0144 00142000
         ST    @11,ATCECTLP(,R4)                                   0144 00143000
*       CALL I00C0070;              /* ** I00C0070                   */ 00144000
         L     @15,@CV01959                                        0145 00145000
         BALR  @14,@15                                             0145 00146000
*/***** FOLOWING LINE DELETED BY APAR 0X23476 OZ38432 DY20612  ****  */ 00147000
*/*                   ATCMTST='0'B                                   */ 00148000
*                                                                  0146 00149000
*     END;                                                         0146 00150000
*   R14=ADDR(C14C0004);             /* SET RETURN ADDRESS            */ 00151000
@RF00142 LA    R14,C14C0004                                        0147 00152000
*   IF $HOLD='1'B                   /* CHECK TO STOP SCHEDULING      */ 00153000
*     THEN                          /* IF BIT ON SKIP THIS TEST      */ 00154000
         TM    $HOLD(WAPTR),B'00000001'                            0148 00155000
         BO    @RT00148                                            0148 00156000
*     GOTO C14C0004;                                               0149 00157000
*   IF $EOJ='1'B&                   /* IF CANCEL,LOGOFF,CT I/O ER    */ 00158000
*       $LOGOFFE='0'B&              /* & LOGOFF ROUT NOT ENTERED     */ 00159000
*       $ABTERM='0'B                /* & ABTERM ROUT NOT ENTERED     */ 00160000
*     THEN                          /* BIT WILL BE ON AND TEST IS    */ 00161000
         TM    $EOJ(WAPTR),B'00000010'                             0150 00162000
         BNO   @RF00150                                            0150 00163000
         TM    $LOGOFFE(WAPTR),B'00100000'                         0150 00164000
         BNZ   @RF00150                                            0150 00165000
         TM    $ABTERM(WAPTR),B'00000010'                          0150 00166000
         BNZ   @RF00150                                            0150 00167000
*     DO;                           /* TO BE DROPPED                 */ 00168000
*       R15=ADDR(C14C0020);         /* EXIT TO LOGOFF                */ 00169000
         LA    R15,C14C0020                                        0152 00170000
*       GEN(BR    R15);             /* ROUTINE TO EXIT               */ 00171000
         BR    R15                                                      00172000
*     END;                                                         0154 00173000
*   IF $EXIOWAT='1'B                /* FOR ALL API REQ               */ 00174000
*     THEN                          /* TO BE RETURNED                */ 00175000
@RF00150 TM    $EXIOWAT(WAPTR),B'00100000'                         0155 00176000
         BNO   @RF00155                                            0155 00177000
*     DO;                           /* BY VTAM IF YES                */ 00178000
*       R4=$R13PTR;                 /* GIVE CONTROL BK               */ 00179000
         L     R4,$R13PTR(,WAPTR)                                  0157 00180000
*       GEN(LM    R0,R1,L20(R4));   /* TO EXIO AFTER                 */ 00181000
         LM    R0,R1,L20(R4)                                            00182000
*       R14=ADDR(C14C0007);         /* RESETTING R0 &                */ 00183000
         LA    R14,C14C0007                                        0159 00184000
*       R15=ADDR(ISTSC027);         /* R1                            */ 00185000
         L     R15,@CV01971                                        0160 00186000
*       GEN(BR    R15);             /*                               */ 00187000
         BR    R15                                                      00188000
*     END;                          /*                               */ 00189000
*   IF $REQSTOR='1'B                /* IS SOMEONE WAITING FOR        */ 00190000
*     THEN                          /* STORAGE YES GO TRY AGAIN      */ 00191000
@RF00155 TM    $REQSTOR(WAPTR),B'00010000'                         0163 00192000
         BO    @RT00163                                            0163 00193000
*     GOTO C14C0035;                /* TO GET IT                     */ 00194000
*   IF $ENDTEST='1'B                /* WAS A VARY DETECTED           */ 00195000
*     THEN                          /* FOR THIS TEST IF YES          */ 00196000
         TM    $ENDTEST(WAPTR),B'00001000'                         0165 00197000
         BNO   @RF00165                                            0165 00198000
*     DO;                           /* RESET ALL BITS SO TO          */ 00199000
*       $TEP1ST='0'B;               /* SIMULATE A CANCEL             */ 00200000
*       $TEP2ND='0'B;               /* TEST TO STOP HERE &           */ 00201000
         NI    $TEP1ST(WAPTR),B'11111100'                          0168 00202000
*       $TEP3RD='0'B;               /* GO BACK FOR 105D-ASIF         */ 00203000
         NI    $TEP3RD(WAPTR),B'01111111'                          0169 00204000
*       $REQSTOR='0'B;              /* OLT ISSUED A DTERM            */ 00205000
         NI    $REQSTOR(WAPTR),B'11101111'                         0170 00206000
*       $ENDTEST='0'B;              /*                               */ 00207000
         NI    $ENDTEST(WAPTR),B'11110111'                         0171 00208000
*       $OLTMACC='0'B;              /*                               */ 00209000
         NI    $OLTMACC(WAPTR),B'11011111'                         0172 00210000
*       $ACTOPND='0'B;                                             0173 00211000
*       $CLSSACT='0'B;                                             0174 00212000
         NI    $ACTOPND(WAPTR),B'11111010'                         0174 00213000
*       $WAITFLG='0'B;                                             0175 00214000
         NI    $WAITFLG(WAPTR),B'10111111'                         0175 00215000
*       $POSTFLG='0'B;                                             0176 00216000
         NI    $POSTFLG(WAPTR),B'10111111'                         0176 00217000
*       $CIREQ='0'B;                /*                               */ 00218000
         NI    $CIREQ(WAPTR),B'11111110'                           0177 00219000
*       $SNDRFLG='0'B;              /* WAITING ON SEND        @DM0908*/ 00220000
*       $RCVRFLG='0'B;              /* WAITING ON RECEIVE     @DM0908*/ 00221000
         NI    $SNDRFLG(WAPTR),B'11111001'                         0179 00222000
*       $VARYINP='1'B;              /* SET ON VARY IN PROC           */ 00223000
         OI    $VARYINP(WAPTR),B'00000100'                         0180 00224000
*       R0=4;                       /* BIT                           */ 00225000
         LA    R0,4                                                0181 00226000
*       R15=ADDR(ISTCC010);         /* GOTO DTERM                    */ 00227000
         L     R15,@CV01957                                        0182 00228000
*       GEN(BR    R15);             /*                               */ 00229000
         BR    R15                                                      00230000
*     END;                          /*                               */ 00231000
*   IF $ACTOPND='1'B                /* TEST IS OPEN PENDING          */ 00232000
*     THEN                          /* IF YES GOTO S30C1000 FOR      */ 00233000
@RF00165 TM    $ACTOPND(WAPTR),B'00000001'                         0185 00234000
         BNO   @RF00185                                            0185 00235000
*     DO;                           /* TIME CHECK                    */ 00236000
*       R14=ADDR(C14C0007);         /* SET RTN POINT                 */ 00237000
         LA    R14,C14C0007                                        0187 00238000
*       R15=ADDR(S30C1000);                                        0188 00239000
         L     R15,@CV01966                                        0188 00240000
*       GEN(BR    R15);                                            0189 00241000
         BR    R15                                                      00242000
*     END;                                                         0190 00243000
*   IF $CLSSACT='1'B THEN                                          0191 00244000
@RF00185 TM    $CLSSACT(WAPTR),B'00000100'                         0191 00245000
         BNO   @RF00191                                            0191 00246000
*     DO;                           /* IF ON, WAIT FOR RELEASE       */ 00247000
*       R14=ADDR(C14C0007);         /* SET RTN POINT                 */ 00248000
         LA    R14,C14C0007                                        0193 00249000
*       R15=ADDR(S31C0480);         /* POINT TO ENTRY POINT          */ 00250000
         L     R15,@CV01967                                        0194 00251000
*       GEN(BR    R15);             /* CALL FUNCTION TO CHECK TIME   */ 00252000
         BR    R15                                                      00253000
*     END;                                                         0196 00254000
*   IF $WAITFLG='1'B                /* IF BIT ON TEST IS WAITING     */ 00255000
*       &$POSTFLG='0'B              /* & NOT BUSY                    */ 00256000
*     THEN                          /* POSSIBLE ON A TIME LOOP       */ 00257000
@RF00191 TM    $WAITFLG(WAPTR),B'01000000'                         0197 00258000
         BNO   @RF00197                                            0197 00259000
         TM    $POSTFLG(WAPTR),B'01000000'                         0197 00260000
         BNZ   @RF00197                                            0197 00261000
*     DO;                           /* EXIT TO WAITIO FOR TIME       */ 00262000
*       CALL S2FC1000;              /* GO TO WAITIO FOR CHECKS       */ 00263000
         L     @15,@CV01961                                        0199 00264000
         BALR  @14,@15                                             0199 00265000
*       IF $WAITFLG='0'B THEN       /* IF WAITIO DONE                */ 00266000
         TM    $WAITFLG(WAPTR),B'01000000'                         0200 00267000
         BZ    @RT00200                                            0200 00268000
*         GO TO C14C006A;                                          0201 00269000
*       GOTO C14C0007;                                             0202 00270000
         B     C14C0007                                            0202 00271000
*     END;                                                         0203 00272000
*C14C0003:                                                         0204 00273000
*   IF $POSTFLG='1'B                /* IF BIT ON TEST IS NOT RDY     */ 00274000
*     THEN                          /* TO SATISFY SOME OUTSTANDNG    */ 00275000
@RF00197 DS    0H                                                  0204 00276000
C14C0003 TM    $POSTFLG(WAPTR),B'01000000'                         0204 00277000
         BO    @RT00204                                            0204 00278000
*     GOTO C14C0004;                /* REQUEST GO ON TO NXT USER     */ 00279000
*   IF $SNDRFLG='1'B|$RCVRFLG='1'B THEN/* RECALL SEND OR RECEIVE   0206 00280000
*                                                            @D32JPFR*/ 00281000
         TM    $SNDRFLG(WAPTR),B'00000110'                         0206 00282000
         BZ    @RF00206                                            0206 00283000
*     DO;                           /* YES                   @D32JPFR*/ 00284000
*       R4=$R13PTR;                 /* OLT SAVE AREA PTR     @D32JPFR*/ 00285000
         L     R4,$R13PTR(,WAPTR)                                  0208 00286000
*       GEN(LM R0,R1,L20(R4));      /* RESTORE REGS          @D32JPFR*/ 00287000
         LM R0,R1,L20(R4)                                               00288000
*       R15=ADDR(ISTSC033);         /* GET ADDR OF RTN TO CALL     0210 00289000
*                                                            @D32JPFR*/ 00290000
         L     R15,@CV01970                                        0210 00291000
*       IF $SNDRFLG='1'B THEN       /* GET ADDR OF RTN TO CALL     0211 00292000
*                                                            @D32JPFR*/ 00293000
         TM    $SNDRFLG(WAPTR),B'00000100'                         0211 00294000
         BNO   @RF00211                                            0211 00295000
*         R15=ADDR(ISTSC025);       /* BAD GUESS, DO OTHER MOD     0212 00296000
*                                                            @D32JPFR*/ 00297000
         L     R15,@CV01969                                        0212 00298000
*       GEN(BALR R14,R15);          /* CALL FUNCTION         @D32JPFR*/ 00299000
@RF00211 DS    0H                                                  0213 00300000
         BALR R14,R15                                                   00301000
*       IF $SNDRFLG='0'B&$RCVRFLG='0'B THEN/* DID THE FUNCTION COMP     00302000
*                                                            @D32JPFR*/ 00303000
         TM    $SNDRFLG(WAPTR),B'00000110'                         0214 00304000
         BZ    @RT00214                                            0214 00305000
*         GO TO C14C006A;           /* YES, REDUCE COUNT     @D32JPFR*/ 00306000
*       GO TO C14C0007;             /* NO, CHECK NEXT USER   @D32JPFR*/ 00307000
         B     C14C0007                                            0216 00308000
*     END;                          /* END OF SEND/RECEIVE RECALL  0217 00309000
*                                                            @D32JPFR*/ 00310000
*   IF $RECAL11='1'B                /* RECALL ISTCC011               */ 00311000
*     THEN                          /* IF YES MSGIO HAS ORIG MSG     */ 00312000
@RF00206 TM    $RECAL11(WAPTR),B'10000000'                         0218 00313000
         BNO   @RF00218                                            0218 00314000
*     DO;                           /* TO PUT OUT                    */ 00315000
*       R13=SAVEDR13;               /* USE ORIG AREA         @DA04678*/ 00316000
         L     R13,SAVEDR13                                        0220 00317000
*       CALL ISTCC011;              /* CALL TO START MSGS    @D32JPFR*/ 00318000
         L     @15,@CV01958                                        0221 00319000
         BALR  @14,@15                                             0221 00320000
*       IF $RECAL11='0'B THEN       /* RECALL ISTCC011 LATER?      0222 00321000
*                                                            @D32JPFR*/ 00322000
         TM    $RECAL11(WAPTR),B'10000000'                         0222 00323000
         BZ    @RT00222                                            0222 00324000
*         GO TO C14C006A;           /* NO,REDUCE COUNT       @D32JPFR*/ 00325000
*       GO TO C14C0007;             /* CHECK NEXT USER       @D32JPFR*/ 00326000
         B     C14C0007                                            0224 00327000
*     END;                                                         0225 00328000
*   IF $TWOWAY='1'B                 /* TEST FOR TWOWAY NEEDED FOR    */ 00329000
*     THEN                          /* ALTERNATE PRINTER             */ 00330000
@RF00218 TM    $TWOWAY(WAPTR),B'01000000'                          0226 00331000
         BNO   @RF00226                                            0226 00332000
*     DO;                           /* IF YES PUT REPLY TO AP        */ 00333000
*       $TWOWAY='0'B;               /* RESET BIT INDICATOR           */ 00334000
         NI    $TWOWAY(WAPTR),B'10111111'                          0228 00335000
*       $COUTAD=$CINADR;            /* SET OUTPUT ADDR               */ 00336000
         L     @11,$CINADR(,WAPTR)                                 0229 00337000
         ST    @11,$COUTAD(,WAPTR)                                 0229 00338000
*       R5=$COUTAD;                 /* SET OUTPUT SIZE               */ 00339000
         LR    R5,@11                                              0230 00340000
*       R5=R5-1;                                                   0231 00341000
         BCTR  R5,0                                                0231 00342000
*       R15=REPLYSZE;                                              0232 00343000
         SLR   R15,R15                                             0232 00344000
         IC    R15,REPLYSZE(,R5)                                   0232 00345000
*       $COUTCT=R15;                                               0233 00346000
         ST    R15,$COUTCT(,WAPTR)                                 0233 00347000
*       $CINADR=0;                  /* SET INDICATOR FOR             */ 00348000
         SLR   @11,@11                                             0234 00349000
         ST    @11,$CINADR(,WAPTR)                                 0234 00350000
*       $CINCT=0;                   /* ONE WAY OUTPUT                */ 00351000
         ST    @11,$CINCT(,WAPTR)                                  0235 00352000
*       $C2WAY='0'B;                                               0236 00353000
         NI    $C2WAY(WAPTR),B'01111111'                           0236 00354000
*       $PRTONLY='1'B;              /* SET ON AP ONLY BIT            */ 00355000
         OI    $PRTONLY(WAPTR),B'00001000'                         0237 00356000
*       R15=ADDR(ISTCC011);         /* GOTO PUT OUT REPLY            */ 00357000
         L     R15,@CV01958                                        0238 00358000
*       GEN(BR    R15);             /* RETURN IN R14 ALRDY           */ 00359000
         BR    R15                                                      00360000
*       GO TO C14C0003;             /* CHECK TO SEE IF WRITE DONE    */ 00361000
         B     C14C0003                                            0240 00362000
*     END;                                                         0241 00363000
*                                                                  0241 00364000
*/********************************************************************/ 00365000
*/*      TEST WORK AREA READY TO USE                                 */ 00366000
*/********************************************************************/ 00367000
*                                                                  0242 00368000
*   IF $INBND='1'B                  /* IS REQUEST FROM OLT/TOLTEP    */ 00369000
*     THEN                          /* FOR SOME SERVICE MACRO        */ 00370000
@RF00226 TM    $INBND(WAPTR),B'00100000'                           0242 00371000
         BNO   @RF00242                                            0242 00372000
*     DO;                           /* I.E. INBOUND IF YES           */ 00373000
*       $INBND='0'B;                /* TURN OFF BIT                  */ 00374000
         NI    $INBND(WAPTR),B'11011111'                           0244 00375000
*       IF $TEP3RD='1'B             /* IS THIS THIRD CALL            */ 00376000
*         THEN                                                     0245 00377000
         TM    $TEP3RD(WAPTR),B'10000000'                          0245 00378000
         BNO   @RF00245                                            0245 00379000
*         R4=$R13PR3;               /* YES GET R4 SET                */ 00380000
         L     R4,$R13PR3(,WAPTR)                                  0246 00381000
*       ELSE                        /* IF NO CHK 2ND/1ST             */ 00382000
*         IF $TEP2ND='1'B           /* IS THIS 2ND CALL              */ 00383000
*           THEN                    /* YES R13 SAVED                 */ 00384000
         B     @RC00245                                            0247 00385000
@RF00245 TM    $TEP2ND(WAPTR),B'00000001'                          0247 00386000
         BNO   @RF00247                                            0247 00387000
*           R4=$R13PTRT;            /* IN DIFF SPOT                  */ 00388000
         L     R4,$R13PTRT(,WAPTR)                                 0248 00389000
*         ELSE                      /* NO SAVED IN NORM              */ 00390000
*           R4=$R13PTR;             /* SPOT                          */ 00391000
         B     @RC00247                                            0249 00392000
@RF00247 L     R4,$R13PTR(,WAPTR)                                  0249 00393000
*       GEN(LM    R0,R1,L20(R4));   /* RESTORE 0,1                   */ 00394000
@RC00247 DS    0H                                                  0250 00395000
@RC00245 DS    0H                                                  0250 00396000
         LM    R0,R1,L20(R4)                                            00397000
*       GOTO C14C0010;              /* EXIT TO MACRO ROUTER          */ 00398000
         B     C14C0010                                            0251 00399000
*     END;                                                         0252 00400000
*   IF $TEP3RD='1'B                 /* IS THIS THIRD CALL            */ 00401000
*     THEN                                                         0253 00402000
@RF00242 TM    $TEP3RD(WAPTR),B'10000000'                          0253 00403000
         BNO   @RF00253                                            0253 00404000
*     DO;                           /* IF YES DO THE FOLLOWING       */ 00405000
*       $TEP3RD='0'B;               /* SET IND OFF                   */ 00406000
         NI    $TEP3RD(WAPTR),B'01111111'                          0255 00407000
*       SVECC014(2)=$R13PR3;        /* SET R13 IN SAVE AREA          */ 00408000
         L     @11,$R13PR3(,WAPTR)                                 0256 00409000
         ST    @11,SVECC014+4(,WAPTR)                              0256 00410000
*       RETURN;                                                    0257 00411000
         B     @EL00001                                            0257 00412000
*     END;                                                         0258 00413000
*   IF $TEP2ND='1'B                 /* IS RTN TO BE TO OLT &/        */ 00414000
*     THEN                          /* CALLER(1ST) OR TO THE         */ 00415000
@RF00253 TM    $TEP2ND(WAPTR),B'00000001'                          0259 00416000
         BNO   @RF00259                                            0259 00417000
*     DO;                           /* 2ND CALLER                    */ 00418000
*       $TEP2ND='0'B;               /* 2ND CALLER SET BIT OFF        */ 00419000
         NI    $TEP2ND(WAPTR),B'11111110'                          0261 00420000
*       SVECC014(2)=$R13PTRT;       /* RESET R13                     */ 00421000
         L     @11,$R13PTRT(,WAPTR)                                0262 00422000
         ST    @11,SVECC014+4(,WAPTR)                              0262 00423000
*       RETURN;                                                    0263 00424000
         B     @EL00001                                            0263 00425000
*     END;                                                         0264 00426000
*   IF $NOTRRCH='0'B                /* IS THIS A RTN FROM DPRINT     */ 00427000
*     THEN                          /* FORMS PRINT OR MULTI LINE     */ 00428000
@RF00259 TM    $NOTRRCH(WAPTR),B'00000010'                         0265 00429000
         BNZ   @RF00265                                            0265 00430000
*     DO;                           /* NO--SEE ABOUT TRACING         */ 00431000
*       IF $OLTMACC='1'B            /* IS RETURN TO BE TRACED        */ 00432000
*         THEN                      /* YES MAYBE IT IS OLT CALL      */ 00433000
         TM    $OLTMACC(WAPTR),B'00100000'                         0267 00434000
         BNO   @RF00267                                            0267 00435000
*         DO;                       /* IF NOT ON EXEC CALL           */ 00436000
*           $OLTMACC='0'B;          /* SET BIT OFF                   */ 00437000
         NI    $OLTMACC(WAPTR),B'11011111'                         0269 00438000
*           GEN(BAL   R14,C14C0015);                               0270 00439000
         BAL   R14,C14C0015                                             00440000
*         END;                                                     0271 00441000
*       IF $CIREQ='1'B&             /* HAS A CI BEEN REQ             */ 00442000
*           $TESTMDE(1)='0'B&       /* AND CT NOT IN TEST MODE       */ 00443000
*           $OLTACT='1'B&           /* AND OLT ACTIVE AND NOT        */ 00444000
*           $CLEANUP='0'B           /* IN CLEANUP                    */ 00445000
*         THEN                      /* IF YES SET UP TO              */ 00446000
@RF00267 TM    $CIREQ(WAPTR),B'00000001'                           0272 00447000
         BNO   @RF00272                                            0272 00448000
         TM    $TESTMDE(WAPTR),B'00000010'                         0272 00449000
         BNZ   @RF00272                                            0272 00450000
         TM    $OLTACT(WAPTR),B'00000001'                          0272 00451000
         BNO   @RF00272                                            0272 00452000
         TM    $CLEANUP(WAPTR),B'00000100'                         0272 00453000
         BNZ   @RF00272                                            0272 00454000
*         DO;                       /* CHECK TO SEE IF LINE IS IN  0273 00455000
*                                      TEST MODE                     */ 00456000
*           DO J=3 TO $DEVCNTS;     /* CHECK TESTDEVICES             */ 00457000
         LA    J,3                                                 0274 00458000
         B     @DE00274                                            0274 00459000
@DL00274 DS    0H                                                  0275 00460000
*             IF $TESTMDE(J)='1'B&  /* IS TERMINAL IN TEST MODE      */ 00461000
*                 $LINENME(J)=$LINENME(1)/* AND ON SAVE LINE AS CT   */ 00462000
*               THEN                                               0275 00463000
         LR    @11,J                                               0275 00464000
         MH    @11,@CH00404                                        0275 00465000
         ST    @11,@TF00001                                        0275 00466000
         ALR   @11,WAPTR                                           0275 00467000
         TM    $TESTMDE-68(@11),B'00000010'                        0275 00468000
         BNO   @RF00275                                            0275 00469000
         LR    @11,WAPTR                                           0275 00470000
         AL    @11,@TF00001                                        0275 00471000
         CLC   $LINENME-68(8,@11),$LINENME(WAPTR)                  0275 00472000
         BE    @RT00275                                            0275 00473000
*               GO TO C14C0033;     /* IN TEST MODE, WAIT ON       0276 00474000
*                                      COMMUNICATION INTERVAL        */ 00475000
*           END;                    /* END OF LOOP CHECKING CT LINE     00476000
*                                      IN TEST                       */ 00477000
@RF00275 AL    J,@CF00101                                          0277 00478000
@DE00274 CH    J,$DEVCNTS(,WAPTR)                                  0277 00479000
         BNH   @DL00274                                            0277 00480000
*           GO TO C14C0006;         /* FORCE COMMUNICATION INTERVAL  */ 00481000
         B     C14C0006                                            0278 00482000
*         END;                      /* END OF CHECK FOR COMMUNICATION   00483000
*                                      INTERVAL                      */ 00484000
*C14C0033:                                                         0280 00485000
*       ;                           /* DO NEXT CHECK                 */ 00486000
@RF00272 DS    0H                                                  0280 00487000
C14C0033 DS    0H                                                  0281 00488000
*       IF $CIREQ='1'B&             /* IF OLT NOT ACT                */ 00489000
*           $LGON='1'B              /* CHK FOR 1ST TIME              */ 00490000
*         THEN                      /* IF 1ST TIME GO TO             */ 00491000
         TM    $CIREQ(WAPTR),B'00000001'                           0281 00492000
         BNO   @RF00281                                            0281 00493000
         TM    $LGON(WAPTR),B'01000000'                            0281 00494000
         BO    @RT00281                                            0281 00495000
*         GOTO C14C0006;            /* SERVICE REQ                   */ 00496000
*       $TEP1ST='0'B;               /* SET 1ST TIME BIT OFF          */ 00497000
@RF00281 NI    $TEP1ST(WAPTR),B'11111101'                          0283 00498000
*     END;                                                         0284 00499000
*   SAVEDR2=$TFWDPTR;               /*                               */ 00500000
@RF00265 L     @11,$TFWDPTR(,WAPTR)                                0285 00501000
         ST    @11,SAVEDR2                                         0285 00502000
*   SVECC014(2)=$R13PTR;            /* IF NO RTN TO CALLE            */ 00503000
         L     @11,$R13PTR(,WAPTR)                                 0286 00504000
         ST    @11,SVECC014+4(,WAPTR)                              0286 00505000
*   RETURN;                         /* R13 IS PICKED UP FROM T.W.A &    00506000
*                                      USED TO RESTORE REGS & CONTROL*/ 00507000
         B     @EL00001                                            0287 00508000
*/********************************************************************/ 00509000
*                                                                  0288 00510000
*                                                                  0288 00511000
*/********************************************************************/ 00512000
*/*      ADD  1 TO BUSY COUNT  & TEST FOR EVERY BODY BUSY            */ 00513000
*/********************************************************************/ 00514000
*                                                                  0288 00515000
*C14C0004:                                                         0288 00516000
*   ;                               /*                               */ 00517000
C14C0004 DS    0H                                                  0289 00518000
*   BUSYCNT=BUSYCNT+1;              /* ADD 1 TO # TEST BUSY          */ 00519000
         LA    @11,1                                               0289 00520000
         AH    @11,BUSYCNT                                         0289 00521000
         STH   @11,BUSYCNT                                         0289 00522000
*   IF BUSYCNT<$USECNT              /* IF # BUSY IS LESS THAN        */ 00523000
*     THEN                          /* # OF USERS                    */ 00524000
         CH    @11,$USECNT(,RCAPTR)                                0290 00525000
         BL    @RT00290                                            0290 00526000
*     GOTO C14C0005;                /* GO ON WITH LOOP               */ 00527000
*   R1=5;                           /* SET THE NUMBER OF SECONDS TO     00528000
*                                      WAIT IF NOTING HAPPENS        */ 00529000
         LA    R1,5                                                0292 00530000
*   R13=SAVEDR13;                   /* USE ORIG AREA         @DA04678*/ 00531000
         L     R13,SAVEDR13                                        0293 00532000
*   CALL I00C0300;                  /* CALL RESIDENT MODULE TO SET 0294 00533000
*                                      TIMER                         */ 00534000
         L     @15,@CV01968                                        0294 00535000
         BALR  @14,@15                                             0294 00536000
*   R1=ADDR($TLTECB2);              /* PICK UP ADDRESS OF ECB        */ 00537000
         LA    R1,$TLTECB2(,RCAPTR)                                0295 00538000
*   CALL I00C1002;                  /* WAIT ON ECB           @D32JPPW*/ 00539000
         L     @15,@CV01974                                        0296 00540000
         BALR  @14,@15                                             0296 00541000
*   BUSYCNT=0;                      /* SET COUNT BACK TO ZERO        */ 00542000
         SLR   @11,@11                                             0297 00543000
         STH   @11,BUSYCNT                                         0297 00544000
*/********************************************************************/ 00545000
*                                                                  0298 00546000
*                                                                  0298 00547000
*/********************************************************************/ 00548000
*/*      GET NXT AREA PTR & LOOP                                     */ 00549000
*/********************************************************************/ 00550000
*                                                                  0298 00551000
*C14C0005:                                                         0298 00552000
*   ;                               /*                               */ 00553000
C14C0005 DS    0H                                                  0299 00554000
*   R4=$TFWDPTR;                    /* PICK UP NXT AREA PTR          */ 00555000
         L     R4,$TFWDPTR(,WAPTR)                                 0299 00556000
*   IF R4=0                         /* TEST FOR LAST TABLE ON        */ 00557000
*     THEN                          /* CHAIN FWD PTR=0               */ 00558000
         LTR   R4,R4                                               0300 00559000
         BZ    @RT00300                                            0300 00560000
*     GOTO C14C0001;                /* IF YES GO TO 1ST AREA         */ 00561000
*   R2=R4;                          /* IF NO SET R2 &                */ 00562000
         LR    R2,R4                                               0302 00563000
*   GOTO C14C0002;                  /* LOOP                          */ 00564000
         B     C14C0002                                            0303 00565000
*/********************************************************************/ 00566000
*/*       COMMUNICATION INTERVAL REQUESTED                           */ 00567000
*/********************************************************************/ 00568000
*                                                                  0304 00569000
*C14C0006:                                                         0304 00570000
*   ;                                                              0304 00571000
C14C0006 DS    0H                                                  0305 00572000
*   $CIREQ='0'B;                    /* RESET CIREQ BIT               */ 00573000
         NI    $CIREQ(WAPTR),B'11111110'                           0305 00574000
*   R13=ADDR(SVECC014(19));         /* GET NEW SAVE AREA             */ 00575000
         LA    R13,SVECC014+72(,WAPTR)                             0306 00576000
*   R14=ADDR(C14C0005);             /* SET RETURN POINT              */ 00577000
         LA    R14,C14C0005                                        0307 00578000
*   R15=ADDR(ISTIC002);             /* GET PTR TO CI MODULE          */ 00579000
         L     R15,@CV01960                                        0308 00580000
*   GEN(BR    R15);                                                0309 00581000
         BR    R15                                                      00582000
*C14C006A:                                                         0310 00583000
*   BUSYCNT=BUSYCNT-1;              /* REDUCE THE CURRENT BUSY COUNT    00584000
*                                                            @D32JPFR*/ 00585000
*                                                                  0310 00586000
C14C006A LH    @11,BUSYCNT                                         0310 00587000
         BCTR  @11,0                                               0310 00588000
         STH   @11,BUSYCNT                                         0310 00589000
*   /*****************************************************************/ 00590000
*   /*                                                               */ 00591000
*   /* ROUTINE TO SET RTN CODE AND REG 0 1 FROM TIME ROUTINES        */ 00592000
*   /*                                                               */ 00593000
*   /*****************************************************************/ 00594000
*                                                                  0311 00595000
*C14C0007:                                                         0311 00596000
*   ;                                                              0311 00597000
C14C0007 DS    0H                                                  0312 00598000
*   IF $TEP3RD='1'B                 /* IS THIS THIRD CALL            */ 00599000
*     THEN                                                         0312 00600000
         TM    $TEP3RD(WAPTR),B'10000000'                          0312 00601000
         BNO   @RF00312                                            0312 00602000
*     R4=$R13PR3;                   /* SET R4 WITH THIRD SAVE AREA   */ 00603000
         L     R4,$R13PR3(,WAPTR)                                  0313 00604000
*   ELSE                            /* IF NOT CHK FOR 2ND/1ST        */ 00605000
*     IF $TEP2ND='1'B               /* IS THIS 2ND CALL              */ 00606000
*       THEN                                                       0314 00607000
         B     @RC00312                                            0314 00608000
@RF00312 TM    $TEP2ND(WAPTR),B'00000001'                          0314 00609000
         BNO   @RF00314                                            0314 00610000
*       R4=$R13PTRT;                /* SET UP PTR TO SAVE AREA       */ 00611000
         L     R4,$R13PTRT(,WAPTR)                                 0315 00612000
*     ELSE                                                         0316 00613000
*       R4=$R13PTR;                                                0316 00614000
         B     @RC00314                                            0316 00615000
@RF00314 L     R4,$R13PTR(,WAPTR)                                  0316 00616000
*   GEN(ST    R15,L16(R4));         /* RESET REG IN SAVE AREA        */ 00617000
@RC00314 DS    0H                                                  0317 00618000
@RC00312 DS    0H                                                  0317 00619000
         ST    R15,L16(R4)                                              00620000
*   R14=ADDR(C14C0004);             /* RESET R14 TO ORIG RTN POINT   */ 00621000
         LA    R14,C14C0004                                        0318 00622000
*   GOTO C14C0004;                  /* RETURN AND CHECK $POSTFLG     */ 00623000
         B     C14C0004                                            0319 00624000
*                                                                  0320 00625000
*/********************************************************************/ 00626000
*/*      MACRO ROUTER  R1 HAS PTR TO INPUT PARM                      */ 00627000
*/********************************************************************/ 00628000
*                                                                  0320 00629000
*C14C0010:                                                         0320 00630000
*   ;                                                              0320 00631000
C14C0010 DS    0H                                                  0321 00632000
*   IF $TCECM='1'B                  /* TEST FOR SHORT FORM OF        */ 00633000
*     THEN                          /* CECUM-(TCEC MACRO)            */ 00634000
         TM    $TCECM(WAPTR),B'00000001'                           0321 00635000
         BNO   @RF00321                                            0321 00636000
*     DO;                           /* IF YES                        */ 00637000
*       R14=ADDR(C14C0014);         /* SET RTN POINT                 */ 00638000
         LA    R14,C14C0014                                        0323 00639000
*       R15=ADDR(ISTSC020);         /* SET PTR TO CECUM              */ 00640000
         L     R15,@CV01962                                        0324 00641000
*       GEN(BR    R15);             /* EXIT TO CECUM                 */ 00642000
         BR    R15                                                      00643000
*     END;                                                         0326 00644000
*                                                                  0326 00645000
*/********************************************************************/ 00646000
*/*      NORMAL MACRO CALL                                           */ 00647000
*/********************************************************************/ 00648000
*                                                                  0327 00649000
*   $MACID=IDVAL;                   /* SET ID FOR TRACE USE          */ 00650000
@RF00321 MVC   $MACID(2,WAPTR),IDVAL(R1)                           0327 00651000
*   IF LEVEL<2                      /* CHECK MACRO LEVEL FOR 0       */ 00652000
*     THEN                          /* OR 1 BOTH NOT SUPPORTED       */ 00653000
         CLI   LEVEL(R1),2                                         0328 00654000
         BL    @RT00328                                            0328 00655000
*     GOTO C14C0011;                /* IF LESS THAN 2 IS ERROR       */ 00656000
*   IF IDVAL(1:2)='40'              /* IS REQUESTED SERVICE $MODE    */ 00657000
*     THEN                          /* IF YES CANNOT RTN TO OLT      */ 00658000
         CLC   IDVAL(2,R1),@CC02004                                0330 00659000
         BE    @RT00330                                            0330 00660000
*     GOTO C14C0013;                /* MUST GOTO DTERM IMMEDIATLY    */ 00661000
*/********************************************************************/ 00662000
*/*      DO LOOP SEARCH SERVICE MACRO TABLE TO GIVE CONTROL TO ROUTN */ 00663000
*/********************************************************************/ 00664000
*                                                                  0332 00665000
*   R5=ADDR(MACRTBLE);              /* GET PTR TO TABLE              */ 00666000
         LA    R5,MACRTBLE                                         0332 00667000
*   DO I=1 TO 20 BY 1;                                             0333 00668000
         LA    @11,1                                               0333 00669000
         STH   @11,I                                               0333 00670000
@DL00333 DS    0H                                                  0334 00671000
*     IF IDVAL=SMID(I)              /* COMPARE INPUT ID TO TABLE     */ 00672000
*       THEN                        /* IF EQUAL GOTO INDICATED       */ 00673000
         SLA   @11,3                                               0334 00674000
         ST    @11,@TF00001                                        0334 00675000
         ALR   @11,R5                                              0334 00676000
         AL    @11,@CF02082                                        0334 00677000
         CLC   IDVAL(2,R1),SMID(@11)                               0334 00678000
         BNE   @RF00334                                            0334 00679000
*       DO;                         /* ROUTINE                       */ 00680000
*         IF SMLLEVL(I)>LEVEL       /* TEST LOW LIMIT                */ 00681000
*           THEN                    /* IF YES ERROR                  */ 00682000
         SLR   @11,@11                                             0336 00683000
         IC    @11,LEVEL(,R1)                                      0336 00684000
         L     @10,@TF00001                                        0336 00685000
         AL    @10,@CF02083                                        0336 00686000
         SLR   @09,@09                                             0336 00687000
         IC    @09,SMLLEVL-2(@10,R5)                               0336 00688000
         CR    @11,@09                                             0336 00689000
         BL    @RT00336                                            0336 00690000
*           GOTO C14C0011;                                         0337 00691000
*         IF LEVEL>SMHLEVL(I)       /* TEST HI LIMIT                 */ 00692000
*           THEN                    /* IF YES ERROR                  */ 00693000
         L     @10,@TF00001                                        0338 00694000
         AL    @10,@CF02084                                        0338 00695000
         SLR   @09,@09                                             0338 00696000
         IC    @09,SMHLEVL-3(@10,R5)                               0338 00697000
         CR    @11,@09                                             0338 00698000
         BH    @RT00338                                            0338 00699000
*           GOTO C14C0011;                                         0339 00700000
*         R14=ADDR(C14C0014);       /* SET RTN POINT                 */ 00701000
         LA    R14,C14C0014                                        0340 00702000
*         R15=SMPTR(I);             /* SET ENTRY PTR                 */ 00703000
         L     @11,@TF00001                                        0341 00704000
         AL    @11,@CF02085                                        0341 00705000
         L     R15,SMPTR-4(@11,R5)                                 0341 00706000
*         GEN(BR    R15);           /* GOTO SUBROUTINE               */ 00707000
         BR    R15                                                      00708000
*       END;                                                       0343 00709000
*   END;                            /* END OF DO LOOP                */ 00710000
@RF00334 LA    @11,1                                               0344 00711000
         AH    @11,I                                               0344 00712000
         STH   @11,I                                               0344 00713000
         C     @11,@CF00406                                        0344 00714000
         BNH   @DL00333                                            0344 00715000
*/********************************************************************/ 00716000
*/*      EXIT FROM LOOP IF MACRO NOT FOUND I.E. NOT SUPPORTED        */ 00717000
*/********************************************************************/ 00718000
*                                                                  0345 00719000
*C14C0011:                                                         0345 00720000
*   ;                                                              0345 00721000
C14C0011 DS    0H                                                  0346 00722000
*   R15=4;                          /* SET ERROR INDICATION          */ 00723000
         LA    R15,4                                               0346 00724000
*   GOTO C14C0014;                  /* FOR TRACE                     */ 00725000
         B     C14C0014                                            0347 00726000
*/********************************************************************/ 00727000
*/*     $MODE  MACRO ISSUED                                          */ 00728000
*/********************************************************************/ 00729000
*                                                                  0348 00730000
*C14C0013:                                                         0348 00731000
*   ;                                                              0348 00732000
C14C0013 DS    0H                                                  0349 00733000
*   R15=255;                        /* CODE FOR MODE                 */ 00734000
         LA    R15,255                                             0349 00735000
*/********************************************************************/ 00736000
*/*      EXIT                                                        */ 00737000
*/********************************************************************/ 00738000
*                                                                  0350 00739000
*C14C0014:                                                         0350 00740000
*   ;                                                              0350 00741000
C14C0014 DS    0H                                                  0351 00742000
*   IF $TEP3RD='1'B                 /* IS THIS THE THIRD CALL        */ 00743000
*     THEN                                                         0351 00744000
         TM    $TEP3RD(WAPTR),B'10000000'                          0351 00745000
         BNO   @RF00351                                            0351 00746000
*     R4=$R13PR3;                   /* YES SET R4                    */ 00747000
         L     R4,$R13PR3(,WAPTR)                                  0352 00748000
*   ELSE                            /* NO CHK FOR 2ND/1ST            */ 00749000
*     IF $TEP2ND='1'B               /* TEST FOR SECOND CALLER        */ 00750000
*       THEN                        /* IF YES PICK UP R13 FROM       */ 00751000
         B     @RC00351                                            0353 00752000
@RF00351 TM    $TEP2ND(WAPTR),B'00000001'                          0353 00753000
         BNO   @RF00353                                            0353 00754000
*       R4=$R13PTRT;                /* SPOT                          */ 00755000
         L     R4,$R13PTRT(,WAPTR)                                 0354 00756000
*     ELSE                          /* IF NO PICK UP R13 FROM        */ 00757000
*       R4=$R13PTR;                 /* NORMAL SPOT                   */ 00758000
         B     @RC00353                                            0355 00759000
@RF00353 L     R4,$R13PTR(,WAPTR)                                  0355 00760000
*   GEN(STM   R15,R1,L16(R4));      /* SAVE REGS                     */ 00761000
@RC00353 DS    0H                                                  0356 00762000
@RC00351 DS    0H                                                  0356 00763000
         STM   R15,R1,L16(R4)                                           00764000
*   GOTO C14C0005;                  /* RETURN TO REC MNGR            */ 00765000
         B     C14C0005                                            0357 00766000
*/********************************************************************/ 00767000
*/*      EXIT TO TRACE ROUTINE                                       */ 00768000
*/********************************************************************/ 00769000
*                                                                  0358 00770000
*C14C0015:                                                         0358 00771000
*   ;                               /*                               */ 00772000
C14C0015 DS    0H                                                  0359 00773000
*   R4=R14;                         /* SAVE RETURN ADDR              */ 00774000
         LR    R4,R14                                              0359 00775000
*   R5=R13;                         /* SAVE POINTER TO ORIG SAVE     */ 00776000
         LR    R5,R13                                              0360 00777000
*   R13=ADDR(SVECC014(19));         /* SET PTR TO SAVE AREA          */ 00778000
         LA    R13,SVECC014+72(,WAPTR)                             0361 00779000
*   R15=ADDR(ISTCC012);             /* SET POINTER TO TRACE          */ 00780000
         L     R15,@CV01964                                        0362 00781000
*   GEN(BALR  R14,R15);             /* BALR TO TRACE                 */ 00782000
         BALR  R14,R15                                                  00783000
*   R14=R4;                         /* RESET RETURN ADDR             */ 00784000
         LR    R14,R4                                              0364 00785000
*   R13=R5;                         /* RESET ORIG SAVE PTR           */ 00786000
         LR    R13,R5                                              0365 00787000
*   IF R0=0                         /* TEST RET FROM TRACE           */ 00788000
*     THEN                          /* IF 0 RET TO RESOURCE MNGR     */ 00789000
         LTR   R0,R0                                               0366 00790000
         BNZ   @RF00366                                            0366 00791000
*     GEN(BR    R14);               /* IF NOT 0 EXIT TO SCHED        */ 00792000
         BR    R14                                                      00793000
*   $OLTMACC='0'B;                  /* CLEAN UP ANY BITS SET         */ 00794000
@RF00366 DS    0H                                                  0369 00795000
*   $TEP1ST='0'B;                   /* SO AS NOT TO CONFUSE FLOW     */ 00796000
*   $TEP2ND='0'B;                   /* THROUGH RES MNGER             */ 00797000
         NI    $OLTMACC(WAPTR),B'11011100'                         0370 00798000
*   $TEP3RD='0'B;                                                  0371 00799000
         NI    $TEP3RD(WAPTR),B'01111111'                          0371 00800000
*   R15=ADDR(ISTCC010);             /*                               */ 00801000
         L     R15,@CV01957                                        0372 00802000
*   GEN(BR    R15);                 /*                               */ 00803000
         BR    R15                                                      00804000
*/********************************************************************/ 00805000
*                                                                  0374 00806000
*                                                                  0374 00807000
*/********************************************************************/ 00808000
*/*      LOGOFF (ENTRY WHEN CANCEL,LOGOFF,OR ABEND ENCOUNTERED       */ 00809000
*/********************************************************************/ 00810000
*                                                                  0374 00811000
*C14C0020:                                                         0374 00812000
*   ;                                                              0374 00813000
C14C0020 DS    0H                                                  0375 00814000
*   GEN;                                                           0375 00815000
         USING *,R15                                                    00816000
         L     R12,BASEREG              /* PICK UP SAVED BASE        */ 00817000
         DROP  R15                                                      00818000
*   R15=R13;                        /* SET UP SPECIAL SAVE           */ 00819000
         LR    R15,R13                                             0376 00820000
*   R13=ADDR(SVEIC002);             /* AND CHAIN THEM TOGETHER       */ 00821000
         LA    R13,SVEIC002(,WAPTR)                                0377 00822000
*   SVEIC002(2)=R15;                                               0378 00823000
         ST    R15,SVEIC002+4(,WAPTR)                              0378 00824000
*   BACKSAVE(3)=R13;                                               0379 00825000
         ST    R13,BACKSAVE+8(,R15)                                0379 00826000
*   $LOGOFFE='1'B;                  /* SET LOGOFF ENTERED BIT        */ 00827000
         OI    $LOGOFFE(WAPTR),B'00100000'                         0380 00828000
*   R3=$RCA;                        /* GET PTR TO R.C.A.             */ 00829000
         L     R3,$RCA(,WAPTR)                                     0381 00830000
*   $HOLD='0'B;                     /* RESET BIT TO CANCEL           */ 00831000
         NI    $HOLD(WAPTR),B'11111110'                            0382 00832000
*   $TEP1ST='0'B;                   /* THIS TEST IS OVER             */ 00833000
*   $TEP2ND='0'B;                                                  0384 00834000
         NI    $TEP1ST(WAPTR),B'11111100'                          0384 00835000
*   $TEP3RD='0'B;                                                  0385 00836000
         NI    $TEP3RD(WAPTR),B'01111111'                          0385 00837000
*   $REQSTOR='0'B;                  /* OLT ISSUED A DTERM            */ 00838000
         NI    $REQSTOR(WAPTR),B'11101111'                         0386 00839000
*   $ENDTEST='0'B;                  /*                               */ 00840000
         NI    $ENDTEST(WAPTR),B'11110111'                         0387 00841000
*   $OLTMACC='0'B;                  /*                               */ 00842000
         NI    $OLTMACC(WAPTR),B'11011111'                         0388 00843000
*   $ACTOPND='0'B;                                                 0389 00844000
*   $CLSSACT='0'B;                                                 0390 00845000
         NI    $ACTOPND(WAPTR),B'11111010'                         0390 00846000
*   $WAITFLG='0'B;                                                 0391 00847000
         NI    $WAITFLG(WAPTR),B'10111111'                         0391 00848000
*   $POSTFLG='0'B;                                                 0392 00849000
         NI    $POSTFLG(WAPTR),B'10111111'                         0392 00850000
*   $CIREQ='0'B;                    /*                               */ 00851000
         NI    $CIREQ(WAPTR),B'11111110'                           0393 00852000
*   $SNDRFLG='0'B;                  /* WAITING ON SEND        @DM0908*/ 00853000
*   $RCVRFLG='0'B;                  /* WAITING ON RECEIVE     @DM0908*/ 00854000
         NI    $SNDRFLG(WAPTR),B'11111001'                         0395 00855000
*   R15=ADDR(ISTTC035);             /* GO TO DTERM                   */ 00856000
         L     R15,@CV01963                                        0396 00857000
*   GEN(BALR  R14,R15);                                            0397 00858000
         BALR  R14,R15                                                  00859000
*   R1=R2;                          /* SET PTR TO VFRMAIN            */ 00860000
         LR    R1,R2                                               0398 00861000
*   R2=$FSTAREA;                    /* POINT TO FIRST TWA.   @ZMB7416*/ 00862000
         L     R2,$FSTAREA(,RCAPTR)                                0399 00863000
*   IF R1=R2 THEN                   /* DEQUE TWA IF 1ST      @ZMB7416*/ 00864000
         CR    R1,R2                                               0400 00865000
         BNE   @RF00400                                            0400 00866000
*     DO;                           /* FOR /// USER ERROR.   @ZMB7416*/ 00867000
*       $FSTAREA=R1->$TFWDPTR;      /* POINT TO NEXT TWA.    @ZMB7416*/ 00868000
         L     @11,$TFWDPTR(,R1)                                   0402 00869000
         ST    @11,$FSTAREA(,RCAPTR)                               0402 00870000
*       IF R1=$LSTAREA THEN         /* ONLY ONE LEFT,        @ZMB7416*/ 00871000
         C     R1,$LSTAREA(,RCAPTR)                                0403 00872000
         BNE   @RF00403                                            0403 00873000
*         $LSTAREA=0;               /* LAST IS ZERO.         @ZMB7416*/ 00874000
         SLR   @11,@11                                             0404 00875000
         ST    @11,$LSTAREA(,RCAPTR)                               0404 00876000
*       ELSE                        /* UPDATE BACK PTR OF    @ZMB7416*/ 00877000
*         R1->$TFWDPTR->$TBWDPTR=0; /* NEXT TWA TO ZERO.     @ZMB7416*/ 00878000
         B     @RC00403                                            0405 00879000
@RF00403 L     @11,$TFWDPTR(,R1)                                   0405 00880000
         SLR   @10,@10                                             0405 00881000
         ST    @10,$TBWDPTR(,@11)                                  0405 00882000
*     END;                          /*                       @ZMB7416*/ 00883000
@RC00403 DS    0H                                                  0407 00884000
*/*VFRMAIN  SIZE(34816)STORAGE((1))SUBPOOL(0)                        */ 00885000
*                                                                  0407 00886000
*   DO;                                                            0407 00887000
@RF00400 DS    0H                                                  0408 00888000
*     DO;                           /* CMZMREG (0) RESTRICT          */ 00889000
*       RFY                                                        0409 00890000
*        (GPR00P) RSTD;                                            0409 00891000
*     END;                          /* CMZMREG PUT VALUE PASSED AS 0410 00892000
*                                      SIZE PARM IN THREE LOW-ORDER     00893000
*                                      BYTES OF REG 0                */ 00894000
*     GPR00F=34816&'00FFFFFF'X;                                    0411 00895000
         L     GPR00F,@CF02016                                     0411 00896000
*     DO;                           /* CMZMREG (0,15) RESTRICT       */ 00897000
*       RFY                                                        0413 00898000
*        (GPR15P) RSTD;                                            0413 00899000
*     END;                          /* CMZMREG PUT SUBPOOL PARM IN 0414 00900000
*                                      HIGH- ORDER BYTE OF REG 15    */ 00901000
*     GPR15F=0;                                                    0415 00902000
         SLR   GPR15F,GPR15F                                       0415 00903000
*     SLL(GPR15P,24);               /* COMBINE SUBPOOL AND SIZE IN 0416 00904000
*                                      REGISTER 0                    */ 00905000
         SLL   GPR15P,24                                           0416 00906000
*     GPR00P=GPR00P|GPR15P;                                        0417 00907000
         OR    GPR00P,GPR15P                                       0417 00908000
*     DO;                           /* CMZMREG (0,15) RELEASE        */ 00909000
*       RFY                                                        0419 00910000
*        (GPR15P) UNRSTD;                                          0419 00911000
*     END;                          /* CMZMREG DECLARE AND RESTRICT     00912000
*                                      REG 1                         */ 00913000
*     DO;                           /* CMZMREG (1) RESTRICT          */ 00914000
*       RFY                                                        0422 00915000
*        (GPR01P) RSTD;                                            0422 00916000
*     END;                          /* CMZMREG INVOKE XREGSET MACRO     00917000
*                                      TO CHECK STORAGE PARM AND PUT    00918000
*                                      ADDR IN REGISTER 1            */ 00919000
*/*XREGSET  PID('STORAGE')PPARM((1))RREG(1,GPR01P)                   */ 00920000
*                                                                  0424 00921000
*     DO;                                                          0424 00922000
*                                                                  0424 00923000
*/*PARM ALREADY IN PROPER REGISTER                                   */ 00924000
*                                                                  0425 00925000
*     END;                          /* XREGSET INVOKE FREEMAIN MACRO */ 00926000
*     GEN;                                                         0426 00927000
         FREEMAIN R,LV=(0),A=(1)                                        00928000
*                                   /* UNRESTRICT REG 1              */ 00929000
*     DO;                           /* CMZMREG (1) RELEASE           */ 00930000
*       RFY                                                        0428 00931000
*        (GPR01P) UNRSTD;                                          0428 00932000
*     END;                          /* CMZMREG UNRESTRICT REG 0      */ 00933000
*     DO;                           /* CMZMREG (0) RELEASE           */ 00934000
*       RFY                                                        0431 00935000
*        (GPR00P) UNRSTD;                                          0431 00936000
*     END;                          /* CMZMREG                       */ 00937000
*   END;                            /* VFRMAIN                       */ 00938000
*   R2=$FSTAREA;                    /* GET PTR TO FIRST TWA          */ 00939000
         L     R2,$FSTAREA(,RCAPTR)                                0434 00940000
*   $USECNT=$USECNT-1;              /* DECREMENT NUMBER OF USERS     */ 00941000
         LH    @11,$USECNT(,RCAPTR)                                0435 00942000
         BCTR  @11,0                                               0435 00943000
         STH   @11,$USECNT(,RCAPTR)                                0435 00944000
*   IF R2=0                         /* ANY MORE WORK                 */ 00945000
*     THEN                          /* IF NO MORE USERS              */ 00946000
         SLR   @11,@11                                             0436 00947000
         CR    R2,@11                                              0436 00948000
         BNE   @RF00436                                            0436 00949000
*     DO;                           /* SET FIELDS IN RCA TO ZERO     */ 00950000
*       $USECNT=0;                  /* RESET NUMBER OF USERS         */ 00951000
         STH   @11,$USECNT(,RCAPTR)                                0438 00952000
*       $UPDATE='0'B;                                              0439 00953000
*       $CUTESTB='0'B;              /* INDICATE CUTEST HAS ENDED     */ 00954000
         NI    $UPDATE(RCAPTR),B'01101111'                         0440 00955000
*       $FSTAREA=0;                                                0441 00956000
         ST    @11,$FSTAREA(,RCAPTR)                               0441 00957000
*       $LSTAREA=0;                                                0442 00958000
         ST    @11,$LSTAREA(,RCAPTR)                               0442 00959000
*       $TOLTEP=0;                                                 0443 00960000
         ST    @11,$TOLTEP(,RCAPTR)                                0443 00961000
*       $ABEND=0;                                                  0444 00962000
         ST    @11,$ABEND(,RCAPTR)                                 0444 00963000
*       $CLEANP=0;                                                 0445 00964000
         ST    @11,$CLEANP(,RCAPTR)                                0445 00965000
*       R15=ADDR(I00C0005);                                        0446 00966000
         L     R15,@CV01965                                        0446 00967000
*       GEN(BR    R15);                                            0447 00968000
         BR    R15                                                      00969000
*     END;                                                         0448 00970000
*   ELSE                            /* IF MORE USERS                 */ 00971000
*     DO;                           /* SET UP TO LOOP BACK TO TOP    */ 00972000
         B     @RC00436                                            0449 00973000
@RF00436 DS    0H                                                  0450 00974000
*       R13=ADDR(SVECC014(1));      /* SET SAVE PTR                  */ 00975000
         LA    R13,SVECC014(,WAPTR)                                0450 00976000
*       GOTO C14C0001;                                             0451 00977000
         B     C14C0001                                            0451 00978000
*     END;                                                         0452 00979000
*                                                                  0452 00980000
*/********************************************************************/ 00981000
*                                                                  0453 00982000
*                                                                  0453 00983000
*/********************************************************************/ 00984000
*/*      GET STORAGE ROUTINE                                         */ 00985000
*/********************************************************************/ 00986000
*                                                                  0453 00987000
*C14C0030:                                                         0453 00988000
*   ;                                                              0453 00989000
@RC00436 DS    0H                                                  0453 00990000
C14C0030 DS    0H                                                  0454 00991000
*   GEN;                                                           0454 00992000
         USING *,R15                    /* SET BASE                  */ 00993000
         STM   R14,R12,L12(R13)         /* SAVE CALLERS REGS         */ 00994000
         L     R12,BASEREG              /* PICK UP BASE              */ 00995000
         DROP  R15                      /* DROP 15 BASE              */ 00996000
*   SVECC014(20)=R13;               /* SAVE SAVE PTR                 */ 00997000
         ST    R13,SVECC014+76(,WAPTR)                             0455 00998000
*   R13=ADDR(SVECC014(19));         /* SET R13 TO MY SAVE            */ 00999000
         LA    R13,SVECC014+72(,WAPTR)                             0456 01000000
*C14C0035:                                                         0457 01001000
*   ;                                                              0457 01002000
C14C0035 DS    0H                                                  0458 01003000
*   GEN(STM R0,R13,GTSTSAVE);                                      0458 01004000
         STM R0,R13,GTSTSAVE                                            01005000
*   DO;                             /* GETSTOR SIZE($RQSTSZE)TYPE(PAG   01006000
*                                      EABLE)ADSPACE(COMMON)KEY(VTAM)   01007000
*                                      FETCHP(NO)SAVE(NO)CLEAR(YES)  */ 01008000
*                                                                  0460 01009000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)                        */ 01010000
*/* END OF ATBUILD                                                   */ 01011000
*                                                                  0460 01012000
*     DO;                                                          0460 01013000
*     END;                                                         0461 01014000
*     DO;                                                          0462 01015000
*       RFY                                                        0463 01016000
*        (GPR00P,                                                  0463 01017000
*         GPR01P,                                                  0463 01018000
*         GPR02P,                                                  0463 01019000
*         GPR03P) RSTD;                                            0463 01020000
*     END;                                                         0464 01021000
*     GPR00F=$RQSTSZE;              /* SIZE IN REG0                  */ 01022000
         LH    GPR00F,$RQSTSZE(,WAPTR)                             0465 01023000
*     DCL                                                          0466 01024000
*       1 CMZA0031 FIXED(31) STATIC LOCAL,                         0466 01025000
*        2 * FIXED(8) INIT(32),     /* OPTION FLAGS                  */ 01026000
*        2 * FIXED(8) INIT(96),     /* STORAGE KEY                   */ 01027000
*        2 * FIXED(8) INIT(241),    /* SUBPOOL NUMBER                */ 01028000
*        2 * FIXED(8) INIT('00'X);  /* REQUEST TYPE                  */ 01029000
*     GPR03F=CMZA0031;                                             0467 01030000
         L     GPR03F,CMZA0031                                     0467 01031000
*     DO;                           /* LISATCVT                    0468 01032000
*                                      CVTBASE(PAGEABLE,(GPR02P))    */ 01033000
*       GPR02P=ATCLCPTR;            /* SET UP ATCVT POINTER          */ 01034000
         L     GPR02P,ATCLCPTR                                     0469 01035000
*     END;                          /* LISATCVT                      */ 01036000
*     CALL GPR02P->ATCGTSTR;        /* CALL ISTORFSR                 */ 01037000
         L     @15,ATCGTSTR(,GPR02P)                               0471 01038000
         BALR  @14,@15                                             0471 01039000
*     DO;                                                          0472 01040000
*       RFY                                                        0473 01041000
*        (GPR00P,                                                  0473 01042000
*         GPR01P,                                                  0473 01043000
*         GPR02P,                                                  0473 01044000
*         GPR03P) UNRSTD;                                          0473 01045000
*     END;                                                         0474 01046000
*   END;                            /* GETSTOR                       */ 01047000
*   R14=R3;                         /* SAVE PTR TO AREA              */ 01048000
         LR    R14,R3                                              0476 01049000
*   GEN(LM R0,R13,GTSTSAVE);                                       0477 01050000
         LM R0,R13,GTSTSAVE                                             01051000
*   $RQSTPTR=R14;                   /* STORE PTR AWAY                */ 01052000
         ST    R14,$RQSTPTR(,WAPTR)                                0478 01053000
*   IF R15=0                        /* CHK RETURN CODE               */ 01054000
*     THEN                          /* IF ZERO RESTORE REGS          */ 01055000
         LTR   R15,R15                                             0479 01056000
         BNZ   @RF00479                                            0479 01057000
*     DO;                           /* & RNT TO CALLER               */ 01058000
*       $REQSTOR='0'B;              /* PTR TO GOTTEN AREA IN         */ 01059000
         NI    $REQSTOR(WAPTR),B'11101111'                         0481 01060000
*       R13=SVECC014(20);           /* $RQSTPTR                      */ 01061000
         L     R13,SVECC014+76(,WAPTR)                             0482 01062000
*       GEN(LM    R14,R12,L12(R13));                               0483 01063000
         LM    R14,R12,L12(R13)                                         01064000
*       GEN(BR    R14);                                            0484 01065000
         BR    R14                                                      01066000
*     END;                                                         0485 01067000
*   ELSE                                                           0486 01068000
*     DO;                           /* IF NOT ZERO NO CORE AVAIL     */ 01069000
         B     @RC00479                                            0486 01070000
@RF00479 DS    0H                                                  0487 01071000
*       $REQSTOR='1'B;              /* SET BIT TO RETRY LATER        */ 01072000
         OI    $REQSTOR(WAPTR),B'00010000'                         0487 01073000
*       R3=$RCA;                    /* RESET R3                      */ 01074000
         L     R3,$RCA(,WAPTR)                                     0488 01075000
*       GOTO C14C0004;              /* GO TO LOOP                    */ 01076000
         B     C14C0004                                            0489 01077000
*     END;                                                         0490 01078000
*   GEN(EJECT);                                                    0491 01079000
@RC00479 DS    0H                                                  0491 01080000
         EJECT                                                          01081000
*                                                                  0492 01082000
*/********************************************************************/ 01083000
*/*      MACRO TABLE  PASSED ID  RELATED TO ADDR                     */ 01084000
*/********************************************************************/ 01085000
*                                                                  0492 01086000
*   GEN(DS    0D);                                                 0492 01087000
         DS    0D                                                       01088000
*MACRTBLE:                                                         0493 01089000
*   ;                                                              0493 01090000
MACRTBLE DS    0H                                                  0494 01091000
*   GEN;                                                           0494 01092000
*                                                                  0494 01093000
         DC    C'37'                                                    01094000
         DC    X'0202'                                                  01095000
         DC    V(ISTSC020)          MACRO CALL IS TO CECOM              01096000
         DC    C'41'                                                    01097000
         DC    X'0202'                                                  01098000
         DC    V(ISTSC021)          MACRO CALL IS TO CONVERT            01099000
         DC    C'AJ'                                                    01100000
         DC    X'0202'                                                  01101000
         DC    V(ISTSC022)          MACRO CALL IS TO $CUTEST            01102000
         DC    C'AA'                                                    01103000
         DC    X'0202'                                                  01104000
         DC    V(ISTSC023)          MACRO CALL IS TO DDATE              01105000
         DC    C'39'                                                    01106000
         DC    X'0202'                                                  01107000
         DC    V(ISTSC024)          MACRO CALL IS TO DPRINT             01108000
         DC    C'AB'                                                    01109000
         DC    X'0202'                                                  01110000
         DC    V(ISTSC026)          MACRO CALL IS TO DTIME              01111000
         DC    C'35'                                                    01112000
         DC    X'0203'                                                  01113000
         DC    V(ISTSC027)          MACRO CALL IS TO EXIO               01114000
         DC    C'43'                                                    01115000
         DC    X'0202'                                                  01116000
         DC    V(ISTSC028)          MACRO CALL IS TO FREECORE           01117000
         DC    C'16'                                                    01118000
         DC    X'0202'                                                  01119000
         DC    V(ISTSC029)          MACRO CALL IS TO GETCONFG           01120000
         DC    C'21'                                                    01121000
         DC    X'0202'                                                  01122000
         DC    V(ISTSC02A)          MACRO CALL IS TO GRAB               01123000
         DC    C'AC'                                                    01124000
         DC    X'0202'                                                  01125000
         DC    V(ISTSC02B)          MACRO CALL IS TO LETGO              01126000
         DC    C'42'                                                    01127000
         DC    X'0203'                                                  01128000
         DC    V(ISTSC02C)          MACRO CALL IS TO MORECORE           01129000
         DC    C'28'                                                    01130000
         DC    X'0202'                                                  01131000
         DC    V(ISTSC02D)          MACRO CALL IS TO PLINK              01132000
         DC    C'47'                                                    01133000
         DC    X'0202'                                                  01134000
         DC    V(ISTSC02E)          MACRO CALL IS TO ROUTINE            01135000
         DC    C'36'                                                    01136000
         DC    X'0203'                                                  01137000
         DC    V(ISTSC02F)          MACRO CALL IS TO WAITIO             01138000
         DC    C'30'                                                    01139000
         DC    X'0202'                                                  01140000
         DC    V(S30C0010)          MACRO CALL IS TO ACQUIRE            01141000
         DC    C'44'                                                    01142000
         DC    X'0202'                                                  01143000
         DC    V(ISTSC032)          MACRO CALL IS TO DIO                01144000
         DC    C'31'                                                    01145000
         DC    X'0202'                                                  01146000
         DC    V(ISTSC031)          MACRO CALL TO RELEASE               01147000
         DC    C'25'                                           @D32JPFR 01148000
         DC    X'0202'                                         @D32JPFR 01149000
         DC    V(ISTSC025)          MACRO CALL TO SEND         @D32JPFR 01150000
         DC    C'33'                                           @D32JPFR 01151000
         DC    X'0202'                                         @D32JPFR 01152000
         DC    V(ISTSC025)          MACRO CALL TO RECEIVE      @D32JPFR 01153000
*/********************************************************************/ 01154000
*                                                                  0495 01155000
*   DO;                             /* TPEPILOG                      */ 01156000
*     GEN(PRINT OFF);                                              0496 01157000
         PRINT OFF                                                      01158000
*     DO;                                                          0497 01159000
*       DCL                                                        0498 01160000
*         GPR00F FIXED(31) REG(00),                                0498 01161000
*         GPR00P PTR(31) REG(00),                                  0498 01162000
*         GPR01F FIXED(31) REG(01),                                0498 01163000
*         GPR01P PTR(31) REG(01),                                  0498 01164000
*         GPR02F FIXED(31) REG(02),                                0498 01165000
*         GPR02P PTR(31) REG(02),                                  0498 01166000
*         GPR03F FIXED(31) REG(03),                                0498 01167000
*         GPR03P PTR(31) REG(03),                                  0498 01168000
*         GPR04F FIXED(31) REG(04),                                0498 01169000
*         GPR04P PTR(31) REG(04),                                  0498 01170000
*         GPR05F FIXED(31) REG(05),                                0498 01171000
*         GPR05P PTR(31) REG(05),                                  0498 01172000
*         GPR06F FIXED(31) REG(06),                                0498 01173000
*         GPR06P PTR(31) REG(06),                                  0498 01174000
*         GPR07F FIXED(31) REG(07),                                0498 01175000
*         GPR07P PTR(31) REG(07),                                  0498 01176000
*         GPR08F FIXED(31) REG(08),                                0498 01177000
*         GPR08P PTR(31) REG(08),                                  0498 01178000
*         GPR09F FIXED(31) REG(09),                                0498 01179000
*         GPR09P PTR(31) REG(09),                                  0498 01180000
*         GPR10F FIXED(31) REG(10),                                0498 01181000
*         GPR10P PTR(31) REG(10),                                  0498 01182000
*         GPR11F FIXED(31) REG(11),                                0498 01183000
*         GPR11P PTR(31) REG(11),                                  0498 01184000
*         GPR12F FIXED(31) REG(12),                                0498 01185000
*         GPR12P PTR(31) REG(12),                                  0498 01186000
*         GPR13F FIXED(31) REG(13),                                0498 01187000
*         GPR13P PTR(31) REG(13),                                  0498 01188000
*         GPR14F FIXED(31) REG(14),                                0498 01189000
*         GPR14P PTR(31) REG(14),                                  0498 01190000
*         GPR15F FIXED(31) REG(15),                                0498 01191000
*         GPR15P PTR(31) REG(15);                                  0498 01192000
*     END;                                                         0499 01193000
*     GEN(PRINT ON);                                               0500 01194000
         PRINT ON                                                       01195000
*   END;                            /* TPEPILOG                      */ 01196000
*   END                                                            0502 01197000
*                                                                  0502 01198000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01199000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01200000
*                                                                  0502 01201000
*       ;                                                          0502 01202000
         B     @EL00001                                            0502 01203000
@DATA    DS    0H                                                       01204000
@CH00404 DC    H'68'                                                    01205000
         DS    0F                                                       01206000
@SA00001 DS    18F                                                      01207000
@TF00001 DS    F                                                        01208000
         DS    0F                                                       01209000
@CF00101 DC    F'1'                                                     01210000
@CF00406 DC    F'20'                                                    01211000
@CF02016 DC    F'34816'                                                 01212000
@CF02082 DC    F'-8'                                                    01213000
@CF02083 DC    F'-6'                                                    01214000
@CF02084 DC    F'-5'                                                    01215000
@CF02085 DC    F'-4'                                                    01216000
@CV01957 DC    V(ISTCC010)                                              01217000
@CV01958 DC    V(ISTCC011)                                              01218000
@CV01959 DC    V(I00C0070)                                              01219000
@CV01960 DC    V(ISTIC002)                                              01220000
@CV01961 DC    V(S2FC1000)                                              01221000
@CV01962 DC    V(ISTSC020)                                              01222000
@CV01963 DC    V(ISTTC035)                                              01223000
@CV01964 DC    V(ISTCC012)                                              01224000
@CV01965 DC    V(I00C0005)                                              01225000
@CV01966 DC    V(S30C1000)                                              01226000
@CV01967 DC    V(S31C0480)                                              01227000
@CV01968 DC    V(I00C0300)                                              01228000
@CV01969 DC    V(ISTSC025)                                              01229000
@CV01970 DC    V(ISTSC033)                                              01230000
@CV01971 DC    V(ISTSC027)                                              01231000
@CV01974 DC    V(I00C1002)                                              01232000
         DS    0D                                                       01233000
BASEREG  DC    F'0'                                                     01234000
SAVEDR2  DC    F'0'                                                     01235000
SAVEDR13 DC    F'0'                                                     01236000
CMZA0031 DS    FL4                                                      01237000
         ORG   CMZA0031                                                 01238000
@NM00102 DC    AL1(32)                                                  01239000
@NM00103 DC    AL1(96)                                                  01240000
@NM00104 DC    AL1(241)                                                 01241000
@NM00105 DC    XL1'00'                                                  01242000
         ORG   CMZA0031+4                                               01243000
BUSYCNT  DC    H'0'                                                     01244000
I        DC    H'0'                                                     01245000
X        DC    H'0'                                                     01246000
@CC02004 DC    C'40'                                                    01247000
PATCH    DC    40F'0'                                                   01248000
GTSTSAVE DS    14F                                                      01249000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01250000
@01      EQU   01                                                       01251000
@02      EQU   02                                                       01252000
@03      EQU   03                                                       01253000
@04      EQU   04                                                       01254000
@05      EQU   05                                                       01255000
@06      EQU   06                                                       01256000
@07      EQU   07                                                       01257000
@08      EQU   08                                                       01258000
@09      EQU   09                                                       01259000
@10      EQU   10                                                       01260000
@11      EQU   11                                                       01261000
@12      EQU   12                                                       01262000
@13      EQU   13                                                       01263000
@14      EQU   14                                                       01264000
@15      EQU   15                                                       01265000
J        EQU   @10                                                      01266000
RCAPTR   EQU   @03                                                      01267000
R0       EQU   @00                                                      01268000
R1       EQU   @01                                                      01269000
R2       EQU   @02                                                      01270000
R3       EQU   @03                                                      01271000
R4       EQU   @04                                                      01272000
R5       EQU   @05                                                      01273000
R12      EQU   @12                                                      01274000
R13      EQU   @13                                                      01275000
R14      EQU   @14                                                      01276000
R15      EQU   @15                                                      01277000
WAPTR    EQU   @02                                                      01278000
RPHPTR   EQU   @01                                                      01279000
GPR00P   EQU   @00                                                      01280000
GPR00F   EQU   @00                                                      01281000
GPR15P   EQU   @15                                                      01282000
GPR15F   EQU   @15                                                      01283000
GPR01P   EQU   @01                                                      01284000
GPR02P   EQU   @02                                                      01285000
GPR03P   EQU   @03                                                      01286000
GPR03F   EQU   @03                                                      01287000
GPR01F   EQU   @01                                                      01288000
GPR02F   EQU   @02                                                      01289000
GPR04F   EQU   @04                                                      01290000
GPR04P   EQU   @04                                                      01291000
GPR05F   EQU   @05                                                      01292000
GPR05P   EQU   @05                                                      01293000
GPR06F   EQU   @06                                                      01294000
GPR06P   EQU   @06                                                      01295000
GPR07F   EQU   @07                                                      01296000
GPR07P   EQU   @07                                                      01297000
GPR08F   EQU   @08                                                      01298000
GPR08P   EQU   @08                                                      01299000
GPR09F   EQU   @09                                                      01300000
GPR09P   EQU   @09                                                      01301000
GPR10F   EQU   @10                                                      01302000
GPR10P   EQU   @10                                                      01303000
GPR11F   EQU   @11                                                      01304000
GPR11P   EQU   @11                                                      01305000
GPR12F   EQU   @12                                                      01306000
GPR12P   EQU   @12                                                      01307000
GPR13F   EQU   @13                                                      01308000
GPR13P   EQU   @13                                                      01309000
GPR14F   EQU   @14                                                      01310000
GPR14P   EQU   @14                                                      01311000
R10      EQU   @10                                                      01312000
R11      EQU   @11                                                      01313000
R6       EQU   @06                                                      01314000
R7       EQU   @07                                                      01315000
R8       EQU   @08                                                      01316000
R9       EQU   @09                                                      01317000
         ENTRY C14C0020                                                 01318000
         ENTRY C14C0030                                                 01319000
ATCLCPTR EQU   1032                                                     01320000
$RCAAREA EQU   0                                                        01321000
$POINTER EQU   $RCAAREA+100                                             01322000
$TOLTEP  EQU   $POINTER                                                 01323000
$FSTAREA EQU   $POINTER+8                                               01324000
$LSTAREA EQU   $POINTER+12                                              01325000
$ABEND   EQU   $POINTER+16                                              01326000
$CLEANP  EQU   $POINTER+20                                              01327000
$TLTECB2 EQU   $POINTER+28                                              01328000
$TRTBLA  EQU   $POINTER+124                                             01329000
$CURRTWA EQU   $POINTER+140                                             01330000
$CONSTNT EQU   $RCAAREA+244                                             01331000
$USECNT  EQU   $CONSTNT                                                 01332000
$RCAFLG  EQU   $RCAAREA+604                                             01333000
$UPDATE  EQU   $RCAFLG                                                  01334000
$CUTESTB EQU   $RCAFLG                                                  01335000
TOLTEPWA EQU   0                                                        01336000
$SCTTBLE EQU   TOLTEPWA                                                 01337000
$TESTOPT EQU   $SCTTBLE+2                                               01338000
$ERROPT  EQU   $SCTTBLE+3                                               01339000
$PDEVFLG EQU   $SCTTBLE+10                                              01340000
$CDSFLGS EQU   $SCTTBLE+11                                              01341000
$CDS8T19 EQU   $SCTTBLE+20                                              01342000
$EXECFLG EQU   $SCTTBLE+33                                              01343000
$CLEANUP EQU   $EXECFLG                                                 01344000
$OLTFLGS EQU   $SCTTBLE+36                                              01345000
$OLTFLG2 EQU   $SCTTBLE+37                                              01346000
$TOTFLG1 EQU   $SCTTBLE+38                                              01347000
$ROUTMSK EQU   $SCTTBLE+40                                              01348000
$CDA     EQU   TOLTEPWA+100                                             01349000
$TFWDPTR EQU   $CDA+8                                                   01350000
$TBWDPTR EQU   $CDA+12                                                  01351000
$RCA     EQU   $CDA+44                                                  01352000
$OLTPTR  EQU   $CDA+52                                                  01353000
$HIMOREC EQU   $CDA+60                                                  01354000
$R13PTR  EQU   $CDA+80                                                  01355000
$R13PTRT EQU   $CDA+84                                                  01356000
$COMMFLG EQU   TOLTEPWA+224                                             01357000
$FLAG1   EQU   $COMMFLG                                                 01358000
$TEP3RD  EQU   $FLAG1                                                   01359000
$OLTACT  EQU   $FLAG1                                                   01360000
$FLAG2   EQU   $COMMFLG+1                                               01361000
$FLAG3   EQU   $COMMFLG+2                                               01362000
$LOGOFFE EQU   $FLAG3                                                   01363000
$REQSTOR EQU   $FLAG3                                                   01364000
$PRTONLY EQU   $FLAG3                                                   01365000
$FLAG4   EQU   $COMMFLG+3                                               01366000
$CLSSACT EQU   $FLAG4                                                   01367000
$ACTOPND EQU   $FLAG4                                                   01368000
$FLAG5   EQU   $COMMFLG+4                                               01369000
$EOJ     EQU   $FLAG5                                                   01370000
$CANCEL  EQU   $EOJ                                                     01371000
$FLAG6   EQU   $COMMFLG+5                                               01372000
$RECAL11 EQU   $FLAG6                                                   01373000
$ABNDBIT EQU   $FLAG6                                                   01374000
$ABTERM  EQU   $ABNDBIT                                                 01375000
$CIREQ   EQU   $FLAG6                                                   01376000
$FLAG7   EQU   $COMMFLG+6                                               01377000
$EXIOWAT EQU   $FLAG7                                                   01378000
$SNDRFLG EQU   $FLAG7                                                   01379000
$RCVRFLG EQU   $FLAG7                                                   01380000
$FLAG8   EQU   $COMMFLG+7                                               01381000
$TWOWAY  EQU   $FLAG8                                                   01382000
$TCECM   EQU   $FLAG8                                                   01383000
$FLAG9   EQU   $COMMFLG+8                                               01384000
$NOTRRCH EQU   $FLAG9                                                   01385000
$HOLD    EQU   $FLAG9                                                   01386000
$FLAG10  EQU   $COMMFLG+9                                               01387000
$WAITFLG EQU   $FLAG10                                                  01388000
$INBND   EQU   $FLAG10                                                  01389000
$FLAG11  EQU   $COMMFLG+10                                              01390000
$FLAG12  EQU   $COMMFLG+11                                              01391000
$POSTFLG EQU   $FLAG12                                                  01392000
$ENDTEST EQU   $FLAG12                                                  01393000
$VARYINP EQU   $FLAG12                                                  01394000
$FLAG13  EQU   $COMMFLG+12                                              01395000
$LGON    EQU   $FLAG13                                                  01396000
$OLTMACC EQU   $FLAG13                                                  01397000
$TEP1ST  EQU   $FLAG13                                                  01398000
$TEP2ND  EQU   $FLAG13                                                  01399000
$DEVTBLE EQU   TOLTEPWA+240                                             01400000
$DEVCDS  EQU   $DEVTBLE                                                 01401000
$DEVUNAD EQU   $DEVCDS                                                  01402000
@NM00039 EQU   $DEVUNAD+2                                               01403000
$DEVFEAT EQU   $DEVCDS+4                                                01404000
$DEVCDSF EQU   $DEVCDS+9                                                01405000
$DEVSDCF EQU   $DEVCDS+10                                               01406000
$$SYMNME EQU   $DEVCDS+12                                               01407000
$DEVFLG1 EQU   $DEVTBLE+20                                              01408000
$EVNCPLT EQU   $DEVFLG1                                                 01409000
$ATTNEXP EQU   $DEVFLG1                                                 01410000
$INTOCC  EQU   $DEVFLG1                                                 01411000
$DEVFLG2 EQU   $DEVTBLE+21                                              01412000
$TESTMDE EQU   $DEVFLG2                                                 01413000
$DEVTECB EQU   $DEVTBLE+22                                              01414000
$OPIS    EQU   $DEVTECB                                                 01415000
$OPND    EQU   $DEVTECB+2                                               01416000
$DEVFLG3 EQU   $DEVTBLE+27                                              01417000
$SIOFLG  EQU   $DEVFLG3                                                 01418000
$IFTOUT  EQU   $DEVTBLE+36                                              01419000
$DEVSESP EQU   $IFTOUT                                                  01420000
$SSCPDAF EQU   $IFTOUT+6                                                01421000
$LDNCBPT EQU   $DEVTBLE+48                                              01422000
$RNINFO  EQU   $DEVTBLE+56                                              01423000
$LINENME EQU   $RNINFO                                                  01424000
$DEVFLG5 EQU   $RNINFO+8                                                01425000
$DEVFLG4 EQU   $DEVTBLE+65                                              01426000
$DEVCNTS EQU   TOLTEPWA+1464                                            01427000
$SLTBL   EQU   TOLTEPWA+1468                                            01428000
$RUNTEST EQU   $SLTBL+13                                                01429000
$TESTFLG EQU   $SLTBL+21                                                01430000
$SECLST  EQU   $SLTBL+22                                                01431000
#EXITA   EQU   TOLTEPWA+2632                                            01432000
$CCOMDAT EQU   TOLTEPWA+2644                                            01433000
$COUTAD  EQU   $CCOMDAT                                                 01434000
$COUTCT  EQU   $CCOMDAT+4                                               01435000
$CINADR  EQU   $CCOMDAT+8                                               01436000
$CINCT   EQU   $CCOMDAT+12                                              01437000
$CFLGS   EQU   $CCOMDAT+16                                              01438000
$C2WAY   EQU   $CFLGS                                                   01439000
$MACID   EQU   TOLTEPWA+2661                                            01440000
$24FEMSG EQU   TOLTEPWA+2681                                            01441000
$24CATMG EQU   $24FEMSG+11                                              01442000
@NM00048 EQU   TOLTEPWA+2776                                            01443000
$OUNTPTR EQU   @NM00048+4                                               01444000
$NSPTR   EQU   $OUNTPTR                                                 01445000
$NSCNT   EQU   @NM00048+10                                              01446000
$ENXX    EQU   @NM00048+15                                              01447000
$IMITX   EQU   $ENXX                                                    01448000
$RQSTPTR EQU   TOLTEPWA+2808                                            01449000
$RQSTSZE EQU   TOLTEPWA+2812                                            01450000
$R13PR3  EQU   TOLTEPWA+2972                                            01451000
SVESC033 EQU   TOLTEPWA+3160                                            01452000
SVECC013 EQU   TOLTEPWA+3232                                            01453000
SVECC014 EQU   TOLTEPWA+3376                                            01454000
SVEIC002 EQU   TOLTEPWA+3520                                            01455000
SVEIC003 EQU   TOLTEPWA+3592                                            01456000
SVESC022 EQU   TOLTEPWA+3736                                            01457000
SVECC011 EQU   TOLTEPWA+4024                                            01458000
ISTAVT   EQU   0                                                        01459000
ISTRETRG EQU   ISTAVT+44                                                01460000
ISTLOK   EQU   0                                                        01461000
LOKCHN   EQU   ISTLOK+1                                                 01462000
LOKCHNG  EQU   LOKCHN                                                   01463000
@NM00052 EQU   LOKCHNG+2                                                01464000
ISTPAB   EQU   0                                                        01465000
PABWQCHN EQU   ISTPAB                                                   01466000
PABWEQA  EQU   PABWQCHN                                                 01467000
PABCHAIN EQU   PABWQCHN+4                                               01468000
PABRPHFG EQU   ISTPAB+12                                                01469000
PABFLAGS EQU   PABRPHFG                                                 01470000
PABEND   EQU   ISTPAB+16                                                01471000
ISTDYPAB EQU   0                                                        01472000
DYPCHAIN EQU   ISTDYPAB+4                                               01473000
DYPPACMD EQU   ISTDYPAB+12                                              01474000
ISTRPH   EQU   0                                                        01475000
RPHCNTL  EQU   ISTRPH                                                   01476000
RPHFLAGS EQU   RPHCNTL+2                                                01477000
RPHFLGB  EQU   RPHCNTL+3                                                01478000
RPHRPHA  EQU   ISTRPH+4                                                 01479000
RPHTSKID EQU   ISTRPH+8                                                 01480000
RPHRESMA EQU   ISTRPH+16                                                01481000
RPHWPFLG EQU   RPHRESMA                                                 01482000
RPHWEA   EQU   ISTRPH+24                                                01483000
RPHSRPRM EQU   ISTRPH+28                                                01484000
RPHWORK  EQU   ISTRPH+36                                                01485000
RPHSAVE1 EQU   RPHWORK                                                  01486000
RPHSBITS EQU   RPHSAVE1+1                                               01487000
ISTATCVT EQU   0                                                        01488000
ATCRPTCH EQU   ISTATCVT                                                 01489000
ATCITFLD EQU   ISTATCVT+8                                               01490000
ATCITPRM EQU   ATCITFLD                                                 01491000
ATCITCDS EQU   ATCITFLD+8                                               01492000
ATCITFLG EQU   ATCITCDS+4                                               01493000
ATCITRA1 EQU   ATCITFLG+2                                               01494000
ATCSMPAB EQU   ISTATCVT+88                                              01495000
ATCLDTIL EQU   ISTATCVT+408                                             01496000
ATCGTSTR EQU   ISTATCVT+644                                             01497000
ATCLUDVT EQU   ISTATCVT+800                                             01498000
ATCANYDT EQU   ISTATCVT+808                                             01499000
@NM00065 EQU   ISTATCVT+812                                             01500000
ATCPODVT EQU   ISTATCVT+832                                             01501000
ATCSSDVT EQU   ISTATCVT+940                                             01502000
ATCSODVT EQU   ISTATCVT+944                                             01503000
ATCMBDVT EQU   ISTATCVT+952                                             01504000
ATCSTAT  EQU   ISTATCVT+972                                             01505000
ATCSTAT1 EQU   ATCSTAT                                                  01506000
@NM00066 EQU   ATCSTAT+1                                                01507000
ATCPOFLG EQU   ATCSTAT+2                                                01508000
ATCSTAT4 EQU   ATCSTAT+3                                                01509000
ATCMTST  EQU   ATCSTAT4                                                 01510000
ATCBITAN EQU   ISTATCVT+976                                             01511000
ATCFLAG2 EQU   ATCBITAN+1                                               01512000
ATCONID  EQU   ISTATCVT+980                                             01513000
ATCSSCPA EQU   ISTATCVT+984                                             01514000
ATCECTLP EQU   ISTATCVT+1024                                            01515000
ATCHPGM  EQU   ISTATCVT+1040                                            01516000
ATCRNO   EQU   ISTATCVT+1044                                            01517000
ATCCPDVT EQU   ISTATCVT+1092                                            01518000
ATCSMSDQ EQU   ISTATCVT+1128                                            01519000
ATCRID   EQU   ISTATCVT+1144                                            01520000
ATCTKFLD EQU   ISTATCVT+1156                                            01521000
ATCIOINT EQU   ISTATCVT+1176                                            01522000
ATCTOD   EQU   ISTATCVT+1220                                            01523000
ATCVRTIL EQU   ISTATCVT+1264                                            01524000
ATCLKSWP EQU   ISTATCVT+1440                                            01525000
ATCWUDYP EQU   ISTATCVT+1448                                            01526000
ATCSQAFR EQU   ISTATCVT+1560                                            01527000
ATCORTCB EQU   ATCSQAFR+4                                               01528000
ATCORSRB EQU   ATCORTCB                                                 01529000
ATCLDAPP EQU   ISTATCVT+1600                                            01530000
ATCDAPVT EQU   ISTATCVT+1620                                            01531000
ATCGSRBQ EQU   ISTATCVT+1672                                            01532000
ATCGSRBG EQU   ATCGSRBQ                                                 01533000
ATCENFLG EQU   ISTATCVT+1722                                            01534000
ATCCSCB  EQU   ISTATCVT+1724                                            01535000
ATCVTFLG EQU   ISTATCVT+1784                                            01536000
@NM00096 EQU   ISTATCVT+1816                                            01537000
ATCCRA   EQU   ISTATCVT+1840                                            01538000
ATCCRACN EQU   ATCCRA+4                                                 01539000
ATCCRPL  EQU   ISTATCVT+1848                                            01540000
ATCRPLCN EQU   ATCCRPL+4                                                01541000
CVTMAP   EQU   0                                                        01542000
CVTDAR   EQU   CVTMAP+72                                                01543000
CVTFLGS1 EQU   CVTDAR                                                   01544000
CVTDCB   EQU   CVTMAP+116                                               01545000
CVTIERLC EQU   CVTMAP+144                                               01546000
CVTOPTA  EQU   CVTMAP+182                                               01547000
CVTOPTB  EQU   CVTMAP+183                                               01548000
CVTGTF   EQU   CVTMAP+236                                               01549000
CVTGTFST EQU   CVTGTF                                                   01550000
CVTGTFS  EQU   CVTGTFST                                                 01551000
CVTSTATE EQU   CVTGTFST                                                 01552000
CVTTMODE EQU   CVTGTFST                                                 01553000
CVTFORM  EQU   CVTGTFST                                                 01554000
CVTAQAVT EQU   CVTMAP+240                                               01555000
CVTTCMFG EQU   CVTAQAVT                                                 01556000
CVTVOLM2 EQU   CVTMAP+244                                               01557000
CVTTATA  EQU   CVTVOLM2                                                 01558000
CVTTSKS  EQU   CVTTATA                                                  01559000
CVTVOLF2 EQU   CVTTSKS                                                  01560000
CVTTAT   EQU   CVTTATA+1                                                01561000
CVTATER  EQU   CVTMAP+248                                               01562000
CVTEXT1  EQU   CVTMAP+252                                               01563000
CVTPURG  EQU   CVTMAP+260                                               01564000
CVTQMSG  EQU   CVTMAP+268                                               01565000
CVTDMSR  EQU   CVTMAP+272                                               01566000
CVTRSV37 EQU   CVTDMSR                                                  01567000
CVTDMSRF EQU   CVTRSV37                                                 01568000
CVTERPV  EQU   CVTMAP+316                                               01569000
CVTINTLA EQU   CVTMAP+320                                               01570000
CVTAPF   EQU   CVTMAP+324                                               01571000
CVTEXT2  EQU   CVTMAP+328                                               01572000
CVTHJES  EQU   CVTMAP+332                                               01573000
CVTPGSIA EQU   CVTMAP+348                                               01574000
CVTA1F1  EQU   CVTMAP+356                                               01575000
CVTSYSK  EQU   CVTMAP+357                                               01576000
CVTVOLM1 EQU   CVTMAP+380                                               01577000
CVTVOLF1 EQU   CVTVOLM1                                                 01578000
CVTXTNT1 EQU   0                                                        01579000
CVTXTNT2 EQU   0                                                        01580000
CVTDSSV  EQU   CVTXTNT2                                                 01581000
CVTFLGBT EQU   CVTXTNT2+5                                               01582000
CVTQID   EQU   CVTXTNT2+24                                              01583000
CVTRV400 EQU   CVTXTNT2+52                                              01584000
CVTRV409 EQU   CVTXTNT2+53                                              01585000
CVTATCVT EQU   CVTXTNT2+64                                              01586000
CVTRV429 EQU   CVTXTNT2+84                                              01587000
CVTRV438 EQU   CVTXTNT2+85                                              01588000
CVTRV457 EQU   CVTXTNT2+112                                             01589000
CVTRV466 EQU   CVTXTNT2+113                                             01590000
CVTFIX   EQU   0                                                        01591000
CVTRELNO EQU   CVTFIX+252                                               01592000
INPARM   EQU   0                                                        01593000
FLAGS    EQU   INPARM                                                   01594000
LEVEL    EQU   INPARM+1                                                 01595000
IDVAL    EQU   INPARM+2                                                 01596000
SMVECTOR EQU   0                                                        01597000
SMID     EQU   SMVECTOR                                                 01598000
SMLLEVL  EQU   SMVECTOR+2                                               01599000
SMHLEVL  EQU   SMVECTOR+3                                               01600000
SMPTR    EQU   SMVECTOR+4                                               01601000
BACKSAVE EQU   0                                                        01602000
REPLYSZE EQU   0                                                        01603000
$TRTBL   EQU   0                                                        01604000
#EXIT    EQU   0                                                        01605000
ISTXDYP  EQU   0                                                        01606000
PABXTNSN EQU   PABEND                                                   01607000
CVTS01   EQU   CVTPGSIA                                                 01608000
CVTLPDIA EQU   CVTS01+12                                                01609000
CVTDIRST EQU   CVTLPDIA                                                 01610000
CVTSLIDA EQU   CVTS01+24                                                01611000
CVTCTLFG EQU   CVTS01+50                                                01612000
CVTRV210 EQU   CVTS01+424                                               01613000
CVTRV219 EQU   CVTS01+425                                               01614000
CVTRV228 EQU   CVTS01+426                                               01615000
CVTRV237 EQU   CVTS01+427                                               01616000
CVTMFRTR EQU   CVTS01+452                                               01617000
CVTRV262 EQU   CVTS01+468                                               01618000
CVTRV271 EQU   CVTS01+469                                               01619000
CVTRV280 EQU   CVTS01+470                                               01620000
CVTRV289 EQU   CVTS01+471                                               01621000
CVTGSDA  EQU   CVTS01+600                                               01622000
SVECC012 EQU   SVESC022                                                 01623000
SVEIC00A EQU   SVEIC003                                                 01624000
SVEIC004 EQU   SVEIC003                                                 01625000
SVEIC005 EQU   SVEIC003                                                 01626000
SVESC02A EQU   SVESC022                                                 01627000
SVESC02B EQU   SVESC022                                                 01628000
SVESC02D EQU   SVESC022                                                 01629000
SVESC02E EQU   SVESC022                                                 01630000
SVESC02F EQU   SVECC013                                                 01631000
SVESC024 EQU   SVESC022                                                 01632000
SVESC027 EQU   SVESC022                                                 01633000
SVESC029 EQU   SVESC033                                                 01634000
SVESC031 EQU   SVECC013                                                 01635000
SVESC032 EQU   SVECC011                                                 01636000
SVETC037 EQU   SVEIC003                                                 01637000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01638000
CVTRV628 EQU   CVTS01+728                                               01639000
CVTRV627 EQU   CVTS01+724                                               01640000
CVTRV626 EQU   CVTS01+720                                               01641000
CVTRV625 EQU   CVTS01+716                                               01642000
CVTRV624 EQU   CVTS01+712                                               01643000
CVTRV623 EQU   CVTS01+708                                               01644000
CVTRV622 EQU   CVTS01+704                                               01645000
CVTRV621 EQU   CVTS01+700                                               01646000
CVTIHASU EQU   CVTS01+696                                               01647000
CVTSUSP  EQU   CVTS01+692                                               01648000
CVTT6SVC EQU   CVTS01+688                                               01649000
CVTCDAL  EQU   CVTS01+684                                               01650000
CVTTCTL  EQU   CVTS01+680                                               01651000
CVTRSUME EQU   CVTS01+676                                               01652000
CVTJTERM EQU   CVTS01+672                                               01653000
CVTASMRM EQU   CVTS01+668                                               01654000
CVTTCASP EQU   CVTS01+664                                               01655000
CVT0PT03 EQU   CVTS01+660                                               01656000
CVT0PT0E EQU   CVTS01+656                                               01657000
CVTRV609 EQU   CVTS01+652                                               01658000
CVTCGK   EQU   CVTS01+648                                               01659000
CVTRAC   EQU   CVTS01+644                                               01660000
CVTRV606 EQU   CVTS01+640                                               01661000
CVTRV605 EQU   CVTS01+636                                               01662000
CVTRV604 EQU   CVTS01+632                                               01663000
CVTEFF02 EQU   CVTS01+628                                               01664000
CVTCBBR  EQU   CVTS01+624                                               01665000
CVTSSCR  EQU   CVTS01+620                                               01666000
CVTEVENT EQU   CVTS01+616                                               01667000
CVTCRCA  EQU   CVTS01+612                                               01668000
CVTTPIO  EQU   CVTS01+608                                               01669000
CVTADV   EQU   CVTS01+604                                               01670000
CVTGSDAB EQU   CVTGSDA                                                  01671000
CVTQV3   EQU   CVTS01+596                                               01672000
CVTQV2   EQU   CVTS01+592                                               01673000
CVTQV1   EQU   CVTS01+588                                               01674000
CVTRPT   EQU   CVTS01+584                                               01675000
CVTSSRB  EQU   CVTS01+580                                               01676000
CVTCSDRL EQU   CVTS01+576                                               01677000
CVTEXP1  EQU   CVTS01+572                                               01678000
CVTRMPMT EQU   CVTS01+568                                               01679000
CVTRMPTT EQU   CVTS01+564                                               01680000
CVTVPSA  EQU   CVTS01+560                                               01681000
CVTVSTOP EQU   CVTS01+556                                               01682000
CVTGTFR8 EQU   CVTS01+552                                               01683000
CVTQUIT  EQU   CVTS01+548                                               01684000
CVTVACR  EQU   CVTS01+544                                               01685000
CVTWTCB  EQU   CVTS01+540                                               01686000
CVTSTPRS EQU   CVTS01+536                                               01687000
CVT0PT02 EQU   CVTS01+532                                               01688000
CVTDARCM EQU   CVTS01+528                                               01689000
CVTIRECM EQU   CVTS01+524                                               01690000
CVTJRECM EQU   CVTS01+520                                               01691000
CVTVEMS0 EQU   CVTS01+516                                               01692000
CVTSPFRR EQU   CVTS01+512                                               01693000
CVTRLSTG EQU   CVTS01+508                                               01694000
CVT0TC0A EQU   CVTS01+504                                               01695000
CVTGMBR  EQU   CVTS01+500                                               01696000
CVTLFRM  EQU   CVTS01+496                                               01697000
CVTRMBR  EQU   CVTS01+492                                               01698000
CVTVIOP  EQU   CVTS01+488                                               01699000
CVTRV307 EQU   CVTS01+486                                               01700000
CVTRV306 EQU   CVTS01+484                                               01701000
CVTRV305 EQU   CVTS01+482                                               01702000
CVTRV304 EQU   CVTS01+480                                               01703000
CVTRV303 EQU   CVTS01+478                                               01704000
CVTRV302 EQU   CVTS01+476                                               01705000
CVTTRCA  EQU   CVTS01+472                                               01706000
CVTRV297 EQU   CVTRV289                                                 01707000
CVTRV296 EQU   CVTRV289                                                 01708000
CVTRV295 EQU   CVTRV289                                                 01709000
CVTRV294 EQU   CVTRV289                                                 01710000
CVTRV293 EQU   CVTRV289                                                 01711000
CVTRV292 EQU   CVTRV289                                                 01712000
CVTRV291 EQU   CVTRV289                                                 01713000
CVTRV290 EQU   CVTRV289                                                 01714000
CVTRV288 EQU   CVTRV280                                                 01715000
CVTRV287 EQU   CVTRV280                                                 01716000
CVTRV286 EQU   CVTRV280                                                 01717000
CVTRV285 EQU   CVTRV280                                                 01718000
CVTRV284 EQU   CVTRV280                                                 01719000
CVTRV283 EQU   CVTRV280                                                 01720000
CVTRV282 EQU   CVTRV280                                                 01721000
CVTRV281 EQU   CVTRV280                                                 01722000
CVTRV279 EQU   CVTRV271                                                 01723000
CVTRV278 EQU   CVTRV271                                                 01724000
CVTRV277 EQU   CVTRV271                                                 01725000
CVTRV276 EQU   CVTRV271                                                 01726000
CVTRV275 EQU   CVTRV271                                                 01727000
CVTRV274 EQU   CVTRV271                                                 01728000
CVTRV273 EQU   CVTRV271                                                 01729000
CVTRV272 EQU   CVTRV271                                                 01730000
CVTRV270 EQU   CVTRV262                                                 01731000
CVTRV269 EQU   CVTRV262                                                 01732000
CVTRV268 EQU   CVTRV262                                                 01733000
CVTRV267 EQU   CVTRV262                                                 01734000
CVTRV266 EQU   CVTRV262                                                 01735000
CVTRV265 EQU   CVTRV262                                                 01736000
CVTRV264 EQU   CVTRV262                                                 01737000
CVTRV263 EQU   CVTRV262                                                 01738000
CVTVFP   EQU   CVTS01+464                                               01739000
CVTVSI   EQU   CVTS01+460                                               01740000
CVTVPSIB EQU   CVTS01+456                                               01741000
CVTMFACT EQU   CVTMFRTR                                                 01742000
CVTMFCTL EQU   CVTS01+448                                               01743000
CVTPVBP  EQU   CVTS01+444                                               01744000
CVTPWI   EQU   CVTS01+440                                               01745000
CVTRV254 EQU   CVTS01+438                                               01746000
CVTRV253 EQU   CVTS01+436                                               01747000
CVTRV252 EQU   CVTS01+434                                               01748000
CVTRV251 EQU   CVTS01+433                                               01749000
CVTRV250 EQU   CVTS01+432                                               01750000
CVTRV249 EQU   CVTS01+431                                               01751000
CVTRV248 EQU   CVTS01+430                                               01752000
CVTRV247 EQU   CVTS01+429                                               01753000
CVTRV246 EQU   CVTS01+428                                               01754000
CVTRV245 EQU   CVTRV237                                                 01755000
CVTRV244 EQU   CVTRV237                                                 01756000
CVTRV243 EQU   CVTRV237                                                 01757000
CVTRV242 EQU   CVTRV237                                                 01758000
CVTRV241 EQU   CVTRV237                                                 01759000
CVTRV240 EQU   CVTRV237                                                 01760000
CVTRV239 EQU   CVTRV237                                                 01761000
CVTRV238 EQU   CVTRV237                                                 01762000
CVTRV236 EQU   CVTRV228                                                 01763000
CVTRV235 EQU   CVTRV228                                                 01764000
CVTRV234 EQU   CVTRV228                                                 01765000
CVTRV233 EQU   CVTRV228                                                 01766000
CVTRV232 EQU   CVTRV228                                                 01767000
CVTRV231 EQU   CVTRV228                                                 01768000
CVTRV230 EQU   CVTRV228                                                 01769000
CVTRV229 EQU   CVTRV228                                                 01770000
CVTRV227 EQU   CVTRV219                                                 01771000
CVTRV226 EQU   CVTRV219                                                 01772000
CVTRV225 EQU   CVTRV219                                                 01773000
CVTRV224 EQU   CVTRV219                                                 01774000
CVTRV223 EQU   CVTRV219                                                 01775000
CVTRV222 EQU   CVTRV219                                                 01776000
CVTRV221 EQU   CVTRV219                                                 01777000
CVTRV220 EQU   CVTRV219                                                 01778000
CVTRV218 EQU   CVTRV210                                                 01779000
CVTRV217 EQU   CVTRV210                                                 01780000
CVTRV216 EQU   CVTRV210                                                 01781000
CVTRV215 EQU   CVTRV210                                                 01782000
CVTRV214 EQU   CVTRV210                                                 01783000
CVTRV213 EQU   CVTRV210                                                 01784000
CVTRV212 EQU   CVTRV210                                                 01785000
CVTRV211 EQU   CVTRV210                                                 01786000
CVTLCCAT EQU   CVTS01+420                                               01787000
CVTPCCAT EQU   CVTS01+416                                               01788000
CVTIPCRP EQU   CVTS01+412                                               01789000
CVTIPCRI EQU   CVTS01+408                                               01790000
CVTIPCDS EQU   CVTS01+404                                               01791000
CVTAIDVT EQU   CVTS01+400                                               01792000
CVTSSAP  EQU   CVTS01+396                                               01793000
CVTEHCIR EQU   CVTS01+392                                               01794000
CVTEHDEF EQU   CVTS01+388                                               01795000
CVTDAIR  EQU   CVTS01+384                                               01796000
CVTPERFM EQU   CVTS01+380                                               01797000
CVT044R2 EQU   CVTS01+376                                               01798000
CVTFETCH EQU   CVTS01+372                                               01799000
CVTRSTWD EQU   CVTS01+368                                               01800000
CVTSPOST EQU   CVTS01+364                                               01801000
CVTIOBP  EQU   CVTS01+360                                               01802000
CVTASMVT EQU   CVTS01+356                                               01803000
CVTRECRQ EQU   CVTS01+352                                               01804000
CVTWSAC  EQU   CVTS01+348                                               01805000
CVTRV149 EQU   CVTS01+344                                               01806000
CVTWSAL  EQU   CVTS01+340                                               01807000
CVTSPSA  EQU   CVTS01+336                                               01808000
CVTGLMN  EQU   CVTS01+332                                               01809000
CVTVEAC0 EQU   CVTS01+328                                               01810000
CVT062R1 EQU   CVTS01+324                                               01811000
CVTRPOST EQU   CVTS01+320                                               01812000
CVTDQIQE EQU   CVTS01+316                                               01813000
CVTCSD   EQU   CVTS01+312                                               01814000
CVTLKRMA EQU   CVTS01+308                                               01815000
CVTRSPIE EQU   CVTS01+304                                               01816000
CVTRENQ  EQU   CVTS01+300                                               01817000
CVTLQCB  EQU   CVTS01+296                                               01818000
CVTFQCB  EQU   CVTS01+292                                               01819000
CVTQCS01 EQU   CVTS01+288                                               01820000
CVTAPFT  EQU   CVTS01+284                                               01821000
CVTPARRL EQU   CVTS01+280                                               01822000
CVTVWAIT EQU   CVTS01+276                                               01823000
CVTGSPL  EQU   CVTS01+272                                               01824000
CVTLSMQ  EQU   CVTS01+268                                               01825000
CVTGSMQ  EQU   CVTS01+264                                               01826000
CVTEXPRO EQU   CVTS01+260                                               01827000
CVTOPCTP EQU   CVTS01+256                                               01828000
CVTSIC   EQU   CVTS01+252                                               01829000
CVTTPIOS EQU   CVTS01+248                                               01830000
CVTRTMS  EQU   CVTS01+244                                               01831000
CVTSDBF  EQU   CVTS01+240                                               01832000
CVTSCBP  EQU   CVTS01+236                                               01833000
CVTSDMP  EQU   CVTS01+232                                               01834000
CVTSV60  EQU   CVTS01+228                                               01835000
CVTRTMCT EQU   CVTS01+224                                               01836000
CVTASCBL EQU   CVTS01+220                                               01837000
CVTASCBH EQU   CVTS01+216                                               01838000
CVTGDA   EQU   CVTS01+212                                               01839000
CVTASVT  EQU   CVTS01+208                                               01840000
CVTVVMDI EQU   CVTS01+204                                               01841000
CVTAQTOP EQU   CVTS01+200                                               01842000
CVTIOSCS EQU   CVTS01+196                                               01843000
CVTSDRM  EQU   CVTS01+192                                               01844000
CVTOPTE  EQU   CVTS01+188                                               01845000
CVTSTXU  EQU   CVTS01+184                                               01846000
CVTQUIS  EQU   CVTS01+180                                               01847000
CVTPARS  EQU   CVTS01+176                                               01848000
CVTS1EE  EQU   CVTS01+172                                               01849000
CVTFRAS  EQU   CVTS01+168                                               01850000
CVTQSAS  EQU   CVTS01+164                                               01851000
CVTCRAS  EQU   CVTS01+160                                               01852000
CVTCRMN  EQU   CVTS01+156                                               01853000
CVTDELCP EQU   CVTS01+152                                               01854000
CVTFRECL EQU   CVTS01+148                                               01855000
CVTGETCL EQU   CVTS01+144                                               01856000
CVTBLDCP EQU   CVTS01+140                                               01857000
CVTAUTHL EQU   CVTS01+136                                               01858000
CVTSCAN  EQU   CVTS01+132                                               01859000
CVTRV144 EQU   CVTS01+130                                               01860000
CVTMAXMP EQU   CVTS01+128                                               01861000
CVTSTCK  EQU   CVTS01+124                                               01862000
CVTRV139 EQU   CVTS01+123                                               01863000
CVTDSSAC EQU   CVTS01+122                                               01864000
CVTRV513 EQU   CVTS01+121                                               01865000
CVTIOSPL EQU   CVTS01+120                                               01866000
CVTPTGT  EQU   CVTS01+116                                               01867000
CVTCSPIE EQU   CVTS01+112                                               01868000
CVTSMFEX EQU   CVTS01+108                                               01869000
CVTOLT0A EQU   CVTS01+104                                               01870000
CVTSRBRT EQU   CVTS01+100                                               01871000
CVTPUTL  EQU   CVTS01+96                                                01872000
CVTASCRL EQU   CVTS01+92                                                01873000
CVTASCRF EQU   CVTS01+88                                                01874000
CVTRV326 EQU   CVTS01+84                                                01875000
CVTRV325 EQU   CVTS01+80                                                01876000
CVTRV324 EQU   CVTS01+76                                                01877000
CVT0VL01 EQU   CVTS01+72                                                01878000
CVTSHRVM EQU   CVTS01+68                                                01879000
CVTRV332 EQU   CVTS01+64                                                01880000
CVTTAS   EQU   CVTS01+60                                                01881000
CVTRSCN  EQU   CVTS01+56                                                01882000
CVTTRAC2 EQU   CVTS01+54                                                01883000
CVTTRACE EQU   CVTS01+52                                                01884000
CVTAPG   EQU   CVTS01+51                                                01885000
CVTSDTRC EQU   CVTCTLFG                                                 01886000
CVTGTRCE EQU   CVTCTLFG                                                 01887000
CVTNOMP  EQU   CVTCTLFG                                                 01888000
CVTRSV79 EQU   CVTCTLFG                                                 01889000
CVTDSTAT EQU   CVTCTLFG                                                 01890000
CVTRSV78 EQU   CVTCTLFG                                                 01891000
CVTRV333 EQU   CVTCTLFG                                                 01892000
CVTRV323 EQU   CVTCTLFG                                                 01893000
CVTSPVLK EQU   CVTS01+49                                                01894000
CVTRSV77 EQU   CVTS01+48                                                01895000
CVTRV331 EQU   CVTS01+44                                                01896000
CVTRV330 EQU   CVTS01+40                                                01897000
CVTRV329 EQU   CVTS01+36                                                01898000
CVTRV328 EQU   CVTS01+32                                                01899000
CVTRV322 EQU   CVTS01+28                                                01900000
CVTSLID  EQU   CVTSLIDA+1                                               01901000
CVTSYLK  EQU   CVTSLIDA                                                 01902000
CVTRV321 EQU   CVTS01+20                                                01903000
CVTRV320 EQU   CVTS01+16                                                01904000
CVTLPDIR EQU   CVTLPDIA+1                                               01905000
CVTRSV69 EQU   CVTDIRST                                                 01906000
CVTRSV68 EQU   CVTDIRST                                                 01907000
CVTRSV67 EQU   CVTDIRST                                                 01908000
CVTRSV66 EQU   CVTDIRST                                                 01909000
CVTRSV65 EQU   CVTDIRST                                                 01910000
CVTRSV64 EQU   CVTDIRST                                                 01911000
CVTRSV63 EQU   CVTDIRST                                                 01912000
CVTDICOM EQU   CVTDIRST                                                 01913000
CVTPVTP  EQU   CVTS01+8                                                 01914000
CVTLPDSR EQU   CVTS01+4                                                 01915000
CVTGETL  EQU   CVTS01                                                   01916000
@NM00057 EQU   PABXTNSN+12                                              01917000
PABNPSSQ EQU   PABXTNSN+8                                               01918000
PABLOCK  EQU   PABXTNSN+4                                               01919000
PABLAST  EQU   PABXTNSN                                                 01920000
CVTLEVL  EQU   CVTRELNO+2                                               01921000
CVTNUMB  EQU   CVTRELNO                                                 01922000
CVTMDL   EQU   CVTFIX+250                                               01923000
@NM00101 EQU   CVTFIX+248                                               01924000
@NM00100 EQU   CVTFIX                                                   01925000
CVTRV482 EQU   CVTXTNT2+128                                             01926000
CVTRV481 EQU   CVTXTNT2+124                                             01927000
CVTRV480 EQU   CVTXTNT2+120                                             01928000
CVTRV479 EQU   CVTXTNT2+118                                             01929000
CVTRV478 EQU   CVTXTNT2+117                                             01930000
CVTRV477 EQU   CVTXTNT2+116                                             01931000
CVTRV476 EQU   CVTXTNT2+115                                             01932000
CVTRV475 EQU   CVTXTNT2+114                                             01933000
CVTRV474 EQU   CVTRV466                                                 01934000
CVTRV473 EQU   CVTRV466                                                 01935000
CVTRV472 EQU   CVTRV466                                                 01936000
CVTRV471 EQU   CVTRV466                                                 01937000
CVTRV470 EQU   CVTRV466                                                 01938000
CVTRV469 EQU   CVTRV466                                                 01939000
CVTRV468 EQU   CVTRV466                                                 01940000
CVTRV467 EQU   CVTRV466                                                 01941000
CVTRV465 EQU   CVTRV457                                                 01942000
CVTRV464 EQU   CVTRV457                                                 01943000
CVTRV463 EQU   CVTRV457                                                 01944000
CVTRV462 EQU   CVTRV457                                                 01945000
CVTRV461 EQU   CVTRV457                                                 01946000
CVTRV460 EQU   CVTRV457                                                 01947000
CVTRV459 EQU   CVTRV457                                                 01948000
CVTRV458 EQU   CVTRV457                                                 01949000
CVTRV456 EQU   CVTXTNT2+108                                             01950000
CVTRV455 EQU   CVTXTNT2+104                                             01951000
CVTRV454 EQU   CVTXTNT2+100                                             01952000
CVTRV453 EQU   CVTXTNT2+96                                              01953000
CVTRV452 EQU   CVTXTNT2+94                                              01954000
CVTRV451 EQU   CVTXTNT2+92                                              01955000
CVTRV450 EQU   CVTXTNT2+90                                              01956000
CVTRV449 EQU   CVTXTNT2+88                                              01957000
CVTRV448 EQU   CVTXTNT2+87                                              01958000
CVTRV447 EQU   CVTXTNT2+86                                              01959000
CVTRV446 EQU   CVTRV438                                                 01960000
CVTRV445 EQU   CVTRV438                                                 01961000
CVTRV444 EQU   CVTRV438                                                 01962000
CVTRV443 EQU   CVTRV438                                                 01963000
CVTRV442 EQU   CVTRV438                                                 01964000
CVTRV441 EQU   CVTRV438                                                 01965000
CVTRV440 EQU   CVTRV438                                                 01966000
CVTRV439 EQU   CVTRV438                                                 01967000
CVTRV437 EQU   CVTRV429                                                 01968000
CVTRV436 EQU   CVTRV429                                                 01969000
CVTRV435 EQU   CVTRV429                                                 01970000
CVTRV434 EQU   CVTRV429                                                 01971000
CVTRV433 EQU   CVTRV429                                                 01972000
CVTRV432 EQU   CVTRV429                                                 01973000
CVTRV431 EQU   CVTRV429                                                 01974000
CVTRV430 EQU   CVTRV429                                                 01975000
CVTRV428 EQU   CVTXTNT2+80                                              01976000
CVTRV427 EQU   CVTXTNT2+76                                              01977000
CVTRV426 EQU   CVTXTNT2+72                                              01978000
CVTRV425 EQU   CVTXTNT2+68                                              01979000
CVTATACT EQU   CVTATCVT                                                 01980000
CVTRV423 EQU   CVTXTNT2+62                                              01981000
CVTRV422 EQU   CVTXTNT2+60                                              01982000
CVTRV421 EQU   CVTXTNT2+58                                              01983000
CVTRV420 EQU   CVTXTNT2+56                                              01984000
CVTRV419 EQU   CVTXTNT2+55                                              01985000
CVTRV418 EQU   CVTXTNT2+54                                              01986000
CVTRV417 EQU   CVTRV409                                                 01987000
CVTRV416 EQU   CVTRV409                                                 01988000
CVTRV415 EQU   CVTRV409                                                 01989000
CVTRV414 EQU   CVTRV409                                                 01990000
CVTRV413 EQU   CVTRV409                                                 01991000
CVTRV412 EQU   CVTRV409                                                 01992000
CVTRV411 EQU   CVTRV409                                                 01993000
CVTRV410 EQU   CVTRV409                                                 01994000
CVTRV408 EQU   CVTRV400                                                 01995000
CVTRV407 EQU   CVTRV400                                                 01996000
CVTRV406 EQU   CVTRV400                                                 01997000
CVTRV405 EQU   CVTRV400                                                 01998000
CVTRV404 EQU   CVTRV400                                                 01999000
CVTRV403 EQU   CVTRV400                                                 02000000
CVTRV402 EQU   CVTRV400                                                 02001000
CVTRV401 EQU   CVTRV400                                                 02002000
CVTICB   EQU   CVTXTNT2+48                                              02003000
CVTSKTA  EQU   CVTXTNT2+44                                              02004000
CVTCCVT  EQU   CVTXTNT2+40                                              02005000
CVTRSV98 EQU   CVTXTNT2+36                                              02006000
CVTRSV97 EQU   CVTXTNT2+34                                              02007000
CVTRSV96 EQU   CVTXTNT2+32                                              02008000
CVTOLTEP EQU   CVTXTNT2+28                                              02009000
CVTQIDA  EQU   CVTQID+1                                                 02010000
CVTRSV95 EQU   CVTQID                                                   02011000
CVTRSV94 EQU   CVTXTNT2+20                                              02012000
CVTRSV93 EQU   CVTXTNT2+16                                              02013000
CVTRSV92 EQU   CVTXTNT2+12                                              02014000
CVTDEBVR EQU   CVTXTNT2+8                                               02015000
CVTRSV91 EQU   CVTXTNT2+6                                               02016000
CVTRSV9H EQU   CVTFLGBT                                                 02017000
CVTRSV9G EQU   CVTFLGBT                                                 02018000
CVTRSV9F EQU   CVTFLGBT                                                 02019000
CVTRSV9E EQU   CVTFLGBT                                                 02020000
CVTRSV9D EQU   CVTFLGBT                                                 02021000
CVTBAH   EQU   CVTFLGBT                                                 02022000
CVTVME   EQU   CVTFLGBT                                                 02023000
CVTNPE   EQU   CVTFLGBT                                                 02024000
CVTNUCLS EQU   CVTXTNT2+4                                               02025000
CVTDSSVA EQU   CVTDSSV+1                                                02026000
CVTRSV89 EQU   CVTDSSV                                                  02027000
CVTRSV88 EQU   CVTXTNT1+8                                               02028000
CVTRSV87 EQU   CVTXTNT1+4                                               02029000
CVTFACHN EQU   CVTXTNT1                                                 02030000
CVTRV488 EQU   CVTMAP+412                                               02031000
CVTRV487 EQU   CVTMAP+408                                               02032000
CVTRV486 EQU   CVTMAP+404                                               02033000
CVTRV485 EQU   CVTMAP+400                                               02034000
CVTACTAP EQU   CVTMAP+396                                               02035000
CVTAUTH  EQU   CVTMAP+392                                               02036000
CVTRV490 EQU   CVTMAP+388                                               02037000
CVTSU    EQU   CVTMAP+384                                               02038000
CVTVOLT1 EQU   CVTVOLM1+1                                               02039000
CVTVOLI1 EQU   CVTVOLF1                                                 02040000
CVTSTOA  EQU   CVTMAP+376                                               02041000
CVTRSV58 EQU   CVTMAP+374                                               02042000
CVTRSV57 EQU   CVTMAP+372                                               02043000
CVTDDCE  EQU   CVTMAP+368                                               02044000
CVTPNWFR EQU   CVTMAP+364                                               02045000
CVTSMF   EQU   CVTMAP+360                                               02046000
CVTSULK  EQU   CVTMAP+358                                               02047000
CVTSLKO  EQU   CVTSYSK                                                  02048000
CVTSLKP  EQU   CVTSYSK                                                  02049000
CVTSLKQ  EQU   CVTSYSK                                                  02050000
CVTSLKR  EQU   CVTSYSK                                                  02051000
CVTRSV56 EQU   CVTSYSK                                                  02052000
CVTRSV55 EQU   CVTSYSK                                                  02053000
CVTRSV54 EQU   CVTSYSK                                                  02054000
CVTRSV53 EQU   CVTSYSK                                                  02055000
CVTRSV52 EQU   CVTA1F1                                                  02056000
CVTRSV51 EQU   CVTA1F1                                                  02057000
CVTRSV50 EQU   CVTA1F1                                                  02058000
CVTRSV49 EQU   CVTA1F1                                                  02059000
CVTRSV48 EQU   CVTA1F1                                                  02060000
CVTRSV47 EQU   CVTA1F1                                                  02061000
CVTSRSW  EQU   CVTA1F1                                                  02062000
CVTPFSW  EQU   CVTA1F1                                                  02063000
CVTPCVT  EQU   CVTMAP+352                                               02064000
CVTRSV46 EQU   CVTMAP+344                                               02065000
CVTRSV45 EQU   CVTMAP+340                                               02066000
CVTRSV44 EQU   CVTMAP+338                                               02067000
CVTRSV43 EQU   CVTMAP+336                                               02068000
CVTHJESA EQU   CVTHJES+1                                                02069000
CVTRSV42 EQU   CVTHJES                                                  02070000
CVTEXT2A EQU   CVTEXT2+1                                                02071000
CVTRSV41 EQU   CVTEXT2                                                  02072000
CVTAPFA  EQU   CVTAPF+1                                                 02073000
CVTRSV40 EQU   CVTAPF                                                   02074000
CVTRV518 EQU   CVTINTLA                                                 02075000
CVTRV517 EQU   CVTERPV                                                  02076000
CVTEORM  EQU   CVTMAP+312                                               02077000
CVTMCHPR EQU   CVTMAP+308                                               02078000
CVTTZ    EQU   CVTMAP+304                                               02079000
CVTJEPS  EQU   CVTMAP+300                                               02080000
CVTJESCT EQU   CVTMAP+296                                               02081000
CVTMODE  EQU   CVTMAP+292                                               02082000
CVTPTRV  EQU   CVTMAP+288                                               02083000
CVTREAL  EQU   CVTMAP+284                                               02084000
CVTRSV39 EQU   CVTMAP+280                                               02085000
CVTRSV38 EQU   CVTMAP+276                                               02086000
CVTDMSRA EQU   CVTDMSR+1                                                02087000
CVTRV634 EQU   CVTDMSRF                                                 02088000
CVTRV633 EQU   CVTDMSRF                                                 02089000
CVTRV632 EQU   CVTDMSRF                                                 02090000
CVTRV631 EQU   CVTDMSRF                                                 02091000
CVTRV630 EQU   CVTDMSRF                                                 02092000
CVTRV629 EQU   CVTDMSRF                                                 02093000
CVTUDUMP EQU   CVTDMSRF                                                 02094000
CVTSDUMP EQU   CVTDMSRF                                                 02095000
CVTQMSGA EQU   CVTQMSG+1                                                02096000
CVTRSV36 EQU   CVTQMSG                                                  02097000
CVTAMFF  EQU   CVTMAP+264                                               02098000
CVTPURGA EQU   CVTPURG+1                                                02099000
CVTRSV35 EQU   CVTPURG                                                  02100000
CVTCBSP  EQU   CVTMAP+256                                               02101000
CVTATERA EQU   CVTATER+1                                                02102000
CVTSYST  EQU   CVTATER                                                  02103000
CVTVOLT2 EQU   CVTTAT                                                   02104000
CVTVOLI2 EQU   CVTVOLF2                                                 02105000
CVTAQAVB EQU   CVTAQAVT+1                                               02106000
CVTRSV34 EQU   CVTTCMFG                                                 02107000
CVTRSV33 EQU   CVTTCMFG                                                 02108000
CVTRSV32 EQU   CVTTCMFG                                                 02109000
CVTRSV31 EQU   CVTTCMFG                                                 02110000
CVTRSV30 EQU   CVTTCMFG                                                 02111000
CVTRSV29 EQU   CVTTCMFG                                                 02112000
CVTLDEV  EQU   CVTTCMFG                                                 02113000
CVTTCRDY EQU   CVTTCMFG                                                 02114000
CVTGTFA  EQU   CVTGTF+1                                                 02115000
CVTRSV27 EQU   CVTGTFST                                                 02116000
CVTRNIO  EQU   CVTGTFST                                                 02117000
CVTUSR   EQU   CVTGTFST                                                 02118000
CVTRV318 EQU   CVTFORM                                                  02119000
CVTRV317 EQU   CVTTMODE                                                 02120000
CVTRV316 EQU   CVTSTATE                                                 02121000
CVTRV315 EQU   CVTGTFS                                                  02122000
CVTGTFAV EQU   CVTGTFS                                                  02123000
CVT0SCR1 EQU   CVTMAP+232                                               02124000
CVTRV515 EQU   CVTMAP+228                                               02125000
CVTRMS   EQU   CVTMAP+224                                               02126000
CVTPATCH EQU   CVTMAP+220                                               02127000
CVTTSCE  EQU   CVTMAP+216                                               02128000
CVTLNKSC EQU   CVTMAP+214                                               02129000
CVTQABST EQU   CVTMAP+212                                               02130000
CVTMDLDS EQU   CVTMAP+208                                               02131000
CVTUSER  EQU   CVTMAP+204                                               02132000
CVTABEND EQU   CVTMAP+200                                               02133000
CVTSMCA  EQU   CVTMAP+196                                               02134000
CVTRSV18 EQU   CVTMAP+192                                               02135000
CVTQLPAQ EQU   CVTMAP+188                                               02136000
CVTQCDSR EQU   CVTMAP+184                                               02137000
CVTVS1B  EQU   CVTOPTB                                                  02138000
CVTVS1A  EQU   CVTOPTB                                                  02139000
CVTFP    EQU   CVTOPTB                                                  02140000
CVTAPTHR EQU   CVTOPTB                                                  02141000
CVTNLOG  EQU   CVTOPTB                                                  02142000
CVTTOD   EQU   CVTOPTB                                                  02143000
CVTCTIMS EQU   CVTOPTB                                                  02144000
CVTPROT  EQU   CVTOPTB                                                  02145000
CVTXPFP  EQU   CVTOPTA                                                  02146000
CVTASCII EQU   CVTOPTA                                                  02147000
CVTRSV13 EQU   CVTOPTA                                                  02148000
CVTRSV12 EQU   CVTOPTA                                                  02149000
CVTNIP   EQU   CVTOPTA                                                  02150000
CVTDDR   EQU   CVTOPTA                                                  02151000
CVTAPR   EQU   CVTOPTA                                                  02152000
CVTCCH   EQU   CVTOPTA                                                  02153000
CVTSNCTR EQU   CVTMAP+180                                               02154000
CVTQMWR  EQU   CVTMAP+176                                               02155000
CVTQOCR  EQU   CVTMAP+172                                               02156000
CVT1EF00 EQU   CVTMAP+168                                               02157000
CVTMZ00  EQU   CVTMAP+164                                               02158000
CVTHEAD  EQU   CVTMAP+160                                               02159000
CVTRSV11 EQU   CVTMAP+156                                               02160000
CVT0PT01 EQU   CVTMAP+152                                               02161000
CVTMSER  EQU   CVTMAP+148                                               02162000
CVTRV516 EQU   CVTIERLC                                                 02163000
CVTILCH  EQU   CVTMAP+140                                               02164000
CVT0DS   EQU   CVTMAP+136                                               02165000
CVTFBOSV EQU   CVTMAP+132                                               02166000
CVTNUCB  EQU   CVTMAP+128                                               02167000
CVTIXAVL EQU   CVTMAP+124                                               02168000
CVTIOQET EQU   CVTMAP+120                                               02169000
CVTDCBA  EQU   CVTMAP+117                                               02170000
CVTMVS2  EQU   CVTDCB                                                   02171000
CVT6DAT  EQU   CVTDCB                                                   02172000
CVT4MPS  EQU   CVTDCB                                                   02173000
CVTRSV09 EQU   CVTDCB                                                   02174000
CVT4MS1  EQU   CVTDCB                                                   02175000
CVT2SPS  EQU   CVTDCB                                                   02176000
CVT1SSS  EQU   CVTDCB                                                   02177000
CVTRSV08 EQU   CVTDCB                                                   02178000
CVTSTB   EQU   CVTMAP+112                                               02179000
CVTQTD00 EQU   CVTMAP+108                                               02180000
CVTQTE00 EQU   CVTMAP+104                                               02181000
CVTCUCB  EQU   CVTMAP+100                                               02182000
CVTSJQ   EQU   CVTMAP+96                                                02183000
CVTPBLDL EQU   CVTMAP+92                                                02184000
CVTTPC   EQU   CVTMAP+88                                                02185000
CVTSVDCB EQU   CVTMAP+84                                                02186000
CVTBRET  EQU   CVTMAP+82                                                02187000
CVTEXIT  EQU   CVTMAP+80                                                02188000
CVT0FN00 EQU   CVTMAP+76                                                02189000
CVTDARA  EQU   CVTDAR+1                                                 02190000
CVTRSV07 EQU   CVTFLGS1                                                 02191000
CVTRSV06 EQU   CVTFLGS1                                                 02192000
CVTRSV05 EQU   CVTFLGS1                                                 02193000
CVTRSV04 EQU   CVTFLGS1                                                 02194000
CVTRSV03 EQU   CVTFLGS1                                                 02195000
CVTRSV02 EQU   CVTFLGS1                                                 02196000
CVTRSV01 EQU   CVTFLGS1                                                 02197000
CVTDMPLK EQU   CVTFLGS1                                                 02198000
CVTXITP  EQU   CVTMAP+68                                                02199000
CVTZDTAB EQU   CVTMAP+64                                                02200000
CVTMSLT  EQU   CVTMAP+60                                                02201000
CVTDATE  EQU   CVTMAP+56                                                02202000
CVTBTERM EQU   CVTMAP+52                                                02203000
CVTSYSAD EQU   CVTMAP+48                                                02204000
CVTXTLER EQU   CVTMAP+44                                                02205000
CVTILK2  EQU   CVTMAP+40                                                02206000
CVTILK1  EQU   CVTMAP+36                                                02207000
CVTPRLTV EQU   CVTMAP+32                                                02208000
CVTPCNVT EQU   CVTMAP+28                                                02209000
CVT0VL00 EQU   CVTMAP+24                                                02210000
CVTXAPG  EQU   CVTMAP+20                                                02211000
CVTBUF   EQU   CVTMAP+16                                                02212000
CVTJOB   EQU   CVTMAP+12                                                02213000
CVTLINK  EQU   CVTMAP+8                                                 02214000
CVT0EF00 EQU   CVTMAP+4                                                 02215000
CVTTCBP  EQU   CVTMAP                                                   02216000
CVT      EQU   CVTMAP                                                   02217000
ATCAOS   EQU   ISTATCVT+2184                                            02218000
@NM00099 EQU   ISTATCVT+1924                                            02219000
ATCINCTV EQU   ISTATCVT+1920                                            02220000
@NM00098 EQU   ISTATCVT+1918                                            02221000
ATCSAF   EQU   ISTATCVT+1916                                            02222000
ATCAPCSX EQU   ISTATCVT+1912                                            02223000
ATCTSC3I EQU   ISTATCVT+1908                                            02224000
ATCHWCSA EQU   ISTATCVT+1904                                            02225000
ATCAPCRM EQU   ISTATCVT+1900                                            02226000
ATCAPCFR EQU   ISTATCVT+1896                                            02227000
ATCCACSA EQU   ISTATCVT+1892                                            02228000
ATCMXCSA EQU   ISTATCVT+1888                                            02229000
ATCTPMPB EQU   ISTATCVT+1856                                            02230000
ATCRPLAC EQU   ATCRPLCN+2                                               02231000
ATCRPLRC EQU   ATCRPLCN                                                 02232000
ATCCRPLQ EQU   ATCCRPL                                                  02233000
ATCCRAAC EQU   ATCCRACN+2                                               02234000
ATCCRARC EQU   ATCCRACN                                                 02235000
ATCCRAQ  EQU   ATCCRA                                                   02236000
ATCITSAV EQU   ISTATCVT+1836                                            02237000
ATCVIOPM EQU   ISTATCVT+1832                                            02238000
ATCTPMMI EQU   ISTATCVT+1828                                            02239000
ATCPXSRB EQU   ISTATCVT+1824                                            02240000
ATCRPLCT EQU   ISTATCVT+1822                                            02241000
ATCCRACT EQU   ISTATCVT+1820                                            02242000
ATCSRBCT EQU   ISTATCVT+1818                                            02243000
ATCSTNSM EQU   ISTATCVT+1817                                            02244000
@NM00097 EQU   @NM00096                                                 02245000
ATCNOSTR EQU   @NM00096                                                 02246000
ATCVTMAB EQU   @NM00096                                                 02247000
ATCTPCP1 EQU   ISTATCVT+1812                                            02248000
ATCTPCP0 EQU   ISTATCVT+1808                                            02249000
ATCZR01  EQU   ISTATCVT+1804                                            02250000
ATCASCB  EQU   ISTATCVT+1800                                            02251000
ATCMPSTQ EQU   ISTATCVT+1796                                            02252000
ATCOCCSM EQU   ISTATCVT+1792                                            02253000
ATCPSTA  EQU   ISTATCVT+1788                                            02254000
@NM00095 EQU   ATCVTFLG                                                 02255000
ATCVTACT EQU   ATCVTFLG                                                 02256000
@NM00094 EQU   ISTATCVT+1732                                            02257000
ATCTRMWA EQU   ISTATCVT+1728                                            02258000
ATCCSCBG EQU   ATCCSCB                                                  02259000
@NM00093 EQU   ISTATCVT+1723                                            02260000
ATCSNUF  EQU   ATCENFLG                                                 02261000
ATCOPKL  EQU   ATCENFLG                                                 02262000
ATCABEN  EQU   ATCENFLG                                                 02263000
ATCSRDN  EQU   ATCENFLG                                                 02264000
ATCDLDN  EQU   ATCENFLG                                                 02265000
ATCACTRM EQU   ISTATCVT+1720                                            02266000
ATCSMABF EQU   ISTATCVT+1716                                            02267000
ATCSMAPR EQU   ISTATCVT+1712                                            02268000
ATCSMAID EQU   ISTATCVT+1708                                            02269000
ATCSMARA EQU   ISTATCVT+1704                                            02270000
ATCCACXA EQU   ISTATCVT+1700                                            02271000
ATCATA10 EQU   ISTATCVT+1696                                            02272000
ATCHLTCB EQU   ISTATCVT+1692                                            02273000
ATCCCOOC EQU   ISTATCVT+1688                                            02274000
ATCAIWT  EQU   ISTATCVT+1684                                            02275000
ATCOROBT EQU   ISTATCVT+1680                                            02276000
ATCPXCRA EQU   ISTATCVT+1676                                            02277000
ATCGSRBF EQU   ATCGSRBG                                                 02278000
ATCTSCPC EQU   ISTATCVT+1668                                            02279000
ATCCDTCB EQU   ISTATCVT+1664                                            02280000
ATCORFRL EQU   ISTATCVT+1660                                            02281000
ATCORFPX EQU   ISTATCVT+1656                                            02282000
ATCORFMG EQU   ISTATCVT+1652                                            02283000
ATCSMBQ  EQU   ISTATCVT+1648                                            02284000
ATCINFDD EQU   ISTATCVT+1644                                            02285000
@NM00092 EQU   ATCDAPVT+22                                              02286000
ATCDAPDG EQU   ATCDAPVT+20                                              02287000
ATCDXCEA EQU   ATCDAPVT+16                                              02288000
ATCDCEA  EQU   ATCDAPVT+12                                              02289000
ATCDPCIA EQU   ATCDAPVT+8                                               02290000
ATCDSIOA EQU   ATCDAPVT+4                                               02291000
ATCDEOEA EQU   ATCDAPVT                                                 02292000
ATCZLAEA EQU   ATCLDAPP+16                                              02293000
ATCZLCEA EQU   ATCLDAPP+12                                              02294000
ATCZLPCI EQU   ATCLDAPP+8                                               02295000
ATCSMFRR EQU   ATCLDAPP+4                                               02296000
ATCCDTID EQU   ATCLDAPP                                                 02297000
ATCTRMPB EQU   ISTATCVT+1568                                            02298000
ATCORQG  EQU   ATCORSRB                                                 02299000
ATCORTBF EQU   ATCSQAFR                                                 02300000
@NM00091 EQU   ISTATCVT+1560                                            02301000
@NM00090 EQU   ISTATCVT+1532                                            02302000
ATCCDCNE EQU   ISTATCVT+1528                                            02303000
@NM00089 EQU   ISTATCVT+1526                                            02304000
ATCHASHN EQU   ISTATCVT+1524                                            02305000
ATCNOST  EQU   ISTATCVT+1520                                            02306000
ATCSMMWA EQU   ISTATCVT+1516                                            02307000
ATCSDCFR EQU   ISTATCVT+1512                                            02308000
ATCTSCRA EQU   ISTATCVT+1508                                            02309000
ATCSOCNT EQU   ISTATCVT+1504                                            02310000
ATCSOTHR EQU   ISTATCVT+1502                                            02311000
ATCSOPR2 EQU   ISTATCVT+1501                                            02312000
ATCSOPR1 EQU   ISTATCVT+1500                                            02313000
ATCAPCAT EQU   ISTATCVT+1496                                            02314000
ATCTSCWU EQU   ISTATCVT+1492                                            02315000
ATCMWRDT EQU   ISTATCVT+1488                                            02316000
ATCSTCK  EQU   ISTATCVT+1480                                            02317000
ATCWUPAB EQU   ATCWUDYP+16                                              02318000
@NM00088 EQU   ATCWUDYP                                                 02319000
ATCLKCNT EQU   ATCLKSWP+4                                               02320000
ATCCLOCK EQU   ATCLKSWP                                                 02321000
ATCNCBQ  EQU   ISTATCVT+1436                                            02322000
ATCPUCWC EQU   ISTATCVT+1432                                            02323000
ATCTSCQV EQU   ISTATCVT+1428                                            02324000
ATCTSCQU EQU   ISTATCVT+1424                                            02325000
ATCTSCQM EQU   ISTATCVT+1420                                            02326000
ATCTSCQF EQU   ISTATCVT+1416                                            02327000
ATCAPCVR EQU   ISTATCVT+1412                                            02328000
ATCHSQLK EQU   ISTATCVT+1408                                            02329000
ATCICIDM EQU   ISTATCVT+1406                                            02330000
ATCYRANG EQU   ISTATCVT+1405                                            02331000
ATCDRNUM EQU   ISTATCVT+1404                                            02332000
ATCSACNT EQU   ISTATCVT+1400                                            02333000
ATCTSCFA EQU   ISTATCVT+1396                                            02334000
ATCCDCVR EQU   ISTATCVT+1392                                            02335000
ATCCDCRI EQU   ISTATCVT+1388                                            02336000
ATCCDCRT EQU   ISTATCVT+1384                                            02337000
ATCVRNDX EQU   ISTATCVT+1380                                            02338000
ATCAP31  EQU   ISTATCVT+1376                                            02339000
ATCPSTLK EQU   ISTATCVT+1372                                            02340000
ATCOCAOA EQU   ISTATCVT+1368                                            02341000
ATCPUCEF EQU   ISTATCVT+1364                                            02342000
ATCPUCBM EQU   ISTATCVT+1360                                            02343000
ATCAPCES EQU   ISTATCVT+1356                                            02344000
ATCAPCPC EQU   ISTATCVT+1352                                            02345000
ATCAPCTE EQU   ISTATCVT+1348                                            02346000
ATCAPCIN EQU   ISTATCVT+1344                                            02347000
ATCAPCPD EQU   ISTATCVT+1340                                            02348000
ATCAPCAD EQU   ISTATCVT+1336                                            02349000
ATCAPCSD EQU   ISTATCVT+1332                                            02350000
ATCAPCIE EQU   ISTATCVT+1328                                            02351000
ATCAPCUE EQU   ISTATCVT+1324                                            02352000
ATCAPCRP EQU   ISTATCVT+1320                                            02353000
ATCAPCRS EQU   ISTATCVT+1316                                            02354000
ATCAPCTP EQU   ISTATCVT+1312                                            02355000
ATCAPCTW EQU   ISTATCVT+1308                                            02356000
ATCAPCPS EQU   ISTATCVT+1304                                            02357000
ATCAPCTS EQU   ISTATCVT+1300                                            02358000
ATCAPCTQ EQU   ISTATCVT+1296                                            02359000
ATCAPCTX EQU   ISTATCVT+1292                                            02360000
ATCSDCOS EQU   ISTATCVT+1288                                            02361000
ATCEXCVR EQU   ISTATCVT+1284                                            02362000
ATCCPCSV EQU   ISTATCVT+1280                                            02363000
ATCVRECB EQU   ATCVRTIL+12                                              02364000
ATCVRLCK EQU   ATCVRTIL+8                                               02365000
ATCVRWEL EQU   ATCVRTIL+4                                               02366000
ATCVRWEQ EQU   ATCVRTIL                                                 02367000
ATCMGPAB EQU   ISTATCVT+1248                                            02368000
ATCTSCMS EQU   ISTATCVT+1244                                            02369000
ATCVRATB EQU   ISTATCVT+1240                                            02370000
ATCVRWAP EQU   ISTATCVT+1236                                            02371000
ATCPVRAQ EQU   ISTATCVT+1232                                            02372000
ATCTOWA  EQU   ISTATCVT+1228                                            02373000
ATCTOD2  EQU   ATCTOD+4                                                 02374000
ATCTOD1  EQU   ATCTOD                                                   02375000
ATCERTP  EQU   ISTATCVT+1216                                            02376000
ATCBINDQ EQU   ISTATCVT+1212                                            02377000
ATCTIMER EQU   ISTATCVT+1208                                            02378000
ATCTSCDN EQU   ISTATCVT+1204                                            02379000
ATCTSCCN EQU   ISTATCVT+1200                                            02380000
ATCTSCL0 EQU   ISTATCVT+1196                                            02381000
ATCTSCP2 EQU   ISTATCVT+1192                                            02382000
ATCTSC3S EQU   ISTATCVT+1188                                            02383000
ATCTSC3R EQU   ISTATCVT+1184                                            02384000
ATCTSC3O EQU   ISTATCVT+1180                                            02385000
ATCIOPRG EQU   ATCIOINT                                                 02386000
ATCTSCMI EQU   ISTATCVT+1172                                            02387000
ATCTSCMO EQU   ISTATCVT+1168                                            02388000
ATCTSCP4 EQU   ISTATCVT+1164                                            02389000
ATCPUSCT EQU   ISTATCVT+1160                                            02390000
ATCTKINT EQU   ATCTKFLD+2                                               02391000
ATCTKCNT EQU   ATCTKFLD                                                 02392000
ATCTIMCK EQU   ISTATCVT+1152                                            02393000
@NM00087 EQU   ATCRID+2                                                 02394000
ATCCDRMA EQU   ATCRID                                                   02395000
ATCCPCGD EQU   ISTATCVT+1140                                            02396000
@NM00086 EQU   ATCSMSDQ+8                                               02397000
@NM00085 EQU   ATCSMSDQ+4                                               02398000
@NM00084 EQU   ATCSMSDQ                                                 02399000
ATCSEQNO EQU   ISTATCVT+1124                                            02400000
ATCSMPMD EQU   ISTATCVT+1120                                            02401000
ATCPAREA EQU   ISTATCVT+1116                                            02402000
ATCCPCSM EQU   ISTATCVT+1112                                            02403000
ATCSQCDS EQU   ISTATCVT+1108                                            02404000
ATCUSSVT EQU   ISTATCVT+1104                                            02405000
ATCNOSQ  EQU   ISTATCVT+1100                                            02406000
ATCINCIP EQU   ATCCPDVT+4                                               02407000
ATCTSCNI EQU   ATCCPDVT                                                 02408000
ATCMGCRT EQU   ISTATCVT+1088                                            02409000
ATCMACRT EQU   ISTATCVT+1084                                            02410000
ATCCSMT  EQU   ISTATCVT+1080                                            02411000
ATCINCNO EQU   ISTATCVT+1076                                            02412000
ATCRACON EQU   ISTATCVT+1072                                            02413000
ATCCFCDR EQU   ISTATCVT+1068                                            02414000
ATCONFIG EQU   ISTATCVT+1060                                            02415000
ATCNODEL EQU   ISTATCVT+1052                                            02416000
ATCCDTIM EQU   ISTATCVT+1050                                            02417000
ATCNMCTR EQU   ISTATCVT+1048                                            02418000
ATCPOIA  EQU   ATCRNO+1                                                 02419000
@NM00083 EQU   ATCRNO                                                   02420000
ATCHBSIZ EQU   ATCHPGM+2                                                02421000
ATCHBFNO EQU   ATCHPGM                                                  02422000
ATCMROUT EQU   ISTATCVT+1031                                            02423000
ATCXRANG EQU   ISTATCVT+1030                                            02424000
ATCMAXID EQU   ISTATCVT+1029                                            02425000
ATCMSGSP EQU   ISTATCVT+1028                                            02426000
ATCECSES EQU   ISTATCVT+1020                                            02427000
ATCECDSP EQU   ISTATCVT+1016                                            02428000
ATCECVRY EQU   ISTATCVT+1012                                            02429000
ATCECHLT EQU   ISTATCVT+1008                                            02430000
ATCECMOD EQU   ISTATCVT+1004                                            02431000
ATCRDTLK EQU   ISTATCVT+1000                                            02432000
ATCVOCLK EQU   ISTATCVT+996                                             02433000
ATCCIDM  EQU   ISTATCVT+994                                             02434000
ATCITLIM EQU   ISTATCVT+992                                             02435000
ATCTMINV EQU   ISTATCVT+990                                             02436000
ATCHOSTA EQU   ISTATCVT+988                                             02437000
ATCPUNSA EQU   ISTATCVT+986                                             02438000
ATCVTMID EQU   ATCSSCPA                                                 02439000
ATCHCNID EQU   ATCONID+2                                                02440000
ATCSCNID EQU   ATCONID                                                  02441000
@NM00082 EQU   ATCBITAN+3                                               02442000
@NM00081 EQU   ATCBITAN+2                                               02443000
@NM00080 EQU   ATCFLAG2                                                 02444000
ATCMSGID EQU   ATCFLAG2                                                 02445000
ATCINACT EQU   ATCFLAG2                                                 02446000
ATCCRYPF EQU   ATCFLAG2                                                 02447000
ATCTUNCL EQU   ATCFLAG2                                                 02448000
ATCTUNRQ EQU   ATCFLAG2                                                 02449000
ATCTUNAC EQU   ATCFLAG2                                                 02450000
ATCCDLRA EQU   ATCFLAG2                                                 02451000
@NM00079 EQU   ATCBITAN                                                 02452000
@NM00078 EQU   ATCSTAT4                                                 02453000
@NM00077 EQU   ATCSTAT4                                                 02454000
@NM00076 EQU   ATCSTAT4                                                 02455000
@NM00075 EQU   ATCSTAT4                                                 02456000
@NM00074 EQU   ATCSTAT4                                                 02457000
ATCPRTAT EQU   ATCSTAT4                                                 02458000
ATCNCSD  EQU   ATCSTAT4                                                 02459000
@NM00073 EQU   ATCPOFLG                                                 02460000
@NM00072 EQU   ATCPOFLG                                                 02461000
@NM00071 EQU   ATCPOFLG                                                 02462000
@NM00070 EQU   ATCPOFLG                                                 02463000
@NM00069 EQU   ATCPOFLG                                                 02464000
@NM00068 EQU   ATCPOFLG                                                 02465000
@NM00067 EQU   ATCPOFLG                                                 02466000
ATCPOUNS EQU   ATCPOFLG                                                 02467000
ATCITEXT EQU   @NM00066                                                 02468000
ATCHIP   EQU   ATCSTAT1                                                 02469000
ATCMDHLT EQU   ATCSTAT1                                                 02470000
ATCINHLT EQU   ATCSTAT1                                                 02471000
ATCNETSL EQU   ATCSTAT1                                                 02472000
ATCQKHLT EQU   ATCSTAT1                                                 02473000
ATCSNHLT EQU   ATCSTAT1                                                 02474000
ATCACTIV EQU   ATCSTAT1                                                 02475000
ATCSTART EQU   ATCSTAT1                                                 02476000
ATCNOP00 EQU   ISTATCVT+968                                             02477000
ATCTSBUF EQU   ISTATCVT+964                                             02478000
ATCSSOQH EQU   ISTATCVT+960                                             02479000
ATCSSIQH EQU   ISTATCVT+956                                             02480000
ATCTSCMB EQU   ATCMBDVT                                                 02481000
ATCSOPAC EQU   ISTATCVT+950                                             02482000
ATCSOTIM EQU   ISTATCVT+948                                             02483000
ATCTSCON EQU   ATCSODVT                                                 02484000
ATCTSCSC EQU   ATCSSDVT                                                 02485000
ATCTSCRO EQU   ISTATCVT+936                                             02486000
ATCTSCRI EQU   ISTATCVT+932                                             02487000
ATCFEPT  EQU   ISTATCVT+928                                             02488000
ATCFDVT  EQU   ISTATCVT+924                                             02489000
ATCCONFT EQU   ISTATCVT+920                                             02490000
ATCSIBQ  EQU   ISTATCVT+916                                             02491000
ATCDSPLQ EQU   ISTATCVT+912                                             02492000
ATCVARYQ EQU   ISTATCVT+908                                             02493000
ATCHALTQ EQU   ISTATCVT+904                                             02494000
ATCMODQ  EQU   ISTATCVT+900                                             02495000
ATCSRT   EQU   ISTATCVT+896                                             02496000
ATCRDT   EQU   ISTATCVT+892                                             02497000
ATCSDVT  EQU   ISTATCVT+888                                             02498000
ATCDLRPT EQU   ISTATCVT+884                                             02499000
ATCBPDA  EQU   ISTATCVT+880                                             02500000
ATCACDA  EQU   ISTATCVT+876                                             02501000
ATCMNT   EQU   ISTATCVT+872                                             02502000
ATCNODDS EQU   ISTATCVT+868                                             02503000
ATCITRT  EQU   ISTATCVT+864                                             02504000
ATCTODVT EQU   ISTATCVT+860                                             02505000
ATCTRCPT EQU   ISTATCVT+856                                             02506000
ATCMODTB EQU   ISTATCVT+852                                             02507000
ATCUSSPT EQU   ISTATCVT+848                                             02508000
ATCTUBUF EQU   ISTATCVT+844                                             02509000
ATCTACB  EQU   ISTATCVT+840                                             02510000
ATCDWA   EQU   ISTATCVT+836                                             02511000
ATCCFCR2 EQU   ATCPODVT                                                 02512000
ATCPULQB EQU   @NM00065+16                                              02513000
ATCMCQAB EQU   @NM00065+12                                              02514000
ATCLUSMQ EQU   @NM00065+8                                               02515000
ATCLUIOQ EQU   @NM00065+4                                               02516000
ATCIOLQB EQU   @NM00065                                                 02517000
ATCTSCAP EQU   ATCANYDT                                                 02518000
ATCTSCCO EQU   ATCLUDVT+4                                               02519000
ATCTSCSR EQU   ATCLUDVT                                                 02520000
ATCVTLOD EQU   ISTATCVT+796                                             02521000
ATCTSCLF EQU   ISTATCVT+792                                             02522000
ATCTSCLE EQU   ISTATCVT+788                                             02523000
ATCTSCLB EQU   ISTATCVT+784                                             02524000
ATCTSCLS EQU   ISTATCVT+780                                             02525000
ATCTSCCF EQU   ISTATCVT+776                                             02526000
ATCTSCFV EQU   ISTATCVT+772                                             02527000
ATCTSCCE EQU   ISTATCVT+768                                             02528000
ATCTSCCB EQU   ISTATCVT+764                                             02529000
ATCTSCWS EQU   ISTATCVT+760                                             02530000
ATCTSCEM EQU   ISTATCVT+756                                             02531000
ATCTSCNS EQU   ISTATCVT+752                                             02532000
ATCTSCER EQU   ISTATCVT+748                                             02533000
ATCTSCPR EQU   ISTATCVT+744                                             02534000
ATCTSCGR EQU   ISTATCVT+740                                             02535000
ATCTSCCI EQU   ISTATCVT+736                                             02536000
ATCTSVT  EQU   ISTATCVT+732                                             02537000
ATCDVLOD EQU   ISTATCVT+728                                             02538000
ATCCDCNR EQU   ISTATCVT+724                                             02539000
ATCCDCNF EQU   ISTATCVT+720                                             02540000
ATCCDCND EQU   ISTATCVT+716                                             02541000
ATCCDCNA EQU   ISTATCVT+712                                             02542000
ATCCDCCP EQU   ISTATCVT+708                                             02543000
ATCCDFDN EQU   ISTATCVT+704                                             02544000
ATCCDFIN EQU   ISTATCVT+700                                             02545000
ATCCDFND EQU   ISTATCVT+696                                             02546000
ATCCDDEL EQU   ISTATCVT+692                                             02547000
ATCCDADD EQU   ISTATCVT+688                                             02548000
ATCTCLIM EQU   ISTATCVT+684                                             02549000
ATCRACTR EQU   ISTATCVT+680                                             02550000
ATCRACTI EQU   ISTATCVT+676                                             02551000
ATCREMOV EQU   ISTATCVT+672                                             02552000
ATCRACIO EQU   ISTATCVT+668                                             02553000
ATCADD   EQU   ISTATCVT+664                                             02554000
ATCPUCRT EQU   ISTATCVT+660                                             02555000
ATCSMRS  EQU   ISTATCVT+656                                             02556000
ATCSMRQ  EQU   ISTATCVT+652                                             02557000
ATCORCAF EQU   ISTATCVT+648                                             02558000
ATCFRSTR EQU   ATCGTSTR                                                 02559000
ATCSTMA  EQU   ISTATCVT+640                                             02560000
ATCSRTAD EQU   ISTATCVT+636                                             02561000
ATCOCCFS EQU   ISTATCVT+632                                             02562000
ATCOCCFP EQU   ISTATCVT+628                                             02563000
ATCSRTDF EQU   ISTATCVT+624                                             02564000
ATCLUCRT EQU   ISTATCVT+620                                             02565000
ATCINCY5 EQU   ISTATCVT+616                                             02566000
ATCINCW3 EQU   ISTATCVT+612                                             02567000
ATCINCU6 EQU   ISTATCVT+608                                             02568000
ATCINCTQ EQU   ISTATCVT+604                                             02569000
ATCINCS1 EQU   ISTATCVT+600                                             02570000
ATCSRTAB EQU   ISTATCVT+596                                             02571000
ATCINCRD EQU   ISTATCVT+592                                             02572000
ATCINCPH EQU   ISTATCVT+588                                             02573000
ATCINCLQ EQU   ISTATCVT+584                                             02574000
ATCNOCRT EQU   ISTATCVT+580                                             02575000
ATCINCF1 EQU   ISTATCVT+576                                             02576000
ATCINCCI EQU   ISTATCVT+572                                             02577000
ATCINCCO EQU   ISTATCVT+568                                             02578000
ATCBLDLA EQU   ISTATCVT+564                                             02579000
ATCALOAD EQU   ISTATCVT+560                                             02580000
ATCADEL  EQU   ISTATCVT+556                                             02581000
ATCRACEP EQU   ISTATCVT+552                                             02582000
ATCESC01 EQU   ISTATCVT+548                                             02583000
ATCDEC01 EQU   ISTATCVT+544                                             02584000
ATCDEC00 EQU   ISTATCVT+540                                             02585000
ATCCPCRT EQU   ISTATCVT+536                                             02586000
ATCAP35  EQU   ISTATCVT+532                                             02587000
ATCCPCFR EQU   ISTATCVT+528                                             02588000
ATCCPCGR EQU   ISTATCVT+524                                             02589000
ATCCPCPP EQU   ISTATCVT+520                                             02590000
ATCCPCNT EQU   ISTATCVT+516                                             02591000
ATCAUTHA EQU   ISTATCVT+512                                             02592000
ATCACCTA EQU   ISTATCVT+508                                             02593000
ATCMSGP  EQU   ISTATCVT+504                                             02594000
ATCAP39  EQU   ISTATCVT+500                                             02595000
ATCAP36  EQU   ISTATCVT+496                                             02596000
ATCMSGM  EQU   ISTATCVT+492                                             02597000
ATCAP33  EQU   ISTATCVT+488                                             02598000
ATCAICPT EQU   ISTATCVT+484                                             02599000
ATCAPI   EQU   ISTATCVT+480                                             02600000
ATCACC01 EQU   ISTATCVT+476                                             02601000
ATCACC00 EQU   ISTATCVT+472                                             02602000
ATCMBPAB EQU   ISTATCVT+456                                             02603000
ATCSOPAB EQU   ISTATCVT+440                                             02604000
ATCSSPAB EQU   ISTATCVT+424                                             02605000
ATCLDECB EQU   ATCLDTIL+12                                              02606000
ATCLDLCK EQU   ATCLDTIL+8                                               02607000
ATCLDLST EQU   ATCLDTIL+4                                               02608000
ATCLDNCS EQU   ATCLDTIL                                                 02609000
ATCNOSPB EQU   ISTATCVT+376                                             02610000
ATCNSPAB EQU   ISTATCVT+344                                             02611000
ATCLUSRT EQU   ISTATCVT+312                                             02612000
ATCPUIOP EQU   ISTATCVT+280                                             02613000
ATCPUPAB EQU   ISTATCVT+248                                             02614000
ATCPXPAB EQU   ISTATCVT+216                                             02615000
ATCPOPAB EQU   ISTATCVT+184                                             02616000
ATCVDPAB EQU   ISTATCVT+152                                             02617000
ATCTCIPB EQU   ISTATCVT+120                                             02618000
ATCCSPAB EQU   ATCSMPAB+16                                              02619000
@NM00064 EQU   ATCSMPAB                                                 02620000
ATCTMRPB EQU   ISTATCVT+56                                              02621000
ATCITPAB EQU   ISTATCVT+24                                              02622000
@NM00063 EQU   ATCITRA1                                                 02623000
ATCITSCP EQU   ATCITRA1                                                 02624000
ATCITMSG EQU   ATCITRA1                                                 02625000
ATCITPIU EQU   ATCITRA1                                                 02626000
ATCITSMS EQU   ATCITRA1                                                 02627000
ATCITPSS EQU   ATCITRA1                                                 02628000
ATCITLCK EQU   ATCITRA1                                                 02629000
ATCITAPI EQU   ATCITRA1                                                 02630000
ATCITCNT EQU   ATCITFLG                                                 02631000
ATCITRPH EQU   ATCITCDS                                                 02632000
ATCITTBL EQU   ATCITFLD+4                                               02633000
ATCITMAX EQU   ATCITPRM                                                 02634000
ATCPTCHA EQU   ATCRPTCH+4                                               02635000
ATCVTLVL EQU   ATCRPTCH                                                 02636000
RPHUPSTA EQU   ISTRPH+100                                               02637000
RPHSAV16 EQU   RPHWORK+60                                               02638000
RPHSAV15 EQU   RPHWORK+56                                               02639000
RPHSAV14 EQU   RPHWORK+52                                               02640000
RPHSAV13 EQU   RPHWORK+48                                               02641000
RPHSAV12 EQU   RPHWORK+44                                               02642000
RPHSAV11 EQU   RPHWORK+40                                               02643000
RPHSAV10 EQU   RPHWORK+36                                               02644000
RPHSAVE9 EQU   RPHWORK+32                                               02645000
RPHSAVE8 EQU   RPHWORK+28                                               02646000
RPHSAVE7 EQU   RPHWORK+24                                               02647000
RPHSAVE6 EQU   RPHWORK+20                                               02648000
RPHSAVE5 EQU   RPHWORK+16                                               02649000
RPHSAVE4 EQU   RPHWORK+12                                               02650000
RPHSAVE3 EQU   RPHWORK+8                                                02651000
RPHSAVE2 EQU   RPHWORK+4                                                02652000
RPHSHALF EQU   RPHSAVE1+2                                               02653000
RPHSBIT8 EQU   RPHSBITS                                                 02654000
RPHSBIT7 EQU   RPHSBITS                                                 02655000
RPHSBIT6 EQU   RPHSBITS                                                 02656000
RPHSBIT5 EQU   RPHSBITS                                                 02657000
RPHSBIT4 EQU   RPHSBITS                                                 02658000
RPHSBIT3 EQU   RPHSBITS                                                 02659000
RPHSBIT2 EQU   RPHSBITS                                                 02660000
RPHSBIT1 EQU   RPHSBITS                                                 02661000
RPHSBYTE EQU   RPHSAVE1                                                 02662000
RPHCRR   EQU   ISTRPH+32                                                02663000
RPHSRP34 EQU   RPHSRPRM+2                                               02664000
RPHSRP12 EQU   RPHSRPRM                                                 02665000
RPHWEGT  EQU   RPHWEA                                                   02666000
RPHMAJCB EQU   ISTRPH+21                                                02667000
RPHPABOF EQU   ISTRPH+20                                                02668000
RPHRESUM EQU   RPHRESMA+1                                               02669000
@NM00062 EQU   RPHWPFLG                                                 02670000
RPHPURGE EQU   RPHWPFLG                                                 02671000
RPHPT    EQU   RPHWPFLG                                                 02672000
RPHWT    EQU   RPHWPFLG                                                 02673000
RPHRSKEY EQU   RPHWPFLG                                                 02674000
RPHDVTA  EQU   ISTRPH+12                                                02675000
RPHTIK   EQU   RPHTSKID+3                                               02676000
@NM00061 EQU   RPHTSKID                                                 02677000
RPHRPHAP EQU   RPHRPHA+1                                                02678000
@NM00060 EQU   RPHRPHA                                                  02679000
RPHGATE  EQU   RPHRPHA                                                  02680000
@NM00059 EQU   RPHFLGB                                                  02681000
RPHABEND EQU   RPHFLGB                                                  02682000
RPHUWAIT EQU   RPHFLGB                                                  02683000
RPHRLCRA EQU   RPHFLGB                                                  02684000
RPHSYNCH EQU   RPHFLGB                                                  02685000
RPHPGCMP EQU   RPHFLGB                                                  02686000
RPHLOCK  EQU   RPHFLGB                                                  02687000
@NM00058 EQU   RPHFLAGS                                                 02688000
RPHSMCLR EQU   RPHFLAGS                                                 02689000
RPHSMTYP EQU   RPHFLAGS                                                 02690000
RPHSMQ   EQU   RPHFLAGS                                                 02691000
RPHLNGTH EQU   RPHCNTL+1                                                02692000
RPHTYPE  EQU   RPHCNTL                                                  02693000
DYPPAB   EQU   ISTDYPAB+16                                              02694000
DYPOCRPH EQU   DYPPACMD                                                 02695000
DYPTSKID EQU   ISTDYPAB+8                                               02696000
DYPPACTB EQU   DYPCHAIN                                                 02697000
DYPFLGS  EQU   ISTDYPAB+2                                               02698000
DYPLNGTH EQU   ISTDYPAB+1                                               02699000
DYPTYPE  EQU   ISTDYPAB                                                 02700000
PABRPHA  EQU   PABRPHFG+1                                               02701000
@NM00056 EQU   PABFLAGS                                                 02702000
PABKPRPH EQU   PABFLAGS                                                 02703000
PABNODQ  EQU   PABFLAGS                                                 02704000
PABXTND  EQU   PABFLAGS                                                 02705000
PABSYNCH EQU   PABFLAGS                                                 02706000
PABCDP   EQU   PABFLAGS                                                 02707000
PABUNCON EQU   PABFLAGS                                                 02708000
PABDVTA  EQU   ISTPAB+9                                                 02709000
PABOFFST EQU   ISTPAB+8                                                 02710000
PABCHNGP EQU   PABCHAIN+1                                               02711000
@NM00055 EQU   PABCHAIN                                                 02712000
PABCHNG  EQU   PABCHAIN                                                 02713000
PABWEQP  EQU   PABWEQA+1                                                02714000
@NM00054 EQU   PABWEQA                                                  02715000
PABWEQG  EQU   PABWEQA                                                  02716000
LOKXCL   EQU   @NM00052                                                 02717000
LOKPRY   EQU   @NM00052                                                 02718000
@NM00053 EQU   @NM00052                                                 02719000
@NM00051 EQU   LOKCHNG                                                  02720000
LOKCT    EQU   ISTLOK                                                   02721000
ISTRETR7 EQU   ISTRETRG+4                                               02722000
ISTRETR6 EQU   ISTRETRG                                                 02723000
ISTRSV01 EQU   ISTAVT+42                                                02724000
ISTPDAVP EQU   ISTAVT+38                                                02725000
ISTVTTP  EQU   ISTAVT+36                                                02726000
ISTAGTWT EQU   ISTAVT+34                                                02727000
ISTATRT  EQU   ISTAVT+32                                                02728000
ISTARID  EQU   ISTAVT+30                                                02729000
ISTX1    EQU   ISTAVT+29                                                02730000
ISTPHNM  EQU   ISTAVT+24                                                02731000
ISTAPSEX EQU   ISTAVT+20                                                02732000
ISTVTTIK EQU   ISTAVT+18                                                02733000
AVTASID  EQU   ISTAVT+16                                                02734000
ISTAPSTA EQU   ISTAVT+12                                                02735000
ISTAS53  EQU   ISTAVT+8                                                 02736000
ISTAS49  EQU   ISTAVT+4                                                 02737000
ISTACVT  EQU   ISTAVT                                                   02738000
SVECC010 EQU   TOLTEPWA+3952                                            02739000
SVETC035 EQU   TOLTEPWA+3880                                            02740000
SVESC030 EQU   TOLTEPWA+3808                                            02741000
SVESC020 EQU   TOLTEPWA+3664                                            02742000
SVESC120 EQU   TOLTEPWA+3304                                            02743000
SVESC025 EQU   TOLTEPWA+3088                                            02744000
@NM00050 EQU   TOLTEPWA+2980                                            02745000
$RPLERR  EQU   TOLTEPWA+2977                                            02746000
@NM00049 EQU   TOLTEPWA+2976                                            02747000
$CEINT2  EQU   TOLTEPWA+2968                                            02748000
$CEINT1  EQU   TOLTEPWA+2964                                            02749000
$MSGGET  EQU   TOLTEPWA+2960                                            02750000
$ACQLIST EQU   TOLTEPWA+2956                                            02751000
$R4SAVE1 EQU   TOLTEPWA+2952                                            02752000
$CLSISS  EQU   TOLTEPWA+2950                                            02753000
$CLSCNT  EQU   TOLTEPWA+2948                                            02754000
$CUTABLE EQU   TOLTEPWA+2868                                            02755000
$BUFSZ2  EQU   TOLTEPWA+2864                                            02756000
$RESID2  EQU   TOLTEPWA+2860                                            02757000
$OLTCCW2 EQU   TOLTEPWA+2856                                            02758000
$ENDBFR2 EQU   TOLTEPWA+2852                                            02759000
$1STBFR2 EQU   TOLTEPWA+2848                                            02760000
$TECB2   EQU   TOLTEPWA+2844                                            02761000
$BUFSZ1  EQU   TOLTEPWA+2840                                            02762000
$RESID1  EQU   TOLTEPWA+2836                                            02763000
$OLTCCW1 EQU   TOLTEPWA+2832                                            02764000
$ENDBFR1 EQU   TOLTEPWA+2828                                            02765000
$1STBFR1 EQU   TOLTEPWA+2824                                            02766000
$TECB1   EQU   TOLTEPWA+2820                                            02767000
$WAITIME EQU   TOLTEPWA+2816                                            02768000
$TRTN#   EQU   TOLTEPWA+2815                                            02769000
$WIODEV  EQU   TOLTEPWA+2814                                            02770000
$R4SAVE  EQU   TOLTEPWA+2804                                            02771000
$PARTADR EQU   TOLTEPWA+2800                                            02772000
$TBSDATA EQU   TOLTEPWA+2796                                            02773000
$CTWIDTH EQU   TOLTEPWA+2795                                            02774000
$CTLINE  EQU   TOLTEPWA+2794                                            02775000
$APWIDTH EQU   TOLTEPWA+2793                                            02776000
$APLINE  EQU   TOLTEPWA+2792                                            02777000
$INDEX   EQU   $IMITX                                                   02778000
$UMXX    EQU   @NM00048+14                                              02779000
$NSXX    EQU   @NM00048+12                                              02780000
$ATACNT  EQU   $NSCNT                                                   02781000
$CTR     EQU   @NM00048+8                                               02782000
$ATAPTR  EQU   $NSPTR                                                   02783000
$DDRPTR  EQU   @NM00048                                                 02784000
$DTORESP EQU   TOLTEPWA+2712                                            02785000
$APNAME  EQU   TOLTEPWA+2704                                            02786000
$24SYMNE EQU   $24CATMG+4                                               02787000
$24DEVAD EQU   $24CATMG                                                 02788000
$24RTN#  EQU   $24FEMSG+8                                               02789000
$ESECTID EQU   $24FEMSG                                                 02790000
$24FLGS  EQU   TOLTEPWA+2680                                            02791000
$24SAVE2 EQU   TOLTEPWA+2676                                            02792000
$24SAVE1 EQU   TOLTEPWA+2672                                            02793000
$24UNADR EQU   TOLTEPWA+2668                                            02794000
$24SAV13 EQU   TOLTEPWA+2664                                            02795000
$24RETCD EQU   TOLTEPWA+2663                                            02796000
$CSPARE  EQU   $CFLGS                                                   02797000
ROOTLOC  EQU   TOLTEPWA+2640                                            02798000
$RETREG  EQU   TOLTEPWA+2636                                            02799000
$WORK    EQU   TOLTEPWA+2376                                            02800000
$EXTA    EQU   TOLTEPWA+2320                                            02801000
$PASSONA EQU   TOLTEPWA+2264                                            02802000
$TRMINPT EQU   TOLTEPWA+2184                                            02803000
$INBUFR  EQU   TOLTEPWA+2104                                            02804000
$BUFFER  EQU   TOLTEPWA+1976                                            02805000
$TLTRPL3 EQU   TOLTEPWA+1856                                            02806000
$TLTRPL2 EQU   TOLTEPWA+1736                                            02807000
$TLTRPL1 EQU   TOLTEPWA+1616                                            02808000
@NM00047 EQU   $SLTBL+135                                               02809000
$HIGHRTN EQU   $SLTBL+134                                               02810000
$PRIMADR EQU   $SLTBL+130                                               02811000
$CTSTPT  EQU   $SLTBL+128                                               02812000
$TSTCNT  EQU   $SLTBL+126                                               02813000
$SECFLGS EQU   $SECLST+3                                                02814000
$SECTION EQU   $SECLST                                                  02815000
$SECACT  EQU   $TESTFLG                                                 02816000
$CANTRUN EQU   $TESTFLG                                                 02817000
$FINAL   EQU   $TESTFLG                                                 02818000
$TESTSUF EQU   $RUNTEST+5                                               02819000
$TESTNUM EQU   $RUNTEST+1                                               02820000
$LETPRF  EQU   $RUNTEST                                                 02821000
$SYMBOLC EQU   $SLTBL+5                                                 02822000
$FAMILY  EQU   $SLTBL                                                   02823000
$CDEVPT  EQU   TOLTEPWA+1466                                            02824000
$FEEDBCK EQU   $DEVTBLE+66                                              02825000
$WTISUED EQU   $DEVFLG4                                                 02826000
$EXIOISD EQU   $DEVFLG4                                                 02827000
$REMWRIT EQU   $DEVFLG4                                                 02828000
$REMDONE EQU   $DEVFLG4                                                 02829000
$2NDUSED EQU   $DEVFLG4                                                 02830000
$1STUSED EQU   $DEVFLG4                                                 02831000
$IGLXIFB EQU   $DEVFLG4                                                 02832000
$EXIOLV3 EQU   $DEVFLG4                                                 02833000
@NM00046 EQU   $DEVFLG5                                                 02834000
$DVBASIC EQU   $DEVFLG5                                                 02835000
$ASCII   EQU   $DEVFLG5                                                 02836000
$DEVLU   EQU   $DEVFLG5                                                 02837000
$OPNDFAL EQU   $DEVFLG5                                                 02838000
$ACQNCB  EQU   $DEVFLG5                                                 02839000
$REMOTE  EQU   $DEVFLG5                                                 02840000
$ENDNODE EQU   $DEVFLG5                                                 02841000
$CID     EQU   $DEVTBLE+52                                              02842000
$DVCOL   EQU   $LDNCBPT+2                                               02843000
$DVROW   EQU   $LDNCBPT                                                 02844000
$NCSPLP  EQU   $DEVTBLE+44                                              02845000
$DVLN    EQU   $SSCPDAF                                                 02846000
$DAF     EQU   $DEVSESP+4                                               02847000
$VARYPAB EQU   $DEVSESP                                                 02848000
$SYSMN   EQU   $DEVTBLE+28                                              02849000
@NM00045 EQU   $DEVFLG3                                                 02850000
$CLRSNT  EQU   $DEVFLG3                                                 02851000
$OLTERR  EQU   $DEVFLG3                                                 02852000
$SRTEST  EQU   $DEVFLG3                                                 02853000
$DVSNDOK EQU   $SIOFLG                                                  02854000
$POLLREQ EQU   $DEVFLG3                                                 02855000
$ACQRED  EQU   $DEVFLG3                                                 02856000
$NOTDEV  EQU   $DEVFLG3                                                 02857000
$DVINCT  EQU   $DEVTBLE+26                                              02858000
$DVBRKST EQU   $OPND+1                                                  02859000
$DVBRKSN EQU   $OPND                                                    02860000
$DVSEQNO EQU   $OPIS                                                    02861000
$CEINTRP EQU   $DEVFLG2                                                 02862000
$DEVALOC EQU   $DEVFLG2                                                 02863000
$ALLDATA EQU   $DEVFLG2                                                 02864000
$ENDCNTL EQU   $DEVFLG2                                                 02865000
$CTLDEV  EQU   $DEVFLG2                                                 02866000
$NOCDS   EQU   $DEVFLG2                                                 02867000
$DATAIN  EQU   $DEVFLG2                                                 02868000
$PRIMARY EQU   $DEVFLG1                                                 02869000
$DVCTBYT EQU   $INTOCC                                                  02870000
$DEVACT  EQU   $DEVFLG1                                                 02871000
$DVLGMDE EQU   $ATTNEXP                                                 02872000
$DVSPRM  EQU   $EVNCPLT                                                 02873000
$GRABBED EQU   $DEVFLG1                                                 02874000
$CATASTR EQU   $DEVFLG1                                                 02875000
$LETGO   EQU   $DEVFLG1                                                 02876000
$CURELEM EQU   $$SYMNME+4                                               02877000
$MSGOTSD EQU   $$SYMNME                                                 02878000
$EXTDEV  EQU   $DEVCDS+11                                               02879000
@NM00044 EQU   $DEVSDCF                                                 02880000
$NOTPRIM EQU   $DEVSDCF                                                 02881000
@NM00043 EQU   $DEVCDSF                                                 02882000
@NM00042 EQU   $DEVCDSF                                                 02883000
@NM00041 EQU   $DEVCDSF                                                 02884000
$CDSNAME EQU   $DEVCDSF                                                 02885000
$EXTRN   EQU   $DEVCDSF                                                 02886000
$CEVOLUM EQU   $DEVCDSF                                                 02887000
$SHARD   EQU   $DEVCDSF                                                 02888000
$DEVFPM  EQU   $DEVCDSF                                                 02889000
$DEVCNT  EQU   $DEVCDS+8                                                02890000
$DEVTYPE EQU   $DEVFEAT+3                                               02891000
$DEVCLAS EQU   $DEVFEAT+2                                               02892000
$DEVFRRS EQU   $DEVFEAT+1                                               02893000
$DEVMOD  EQU   $DEVFEAT                                                 02894000
$DEVRDGT EQU   @NM00039+1                                               02895000
$DEVCTLU EQU   @NM00039+1                                               02896000
$DEVCHAN EQU   @NM00039                                                 02897000
@NM00040 EQU   @NM00039                                                 02898000
$CTINDX  EQU   $DEVUNAD                                                 02899000
$FLAG16  EQU   $COMMFLG+15                                              02900000
$FLAG15  EQU   $COMMFLG+14                                              02901000
$FLAG14  EQU   $COMMFLG+13                                              02902000
$CATMSG  EQU   $FLAG13                                                  02903000
$PRMPTSW EQU   $FLAG13                                                  02904000
$DEVENT  EQU   $FLAG13                                                  02905000
$CTLOGON EQU   $FLAG13                                                  02906000
@NM00038 EQU   $FLAG12                                                  02907000
$VRYHRD  EQU   $FLAG12                                                  02908000
$VRYSFT  EQU   $FLAG12                                                  02909000
$OPTMSG  EQU   $FLAG12                                                  02910000
$FEORCAT EQU   $FLAG11                                                  02911000
@NM00037 EQU   $FLAG11                                                  02912000
@NM00036 EQU   $FLAG10                                                  02913000
$DPRINT  EQU   $FLAG10                                                  02914000
@NM00035 EQU   $FLAG9                                                   02915000
$COPY    EQU   $FLAG9                                                   02916000
$LSTLNSW EQU   $FLAG9                                                   02917000
$MULLNSW EQU   $FLAG9                                                   02918000
$REMSW   EQU   $FLAG9                                                   02919000
$IGRES   EQU   $FLAG9                                                   02920000
$VS2     EQU   $FLAG8                                                   02921000
$VS1     EQU   $FLAG8                                                   02922000
$EDOS    EQU   $FLAG8                                                   02923000
@NM00034 EQU   $FLAG8                                                   02924000
@NM00033 EQU   $FLAG8                                                   02925000
$RCVMSG  EQU   $FLAG7                                                   02926000
$LDOIS   EQU   $FLAG7                                                   02927000
$DCONTCT EQU   $FLAG7                                                   02928000
$2NDDATA EQU   $FLAG7                                                   02929000
$1STDATA EQU   $FLAG7                                                   02930000
$FSTMCIS EQU   $FLAG6                                                   02931000
$DISCREQ EQU   $FLAG6                                                   02932000
$DISCISS EQU   $FLAG6                                                   02933000
$CHANGE  EQU   $FLAG6                                                   02934000
$CTERROR EQU   $FLAG6                                                   02935000
@NM00032 EQU   $FLAG5                                                   02936000
$PROGCK  EQU   $CANCEL                                                  02937000
$PRINTAP EQU   $FLAG5                                                   02938000
@NM00031 EQU   $FLAG5                                                   02939000
$MSG922  EQU   $FLAG5                                                   02940000
$CT924   EQU   $FLAG5                                                   02941000
$FSTCAT  EQU   $FLAG5                                                   02942000
$FSTFE   EQU   $FLAG5                                                   02943000
$ACQCUTT EQU   $FLAG4                                                   02944000
$BACKINT EQU   $FLAG4                                                   02945000
$DMSGSW  EQU   $FLAG4                                                   02946000
$TSTDEVP EQU   $FLAG4                                                   02947000
$APRQPER EQU   $FLAG4                                                   02948000
$OPCOM   EQU   $FLAG4                                                   02949000
$NEWAP   EQU   $FLAG3                                                   02950000
$ALTPRTR EQU   $FLAG3                                                   02951000
$OPTERR  EQU   $FLAG3                                                   02952000
$TSTERR  EQU   $FLAG3                                                   02953000
$DEVERR  EQU   $FLAG3                                                   02954000
$PARTIAL EQU   $FLAG2                                                   02955000
$NRMTERM EQU   $FLAG2                                                   02956000
$VALDTST EQU   $FLAG2                                                   02957000
$VALDDEV EQU   $FLAG2                                                   02958000
$DBLSLSH EQU   $FLAG2                                                   02959000
$NDR     EQU   $FLAG2                                                   02960000
@NM00030 EQU   $FLAG2                                                   02961000
$FTTHR   EQU   $FLAG2                                                   02962000
$NORELDV EQU   $FLAG1                                                   02963000
@NM00029 EQU   $FLAG1                                                   02964000
$OPTCHNG EQU   $FLAG1                                                   02965000
$DEVCHNG EQU   $FLAG1                                                   02966000
$TESTCNG EQU   $FLAG1                                                   02967000
$CNSLFG  EQU   $FLAG1                                                   02968000
@NM00028 EQU   $CDA+120                                                 02969000
$CUCNT   EQU   $CDA+118                                                 02970000
@NM00027 EQU   $CDA+117                                                 02971000
$PRTFORM EQU   $CDA+116                                                 02972000
$OPISCNT EQU   $CDA+114                                                 02973000
$OPNDCNT EQU   $CDA+112                                                 02974000
$GETMSZE EQU   $CDA+110                                                 02975000
$GRCNTS  EQU   $CDA+108                                                 02976000
$CTLCNT  EQU   $CDA+106                                                 02977000
$ACTLVL  EQU   $CDA+105                                                 02978000
$PRNTLVL EQU   $CDA+104                                                 02979000
$ERRCNTA EQU   $CDA+102                                                 02980000
$TLCNT   EQU   $CDA+100                                                 02981000
$TIMEALW EQU   $CDA+96                                                  02982000
$PTRAREA EQU   $CDA+92                                                  02983000
$GETMPTR EQU   $CDA+88                                                  02984000
$TEPEND  EQU   $CDA+76                                                  02985000
$PLINKDL EQU   $CDA+72                                                  02986000
$TEPBEGN EQU   $CDA+68                                                  02987000
$FRELPTR EQU   $CDA+64                                                  02988000
$HIGHADR EQU   $HIMOREC                                                 02989000
$LOMOREC EQU   $CDA+56                                                  02990000
$LOWADDR EQU   $OLTPTR                                                  02991000
$ENDCOMM EQU   $CDA+48                                                  02992000
$COMMON  EQU   $RCA                                                     02993000
$SLASHAD EQU   $CDA+32                                                  02994000
$PASSON  EQU   $CDA+28                                                  02995000
$TOLBRTB EQU   $CDA+24                                                  02996000
$SCTPTR8 EQU   $CDA+20                                                  02997000
$SCTPTR  EQU   $CDA+16                                                  02998000
@NM00026 EQU   $CDA                                                     02999000
@NM00025 EQU   $SCTTBLE+98                                              03000000
$SCTLWTC EQU   $SCTTBLE+96                                              03001000
$SCTLWTA EQU   $SCTTBLE+92                                              03002000
#EXT     EQU   $SCTTBLE+88                                              03003000
#PASS    EQU   $SCTTBLE+84                                              03004000
#TABLE   EQU   $SCTTBLE+80                                              03005000
#MSGIDAC EQU   $SCTTBLE+78                                              03006000
@NM00024 EQU   $SCTTBLE+71                                              03007000
$RETMASK EQU   $SCTTBLE+70                                              03008000
$R249255 EQU   $ROUTMSK+29                                              03009000
$R241248 EQU   $ROUTMSK+28                                              03010000
$R233240 EQU   $ROUTMSK+27                                              03011000
$R225232 EQU   $ROUTMSK+26                                              03012000
$R217224 EQU   $ROUTMSK+25                                              03013000
$R209216 EQU   $ROUTMSK+24                                              03014000
$R201208 EQU   $ROUTMSK+23                                              03015000
$R193200 EQU   $ROUTMSK+22                                              03016000
$R185192 EQU   $ROUTMSK+21                                              03017000
$R177184 EQU   $ROUTMSK+20                                              03018000
$R169176 EQU   $ROUTMSK+19                                              03019000
$R161168 EQU   $ROUTMSK+18                                              03020000
$R153160 EQU   $ROUTMSK+17                                              03021000
$R145152 EQU   $ROUTMSK+16                                              03022000
$R137144 EQU   $ROUTMSK+15                                              03023000
$R129136 EQU   $ROUTMSK+14                                              03024000
$R121128 EQU   $ROUTMSK+13                                              03025000
$R113120 EQU   $ROUTMSK+12                                              03026000
$R105112 EQU   $ROUTMSK+11                                              03027000
$R097104 EQU   $ROUTMSK+10                                              03028000
$R089096 EQU   $ROUTMSK+9                                               03029000
$R081088 EQU   $ROUTMSK+8                                               03030000
$R073080 EQU   $ROUTMSK+7                                               03031000
$R065072 EQU   $ROUTMSK+6                                               03032000
$R057064 EQU   $ROUTMSK+5                                               03033000
$R049056 EQU   $ROUTMSK+4                                               03034000
$R041048 EQU   $ROUTMSK+3                                               03035000
$R033040 EQU   $ROUTMSK+2                                               03036000
$R025032 EQU   $ROUTMSK+1                                               03037000
$R017024 EQU   $ROUTMSK                                                 03038000
$TOTFLG2 EQU   $SCTTBLE+39                                              03039000
@NM00023 EQU   $TOTFLG1                                                 03040000
@NM00022 EQU   $TOTFLG1                                                 03041000
@NM00021 EQU   $TOTFLG1                                                 03042000
$CURELOD EQU   $TOTFLG1                                                 03043000
$CTEQTT  EQU   $TOTFLG1                                                 03044000
@NM00020 EQU   $TOTFLG1                                                 03045000
@NM00019 EQU   $TOTFLG1                                                 03046000
$LINESHR EQU   $TOTFLG1                                                 03047000
@NM00018 EQU   $OLTFLG2                                                 03048000
@NM00017 EQU   $OLTFLG2                                                 03049000
@NM00016 EQU   $OLTFLG2                                                 03050000
@NM00015 EQU   $OLTFLG2                                                 03051000
@NM00014 EQU   $OLTFLG2                                                 03052000
@NM00013 EQU   $OLTFLG2                                                 03053000
@NM00012 EQU   $OLTFLG2                                                 03054000
$TALK    EQU   $OLTFLG2                                                 03055000
$DYCOM   EQU   $OLTFLGS                                                 03056000
@NM00011 EQU   $OLTFLGS                                                 03057000
$TRACE   EQU   $OLTFLGS                                                 03058000
$RETCODE EQU   $OLTFLGS                                                 03059000
$CONTCB  EQU   $OLTFLGS                                                 03060000
$RETAIN  EQU   $OLTFLGS                                                 03061000
$CLEANRT EQU   $OLTFLGS                                                 03062000
$MANINTV EQU   $OLTFLGS                                                 03063000
$OLTSIZE EQU   $SCTTBLE+34                                              03064000
$QSCTMOD EQU   $EXECFLG                                                 03065000
$CTRLMOD EQU   $EXECFLG                                                 03066000
$LSTPDEV EQU   $EXECFLG                                                 03067000
$ERRCNT  EQU   $EXECFLG                                                 03068000
$RTNSLCT EQU   $EXECFLG                                                 03069000
$MULTDEV EQU   $EXECFLG                                                 03070000
@NM00010 EQU   $EXECFLG                                                 03071000
$RMSKCNT EQU   $SCTTBLE+32                                              03072000
$SYNAME  EQU   $CDS8T19+4                                               03073000
$EXTSIG  EQU   $CDS8T19+3                                               03074000
$CDFLGS  EQU   $CDS8T19+1                                               03075000
$CDSCNT  EQU   $CDS8T19                                                 03076000
$PDEVDSC EQU   $SCTTBLE+16                                              03077000
$PDEVADR EQU   $SCTTBLE+12                                              03078000
$COMMCN  EQU   $CDSFLGS                                                 03079000
$CUSTSYM EQU   $CDSFLGS                                                 03080000
$TWOCHSW EQU   $CDSFLGS                                                 03081000
$SYMNAME EQU   $CDSFLGS                                                 03082000
$EXTINTC EQU   $CDSFLGS                                                 03083000
$CEVOL   EQU   $CDSFLGS                                                 03084000
$SHARED  EQU   $CDSFLGS                                                 03085000
$FPM     EQU   $CDSFLGS                                                 03086000
$LASTSUB EQU   $PDEVFLG                                                 03087000
@NM00009 EQU   $PDEVFLG                                                 03088000
@NM00008 EQU   $PDEVFLG                                                 03089000
@NM00007 EQU   $PDEVFLG                                                 03090000
$LASTDEV EQU   $PDEVFLG                                                 03091000
@NM00006 EQU   $PDEVFLG                                                 03092000
$EXFILPT EQU   $PDEVFLG                                                 03093000
$FPMOLD  EQU   $PDEVFLG                                                 03094000
$TSSSYM  EQU   $SCTTBLE+8                                               03095000
$SCTLEVL EQU   $SCTTBLE+7                                               03096000
$DRIVER  EQU   $SCTTBLE+6                                               03097000
$RT0916  EQU   $SCTTBLE+5                                               03098000
$RT0108  EQU   $SCTTBLE+4                                               03099000
$LOOPTST EQU   $ERROPT                                                  03100000
$LOOPERR EQU   $ERROPT                                                  03101000
$NERRPRT EQU   $ERROPT                                                  03102000
$NOCNTRL EQU   $ERROPT                                                  03103000
$ALTPRNT EQU   $ERROPT                                                  03104000
$CATERR  EQU   $ERROPT                                                  03105000
$ASTERIK EQU   $ERROPT                                                  03106000
$TESTERR EQU   $ERROPT                                                  03107000
$FSTCOMM EQU   $TESTOPT                                                 03108000
$INDEFLP EQU   $TESTOPT                                                 03109000
$NOPRT   EQU   $TESTOPT                                                 03110000
$PARAPRT EQU   $TESTOPT                                                 03111000
@NM00005 EQU   $TESTOPT                                                 03112000
$ERRLPCT EQU   $SCTTBLE                                                 03113000
$TLTEND  EQU   $RCAAREA+945                                             03114000
$CNSLID  EQU   $RCAAREA+936                                             03115000
$EXITSAV EQU   $RCAAREA+864                                             03116000
$TRASCII EQU   $RCAAREA+608                                             03117000
@NM00004 EQU   $RCAAREA+605                                             03118000
$VTAMEND EQU   $RCAFLG                                                  03119000
$TPPOSTD EQU   $RCAFLG                                                  03120000
$NEWCT   EQU   $RCAFLG                                                  03121000
$ABNDALL EQU   $RCAFLG                                                  03122000
$CONSOLE EQU   $RCAFLG                                                  03123000
$TPLOGON EQU   $RCAFLG                                                  03124000
$DEVAREA EQU   $RCAAREA+600                                             03125000
$CTDVAR  EQU   $RCAAREA+596                                             03126000
$BUFFS   EQU   $RCAAREA+464                                             03127000
$TLTNIB  EQU   $CONSTNT+140                                             03128000
$TLTPRPL EQU   $CONSTNT+20                                              03129000
@NM00003 EQU   $CONSTNT+4                                               03130000
@NM00002 EQU   $CONSTNT+2                                               03131000
$CTNAME  EQU   $POINTER+132                                             03132000
$CTARGX  EQU   $POINTER+128                                             03133000
$COMINT  EQU   $POINTER+120                                             03134000
$QUEHNDL EQU   $POINTER+116                                             03135000
@NM00001 EQU   $POINTER+36                                              03136000
$RTNPTR  EQU   $POINTER+32                                              03137000
$TLTECB1 EQU   $POINTER+24                                              03138000
$CVTSAVE EQU   $POINTER+4                                               03139000
$TLTACB  EQU   $RCAAREA                                                 03140000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03141000
@RT00124 EQU   C14C0002                                                 03142000
@RT00148 EQU   C14C0004                                                 03143000
@RT00163 EQU   C14C0035                                                 03144000
@RT00200 EQU   C14C006A                                                 03145000
@RT00204 EQU   C14C0004                                                 03146000
@RT00214 EQU   C14C006A                                                 03147000
@RF00214 EQU   C14C0007                                                 03148000
@RT00222 EQU   C14C006A                                                 03149000
@RT00275 EQU   C14C0033                                                 03150000
@RT00281 EQU   C14C0006                                                 03151000
@RT00290 EQU   C14C0005                                                 03152000
@RT00300 EQU   C14C0001                                                 03153000
@RT00328 EQU   C14C0011                                                 03154000
@RT00330 EQU   C14C0013                                                 03155000
@RT00336 EQU   C14C0011                                                 03156000
@RT00338 EQU   C14C0011                                                 03157000
@ENDDATA EQU   *                                                        03158000
         END   ISTCC014,(C'PLS1756',0702,80158)                         03159000
