         TITLE 'READ WRITE EXIT - ISTCC016'                             00001000
ISTCC016 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTCC016  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  DS    0H                                                  0002 00009000
         PRINT OFF                                                      00010000
         PRINT ON                                                       00011000
         PRINT OFF                                                      00012000
         PRINT ON                                                       00013000
         PRINT OFF                                                      00014000
         PRINT ON                                                       00015000
         PRINT OFF                                                      00016000
         PRINT ON                                                       00017000
*                                    /* SET UP BASE AND SCR @ZD10878*/  00018000
         LR    R12,R15             GET THE ENTRY ADDRESS                00019000
         USING ISTCC016,R12                                             00020000
         LA    R9,C16CBUF1   POINT TO EXIT WORK AREA           @ZD10878 00021000
         USING @DATD,R9      SET UP ADDRESSABILITY FOR SCRTCH  @ZD10878 00022000
*   RPLPTR=R1;                      /* SAVE POINTER TO RPL           */ 00023000
         LR    RPLPTR,R1                                           0151 00024000
*   WAPTR=RPLUSFLD;                                                0152 00025000
         L     WAPTR,RPLUSFLD(,RPLPTR)                             0152 00026000
*   R13=ADDR($EXITSAV);             /* SET UP PTR TO MY SAVEAREA     */ 00027000
         L     R13,RCAPTR(,WAPTR)                                  0153 00028000
         LA    R13,$EXITSAV(,R13)                                  0153 00029000
*   C16EXSAV=R14;                   /* SAVE R14 FOR RET TO VTAM      */ 00030000
*                                                                  0154 00031000
         ST    R14,C16EXSAV                                        0154 00032000
*   /*****************************************************************/ 00033000
*   /*                                                               */ 00034000
*   /* CHECK THE RPL SO IT IS NOT ACTIVE                             */ 00035000
*   /*                                                               */ 00036000
*   /*****************************************************************/ 00037000
*                                                                  0155 00038000
*   GEN(CHECK RPL=(RPLPTR));        /* CLEAR UP RPL BEFORE PROCESSING*/ 00039000
         CHECK RPL=(RPLPTR)                                             00040000
*   INDX=AP;                        /* FEEDBACK FOR AP               */ 00041000
         LA    INDX,2                                              0156 00042000
*   IF RPLPTR=ADDR($TLTRPL1) THEN   /* SET UP INDEX INTO TABLE     0157 00043000
*                                                            @D32JPGH*/ 00044000
         LA    @00,$TLTRPL1(,WAPTR)                                0157 00045000
         CR    RPLPTR,@00                                          0157 00046000
         BNE   @RF00157                                            0157 00047000
*     INDX=CT;                      /* FEEDBACK FOR CT               */ 00048000
*                                                                  0158 00049000
         LA    INDX,1                                              0158 00050000
*   /*****************************************************************/ 00051000
*   /*                                                               */ 00052000
*   /* CHK FOR TEMP ERRORS RETRY IF POSSIBLE                         */ 00053000
*   /*                                                               */ 00054000
*   /*****************************************************************/ 00055000
*                                                                  0159 00056000
*   IF(RPLRTNCD='08'X&RPLFDB2='00'X)|(RPLRTNCD='0C'X&(RPLFDB2='03'X|    00057000
*       RPLFDB2='05'X)) THEN                                       0159 00058000
@RF00157 CLI   RPLRTNCD(RPLPTR),8                                  0159 00059000
         BNE   @GL00001                                            0159 00060000
         CLI   RPLFDB2(RPLPTR),0                                   0159 00061000
         BE    @RT00159                                            0159 00062000
@GL00001 CLI   RPLRTNCD(RPLPTR),12                                 0159 00063000
         BNE   @RF00159                                            0159 00064000
         CLI   RPLFDB2(RPLPTR),3                                   0159 00065000
         BE    @RT00159                                            0159 00066000
         CLI   RPLFDB2(RPLPTR),5                                   0159 00067000
         BE    @RT00159                                            0159 00068000
*     GOTO C16C0225;                                               0160 00069000
*   IF RPLRTNCD^='00'X              /* IF THERE WAS AN ERROR         */ 00070000
*     THEN                                                         0161 00071000
@RF00159 CLI   RPLRTNCD(RPLPTR),0                                  0161 00072000
         BE    @RF00161                                            0161 00073000
*     DO;                                                          0162 00074000
*       IF RPLRTNCD='0C'X&(RPLFDB2>='0A'X&RPLFDB2<='0C'X)/* CHECK TO    00075000
*                                      SEE IF WE SHOULD STOP @D32JPGH*/ 00076000
*         THEN                                                     0163 00077000
         CLI   RPLRTNCD(RPLPTR),12                                 0163 00078000
         BNE   @RF00163                                            0163 00079000
         CLI   RPLFDB2(RPLPTR),10                                  0163 00080000
         BL    @RF00163                                            0163 00081000
         CLI   RPLFDB2(RPLPTR),12                                  0163 00082000
         BH    @RF00163                                            0163 00083000
*         DO;                       /* NOT ERROR, BUT GET OUT NOW    */ 00084000
*           CALL C16C0910;          /* FREE CURRENT ELEMENT          */ 00085000
         BAL   @14,C16C0910                                        0165 00086000
*           GOTO C16C0251;          /* EXIT FROM THIS MODULE         */ 00087000
         B     C16C0251                                            0166 00088000
*         END;                      /* END OF NOT ERROR,BUT STOP CODE*/ 00089000
*       IF RPLRTNCD<=4&$DEVLU(INDX)=ON THEN/* IF LU STATUS PASSED  0168 00090000
*                                      BACK                  @DM00895*/ 00091000
@RF00163 CLI   RPLRTNCD(RPLPTR),4                                  0168 00092000
         BH    @RF00168                                            0168 00093000
         LR    @11,INDX                                            0168 00094000
         MH    @11,@CH00337                                        0168 00095000
         ALR   @11,WAPTR                                           0168 00096000
         TM    $DEVLU-68(@11),B'00001000'                          0168 00097000
         BO    @RT00168                                            0168 00098000
*         GO TO C16C0253;           /* PROCESS THE FEEDBACK          */ 00099000
*       IF RPLRTNCD='0C'X&          /* WAS IT AN RFT RECEIVED        */ 00100000
*           RPLFDB2='02'X&INDX=CT   /* FROM THE CT                   */ 00101000
*         THEN                                                     0170 00102000
@RF00168 CLI   RPLRTNCD(RPLPTR),12                                 0170 00103000
         BNE   @RF00170                                            0170 00104000
         CLI   RPLFDB2(RPLPTR),2                                   0170 00105000
         BNE   @RF00170                                            0170 00106000
         C     INDX,@CF00072                                       0170 00107000
         BNE   @RF00170                                            0170 00108000
*         DO;                       /* IF YES DO THE FOLLOWING       */ 00109000
*           $RETREG=0;                                             0172 00110000
         SLR   @11,@11                                             0172 00111000
         ST    @11,$RETREG(,WAPTR)                                 0172 00112000
*           IF RPLAARLN=0 THEN                                     0173 00113000
         C     @11,RPLAARLN(,RPLPTR)                               0173 00114000
         BE    @RT00173                                            0173 00115000
*             GOTO C16C0100;                                       0174 00116000
*           ELSE                                                   0175 00117000
*             GOTO C16C0225;        /* GO & RETRY ORIG REQ           */ 00118000
         B     C16C0225                                            0175 00119000
*         END;                                                     0176 00120000
*       IF RPLRTNCD='04'X&          /* WAS AN ATTENTION RECEIVED     */ 00121000
*           RPLFDB2='01'X&INDX=CT   /* FROM CT                       */ 00122000
*         THEN                      /* THEN DO THE FOLLOWING         */ 00123000
@RF00170 CLI   RPLRTNCD(RPLPTR),4                                  0177 00124000
         BNE   @RF00177                                            0177 00125000
         CLI   RPLFDB2(RPLPTR),1                                   0177 00126000
         BNE   @RF00177                                            0177 00127000
         C     INDX,@CF00072                                       0177 00128000
         BNE   @RF00177                                            0177 00129000
*         DO;                                                      0178 00130000
*           $CIREQ=ON;              /* SET C. I. REQ ON              */ 00131000
         OI    $CIREQ(WAPTR),B'00000001'                           0179 00132000
*           $RETREG=0;              /* SET ZERO RETURN CODE          */ 00133000
         SLR   @00,@00                                             0180 00134000
         ST    @00,$RETREG(,WAPTR)                                 0180 00135000
*           GOTO C16C0100;                                         0181 00136000
         B     C16C0100                                            0181 00137000
*         END;                                                     0182 00138000
*       $RETREG=8;                  /* SET ERROR RC = 8              */ 00139000
@RF00177 MVC   $RETREG(4,WAPTR),@CF00054                           0183 00140000
*C16C0075:                                                         0184 00141000
*       CALL C16C0920;              /* SET ERROR STATUS              */ 00142000
C16C0075 BAL   @14,C16C0920                                        0184 00143000
*       GO TO C16C0251;             /* EXIT FROM THE MODULE          */ 00144000
         B     C16C0251                                            0185 00145000
*     END;                                                         0186 00146000
*   ELSE                                                           0187 00147000
*     $RETREG=0;                    /* SET GOOD RC OF 00             */ 00148000
@RF00161 SLR   @00,@00                                             0187 00149000
         ST    @00,$RETREG(,WAPTR)                                 0187 00150000
*C16C0100:                                                         0188 00151000
*   ;                                                              0188 00152000
C16C0100 DS    0H                                                  0189 00153000
*   IF $DEVLU(INDX)=ON              /* IF DEVICE IS AN LU            */ 00154000
*     THEN                                                         0189 00155000
         LR    @11,INDX                                            0189 00156000
         MH    @11,@CH00337                                        0189 00157000
         ST    @11,@TF00001                                        0189 00158000
         ALR   @11,WAPTR                                           0189 00159000
         TM    $DEVLU-68(@11),B'00001000'                          0189 00160000
         BO    @RT00189                                            0189 00161000
*     GOTO C16C0253;                /* THIS CODE HANDLES LU        0190 00162000
*                                      INFORMATION                   */ 00163000
*   IF INCT^=0                      /* ONE WAY MSG?                  */ 00164000
*     THEN                                                         0191 00165000
         L     @11,@TF00001                                        0191 00166000
         L     @11,$CURELEM-68(@11,WAPTR)                          0191 00167000
         CLI   INCT(@11),0                                         0191 00168000
         BE    @RF00191                                            0191 00169000
*     DO;                                                          0192 00170000
*       IF RPLREQ='11'X|(RPLREQ='1D'X&RPLREOT=OFF)/* IF WRITE OR READ   00171000
*                                      FOR EOT                       */ 00172000
*         THEN                                                     0193 00173000
         CLI   RPLREQ(RPLPTR),17                                   0193 00174000
         BE    @RT00193                                            0193 00175000
         CLI   RPLREQ(RPLPTR),29                                   0193 00176000
         BNE   @RF00193                                            0193 00177000
         TM    RPLREOT(RPLPTR),B'00001000'                         0193 00178000
         BNZ   @RF00193                                            0193 00179000
@RT00193 DS    0H                                                  0194 00180000
*         DO;                       /* READING DATA FROM CT          */ 00181000
*           IF $DVINCT(1)^=0 THEN                                  0195 00182000
         CLI   $DVINCT(WAPTR),0                                    0195 00183000
         BE    @RF00195                                            0195 00184000
*             DO;                                                  0196 00185000
*               RPLBUFL=$DVINCT(1); /* SET READ COUNT                */ 00186000
         SLR   @00,@00                                             0197 00187000
         IC    @00,$DVINCT(,WAPTR)                                 0197 00188000
         ST    @00,RPLBUFL(,RPLPTR)                                0197 00189000
*               RPLAREA=ADDR($TRMINPT);/* POINT TO BUFFER            */ 00190000
         LA    @00,$TRMINPT(,WAPTR)                                0198 00191000
         ST    @00,RPLAREA(,RPLPTR)                                0198 00192000
*             END;                                                 0199 00193000
*           ELSE                                                   0200 00194000
*             DO;                                                  0200 00195000
         B     @RC00195                                            0200 00196000
@RF00195 DS    0H                                                  0201 00197000
*               RPLBUFL=LENGTH(SCRATCH);                           0201 00198000
         MVC   RPLBUFL(4,RPLPTR),@CF00072                          0201 00199000
*               RPLAREA=ADDR(SCRATCH);                             0202 00200000
         LA    @00,SCRATCH                                         0202 00201000
         ST    @00,RPLAREA(,RPLPTR)                                0202 00202000
*             END;                                                 0203 00203000
*           GEN REFS(RPLPTR,ARG,ISTCC016);                         0204 00204000
@RC00195 DS    0H                                                  0204 00205000
*                                 /* READ DATA */                       00206000
 READ RPL=(RPLPTR),EXIT=ISTCC016,OPTCD=(ASY,TRUNC)                      00207000
*           IF R15^=0 THEN          /* IF ERROR, GET OUT FAST        */ 00208000
         LTR   R15,R15                                             0205 00209000
         BNZ   @RT00205                                            0205 00210000
*             GO TO C16C0075;       /* EXIT THE MODULE               */ 00211000
*           $DVINCT(1)=0;           /* READ NO MORE DATA             */ 00212000
         MVI   $DVINCT(WAPTR),X'00'                                0207 00213000
*           GOTO C16C0251;          /* EXIT                          */ 00214000
         B     C16C0251                                            0208 00215000
*         END;                      /* END OF READ FOR DATA          */ 00216000
*       CALL C16C0900;              /* PUT DATA IN CALLERS BUFFER    */ 00217000
@RF00193 BAL   @14,C16C0900                                        0210 00218000
*     END;                          /* END OF GETTING DATA FOR     0211 00219000
*                                      TERMINAL                      */ 00220000
*C16C0200:                                                         0212 00221000
*   IF INDX=CT&                     /* CHECK FOR LOGOFF RECEIVED     */ 00222000
*       RPLFDB3='04'X               /* IF YES                        */ 00223000
*     THEN                                                         0212 00224000
@RF00191 DS    0H                                                  0212 00225000
C16C0200 C     INDX,@CF00072                                       0212 00226000
         BNE   @RF00212                                            0212 00227000
         CLI   RPLFDB3(RPLPTR),4                                   0212 00228000
         BNE   @RF00212                                            0212 00229000
*     $EOJ=ON;                      /* SET EOJ FLAG TO FORCE CANCEL  */ 00230000
         OI    $EOJ(WAPTR),B'00000010'                             0213 00231000
*C16C0250:                                                         0214 00232000
*   RPLSAVE=$CURELEM(INDX);         /* SAVE PTR TO CURRENT ELEM      */ 00233000
@RF00212 DS    0H                                                  0214 00234000
C16C0250 LR    @11,INDX                                            0214 00235000
         MH    @11,@CH00337                                        0214 00236000
         L     @00,$CURELEM-68(@11,WAPTR)                          0214 00237000
         ST    @00,RPLSAVE                                         0214 00238000
*   RESPECIFY                                                      0215 00239000
*     PTR1 RESTRICTED;              /* DONT LET THIS REG GET ALTERED */ 00240000
*   PTR1=INDX;                      /* POINT TO PARTICULAR ENTRY     */ 00241000
         LR    PTR1,INDX                                           0216 00242000
*   CALL C16C0265;                  /* START THE NEXT RPL            */ 00243000
         BAL   @14,C16C0265                                        0217 00244000
*   RESPECIFY                                                      0218 00245000
*     PTR1 UNRESTRICTED;            /* RELEASE THIS REGISTER FOR USE */ 00246000
*   RPLPTR=RPLSAVE;                 /* RESTORE ELEM PTR              */ 00247000
         L     RPLPTR,RPLSAVE                                      0219 00248000
*   IF RPLPTR^=0 THEN               /* ONLY RELEASE IF THERE IS    0220 00249000
*                                      SOMETHING TO RELEASE          */ 00250000
         LTR   RPLPTR,RPLPTR                                       0220 00251000
         BZ    @RF00220                                            0220 00252000
*     CALL C16C0270;                /* FREE LAST RPL WE ARE DONE     */ 00253000
         BAL   @14,C16C0270                                        0221 00254000
*C16C0251:                                                         0222 00255000
*   ;                                                              0222 00256000
@RF00220 DS    0H                                                  0222 00257000
C16C0251 DS    0H                                                  0223 00258000
*   R14=C16EXSAV;                   /* RESTORE RET REG               */ 00259000
         L     R14,C16EXSAV                                        0223 00260000
*   RETURN;                         /* RETURN TO VTAM                */ 00261000
@EL00001 DS    0H                                                  0224 00262000
@EF00001 DS    0H                                                  0224 00263000
@ER00001 BR    @14                                                 0224 00264000
*C16C0225:                                                         0225 00265000
*   GEN SETS(RPLPTR);                                              0225 00266000
C16C0225 DS    0H                                                  0225 00267000
         EXECRPL RPL=(RPLPTR)                                           00268000
*   IF R15^=0 THEN                  /* CHECK FOR AN ERROR            */ 00269000
         LTR   R15,R15                                             0226 00270000
         BNZ   @RT00226                                            0226 00271000
*     GO TO C16C0075;               /* ERROR, GET OUT                */ 00272000
*   GOTO C16C0251;                                                 0228 00273000
         B     C16C0251                                            0228 00274000
*                                                                  0229 00275000
*   /*****************************************************************/ 00276000
*   /*                                                               */ 00277000
*   /* CODE TO HANDLE RECORD MODE                                    */ 00278000
*   /*                                                               */ 00279000
*   /*****************************************************************/ 00280000
*                                                                  0229 00281000
*C16C0253:                                                         0229 00282000
*   R6=0;                           /* SET FLAG FOR STARTING QUEUE 0229 00283000
*                                      AFTER RESPONSE OR NOT         */ 00284000
C16C0253 SLR   R6,R6                                               0229 00285000
*   IF RPLRRESP=OFF                 /* IF IT IS A RESPONSE           */ 00286000
*     THEN                                                         0230 00287000
         LA    @11,16                                              0230 00288000
         ALR   @11,RPLPTR                                          0230 00289000
         TM    RPLRRESP(@11),B'00001000'                           0230 00290000
         BNZ   @RF00230                                            0230 00291000
*     DO;                                                          0231 00292000
*                                                                  0231 00293000
*       /*************************************************************/ 00294000
*       /*                                                           */ 00295000
*       /* NOT A RESPONSE,EITHER NORMAL OR EXPIDITED FLOW            */ 00296000
*       /*                                                           */ 00297000
*       /*************************************************************/ 00298000
*                                                                  0232 00299000
*       IF RPLNFSYN=OFF             /* IF IT IS NOT SYNCHRONEOUS     */ 00300000
*         THEN                                                     0232 00301000
         TM    RPLNFSYN(@11),B'00000100'                           0232 00302000
         BNZ   @RF00232                                            0232 00303000
*         DO;                                                      0233 00304000
*           IF RPLSEQNO^=$DVSEQNO(INDX)/* CHECK FOR SEQ ERRORS       */ 00305000
*             THEN                                                 0234 00306000
         LR    @11,INDX                                            0234 00307000
         MH    @11,@CH00337                                        0234 00308000
         ALR   @11,WAPTR                                           0234 00309000
         CLC   RPLSEQNO+60(2,RPLPTR),$DVSEQNO-68(@11)              0234 00310000
         BE    @RF00234                                            0234 00311000
*             DO;                                                  0235 00312000
*               RPLSSNSO='0201'X;   /* SET ERROR STATUS              */ 00313000
         MVC   RPLSSNSO(2,RPLPTR),@CB01927                         0236 00314000
*               GOTO C16C0300;      /* SEND RESPONSE                 */ 00315000
         B     C16C0300                                            0237 00316000
*             END;                                                 0238 00317000
*           $DVSEQNO(INDX)=$DVSEQNO(INDX)+1;/* INCREMENT SEQ # BY 1  */ 00318000
@RF00234 LR    @11,INDX                                            0239 00319000
         MH    @11,@CH00337                                        0239 00320000
         LA    @00,1                                               0239 00321000
         LH    @10,$DVSEQNO-68(@11,WAPTR)                          0239 00322000
         N     @10,@CF02026                                        0239 00323000
         ALR   @00,@10                                             0239 00324000
         STH   @00,$DVSEQNO-68(@11,WAPTR)                          0239 00325000
*         END;                                                     0240 00326000
*       IF BINBRAK=ON               /* IF BOUND WITH BRACKETS        */ 00327000
*         THEN                                                     0241 00328000
@RF00232 LR    @11,INDX                                            0241 00329000
         MH    @11,@CH00337                                        0241 00330000
         LA    @10,$DEVSESP-68(@11,WAPTR)                          0241 00331000
         TM    BINBRAK-1(@10),B'00100000'                          0241 00332000
         BNO   @RF00241                                            0241 00333000
*         DO;                                                      0242 00334000
*           IF RPLBB=ON             /* IF BEGIN BRACKET ON           */ 00335000
*             THEN                                                 0243 00336000
         TM    RPLBB+16(RPLPTR),B'10000000'                        0243 00337000
         BNO   @RF00243                                            0243 00338000
*             $DVBRKST(INDX)=INB;   /* GOING INTO BRACKET            */ 00339000
         LA    @00,1                                               0244 00340000
         STC   @00,$DVBRKST-68(@11,WAPTR)                          0244 00341000
*           IF RPLEB=ON             /* IF END BRACKET ON             */ 00342000
*             THEN                                                 0245 00343000
@RF00243 TM    RPLEB+16(RPLPTR),B'01000000'                        0245 00344000
         BNO   @RF00245                                            0245 00345000
*             $DVBRKST(INDX)=BETB;  /* GOING TO BETWEEN BRACKETS     */ 00346000
         LR    @11,INDX                                            0246 00347000
         MH    @11,@CH00337                                        0246 00348000
         SLR   @00,@00                                             0246 00349000
         STC   @00,$DVBRKST-68(@11,WAPTR)                          0246 00350000
*         END;                                                     0247 00351000
@RF00245 DS    0H                                                  0248 00352000
*       N=MIN(RPLBUFL,RPLRLEN);     /* GET NUMBER OF BYTES GIVEN BY     00353000
*                                      VTAM                          */ 00354000
@RF00241 L     @00,RPLBUFL(,RPLPTR)                                0248 00355000
         L     @11,RPLRLEN(,RPLPTR)                                0248 00356000
         CR    @00,@11                                             0248 00357000
         BNH   *+6                                                      00358000
         LR    @00,@11                                             0248 00359000
         STH   @00,N                                               0248 00360000
*       IF $ASCII(INDX)=ON&RPLCSI=ON/* IF ASCII                      */ 00361000
*         THEN                                                     0249 00362000
         LR    @11,INDX                                            0249 00363000
         MH    @11,@CH00337                                        0249 00364000
         ALR   @11,WAPTR                                           0249 00365000
         TM    $ASCII-68(@11),B'00000100'                          0249 00366000
         BNO   @RF00249                                            0249 00367000
         TM    RPLCSI+16(RPLPTR),B'00001000'                       0249 00368000
         BNO   @RF00249                                            0249 00369000
*         DO I=1 TO N;              /* TRANSLATE EACH CHARACTER TO 0250 00370000
*                                      ASCII                         */ 00371000
         LA    @00,1                                               0250 00372000
         B     @DE00250                                            0250 00373000
@DL00250 DS    0H                                                  0251 00374000
*           DO M=1 TO LENGTH($TRASCII);/* SEARCH FOR ASCII MATCH     */ 00375000
         LA    @00,1                                               0251 00376000
         STH   @00,M                                               0251 00377000
@DL00251 DS    0H                                                  0252 00378000
*             IF $TRMINPT(I)=$TRASCII(M)/* IF CHAR FOUND IN TABLE    */ 00379000
*               THEN                                               0252 00380000
         LH    @11,I                                               0252 00381000
         L     @10,RCAPTR(,WAPTR)                                  0252 00382000
         ALR   @11,WAPTR                                           0252 00383000
         ALR   @10,@00                                             0252 00384000
         CLC   $TRMINPT-1(1,@11),$TRASCII-1(@10)                   0252 00385000
         BNE   @RF00252                                            0252 00386000
*               DO;                                                0253 00387000
*                 $TRMINPT(I)=M-1;  /* SET TO EBCDIC VALUE           */ 00388000
         LH    @11,I                                               0254 00389000
         BCTR  @00,0                                               0254 00390000
         STC   @00,$TRMINPT-1(@11,WAPTR)                           0254 00391000
*                 GOTO C16C0254;                                   0255 00392000
         B     C16C0254                                            0255 00393000
*               END;                                               0256 00394000
*           END;                                                   0257 00395000
@RF00252 LA    @00,1                                               0257 00396000
         AH    @00,M                                               0257 00397000
         STH   @00,M                                               0257 00398000
         C     @00,@CF00083                                        0257 00399000
         BNH   @DL00251                                            0257 00400000
*           RPLSSNSO='1001'X;       /* SET ERROR STATUS              */ 00401000
         MVC   RPLSSNSO(2,RPLPTR),@CB01931                         0258 00402000
*           GOTO C16C0300;          /* SEND RESPONSE                 */ 00403000
         B     C16C0300                                            0259 00404000
*C16C0254:                                                         0260 00405000
*         END;                                                     0260 00406000
C16C0254 LA    @00,1                                               0260 00407000
         AH    @00,I                                               0260 00408000
@DE00250 STH   @00,I                                               0260 00409000
         CH    @00,N                                               0260 00410000
         BNH   @DL00250                                            0260 00411000
*       IF RPLDATA=OFF              /* IF NO DATA RECEIVED           */ 00412000
*         THEN                                                     0261 00413000
@RF00249 LA    @11,16                                              0261 00414000
         ALR   @11,RPLPTR                                          0261 00415000
         TM    RPLDATA(@11),B'10000000'                            0261 00416000
         BNZ   @RF00261                                            0261 00417000
*         DO;                       /* THIS IS A CONTROL FUNCTION    */ 00418000
*                                                                  0262 00419000
*           /*********************************************************/ 00420000
*           /*                                                       */ 00421000
*           /* PROCESSING A FUNCTION NOT DATA                        */ 00422000
*           /*                                                       */ 00423000
*           /*********************************************************/ 00424000
*                                                                  0263 00425000
*           IF RPLCNCEL=ON          /* WAS CANCEL REQUESTED          */ 00426000
*             THEN                                                 0263 00427000
         TM    RPLCNCEL(@11),B'01000000'                           0263 00428000
         BNO   @RF00263                                            0263 00429000
*             DO;                                                  0264 00430000
*               $DVINCT(INDX)=LENGTH($TRMINPT);/* READ A NEW MESSAGE */ 00431000
         LR    @11,INDX                                            0265 00432000
         MH    @11,@CH00337                                        0265 00433000
         LA    @00,80                                              0265 00434000
         STC   @00,$DVINCT-68(@11,WAPTR)                           0265 00435000
*               $TRMINPT=$TRMINPT&&$TRMINPT;/* SCRATCH OLD MSG       */ 00436000
         XC    $TRMINPT(80,WAPTR),$TRMINPT(WAPTR)                  0266 00437000
*               GOTO C16C0300;                                     0267 00438000
         B     C16C0300                                            0267 00439000
*             END;                  /* SEND RESPONSE                 */ 00440000
*           IF RPLSIGNL=ON          /* IS IT A SIGNAL                */ 00441000
*             THEN                                                 0269 00442000
@RF00263 TM    RPLSIGNL+16(RPLPTR),B'00010000'                     0269 00443000
         BNO   @RF00269                                            0269 00444000
*             DO;                                                  0270 00445000
*               $CIREQ=ON;          /* COMMUNICATION INTERVAL      0271 00446000
*                                      REQUIRED                      */ 00447000
         OI    $CIREQ(WAPTR),B'00000001'                           0271 00448000
*               GOTO C16C0300;      /* SEND RESPONSE                 */ 00449000
         B     C16C0300                                            0272 00450000
*             END;                                                 0273 00451000
*           IF RPLCHASE=ON          /* IS IT A CHASE                 */ 00452000
*             THEN                                                 0274 00453000
@RF00269 LA    @11,16                                              0274 00454000
         ALR   @11,RPLPTR                                          0274 00455000
         TM    RPLCHASE(@11),B'00001000'                           0274 00456000
         BO    @RT00274                                            0274 00457000
*             GOTO C16C0300;        /* SEND RESPONSE                 */ 00458000
*           IF RPLLUS=ON            /* IS LU STATU BEING SENT        */ 00459000
*             THEN                                                 0276 00460000
         TM    RPLLUS(@11),B'00100000'                             0276 00461000
         BNO   @RF00276                                            0276 00462000
*             IF RPLSSEI=0          /* IS ERROR STATUS ZERO          */ 00463000
*               THEN                                               0277 00464000
         CLI   RPLSSEI(RPLPTR),0                                   0277 00465000
         BE    @RT00277                                            0277 00466000
*               GOTO C16C0300;      /* SEND RESPONSE                 */ 00467000
*             ELSE                                                 0279 00468000
*               GOTO C16C0075;                                     0279 00469000
         B     C16C0075                                            0279 00470000
*           IF RPLSHUTD=ON|RPLSHUTC=ON|RPLRSHUT=ON/* IF ANY SHUTDOWN    00471000
*                                      REQUESTS ARE ON               */ 00472000
*             THEN                                                 0280 00473000
@RF00276 LA    @11,16                                              0280 00474000
         ALR   @11,RPLPTR                                          0280 00475000
         TM    RPLSHUTD(@11),B'00011010'                           0280 00476000
         BNZ   @RT00280                                            0280 00477000
*             GOTO C16C0075;                                       0281 00478000
*           IF RPLRTR=ON            /* IS TERMINAL READY TO RECEIVE     00479000
*                                      DATA                          */ 00480000
*             THEN                                                 0282 00481000
         TM    RPLRTR(@11),B'01000000'                             0282 00482000
         BNO   @RF00282                                            0282 00483000
*             RPLSSNSO='0819'X;     /* SET ERROR STATUS              */ 00484000
         MVC   RPLSSNSO(2,RPLPTR),@CB01933                         0283 00485000
*           ELSE                                                   0284 00486000
*             RPLSSNSO='1007'X;     /* SET ERROR STATUS              */ 00487000
         B     @RC00282                                            0284 00488000
@RF00282 MVC   RPLSSNSO(2,RPLPTR),@CB01934                         0284 00489000
*           GOTO C16C0300;          /* SEND RESPONSE                 */ 00490000
         B     C16C0300                                            0285 00491000
*         END;                                                     0286 00492000
*       IF RPLFMHDR=ON              /* IS THERE AN FM HEADER @DM00898*/ 00493000
*         THEN                      /*                       @DM00898*/ 00494000
@RF00261 TM    RPLFMHDR(RPLPTR),B'00000001'                        0287 00495000
         BNO   @RF00287                                            0287 00496000
*         DO;                       /*                       @DM00898*/ 00497000
*           RPLSSNSO='1008'X;       /* SET ERROR STATUS      @DM00898*/ 00498000
         MVC   RPLSSNSO(2,RPLPTR),@CB01935                         0289 00499000
*           GOTO C16C0300;          /* SEND RESPONSE         @DM00898*/ 00500000
         B     C16C0300                                            0290 00501000
*         END;                      /*                       @DM00898*/ 00502000
*                                                                  0291 00503000
*       /*************************************************************/ 00504000
*       /*                                                           */ 00505000
*       /* DATA RECEIVED,CHECK IF WE MUST WAIT FOR MORE              */ 00506000
*       /*                                                           */ 00507000
*       /*************************************************************/ 00508000
*                                                                  0292 00509000
*       IF RPLONLY^=ON&RPLLAST^=ON  /* IS IT END OF CHAIN            */ 00510000
*         THEN                                                     0292 00511000
@RF00287 TM    RPLONLY+16(RPLPTR),B'00110000'                      0292 00512000
         BNZ   @RF00292                                            0292 00513000
*         DO;                                                      0293 00514000
*           $DVINCT(INDX)=0;        /* DON'T READ ANYMORE DATA FROM     00515000
*                                      TERMINAL                      */ 00516000
         LR    @11,INDX                                            0294 00517000
         MH    @11,@CH00337                                        0294 00518000
         SLR   @00,@00                                             0294 00519000
         STC   @00,$DVINCT-68(@11,WAPTR)                           0294 00520000
*           GOTO C16C0300;          /* SEND RESPONSE                 */ 00521000
         B     C16C0300                                            0295 00522000
*         END;                                                     0296 00523000
*       IF $CURELEM(INDX)=0|INCT=0|$DVSNDOK(INDX)='0'B/* IF NO     0297 00524000
*                                      ELEMENTS                      */ 00525000
*         THEN                                                     0297 00526000
@RF00292 LR    @11,INDX                                            0297 00527000
         MH    @11,@CH00337                                        0297 00528000
         L     @10,$CURELEM-68(@11,WAPTR)                          0297 00529000
         LTR   @10,@10                                             0297 00530000
         BZ    @RT00297                                            0297 00531000
         CLI   INCT(@10),0                                         0297 00532000
         BE    @RT00297                                            0297 00533000
         ALR   @11,WAPTR                                           0297 00534000
         TM    $DVSNDOK-68(@11),B'00010000'                        0297 00535000
         BNZ   @RF00297                                            0297 00536000
@RT00297 DS    0H                                                  0298 00537000
*         $CIREQ=ON;                /* COMMUNICATION INTERVAL      0298 00538000
*                                      REQUIRED                      */ 00539000
         OI    $CIREQ(WAPTR),B'00000001'                           0298 00540000
*       ELSE                                                       0299 00541000
*         DO;                       /* DATA RECEIVED FROM CT, PASS IT   00542000
*                                      BACK                          */ 00543000
         B     @RC00297                                            0299 00544000
@RF00297 DS    0H                                                  0300 00545000
*           CALL C16C0900;          /* PASS BACK RESPONSE TO CALLER  */ 00546000
         BAL   @14,C16C0900                                        0300 00547000
*           R6=1;                   /* START NEXT ELEMENT ON QUEUE   */ 00548000
         LA    R6,1                                                0301 00549000
*         END;                      /* END OF DATA RECEIVED FROM CT  */ 00550000
*C16C0300:                                                         0303 00551000
*       IF(RPLNFME=OFF|RPLRRN=ON)&  /* IF RESP TYPE 1 OR 2   @DM00899*/ 00552000
*           (RPLEX=OFF|RPLSSEO^=0) THEN/* AND NORMAL OR ECEPTION   0303 00553000
*                                                            @DM00899*/ 00554000
@RC00297 DS    0H                                                  0303 00555000
C16C0300 TM    RPLRRN+16(RPLPTR),B'00000001'                       0303 00556000
         BNZ   @GL00018                                            0303 00557000
         TM    RPLNFME+16(RPLPTR),B'00000010'                      0303 00558000
         BO    @RF00303                                            0303 00559000
@GL00018 TM    RPLEX+16(RPLPTR),B'00000100'                        0303 00560000
         BZ    @RT00303                                            0303 00561000
         CLI   RPLSSEO(RPLPTR),0                                   0303 00562000
         BE    @RF00303                                            0303 00563000
@RT00303 DS    0H                                                  0304 00564000
*         DO;                       /* RESPONSE REQUIRED TO INBOUND     00565000
*                                      REQUEST               @DM00899*/ 00566000
*           IF RPLSSEO^=0 THEN      /* EXCEPTION RESPONSE    @DM00899*/ 00567000
         CLI   RPLSSEO(RPLPTR),0                                   0305 00568000
         BE    @RF00305                                            0305 00569000
*             RPLEX=ON;             /* YES,SET EXCEPTION BIT @DM00899*/ 00570000
         OI    RPLEX+16(RPLPTR),B'00000100'                        0306 00571000
*           ARG=$CID(INDX);         /* PICK UP THE CID               */ 00572000
@RF00305 LR    @11,INDX                                            0307 00573000
         MH    @11,@CH00337                                        0307 00574000
         ALR   @11,WAPTR                                           0307 00575000
         ICM   ARG,15,$CID-68(@11)                                 0307 00576000
*           GEN REFS(RPLPTR,ARG);                                  0308 00577000
*                        /* SEND RESPONSE */                            00578000
 SEND RPL=(RPLPTR),POST=SCHED,STYPE=RESP,OPTCD=SYN,ARG=(ARG)            00579000
*           IF R15^=0 THEN          /* CHECK FOR ERROR RETURN CODE   */ 00580000
         LTR   R15,R15                                             0309 00581000
         BNZ   @RT00309                                            0309 00582000
*             GO TO C16C0075;       /* ERROR, GET OUT                */ 00583000
*         END;                                                     0311 00584000
*       IF R6^=0|$CURELEM(INDX)=0   /* SHOULD WE FREE THIS ELEMENT 0312 00585000
*                                      AND START ANEW        @DM00899*/ 00586000
*         THEN                                                     0312 00587000
@RF00303 SLR   @11,@11                                             0312 00588000
         CR    R6,@11                                              0312 00589000
         BNE   @RT00312                                            0312 00590000
         LR    @10,INDX                                            0312 00591000
         MH    @10,@CH00337                                        0312 00592000
         C     @11,$CURELEM-68(@10,WAPTR)                          0312 00593000
         BE    @RT00312                                            0312 00594000
*         GOTO C16C0250;            /* GET NEXT MESSAGE              */ 00595000
*C16C0256:                                                         0314 00596000
*       RPLAREA=ADDR($TRMINPT);     /* POINT TO THE BUFFER           */ 00597000
C16C0256 LA    @00,$TRMINPT(,WAPTR)                                0314 00598000
         ST    @00,RPLAREA(,RPLPTR)                                0314 00599000
*       RPLBUFL=$DVINCT(INDX);      /* SET FOR NUMBER OF BYTES TO  0315 00600000
*                                      READ                          */ 00601000
         LR    @11,INDX                                            0315 00602000
         MH    @11,@CH00337                                        0315 00603000
         SLR   @00,@00                                             0315 00604000
         IC    @00,$DVINCT-68(@11,WAPTR)                           0315 00605000
         ST    @00,RPLBUFL(,RPLPTR)                                0315 00606000
*       ARG=$CID(INDX);             /* PICK UP THE CID               */ 00607000
         ALR   @11,WAPTR                                           0316 00608000
         ICM   ARG,15,$CID-68(@11)                                 0316 00609000
*       GEN REFS(RPLPTR,ARG);                                      0317 00610000
*                      /* DO A RECEIVE */                               00611000
 RECEIVE RPL=(RPLPTR),ARG=(ARG),EXIT=ISTCC016,                         X00612000
               OPTCD=(ASY,TRUNC,Q),RTYPE=(DFSYN,DFASY,RESP)             00613000
*       IF R15^=0 THEN              /* CHECK FOR ERROR RETURN CODE   */ 00614000
         LTR   R15,R15                                             0318 00615000
         BNZ   @RT00318                                            0318 00616000
*         GO TO C16C0075;           /* IF ERROR,EXIT                 */ 00617000
*       GOTO C16C0251;              /* EXIT                          */ 00618000
         B     C16C0251                                            0320 00619000
*     END;                                                         0321 00620000
*                                                                  0321 00621000
*   /*****************************************************************/ 00622000
*   /*                                                               */ 00623000
*   /* RESPONSE RECEIVED FROM OUR REQUEST                            */ 00624000
*   /*                                                               */ 00625000
*   /*****************************************************************/ 00626000
*                                                                  0322 00627000
*   IF RPLEX=ON                     /* DID REQUEST TERMINATE WITH  0322 00628000
*                                      EXCEPTION                     */ 00629000
*     THEN                                                         0322 00630000
@RF00230 TM    RPLEX+16(RPLPTR),B'00000100'                        0322 00631000
         BNO   @RF00322                                            0322 00632000
*     DO;                           /* YES IT TERMINATED WITH AN   0323 00633000
*                                      EXCEPTION                     */ 00634000
*       IF RPLSSEI='08'X&(RPLSSMI='13'X|RPLSSMI='14'X|RPLSSMI='1B'X)    00635000
*                                   /* IS IT A TEMPORARY ERROR       */ 00636000
*         THEN                                                     0324 00637000
         CLI   RPLSSEI(RPLPTR),X'08'                               0324 00638000
         BNE   @RF00324                                            0324 00639000
         CLI   RPLSSMI(RPLPTR),19                                  0324 00640000
         BE    @RT00324                                            0324 00641000
         CLI   RPLSSMI(RPLPTR),20                                  0324 00642000
         BE    @RT00324                                            0324 00643000
         CLI   RPLSSMI(RPLPTR),27                                  0324 00644000
         BNE   @RF00324                                            0324 00645000
@RT00324 DS    0H                                                  0325 00646000
*         DO;                                                      0325 00647000
*           CALL C16C0280;          /* ADD ELEMENT BACK ON QUE       */ 00648000
         BAL   @14,C16C0280                                        0326 00649000
*           IF $DVSNDOK(INDX)=ON    /* IF OK TO SEND NEXT MSG        */ 00650000
*             THEN                                                 0327 00651000
         LR    @11,INDX                                            0327 00652000
         MH    @11,@CH00337                                        0327 00653000
         ALR   @11,WAPTR                                           0327 00654000
         TM    $DVSNDOK-68(@11),B'00010000'                        0327 00655000
         BO    @RT00327                                            0327 00656000
*             GOTO C16C0250;        /* GET ELEMENT OFF QUE AND START    00657000
*                                      IT                            */ 00658000
*           ELSE                                                   0329 00659000
*             GOTO C16C0256;        /* GOTO RECEIVE INPUT            */ 00660000
         B     C16C0256                                            0329 00661000
*         END;                                                     0330 00662000
*       ELSE                                                       0331 00663000
*         GOTO C16C0075;            /* FLAG CT OR AP AS AN ERROR     */ 00664000
*     END;                                                         0332 00665000
*   $DVSNDOK(INDX)=ON;                                             0333 00666000
@RF00322 LR    @11,INDX                                            0333 00667000
         MH    @11,@CH00337                                        0333 00668000
         ST    @11,@TF00001                                        0333 00669000
         ALR   @11,WAPTR                                           0333 00670000
         OI    $DVSNDOK-68(@11),B'00010000'                        0333 00671000
*   IF BINBRAK=ON                   /* IF BOUND WITH BRACKETS        */ 00672000
*     THEN                                                         0334 00673000
         L     @11,@TF00001                                        0334 00674000
         LA    @11,$DEVSESP-68(@11,WAPTR)                          0334 00675000
         BCTR  @11,0                                               0334 00676000
         TM    BINBRAK(@11),B'00100000'                            0334 00677000
         BNO   @RF00334                                            0334 00678000
*     IF BINBKTR=ON&$DVBRKSN(INDX)=SNDEB/* CHECK BRACKET             */ 00679000
*       THEN                                                       0335 00680000
         TM    BINBKTR(@11),B'00010000'                            0335 00681000
         BNO   @RF00335                                            0335 00682000
         L     @11,@TF00001                                        0335 00683000
         SLR   @00,@00                                             0335 00684000
         IC    @00,$DVBRKSN-68(@11,WAPTR)                          0335 00685000
         C     @00,@CF00139                                        0335 00686000
         BNE   @RF00335                                            0335 00687000
*       $DVBRKST(INDX)=BETB;        /* NOW BETWEEN BRACKETS          */ 00688000
         SLR   @00,@00                                             0336 00689000
         L     @11,@TF00001                                        0336 00690000
         STC   @00,$DVBRKST-68(@11,WAPTR)                          0336 00691000
*     ELSE                                                         0337 00692000
*       IF $DVBRKSN(INDX)=SNDBB     /* WAS BEGIN BRACKET SUCCESSFUL  */ 00693000
*         THEN                                                     0337 00694000
         B     @RC00335                                            0337 00695000
@RF00335 LA    @11,1                                               0337 00696000
         LR    @10,INDX                                            0337 00697000
         MH    @10,@CH00337                                        0337 00698000
         SLR   @00,@00                                             0337 00699000
         IC    @00,$DVBRKSN-68(@10,WAPTR)                          0337 00700000
         CR    @11,@00                                             0337 00701000
         BNE   @RF00337                                            0337 00702000
*         $DVBRKST(INDX)=INB;       /* NOW IN BRACKET                */ 00703000
         STC   @11,$DVBRKST-68(@10,WAPTR)                          0338 00704000
*   IF $CURELEM(INDX)->INCT^=0      /* POINT TO CURRENT ELEMENT AND     00705000
*                                      CHECK FOR INPUT               */ 00706000
*     THEN                                                         0339 00707000
@RF00337 DS    0H                                                  0339 00708000
@RC00335 DS    0H                                                  0339 00709000
@RF00334 LR    @11,INDX                                            0339 00710000
         MH    @11,@CH00337                                        0339 00711000
         L     @11,$CURELEM-68(@11,WAPTR)                          0339 00712000
         CLI   INCT(@11),0                                         0339 00713000
         BNE   @RT00339                                            0339 00714000
*     GOTO C16C0256;                /* GOTO RECEIVE INPUT            */ 00715000
*   GOTO C16C0250;                  /* GET ELEMENT OFF QUE AND START    00716000
*                                      IT                            */ 00717000
         B     C16C0250                                            0341 00718000
*   RESPECIFY                                                      0342 00719000
*    (R0,                                                          0342 00720000
*     R1) RESTRICTED;               /* DONT LET THESE REGISTERS GET     00721000
*                                      ALTRED                        */ 00722000
*C16C1000:                                                         0343 00723000
*   GEN REFS(C16C1000,BASE,R12,R13,R14,R15,C16CBUF2);              0343 00724000
C16C1000 DS    0H                                                  0343 00725000
*                                                 /*SETUP @ZD10878*/    00726000
         USING C16C1000,R15                                             00727000
         STM   R14,R12,12(R13)     SAVE CALLERS REGISTERS               00728000
         L     R12,BASE            PICK UP COMMON BASE ADDRESS          00729000
         DROP  R15                                                      00730000
         LA    R9,C16CBUF2 POINT TO MAINLINE WORK AREA         @ZD10878 00731000
*   SAVEA(2)=R13;                   /* SAVE ADDRESS OF CALLERS     0344 00732000
*                                      SAVEAREA                      */ 00733000
         ST    R13,SAVEA+4                                         0344 00734000
*   BACKSAVE(3)=ADDR(SAVEA);        /* POINT TO MY SAVEAREA          */ 00735000
         LA    @11,SAVEA                                           0345 00736000
         ST    @11,BACKSAVE+8(,R13)                                0345 00737000
*   R13=ADDR(SAVEA);                /* GET ADDRESS OF MY SAVEAREA    */ 00738000
         LR    R13,@11                                             0346 00739000
*   INDX=R1;                        /* POINT TO ENTRY IN DEV TABLE   */ 00740000
         LR    INDX,R1                                             0347 00741000
*   IF R0=0 THEN                    /* IF CALLED TO START A QUE      */ 00742000
         LTR   R0,R0                                               0348 00743000
         BNZ   @RF00348                                            0348 00744000
*     DO;                           /* THEN START THE QUEUE PASSED IN   00745000
*                                      R1                            */ 00746000
*       CALL C16C0265;              /* START THE QUEUE POINTED TO BY    00747000
*                                      R1                            */ 00748000
         BAL   @14,C16C0265                                        0350 00749000
*       GO TO C16C1050;             /* EXIT THE MODULE               */ 00750000
         B     C16C1050                                            0351 00751000
*     END;                          /* END OF ROUTINE TO START QUEUE */ 00752000
*   IF R0=4 THEN                    /* IF CALLED TO PURGE A QUEUE    */ 00753000
@RF00348 C     R0,@CF00068                                         0353 00754000
         BNE   @RF00353                                            0353 00755000
*     DO;                           /* PURGE QUEUE POINTED TO BY RU  */ 00756000
*       RESPECIFY                                                  0355 00757000
*        (PTR1,                                                    0355 00758000
*         PTR2) RESTRICTED;         /* DONT ALTER REGISTERS          */ 00759000
*       PTR2=PTR1;                  /* SAVE ADDRESS OF QUEUE         */ 00760000
         LR    PTR2,PTR1                                           0356 00761000
*       R0=0;                       /* INDICATE NO ELEMENTS ON CHAIN */ 00762000
         SLR   R0,R0                                               0357 00763000
*C16C1005:                                                         0358 00764000
*       PTR1=LASTCHN;               /* GET CHAIN PTR                 */ 00765000
C16C1005 L     PTR1,LASTCHN(,PTR2)                                 0358 00766000
*       CS(PTR1,R0,LASTCHN);        /* REMOVE ALL ELEMENTS FROM QUEUE*/ 00767000
         CS    PTR1,@00,LASTCHN(PTR2)                              0359 00768000
*       BC(4,C16C1005);             /* COMPARE AND SWAP FAILED, TRY     00769000
*                                      AGAIN                         */ 00770000
         BC    4,C16C1005                                          0360 00771000
*       IF((PTR1&GATEBIT0)^=0) THEN /* CHECK FOR ANYTHING ON QUE   0361 00772000
*                                                            @ZD10874*/ 00773000
         LR    @11,PTR1                                            0361 00774000
         N     @11,@CF00640                                        0361 00775000
         LTR   @11,@11                                             0361 00776000
         BZ    @RF00361                                            0361 00777000
*         DO;                                                      0362 00778000
*           R8=PTR1;                /* POINT TO NEXT ELEMENT @DA04688*/ 00779000
         LR    R8,PTR1                                             0363 00780000
*C16C1025:                                                         0364 00781000
*           RPLPTR=R8;              /* POINT TO ELE TO BE FREED    0364 00782000
*                                                            @ZD10874*/ 00783000
C16C1025 LR    RPLPTR,R8                                           0364 00784000
*           R8=RPLPTR->CHAIN&GATEBIT0;/* POINT TO NEXT ELE   @ZD10874*/ 00785000
         L     R8,CHAIN(,RPLPTR)                                   0365 00786000
         N     R8,@CF00640                                         0365 00787000
*           CALL C16C0270;          /* FREE THIS ELEMENT     @ZD10874*/ 00788000
         BAL   @14,C16C0270                                        0366 00789000
*           IF R8^=0 THEN           /* ANY ELEMENTS LEFT ON QUE    0367 00790000
*                                                            @ZD10874*/ 00791000
         LTR   R8,R8                                               0367 00792000
         BNZ   @RT00367                                            0367 00793000
*             GOTO C16C1025;        /* YES FREE IT           @ZD10874*/ 00794000
*         END;                      /* END OF LOOPING THOOUGHT THE 0369 00795000
*                                      ELEMENTS                      */ 00796000
*       GO TO C16C1050;             /* EXIT THE MODULE               */ 00797000
         B     C16C1050                                            0370 00798000
*     END;                          /* END OF FREEING HE QUE CODE    */ 00799000
*C16C1050:                                                         0372 00800000
*   GEN REFS(R13,R12,R14);                                         0372 00801000
@RF00353 DS    0H                                                  0372 00802000
C16C1050 DS    0H                                                  0372 00803000
         L     R13,4(R13)          PICK UP LAST SAVE AREA ADDRESS       00804000
         LM    R14,R12,12(R13)     RESTORE REGISTERS                    00805000
         BR    R14                 RETURN TO CALLER                     00806000
*   RESPECIFY                                                      0373 00807000
*    (PTR1,                                                        0373 00808000
*     PTR2) UNRESTRICTED;           /* REGISTERS ARE FREE AGAIN      */ 00809000
*   RESPECIFY                                                      0374 00810000
*    (R0,                                                          0374 00811000
*     R1) UNRESTRICTED;             /* RELEASE THESE REGISTERS FOR 0374 00812000
*                                      USE                           */ 00813000
*C16C0255:                                                         0375 00814000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0375 00815000
         B     @PB00002                                            0375 00816000
C16C0255 DS    0H                                                  0376 00817000
*   RESPECIFY                                                      0376 00818000
*    (PTR1,                                                        0376 00819000
*     PTR2) RESTRICTED;             /* DONT ALTER REGISTERS          */ 00820000
*   R7=R14;                         /* SAVE R14 FOR RETRUN           */ 00821000
         LR    R7,R14                                              0377 00822000
*   PTR2=ADDR($MSGOTSD(INDX));      /* SAVE PTR1                     */ 00823000
         LR    @11,INDX                                            0378 00824000
         MH    @11,@CH00337                                        0378 00825000
         LA    PTR2,$MSGOTSD-68(@11,WAPTR)                         0378 00826000
*   PTR1=LASTCHN&GATEBIT0;          /* PTR TO 1ST ELEMENT            */ 00827000
         L     PTR1,LASTCHN(,PTR2)                                 0379 00828000
         N     PTR1,@CF00640                                       0379 00829000
*   IF PTR1=0 THEN                  /* IF NO OUTSTANDING MESSAGES    */ 00830000
         LTR   PTR1,PTR1                                           0380 00831000
         BNZ   @RF00380                                            0380 00832000
*     DO;                           /* HANDLE AS SPECIAL CASE        */ 00833000
*       LASTCHN=PTR1;               /* SET MESSAGES OUTSTANDING TO 0382 00834000
*                                      ZERO                          */ 00835000
         ST    PTR1,LASTCHN(,PTR2)                                 0382 00836000
*       R1=ADDR($TLTECB2);          /* POINT TO ECB TO BE POSTED   0383 00837000
*                                                            @ZD10879*/ 00838000
         L     R1,RCAPTR(,WAPTR)                                   0383 00839000
         LA    R1,$TLTECB2(,R1)                                    0383 00840000
*       IF $CTEQTT='1'B&($SNDRFLG='1'B|$EXIOWAT='1'B)/* POST ECB   0384 00841000
*                                                            @ZD10879*/ 00842000
*         THEN                                                     0384 00843000
         TM    $CTEQTT(WAPTR),B'00010000'                          0384 00844000
         BNO   @RF00384                                            0384 00845000
         TM    $SNDRFLG(WAPTR),B'00100100'                         0384 00846000
         BZ    @RF00384                                            0384 00847000
*         CALL I00C1001;            /* POST ECB              @ZD10879*/ 00848000
         L     @15,@CV01956                                        0385 00849000
         BALR  @14,@15                                             0385 00850000
*       PTR1=0;                     /* SHOW NO ELEMENT FOUND @ZD10879*/ 00851000
@RF00384 SLR   PTR1,PTR1                                           0386 00852000
*       GO TO C16C0260;             /* EXIT FROM THE FUNCTION        */ 00853000
         B     C16C0260                                            0387 00854000
*     END;                          /* END OF THE SPECIAL CASE       */ 00855000
*   DO WHILE((PTR1->CHAIN&GATEBIT0)^=0);/* LOOP UNTIL LAST ELEMENT   */ 00856000
@RF00380 B     @DE00389                                            0389 00857000
@DL00389 DS    0H                                                  0390 00858000
*     PTR2=PTR1;                    /* ADDR OF PTR TO NEXT ELEMENT   */ 00859000
         LR    PTR2,PTR1                                           0390 00860000
*     PTR1=PTR2->CHAIN;             /* ADDR OF NEXT ELEMENT          */ 00861000
         L     PTR1,CHAIN(,PTR2)                                   0391 00862000
*   END;                            /* END OF LOOP LOOKING FOR LAST     00863000
*                                      ELEMENT                       */ 00864000
@DE00389 L     @00,CHAIN(,PTR1)                                    0392 00865000
         N     @00,@CF00640                                        0392 00866000
         LTR   @00,@00                                             0392 00867000
         BNZ   @DL00389                                            0392 00868000
*   PTR2->LASTCHN=GATEBIT1;         /* ZERO LAST CHAIN PTR           */ 00869000
         MVC   LASTCHN(4,PTR2),@CF00642                            0393 00870000
*C16C0260:                                                         0394 00871000
*   R14=R7;                         /* RETURN TO THE CALLER          */ 00872000
C16C0260 LR    R14,R7                                              0394 00873000
*   END C16C0255;                   /* END OF SUBROUTINE TO REMOVE 0395 00874000
*                                      ELEMENT FROM QUEUE            */ 00875000
@EL00002 DS    0H                                                  0395 00876000
@EF00002 DS    0H                                                  0395 00877000
@ER00002 BR    @14                                                 0395 00878000
*   RESPECIFY                                                      0396 00879000
*    (PTR1,                                                        0396 00880000
*     PTR2) UNRESTRICTED;           /* REGISTERS ARE FREE AGAIN      */ 00881000
*   RESPECIFY                                                      0397 00882000
*     R1 RESTRICTED;                /* DONT LET THIS REG GET ALTERED */ 00883000
*C16C0265:                                                         0398 00884000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0398 00885000
C16C0265 DS    0H                                                  0399 00886000
*   R8=R14;                         /* SAVE THE RETURN ADDRESS       */ 00887000
         LR    R8,R14                                              0399 00888000
*   CALL C16C0255;                  /* GET AN RPL TO PROCESS         */ 00889000
         BAL   @14,C16C0255                                        0400 00890000
*   $CURELEM(INDX)=PTR1;                                           0401 00891000
         LR    @11,INDX                                            0401 00892000
         MH    @11,@CH00337                                        0401 00893000
         ST    PTR1,$CURELEM-68(@11,WAPTR)                         0401 00894000
*   RPLPTR=ADDR($TLTRPL1);          /* POINT TO THE CT RPL           */ 00895000
         LA    RPLPTR,$TLTRPL1(,WAPTR)                             0402 00896000
*   IF INDX=2 THEN                  /* CHECK TO SEE WHICH RPL IS   0403 00897000
*                                      CORRECT                       */ 00898000
         C     INDX,@CF00139                                       0403 00899000
         BNE   @RF00403                                            0403 00900000
*     RPLPTR=ADDR($TLTRPL2);        /* MUST BE AN AP                 */ 00901000
         LA    RPLPTR,$TLTRPL2(,WAPTR)                             0404 00902000
*   ARG=$CID(INDX);                 /* PICK UP THE CID               */ 00903000
@RF00403 LR    @11,INDX                                            0405 00904000
         MH    @11,@CH00337                                        0405 00905000
         ST    @11,@TF00001                                        0405 00906000
         ALR   @11,WAPTR                                           0405 00907000
         ICM   ARG,15,$CID-68(@11)                                 0405 00908000
*   RPLUSFLD=WAPTR;                 /* SAVE WAPTR            @DM30415*/ 00909000
         ST    WAPTR,RPLUSFLD(,RPLPTR)                             0406 00910000
*   IF R1^=0 THEN                   /* CHECK FOR ELEMENT TO PROCESS  */ 00911000
         LTR   R1,R1                                               0407 00912000
         BZ    @RF00407                                            0407 00913000
*     DO;                           /* IF THER WAS A RETURNED      0408 00914000
*                                      ELEMENT, START IT             */ 00915000
*       RESPECIFY                                                  0409 00916000
*         R1 UNRESTRICTED;          /* RELEASE THIS REGISTER FOR USE */ 00917000
*       R7=ADDR(MSG);               /* POINT TO MSG TO BE SENT       */ 00918000
         L     @11,@TF00001                                        0410 00919000
         L     @11,$CURELEM-68(@11,WAPTR)                          0410 00920000
         LA    R7,MSG(,@11)                                        0410 00921000
*       R6=OUTCT;                   /* SET UP LENGTH OF OUTBOUND MSG */ 00922000
         SLR   R6,R6                                               0411 00923000
         IC    R6,OUTCT(,@11)                                      0411 00924000
*       IF $DEVLU(INDX)=OFF         /* IF NOT AN LU                  */ 00925000
*         THEN                                                     0412 00926000
         LR    @11,WAPTR                                           0412 00927000
         AL    @11,@TF00001                                        0412 00928000
         TM    $DEVLU-68(@11),B'00001000'                          0412 00929000
         BNZ   @RF00412                                            0412 00930000
*         DO;                                                      0413 00931000
*           IF $DVCTBYT(INDX)=OFF   /* IF NO CONTROL BYTE PRESENT    */ 00932000
*             THEN                                                 0414 00933000
         LR    @11,WAPTR                                           0414 00934000
         AL    @11,@TF00001                                        0414 00935000
         TM    $DVCTBYT-68(@11),B'00000010'                        0414 00936000
         BNZ   @RF00414                                            0414 00937000
*             GEN REFS(RPLPTR,ISTCC016,ARG,R6,R7);                 0415 00938000
 WRITE RPL=(RPLPTR),OPTCD=ASY,EXIT=ISTCC016,ARG=(ARG),                 X00939000
               AREA=(R7),RECLEN=(R6)                                    00940000
*           ELSE                                                   0416 00941000
*             DO;                                                  0416 00942000
         B     @RC00414                                            0416 00943000
@RF00414 DS    0H                                                  0417 00944000
*               R7=R7+1;            /* SKIP OVER CONTROL BYTE        */ 00945000
         AL    R7,@CF00072                                         0417 00946000
*               R6=R6-1;            /* REDUCE THE COUNT              */ 00947000
         BCTR  R6,0                                                0418 00948000
*               IF MSG(1)='1'       /* SHOULD SCREEN BE ERASED       */ 00949000
*                 THEN                                             0419 00950000
         LR    @11,INDX                                            0419 00951000
         MH    @11,@CH00337                                        0419 00952000
         L     @11,$CURELEM-68(@11,WAPTR)                          0419 00953000
         CLI   MSG(@11),C'1'                                       0419 00954000
         BNE   @RF00419                                            0419 00955000
*                 GEN REFS(RPLPTR,ISTCC016,ARG,R6,R7);             0420 00956000
 WRITE RPL=(RPLPTR),EXIT=ISTCC016,ARG=(ARG),RECLEN=(R6),               X00957000
               AREA=(R7),OPTCD=(ASY,LBT,NERASE)                         00958000
*               ELSE                                               0421 00959000
*                 GEN REFS(RPLPTR,ISTCC016,ARG,R6,R7);             0421 00960000
         B     @RC00419                                            0421 00961000
@RF00419 DS    0H                                                  0421 00962000
 WRITE RPL=(RPLPTR),EXIT=ISTCC016,ARG=(ARG),RECLEN=(R6),               X00963000
               AREA=(R7),OPTCD=(ASY,LBT,ERASE)                          00964000
*             END;                                                 0422 00965000
*         END;                                                     0423 00966000
*       ELSE                        /* PROCESS AN LU         @D32JPGH*/ 00967000
*         DO;                                                      0424 00968000
         B     @RC00412                                            0424 00969000
@RF00412 DS    0H                                                  0425 00970000
*           IF BINBRAK=ON           /* DID WE BIND TO USE BRACKETS 0425 00971000
*                                                            @D32JPGH*/ 00972000
*             THEN                                                 0425 00973000
         LR    @11,INDX                                            0425 00974000
         MH    @11,@CH00337                                        0425 00975000
         LA    @10,$DEVSESP-68(@11,WAPTR)                          0425 00976000
         TM    BINBRAK-1(@10),B'00100000'                          0425 00977000
         BNO   @RF00425                                            0425 00978000
*             DO;                                                  0426 00979000
*               RPLBB=OFF;                                         0427 00980000
*               RPLEB=OFF;                                         0428 00981000
         LA    @10,16                                              0428 00982000
         ALR   @10,RPLPTR                                          0428 00983000
         NI    RPLBB(@10),B'00111111'                              0428 00984000
*               $DVBRKSN(INDX)=0;   /* RESET BRACKET TO ZERO @D32JPGH*/ 00985000
         SLR   @00,@00                                             0429 00986000
         STC   @00,$DVBRKSN-68(@11,WAPTR)                          0429 00987000
*               IF $DVBRKST(INDX)^=INB/* NOT IN BRACKET STATE      0430 00988000
*                                                            @D32JPGH*/ 00989000
*                 THEN              /* THEN                  @D32JPGH*/ 00990000
         SLR   @00,@00                                             0430 00991000
         IC    @00,$DVBRKST-68(@11,WAPTR)                          0430 00992000
         C     @00,@CF00072                                        0430 00993000
         BE    @RF00430                                            0430 00994000
*                 RPLBB=ON;         /* SET BEGIN BRACKET     @D32JPGH*/ 00995000
         OI    RPLBB(@10),B'10000000'                              0431 00996000
*               IF($MSGOTSD(INDX)&GATEBIT0)=0&INCT=0/* IF NO MORE  0432 00997000
*                                      ELEMENTS AND DON'T NEED DATA  */ 00998000
*                 THEN                                             0432 00999000
@RF00430 LR    @11,INDX                                            0432 01000000
         MH    @11,@CH00337                                        0432 01001000
         L     @00,$MSGOTSD-68(@11,WAPTR)                          0432 01002000
         N     @00,@CF00640                                        0432 01003000
         LTR   @00,@00                                             0432 01004000
         BNZ   @RF00432                                            0432 01005000
         L     @11,$CURELEM-68(@11,WAPTR)                          0432 01006000
         CLI   INCT(@11),0                                         0432 01007000
         BNE   @RF00432                                            0432 01008000
*                 RPLEB=ON;         /* END BRACKET           @D32JPGH*/ 01009000
         OI    RPLEB+16(RPLPTR),B'01000000'                        0433 01010000
*               IF RPLBB=ON THEN    /* IF SENDING A BB               */ 01011000
@RF00432 LA    @11,16                                              0434 01012000
         ALR   @11,RPLPTR                                          0434 01013000
         TM    RPLBB(@11),B'10000000'                              0434 01014000
         BNO   @RF00434                                            0434 01015000
*                 IF RPLEB=ON THEN  /* AND IF SENDING AN EB          */ 01016000
         TM    RPLEB(@11),B'01000000'                              0435 01017000
         BNO   @RF00435                                            0435 01018000
*                   $DVBRKST(INDX)=BETB;/* THEN GOING BETEWEEN     0436 01019000
*                                      BRACKET                       */ 01020000
         LR    @11,INDX                                            0436 01021000
         MH    @11,@CH00337                                        0436 01022000
         SLR   @00,@00                                             0436 01023000
         STC   @00,$DVBRKST-68(@11,WAPTR)                          0436 01024000
*                 ELSE              /* IF BB AND NOT EB              */ 01025000
*                   $DVBRKSN(INDX)=SNDBB;/* OTHERWISE, ONLY SENDING     01026000
*                                      BB                            */ 01027000
         B     @RC00435                                            0437 01028000
@RF00435 LR    @11,INDX                                            0437 01029000
         MH    @11,@CH00337                                        0437 01030000
         LA    @00,1                                               0437 01031000
         STC   @00,$DVBRKSN-68(@11,WAPTR)                          0437 01032000
*               ELSE                /* IF NOT SENDING BB             */ 01033000
*                 IF RPLEB=ON THEN  /* IF AN EB WITHOUT A BB         */ 01034000
         B     @RC00434                                            0438 01035000
@RF00434 TM    RPLEB+16(RPLPTR),B'01000000'                        0438 01036000
         BNO   @RF00438                                            0438 01037000
*                   IF BINBKTR=ON THEN/* AND IF CONDITIONAL        0439 01038000
*                                      TERMINATION                   */ 01039000
         LR    @11,INDX                                            0439 01040000
         MH    @11,@CH00337                                        0439 01041000
         LA    @10,$DEVSESP-68(@11,WAPTR)                          0439 01042000
         TM    BINBKTR-1(@10),B'00010000'                          0439 01043000
         BNO   @RF00439                                            0439 01044000
*                     $DVBRKSN(INDX)=SNDEB;/* ONLY SENDING AN EB     */ 01045000
         LA    @00,2                                               0440 01046000
         STC   @00,$DVBRKSN-68(@11,WAPTR)                          0440 01047000
*                   ELSE            /* SENDING EB ONLY,NO CONDITIONAL   01048000
*                                      TERMINATION                   */ 01049000
*                     $DVBRKST(INDX)=BETB;/* GO TO BETWEEN BRACKETS  */ 01050000
         B     @RC00439                                            0441 01051000
@RF00439 LR    @11,INDX                                            0441 01052000
         MH    @11,@CH00337                                        0441 01053000
         SLR   @00,@00                                             0441 01054000
         STC   @00,$DVBRKST-68(@11,WAPTR)                          0441 01055000
*             END;                  /* END OF BRACKET STATE MANAGER  */ 01056000
@RC00439 DS    0H                                                  0442 01057000
@RF00438 DS    0H                                                  0442 01058000
@RC00434 DS    0H                                                  0443 01059000
*           IF $ASCII(INDX)=ON THEN /* IF ASCII, SET ALTERNATE CODE     01060000
*                                      BIT                   @ZD10887*/ 01061000
@RF00425 LR    @11,INDX                                            0443 01062000
         MH    @11,@CH00337                                        0443 01063000
         ALR   @11,WAPTR                                           0443 01064000
         TM    $ASCII-68(@11),B'00000100'                          0443 01065000
         BNO   @RF00443                                            0443 01066000
*             RPLCSI=ON;            /* ITS ASCII, SET BIT            */ 01067000
         OI    RPLCSI+16(RPLPTR),B'00001000'                       0444 01068000
*           $DVSNDOK(INDX)=OFF;     /* DONT SEND ANOTHER MSG         */ 01069000
@RF00443 LR    @11,INDX                                            0445 01070000
         MH    @11,@CH00337                                        0445 01071000
         ST    @11,@TF00001                                        0445 01072000
         ALR   @11,WAPTR                                           0445 01073000
         NI    $DVSNDOK-68(@11),B'11101111'                        0445 01074000
*           IF INCT^=0&BINFMTRM=BINHDXFF THEN/* IF ANSWER EXPECTED 0446 01075000
*                                      AND HALF- DUPLEX FF CHANGE  0446 01076000
*                                      DIRECTION             @AX11982*/ 01077000
         L     @11,@TF00001                                        0446 01078000
         L     @11,$CURELEM-68(@11,WAPTR)                          0446 01079000
         CLI   INCT(@11),0                                         0446 01080000
         BE    @RF00446                                            0446 01081000
         L     @11,@TF00001                                        0446 01082000
         LA    @11,$DEVSESP-68(@11,WAPTR)                          0446 01083000
         TM    BINFMTRM-1(@11),B'10000000'                         0446 01084000
         BNO   @RF00446                                            0446 01085000
         TM    BINFMTRM-1(@11),B'01000000'                         0446 01086000
         BNZ   @RF00446                                            0446 01087000
*             RPLCMD='1'B;                                         0447 01088000
         OI    RPLCMD+16(RPLPTR),B'00100000'                       0447 01089000
*           GEN REFS(RPLPTR,ARG,R6,R7);                            0448 01090000
@RF00446 DS    0H                                                  0448 01091000
 SEND RPL=(RPLPTR),ARG=(ARG),AREA=(R7),RECLEN=(R6),                    X01092000
               STYPE=REQ,CONTROL=DATA,POST=SCHED,CHAIN=ONLY,           X01093000
               OPTCD=(SYN,NFMHDR),RESPOND=(NEX,FME,NRRN)                01094000
*         END;                      /* END OF LU(RECORD) PROCESSING  */ 01095000
*       IF R15^=0 THEN              /* CHECK TO SEE THE I/O WENT O.K */ 01096000
@RC00412 LTR   R15,R15                                             0450 01097000
         BZ    @RF00450                                            0450 01098000
*         DO;                       /* BAD R.C., PROCESS             */ 01099000
*           CALL C16C0920;          /* IF ERROR, FREE STORAGE        */ 01100000
         BAL   @14,C16C0920                                        0452 01101000
*           GO TO C16C0266;         /* IF ERROR,GET OUT NOW          */ 01102000
         B     C16C0266                                            0453 01103000
*         END;                      /* END OF BAD R.C, PROCESSING    */ 01104000
*     END;                          /* END OF STARTING A NEW ELEMENT    01105000
*                                      OPERATION                     */ 01106000
@RF00450 DS    0H                                                  0456 01107000
*   IF $DEVLU(INDX)='1'B THEN       /* IF THIS IS AN LU, RECEIVE RESP*/ 01108000
@RF00407 LR    @11,INDX                                            0456 01109000
         MH    @11,@CH00337                                        0456 01110000
         ST    @11,@TF00001                                        0456 01111000
         ALR   @11,WAPTR                                           0456 01112000
         TM    $DEVLU-68(@11),B'00001000'                          0456 01113000
         BNO   @RF00456                                            0456 01114000
*     DO;                           /* LU, GET THE DATA              */ 01115000
*       RPLBUFL=$DVINCT(INDX);      /* POINT TO BUFFER TO READ INTO  */ 01116000
         L     @11,@TF00001                                        0458 01117000
         SLR   @00,@00                                             0458 01118000
         IC    @00,$DVINCT-68(@11,WAPTR)                           0458 01119000
         ST    @00,RPLBUFL(,RPLPTR)                                0458 01120000
*       RPLAREA=ADDR($TRMINPT);     /* LOCATION                      */ 01121000
         LA    @00,$TRMINPT(,WAPTR)                                0459 01122000
         ST    @00,RPLAREA(,RPLPTR)                                0459 01123000
*       GEN REFS(RPLPTR,ARG);                                      0460 01124000
 RECEIVE RPL=(RPLPTR),ARG=(ARG),EXIT=ISTCC016,                         X01125000
               OPTCD=(ASY,TRUNC,Q),RTYPE=(DFSYN,DFASY,RESP)             01126000
*       IF R15^=0 THEN              /* IF ERROR DURING RECEIVE       */ 01127000
         LTR   R15,R15                                             0461 01128000
         BZ    @RF00461                                            0461 01129000
*         CALL C16C0920;            /* ERROR, GET RID OF EVERYTHING  */ 01130000
         BAL   @14,C16C0920                                        0462 01131000
*     END;                          /* END OF LU RECEIVE FOR RESPONSE*/ 01132000
@RF00461 DS    0H                                                  0464 01133000
*C16C0266:                                                         0464 01134000
*   R14=R8;                         /* RESTORE REG 14                */ 01135000
@RF00456 DS    0H                                                  0464 01136000
C16C0266 LR    R14,R8                                              0464 01137000
*   END C16C0265;                   /* END OF ROUTINE TO START AN  0465 01138000
*                                      ELEMENT ON QUEUE              */ 01139000
@EL00003 DS    0H                                                  0465 01140000
@EF00003 DS    0H                                                  0465 01141000
@ER00003 BR    @14                                                 0465 01142000
*C16C0270:                                                         0466 01143000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0466 01144000
C16C0270 DS    0H                                                  0467 01145000
*   RESPECIFY                                                      0467 01146000
*     R5 RESTRICTED;                /* RESTRICT RETURN SAVE REGISTER */ 01147000
*   R5=R14;                         /* SAVE REG 14                   */ 01148000
         LR    R5,R14                                              0468 01149000
*   RESPECIFY                                                      0469 01150000
*    (R0,                                                          0469 01151000
*     R1) RESTRICTED;               /* DONT LET THESE REGISTERS GET     01152000
*                                      ALTRED                        */ 01153000
*   R0=RPLPTR->OUTCT+10;            /* GET LENGTH OF GETMAINED AREA  */ 01154000
         LA    R0,10                                               0470 01155000
         SLR   @11,@11                                             0470 01156000
         IC    @11,OUTCT(,RPLPTR)                                  0470 01157000
         ALR   R0,@11                                              0470 01158000
*   R1=RPLPTR;                      /* PTR TO AREA TO BE FREED       */ 01159000
         LR    R1,RPLPTR                                           0471 01160000
*/*VFRMAIN  SIZE((0))STORAGE((1))SUBPOOL(0)                          */ 01161000
*                                                                  0472 01162000
*   DO;                                                            0472 01163000
*     DO;                           /* CMZMREG (0,15) RESTRICT       */ 01164000
*       RFY                                                        0474 01165000
*        (GPR00P,                                                  0474 01166000
*         GPR15P) RSTD;                                            0474 01167000
*     END;                          /* CMZMREG PUT SUBPOOL PARM IN 0475 01168000
*                                      HIGH- ORDER BYTE OF REG 15    */ 01169000
*     GPR15F=0;                                                    0476 01170000
         SLR   GPR15F,GPR15F                                       0476 01171000
*     SLL(GPR15P,24);               /* COMBINE SUBPOOL AND SIZE IN 0477 01172000
*                                      REGISTER 0                    */ 01173000
         SLL   GPR15P,24                                           0477 01174000
*     GPR00P=GPR00P|GPR15P;                                        0478 01175000
         OR    GPR00P,GPR15P                                       0478 01176000
*     DO;                           /* CMZMREG (0,15) RELEASE        */ 01177000
*       RFY                                                        0480 01178000
*        (GPR00P,                                                  0480 01179000
*         GPR15P) UNRSTD;                                          0480 01180000
*     END;                          /* CMZMREG DECLARE AND RESTRICT     01181000
*                                      REG 1                         */ 01182000
*     DO;                           /* CMZMREG (1) RESTRICT          */ 01183000
*       RFY                                                        0483 01184000
*        (GPR01P) RSTD;                                            0483 01185000
*     END;                          /* CMZMREG INVOKE XREGSET MACRO     01186000
*                                      TO CHECK STORAGE PARM AND PUT    01187000
*                                      ADDR IN REGISTER 1            */ 01188000
*/*XREGSET  PID('STORAGE')PPARM((1))RREG(1,GPR01P)                   */ 01189000
*                                                                  0485 01190000
*     DO;                                                          0485 01191000
*                                                                  0485 01192000
*/*PARM ALREADY IN PROPER REGISTER                                   */ 01193000
*                                                                  0486 01194000
*     END;                          /* XREGSET INVOKE FREEMAIN MACRO */ 01195000
*     GEN;                                                         0487 01196000
         FREEMAIN R,LV=(0),A=(1)                                        01197000
*                                   /* UNRESTRICT REG 1              */ 01198000
*     DO;                           /* CMZMREG (1) RELEASE           */ 01199000
*       RFY                                                        0489 01200000
*        (GPR01P) UNRSTD;                                          0489 01201000
*     END;                          /* CMZMREG                       */ 01202000
*   END;                            /* VFRMAIN                       */ 01203000
*   RESPECIFY                                                      0492 01204000
*    (R0,                                                          0492 01205000
*     R1) UNRESTRICTED;             /* RELEASE THESE REGISTERS FOR 0492 01206000
*                                      USE                           */ 01207000
*   R14=R5;                         /* RESTORE REG 14                */ 01208000
         LR    R14,R5                                              0493 01209000
*   END C16C0270;                   /* END OF ROUTINE TO FREE ELEMENT   01210000
*                                      FROM QUEUE                    */ 01211000
@EL00004 DS    0H                                                  0494 01212000
@EF00004 DS    0H                                                  0494 01213000
@ER00004 BR    @14                                                 0494 01214000
*C16C0280:                                                         0495 01215000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0495 01216000
C16C0280 DS    0H                                                  0496 01217000
*   R5=R14;                         /* SAVE THE RETURN ADDRESS     0496 01218000
*                                                            @D32JPGH*/ 01219000
         LR    R5,R14                                              0496 01220000
*   RESPECIFY                                                      0497 01221000
*     LASTCHN BASED(PTR1);                                         0497 01222000
*   PTR1=ADDR($MSGOTSD(INDX));      /* PTR TO 1ST ELEMENT    @D32JPGH*/ 01223000
         LR    @11,INDX                                            0498 01224000
         MH    @11,@CH00337                                        0498 01225000
         LA    PTR1,$MSGOTSD-68(@11,WAPTR)                         0498 01226000
*   DO WHILE((PTR1->CHAIN&GATEBIT0)^=0);/* LOOP TILL LAST ELEMENT    */ 01227000
         B     @DE00499                                            0499 01228000
@DL00499 DS    0H                                                  0500 01229000
*     PTR1=PTR1->CHAIN;             /* ADDR OF NEXT ELEMENT  @D32JPGH*/ 01230000
         L     PTR1,CHAIN(,PTR1)                                   0500 01231000
*   END;                            /* END OF LOOP           @D32JPGH*/ 01232000
@DE00499 SLR   @11,@11                                             0501 01233000
         L     @00,CHAIN(,PTR1)                                    0501 01234000
         N     @00,@CF00640                                        0501 01235000
         CR    @00,@11                                             0501 01236000
         BNE   @DL00499                                            0501 01237000
*   PTR1->CHAIN=$CURELEM(INDX);     /* PUT PTR INTO LAST ELEMENT     */ 01238000
         LR    @10,INDX                                            0502 01239000
         MH    @10,@CH00337                                        0502 01240000
         L     @00,$CURELEM-68(@10,WAPTR)                          0502 01241000
         ST    @00,CHAIN(,PTR1)                                    0502 01242000
*   $CURELEM(INDX)=0;               /* SHOW NO CURRENT INDX          */ 01243000
         ST    @11,$CURELEM-68(@10,WAPTR)                          0503 01244000
*   R14=R5;                         /* RETURN TO THE CALLER  @D32JPGH*/ 01245000
         LR    R14,R5                                              0504 01246000
*   END C16C0280;                   /* END OF SUBROUTINE TO ADD    0505 01247000
*                                      ELEMENT TO QUE        @D32JPGH*/ 01248000
@EL00005 DS    0H                                                  0505 01249000
@EF00005 DS    0H                                                  0505 01250000
@ER00005 BR    @14                                                 0505 01251000
*C16C0900:                                                         0506 01252000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* MOVE DATA TO CALLER           */ 01253000
C16C0900 DS    0H                                                  0507 01254000
*   R5=R14;                         /* SAVE RETURN POINT             */ 01255000
         LR    R5,R14                                              0507 01256000
*   IF INADR^=0 THEN                /* BUFFER AVAILABLE              */ 01257000
         SLR   @11,@11                                             0508 01258000
         LR    @10,INDX                                            0508 01259000
         MH    @10,@CH00337                                        0508 01260000
         ST    @10,@TF00001                                        0508 01261000
         L     @10,$CURELEM-68(@10,WAPTR)                          0508 01262000
         C     @11,INADR(,@10)                                     0508 01263000
         BE    @RF00508                                            0508 01264000
*     DO;                           /* YES, PASSBACK DATA            */ 01265000
*       M=0;                                                       0510 01266000
         STH   @11,M                                               0510 01267000
*       I=1;                        /* INITIAL COUNTERS              */ 01268000
         MVC   I(2),@CH00072                                       0511 01269000
*       IF $DEVFRRS(INDX)='19'X|$DEVFRRS(INDX)='1C'X THEN/* 3270     */ 01270000
         LR    @11,WAPTR                                           0512 01271000
         AL    @11,@TF00001                                        0512 01272000
         CLI   $DEVFRRS-68(@11),X'19'                              0512 01273000
         BE    @RT00512                                            0512 01274000
         LR    @11,WAPTR                                           0512 01275000
         AL    @11,@TF00001                                        0512 01276000
         CLI   $DEVFRRS-68(@11),X'1C'                              0512 01277000
         BNE   @RF00512                                            0512 01278000
@RT00512 DS    0H                                                  0513 01279000
*         I=7;                      /* YES, SKIP CURSOR ADDR         */ 01280000
         MVC   I(2),@CH00215                                       0513 01281000
*       DO I=I TO LENGTH($TRMINPT); /* MOVE DATA BACK TO CALLER      */ 01282000
@RF00512 LH    @00,I                                               0514 01283000
         B     @DE00514                                            0514 01284000
@DL00514 DS    0H                                                  0515 01285000
*         IF $TRMINPT(I)>=' ' THEN  /* DATA                          */ 01286000
         LR    @11,@00                                             0515 01287000
         ALR   @11,WAPTR                                           0515 01288000
         CLI   $TRMINPT-1(@11),C' '                                0515 01289000
         BL    @RF00515                                            0515 01290000
*           DO;                     /* YES, PASS IT BACK             */ 01291000
*             M=M+1;                /* INCREASE BYTES PASSED         */ 01292000
         LA    @11,1                                               0517 01293000
         AH    @11,M                                               0517 01294000
         STH   @11,M                                               0517 01295000
*             CARRAY(M)=$TRMINPT(I)|' ';/* MOVE DATA, PUT IN UPPER 0518 01296000
*                                      CASE                          */ 01297000
         LR    @10,INDX                                            0518 01298000
         MH    @10,@CH00337                                        0518 01299000
         L     @10,$CURELEM-68(@10,WAPTR)                          0518 01300000
         ST    @10,@TF00001                                        0518 01301000
         L     @10,INADR(,@10)                                     0518 01302000
         ALR   @10,@11                                             0518 01303000
         BCTR  @10,0                                               0518 01304000
         LR    @11,@00                                             0518 01305000
         ALR   @11,WAPTR                                           0518 01306000
         MVC   CARRAY(1,@10),$TRMINPT-1(@11)                       0518 01307000
         OI    CARRAY(@10),C' '                                    0518 01308000
*             IF M=INCT THEN        /* MORE ROOM IN THE BUFFER       */ 01309000
         LH    @11,M                                               0519 01310000
         L     @10,@TF00001                                        0519 01311000
         SLR   @00,@00                                             0519 01312000
         IC    @00,INCT(,@10)                                      0519 01313000
         CR    @11,@00                                             0519 01314000
         BE    @RT00519                                            0519 01315000
*               GO TO C16C0905;     /* NO, LEAVE                     */ 01316000
*           END;                    /* END, OF PASS BACK DATA        */ 01317000
*         ELSE                      /* NOT DATA, CONTROL INFO        */ 01318000
*           IF $TRMINPT(I)='11'X THEN/* 3270, IS IT A SBA CHARACTER  */ 01319000
         B     @RC00515                                            0522 01320000
@RF00515 LH    @11,I                                               0522 01321000
         ALR   @11,WAPTR                                           0522 01322000
         CLI   $TRMINPT-1(@11),X'11'                               0522 01323000
         BNE   @RF00522                                            0522 01324000
*             I=I+2;                /* YES, SKIP ADDR CHARACTERS     */ 01325000
         LH    @11,I                                               0523 01326000
         LA    @11,2(,@11)                                         0523 01327000
         STH   @11,I                                               0523 01328000
*       END;                        /* END OF MOVING BACK DATA       */ 01329000
@RF00522 DS    0H                                                  0524 01330000
@RC00515 LA    @00,1                                               0524 01331000
         AH    @00,I                                               0524 01332000
         STH   @00,I                                               0524 01333000
@DE00514 C     @00,@CF00048                                        0524 01334000
         BNH   @DL00514                                            0524 01335000
*C16C0905:                                                         0525 01336000
*       MSGCOUNT=M;                 /* RETURN COUNT                  */ 01337000
C16C0905 LR    @11,INDX                                            0525 01338000
         MH    @11,@CH00337                                        0525 01339000
         L     @11,$CURELEM-68(@11,WAPTR)                          0525 01340000
         L     @11,INADR(,@11)                                     0525 01341000
         LH    @00,M                                               0525 01342000
         BCTR  @11,0                                               0525 01343000
         STC   @00,MSGCOUNT(,@11)                                  0525 01344000
*       IF $ALTPRTR=ON THEN         /* IF AP PRESENT                 */ 01345000
         TM    $ALTPRTR(WAPTR),B'00000010'                         0526 01346000
         BNO   @RF00526                                            0526 01347000
*         $TWOWAY=ON;               /* PUT REPLY THERE               */ 01348000
         OI    $TWOWAY(WAPTR),B'01000000'                          0527 01349000
*       $POSTFLG=OFF;               /* RESET WAITING FLAG            */ 01350000
@RF00526 NI    $POSTFLG(WAPTR),B'10111111'                         0528 01351000
*       R1=ADDR($TLTECB2);          /* POINT TO THE ECB TO POST      */ 01352000
         L     R1,RCAPTR(,WAPTR)                                   0529 01353000
         LA    R1,$TLTECB2(,R1)                                    0529 01354000
*       CALL I00C1001;              /* POST THE ECB                  */ 01355000
         L     @15,@CV01956                                        0530 01356000
         BALR  @14,@15                                             0530 01357000
*     END;                          /* END USE OF BUFFER TRMINPT     */ 01358000
*   $TRMINPT=$TRMINPT&&$TRMINPT;                                   0532 01359000
@RF00508 XC    $TRMINPT(80,WAPTR),$TRMINPT(WAPTR)                  0532 01360000
*   $DVINCT(1)=LENGTH($TRMINPT);                                   0533 01361000
         MVI   $DVINCT(WAPTR),X'50'                                0533 01362000
*   R14=R5;                         /* RESTORE RETURN POINTER        */ 01363000
         LR    R14,R5                                              0534 01364000
*   END C16C0900;                                                  0535 01365000
@EL00006 DS    0H                                                  0535 01366000
@EF00006 DS    0H                                                  0535 01367000
@ER00006 BR    @14                                                 0535 01368000
*C16C0910:                                                         0536 01369000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0536 01370000
C16C0910 DS    0H                                                  0537 01371000
*   R7=R14;                         /* SAVE RETURN POINT             */ 01372000
         LR    R7,R14                                              0537 01373000
*   RPLPTR=$CURELEM(INDX);          /* POINT TO ELEMENT BEING      0538 01374000
*                                      PROCESSED                     */ 01375000
         LR    @11,INDX                                            0538 01376000
         MH    @11,@CH00337                                        0538 01377000
         L     RPLPTR,$CURELEM-68(@11,WAPTR)                       0538 01378000
*   $CURELEM(INDX)=0;               /* ZERO OUT CURRENT ELEMENT    0539 01379000
*                                      POINTER                       */ 01380000
         SLR   @10,@10                                             0539 01381000
         ST    @10,$CURELEM-68(@11,WAPTR)                          0539 01382000
*   IF RPLPTR^=0 THEN               /* ONLY CALL IF THERE IS AN    0540 01383000
*                                      ELEMENT TO FREE               */ 01384000
         CR    RPLPTR,@10                                          0540 01385000
         BE    @RF00540                                            0540 01386000
*     CALL C16C0270;                /* FREE THE ELEMENT              */ 01387000
         BAL   @14,C16C0270                                        0541 01388000
*   R14=R7;                         /* RESTORE THE RETURN POINT      */ 01389000
@RF00540 LR    R14,R7                                              0542 01390000
*   END C16C0910;                   /* END OF ROUTINE TO FREE CURRENT   01391000
*                                      ELEMENT                       */ 01392000
@EL00007 DS    0H                                                  0543 01393000
@EF00007 DS    0H                                                  0543 01394000
@ER00007 BR    @14                                                 0543 01395000
*C16C0920:                                                         0544 01396000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0544 01397000
C16C0920 DS    0H                                                  0545 01398000
*   R6=R14;                         /* SAVE THE RETURN POINT         */ 01399000
         LR    R6,R14                                              0545 01400000
*   IF $ALTPRTR=ON&                 /* IF THERE IS AN AP             */ 01401000
*       INDX=AP                     /* AND THIS IS A TEST TERMINAL   */ 01402000
*     THEN                                                         0546 01403000
         TM    $ALTPRTR(WAPTR),B'00000010'                         0546 01404000
         BNO   @RF00546                                            0546 01405000
         C     INDX,@CF00139                                       0546 01406000
         BNE   @RF00546                                            0546 01407000
*     $ALTPRTR=OFF;                 /* DITCH THE AP                  */ 01408000
         NI    $ALTPRTR(WAPTR),B'11111101'                         0547 01409000
*   ELSE                            /* THE ERROR WAS ON THE CT       */ 01410000
*     DO;                                                          0548 01411000
         B     @RC00546                                            0548 01412000
@RF00546 DS    0H                                                  0549 01413000
*       IF $RPLERR=0 THEN                                          0549 01414000
         L     @00,$RPLERR-1(,WAPTR)                               0549 01415000
         ICM   @00,8,@CB01474                                      0549 01416000
         LTR   @00,@00                                             0549 01417000
         BNZ   @RF00549                                            0549 01418000
*         $RPLERR=RPLFDBK;          /* SET FIRST ERROR FEEDBACK      */ 01419000
         MVC   $RPLERR(3,WAPTR),RPLFDBK(RPLPTR)                    0550 01420000
*       $CANCEL=ON;                 /* CANCEL THIS LOGON             */ 01421000
@RF00549 OI    $CANCEL(WAPTR),B'00000010'                          0551 01422000
*       $CTERROR=ON;                /* CANCEL BECAUSE OF CT ERR      */ 01423000
         OI    $CTERROR(WAPTR),B'01000000'                         0552 01424000
*       $POSTFLG=OFF;               /* STOP WAITING FOR DATA         */ 01425000
         NI    $POSTFLG(WAPTR),B'10111111'                         0553 01426000
*     END;                                                         0554 01427000
*   CALL C16C0910;                  /* FREE THE CURRENT ELEMENT      */ 01428000
@RC00546 BAL   @14,C16C0910                                        0555 01429000
*   R14=R6;                         /* RESTORE THE RETURN POINT      */ 01430000
         LR    R14,R6                                              0556 01431000
*   END C16C0920;                   /* END OF SETTING ERROR STATUS   */ 01432000
@EL00008 DS    0H                                                  0557 01433000
@EF00008 DS    0H                                                  0557 01434000
@ER00008 BR    @14                                                 0557 01435000
@PB00008 DS    0H                                                  0558 01436000
*   DO;                             /* TPEPILOG                      */ 01437000
*     GEN(PRINT OFF);                                              0559 01438000
         PRINT OFF                                                      01439000
*     DO;                                                          0560 01440000
*       DCL                                                        0561 01441000
*         GPR00F FIXED(31) REG(00),                                0561 01442000
*         GPR00P PTR(31) REG(00),                                  0561 01443000
*         GPR01F FIXED(31) REG(01),                                0561 01444000
*         GPR01P PTR(31) REG(01),                                  0561 01445000
*         GPR02F FIXED(31) REG(02),                                0561 01446000
*         GPR02P PTR(31) REG(02),                                  0561 01447000
*         GPR03F FIXED(31) REG(03),                                0561 01448000
*         GPR03P PTR(31) REG(03),                                  0561 01449000
*         GPR04F FIXED(31) REG(04),                                0561 01450000
*         GPR04P PTR(31) REG(04),                                  0561 01451000
*         GPR05F FIXED(31) REG(05),                                0561 01452000
*         GPR05P PTR(31) REG(05),                                  0561 01453000
*         GPR06F FIXED(31) REG(06),                                0561 01454000
*         GPR06P PTR(31) REG(06),                                  0561 01455000
*         GPR07F FIXED(31) REG(07),                                0561 01456000
*         GPR07P PTR(31) REG(07),                                  0561 01457000
*         GPR08F FIXED(31) REG(08),                                0561 01458000
*         GPR08P PTR(31) REG(08),                                  0561 01459000
*         GPR09F FIXED(31) REG(09),                                0561 01460000
*         GPR09P PTR(31) REG(09),                                  0561 01461000
*         GPR10F FIXED(31) REG(10),                                0561 01462000
*         GPR10P PTR(31) REG(10),                                  0561 01463000
*         GPR11F FIXED(31) REG(11),                                0561 01464000
*         GPR11P PTR(31) REG(11),                                  0561 01465000
*         GPR12F FIXED(31) REG(12),                                0561 01466000
*         GPR12P PTR(31) REG(12),                                  0561 01467000
*         GPR13F FIXED(31) REG(13),                                0561 01468000
*         GPR13P PTR(31) REG(13),                                  0561 01469000
*         GPR14F FIXED(31) REG(14),                                0561 01470000
*         GPR14P PTR(31) REG(14),                                  0561 01471000
*         GPR15F FIXED(31) REG(15),                                0561 01472000
*         GPR15P PTR(31) REG(15);                                  0561 01473000
*     END;                                                         0562 01474000
*     GEN(PRINT ON);                                               0563 01475000
         PRINT ON                                                       01476000
*   END;                            /* TPEPILOG                      */ 01477000
*   DO;                             /* ATDSPLY                       */ 01478000
*   END;                            /* ATDSPLY                       */ 01479000
*   END ISTCC016                                                   0567 01480000
*                                                                  0567 01481000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01482000
*/*%INCLUDE SYSLIB  (IFGRPL  )                                       */ 01483000
*/*%INCLUDE SYSLIB  (IFGRPLVS)                                       */ 01484000
*/*%INCLUDE SYSLIB  (ISTRPLEX)                                       */ 01485000
*/*%INCLUDE SYSLIB  (ISTRPLFB)                                       */ 01486000
*                                                                  0567 01487000
*       ;                                                          0567 01488000
         B     @EL00001                                            0567 01489000
@DATA    DS    0H                                                       01490000
@CH00215 DC    H'7'                                                     01491000
@CH00337 DC    H'68'                                                    01492000
@DATD    DSECT                                                          01493000
         DS    0F                                                       01494000
@TF00001 DS    F                                                        01495000
ISTCC016 CSECT                                                          01496000
         DS    0F                                                       01497000
@CF00072 DC    F'1'                                                     01498000
@CH00072 EQU   @CF00072+2                                               01499000
@CF00139 DC    F'2'                                                     01500000
@CF00068 DC    F'4'                                                     01501000
@CF00054 DC    F'8'                                                     01502000
@CF00048 DC    F'80'                                                    01503000
@CF00083 DC    F'256'                                                   01504000
@CF00640 DC    XL4'7FFFFFFF'                                            01505000
@CF00642 DC    XL4'80000000'                                            01506000
@CF02026 DC    XL4'0000FFFF'                                            01507000
@DATD    DSECT                                                          01508000
         DS    0D                                                       01509000
RPLSAVE  DS    A                                                        01510000
I        DS    H                                                        01511000
M        DS    H                                                        01512000
N        DS    H                                                        01513000
SCRATCH  DS    CL1                                                      01514000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01515000
@ENDDATD EQU   *                                                        01516000
ISTCC016 CSECT                                                          01517000
         DS    0F                                                       01518000
@SIZDATD DC    AL1(0)                                                   01519000
         DC    AL3(@ENDDATD-@DATD)                                      01520000
@CV01956 DC    V(I00C1001)                                              01521000
         DS    0D                                                       01522000
C16EXSAV DC    F'0'                                                     01523000
BASE     DC    AL4(ISTCC016)                                            01524000
@CB01927 DC    X'0201'                                                  01525000
@CB01931 DC    X'1001'                                                  01526000
@CB01933 DC    X'0819'                                                  01527000
@CB01934 DC    X'1007'                                                  01528000
@CB01935 DC    X'1008'                                                  01529000
@CB01474 DC    X'00'                                                    01530000
         DS    CL1                                                      01531000
C16CBUF1 DC    CL52' '                                                  01532000
C16CBUF2 DC    CL52' '                                                  01533000
SAVEA    DC    18F'0'                                                   01534000
PATCH    DC    25F'0'                                                   01535000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01536000
@01      EQU   01                                                       01537000
@02      EQU   02                                                       01538000
@03      EQU   03                                                       01539000
@04      EQU   04                                                       01540000
@05      EQU   05                                                       01541000
@06      EQU   06                                                       01542000
@07      EQU   07                                                       01543000
@08      EQU   08                                                       01544000
@09      EQU   09                                                       01545000
@10      EQU   10                                                       01546000
@11      EQU   11                                                       01547000
@12      EQU   12                                                       01548000
@13      EQU   13                                                       01549000
@14      EQU   14                                                       01550000
@15      EQU   15                                                       01551000
WAPTR    EQU   @02                                                      01552000
RPLPTR   EQU   @04                                                      01553000
RPHPTR   EQU   @01                                                      01554000
R1       EQU   @01                                                      01555000
R14      EQU   @14                                                      01556000
R15      EQU   @15                                                      01557000
R0       EQU   @00                                                      01558000
R13      EQU   @13                                                      01559000
R5       EQU   @05                                                      01560000
R8       EQU   @08                                                      01561000
R6       EQU   @06                                                      01562000
R7       EQU   @07                                                      01563000
R9       EQU   @09                                                      01564000
R12      EQU   @12                                                      01565000
PTR2     EQU   @15                                                      01566000
PTR1     EQU   @01                                                      01567000
INDX     EQU   @03                                                      01568000
ARG      EQU   @05                                                      01569000
GPR00P   EQU   @00                                                      01570000
GPR15P   EQU   @15                                                      01571000
GPR15F   EQU   @15                                                      01572000
GPR01P   EQU   @01                                                      01573000
GPR00F   EQU   @00                                                      01574000
GPR01F   EQU   @01                                                      01575000
GPR02F   EQU   @02                                                      01576000
GPR02P   EQU   @02                                                      01577000
GPR03F   EQU   @03                                                      01578000
GPR03P   EQU   @03                                                      01579000
GPR04F   EQU   @04                                                      01580000
GPR04P   EQU   @04                                                      01581000
GPR05F   EQU   @05                                                      01582000
GPR05P   EQU   @05                                                      01583000
GPR06F   EQU   @06                                                      01584000
GPR06P   EQU   @06                                                      01585000
GPR07F   EQU   @07                                                      01586000
GPR07P   EQU   @07                                                      01587000
GPR08F   EQU   @08                                                      01588000
GPR08P   EQU   @08                                                      01589000
GPR09F   EQU   @09                                                      01590000
GPR09P   EQU   @09                                                      01591000
GPR10F   EQU   @10                                                      01592000
GPR10P   EQU   @10                                                      01593000
GPR11F   EQU   @11                                                      01594000
GPR11P   EQU   @11                                                      01595000
GPR12F   EQU   @12                                                      01596000
GPR12P   EQU   @12                                                      01597000
GPR13F   EQU   @13                                                      01598000
GPR13P   EQU   @13                                                      01599000
GPR14F   EQU   @14                                                      01600000
GPR14P   EQU   @14                                                      01601000
         ENTRY C16C1000                                                 01602000
ATCLCPTR EQU   1032                                                     01603000
$RCAAREA EQU   0                                                        01604000
$POINTER EQU   $RCAAREA+100                                             01605000
$TLTECB2 EQU   $POINTER+28                                              01606000
$TRTBLA  EQU   $POINTER+124                                             01607000
$CONSTNT EQU   $RCAAREA+244                                             01608000
$RCAFLG  EQU   $RCAAREA+604                                             01609000
$TRASCII EQU   $RCAAREA+608                                             01610000
$EXITSAV EQU   $RCAAREA+864                                             01611000
TOLTEPWA EQU   0                                                        01612000
$SCTTBLE EQU   TOLTEPWA                                                 01613000
$TESTOPT EQU   $SCTTBLE+2                                               01614000
$ERROPT  EQU   $SCTTBLE+3                                               01615000
$PDEVFLG EQU   $SCTTBLE+10                                              01616000
$CDSFLGS EQU   $SCTTBLE+11                                              01617000
$CDS8T19 EQU   $SCTTBLE+20                                              01618000
$EXECFLG EQU   $SCTTBLE+33                                              01619000
$OLTFLGS EQU   $SCTTBLE+36                                              01620000
$OLTFLG2 EQU   $SCTTBLE+37                                              01621000
$TOTFLG1 EQU   $SCTTBLE+38                                              01622000
$CTEQTT  EQU   $TOTFLG1                                                 01623000
$ROUTMSK EQU   $SCTTBLE+40                                              01624000
$CDA     EQU   TOLTEPWA+100                                             01625000
$RCA     EQU   $CDA+44                                                  01626000
$OLTPTR  EQU   $CDA+52                                                  01627000
$HIMOREC EQU   $CDA+60                                                  01628000
$COMMFLG EQU   TOLTEPWA+224                                             01629000
$FLAG3   EQU   $COMMFLG+2                                               01630000
$ALTPRTR EQU   $FLAG3                                                   01631000
$FLAG4   EQU   $COMMFLG+3                                               01632000
$FLAG5   EQU   $COMMFLG+4                                               01633000
$EOJ     EQU   $FLAG5                                                   01634000
$CANCEL  EQU   $EOJ                                                     01635000
$FLAG6   EQU   $COMMFLG+5                                               01636000
$CTERROR EQU   $FLAG6                                                   01637000
$ABNDBIT EQU   $FLAG6                                                   01638000
$CIREQ   EQU   $FLAG6                                                   01639000
$FLAG7   EQU   $COMMFLG+6                                               01640000
$EXIOWAT EQU   $FLAG7                                                   01641000
$SNDRFLG EQU   $FLAG7                                                   01642000
$FLAG8   EQU   $COMMFLG+7                                               01643000
$TWOWAY  EQU   $FLAG8                                                   01644000
$FLAG12  EQU   $COMMFLG+11                                              01645000
$POSTFLG EQU   $FLAG12                                                  01646000
$DEVTBLE EQU   TOLTEPWA+240                                             01647000
$DEVCDS  EQU   $DEVTBLE                                                 01648000
$DEVUNAD EQU   $DEVCDS                                                  01649000
@NM00043 EQU   $DEVUNAD+2                                               01650000
$DEVFEAT EQU   $DEVCDS+4                                                01651000
$DEVFRRS EQU   $DEVFEAT+1                                               01652000
$DEVCDSF EQU   $DEVCDS+9                                                01653000
$DEVSDCF EQU   $DEVCDS+10                                               01654000
$$SYMNME EQU   $DEVCDS+12                                               01655000
$MSGOTSD EQU   $$SYMNME                                                 01656000
$CURELEM EQU   $$SYMNME+4                                               01657000
$DEVFLG1 EQU   $DEVTBLE+20                                              01658000
$EVNCPLT EQU   $DEVFLG1                                                 01659000
$ATTNEXP EQU   $DEVFLG1                                                 01660000
$INTOCC  EQU   $DEVFLG1                                                 01661000
$DVCTBYT EQU   $INTOCC                                                  01662000
$DEVFLG2 EQU   $DEVTBLE+21                                              01663000
$DEVTECB EQU   $DEVTBLE+22                                              01664000
$OPIS    EQU   $DEVTECB                                                 01665000
$DVSEQNO EQU   $OPIS                                                    01666000
$OPND    EQU   $DEVTECB+2                                               01667000
$DVBRKSN EQU   $OPND                                                    01668000
$DVBRKST EQU   $OPND+1                                                  01669000
$DVINCT  EQU   $DEVTBLE+26                                              01670000
$DEVFLG3 EQU   $DEVTBLE+27                                              01671000
$SIOFLG  EQU   $DEVFLG3                                                 01672000
$DVSNDOK EQU   $SIOFLG                                                  01673000
$IFTOUT  EQU   $DEVTBLE+36                                              01674000
$DEVSESP EQU   $IFTOUT                                                  01675000
$SSCPDAF EQU   $IFTOUT+6                                                01676000
$LDNCBPT EQU   $DEVTBLE+48                                              01677000
$CID     EQU   $DEVTBLE+52                                              01678000
$RNINFO  EQU   $DEVTBLE+56                                              01679000
$DEVFLG5 EQU   $RNINFO+8                                                01680000
$DEVLU   EQU   $DEVFLG5                                                 01681000
$ASCII   EQU   $DEVFLG5                                                 01682000
$DEVFLG4 EQU   $DEVTBLE+65                                              01683000
$TLTRPL1 EQU   TOLTEPWA+1616                                            01684000
$TLTRPL2 EQU   TOLTEPWA+1736                                            01685000
$TRMINPT EQU   TOLTEPWA+2184                                            01686000
#EXITA   EQU   TOLTEPWA+2632                                            01687000
$RETREG  EQU   TOLTEPWA+2636                                            01688000
$CCOMDAT EQU   TOLTEPWA+2644                                            01689000
$CFLGS   EQU   $CCOMDAT+16                                              01690000
$24FEMSG EQU   TOLTEPWA+2681                                            01691000
$24CATMG EQU   $24FEMSG+11                                              01692000
@NM00051 EQU   TOLTEPWA+2776                                            01693000
$OUNTPTR EQU   @NM00051+4                                               01694000
$NSPTR   EQU   $OUNTPTR                                                 01695000
$NSCNT   EQU   @NM00051+10                                              01696000
$ENXX    EQU   @NM00051+15                                              01697000
$IMITX   EQU   $ENXX                                                    01698000
$RPLERR  EQU   TOLTEPWA+2977                                            01699000
SVESC033 EQU   TOLTEPWA+3160                                            01700000
SVECC013 EQU   TOLTEPWA+3232                                            01701000
SVEIC003 EQU   TOLTEPWA+3592                                            01702000
SVESC022 EQU   TOLTEPWA+3736                                            01703000
SVECC011 EQU   TOLTEPWA+4024                                            01704000
IFGRPL   EQU   0                                                        01705000
RPLCOMN  EQU   IFGRPL                                                   01706000
RPLIDWD  EQU   RPLCOMN                                                  01707000
RPLREQ   EQU   RPLIDWD+2                                                01708000
RPLLEN   EQU   RPLIDWD+3                                                01709000
RPLECB   EQU   RPLCOMN+8                                                01710000
RPLFDBWD EQU   RPLCOMN+12                                               01711000
RPLFDBK  EQU   RPLFDBWD+1                                               01712000
RPLRTNCD EQU   RPLFDBK                                                  01713000
RPLCNDCD EQU   RPLFDBK+1                                                01714000
RPLCMPON EQU   RPLCNDCD                                                 01715000
RPLFDB2  EQU   RPLCMPON                                                 01716000
RPLERRCD EQU   RPLCNDCD+1                                               01717000
RPLFDB3  EQU   RPLERRCD                                                 01718000
RPLREOT  EQU   RPLFDB3                                                  01719000
RPLKEYLE EQU   RPLCOMN+16                                               01720000
RPLAREA  EQU   RPLCOMN+32                                               01721000
RPLARG   EQU   RPLCOMN+36                                               01722000
RPLOPTCD EQU   RPLCOMN+40                                               01723000
RPLOPT1  EQU   RPLOPTCD                                                 01724000
RPLECBSW EQU   RPLOPT1                                                  01725000
RPLOPT2  EQU   RPLOPTCD+1                                               01726000
RPLADR   EQU   RPLOPT2                                                  01727000
RPLOPT3  EQU   RPLOPTCD+2                                               01728000
RPLOPT4  EQU   RPLOPTCD+3                                               01729000
RPLNXTRP EQU   RPLCOMN+44                                               01730000
RPLRLEN  EQU   RPLCOMN+48                                               01731000
RPLBUFL  EQU   RPLCOMN+52                                               01732000
RPLOPTC2 EQU   RPLCOMN+56                                               01733000
RPLOPT5  EQU   RPLOPTC2                                                 01734000
RPLWRTYP EQU   RPLOPT5                                                  01735000
RPLOPT6  EQU   RPLOPTC2+1                                               01736000
RPLUNTYP EQU   RPLOPT6                                                  01737000
RPLOPT7  EQU   RPLOPTC2+2                                               01738000
RPLCNOPT EQU   RPLOPT7                                                  01739000
RPLOPT8  EQU   RPLOPTC2+3                                               01740000
RPLRBAR  EQU   RPLCOMN+60                                               01741000
RPLAIXID EQU   RPLRBAR+2                                                01742000
RPLEXTDS EQU   RPLCOMN+68                                               01743000
RPLEXTD1 EQU   RPLEXTDS                                                 01744000
RPLVTEXT EQU   IFGRPL+76                                                01745000
RPLAARLN EQU   RPLVTEXT+4                                               01746000
RPLFDBK2 EQU   RPLVTEXT+12                                              01747000
RPLSSNSI EQU   RPLFDBK2                                                 01748000
RPLDSB   EQU   RPLSSNSI                                                 01749000
RPLDSB1  EQU   RPLDSB                                                   01750000
RPLSSEI  EQU   RPLDSB1                                                  01751000
RPLDSB2  EQU   RPLDSB+1                                                 01752000
RPLSSMI  EQU   RPLDSB2                                                  01753000
RPLUSNSI EQU   RPLFDBK2+2                                               01754000
RPLUSFLD EQU   RPLVTEXT+16                                              01755000
RPLOPTC3 EQU   RPLVTEXT+20                                              01756000
RPLOPT9  EQU   RPLOPTC3                                                 01757000
RPLOPT10 EQU   RPLOPTC3+1                                               01758000
RPLOPT11 EQU   RPLOPTC3+2                                               01759000
RPLOPT12 EQU   RPLOPTC3+3                                               01760000
RPLFMHDR EQU   RPLOPT12                                                 01761000
RPLOSENS EQU   RPLVTEXT+24                                              01762000
RPLSSNSO EQU   RPLOSENS                                                 01763000
RPLSSEO  EQU   RPLSSNSO                                                 01764000
ISTAVT   EQU   0                                                        01765000
ISTRETRG EQU   ISTAVT+44                                                01766000
ISTLOK   EQU   0                                                        01767000
LOKCHN   EQU   ISTLOK+1                                                 01768000
LOKCHNG  EQU   LOKCHN                                                   01769000
@NM00055 EQU   LOKCHNG+2                                                01770000
ISTPAB   EQU   0                                                        01771000
PABWQCHN EQU   ISTPAB                                                   01772000
PABWEQA  EQU   PABWQCHN                                                 01773000
PABCHAIN EQU   PABWQCHN+4                                               01774000
PABRPHFG EQU   ISTPAB+12                                                01775000
PABFLAGS EQU   PABRPHFG                                                 01776000
PABEND   EQU   ISTPAB+16                                                01777000
ISTDYPAB EQU   0                                                        01778000
DYPCHAIN EQU   ISTDYPAB+4                                               01779000
DYPPACMD EQU   ISTDYPAB+12                                              01780000
ISTRPH   EQU   0                                                        01781000
RPHCNTL  EQU   ISTRPH                                                   01782000
RPHFLAGS EQU   RPHCNTL+2                                                01783000
RPHFLGB  EQU   RPHCNTL+3                                                01784000
RPHRPHA  EQU   ISTRPH+4                                                 01785000
RPHTSKID EQU   ISTRPH+8                                                 01786000
RPHRESMA EQU   ISTRPH+16                                                01787000
RPHWPFLG EQU   RPHRESMA                                                 01788000
RPHWEA   EQU   ISTRPH+24                                                01789000
RPHSRPRM EQU   ISTRPH+28                                                01790000
RPHWORK  EQU   ISTRPH+36                                                01791000
RPHSAVE1 EQU   RPHWORK                                                  01792000
RPHSBITS EQU   RPHSAVE1+1                                               01793000
ISTATCVT EQU   0                                                        01794000
ATCRPTCH EQU   ISTATCVT                                                 01795000
ATCITFLD EQU   ISTATCVT+8                                               01796000
ATCITPRM EQU   ATCITFLD                                                 01797000
ATCITCDS EQU   ATCITFLD+8                                               01798000
ATCITFLG EQU   ATCITCDS+4                                               01799000
ATCITRA1 EQU   ATCITFLG+2                                               01800000
ATCSMPAB EQU   ISTATCVT+88                                              01801000
ATCLDTIL EQU   ISTATCVT+408                                             01802000
ATCGTSTR EQU   ISTATCVT+644                                             01803000
ATCLUDVT EQU   ISTATCVT+800                                             01804000
ATCANYDT EQU   ISTATCVT+808                                             01805000
@NM00068 EQU   ISTATCVT+812                                             01806000
ATCPODVT EQU   ISTATCVT+832                                             01807000
ATCSSDVT EQU   ISTATCVT+940                                             01808000
ATCSODVT EQU   ISTATCVT+944                                             01809000
ATCMBDVT EQU   ISTATCVT+952                                             01810000
ATCSTAT  EQU   ISTATCVT+972                                             01811000
ATCSTAT1 EQU   ATCSTAT                                                  01812000
@NM00069 EQU   ATCSTAT+1                                                01813000
ATCPOFLG EQU   ATCSTAT+2                                                01814000
ATCSTAT4 EQU   ATCSTAT+3                                                01815000
ATCBITAN EQU   ISTATCVT+976                                             01816000
ATCFLAG2 EQU   ATCBITAN+1                                               01817000
ATCONID  EQU   ISTATCVT+980                                             01818000
ATCSSCPA EQU   ISTATCVT+984                                             01819000
ATCHPGM  EQU   ISTATCVT+1040                                            01820000
ATCRNO   EQU   ISTATCVT+1044                                            01821000
ATCCPDVT EQU   ISTATCVT+1092                                            01822000
ATCSMSDQ EQU   ISTATCVT+1128                                            01823000
ATCRID   EQU   ISTATCVT+1144                                            01824000
ATCTKFLD EQU   ISTATCVT+1156                                            01825000
ATCIOINT EQU   ISTATCVT+1176                                            01826000
ATCTOD   EQU   ISTATCVT+1220                                            01827000
ATCVRTIL EQU   ISTATCVT+1264                                            01828000
ATCLKSWP EQU   ISTATCVT+1440                                            01829000
ATCWUDYP EQU   ISTATCVT+1448                                            01830000
ATCSQAFR EQU   ISTATCVT+1560                                            01831000
ATCORTCB EQU   ATCSQAFR+4                                               01832000
ATCORSRB EQU   ATCORTCB                                                 01833000
ATCLDAPP EQU   ISTATCVT+1600                                            01834000
ATCDAPVT EQU   ISTATCVT+1620                                            01835000
ATCGSRBQ EQU   ISTATCVT+1672                                            01836000
ATCGSRBG EQU   ATCGSRBQ                                                 01837000
ATCENFLG EQU   ISTATCVT+1722                                            01838000
ATCCSCB  EQU   ISTATCVT+1724                                            01839000
ATCVTFLG EQU   ISTATCVT+1784                                            01840000
@NM00099 EQU   ISTATCVT+1816                                            01841000
ATCCRA   EQU   ISTATCVT+1840                                            01842000
ATCCRACN EQU   ATCCRA+4                                                 01843000
ATCCRPL  EQU   ISTATCVT+1848                                            01844000
ATCRPLCN EQU   ATCCRPL+4                                                01845000
ISTTIE   EQU   0                                                        01846000
TIETIEA  EQU   ISTTIE+4                                                 01847000
TIESNA   EQU   ISTTIE+8                                                 01848000
TIERPHA  EQU   ISTTIE+12                                                01849000
ISTBIND  EQU   0                                                        01850000
BINFMTY  EQU   ISTBIND                                                  01851000
BINPRIP  EQU   ISTBIND+3                                                01852000
BINSECP  EQU   ISTBIND+4                                                01853000
BINCMNP  EQU   ISTBIND+5                                                01854000
BINBRAK  EQU   BINCMNP                                                  01855000
BINBKTR  EQU   BINCMNP                                                  01856000
BINCMNP2 EQU   ISTBIND+6                                                01857000
BINFMTRM EQU   BINCMNP2                                                 01858000
BINTSU   EQU   ISTBIND+7                                                01859000
BINAPACE EQU   BINTSU                                                   01860000
BINRPACE EQU   BINTSU+1                                                 01861000
BINRUSZ  EQU   BINTSU+2                                                 01862000
BINSRUSZ EQU   BINRUSZ                                                  01863000
BINPRUSZ EQU   BINRUSZ+1                                                01864000
BINSPACE EQU   BINTSU+4                                                 01865000
BINBPACE EQU   BINTSU+5                                                 01866000
BINPRSVC EQU   ISTBIND+13                                               01867000
BINLUP   EQU   BINPRSVC                                                 01868000
BINPSCHR EQU   BINPRSVC+1                                               01869000
BINCRYPT EQU   ISTBIND+25                                               01870000
BINCRYRL EQU   0                                                        01871000
BINCRCTL EQU   BINCRYRL                                                 01872000
BINCRPFL EQU   BINCRYRL+1                                               01873000
BINPNAU  EQU   0                                                        01874000
BINAUNML EQU   BINPNAU                                                  01875000
BINAUNM  EQU   BINPNAU+1                                                01876000
BINUSEDT EQU   0                                                        01877000
BINUSDTL EQU   BINUSEDT                                                 01878000
BINUSDTA EQU   BINUSEDT+1                                               01879000
BINURC   EQU   0                                                        01880000
BINURCL  EQU   BINURC                                                   01881000
BINURCD  EQU   BINURC+1                                                 01882000
BINSLUNM EQU   0                                                        01883000
RPLOF16  EQU   0                                                        01884000
RPLRH3   EQU   RPLOF16                                                  01885000
RPLBB    EQU   RPLRH3                                                   01886000
RPLEB    EQU   RPLRH3                                                   01887000
RPLCMD   EQU   RPLRH3                                                   01888000
RPLCSI   EQU   RPLRH3                                                   01889000
RPLSRTYP EQU   RPLOF16+1                                                01890000
RPLSTYPE EQU   RPLSRTYP                                                 01891000
RPLRTYPE EQU   RPLSRTYP                                                 01892000
RPLRRESP EQU   RPLRTYPE                                                 01893000
RPLNFSYN EQU   RPLRTYPE                                                 01894000
RPLCHN   EQU   RPLOF16+2                                                01895000
RPLLAST  EQU   RPLCHN                                                   01896000
RPLONLY  EQU   RPLCHN                                                   01897000
RPLVTFL1 EQU   RPLOF16+3                                                01898000
RPLVTFL2 EQU   RPLOF16+4                                                01899000
RPLPOSTV EQU   RPLVTFL2                                                 01900000
RPLRESP  EQU   RPLVTFL2                                                 01901000
RPLEX    EQU   RPLRESP                                                  01902000
RPLNFME  EQU   RPLRESP                                                  01903000
RPLRRN   EQU   RPLRESP                                                  01904000
RPLCNTRL EQU   RPLOF16+5                                                01905000
RPLCNTDF EQU   RPLCNTRL                                                 01906000
RPLDATA  EQU   RPLCNTDF                                                 01907000
RPLCNCEL EQU   RPLCNTDF                                                 01908000
RPLCHASE EQU   RPLCNTDF                                                 01909000
RPLCNTDC EQU   RPLCNTRL+1                                               01910000
RPLRTR   EQU   RPLCNTDC                                                 01911000
RPLLUS   EQU   RPLCNTDC                                                 01912000
RPLSIGNL EQU   RPLCNTDC                                                 01913000
RPLCNTSC EQU   RPLCNTRL+2                                               01914000
RPLSHUTD EQU   RPLCNTSC                                                 01915000
RPLSHUTC EQU   RPLCNTSC                                                 01916000
RPLRSHUT EQU   RPLCNTSC                                                 01917000
RPLOF56  EQU   0                                                        01918000
RPLO5    EQU   RPLOF56                                                  01919000
RPLOF60  EQU   0                                                        01920000
RPLOBSQ  EQU   RPLOF60+4                                                01921000
RPLIBSQ  EQU   RPLOF60+5                                                01922000
RPLSEQNO EQU   RPLOF60+6                                                01923000
CARRAY   EQU   0                                                        01924000
MSGCOUNT EQU   0                                                        01925000
ELEMENT  EQU   0                                                        01926000
CHAIN    EQU   ELEMENT                                                  01927000
INADR    EQU   ELEMENT+4                                                01928000
OUTCT    EQU   ELEMENT+8                                                01929000
INCT     EQU   ELEMENT+9                                                01930000
MSG      EQU   ELEMENT+10                                               01931000
BACKSAVE EQU   0                                                        01932000
LASTCHN  EQU   0                                                        01933000
$TRTBL   EQU   0                                                        01934000
#EXIT    EQU   0                                                        01935000
ISTRPL   EQU   0                                                        01936000
ISTXDYP  EQU   0                                                        01937000
RCAPTR   EQU   $RCA                                                     01938000
PABXTNSN EQU   PABEND                                                   01939000
BINLUP1  EQU   BINPSCHR                                                 01940000
BINLUS   EQU   BINPSCHR                                                 01941000
BINFMF1  EQU   BINLUS                                                   01942000
@NM00112 EQU   BINFMF1                                                  01943000
BINDSPF1 EQU   BINLUS+2                                                 01944000
BINMEDIA EQU   BINLUS+4                                                 01945000
BINLUP2  EQU   BINPSCHR                                                 01946000
BINSCRSZ EQU   BINLUP2+5                                                01947000
BINLUP3  EQU   BINPSCHR                                                 01948000
BINBFRSZ EQU   BINLUP3+5                                                01949000
BINBDESC EQU   BINLUP3+9                                                01950000
BINLUP4  EQU   BINPSCHR                                                 01951000
BINPSNDO EQU   BINLUP4                                                  01952000
BINPDSPP EQU   BINPSNDO                                                 01953000
BINADSPP EQU   BINPSNDO+1                                               01954000
BINCSLP  EQU   BINPSNDO+2                                               01955000
BINFMHUP EQU   BINPSNDO+3                                               01956000
BINSSNDO EQU   BINLUP4+4                                                01957000
BINCSO   EQU   BINLUP4+8                                                01958000
BINCSOR  EQU   BINCSO                                                   01959000
BINGENCO EQU   BINLUP4+9                                                01960000
SVECC012 EQU   SVESC022                                                 01961000
SVEIC00A EQU   SVEIC003                                                 01962000
SVEIC004 EQU   SVEIC003                                                 01963000
SVEIC005 EQU   SVEIC003                                                 01964000
SVESC02A EQU   SVESC022                                                 01965000
SVESC02B EQU   SVESC022                                                 01966000
SVESC02D EQU   SVESC022                                                 01967000
SVESC02E EQU   SVESC022                                                 01968000
SVESC02F EQU   SVECC013                                                 01969000
SVESC024 EQU   SVESC022                                                 01970000
SVESC027 EQU   SVESC022                                                 01971000
SVESC029 EQU   SVESC033                                                 01972000
SVESC031 EQU   SVECC013                                                 01973000
SVESC032 EQU   SVECC011                                                 01974000
SVETC037 EQU   SVEIC003                                                 01975000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01976000
BINRSV35 EQU   BINLUP4+10                                               01977000
BINRVS34 EQU   BINGENCO                                                 01978000
BINAAO   EQU   BINGENCO                                                 01979000
BINIAO   EQU   BINGENCO                                                 01980000
BINRSV33 EQU   BINGENCO                                                 01981000
BINWSDF  EQU   BINGENCO                                                 01982000
BINRSV32 EQU   BINGENCO                                                 01983000
BINCSOC2 EQU   BINCSO                                                   01984000
BINCSOC1 EQU   BINCSO                                                   01985000
BINRSV31 EQU   BINCSOR                                                  01986000
BINRSV30 EQU   BINCSOR                                                  01987000
BINCSOAI EQU   BINCSOR                                                  01988000
BINCSOE  EQU   BINCSOR                                                  01989000
BINFMHUS EQU   BINSSNDO+3                                               01990000
BINCSLS  EQU   BINSSNDO+2                                               01991000
BINADSPS EQU   BINSSNDO+1                                               01992000
BINPDSPS EQU   BINSSNDO                                                 01993000
BINKIXS  EQU   BINFMHUP                                                 01994000
BINRSV52 EQU   BINFMHUP                                                 01995000
BINDSSTO EQU   BINFMHUP                                                 01996000
BINSSDAT EQU   BINFMHUP                                                 01997000
BINRSV51 EQU   BINCSLP                                                  01998000
BINCJOB  EQU   BINCSLP                                                  01999000
BINRSV50 EQU   BINCSLP                                                  02000000
BINCBDSP EQU   BINCSLP                                                  02001000
BINRSV29 EQU   BINADSPP                                                 02002000
BINADSCD EQU   BINADSPP                                                 02003000
BINRSV49 EQU   BINADSPP                                                 02004000
BINRSV48 EQU   BINPDSPP                                                 02005000
BINWPRAW EQU   BINPDSPP                                                 02006000
BINRSV47 EQU   BINPDSPP                                                 02007000
BINJOB   EQU   BINPDSPP                                                 02008000
BINRSV46 EQU   BINPDSPP                                                 02009000
BINPBDSP EQU   BINPDSPP                                                 02010000
@NM00123 EQU   BINLUP3+10                                               02011000
BINBFSIZ EQU   BINBDESC                                                 02012000
@NM00122 EQU   BINBDESC                                                 02013000
BINBDRAC EQU   BINBFRSZ+3                                               02014000
BINBFRAR EQU   BINBFRSZ+2                                               02015000
BINBFRDC EQU   BINBFRSZ+1                                               02016000
BINBFRDR EQU   BINBFRSZ                                                 02017000
@NM00121 EQU   BINLUP3                                                  02018000
@NM00120 EQU   BINLUP2+10                                               02019000
BINPRESZ EQU   BINSCRSZ+4                                               02020000
BINSALTC EQU   BINSCRSZ+3                                               02021000
BINSALTR EQU   BINSCRSZ+2                                               02022000
BINSPRIC EQU   BINSCRSZ+1                                               02023000
BINSPRIR EQU   BINSCRSZ                                                 02024000
@NM00119 EQU   BINLUP2+1                                                02025000
@NM00118 EQU   BINLUP2                                                  02026000
BINSEDS  EQU   BINLUP2                                                  02027000
@NM00117 EQU   BINMEDIA                                                 02028000
BINCDEDS EQU   BINMEDIA                                                 02029000
BINXDOCF EQU   BINMEDIA                                                 02030000
BINXCDF  EQU   BINMEDIA                                                 02031000
BINDISK  EQU   BINMEDIA                                                 02032000
BINXCHNG EQU   BINMEDIA                                                 02033000
BINCARD  EQU   BINMEDIA                                                 02034000
BINDOCMT EQU   BINMEDIA                                                 02035000
@NM00116 EQU   BINDSPF1+1                                               02036000
BINUAALT EQU   BINDSPF1+1                                               02037000
BINUAINT EQU   BINDSPF1+1                                               02038000
BINTRNDS EQU   BINDSPF1                                                 02039000
@NM00115 EQU   BINDSPF1                                                 02040000
BINSLD   EQU   BINDSPF1                                                 02041000
BINVSDS  EQU   BINDSPF1                                                 02042000
BINVTDS  EQU   BINDSPF1                                                 02043000
BINHFDS  EQU   BINDSPF1                                                 02044000
BININTR  EQU   BINDSPF1                                                 02045000
@NM00114 EQU   @NM00112+1                                               02046000
BINXFPD  EQU   @NM00112+1                                               02047000
BINCSDS  EQU   @NM00112+1                                               02048000
BINQDSI  EQU   @NM00112+1                                               02049000
@NM00113 EQU   @NM00112+1                                               02050000
BINARRR  EQU   @NM00112                                                 02051000
BINSIDS  EQU   @NM00112                                                 02052000
BINSAI   EQU   @NM00112                                                 02053000
BINSDSI  EQU   @NM00112                                                 02054000
BINKDDSI EQU   @NM00112                                                 02055000
BINPDIR  EQU   BINFMF1                                                  02056000
BINCMPCT EQU   BINFMF1                                                  02057000
BINDESTS EQU   BINFMF1                                                  02058000
BINSLUS1 EQU   BINLUP1+6                                                02059000
BINPLUS1 EQU   BINLUP1+1                                                02060000
BINDSP1  EQU   BINLUP1                                                  02061000
BINFMHS1 EQU   BINLUP1                                                  02062000
@NM00060 EQU   PABXTNSN+12                                              02063000
PABNPSSQ EQU   PABXTNSN+8                                               02064000
PABLOCK  EQU   PABXTNSN+4                                               02065000
PABLAST  EQU   PABXTNSN                                                 02066000
@NM00148 EQU   RPLIBSQ                                                  02067000
RPLIINV  EQU   RPLIBSQ                                                  02068000
RPLINEG  EQU   RPLIBSQ                                                  02069000
RPLIPOS  EQU   RPLIBSQ                                                  02070000
RPLIIGN  EQU   RPLIBSQ                                                  02071000
RPLIRSET EQU   RPLIBSQ                                                  02072000
RPLITST  EQU   RPLIBSQ                                                  02073000
RPLISET  EQU   RPLIBSQ                                                  02074000
@NM00147 EQU   RPLOBSQ                                                  02075000
RPLOINV  EQU   RPLOBSQ                                                  02076000
RPLONEG  EQU   RPLOBSQ                                                  02077000
RPLOPOS  EQU   RPLOBSQ                                                  02078000
RPLOIGN  EQU   RPLOBSQ                                                  02079000
RPLORSET EQU   RPLOBSQ                                                  02080000
RPLOTST  EQU   RPLOBSQ                                                  02081000
RPLOSET  EQU   RPLOBSQ                                                  02082000
RPLIBSQV EQU   RPLOF60+2                                                02083000
RPLOBSQV EQU   RPLOF60                                                  02084000
@NM00146 EQU   RPLO5                                                    02085000
RPLTNFY  EQU   RPLO5                                                    02086000
@NM00145 EQU   RPLO5                                                    02087000
@NM00144 EQU   RPLCNTSC                                                 02088000
RPLRQR   EQU   RPLCNTSC                                                 02089000
RPLSTSN  EQU   RPLCNTSC                                                 02090000
RPLCLEAR EQU   RPLCNTSC                                                 02091000
RPLSDT   EQU   RPLCNTSC                                                 02092000
RPLBIS   EQU   RPLCNTDC                                                 02093000
RPLSBI   EQU   RPLCNTDC                                                 02094000
RPLTUNBD EQU   RPLCNTDC                                                 02095000
RPLTBIND EQU   RPLCNTDC                                                 02096000
RPLBID   EQU   RPLCNTDC                                                 02097000
@NM00143 EQU   RPLCNTDF                                                 02098000
RPLQI    EQU   RPLCNTDF                                                 02099000
RPLRELQ  EQU   RPLCNTDF                                                 02100000
RPLQEC   EQU   RPLCNTDF                                                 02101000
RPLQC    EQU   RPLCNTDF                                                 02102000
RPLQRI   EQU   RPLRESP                                                  02103000
@NM00142 EQU   RPLPOSTV                                                 02104000
RPLSCHED EQU   RPLPOSTV                                                 02105000
@NM00141 EQU   RPLVTFL1                                                 02106000
RPLTLGAC EQU   RPLVTFL1                                                 02107000
RPLTNDSP EQU   RPLVTFL1                                                 02108000
RPLAUTUS EQU   RPLVTFL1                                                 02109000
RPLVTUSE EQU   RPLVTFL1                                                 02110000
@NM00140 EQU   RPLVTFL1                                                 02111000
@NM00139 EQU   RPLCHN                                                   02112000
RPLMIDLE EQU   RPLCHN                                                   02113000
RPLFIRST EQU   RPLCHN                                                   02114000
@NM00138 EQU   RPLRTYPE                                                 02115000
RPLDFASY EQU   RPLRTYPE                                                 02116000
@NM00137 EQU   RPLSTYPE                                                 02117000
RPLSRESP EQU   RPLSTYPE                                                 02118000
@NM00136 EQU   RPLRH3                                                   02119000
RPLCHREQ EQU   RPLRH3                                                   02120000
BINSNMD  EQU   BINSLUNM+1                                               02121000
BINSNML  EQU   BINSLUNM                                                 02122000
BINCRKEY EQU   BINCRYRL+2                                               02123000
BINCCIPH EQU   BINCRPFL                                                 02124000
BINCRSV1 EQU   BINCRPFL                                                 02125000
BINCKEYT EQU   BINCRPFL                                                 02126000
BINCLEN  EQU   BINCRCTL                                                 02127000
BINCSESS EQU   BINCRCTL                                                 02128000
BINCEUMB EQU   BINCRCTL                                                 02129000
BINUSE   EQU   ISTBIND+36                                               02130000
BINUSEL  EQU   ISTBIND+35                                               02131000
BINPRIM  EQU   ISTBIND+27                                               02132000
BINPRIML EQU   ISTBIND+26                                               02133000
BINLUTYP EQU   BINLUP                                                   02134000
@NM00111 EQU   BINLUP                                                   02135000
BINBPACM EQU   BINBPACE                                                 02136000
@NM00110 EQU   BINBPACE                                                 02137000
BINSPACM EQU   BINSPACE                                                 02138000
@NM00109 EQU   BINSPACE                                                 02139000
BINPS1ST EQU   BINSPACE                                                 02140000
BINPRUSE EQU   BINPRUSZ                                                 02141000
BINPRUSM EQU   BINPRUSZ                                                 02142000
BINSRUSE EQU   BINSRUSZ                                                 02143000
BINSRUSM EQU   BINSRUSZ                                                 02144000
BINRPACM EQU   BINRPACE                                                 02145000
@NM00108 EQU   BINRPACE                                                 02146000
BINAPACM EQU   BINAPACE                                                 02147000
@NM00107 EQU   BINAPACE                                                 02148000
BINSP2ST EQU   BINAPACE                                                 02149000
BINCONR  EQU   BINCMNP2                                                 02150000
BINRCHN  EQU   BINCMNP2                                                 02151000
BINMDIBK EQU   BINCMNP2                                                 02152000
BINBKFS  EQU   BINCMNP2                                                 02153000
BINRCVR  EQU   BINCMNP2                                                 02154000
@NM00106 EQU   BINCMNP                                                  02155000
BINALT   EQU   BINCMNP                                                  02156000
BINFMHD  EQU   BINCMNP                                                  02157000
@NM00105 EQU   BINCMNP                                                  02158000
BINSSEB  EQU   BINSECP                                                  02159000
BINSCMP  EQU   BINSECP                                                  02160000
@NM00104 EQU   BINSECP                                                  02161000
BINSCHNR EQU   BINSECP                                                  02162000
BINSMCH  EQU   BINSECP                                                  02163000
BINSCHN  EQU   BINSECP                                                  02164000
BINPSEB  EQU   BINPRIP                                                  02165000
BINPCMP  EQU   BINPRIP                                                  02166000
@NM00103 EQU   BINPRIP                                                  02167000
BINPCHNR EQU   BINPRIP                                                  02168000
BINPMCH  EQU   BINPRIP                                                  02169000
BINPCHN  EQU   BINPRIP                                                  02170000
BINTS    EQU   ISTBIND+2                                                02171000
BINFM    EQU   ISTBIND+1                                                02172000
BINTYPE  EQU   BINFMTY                                                  02173000
BINFMT   EQU   BINFMTY                                                  02174000
TIEPTR2  EQU   TIERPHA                                                  02175000
TIEPTR1  EQU   TIESNA                                                   02176000
TIEGATE  EQU   TIETIEA                                                  02177000
TIEREQ   EQU   ISTTIE+3                                                 02178000
TIERETCD EQU   ISTTIE+2                                                 02179000
TIELNGTH EQU   ISTTIE+1                                                 02180000
TIETYPE  EQU   ISTTIE                                                   02181000
ATCAOS   EQU   ISTATCVT+2184                                            02182000
@NM00102 EQU   ISTATCVT+1924                                            02183000
ATCINCTV EQU   ISTATCVT+1920                                            02184000
@NM00101 EQU   ISTATCVT+1918                                            02185000
ATCSAF   EQU   ISTATCVT+1916                                            02186000
ATCAPCSX EQU   ISTATCVT+1912                                            02187000
ATCTSC3I EQU   ISTATCVT+1908                                            02188000
ATCHWCSA EQU   ISTATCVT+1904                                            02189000
ATCAPCRM EQU   ISTATCVT+1900                                            02190000
ATCAPCFR EQU   ISTATCVT+1896                                            02191000
ATCCACSA EQU   ISTATCVT+1892                                            02192000
ATCMXCSA EQU   ISTATCVT+1888                                            02193000
ATCTPMPB EQU   ISTATCVT+1856                                            02194000
ATCRPLAC EQU   ATCRPLCN+2                                               02195000
ATCRPLRC EQU   ATCRPLCN                                                 02196000
ATCCRPLQ EQU   ATCCRPL                                                  02197000
ATCCRAAC EQU   ATCCRACN+2                                               02198000
ATCCRARC EQU   ATCCRACN                                                 02199000
ATCCRAQ  EQU   ATCCRA                                                   02200000
ATCITSAV EQU   ISTATCVT+1836                                            02201000
ATCVIOPM EQU   ISTATCVT+1832                                            02202000
ATCTPMMI EQU   ISTATCVT+1828                                            02203000
ATCPXSRB EQU   ISTATCVT+1824                                            02204000
ATCRPLCT EQU   ISTATCVT+1822                                            02205000
ATCCRACT EQU   ISTATCVT+1820                                            02206000
ATCSRBCT EQU   ISTATCVT+1818                                            02207000
ATCSTNSM EQU   ISTATCVT+1817                                            02208000
@NM00100 EQU   @NM00099                                                 02209000
ATCNOSTR EQU   @NM00099                                                 02210000
ATCVTMAB EQU   @NM00099                                                 02211000
ATCTPCP1 EQU   ISTATCVT+1812                                            02212000
ATCTPCP0 EQU   ISTATCVT+1808                                            02213000
ATCZR01  EQU   ISTATCVT+1804                                            02214000
ATCASCB  EQU   ISTATCVT+1800                                            02215000
ATCMPSTQ EQU   ISTATCVT+1796                                            02216000
ATCOCCSM EQU   ISTATCVT+1792                                            02217000
ATCPSTA  EQU   ISTATCVT+1788                                            02218000
@NM00098 EQU   ATCVTFLG                                                 02219000
ATCVTACT EQU   ATCVTFLG                                                 02220000
@NM00097 EQU   ISTATCVT+1732                                            02221000
ATCTRMWA EQU   ISTATCVT+1728                                            02222000
ATCCSCBG EQU   ATCCSCB                                                  02223000
@NM00096 EQU   ISTATCVT+1723                                            02224000
ATCSNUF  EQU   ATCENFLG                                                 02225000
ATCOPKL  EQU   ATCENFLG                                                 02226000
ATCABEN  EQU   ATCENFLG                                                 02227000
ATCSRDN  EQU   ATCENFLG                                                 02228000
ATCDLDN  EQU   ATCENFLG                                                 02229000
ATCACTRM EQU   ISTATCVT+1720                                            02230000
ATCSMABF EQU   ISTATCVT+1716                                            02231000
ATCSMAPR EQU   ISTATCVT+1712                                            02232000
ATCSMAID EQU   ISTATCVT+1708                                            02233000
ATCSMARA EQU   ISTATCVT+1704                                            02234000
ATCCACXA EQU   ISTATCVT+1700                                            02235000
ATCATA10 EQU   ISTATCVT+1696                                            02236000
ATCHLTCB EQU   ISTATCVT+1692                                            02237000
ATCCCOOC EQU   ISTATCVT+1688                                            02238000
ATCAIWT  EQU   ISTATCVT+1684                                            02239000
ATCOROBT EQU   ISTATCVT+1680                                            02240000
ATCPXCRA EQU   ISTATCVT+1676                                            02241000
ATCGSRBF EQU   ATCGSRBG                                                 02242000
ATCTSCPC EQU   ISTATCVT+1668                                            02243000
ATCCDTCB EQU   ISTATCVT+1664                                            02244000
ATCORFRL EQU   ISTATCVT+1660                                            02245000
ATCORFPX EQU   ISTATCVT+1656                                            02246000
ATCORFMG EQU   ISTATCVT+1652                                            02247000
ATCSMBQ  EQU   ISTATCVT+1648                                            02248000
ATCINFDD EQU   ISTATCVT+1644                                            02249000
@NM00095 EQU   ATCDAPVT+22                                              02250000
ATCDAPDG EQU   ATCDAPVT+20                                              02251000
ATCDXCEA EQU   ATCDAPVT+16                                              02252000
ATCDCEA  EQU   ATCDAPVT+12                                              02253000
ATCDPCIA EQU   ATCDAPVT+8                                               02254000
ATCDSIOA EQU   ATCDAPVT+4                                               02255000
ATCDEOEA EQU   ATCDAPVT                                                 02256000
ATCZLAEA EQU   ATCLDAPP+16                                              02257000
ATCZLCEA EQU   ATCLDAPP+12                                              02258000
ATCZLPCI EQU   ATCLDAPP+8                                               02259000
ATCSMFRR EQU   ATCLDAPP+4                                               02260000
ATCCDTID EQU   ATCLDAPP                                                 02261000
ATCTRMPB EQU   ISTATCVT+1568                                            02262000
ATCORQG  EQU   ATCORSRB                                                 02263000
ATCORTBF EQU   ATCSQAFR                                                 02264000
@NM00094 EQU   ISTATCVT+1560                                            02265000
@NM00093 EQU   ISTATCVT+1532                                            02266000
ATCCDCNE EQU   ISTATCVT+1528                                            02267000
@NM00092 EQU   ISTATCVT+1526                                            02268000
ATCHASHN EQU   ISTATCVT+1524                                            02269000
ATCNOST  EQU   ISTATCVT+1520                                            02270000
ATCSMMWA EQU   ISTATCVT+1516                                            02271000
ATCSDCFR EQU   ISTATCVT+1512                                            02272000
ATCTSCRA EQU   ISTATCVT+1508                                            02273000
ATCSOCNT EQU   ISTATCVT+1504                                            02274000
ATCSOTHR EQU   ISTATCVT+1502                                            02275000
ATCSOPR2 EQU   ISTATCVT+1501                                            02276000
ATCSOPR1 EQU   ISTATCVT+1500                                            02277000
ATCAPCAT EQU   ISTATCVT+1496                                            02278000
ATCTSCWU EQU   ISTATCVT+1492                                            02279000
ATCMWRDT EQU   ISTATCVT+1488                                            02280000
ATCSTCK  EQU   ISTATCVT+1480                                            02281000
ATCWUPAB EQU   ATCWUDYP+16                                              02282000
@NM00091 EQU   ATCWUDYP                                                 02283000
ATCLKCNT EQU   ATCLKSWP+4                                               02284000
ATCCLOCK EQU   ATCLKSWP                                                 02285000
ATCNCBQ  EQU   ISTATCVT+1436                                            02286000
ATCPUCWC EQU   ISTATCVT+1432                                            02287000
ATCTSCQV EQU   ISTATCVT+1428                                            02288000
ATCTSCQU EQU   ISTATCVT+1424                                            02289000
ATCTSCQM EQU   ISTATCVT+1420                                            02290000
ATCTSCQF EQU   ISTATCVT+1416                                            02291000
ATCAPCVR EQU   ISTATCVT+1412                                            02292000
ATCHSQLK EQU   ISTATCVT+1408                                            02293000
ATCICIDM EQU   ISTATCVT+1406                                            02294000
ATCYRANG EQU   ISTATCVT+1405                                            02295000
ATCDRNUM EQU   ISTATCVT+1404                                            02296000
ATCSACNT EQU   ISTATCVT+1400                                            02297000
ATCTSCFA EQU   ISTATCVT+1396                                            02298000
ATCCDCVR EQU   ISTATCVT+1392                                            02299000
ATCCDCRI EQU   ISTATCVT+1388                                            02300000
ATCCDCRT EQU   ISTATCVT+1384                                            02301000
ATCVRNDX EQU   ISTATCVT+1380                                            02302000
ATCAP31  EQU   ISTATCVT+1376                                            02303000
ATCPSTLK EQU   ISTATCVT+1372                                            02304000
ATCOCAOA EQU   ISTATCVT+1368                                            02305000
ATCPUCEF EQU   ISTATCVT+1364                                            02306000
ATCPUCBM EQU   ISTATCVT+1360                                            02307000
ATCAPCES EQU   ISTATCVT+1356                                            02308000
ATCAPCPC EQU   ISTATCVT+1352                                            02309000
ATCAPCTE EQU   ISTATCVT+1348                                            02310000
ATCAPCIN EQU   ISTATCVT+1344                                            02311000
ATCAPCPD EQU   ISTATCVT+1340                                            02312000
ATCAPCAD EQU   ISTATCVT+1336                                            02313000
ATCAPCSD EQU   ISTATCVT+1332                                            02314000
ATCAPCIE EQU   ISTATCVT+1328                                            02315000
ATCAPCUE EQU   ISTATCVT+1324                                            02316000
ATCAPCRP EQU   ISTATCVT+1320                                            02317000
ATCAPCRS EQU   ISTATCVT+1316                                            02318000
ATCAPCTP EQU   ISTATCVT+1312                                            02319000
ATCAPCTW EQU   ISTATCVT+1308                                            02320000
ATCAPCPS EQU   ISTATCVT+1304                                            02321000
ATCAPCTS EQU   ISTATCVT+1300                                            02322000
ATCAPCTQ EQU   ISTATCVT+1296                                            02323000
ATCAPCTX EQU   ISTATCVT+1292                                            02324000
ATCSDCOS EQU   ISTATCVT+1288                                            02325000
ATCEXCVR EQU   ISTATCVT+1284                                            02326000
ATCCPCSV EQU   ISTATCVT+1280                                            02327000
ATCVRECB EQU   ATCVRTIL+12                                              02328000
ATCVRLCK EQU   ATCVRTIL+8                                               02329000
ATCVRWEL EQU   ATCVRTIL+4                                               02330000
ATCVRWEQ EQU   ATCVRTIL                                                 02331000
ATCMGPAB EQU   ISTATCVT+1248                                            02332000
ATCTSCMS EQU   ISTATCVT+1244                                            02333000
ATCVRATB EQU   ISTATCVT+1240                                            02334000
ATCVRWAP EQU   ISTATCVT+1236                                            02335000
ATCPVRAQ EQU   ISTATCVT+1232                                            02336000
ATCTOWA  EQU   ISTATCVT+1228                                            02337000
ATCTOD2  EQU   ATCTOD+4                                                 02338000
ATCTOD1  EQU   ATCTOD                                                   02339000
ATCERTP  EQU   ISTATCVT+1216                                            02340000
ATCBINDQ EQU   ISTATCVT+1212                                            02341000
ATCTIMER EQU   ISTATCVT+1208                                            02342000
ATCTSCDN EQU   ISTATCVT+1204                                            02343000
ATCTSCCN EQU   ISTATCVT+1200                                            02344000
ATCTSCL0 EQU   ISTATCVT+1196                                            02345000
ATCTSCP2 EQU   ISTATCVT+1192                                            02346000
ATCTSC3S EQU   ISTATCVT+1188                                            02347000
ATCTSC3R EQU   ISTATCVT+1184                                            02348000
ATCTSC3O EQU   ISTATCVT+1180                                            02349000
ATCIOPRG EQU   ATCIOINT                                                 02350000
ATCTSCMI EQU   ISTATCVT+1172                                            02351000
ATCTSCMO EQU   ISTATCVT+1168                                            02352000
ATCTSCP4 EQU   ISTATCVT+1164                                            02353000
ATCPUSCT EQU   ISTATCVT+1160                                            02354000
ATCTKINT EQU   ATCTKFLD+2                                               02355000
ATCTKCNT EQU   ATCTKFLD                                                 02356000
ATCTIMCK EQU   ISTATCVT+1152                                            02357000
@NM00090 EQU   ATCRID+2                                                 02358000
ATCCDRMA EQU   ATCRID                                                   02359000
ATCCPCGD EQU   ISTATCVT+1140                                            02360000
@NM00089 EQU   ATCSMSDQ+8                                               02361000
@NM00088 EQU   ATCSMSDQ+4                                               02362000
@NM00087 EQU   ATCSMSDQ                                                 02363000
ATCSEQNO EQU   ISTATCVT+1124                                            02364000
ATCSMPMD EQU   ISTATCVT+1120                                            02365000
ATCPAREA EQU   ISTATCVT+1116                                            02366000
ATCCPCSM EQU   ISTATCVT+1112                                            02367000
ATCSQCDS EQU   ISTATCVT+1108                                            02368000
ATCUSSVT EQU   ISTATCVT+1104                                            02369000
ATCNOSQ  EQU   ISTATCVT+1100                                            02370000
ATCINCIP EQU   ATCCPDVT+4                                               02371000
ATCTSCNI EQU   ATCCPDVT                                                 02372000
ATCMGCRT EQU   ISTATCVT+1088                                            02373000
ATCMACRT EQU   ISTATCVT+1084                                            02374000
ATCCSMT  EQU   ISTATCVT+1080                                            02375000
ATCINCNO EQU   ISTATCVT+1076                                            02376000
ATCRACON EQU   ISTATCVT+1072                                            02377000
ATCCFCDR EQU   ISTATCVT+1068                                            02378000
ATCONFIG EQU   ISTATCVT+1060                                            02379000
ATCNODEL EQU   ISTATCVT+1052                                            02380000
ATCCDTIM EQU   ISTATCVT+1050                                            02381000
ATCNMCTR EQU   ISTATCVT+1048                                            02382000
ATCPOIA  EQU   ATCRNO+1                                                 02383000
@NM00086 EQU   ATCRNO                                                   02384000
ATCHBSIZ EQU   ATCHPGM+2                                                02385000
ATCHBFNO EQU   ATCHPGM                                                  02386000
ATCMROUT EQU   ISTATCVT+1031                                            02387000
ATCXRANG EQU   ISTATCVT+1030                                            02388000
ATCMAXID EQU   ISTATCVT+1029                                            02389000
ATCMSGSP EQU   ISTATCVT+1028                                            02390000
ATCECTLP EQU   ISTATCVT+1024                                            02391000
ATCECSES EQU   ISTATCVT+1020                                            02392000
ATCECDSP EQU   ISTATCVT+1016                                            02393000
ATCECVRY EQU   ISTATCVT+1012                                            02394000
ATCECHLT EQU   ISTATCVT+1008                                            02395000
ATCECMOD EQU   ISTATCVT+1004                                            02396000
ATCRDTLK EQU   ISTATCVT+1000                                            02397000
ATCVOCLK EQU   ISTATCVT+996                                             02398000
ATCCIDM  EQU   ISTATCVT+994                                             02399000
ATCITLIM EQU   ISTATCVT+992                                             02400000
ATCTMINV EQU   ISTATCVT+990                                             02401000
ATCHOSTA EQU   ISTATCVT+988                                             02402000
ATCPUNSA EQU   ISTATCVT+986                                             02403000
ATCVTMID EQU   ATCSSCPA                                                 02404000
ATCHCNID EQU   ATCONID+2                                                02405000
ATCSCNID EQU   ATCONID                                                  02406000
@NM00085 EQU   ATCBITAN+3                                               02407000
@NM00084 EQU   ATCBITAN+2                                               02408000
@NM00083 EQU   ATCFLAG2                                                 02409000
ATCMSGID EQU   ATCFLAG2                                                 02410000
ATCINACT EQU   ATCFLAG2                                                 02411000
ATCCRYPF EQU   ATCFLAG2                                                 02412000
ATCTUNCL EQU   ATCFLAG2                                                 02413000
ATCTUNRQ EQU   ATCFLAG2                                                 02414000
ATCTUNAC EQU   ATCFLAG2                                                 02415000
ATCCDLRA EQU   ATCFLAG2                                                 02416000
@NM00082 EQU   ATCBITAN                                                 02417000
@NM00081 EQU   ATCSTAT4                                                 02418000
@NM00080 EQU   ATCSTAT4                                                 02419000
@NM00079 EQU   ATCSTAT4                                                 02420000
@NM00078 EQU   ATCSTAT4                                                 02421000
@NM00077 EQU   ATCSTAT4                                                 02422000
ATCPRTAT EQU   ATCSTAT4                                                 02423000
ATCNCSD  EQU   ATCSTAT4                                                 02424000
ATCMTST  EQU   ATCSTAT4                                                 02425000
@NM00076 EQU   ATCPOFLG                                                 02426000
@NM00075 EQU   ATCPOFLG                                                 02427000
@NM00074 EQU   ATCPOFLG                                                 02428000
@NM00073 EQU   ATCPOFLG                                                 02429000
@NM00072 EQU   ATCPOFLG                                                 02430000
@NM00071 EQU   ATCPOFLG                                                 02431000
@NM00070 EQU   ATCPOFLG                                                 02432000
ATCPOUNS EQU   ATCPOFLG                                                 02433000
ATCITEXT EQU   @NM00069                                                 02434000
ATCHIP   EQU   ATCSTAT1                                                 02435000
ATCMDHLT EQU   ATCSTAT1                                                 02436000
ATCINHLT EQU   ATCSTAT1                                                 02437000
ATCNETSL EQU   ATCSTAT1                                                 02438000
ATCQKHLT EQU   ATCSTAT1                                                 02439000
ATCSNHLT EQU   ATCSTAT1                                                 02440000
ATCACTIV EQU   ATCSTAT1                                                 02441000
ATCSTART EQU   ATCSTAT1                                                 02442000
ATCNOP00 EQU   ISTATCVT+968                                             02443000
ATCTSBUF EQU   ISTATCVT+964                                             02444000
ATCSSOQH EQU   ISTATCVT+960                                             02445000
ATCSSIQH EQU   ISTATCVT+956                                             02446000
ATCTSCMB EQU   ATCMBDVT                                                 02447000
ATCSOPAC EQU   ISTATCVT+950                                             02448000
ATCSOTIM EQU   ISTATCVT+948                                             02449000
ATCTSCON EQU   ATCSODVT                                                 02450000
ATCTSCSC EQU   ATCSSDVT                                                 02451000
ATCTSCRO EQU   ISTATCVT+936                                             02452000
ATCTSCRI EQU   ISTATCVT+932                                             02453000
ATCFEPT  EQU   ISTATCVT+928                                             02454000
ATCFDVT  EQU   ISTATCVT+924                                             02455000
ATCCONFT EQU   ISTATCVT+920                                             02456000
ATCSIBQ  EQU   ISTATCVT+916                                             02457000
ATCDSPLQ EQU   ISTATCVT+912                                             02458000
ATCVARYQ EQU   ISTATCVT+908                                             02459000
ATCHALTQ EQU   ISTATCVT+904                                             02460000
ATCMODQ  EQU   ISTATCVT+900                                             02461000
ATCSRT   EQU   ISTATCVT+896                                             02462000
ATCRDT   EQU   ISTATCVT+892                                             02463000
ATCSDVT  EQU   ISTATCVT+888                                             02464000
ATCDLRPT EQU   ISTATCVT+884                                             02465000
ATCBPDA  EQU   ISTATCVT+880                                             02466000
ATCACDA  EQU   ISTATCVT+876                                             02467000
ATCMNT   EQU   ISTATCVT+872                                             02468000
ATCNODDS EQU   ISTATCVT+868                                             02469000
ATCITRT  EQU   ISTATCVT+864                                             02470000
ATCTODVT EQU   ISTATCVT+860                                             02471000
ATCTRCPT EQU   ISTATCVT+856                                             02472000
ATCMODTB EQU   ISTATCVT+852                                             02473000
ATCUSSPT EQU   ISTATCVT+848                                             02474000
ATCTUBUF EQU   ISTATCVT+844                                             02475000
ATCTACB  EQU   ISTATCVT+840                                             02476000
ATCDWA   EQU   ISTATCVT+836                                             02477000
ATCCFCR2 EQU   ATCPODVT                                                 02478000
ATCPULQB EQU   @NM00068+16                                              02479000
ATCMCQAB EQU   @NM00068+12                                              02480000
ATCLUSMQ EQU   @NM00068+8                                               02481000
ATCLUIOQ EQU   @NM00068+4                                               02482000
ATCIOLQB EQU   @NM00068                                                 02483000
ATCTSCAP EQU   ATCANYDT                                                 02484000
ATCTSCCO EQU   ATCLUDVT+4                                               02485000
ATCTSCSR EQU   ATCLUDVT                                                 02486000
ATCVTLOD EQU   ISTATCVT+796                                             02487000
ATCTSCLF EQU   ISTATCVT+792                                             02488000
ATCTSCLE EQU   ISTATCVT+788                                             02489000
ATCTSCLB EQU   ISTATCVT+784                                             02490000
ATCTSCLS EQU   ISTATCVT+780                                             02491000
ATCTSCCF EQU   ISTATCVT+776                                             02492000
ATCTSCFV EQU   ISTATCVT+772                                             02493000
ATCTSCCE EQU   ISTATCVT+768                                             02494000
ATCTSCCB EQU   ISTATCVT+764                                             02495000
ATCTSCWS EQU   ISTATCVT+760                                             02496000
ATCTSCEM EQU   ISTATCVT+756                                             02497000
ATCTSCNS EQU   ISTATCVT+752                                             02498000
ATCTSCER EQU   ISTATCVT+748                                             02499000
ATCTSCPR EQU   ISTATCVT+744                                             02500000
ATCTSCGR EQU   ISTATCVT+740                                             02501000
ATCTSCCI EQU   ISTATCVT+736                                             02502000
ATCTSVT  EQU   ISTATCVT+732                                             02503000
ATCDVLOD EQU   ISTATCVT+728                                             02504000
ATCCDCNR EQU   ISTATCVT+724                                             02505000
ATCCDCNF EQU   ISTATCVT+720                                             02506000
ATCCDCND EQU   ISTATCVT+716                                             02507000
ATCCDCNA EQU   ISTATCVT+712                                             02508000
ATCCDCCP EQU   ISTATCVT+708                                             02509000
ATCCDFDN EQU   ISTATCVT+704                                             02510000
ATCCDFIN EQU   ISTATCVT+700                                             02511000
ATCCDFND EQU   ISTATCVT+696                                             02512000
ATCCDDEL EQU   ISTATCVT+692                                             02513000
ATCCDADD EQU   ISTATCVT+688                                             02514000
ATCTCLIM EQU   ISTATCVT+684                                             02515000
ATCRACTR EQU   ISTATCVT+680                                             02516000
ATCRACTI EQU   ISTATCVT+676                                             02517000
ATCREMOV EQU   ISTATCVT+672                                             02518000
ATCRACIO EQU   ISTATCVT+668                                             02519000
ATCADD   EQU   ISTATCVT+664                                             02520000
ATCPUCRT EQU   ISTATCVT+660                                             02521000
ATCSMRS  EQU   ISTATCVT+656                                             02522000
ATCSMRQ  EQU   ISTATCVT+652                                             02523000
ATCORCAF EQU   ISTATCVT+648                                             02524000
ATCFRSTR EQU   ATCGTSTR                                                 02525000
ATCSTMA  EQU   ISTATCVT+640                                             02526000
ATCSRTAD EQU   ISTATCVT+636                                             02527000
ATCOCCFS EQU   ISTATCVT+632                                             02528000
ATCOCCFP EQU   ISTATCVT+628                                             02529000
ATCSRTDF EQU   ISTATCVT+624                                             02530000
ATCLUCRT EQU   ISTATCVT+620                                             02531000
ATCINCY5 EQU   ISTATCVT+616                                             02532000
ATCINCW3 EQU   ISTATCVT+612                                             02533000
ATCINCU6 EQU   ISTATCVT+608                                             02534000
ATCINCTQ EQU   ISTATCVT+604                                             02535000
ATCINCS1 EQU   ISTATCVT+600                                             02536000
ATCSRTAB EQU   ISTATCVT+596                                             02537000
ATCINCRD EQU   ISTATCVT+592                                             02538000
ATCINCPH EQU   ISTATCVT+588                                             02539000
ATCINCLQ EQU   ISTATCVT+584                                             02540000
ATCNOCRT EQU   ISTATCVT+580                                             02541000
ATCINCF1 EQU   ISTATCVT+576                                             02542000
ATCINCCI EQU   ISTATCVT+572                                             02543000
ATCINCCO EQU   ISTATCVT+568                                             02544000
ATCBLDLA EQU   ISTATCVT+564                                             02545000
ATCALOAD EQU   ISTATCVT+560                                             02546000
ATCADEL  EQU   ISTATCVT+556                                             02547000
ATCRACEP EQU   ISTATCVT+552                                             02548000
ATCESC01 EQU   ISTATCVT+548                                             02549000
ATCDEC01 EQU   ISTATCVT+544                                             02550000
ATCDEC00 EQU   ISTATCVT+540                                             02551000
ATCCPCRT EQU   ISTATCVT+536                                             02552000
ATCAP35  EQU   ISTATCVT+532                                             02553000
ATCCPCFR EQU   ISTATCVT+528                                             02554000
ATCCPCGR EQU   ISTATCVT+524                                             02555000
ATCCPCPP EQU   ISTATCVT+520                                             02556000
ATCCPCNT EQU   ISTATCVT+516                                             02557000
ATCAUTHA EQU   ISTATCVT+512                                             02558000
ATCACCTA EQU   ISTATCVT+508                                             02559000
ATCMSGP  EQU   ISTATCVT+504                                             02560000
ATCAP39  EQU   ISTATCVT+500                                             02561000
ATCAP36  EQU   ISTATCVT+496                                             02562000
ATCMSGM  EQU   ISTATCVT+492                                             02563000
ATCAP33  EQU   ISTATCVT+488                                             02564000
ATCAICPT EQU   ISTATCVT+484                                             02565000
ATCAPI   EQU   ISTATCVT+480                                             02566000
ATCACC01 EQU   ISTATCVT+476                                             02567000
ATCACC00 EQU   ISTATCVT+472                                             02568000
ATCMBPAB EQU   ISTATCVT+456                                             02569000
ATCSOPAB EQU   ISTATCVT+440                                             02570000
ATCSSPAB EQU   ISTATCVT+424                                             02571000
ATCLDECB EQU   ATCLDTIL+12                                              02572000
ATCLDLCK EQU   ATCLDTIL+8                                               02573000
ATCLDLST EQU   ATCLDTIL+4                                               02574000
ATCLDNCS EQU   ATCLDTIL                                                 02575000
ATCNOSPB EQU   ISTATCVT+376                                             02576000
ATCNSPAB EQU   ISTATCVT+344                                             02577000
ATCLUSRT EQU   ISTATCVT+312                                             02578000
ATCPUIOP EQU   ISTATCVT+280                                             02579000
ATCPUPAB EQU   ISTATCVT+248                                             02580000
ATCPXPAB EQU   ISTATCVT+216                                             02581000
ATCPOPAB EQU   ISTATCVT+184                                             02582000
ATCVDPAB EQU   ISTATCVT+152                                             02583000
ATCTCIPB EQU   ISTATCVT+120                                             02584000
ATCCSPAB EQU   ATCSMPAB+16                                              02585000
@NM00067 EQU   ATCSMPAB                                                 02586000
ATCTMRPB EQU   ISTATCVT+56                                              02587000
ATCITPAB EQU   ISTATCVT+24                                              02588000
@NM00066 EQU   ATCITRA1                                                 02589000
ATCITSCP EQU   ATCITRA1                                                 02590000
ATCITMSG EQU   ATCITRA1                                                 02591000
ATCITPIU EQU   ATCITRA1                                                 02592000
ATCITSMS EQU   ATCITRA1                                                 02593000
ATCITPSS EQU   ATCITRA1                                                 02594000
ATCITLCK EQU   ATCITRA1                                                 02595000
ATCITAPI EQU   ATCITRA1                                                 02596000
ATCITCNT EQU   ATCITFLG                                                 02597000
ATCITRPH EQU   ATCITCDS                                                 02598000
ATCITTBL EQU   ATCITFLD+4                                               02599000
ATCITMAX EQU   ATCITPRM                                                 02600000
ATCPTCHA EQU   ATCRPTCH+4                                               02601000
ATCVTLVL EQU   ATCRPTCH                                                 02602000
RPHUPSTA EQU   ISTRPH+100                                               02603000
RPHSAV16 EQU   RPHWORK+60                                               02604000
RPHSAV15 EQU   RPHWORK+56                                               02605000
RPHSAV14 EQU   RPHWORK+52                                               02606000
RPHSAV13 EQU   RPHWORK+48                                               02607000
RPHSAV12 EQU   RPHWORK+44                                               02608000
RPHSAV11 EQU   RPHWORK+40                                               02609000
RPHSAV10 EQU   RPHWORK+36                                               02610000
RPHSAVE9 EQU   RPHWORK+32                                               02611000
RPHSAVE8 EQU   RPHWORK+28                                               02612000
RPHSAVE7 EQU   RPHWORK+24                                               02613000
RPHSAVE6 EQU   RPHWORK+20                                               02614000
RPHSAVE5 EQU   RPHWORK+16                                               02615000
RPHSAVE4 EQU   RPHWORK+12                                               02616000
RPHSAVE3 EQU   RPHWORK+8                                                02617000
RPHSAVE2 EQU   RPHWORK+4                                                02618000
RPHSHALF EQU   RPHSAVE1+2                                               02619000
RPHSBIT8 EQU   RPHSBITS                                                 02620000
RPHSBIT7 EQU   RPHSBITS                                                 02621000
RPHSBIT6 EQU   RPHSBITS                                                 02622000
RPHSBIT5 EQU   RPHSBITS                                                 02623000
RPHSBIT4 EQU   RPHSBITS                                                 02624000
RPHSBIT3 EQU   RPHSBITS                                                 02625000
RPHSBIT2 EQU   RPHSBITS                                                 02626000
RPHSBIT1 EQU   RPHSBITS                                                 02627000
RPHSBYTE EQU   RPHSAVE1                                                 02628000
RPHCRR   EQU   ISTRPH+32                                                02629000
RPHSRP34 EQU   RPHSRPRM+2                                               02630000
RPHSRP12 EQU   RPHSRPRM                                                 02631000
RPHWEGT  EQU   RPHWEA                                                   02632000
RPHMAJCB EQU   ISTRPH+21                                                02633000
RPHPABOF EQU   ISTRPH+20                                                02634000
RPHRESUM EQU   RPHRESMA+1                                               02635000
@NM00065 EQU   RPHWPFLG                                                 02636000
RPHPURGE EQU   RPHWPFLG                                                 02637000
RPHPT    EQU   RPHWPFLG                                                 02638000
RPHWT    EQU   RPHWPFLG                                                 02639000
RPHRSKEY EQU   RPHWPFLG                                                 02640000
RPHDVTA  EQU   ISTRPH+12                                                02641000
RPHTIK   EQU   RPHTSKID+3                                               02642000
@NM00064 EQU   RPHTSKID                                                 02643000
RPHRPHAP EQU   RPHRPHA+1                                                02644000
@NM00063 EQU   RPHRPHA                                                  02645000
RPHGATE  EQU   RPHRPHA                                                  02646000
@NM00062 EQU   RPHFLGB                                                  02647000
RPHABEND EQU   RPHFLGB                                                  02648000
RPHUWAIT EQU   RPHFLGB                                                  02649000
RPHRLCRA EQU   RPHFLGB                                                  02650000
RPHSYNCH EQU   RPHFLGB                                                  02651000
RPHPGCMP EQU   RPHFLGB                                                  02652000
RPHLOCK  EQU   RPHFLGB                                                  02653000
@NM00061 EQU   RPHFLAGS                                                 02654000
RPHSMCLR EQU   RPHFLAGS                                                 02655000
RPHSMTYP EQU   RPHFLAGS                                                 02656000
RPHSMQ   EQU   RPHFLAGS                                                 02657000
RPHLNGTH EQU   RPHCNTL+1                                                02658000
RPHTYPE  EQU   RPHCNTL                                                  02659000
DYPPAB   EQU   ISTDYPAB+16                                              02660000
DYPOCRPH EQU   DYPPACMD                                                 02661000
DYPTSKID EQU   ISTDYPAB+8                                               02662000
DYPPACTB EQU   DYPCHAIN                                                 02663000
DYPFLGS  EQU   ISTDYPAB+2                                               02664000
DYPLNGTH EQU   ISTDYPAB+1                                               02665000
DYPTYPE  EQU   ISTDYPAB                                                 02666000
PABRPHA  EQU   PABRPHFG+1                                               02667000
@NM00059 EQU   PABFLAGS                                                 02668000
PABKPRPH EQU   PABFLAGS                                                 02669000
PABNODQ  EQU   PABFLAGS                                                 02670000
PABXTND  EQU   PABFLAGS                                                 02671000
PABSYNCH EQU   PABFLAGS                                                 02672000
PABCDP   EQU   PABFLAGS                                                 02673000
PABUNCON EQU   PABFLAGS                                                 02674000
PABDVTA  EQU   ISTPAB+9                                                 02675000
PABOFFST EQU   ISTPAB+8                                                 02676000
PABCHNGP EQU   PABCHAIN+1                                               02677000
@NM00058 EQU   PABCHAIN                                                 02678000
PABCHNG  EQU   PABCHAIN                                                 02679000
PABWEQP  EQU   PABWEQA+1                                                02680000
@NM00057 EQU   PABWEQA                                                  02681000
PABWEQG  EQU   PABWEQA                                                  02682000
LOKXCL   EQU   @NM00055                                                 02683000
LOKPRY   EQU   @NM00055                                                 02684000
@NM00056 EQU   @NM00055                                                 02685000
@NM00054 EQU   LOKCHNG                                                  02686000
LOKCT    EQU   ISTLOK                                                   02687000
ISTRETR7 EQU   ISTRETRG+4                                               02688000
ISTRETR6 EQU   ISTRETRG                                                 02689000
ISTRSV01 EQU   ISTAVT+42                                                02690000
ISTPDAVP EQU   ISTAVT+38                                                02691000
ISTVTTP  EQU   ISTAVT+36                                                02692000
ISTAGTWT EQU   ISTAVT+34                                                02693000
ISTATRT  EQU   ISTAVT+32                                                02694000
ISTARID  EQU   ISTAVT+30                                                02695000
ISTX1    EQU   ISTAVT+29                                                02696000
ISTPHNM  EQU   ISTAVT+24                                                02697000
ISTAPSEX EQU   ISTAVT+20                                                02698000
ISTVTTIK EQU   ISTAVT+18                                                02699000
AVTASID  EQU   ISTAVT+16                                                02700000
ISTAPSTA EQU   ISTAVT+12                                                02701000
ISTAS53  EQU   ISTAVT+8                                                 02702000
ISTAS49  EQU   ISTAVT+4                                                 02703000
ISTACVT  EQU   ISTAVT                                                   02704000
RPLSIGDA EQU   RPLVTEXT+32                                              02705000
RPLSAV13 EQU   RPLVTEXT+28                                              02706000
RPLUSNSO EQU   RPLOSENS+2                                               02707000
RPLSSMO  EQU   RPLSSNSO+1                                               02708000
@NM00135 EQU   RPLSSEO                                                  02709000
RPLRRO   EQU   RPLSSEO                                                  02710000
RPLFIO   EQU   RPLSSEO                                                  02711000
RPLSTATO EQU   RPLSSEO                                                  02712000
RPLCPMO  EQU   RPLSSEO                                                  02713000
@NM00134 EQU   RPLSSEO                                                  02714000
@NM00133 EQU   RPLOPT12                                                 02715000
@NM00132 EQU   RPLOPT12                                                 02716000
@NM00131 EQU   RPLOPT12                                                 02717000
RPLNIBTK EQU   RPLOPT12                                                 02718000
RPLTRUNC EQU   RPLOPT12                                                 02719000
RPLKEEP  EQU   RPLOPT12                                                 02720000
@NM00130 EQU   RPLOPT12                                                 02721000
RPLRSVE8 EQU   RPLOPT11                                                 02722000
RPLRSVE7 EQU   RPLOPT11                                                 02723000
RPLRSVE6 EQU   RPLOPT11                                                 02724000
RPLRSVE5 EQU   RPLOPT11                                                 02725000
RPLRSVE4 EQU   RPLOPT11                                                 02726000
RPLSTOP  EQU   RPLOPT11                                                 02727000
RPLSTART EQU   RPLOPT11                                                 02728000
RPLQUIES EQU   RPLOPT11                                                 02729000
RPLRSVI6 EQU   RPLOPT10                                                 02730000
RPLRSVI5 EQU   RPLOPT10                                                 02731000
RPLRSVI4 EQU   RPLOPT10                                                 02732000
RPLRSVI3 EQU   RPLOPT10                                                 02733000
RPLTSKY  EQU   RPLOPT10                                                 02734000
RPLSPARM EQU   RPLOPT10                                                 02735000
RPLDSPLY EQU   RPLOPT10                                                 02736000
RPLBSCID EQU   RPLOPT10                                                 02737000
RPLTOPL  EQU   RPLOPT9                                                  02738000
RPLCIDE  EQU   RPLOPT9                                                  02739000
RPLRNNM  EQU   RPLOPT9                                                  02740000
RPLAPPST EQU   RPLOPT9                                                  02741000
RPLCOUNT EQU   RPLOPT9                                                  02742000
RPLTERMS EQU   RPLOPT9                                                  02743000
RPLDEVCH EQU   RPLOPT9                                                  02744000
RPLLOGON EQU   RPLOPT9                                                  02745000
RPLESR2  EQU   RPLUSNSI+1                                               02746000
RPLESR1  EQU   RPLUSNSI                                                 02747000
@NM00129 EQU   RPLSSEI                                                  02748000
RPLRRI   EQU   RPLSSEI                                                  02749000
RPLFII   EQU   RPLSSEI                                                  02750000
RPLSTATI EQU   RPLSSEI                                                  02751000
RPLCPMI  EQU   RPLSSEI                                                  02752000
RPLPATHI EQU   RPLSSEI                                                  02753000
RPLARCLN EQU   RPLVTEXT+8                                               02754000
RPLAAREA EQU   RPLVTEXT                                                 02755000
RPLERMSA EQU   RPLCOMN+72                                               02756000
RPLEMLEN EQU   RPLCOMN+70                                               02757000
RPLACTIV EQU   RPLCOMN+69                                               02758000
RPLBRANC EQU   RPLEXTD1                                                 02759000
RPLNIB   EQU   RPLEXTD1                                                 02760000
RPLTCRYP EQU   RPLEXTD1                                                 02761000
@NM00128 EQU   RPLEXTD1                                                 02762000
RPLEXIT  EQU   RPLEXTD1                                                 02763000
RPLNEXIT EQU   RPLEXTD1                                                 02764000
RPLEXSCH EQU   RPLEXTD1                                                 02765000
RPLDDDD  EQU   RPLRBAR+4                                                02766000
@NM00127 EQU   RPLRBAR+3                                                02767000
@NM00126 EQU   RPLAIXID                                                 02768000
RPLAXPKP EQU   RPLAIXID                                                 02769000
RPLAIXPC EQU   RPLRBAR                                                  02770000
RPLRSV88 EQU   RPLOPT8                                                  02771000
RPLUNCON EQU   RPLOPT8                                                  02772000
RPLACTV  EQU   RPLOPT8                                                  02773000
RPLSESS  EQU   RPLOPT8                                                  02774000
RPLPEND  EQU   RPLOPT8                                                  02775000
RPLODPRM EQU   RPLOPT8                                                  02776000
RPLODACP EQU   RPLOPT8                                                  02777000
RPLODACQ EQU   RPLOPT8                                                  02778000
RPLRSV78 EQU   RPLOPT7                                                  02779000
RPLTCRNO EQU   RPLOPT7                                                  02780000
RPLRLSOP EQU   RPLOPT7                                                  02781000
RPLTPOST EQU   RPLOPT7                                                  02782000
RPLQOPT  EQU   RPLOPT7                                                  02783000
RPLCNIMM EQU   RPLCNOPT                                                 02784000
RPLCNANY EQU   RPLCNOPT                                                 02785000
RPLCNALL EQU   RPLCNOPT                                                 02786000
RPLRSV68 EQU   RPLOPT6                                                  02787000
RPLRSV67 EQU   RPLOPT6                                                  02788000
RPLLOCK  EQU   RPLOPT6                                                  02789000
RPLNCOND EQU   RPLOPT6                                                  02790000
RPLCOND  EQU   RPLOPT6                                                  02791000
RPLEOT   EQU   RPLUNTYP                                                 02792000
RPLEOM   EQU   RPLUNTYP                                                 02793000
RPLEOB   EQU   RPLUNTYP                                                 02794000
RPLWROPT EQU   RPLOPT5                                                  02795000
RPLNODE  EQU   RPLOPT5                                                  02796000
RPLERACE EQU   RPLWRTYP                                                 02797000
RPLEAU   EQU   RPLWRTYP                                                 02798000
RPLNERAS EQU   RPLWRTYP                                                 02799000
RPLPSOPT EQU   RPLOPT5                                                  02800000
@NM00125 EQU   RPLOPT5                                                  02801000
RPLDLGIN EQU   RPLOPT5                                                  02802000
RPLCHAIN EQU   RPLNXTRP                                                 02803000
@NM00124 EQU   RPLOPT4                                                  02804000
RPLMKFRM EQU   RPLOPT4                                                  02805000
RPLENDTR EQU   RPLOPT4                                                  02806000
RPLALIGN EQU   RPLOPT3                                                  02807000
RPLFMT   EQU   RPLOPT3                                                  02808000
RPLFLD   EQU   RPLOPT3                                                  02809000
RPLVFY   EQU   RPLOPT3                                                  02810000
RPLBLK   EQU   RPLOPT3                                                  02811000
RPLSFORM EQU   RPLOPT3                                                  02812000
RPLEODS  EQU   RPLOPT3                                                  02813000
RPLNSP   EQU   RPLOPT2                                                  02814000
RPLUPD   EQU   RPLOPT2                                                  02815000
RPLWAITX EQU   RPLOPT2                                                  02816000
RPLLRD   EQU   RPLOPT2                                                  02817000
RPLBWD   EQU   RPLOPT2                                                  02818000
RPLCNV   EQU   RPLOPT2                                                  02819000
RPLADD   EQU   RPLADR                                                   02820000
RPLKEY   EQU   RPLOPT2                                                  02821000
RPLECBIN EQU   RPLECBSW                                                 02822000
RPLGEN   EQU   RPLOPT1                                                  02823000
RPLKGE   EQU   RPLOPT1                                                  02824000
RPLASY   EQU   RPLOPT1                                                  02825000
RPLSKP   EQU   RPLOPT1                                                  02826000
RPLSEQ   EQU   RPLOPT1                                                  02827000
RPLDIR   EQU   RPLOPT1                                                  02828000
RPLLOC   EQU   RPLOPT1                                                  02829000
RPLDAF   EQU   RPLARG+2                                                 02830000
RPLSAF   EQU   RPLARG                                                   02831000
RPLTCBPT EQU   RPLCOMN+28                                               02832000
RPLDACB  EQU   RPLCOMN+24                                               02833000
RPLCCHAR EQU   RPLCOMN+20                                               02834000
RPLSTRID EQU   RPLCOMN+18                                               02835000
RPLKEYL  EQU   RPLKEYLE                                                 02836000
RPLRDSOH EQU   RPLFDB3                                                  02837000
RPLRLG   EQU   RPLFDB3                                                  02838000
RPLLGFRC EQU   RPLFDB3                                                  02839000
RPLREOM  EQU   RPLFDB3                                                  02840000
RPLREOB  EQU   RPLFDB3                                                  02841000
RPLSV32  EQU   RPLFDB3                                                  02842000
RPLUINPT EQU   RPLFDB3                                                  02843000
RPLSTSAV EQU   RPLFDB2                                                  02844000
RPLCUERR EQU   RPLFDB2                                                  02845000
RPLDLGFL EQU   RPLFDB2                                                  02846000
RPLIOERR EQU   RPLFDB2                                                  02847000
RPLDVUNS EQU   RPLFDB2                                                  02848000
RPLATND  EQU   RPLFDB2                                                  02849000
RPLRVID  EQU   RPLFDB2                                                  02850000
RPLERLK  EQU   RPLFDB2                                                  02851000
RPLERREG EQU   RPLRTNCD                                                 02852000
RPLSTAT  EQU   RPLFDBWD                                                 02853000
RPLPOST  EQU   RPLECB                                                   02854000
RPLWAIT  EQU   RPLECB                                                   02855000
RPLPLHPT EQU   RPLCOMN+4                                                02856000
RPLLEN2  EQU   RPLLEN                                                   02857000
RPLSTYP  EQU   RPLIDWD+1                                                02858000
RPLID    EQU   RPLIDWD                                                  02859000
SVECC010 EQU   TOLTEPWA+3952                                            02860000
SVETC035 EQU   TOLTEPWA+3880                                            02861000
SVESC030 EQU   TOLTEPWA+3808                                            02862000
SVESC020 EQU   TOLTEPWA+3664                                            02863000
SVEIC002 EQU   TOLTEPWA+3520                                            02864000
SVECC014 EQU   TOLTEPWA+3376                                            02865000
SVESC120 EQU   TOLTEPWA+3304                                            02866000
SVESC025 EQU   TOLTEPWA+3088                                            02867000
@NM00053 EQU   TOLTEPWA+2980                                            02868000
@NM00052 EQU   TOLTEPWA+2976                                            02869000
$R13PR3  EQU   TOLTEPWA+2972                                            02870000
$CEINT2  EQU   TOLTEPWA+2968                                            02871000
$CEINT1  EQU   TOLTEPWA+2964                                            02872000
$MSGGET  EQU   TOLTEPWA+2960                                            02873000
$ACQLIST EQU   TOLTEPWA+2956                                            02874000
$R4SAVE1 EQU   TOLTEPWA+2952                                            02875000
$CLSISS  EQU   TOLTEPWA+2950                                            02876000
$CLSCNT  EQU   TOLTEPWA+2948                                            02877000
$CUTABLE EQU   TOLTEPWA+2868                                            02878000
$BUFSZ2  EQU   TOLTEPWA+2864                                            02879000
$RESID2  EQU   TOLTEPWA+2860                                            02880000
$OLTCCW2 EQU   TOLTEPWA+2856                                            02881000
$ENDBFR2 EQU   TOLTEPWA+2852                                            02882000
$1STBFR2 EQU   TOLTEPWA+2848                                            02883000
$TECB2   EQU   TOLTEPWA+2844                                            02884000
$BUFSZ1  EQU   TOLTEPWA+2840                                            02885000
$RESID1  EQU   TOLTEPWA+2836                                            02886000
$OLTCCW1 EQU   TOLTEPWA+2832                                            02887000
$ENDBFR1 EQU   TOLTEPWA+2828                                            02888000
$1STBFR1 EQU   TOLTEPWA+2824                                            02889000
$TECB1   EQU   TOLTEPWA+2820                                            02890000
$WAITIME EQU   TOLTEPWA+2816                                            02891000
$TRTN#   EQU   TOLTEPWA+2815                                            02892000
$WIODEV  EQU   TOLTEPWA+2814                                            02893000
$RQSTSZE EQU   TOLTEPWA+2812                                            02894000
$RQSTPTR EQU   TOLTEPWA+2808                                            02895000
$R4SAVE  EQU   TOLTEPWA+2804                                            02896000
$PARTADR EQU   TOLTEPWA+2800                                            02897000
$TBSDATA EQU   TOLTEPWA+2796                                            02898000
$CTWIDTH EQU   TOLTEPWA+2795                                            02899000
$CTLINE  EQU   TOLTEPWA+2794                                            02900000
$APWIDTH EQU   TOLTEPWA+2793                                            02901000
$APLINE  EQU   TOLTEPWA+2792                                            02902000
$INDEX   EQU   $IMITX                                                   02903000
$UMXX    EQU   @NM00051+14                                              02904000
$NSXX    EQU   @NM00051+12                                              02905000
$ATACNT  EQU   $NSCNT                                                   02906000
$CTR     EQU   @NM00051+8                                               02907000
$ATAPTR  EQU   $NSPTR                                                   02908000
$DDRPTR  EQU   @NM00051                                                 02909000
$DTORESP EQU   TOLTEPWA+2712                                            02910000
$APNAME  EQU   TOLTEPWA+2704                                            02911000
$24SYMNE EQU   $24CATMG+4                                               02912000
$24DEVAD EQU   $24CATMG                                                 02913000
$24RTN#  EQU   $24FEMSG+8                                               02914000
$ESECTID EQU   $24FEMSG                                                 02915000
$24FLGS  EQU   TOLTEPWA+2680                                            02916000
$24SAVE2 EQU   TOLTEPWA+2676                                            02917000
$24SAVE1 EQU   TOLTEPWA+2672                                            02918000
$24UNADR EQU   TOLTEPWA+2668                                            02919000
$24SAV13 EQU   TOLTEPWA+2664                                            02920000
$24RETCD EQU   TOLTEPWA+2663                                            02921000
$MACID   EQU   TOLTEPWA+2661                                            02922000
$CSPARE  EQU   $CFLGS                                                   02923000
$C2WAY   EQU   $CFLGS                                                   02924000
$CINCT   EQU   $CCOMDAT+12                                              02925000
$CINADR  EQU   $CCOMDAT+8                                               02926000
$COUTCT  EQU   $CCOMDAT+4                                               02927000
$COUTAD  EQU   $CCOMDAT                                                 02928000
ROOTLOC  EQU   TOLTEPWA+2640                                            02929000
$WORK    EQU   TOLTEPWA+2376                                            02930000
$EXTA    EQU   TOLTEPWA+2320                                            02931000
$PASSONA EQU   TOLTEPWA+2264                                            02932000
$INBUFR  EQU   TOLTEPWA+2104                                            02933000
$BUFFER  EQU   TOLTEPWA+1976                                            02934000
$TLTRPL3 EQU   TOLTEPWA+1856                                            02935000
$SLTBL   EQU   TOLTEPWA+1468                                            02936000
$CDEVPT  EQU   TOLTEPWA+1466                                            02937000
$DEVCNTS EQU   TOLTEPWA+1464                                            02938000
$FEEDBCK EQU   $DEVTBLE+66                                              02939000
$WTISUED EQU   $DEVFLG4                                                 02940000
$EXIOISD EQU   $DEVFLG4                                                 02941000
$REMWRIT EQU   $DEVFLG4                                                 02942000
$REMDONE EQU   $DEVFLG4                                                 02943000
$2NDUSED EQU   $DEVFLG4                                                 02944000
$1STUSED EQU   $DEVFLG4                                                 02945000
$IGLXIFB EQU   $DEVFLG4                                                 02946000
$EXIOLV3 EQU   $DEVFLG4                                                 02947000
@NM00050 EQU   $DEVFLG5                                                 02948000
$DVBASIC EQU   $DEVFLG5                                                 02949000
$OPNDFAL EQU   $DEVFLG5                                                 02950000
$ACQNCB  EQU   $DEVFLG5                                                 02951000
$REMOTE  EQU   $DEVFLG5                                                 02952000
$ENDNODE EQU   $DEVFLG5                                                 02953000
$LINENME EQU   $RNINFO                                                  02954000
$DVCOL   EQU   $LDNCBPT+2                                               02955000
$DVROW   EQU   $LDNCBPT                                                 02956000
$NCSPLP  EQU   $DEVTBLE+44                                              02957000
$DVLN    EQU   $SSCPDAF                                                 02958000
$DAF     EQU   $DEVSESP+4                                               02959000
$VARYPAB EQU   $DEVSESP                                                 02960000
$SYSMN   EQU   $DEVTBLE+28                                              02961000
@NM00049 EQU   $DEVFLG3                                                 02962000
$CLRSNT  EQU   $DEVFLG3                                                 02963000
$OLTERR  EQU   $DEVFLG3                                                 02964000
$SRTEST  EQU   $DEVFLG3                                                 02965000
$POLLREQ EQU   $DEVFLG3                                                 02966000
$ACQRED  EQU   $DEVFLG3                                                 02967000
$NOTDEV  EQU   $DEVFLG3                                                 02968000
$CEINTRP EQU   $DEVFLG2                                                 02969000
$TESTMDE EQU   $DEVFLG2                                                 02970000
$DEVALOC EQU   $DEVFLG2                                                 02971000
$ALLDATA EQU   $DEVFLG2                                                 02972000
$ENDCNTL EQU   $DEVFLG2                                                 02973000
$CTLDEV  EQU   $DEVFLG2                                                 02974000
$NOCDS   EQU   $DEVFLG2                                                 02975000
$DATAIN  EQU   $DEVFLG2                                                 02976000
$PRIMARY EQU   $DEVFLG1                                                 02977000
$DEVACT  EQU   $DEVFLG1                                                 02978000
$DVLGMDE EQU   $ATTNEXP                                                 02979000
$DVSPRM  EQU   $EVNCPLT                                                 02980000
$GRABBED EQU   $DEVFLG1                                                 02981000
$CATASTR EQU   $DEVFLG1                                                 02982000
$LETGO   EQU   $DEVFLG1                                                 02983000
$EXTDEV  EQU   $DEVCDS+11                                               02984000
@NM00048 EQU   $DEVSDCF                                                 02985000
$NOTPRIM EQU   $DEVSDCF                                                 02986000
@NM00047 EQU   $DEVCDSF                                                 02987000
@NM00046 EQU   $DEVCDSF                                                 02988000
@NM00045 EQU   $DEVCDSF                                                 02989000
$CDSNAME EQU   $DEVCDSF                                                 02990000
$EXTRN   EQU   $DEVCDSF                                                 02991000
$CEVOLUM EQU   $DEVCDSF                                                 02992000
$SHARD   EQU   $DEVCDSF                                                 02993000
$DEVFPM  EQU   $DEVCDSF                                                 02994000
$DEVCNT  EQU   $DEVCDS+8                                                02995000
$DEVTYPE EQU   $DEVFEAT+3                                               02996000
$DEVCLAS EQU   $DEVFEAT+2                                               02997000
$DEVMOD  EQU   $DEVFEAT                                                 02998000
$DEVRDGT EQU   @NM00043+1                                               02999000
$DEVCTLU EQU   @NM00043+1                                               03000000
$DEVCHAN EQU   @NM00043                                                 03001000
@NM00044 EQU   @NM00043                                                 03002000
$CTINDX  EQU   $DEVUNAD                                                 03003000
@NM00042 EQU   $COMMFLG+15                                              03004000
@NM00041 EQU   $COMMFLG+14                                              03005000
@NM00040 EQU   $COMMFLG+13                                              03006000
@NM00039 EQU   $COMMFLG+12                                              03007000
@NM00038 EQU   $FLAG12                                                  03008000
$VARYINP EQU   $FLAG12                                                  03009000
$ENDTEST EQU   $FLAG12                                                  03010000
$VRYHRD  EQU   $FLAG12                                                  03011000
$VRYSFT  EQU   $FLAG12                                                  03012000
$OPTMSG  EQU   $FLAG12                                                  03013000
@NM00037 EQU   $COMMFLG+10                                              03014000
@NM00036 EQU   $COMMFLG+9                                               03015000
@NM00035 EQU   $COMMFLG+8                                               03016000
$TCECM   EQU   $FLAG8                                                   03017000
$VS2     EQU   $FLAG8                                                   03018000
$VS1     EQU   $FLAG8                                                   03019000
$EDOS    EQU   $FLAG8                                                   03020000
@NM00034 EQU   $FLAG8                                                   03021000
@NM00033 EQU   $FLAG8                                                   03022000
$RCVMSG  EQU   $FLAG7                                                   03023000
$RCVRFLG EQU   $FLAG7                                                   03024000
$LDOIS   EQU   $FLAG7                                                   03025000
$DCONTCT EQU   $FLAG7                                                   03026000
$2NDDATA EQU   $FLAG7                                                   03027000
$1STDATA EQU   $FLAG7                                                   03028000
$ABTERM  EQU   $ABNDBIT                                                 03029000
$FSTMCIS EQU   $FLAG6                                                   03030000
$DISCREQ EQU   $FLAG6                                                   03031000
$DISCISS EQU   $FLAG6                                                   03032000
$CHANGE  EQU   $FLAG6                                                   03033000
$RECAL11 EQU   $FLAG6                                                   03034000
@NM00032 EQU   $FLAG5                                                   03035000
$PROGCK  EQU   $CANCEL                                                  03036000
$PRINTAP EQU   $FLAG5                                                   03037000
@NM00031 EQU   $FLAG5                                                   03038000
$MSG922  EQU   $FLAG5                                                   03039000
$CT924   EQU   $FLAG5                                                   03040000
$FSTCAT  EQU   $FLAG5                                                   03041000
$FSTFE   EQU   $FLAG5                                                   03042000
$ACTOPND EQU   $FLAG4                                                   03043000
$ACQCUTT EQU   $FLAG4                                                   03044000
$CLSSACT EQU   $FLAG4                                                   03045000
$BACKINT EQU   $FLAG4                                                   03046000
$DMSGSW  EQU   $FLAG4                                                   03047000
$TSTDEVP EQU   $FLAG4                                                   03048000
$APRQPER EQU   $FLAG4                                                   03049000
$OPCOM   EQU   $FLAG4                                                   03050000
$NEWAP   EQU   $FLAG3                                                   03051000
$OPTERR  EQU   $FLAG3                                                   03052000
$PRTONLY EQU   $FLAG3                                                   03053000
$REQSTOR EQU   $FLAG3                                                   03054000
$LOGOFFE EQU   $FLAG3                                                   03055000
$TSTERR  EQU   $FLAG3                                                   03056000
$DEVERR  EQU   $FLAG3                                                   03057000
@NM00030 EQU   $COMMFLG+1                                               03058000
@NM00029 EQU   $COMMFLG                                                 03059000
@NM00028 EQU   $CDA+120                                                 03060000
$CUCNT   EQU   $CDA+118                                                 03061000
@NM00027 EQU   $CDA+117                                                 03062000
$PRTFORM EQU   $CDA+116                                                 03063000
$OPISCNT EQU   $CDA+114                                                 03064000
$OPNDCNT EQU   $CDA+112                                                 03065000
$GETMSZE EQU   $CDA+110                                                 03066000
$GRCNTS  EQU   $CDA+108                                                 03067000
$CTLCNT  EQU   $CDA+106                                                 03068000
$ACTLVL  EQU   $CDA+105                                                 03069000
$PRNTLVL EQU   $CDA+104                                                 03070000
$ERRCNTA EQU   $CDA+102                                                 03071000
$TLCNT   EQU   $CDA+100                                                 03072000
$TIMEALW EQU   $CDA+96                                                  03073000
$PTRAREA EQU   $CDA+92                                                  03074000
$GETMPTR EQU   $CDA+88                                                  03075000
$R13PTRT EQU   $CDA+84                                                  03076000
$R13PTR  EQU   $CDA+80                                                  03077000
$TEPEND  EQU   $CDA+76                                                  03078000
$PLINKDL EQU   $CDA+72                                                  03079000
$TEPBEGN EQU   $CDA+68                                                  03080000
$FRELPTR EQU   $CDA+64                                                  03081000
$HIGHADR EQU   $HIMOREC                                                 03082000
$LOMOREC EQU   $CDA+56                                                  03083000
$LOWADDR EQU   $OLTPTR                                                  03084000
$ENDCOMM EQU   $CDA+48                                                  03085000
$COMMON  EQU   $RCA                                                     03086000
$SLASHAD EQU   $CDA+32                                                  03087000
$PASSON  EQU   $CDA+28                                                  03088000
$TOLBRTB EQU   $CDA+24                                                  03089000
$SCTPTR8 EQU   $CDA+20                                                  03090000
$SCTPTR  EQU   $CDA+16                                                  03091000
$TBWDPTR EQU   $CDA+12                                                  03092000
$TFWDPTR EQU   $CDA+8                                                   03093000
@NM00026 EQU   $CDA                                                     03094000
@NM00025 EQU   $SCTTBLE+98                                              03095000
$SCTLWTC EQU   $SCTTBLE+96                                              03096000
$SCTLWTA EQU   $SCTTBLE+92                                              03097000
#EXT     EQU   $SCTTBLE+88                                              03098000
#PASS    EQU   $SCTTBLE+84                                              03099000
#TABLE   EQU   $SCTTBLE+80                                              03100000
#MSGIDAC EQU   $SCTTBLE+78                                              03101000
@NM00024 EQU   $SCTTBLE+71                                              03102000
$RETMASK EQU   $SCTTBLE+70                                              03103000
$R249255 EQU   $ROUTMSK+29                                              03104000
$R241248 EQU   $ROUTMSK+28                                              03105000
$R233240 EQU   $ROUTMSK+27                                              03106000
$R225232 EQU   $ROUTMSK+26                                              03107000
$R217224 EQU   $ROUTMSK+25                                              03108000
$R209216 EQU   $ROUTMSK+24                                              03109000
$R201208 EQU   $ROUTMSK+23                                              03110000
$R193200 EQU   $ROUTMSK+22                                              03111000
$R185192 EQU   $ROUTMSK+21                                              03112000
$R177184 EQU   $ROUTMSK+20                                              03113000
$R169176 EQU   $ROUTMSK+19                                              03114000
$R161168 EQU   $ROUTMSK+18                                              03115000
$R153160 EQU   $ROUTMSK+17                                              03116000
$R145152 EQU   $ROUTMSK+16                                              03117000
$R137144 EQU   $ROUTMSK+15                                              03118000
$R129136 EQU   $ROUTMSK+14                                              03119000
$R121128 EQU   $ROUTMSK+13                                              03120000
$R113120 EQU   $ROUTMSK+12                                              03121000
$R105112 EQU   $ROUTMSK+11                                              03122000
$R097104 EQU   $ROUTMSK+10                                              03123000
$R089096 EQU   $ROUTMSK+9                                               03124000
$R081088 EQU   $ROUTMSK+8                                               03125000
$R073080 EQU   $ROUTMSK+7                                               03126000
$R065072 EQU   $ROUTMSK+6                                               03127000
$R057064 EQU   $ROUTMSK+5                                               03128000
$R049056 EQU   $ROUTMSK+4                                               03129000
$R041048 EQU   $ROUTMSK+3                                               03130000
$R033040 EQU   $ROUTMSK+2                                               03131000
$R025032 EQU   $ROUTMSK+1                                               03132000
$R017024 EQU   $ROUTMSK                                                 03133000
$TOTFLG2 EQU   $SCTTBLE+39                                              03134000
@NM00023 EQU   $TOTFLG1                                                 03135000
@NM00022 EQU   $TOTFLG1                                                 03136000
@NM00021 EQU   $TOTFLG1                                                 03137000
$CURELOD EQU   $TOTFLG1                                                 03138000
@NM00020 EQU   $TOTFLG1                                                 03139000
@NM00019 EQU   $TOTFLG1                                                 03140000
$LINESHR EQU   $TOTFLG1                                                 03141000
@NM00018 EQU   $OLTFLG2                                                 03142000
@NM00017 EQU   $OLTFLG2                                                 03143000
@NM00016 EQU   $OLTFLG2                                                 03144000
@NM00015 EQU   $OLTFLG2                                                 03145000
@NM00014 EQU   $OLTFLG2                                                 03146000
@NM00013 EQU   $OLTFLG2                                                 03147000
@NM00012 EQU   $OLTFLG2                                                 03148000
$TALK    EQU   $OLTFLG2                                                 03149000
$DYCOM   EQU   $OLTFLGS                                                 03150000
@NM00011 EQU   $OLTFLGS                                                 03151000
$TRACE   EQU   $OLTFLGS                                                 03152000
$RETCODE EQU   $OLTFLGS                                                 03153000
$CONTCB  EQU   $OLTFLGS                                                 03154000
$RETAIN  EQU   $OLTFLGS                                                 03155000
$CLEANRT EQU   $OLTFLGS                                                 03156000
$MANINTV EQU   $OLTFLGS                                                 03157000
$OLTSIZE EQU   $SCTTBLE+34                                              03158000
$QSCTMOD EQU   $EXECFLG                                                 03159000
$CTRLMOD EQU   $EXECFLG                                                 03160000
$CLEANUP EQU   $EXECFLG                                                 03161000
$LSTPDEV EQU   $EXECFLG                                                 03162000
$ERRCNT  EQU   $EXECFLG                                                 03163000
$RTNSLCT EQU   $EXECFLG                                                 03164000
$MULTDEV EQU   $EXECFLG                                                 03165000
@NM00010 EQU   $EXECFLG                                                 03166000
$RMSKCNT EQU   $SCTTBLE+32                                              03167000
$SYNAME  EQU   $CDS8T19+4                                               03168000
$EXTSIG  EQU   $CDS8T19+3                                               03169000
$CDFLGS  EQU   $CDS8T19+1                                               03170000
$CDSCNT  EQU   $CDS8T19                                                 03171000
$PDEVDSC EQU   $SCTTBLE+16                                              03172000
$PDEVADR EQU   $SCTTBLE+12                                              03173000
$COMMCN  EQU   $CDSFLGS                                                 03174000
$CUSTSYM EQU   $CDSFLGS                                                 03175000
$TWOCHSW EQU   $CDSFLGS                                                 03176000
$SYMNAME EQU   $CDSFLGS                                                 03177000
$EXTINTC EQU   $CDSFLGS                                                 03178000
$CEVOL   EQU   $CDSFLGS                                                 03179000
$SHARED  EQU   $CDSFLGS                                                 03180000
$FPM     EQU   $CDSFLGS                                                 03181000
$LASTSUB EQU   $PDEVFLG                                                 03182000
@NM00009 EQU   $PDEVFLG                                                 03183000
@NM00008 EQU   $PDEVFLG                                                 03184000
@NM00007 EQU   $PDEVFLG                                                 03185000
$LASTDEV EQU   $PDEVFLG                                                 03186000
@NM00006 EQU   $PDEVFLG                                                 03187000
$EXFILPT EQU   $PDEVFLG                                                 03188000
$FPMOLD  EQU   $PDEVFLG                                                 03189000
$TSSSYM  EQU   $SCTTBLE+8                                               03190000
$SCTLEVL EQU   $SCTTBLE+7                                               03191000
$DRIVER  EQU   $SCTTBLE+6                                               03192000
$RT0916  EQU   $SCTTBLE+5                                               03193000
$RT0108  EQU   $SCTTBLE+4                                               03194000
$LOOPTST EQU   $ERROPT                                                  03195000
$LOOPERR EQU   $ERROPT                                                  03196000
$NERRPRT EQU   $ERROPT                                                  03197000
$NOCNTRL EQU   $ERROPT                                                  03198000
$ALTPRNT EQU   $ERROPT                                                  03199000
$CATERR  EQU   $ERROPT                                                  03200000
$ASTERIK EQU   $ERROPT                                                  03201000
$TESTERR EQU   $ERROPT                                                  03202000
$FSTCOMM EQU   $TESTOPT                                                 03203000
$INDEFLP EQU   $TESTOPT                                                 03204000
$NOPRT   EQU   $TESTOPT                                                 03205000
$PARAPRT EQU   $TESTOPT                                                 03206000
@NM00005 EQU   $TESTOPT                                                 03207000
$ERRLPCT EQU   $SCTTBLE                                                 03208000
$TLTEND  EQU   $RCAAREA+945                                             03209000
$CNSLID  EQU   $RCAAREA+936                                             03210000
@NM00004 EQU   $RCAAREA+605                                             03211000
$VTAMEND EQU   $RCAFLG                                                  03212000
$TPPOSTD EQU   $RCAFLG                                                  03213000
$NEWCT   EQU   $RCAFLG                                                  03214000
$ABNDALL EQU   $RCAFLG                                                  03215000
$CUTESTB EQU   $RCAFLG                                                  03216000
$CONSOLE EQU   $RCAFLG                                                  03217000
$TPLOGON EQU   $RCAFLG                                                  03218000
$UPDATE  EQU   $RCAFLG                                                  03219000
$DEVAREA EQU   $RCAAREA+600                                             03220000
$CTDVAR  EQU   $RCAAREA+596                                             03221000
$BUFFS   EQU   $RCAAREA+464                                             03222000
$TLTNIB  EQU   $CONSTNT+140                                             03223000
$TLTPRPL EQU   $CONSTNT+20                                              03224000
@NM00003 EQU   $CONSTNT+4                                               03225000
@NM00002 EQU   $CONSTNT+2                                               03226000
$USECNT  EQU   $CONSTNT                                                 03227000
$CURRTWA EQU   $POINTER+140                                             03228000
$CTNAME  EQU   $POINTER+132                                             03229000
$CTARGX  EQU   $POINTER+128                                             03230000
$COMINT  EQU   $POINTER+120                                             03231000
$QUEHNDL EQU   $POINTER+116                                             03232000
@NM00001 EQU   $POINTER+36                                              03233000
$RTNPTR  EQU   $POINTER+32                                              03234000
$TLTECB1 EQU   $POINTER+24                                              03235000
$CLEANP  EQU   $POINTER+20                                              03236000
$ABEND   EQU   $POINTER+16                                              03237000
$LSTAREA EQU   $POINTER+12                                              03238000
$FSTAREA EQU   $POINTER+8                                               03239000
$CVTSAVE EQU   $POINTER+4                                               03240000
$TOLTEP  EQU   $POINTER                                                 03241000
$TLTACB  EQU   $RCAAREA                                                 03242000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03243000
@RT00159 EQU   C16C0225                                                 03244000
@RT00168 EQU   C16C0253                                                 03245000
@RT00173 EQU   C16C0100                                                 03246000
@RF00173 EQU   C16C0225                                                 03247000
@RT00189 EQU   C16C0253                                                 03248000
@RT00205 EQU   C16C0075                                                 03249000
@RT00226 EQU   C16C0075                                                 03250000
@RT00274 EQU   C16C0300                                                 03251000
@RT00277 EQU   C16C0300                                                 03252000
@RF00277 EQU   C16C0075                                                 03253000
@RT00280 EQU   C16C0075                                                 03254000
@RC00282 EQU   C16C0300                                                 03255000
@RT00309 EQU   C16C0075                                                 03256000
@RT00312 EQU   C16C0250                                                 03257000
@RT00318 EQU   C16C0075                                                 03258000
@RT00327 EQU   C16C0250                                                 03259000
@RF00327 EQU   C16C0256                                                 03260000
@RF00324 EQU   C16C0075                                                 03261000
@RT00339 EQU   C16C0256                                                 03262000
@RT00367 EQU   C16C1025                                                 03263000
@RF00361 EQU   C16C1050                                                 03264000
@RC00414 EQU   @RC00412                                                 03265000
@RC00419 EQU   @RC00412                                                 03266000
@RC00435 EQU   @RC00434                                                 03267000
@RT00519 EQU   C16C0905                                                 03268000
@PB00007 EQU   @PB00008                                                 03269000
@PB00006 EQU   @PB00007                                                 03270000
@PB00005 EQU   @PB00006                                                 03271000
@PB00004 EQU   @PB00005                                                 03272000
@PB00003 EQU   @PB00004                                                 03273000
@PB00002 EQU   @PB00003                                                 03274000
@ENDDATA EQU   *                                                        03275000
         END   ISTCC016,(C'PLS2035',0702,80232)                         03276000
