         TITLE 'ISTIC00A,PROMPT - IT PROMPTS USER FOR CDS INFO'         00001000
ISTIC00A CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTIC00A  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  ST    @14,12(,@13)                                        0001 00009000
         STM   @00,@12,20(@13)                                     0001 00010000
         BALR  @11,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@11                                         0001 00013000
         ST    @13,@SA00001+4                                      0001 00014000
         LA    @12,@SA00001                                        0001 00015000
         ST    @12,8(,@13)                                         0001 00016000
         LR    @13,@12                                             0001 00017000
         EJECT                                                          00018000
         EJECT                                                          00019000
         EJECT                                                          00020000
I00AC01  DS    0H                                                  0096 00021000
*   I00ACWK=$LOWADDR;               /* SET UP BASE FOR SWITHES       */ 00022000
         L     @15,$LOWADDR(,WAPTR)                                0096 00023000
         ST    @15,I00ACWK                                         0096 00024000
*   CDSWKPTR=I00ACWK+80;            /* SET UP BASE FOR CDS WK        */ 00025000
         AL    @15,@CF00050                                        0097 00026000
         ST    @15,CDSWKPTR                                        0097 00027000
*   TOADRPTR=ADDR(CDSEXARA)+256;    /* SET UP TOADDR BASE            */ 00028000
         LA    @15,CDSEXARA(,@15)                                  0098 00029000
         AL    @15,@CF00084                                        0098 00030000
         ST    @15,TOADRPTR                                        0098 00031000
*   $INBUFR(1:1+LENGTH($INBUFR)-1)='';/* BLANK OUT IN BUFFER ENTER 0099 00032000
*                                      CDS PARM OR PROMPT            */ 00033000
         MVI   $INBUFR(WAPTR),C' '                                 0099 00034000
         MVC   $INBUFR+1(79,WAPTR),$INBUFR(WAPTR)                  0099 00035000
*   IF $COPY='1'B THEN              /* IF THIS IS A COPY REQUEST     */ 00036000
         TM    $COPY(WAPTR),B'00001000'                            0100 00037000
         BO    @RT00100                                            0100 00038000
*     GOTO I00AC01C;                /* THEN BR AROUND                */ 00039000
*                                                                  0101 00040000
*   /*****************************************************************/ 00041000
*   /*                                                               */ 00042000
*   /* TCEC MSGN(580)INCT(61)MSGMSK('80000000'X) INVOKED             */ 00043000
*   /*                                                               */ 00044000
*   /*****************************************************************/ 00045000
*                                                                  0102 00046000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00047000
         OI    $TCECM(WAPTR),B'00000001'                           0102 00048000
*   R1=ADDR($TCA09);                /* SET UP PARM LIST $TR          */ 00049000
         LA    R1,$TCA09                                           0103 00050000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00051000
         L     @15,@CV00781                                        0104 00052000
         BALR  @14,@15                                             0104 00053000
*   DCL                                                            0105 00054000
*     1 $TCA09,                     /* TCEC PARM LIST                */ 00055000
*      2 $TCB09 FIXED(32) INIT(580),/* MSG NUMBER                    */ 00056000
*      2 $TCC09 FIXED(32) INIT(61), /* INCT LEN                      */ 00057000
*      2 $TCD09 BIT(8) INIT('01000000'B),/* FLAG                     */ 00058000
*      2 $TCE09 CHAR(4) INIT('80000000'X);/* MSSAGE MASK             */ 00059000
*   IF PROMPT^=$INBUFR(2:2) THEN    /* IF PROMPT WAS NOT REQUESTED   */ 00060000
         CLC   PROMPT(1),$INBUFR+1(WAPTR)                          0106 00061000
         BNE   @RT00106                                            0106 00062000
*     GOTO I00AC03;                 /* THEN BR AROUND PROMPT RTN     */ 00063000
*   IF $REMSW='1'B                  /* IF THIS IS A REMOTE ADD       */ 00064000
*     THEN                          /* REQUEST THEN PRINT PROMPT     */ 00065000
         TM    $REMSW(WAPTR),B'01000000'                           0108 00066000
         BNO   @RF00108                                            0108 00067000
*     DO;                           /* MESSAGES MINUS THE SYMB NME   */ 00068000
*                                                                  0109 00069000
*       /*************************************************************/ 00070000
*       /*                                                           */ 00071000
*       /* TCEC MSGN(580)MSGMSK('3FDFFC00'X) INVOKED                 */ 00072000
*       /*                                                           */ 00073000
*       /*************************************************************/ 00074000
*                                                                  0110 00075000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00076000
         OI    $TCECM(WAPTR),B'00000001'                           0110 00077000
*       R1=ADDR($TCA10);            /* SET UP PARM LIST $TR          */ 00078000
         LA    R1,$TCA10                                           0111 00079000
*       CALL S20CEC03;              /* CALL TCEC-MULTIPLE LN         */ 00080000
         L     @15,@CV00781                                        0112 00081000
         BALR  @14,@15                                             0112 00082000
*       DCL                                                        0113 00083000
*         1 $TCA10,                 /* TCEC PARM LIST                */ 00084000
*          2 $TCB10 FIXED(32) INIT(580),/* MSG NUMBER                */ 00085000
*          2 $TCC10 FIXED(32) INIT(0),/* INCT LEN                    */ 00086000
*          2 $TCD10 BIT(8) INIT('00000000'B),/* FLAG                 */ 00087000
*          2 $TCE10 CHAR(4) INIT('3FDFFC00'X);/* MSSAGE MASK         */ 00088000
*     END;                                                         0114 00089000
*   ELSE                            /* OTHERWISE PRINT THE PROMPT    */ 00090000
*     DO;                           /* MSG MINUS THE LINE ADR MSG    */ 00091000
*                                                                  0115 00092000
         B     @RC00108                                            0115 00093000
@RF00108 DS    0H                                                  0116 00094000
*       /*************************************************************/ 00095000
*       /*                                                           */ 00096000
*       /* TCEC MSGN(580)MSGMSK('3FBFFC00'X) INVOKED                 */ 00097000
*       /*                                                           */ 00098000
*       /*************************************************************/ 00099000
*                                                                  0116 00100000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00101000
         OI    $TCECM(WAPTR),B'00000001'                           0116 00102000
*       R1=ADDR($TCA11);            /* SET UP PARM LIST $TR          */ 00103000
         LA    R1,$TCA11                                           0117 00104000
*       CALL S20CEC03;              /* CALL TCEC-MULTIPLE LN         */ 00105000
         L     @15,@CV00781                                        0118 00106000
         BALR  @14,@15                                             0118 00107000
*       DCL                                                        0119 00108000
*         1 $TCA11,                 /* TCEC PARM LIST                */ 00109000
*          2 $TCB11 FIXED(32) INIT(580),/* MSG NUMBER                */ 00110000
*          2 $TCC11 FIXED(32) INIT(0),/* INCT LEN                    */ 00111000
*          2 $TCD11 BIT(8) INIT('00000000'B),/* FLAG                 */ 00112000
*          2 $TCE11 CHAR(4) INIT('3FBFFC00'X);/* MSSAGE MASK         */ 00113000
*     END;                                                         0120 00114000
*I00AC01B:                                                         0121 00115000
*   INDX1=HWONE;                    /* SET UP INDEX VALUE            */ 00116000
@RC00108 DS    0H                                                  0121 00117000
I00AC01B MVC   INDX1(2),HWONE                                      0121 00118000
*   GOTO I00AC01;                   /* GO GET CDS PARAMETERS         */ 00119000
         B     I00AC01                                             0122 00120000
*I00AC01C:                                                         0123 00121000
*                                                                  0123 00122000
*   /*****************************************************************/ 00123000
*   /*                                                               */ 00124000
*   /* TCEC MSGN(582)INCT(61)MSGMSK('80000000'X) INVOKED             */ 00125000
*   /*                                                               */ 00126000
*   /*****************************************************************/ 00127000
*                                                                  0123 00128000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00129000
I00AC01C OI    $TCECM(WAPTR),B'00000001'                           0123 00130000
*   R1=ADDR($TCA12);                /* SET UP PARM LIST $TR          */ 00131000
         LA    R1,$TCA12                                           0124 00132000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00133000
         L     @15,@CV00781                                        0125 00134000
         BALR  @14,@15                                             0125 00135000
*   DCL                                                            0126 00136000
*     1 $TCA12,                     /* TCEC PARM LIST                */ 00137000
*      2 $TCB12 FIXED(32) INIT(582),/* MSG NUMBER                    */ 00138000
*      2 $TCC12 FIXED(32) INIT(61), /* INCT LEN                      */ 00139000
*      2 $TCD12 BIT(8) INIT('01000000'B),/* FLAG                     */ 00140000
*      2 $TCE12 CHAR(4) INIT('80000000'X);/* MSSAGE MASK ENTER SYM 0126 00141000
*                                      NME OR CUA                    */ 00142000
*I00AC01D:                                                         0127 00143000
*   INDX1=HWONE;                    /* GET PTR TO ENTRY              */ 00144000
I00AC01D SLR   @15,@15                                             0127 00145000
         ICM   @15,3,HWONE                                         0127 00146000
         STH   @15,INDX1                                           0127 00147000
*   IF $REMSW='1'B                  /* IF THIS IS A REMOTE REQUEST   */ 00148000
*     THEN                                                         0128 00149000
         TM    $REMSW(WAPTR),B'01000000'                           0128 00150000
         BNO   @RF00128                                            0128 00151000
*     DO;                           /* THEN VALIDITY CK ENTRY        */ 00152000
*       IF $INBUFR(INDX1+1:INDX1+LENGTH(SYMNME))=SYMNME THEN       0130 00153000
         ALR   @15,WAPTR                                           0130 00154000
         CLC   $INBUFR(3,@15),SYMNME                               0130 00155000
         BE    @RT00130                                            0130 00156000
*         GOTO I00AC09A;                                           0131 00157000
*                                                                  0131 00158000
*       /*************************************************************/ 00159000
*       /*                                                           */ 00160000
*       /* TCEC MSGN(581)MSGMSK('02000000'X) INVOKED                 */ 00161000
*       /*                                                           */ 00162000
*       /*************************************************************/ 00163000
*                                                                  0132 00164000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00165000
         OI    $TCECM(WAPTR),B'00000001'                           0132 00166000
*       R1=ADDR($TCA13);            /* SET UP PARM LIST $TR          */ 00167000
         LA    R1,$TCA13                                           0133 00168000
*       CALL S20CEC03;              /* CALL TCEC-MULTIPLE LN         */ 00169000
         L     @15,@CV00781                                        0134 00170000
         BALR  @14,@15                                             0134 00171000
*       DCL                                                        0135 00172000
*         1 $TCA13,                 /* TCEC PARM LIST                */ 00173000
*          2 $TCB13 FIXED(32) INIT(581),/* MSG NUMBER                */ 00174000
*          2 $TCC13 FIXED(32) INIT(0),/* INCT LEN                    */ 00175000
*          2 $TCD13 BIT(8) INIT('00000000'B),/* FLAG                 */ 00176000
*          2 $TCE13 CHAR(4) INIT('02000000'X);/* MSSAGE MASK INVALID    00177000
*                                      ENTRY                         */ 00178000
*       GOTO I00AC01;               /* BR BACK AND TRY AGAIN         */ 00179000
         B     I00AC01                                             0136 00180000
*     END;                                                         0137 00181000
*   ELSE                                                           0138 00182000
*     DO;                           /* VALIDITY CK CUA ENTRY         */ 00183000
@RF00128 DS    0H                                                  0139 00184000
*       IF $INBUFR(INDX1+1:INDX1+LENGTH(UADR))=UADR THEN           0139 00185000
         LH    @15,INDX1                                           0139 00186000
         N     @15,@CF00965                                        0139 00187000
         ALR   @15,WAPTR                                           0139 00188000
         CLC   $INBUFR(3,@15),UADR                                 0139 00189000
         BE    @RT00139                                            0139 00190000
*         GOTO I00AC08A;            /* IF OK THEN BR AROUND          */ 00191000
*                                                                  0140 00192000
*       /*************************************************************/ 00193000
*       /*                                                           */ 00194000
*       /* TCEC MSGN(581)MSGMSK('04000000'X) INVOKED                 */ 00195000
*       /*                                                           */ 00196000
*       /*************************************************************/ 00197000
*                                                                  0141 00198000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00199000
         OI    $TCECM(WAPTR),B'00000001'                           0141 00200000
*       R1=ADDR($TCA14);            /* SET UP PARM LIST $TR          */ 00201000
         LA    R1,$TCA14                                           0142 00202000
*       CALL S20CEC03;              /* CALL TCEC-MULTIPLE LN         */ 00203000
         L     @15,@CV00781                                        0143 00204000
         BALR  @14,@15                                             0143 00205000
*       DCL                                                        0144 00206000
*         1 $TCA14,                 /* TCEC PARM LIST                */ 00207000
*          2 $TCB14 FIXED(32) INIT(581),/* MSG NUMBER                */ 00208000
*          2 $TCC14 FIXED(32) INIT(0),/* INCT LEN                    */ 00209000
*          2 $TCD14 BIT(8) INIT('00000000'B),/* FLAG                 */ 00210000
*          2 $TCE14 CHAR(4) INIT('04000000'X);/* MSSAGE MASK INVALID    00211000
*                                      ENTRY                         */ 00212000
*       GOTO I00AC01;               /* BR BACK AND TRY AGAIN         */ 00213000
         B     I00AC01                                             0145 00214000
*     END;                                                         0146 00215000
*   GEN(EJECT);                                                    0147 00216000
         EJECT                                                          00217000
*I00AC02:                           /* CONTINUE ENTER'G CDS DATA     */ 00218000
*   $INBUFR(1:1+LENGTH($INBUFR)-1)='';/* ZERO OUT BUFFER             */ 00219000
*                                                                  0148 00220000
I00AC02  MVI   $INBUFR(WAPTR),C' '                                 0148 00221000
         MVC   $INBUFR+1(79,WAPTR),$INBUFR(WAPTR)                  0148 00222000
*   /*****************************************************************/ 00223000
*   /*                                                               */ 00224000
*   /* TCEC MSGN(580)INCT(61)MSGMSK('40000000'X) INVOKED             */ 00225000
*   /*                                                               */ 00226000
*   /*****************************************************************/ 00227000
*                                                                  0149 00228000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00229000
         OI    $TCECM(WAPTR),B'00000001'                           0149 00230000
*   R1=ADDR($TCA15);                /* SET UP PARM LIST $TR          */ 00231000
         LA    R1,$TCA15                                           0150 00232000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00233000
         L     @15,@CV00781                                        0151 00234000
         BALR  @14,@15                                             0151 00235000
*   DCL                                                            0152 00236000
*     1 $TCA15,                     /* TCEC PARM LIST                */ 00237000
*      2 $TCB15 FIXED(32) INIT(580),/* MSG NUMBER                    */ 00238000
*      2 $TCC15 FIXED(32) INIT(61), /* INCT LEN                      */ 00239000
*      2 $TCD15 BIT(8) INIT('01000000'B),/* FLAG                     */ 00240000
*      2 $TCE15 CHAR(4) INIT('40000000'X);/* MSSAGE MASK             */ 00241000
*I00AC03:                                                          0153 00242000
*   INDX1=HWONE;                    /* SET UP INDEX VALUE            */ 00243000
I00AC03  MVC   INDX1(2),HWONE                                      0153 00244000
*I00AC03A:                                                         0154 00245000
*   IF $INBUFR(INDX1+1:INDX1+LENGTH(MODEL))^=MODEL THEN            0154 00246000
I00AC03A LH    @15,INDX1                                           0154 00247000
         N     @15,@CF00965                                        0154 00248000
         ALR   @15,WAPTR                                           0154 00249000
         CLC   $INBUFR(2,@15),MODEL                                0154 00250000
         BNE   @RT00154                                            0154 00251000
*     GOTO I00AC04;                 /* IF NOT MODEL ENTRY-BR         */ 00252000
*   GEN(BAL LINKR,I00ACLEN);        /* GO GET LENGTH OF MODEL I/P    */ 00253000
         BAL LINKR,I00ACLEN                                             00254000
*   IF IPLEN^=MLNGTH THEN           /* IF IT DOESN'T = EXPECTED      */ 00255000
         CLC   IPLEN(1),MLNGTH                                     0157 00256000
         BNE   @RT00157                                            0157 00257000
*     GOTO I00AC03B;                /* THEN BR AND PRINT ERROR       */ 00258000
*   GEN(BAL LINKR,I00ACONV);        /* OTHERWISE CONVERT IT          */ 00259000
         BAL LINKR,I00ACONV                                             00260000
*   IF R15^=0 THEN                  /* IF IT DID NOT CNV OK THEN     */ 00261000
         LTR   R15,R15                                             0160 00262000
         BNZ   @RT00160                                            0160 00263000
*     GOTO I00AC03B;                /* WE MUST HAVE INVALID I/P-BR   */ 00264000
*   CDSMODEL=TOADR(1:1);            /* SET UP MODEL FLD-CNV OK       */ 00265000
         L     @15,TOADRPTR                                        0162 00266000
         IC    @12,TOADR(,@15)                                     0162 00267000
         L     @15,CDSWKPTR                                        0162 00268000
         STC   @12,CDSMODEL(,@15)                                  0162 00269000
*   IF CONTSCAN='0'B THEN           /* IF CONT SCAN SW IS NOT ON     */ 00270000
         L     @15,I00ACWK                                         0163 00271000
         TM    CONTSCAN(@15),B'10000000'                           0163 00272000
         BZ    @RT00163                                            0163 00273000
*     GOTO I00AC02;                 /* THEN GO GET NXT LINE DATA     */ 00274000
*   CONTSCAN='0'B;                  /* OTHERWISE RESET SWITCH AND    */ 00275000
         NI    CONTSCAN(@15),B'01111111'                           0165 00276000
*   GOTO I00AC03A;                  /* CONTINUE ON                   */ 00277000
         B     I00AC03A                                            0166 00278000
*I00AC03B:                                                         0167 00279000
*                                                                  0167 00280000
*   /*****************************************************************/ 00281000
*   /*                                                               */ 00282000
*   /* TCEC MSGN(581)MSGMSK('80000000'X) INVOKED                     */ 00283000
*   /*                                                               */ 00284000
*   /*****************************************************************/ 00285000
*                                                                  0167 00286000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00287000
I00AC03B OI    $TCECM(WAPTR),B'00000001'                           0167 00288000
*   R1=ADDR($TCA16);                /* SET UP PARM LIST $TR          */ 00289000
         LA    R1,$TCA16                                           0168 00290000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00291000
         L     @15,@CV00781                                        0169 00292000
         BALR  @14,@15                                             0169 00293000
*   DCL                                                            0170 00294000
*     1 $TCA16,                     /* TCEC PARM LIST                */ 00295000
*      2 $TCB16 FIXED(32) INIT(581),/* MSG NUMBER                    */ 00296000
*      2 $TCC16 FIXED(32) INIT(0),  /* INCT LEN                      */ 00297000
*      2 $TCD16 BIT(8) INIT('00000000'B),/* FLAG                     */ 00298000
*      2 $TCE16 CHAR(4) INIT('80000000'X);/* MSSAGE MASK INVALID   0170 00299000
*                                      MODEL FLD                     */ 00300000
*   GOTO I00AC01;                   /* GO GET ENTIRE LAST LINE       */ 00301000
         B     I00AC01                                             0171 00302000
*I00AC04:                                                          0172 00303000
*   IF $INBUFR(INDX1+1:INDX1+LENGTH(FEAT))^=FEAT THEN              0172 00304000
I00AC04  LH    @15,INDX1                                           0172 00305000
         N     @15,@CF00965                                        0172 00306000
         ALR   @15,WAPTR                                           0172 00307000
         CLC   $INBUFR(2,@15),FEAT                                 0172 00308000
         BNE   @RT00172                                            0172 00309000
*     GOTO I00AC05;                 /* IF NOT FEAT ENTRY BE          */ 00310000
*   GEN(BAL LINKR,I00ACLEN);        /* GO GET LENGTH OF FEAT I/P     */ 00311000
         BAL LINKR,I00ACLEN                                             00312000
*   IF IPLEN^=FLNGTH THEN           /* IF IT DOESN'T = EXPECTED      */ 00313000
         CLC   IPLEN(1),FLNGTH                                     0175 00314000
         BNE   @RT00175                                            0175 00315000
*     GOTO I00AC04A;                /* THEN BR AND PRINT ERROR       */ 00316000
*   GEN(BAL LINKR,I00ACONV);        /* OTHERWISE CONVERT IT          */ 00317000
         BAL LINKR,I00ACONV                                             00318000
*   IF R15^=0 THEN                  /* IF IT DID NOT CNV OK THEN     */ 00319000
         LTR   R15,R15                                             0178 00320000
         BNZ   @RT00178                                            0178 00321000
*     GOTO I00AC04A;                /* WE MUST HAVE INVALID I/P-BR   */ 00322000
*   CDSFEAT=TOADR(1:1);             /* SET UP REATURE FLD-CNV OK     */ 00323000
         L     @15,TOADRPTR                                        0180 00324000
         IC    @12,TOADR(,@15)                                     0180 00325000
         L     @15,CDSWKPTR                                        0180 00326000
         STC   @12,CDSFEAT(,@15)                                   0180 00327000
*   IF CONTSCAN='0'B THEN           /* IF CONT SCAN SW IS NOT ON     */ 00328000
         L     @15,I00ACWK                                         0181 00329000
         TM    CONTSCAN(@15),B'10000000'                           0181 00330000
         BZ    @RT00181                                            0181 00331000
*     GOTO I00AC02;                 /* THEN GO GET NXT LINE DATA     */ 00332000
*   CONTSCAN='0'B;                  /* OTHERWISE RESET SWITCH AND    */ 00333000
         NI    CONTSCAN(@15),B'01111111'                           0183 00334000
*   GOTO I00AC03A;                  /* CONTINUE ON                   */ 00335000
         B     I00AC03A                                            0184 00336000
*I00AC04A:                                                         0185 00337000
*                                                                  0185 00338000
*   /*****************************************************************/ 00339000
*   /*                                                               */ 00340000
*   /* TCEC MSGN(581)MSGMSK('40000000'X) INVOKED                     */ 00341000
*   /*                                                               */ 00342000
*   /*****************************************************************/ 00343000
*                                                                  0185 00344000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00345000
I00AC04A OI    $TCECM(WAPTR),B'00000001'                           0185 00346000
*   R1=ADDR($TCA17);                /* SET UP PARM LIST $TR          */ 00347000
         LA    R1,$TCA17                                           0186 00348000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00349000
         L     @15,@CV00781                                        0187 00350000
         BALR  @14,@15                                             0187 00351000
*   DCL                                                            0188 00352000
*     1 $TCA17,                     /* TCEC PARM LIST                */ 00353000
*      2 $TCB17 FIXED(32) INIT(581),/* MSG NUMBER                    */ 00354000
*      2 $TCC17 FIXED(32) INIT(0),  /* INCT LEN                      */ 00355000
*      2 $TCD17 BIT(8) INIT('00000000'B),/* FLAG                     */ 00356000
*      2 $TCE17 CHAR(4) INIT('40000000'X);/* MSSAGE MASK INVALID FEAT   00357000
*                                      FLD                           */ 00358000
*   GOTO I00AC01;                   /* GO GET ENTIRE LAST LINE       */ 00359000
         B     I00AC01                                             0189 00360000
*I00AC05:                                                          0190 00361000
*   IF $INBUFR(INDX1+1:INDX1+LENGTH(CLASS))^=CLASS THEN            0190 00362000
I00AC05  LH    @15,INDX1                                           0190 00363000
         N     @15,@CF00965                                        0190 00364000
         ALR   @15,WAPTR                                           0190 00365000
         CLC   $INBUFR(2,@15),CLASS                                0190 00366000
         BNE   @RT00190                                            0190 00367000
*     GOTO I00AC06;                 /* IF NOT CLASS ENTRY - BR       */ 00368000
*   GEN(BAL LINKR,I00ACLEN);        /* GO GET LENGTH OF FEAT I/P     */ 00369000
         BAL LINKR,I00ACLEN                                             00370000
*   IF IPLEN^=CLNGTH THEN           /* IF IT DOESN'T = EXPECTED      */ 00371000
         CLC   IPLEN(1),CLNGTH                                     0193 00372000
         BNE   @RT00193                                            0193 00373000
*     GOTO I00AC05A;                /* THEN BR AND PRINT ERROR       */ 00374000
*   GEN(BAL LINKR,I00ACONV);        /* OTHERWISE CONVERT IT          */ 00375000
         BAL LINKR,I00ACONV                                             00376000
*   IF R15^=0 THEN                  /* IF IT DID NOT CNV OK THEN     */ 00377000
         LTR   R15,R15                                             0196 00378000
         BNZ   @RT00196                                            0196 00379000
*     GOTO I00AC05A;                /* WE MUST HAVE INVALID I/P-BR   */ 00380000
*   CDSCLASS=TOADR(1:1);            /* SET UP CLASS FLD-CONV OK      */ 00381000
         L     @15,TOADRPTR                                        0198 00382000
         IC    @12,TOADR(,@15)                                     0198 00383000
         L     @15,CDSWKPTR                                        0198 00384000
         STC   @12,CDSCLASS(,@15)                                  0198 00385000
*   CLASSSW='1'B;                   /* TURN ON CLASS SW              */ 00386000
         L     @15,I00ACWK                                         0199 00387000
         OI    CLASSSW(@15),B'01000000'                            0199 00388000
*   IF CONTSCAN='0'B THEN           /* IF CONT SCAN SW IS NOT ON     */ 00389000
         TM    CONTSCAN(@15),B'10000000'                           0200 00390000
         BZ    @RT00200                                            0200 00391000
*     GOTO I00AC02;                 /* THEN GO GET NXT LINE DATA     */ 00392000
*   CONTSCAN='0'B;                  /* OTHERWISE RESET SWITCH AND    */ 00393000
         NI    CONTSCAN(@15),B'01111111'                           0202 00394000
*   GOTO I00AC03A;                  /* CONTINUE ON                   */ 00395000
         B     I00AC03A                                            0203 00396000
*I00AC05A:                                                         0204 00397000
*                                                                  0204 00398000
*   /*****************************************************************/ 00399000
*   /*                                                               */ 00400000
*   /* TCEC MSGN(581)MSGMSK('20000000'X) INVOKED                     */ 00401000
*   /*                                                               */ 00402000
*   /*****************************************************************/ 00403000
*                                                                  0204 00404000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00405000
I00AC05A OI    $TCECM(WAPTR),B'00000001'                           0204 00406000
*   R1=ADDR($TCA18);                /* SET UP PARM LIST $TR          */ 00407000
         LA    R1,$TCA18                                           0205 00408000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00409000
         L     @15,@CV00781                                        0206 00410000
         BALR  @14,@15                                             0206 00411000
*   DCL                                                            0207 00412000
*     1 $TCA18,                     /* TCEC PARM LIST                */ 00413000
*      2 $TCB18 FIXED(32) INIT(581),/* MSG NUMBER                    */ 00414000
*      2 $TCC18 FIXED(32) INIT(0),  /* INCT LEN                      */ 00415000
*      2 $TCD18 BIT(8) INIT('00000000'B),/* FLAG                     */ 00416000
*      2 $TCE18 CHAR(4) INIT('20000000'X);/* MSSAGE MASK INVALID   0207 00417000
*                                      CLASS FLD                     */ 00418000
*   GOTO I00AC01;                   /* GO GET ENTIRE LAST LINE       */ 00419000
         B     I00AC01                                             0208 00420000
*I00AC06:                                                          0209 00421000
*   IF $INBUFR(INDX1+1:INDX1+LENGTH(TYPE))^=TYPE THEN              0209 00422000
I00AC06  LH    @15,INDX1                                           0209 00423000
         N     @15,@CF00965                                        0209 00424000
         ALR   @15,WAPTR                                           0209 00425000
         CLC   $INBUFR(2,@15),TYPE                                 0209 00426000
         BNE   @RT00209                                            0209 00427000
*     GOTO I00AC07;                 /* IF NOT TYPE ENTRY - BR        */ 00428000
*   GEN(BAL LINKR,I00ACLEN);        /* GO GET LENGTH OF TYPE I/P     */ 00429000
         BAL LINKR,I00ACLEN                                             00430000
*   IF IPLEN^=TLNGTH THEN           /* IF IT DOESN'T = EXPECTED      */ 00431000
         CLC   IPLEN(1),TLNGTH                                     0212 00432000
         BNE   @RT00212                                            0212 00433000
*     GOTO I00AC06A;                /* THEN BR AND PRINT ERROR       */ 00434000
*   GEN(BAL LINKR,I00ACONV);        /* OTHERWISE CONVERT IT          */ 00435000
         BAL LINKR,I00ACONV                                             00436000
*   IF R15^=0 THEN                  /* IF IT DID NOT CNV OK THE      */ 00437000
         LTR   R15,R15                                             0215 00438000
         BNZ   @RT00215                                            0215 00439000
*     GOTO I00AC06A;                /* WE MUST HAVE INVALID I/P-BR   */ 00440000
*   CDSTYPE=TOADR(1:1);             /* SET UP TYPE FLD-CONV OK       */ 00441000
         L     @15,TOADRPTR                                        0217 00442000
         IC    @12,TOADR(,@15)                                     0217 00443000
         L     @15,CDSWKPTR                                        0217 00444000
         STC   @12,CDSTYPE(,@15)                                   0217 00445000
*   TYPESW='1'B;                    /* TURN ON TYPE SW               */ 00446000
         L     @15,I00ACWK                                         0218 00447000
         OI    TYPESW(@15),B'00100000'                             0218 00448000
*   IF CONTSCAN='0'B THEN           /* IF CONT SCAN SW IS NOT ON     */ 00449000
         TM    CONTSCAN(@15),B'10000000'                           0219 00450000
         BZ    @RT00219                                            0219 00451000
*     GOTO I00AC02;                 /* THEN GO GET NXT LINE DATA     */ 00452000
*   CONTSCAN='0'B;                  /* OTHERWISE RESET SWITCH AND    */ 00453000
         NI    CONTSCAN(@15),B'01111111'                           0221 00454000
*   GOTO I00AC03A;                  /* CONTINUE ON                   */ 00455000
         B     I00AC03A                                            0222 00456000
*I00AC06A:                                                         0223 00457000
*                                                                  0223 00458000
*   /*****************************************************************/ 00459000
*   /*                                                               */ 00460000
*   /* TCEC MSGN(581)MSGMSK('10000000'X) INVOKED                     */ 00461000
*   /*                                                               */ 00462000
*   /*****************************************************************/ 00463000
*                                                                  0223 00464000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00465000
I00AC06A OI    $TCECM(WAPTR),B'00000001'                           0223 00466000
*   R1=ADDR($TCA19);                /* SET UP PARM LIST $TR          */ 00467000
         LA    R1,$TCA19                                           0224 00468000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00469000
         L     @15,@CV00781                                        0225 00470000
         BALR  @14,@15                                             0225 00471000
*   DCL                                                            0226 00472000
*     1 $TCA19,                     /* TCEC PARM LIST                */ 00473000
*      2 $TCB19 FIXED(32) INIT(581),/* MSG NUMBER                    */ 00474000
*      2 $TCC19 FIXED(32) INIT(0),  /* INCT LEN                      */ 00475000
*      2 $TCD19 BIT(8) INIT('00000000'B),/* FLAG                     */ 00476000
*      2 $TCE19 CHAR(4) INIT('10000000'X);/* MSSAGE MASK INVALID TYPE   00477000
*                                      FLD                           */ 00478000
*   GOTO I00AC01;                   /* GO GET ENTIRE LAST LINE       */ 00479000
         B     I00AC01                                             0227 00480000
*I00AC07:                                                          0228 00481000
*   IF $INBUFR(INDX1+1:INDX1+LENGTH(FLAGS))^=FLAGS THEN            0228 00482000
I00AC07  LH    @15,INDX1                                           0228 00483000
         N     @15,@CF00965                                        0228 00484000
         ALR   @15,WAPTR                                           0228 00485000
         CLC   $INBUFR(3,@15),FLAGS                                0228 00486000
         BNE   @RT00228                                            0228 00487000
*     GOTO I00AC08;                 /* IF NOT FLAG ENTRY BR          */ 00488000
*   GEN(BAL LINKR,I00ACLEN);        /* GO GET LENGTH OF FLAG ENTRY   */ 00489000
         BAL LINKR,I00ACLEN                                             00490000
*   IF IPLEN^=FLGLNGTH THEN         /* IF IT DOESN'T EQ EXPECTED     */ 00491000
         CLC   IPLEN(1),FLGLNGTH                                   0231 00492000
         BNE   @RT00231                                            0231 00493000
*     GOTO I00AC07A;                /* THEN BR AND PRINT ERROR       */ 00494000
*   GEN(BAL LINKR,I00ACONV);        /* OTHERWISE CONVERT IT          */ 00495000
         BAL LINKR,I00ACONV                                             00496000
*   IF R15^=0 THEN                  /* IF IT DID NOT CONV OK THEN    */ 00497000
         LTR   R15,R15                                             0234 00498000
         BNZ   @RT00234                                            0234 00499000
*     GOTO I00AC07A;                /* WE MUST HAVE INVALID I/P-BR   */ 00500000
*   CDSFLAG=TOADR(1:3);             /* CONV OK-SET UP FLAG FLO       */ 00501000
         L     @15,CDSWKPTR                                        0236 00502000
         L     @12,TOADRPTR                                        0236 00503000
         MVC   CDSFLAG(3,@15),TOADR(@12)                           0236 00504000
*   FLAGSW='1'B;                    /* TURN ON FLAG SW               */ 00505000
         L     @15,I00ACWK                                         0237 00506000
         OI    FLAGSW(@15),B'00010000'                             0237 00507000
*   IF CONTSCAN='0'B THEN           /* IF CONT SCAN SW IS NOT ON     */ 00508000
         TM    CONTSCAN(@15),B'10000000'                           0238 00509000
         BZ    @RT00238                                            0238 00510000
*     GOTO I00AC02;                 /* THEN GO GET NXT LINE DATA     */ 00511000
*   CONTSCAN='0'B;                  /* OTHERWISE RESET SWITCH AND    */ 00512000
         NI    CONTSCAN(@15),B'01111111'                           0240 00513000
*   GOTO I00AC03A;                  /* CONTINUE ON                   */ 00514000
         B     I00AC03A                                            0241 00515000
*I00AC07A:                                                         0242 00516000
*                                                                  0242 00517000
*   /*****************************************************************/ 00518000
*   /*                                                               */ 00519000
*   /* TCEC MSGN(581)MSGMSK('08000000'X) INVOKED                     */ 00520000
*   /*                                                               */ 00521000
*   /*****************************************************************/ 00522000
*                                                                  0242 00523000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00524000
I00AC07A OI    $TCECM(WAPTR),B'00000001'                           0242 00525000
*   R1=ADDR($TCA20);                /* SET UP PARM LIST $TR          */ 00526000
         LA    R1,$TCA20                                           0243 00527000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00528000
         L     @15,@CV00781                                        0244 00529000
         BALR  @14,@15                                             0244 00530000
*   DCL                                                            0245 00531000
*     1 $TCA20,                     /* TCEC PARM LIST                */ 00532000
*      2 $TCB20 FIXED(32) INIT(581),/* MSG NUMBER                    */ 00533000
*      2 $TCC20 FIXED(32) INIT(0),  /* INCT LEN                      */ 00534000
*      2 $TCD20 BIT(8) INIT('00000000'B),/* FLAG                     */ 00535000
*      2 $TCE20 CHAR(4) INIT('08000000'X);/* MSSAGE MASK INVALID FLAG   00536000
*                                      FLD                           */ 00537000
*   GOTO I00AC01;                   /* GO GET ENTIRE LAST LINE       */ 00538000
         B     I00AC01                                             0246 00539000
*I00AC08:                                                          0247 00540000
*   IF $INBUFR(INDX1+1:INDX1+LENGTH(UADR))^=UADR THEN              0247 00541000
I00AC08  LH    @15,INDX1                                           0247 00542000
         N     @15,@CF00965                                        0247 00543000
         ALR   @15,WAPTR                                           0247 00544000
         CLC   $INBUFR(3,@15),UADR                                 0247 00545000
         BNE   @RT00247                                            0247 00546000
*     GOTO I00AC09;                 /* IF NOT UNIT ADR ENTRY-BR      */ 00547000
*   IF $REMSW='0'B THEN             /* IF NOT A REMOTE REQUEST       */ 00548000
         TM    $REMSW(WAPTR),B'01000000'                           0249 00549000
         BZ    @RT00249                                            0249 00550000
*     GOTO I00AC08B;                /* THEN PRINT INVALID ENTRY      */ 00551000
*I00AC08A:                                                         0251 00552000
*   GEN(BAL LINKR,I00ACLEN);        /* GO GET LENGTH OF UA ENTRY     */ 00553000
I00AC08A BAL LINKR,I00ACLEN                                             00554000
*   IF IPLEN=UALNGTH                /* IF 4 DIGITS INPUT             */ 00555000
*     THEN                          /* THEN                          */ 00556000
         CLC   IPLEN(1),UALNGTH                                    0252 00557000
         BE    @RT00252                                            0252 00558000
*     GOTO I00AC081;                /* GO CONVERT IT AS IS           */ 00559000
*   IF IPLEN^=3                     /* IF NOT 3 OR 4 CHAR ENTERED    */ 00560000
*     THEN                          /* THEN                          */ 00561000
         CLI   IPLEN,3                                             0254 00562000
         BNE   @RT00254                                            0254 00563000
*     GOTO I00AC08B;                /* PRINT ERROR                   */ 00564000
*   IPLEN=4;                        /* SET LENGTH FOR 4 CHARS      0256 00565000
*                                                            @OX05734*/ 00566000
         MVI   IPLEN,X'04'                                         0256 00567000
*   FRADRPTR=FRADRPTR-1;            /* ELSE BACK UP PTR TO = SIGN    */ 00568000
         L     @15,FRADRPTR                                        0257 00569000
         BCTR  @15,0                                               0257 00570000
         ST    @15,FRADRPTR                                        0257 00571000
*   FRADR(1:1)='F0'X;               /* OVERLAY EQU SIGN WITH 0     0258 00572000
*                                                            @OX05734*/ 00573000
         MVI   FRADR(@15),X'F0'                                    0258 00574000
*I00AC081:                                                         0259 00575000
*   GEN(BAL LINKR,I00ACONV);        /* OTHERWISE CONVERT IT          */ 00576000
I00AC081 BAL LINKR,I00ACONV                                             00577000
*   IF R15^=0 THEN                  /* IF IT DID NOT CNV OK THEN     */ 00578000
         LTR   R15,R15                                             0260 00579000
         BNZ   @RT00260                                            0260 00580000
*     GOTO I00AC08B;                /* WE MUST HAVE INVALID I/P-BR   */ 00581000
*   GEN(XC CDSWORK,CDSWORK);        /* ZERO OUT CDS WORK AREA        */ 00582000
         XC CDSWORK,CDSWORK                                             00583000
*   CDSWORK(3:4)=TOADR(1:2);        /* GET CONVERTED 2-BYTE ADDR     */ 00584000
         L     @15,TOADRPTR                                        0263 00585000
         MVC   CDSWORK+2(2),TOADR(@15)                             0263 00586000
*   CDSUA=CDSWORK(1:4);             /* SET UP 4-BYTE ADDR            */ 00587000
         L     @15,CDSWKPTR                                        0264 00588000
         MVC   CDSUA(4,@15),CDSWORK                                0264 00589000
*   IF $COPY='1'B                   /* IF THIS IS A COPY REQUEST     */ 00590000
*     THEN                          /* THEN DO THE FOLLOWING         */ 00591000
         TM    $COPY(WAPTR),B'00001000'                            0265 00592000
         BNO   @RF00265                                            0265 00593000
*     DO;                                                          0266 00594000
*       R1=ADDR(VERYTBL);           /* SET UP PARM LIST PTR          */ 00595000
         LA    R1,VERYTBL                                          0267 00596000
*       CDSPTR=ADDR(CDSUA);         /* GET PTR TO CDS DATA           */ 00597000
         ST    @15,CDSPTR                                          0268 00598000
*       CALL ISTSC030;              /* GO VERIFY CDS ADDR-VTAM       */ 00599000
         L     @15,@CV00896                                        0269 00600000
         BALR  @14,@15                                             0269 00601000
*       IF R15^=0 THEN              /* IF RET CODE DOESN'T EQ ZERO   */ 00602000
         LTR   R15,R15                                             0270 00603000
         BNZ   @RT00270                                            0270 00604000
*         GOTO I00AC08B;            /* INVALID ENTRY - ERROR         */ 00605000
*       RETURN;                     /* RETURN TO CALLER              */ 00606000
@EL00001 L     @13,4(,@13)                                         0272 00607000
@EF00001 DS    0H                                                  0272 00608000
@ER00001 L     @14,12(,@13)                                        0272 00609000
         LM    @00,@12,20(@13)                                     0272 00610000
         BR    @14                                                 0272 00611000
*     END;                                                         0273 00612000
*   UASW='1'B;                      /* TURN ON UNIT ADR SW           */ 00613000
@RF00265 L     @15,I00ACWK                                         0274 00614000
         OI    UASW(@15),B'00001000'                               0274 00615000
*   IF CONTSCAN='0'B THEN           /* IF CONT SCAN SWITCH IS OFF    */ 00616000
         TM    CONTSCAN(@15),B'10000000'                           0275 00617000
         BZ    @RT00275                                            0275 00618000
*     GOTO I00AC02;                 /* THEN GO GET NXT LINE          */ 00619000
*   CONTSCAN='0'B;                  /* OTHERWISE RESET IT AND        */ 00620000
         NI    CONTSCAN(@15),B'01111111'                           0277 00621000
*   GOTO I00AC03A;                  /* CONTINUE ON                   */ 00622000
         B     I00AC03A                                            0278 00623000
*I00AC08B:                                                         0279 00624000
*                                                                  0279 00625000
*   /*****************************************************************/ 00626000
*   /*                                                               */ 00627000
*   /* TCEC MSGN(581)MSGMSK('04000000'X) INVOKED                     */ 00628000
*   /*                                                               */ 00629000
*   /*****************************************************************/ 00630000
*                                                                  0279 00631000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00632000
I00AC08B OI    $TCECM(WAPTR),B'00000001'                           0279 00633000
*   R1=ADDR($TCA21);                /* SET UP PARM LIST $TR          */ 00634000
         LA    R1,$TCA21                                           0280 00635000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00636000
         L     @15,@CV00781                                        0281 00637000
         BALR  @14,@15                                             0281 00638000
*   DCL                                                            0282 00639000
*     1 $TCA21,                     /* TCEC PARM LIST                */ 00640000
*      2 $TCB21 FIXED(32) INIT(581),/* MSG NUMBER                    */ 00641000
*      2 $TCC21 FIXED(32) INIT(0),  /* INCT LEN                      */ 00642000
*      2 $TCD21 BIT(8) INIT('00000000'B),/* FLAG                     */ 00643000
*      2 $TCE21 CHAR(4) INIT('04000000'X);/* MSSAGE MASK INVALID UNIT   00644000
*                                      ADR FLD                       */ 00645000
*   IF $COPY='1'B THEN              /* IF THIS IS A COPY REQUEST     */ 00646000
         TM    $COPY(WAPTR),B'00001000'                            0283 00647000
         BO    @RT00283                                            0283 00648000
*     GOTO I00AC01C;                /* THEN GO GET NAME AGAIN        */ 00649000
*   GOTO I00AC01;                   /* GO GET ENTIRE LAST LINE       */ 00650000
         B     I00AC01                                             0285 00651000
*I00AC09:                                                          0286 00652000
*   IF $INBUFR(INDX1+1:INDX1+LENGTH(SYMNME))^=SYMNME THEN          0286 00653000
I00AC09  LH    @15,INDX1                                           0286 00654000
         N     @15,@CF00965                                        0286 00655000
         ALR   @15,WAPTR                                           0286 00656000
         CLC   $INBUFR(3,@15),SYMNME                               0286 00657000
         BNE   @RT00286                                            0286 00658000
*     GOTO I00AC0A;                 /* IF NOT SYMB NEM ENTRY-BR      */ 00659000
*   IF $REMSW='1'B THEN             /* IF ITS A REMOTE REQUEST       */ 00660000
         TM    $REMSW(WAPTR),B'01000000'                           0288 00661000
         BO    @RT00288                                            0288 00662000
*     GOTO I00AC09B;                /* THEM PRINT INVALID ENTRY      */ 00663000
*I00AC09A:                                                         0290 00664000
*   GEN(BAL LINKR,I00ACLEN);        /* GO GET LENGTH OF SYM NAME     */ 00665000
I00AC09A BAL LINKR,I00ACLEN                                             00666000
*   IF IPLEN>SNLNGTH THEN           /* IF I/P LEN IS GREATER THAN    */ 00667000
         CLC   IPLEN(1),SNLNGTH                                    0291 00668000
         BH    @RT00291                                            0291 00669000
*     GOTO I00AC09B;                /* EXPECTED THEN PRINT ERROR     */ 00670000
*   CDSSYMBN='        ';            /* BLANK OUT SYMBOLIC NAME     0293 00671000
*                                                            @DM44548*/ 00672000
         L     @15,CDSWKPTR                                        0293 00673000
         MVC   CDSSYMBN(8,@15),@CC00907                            0293 00674000
*   CDSSYMBN(1:IPLEN)=FRADR(1:IPLEN);/* SET UP SYMBOLIC NAME         */ 00675000
         SLR   @12,@12                                             0294 00676000
         IC    @12,IPLEN                                           0294 00677000
         BCTR  @12,0                                               0294 00678000
         L     @10,FRADRPTR                                        0294 00679000
         EX    @12,@SM00970                                        0294 00680000
*   IF $COPY='1'B                   /* IF THIS IS A COPY REQUEST     */ 00681000
*     THEN                          /* THEN DO THE FOLLOWING         */ 00682000
         TM    $COPY(WAPTR),B'00001000'                            0295 00683000
         BNO   @RF00295                                            0295 00684000
*     DO;                                                          0296 00685000
*       R1=ADDR(VERYTBL);           /* SET UP PARM LIST PTR          */ 00686000
         LA    R1,VERYTBL                                          0297 00687000
*       CDSPTR=ADDR(CDSUA);         /* GET PTR TO CDS DATA           */ 00688000
         ST    @15,CDSPTR                                          0298 00689000
*       CALL ISTSC030;              /* GO VERIFY CDS EXIST TO VTAM   */ 00690000
         L     @15,@CV00896                                        0299 00691000
         BALR  @14,@15                                             0299 00692000
*       IF R15^=0 THEN              /* IF RET CODE ^= ZERO-ERROR     */ 00693000
         LTR   R15,R15                                             0300 00694000
         BNZ   @RT00300                                            0300 00695000
*         GOTO I00AC09B;            /* INVALID ENTRY                 */ 00696000
*       RETURN;                     /* RETURN TO CALLER              */ 00697000
         B     @EL00001                                            0302 00698000
*     END;                                                         0303 00699000
*   IF CONTSCAN='0'B THEN           /* IF CONT SCAN SWITCH IS OFF    */ 00700000
@RF00295 L     @15,I00ACWK                                         0304 00701000
         TM    CONTSCAN(@15),B'10000000'                           0304 00702000
         BZ    @RT00304                                            0304 00703000
*     GOTO I00AC02;                 /* THEN GO GET NXT LINE          */ 00704000
*   CONTSCAN='0'B;                  /* OTHERWISE RESET IT AND        */ 00705000
         NI    CONTSCAN(@15),B'01111111'                           0306 00706000
*   GOTO I00AC03A;                  /* CONTINUE ON                   */ 00707000
         B     I00AC03A                                            0307 00708000
*I00AC09B:                                                         0308 00709000
*                                                                  0308 00710000
*   /*****************************************************************/ 00711000
*   /*                                                               */ 00712000
*   /* TCEC MSGN(581)MSGMSK('02000000'X) INVOKED                     */ 00713000
*   /*                                                               */ 00714000
*   /*****************************************************************/ 00715000
*                                                                  0308 00716000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00717000
I00AC09B OI    $TCECM(WAPTR),B'00000001'                           0308 00718000
*   R1=ADDR($TCA22);                /* SET UP PARM LIST $TR          */ 00719000
         LA    R1,$TCA22                                           0309 00720000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00721000
         L     @15,@CV00781                                        0310 00722000
         BALR  @14,@15                                             0310 00723000
*   DCL                                                            0311 00724000
*     1 $TCA22,                     /* TCEC PARM LIST                */ 00725000
*      2 $TCB22 FIXED(32) INIT(581),/* MSG NUMBER                    */ 00726000
*      2 $TCC22 FIXED(32) INIT(0),  /* INCT LEN                      */ 00727000
*      2 $TCD22 BIT(8) INIT('00000000'B),/* FLAG                     */ 00728000
*      2 $TCE22 CHAR(4) INIT('02000000'X);/* MSSAGE MASK INVALID SYM    00729000
*                                      NAME FLD                      */ 00730000
*   IF $COPY='1'B THEN              /* IF THIS IS A COPY REQUEST     */ 00731000
         TM    $COPY(WAPTR),B'00001000'                            0312 00732000
         BO    @RT00312                                            0312 00733000
*     GOTO I00AC01C;                /* THEN GO GET NAME AGAIN        */ 00734000
*   GOTO I00AC01;                   /* GO GET ENTIRE LAST LINE       */ 00735000
         B     I00AC01                                             0314 00736000
*I00AC0A:                                                          0315 00737000
*   IF $INBUFR(INDX1+1:INDX1+LENGTH(DB))^=DB THEN                  0315 00738000
I00AC0A  LH    @15,INDX1                                           0315 00739000
         N     @15,@CF00965                                        0315 00740000
         ALR   @15,WAPTR                                           0315 00741000
         CLC   $INBUFR(2,@15),DB                                   0315 00742000
         BNE   @RT00315                                            0315 00743000
*     GOTO I00AC0B;                 /* IF NOT A DATA GROUP THEN BR   */ 00744000
*   DBCOUNT=0;                      /* INITIALIZE DATA BYTE CT       */ 00745000
         MVI   DBCOUNT,X'00'                                       0317 00746000
*   IF $INBUFR(INDX1+LENGTH(DB)+3:INDX1+LENGTH(DB)+3)=EQSIGN THEN  0318 00747000
         LH    @15,INDX1                                           0318 00748000
         N     @15,@CF00965                                        0318 00749000
         ALR   @15,WAPTR                                           0318 00750000
         CLC   $INBUFR+4(1,@15),EQSIGN                             0318 00751000
         BE    @RT00318                                            0318 00752000
*     GOTO I00AC0AA;                /* IF ITS -DBXX=-ITS OK          */ 00753000
*   IF $INBUFR(INDX1+LENGTH(DB)+4:INDX1+LENGTH(DB)+4)^=EQSIGN THEN 0320 00754000
         LH    @15,INDX1                                           0320 00755000
         N     @15,@CF00965                                        0320 00756000
         ALR   @15,WAPTR                                           0320 00757000
         CLC   $INBUFR+5(1,@15),EQSIGN                             0320 00758000
         BNE   @RT00320                                            0320 00759000
*     GOTO I00AC0AC;                                               0321 00760000
*I00AC0AA:                                                         0322 00761000
*   DBSW='1'B;                      /* TURN ON DATA BYTE SW          */ 00762000
I00AC0AA DS    0H                                                  0323 00763000
*   DATASW='1'B;                    /* SET DATA SW                   */ 00764000
         L     @15,I00ACWK                                         0323 00765000
         OI    DBSW(@15),B'00000011'                               0323 00766000
*   GEN(BAL LINKR,I00ACLEN);        /* GO GET LENGTH OF DATA BYTES   */ 00767000
         BAL LINKR,I00ACLEN                                             00768000
*   IF ERROR=ON                     /* IF NOT NUMERICAL DISPLACEMENT */ 00769000
*     THEN                          /* THEN                          */ 00770000
         L     @15,I00ACWK                                         0325 00771000
         TM    ERROR(@15),B'10000000'                              0325 00772000
         BO    @RT00325                                            0325 00773000
*     GOTO I00AC0AC;                /* REJECT ENTRY                  */ 00774000
*   IF $REMSW=OFF                   /* IF LOCAL CDS                  */ 00775000
*     THEN                          /* THEN                          */ 00776000
         TM    $REMSW(WAPTR),B'01000000'                           0327 00777000
         BNZ   @RF00327                                            0327 00778000
*     INDX2=DB#-12;                 /* START EXTRA DATA IN BYTE 12   */ 00779000
         LH    @15,DB#                                             0328 00780000
         N     @15,@CF00965                                        0328 00781000
         SL    @15,@CF00137                                        0328 00782000
         STC   @15,INDX2                                           0328 00783000
*   ELSE                            /* ELSE FOR REMOTE BYTE 20       */ 00784000
*     INDX2=DB#-20;                 /* SET UP CDSEXARA OFFSET        */ 00785000
         B     @RC00327                                            0329 00786000
@RF00327 LH    @15,DB#                                             0329 00787000
         N     @15,@CF00965                                        0329 00788000
         SL    @15,@CF00379                                        0329 00789000
         STC   @15,INDX2                                           0329 00790000
*   IF EBCDICSW='1'B THEN                                          0330 00791000
@RC00327 L     @15,I00ACWK                                         0330 00792000
         TM    EBCDICSW(@15),B'00000100'                           0330 00793000
         BNO   @RF00330                                            0330 00794000
*     DO;                           /* IF IT WAS EBCDIC CHAR THEN    */ 00795000
*       EBCDICSW='0'B;              /* RESET SW AND                  */ 00796000
         NI    EBCDICSW(@15),B'11111011'                           0332 00797000
*       IF(DB#+IPLEN)>255 THEN                                     0333 00798000
         SLR   @15,@15                                             0333 00799000
         IC    @15,IPLEN                                           0333 00800000
         LH    @12,DB#                                             0333 00801000
         N     @12,@CF00965                                        0333 00802000
         ALR   @12,@15                                             0333 00803000
         C     @12,@CF00919                                        0333 00804000
         BH    @RT00333                                            0333 00805000
*         GOTO I00AC0AC;            /*                       @YA04053*/ 00806000
*       IF $REMSW=OFF THEN                                         0335 00807000
         TM    $REMSW(WAPTR),B'01000000'                           0335 00808000
         BNZ   @RF00335                                            0335 00809000
*         CDSSYMBN(INDX2+1:INDX2+IPLEN)=FRADR;                     0336 00810000
         SLR   @12,@12                                             0336 00811000
         IC    @12,INDX2                                           0336 00812000
         L     @10,CDSWKPTR                                        0336 00813000
         ALR   @10,@12                                             0336 00814000
         BCTR  @15,0                                               0336 00815000
         L     @12,FRADRPTR                                        0336 00816000
         EX    @15,@SM00973                                        0336 00817000
*       ELSE                                                       0337 00818000
*         CDSEXARA(INDX2+1:INDX2+IPLEN)=FRADR;/* MOVE IN EBCDIC      */ 00819000
         B     @RC00335                                            0337 00820000
@RF00335 SLR   @15,@15                                             0337 00821000
         IC    @15,INDX2                                           0337 00822000
         L     @12,CDSWKPTR                                        0337 00823000
         ALR   @12,@15                                             0337 00824000
         SLR   @15,@15                                             0337 00825000
         IC    @15,IPLEN                                           0337 00826000
         BCTR  @15,0                                               0337 00827000
         L     @10,FRADRPTR                                        0337 00828000
         EX    @15,@SM00975                                        0337 00829000
*     END;                                                         0338 00830000
*   ELSE                                                           0339 00831000
*     DO;                                                          0339 00832000
         B     @RC00330                                            0339 00833000
@RF00330 DS    0H                                                  0340 00834000
*       GEN(BAL  LINKR,I00ACONV);   /* GO CONVERT DATA TO HEX        */ 00835000
         BAL  LINKR,I00ACONV                                            00836000
*       IF R15^=ZERO THEN           /* FI IT DID NOT CONV OK THEN    */ 00837000
         SLR   @12,@12                                             0341 00838000
         IC    @12,ZERO                                            0341 00839000
         CR    R15,@12                                             0341 00840000
         BNE   @RT00341                                            0341 00841000
*         GOTO I00AC0AC;            /* WE MUST HAVE INV I/P          */ 00842000
*       I=IPLEN/2;                  /* DIVIDE INPUT LENGTH IN HALF   */ 00843000
         SLR   @15,@15                                             0343 00844000
         IC    @15,IPLEN                                           0343 00845000
         LR    @12,@15                                             0343 00846000
         SRL   @12,1                                               0343 00847000
         STC   @12,I                                               0343 00848000
*       R=IPLEN//2;                 /* GET REMAINDER                 */ 00849000
         LR    @00,@15                                             0344 00850000
         SRDA  @00,32                                              0344 00851000
         D     @00,@CF00140                                        0344 00852000
         STC   @00,R                                               0344 00853000
*       IF R^=ZERO THEN             /* IF THERE WAS A REMAINDER      */ 00854000
         CLC   R(1),ZERO                                           0345 00855000
         BNE   @RT00345                                            0345 00856000
*         GOTO I00AC0AC;            /* THEN ITS INVALID ENTRY        */ 00857000
*       IPLEN=I;                    /* SET UP NEW INPUT LENGTH       */ 00858000
         MVC   IPLEN(1),I                                          0347 00859000
*       IF(DB#+IPLEN)>255 THEN      /* IF 255 LIMIT EXCEEDED @YA04053*/ 00860000
         SLR   @15,@15                                             0348 00861000
         IC    @15,IPLEN                                           0348 00862000
         LH    @12,DB#                                             0348 00863000
         N     @12,@CF00965                                        0348 00864000
         ALR   @12,@15                                             0348 00865000
         C     @12,@CF00919                                        0348 00866000
         BH    @RT00348                                            0348 00867000
*         GOTO I00AC0AC;            /* CDS LIMIT THEN BR-INVALID     */ 00868000
*       IF $REMSW=OFF               /* IF LOCAL                      */ 00869000
*         THEN                      /* THEN                          */ 00870000
         TM    $REMSW(WAPTR),B'01000000'                           0350 00871000
         BNZ   @RF00350                                            0350 00872000
*         CDSSYMBN(INDX2+1:INDX2+IPLEN)=TOADR;                     0351 00873000
         SLR   @12,@12                                             0351 00874000
         IC    @12,INDX2                                           0351 00875000
         L     @10,CDSWKPTR                                        0351 00876000
         ALR   @10,@12                                             0351 00877000
         BCTR  @15,0                                               0351 00878000
         L     @12,TOADRPTR                                        0351 00879000
         EX    @15,@SM00977                                        0351 00880000
*       ELSE                                                       0352 00881000
*         CDSEXARA(INDX2+1:INDX2+IPLEN)=TOADR;/* MIVE IN DATA BYTE   */ 00882000
         B     @RC00350                                            0352 00883000
@RF00350 SLR   @15,@15                                             0352 00884000
         IC    @15,INDX2                                           0352 00885000
         L     @12,CDSWKPTR                                        0352 00886000
         ALR   @12,@15                                             0352 00887000
         SLR   @15,@15                                             0352 00888000
         IC    @15,IPLEN                                           0352 00889000
         BCTR  @15,0                                               0352 00890000
         L     @10,TOADRPTR                                        0352 00891000
         EX    @15,@SM00979                                        0352 00892000
*     END;                                                         0353 00893000
@RC00350 DS    0H                                                  0354 00894000
*I00AC0AB:                                                         0354 00895000
*   IF DBCOUNT<DB#+IPLEN            /* IF THE LAST DATA COUNT IS   0354 00896000
*                                                            @YA04053*/ 00897000
*     THEN                          /* LESS THAN THE PRESENT ONE     */ 00898000
@RC00330 DS    0H                                                  0354 00899000
I00AC0AB LH    @15,DB#                                             0354 00900000
         N     @15,@CF00965                                        0354 00901000
         SLR   @12,@12                                             0354 00902000
         IC    @12,IPLEN                                           0354 00903000
         ALR   @15,@12                                             0354 00904000
         SLR   @12,@12                                             0354 00905000
         IC    @12,DBCOUNT                                         0354 00906000
         CR    @15,@12                                             0354 00907000
         BNH   @RF00354                                            0354 00908000
*     DO;                           /* THEN UPDATE THAT COUNT BY     */ 00909000
*       DBCOUNT=DB#+IPLEN;          /* ADDING THE DB # TO THE I/P  0356 00910000
*                                                            @YA04053*/ 00911000
         STC   @15,DBCOUNT                                         0356 00912000
*     END;                          /* LENGTH                        */ 00913000
*   IF CONTSCAN='0'B THEN                                          0358 00914000
@RF00354 L     @15,I00ACWK                                         0358 00915000
         TM    CONTSCAN(@15),B'10000000'                           0358 00916000
         BZ    @RT00358                                            0358 00917000
*     GOTO I00AC02;                                                0359 00918000
*   CONTSCAN='0'B;                                                 0360 00919000
         NI    CONTSCAN(@15),B'01111111'                           0360 00920000
*   GOTO I00AC03A;                                                 0361 00921000
         B     I00AC03A                                            0361 00922000
*I00AC0AC:                                                         0362 00923000
*                                                                  0362 00924000
*   /*****************************************************************/ 00925000
*   /*                                                               */ 00926000
*   /* TCEC MSGN(581)MSGMSK('01000000'X) INVOKED                     */ 00927000
*   /*                                                               */ 00928000
*   /*****************************************************************/ 00929000
*                                                                  0362 00930000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00931000
I00AC0AC OI    $TCECM(WAPTR),B'00000001'                           0362 00932000
*   R1=ADDR($TCA23);                /* SET UP PARM LIST $TR          */ 00933000
         LA    R1,$TCA23                                           0363 00934000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00935000
         L     @15,@CV00781                                        0364 00936000
         BALR  @14,@15                                             0364 00937000
*   DCL                                                            0365 00938000
*     1 $TCA23,                     /* TCEC PARM LIST                */ 00939000
*      2 $TCB23 FIXED(32) INIT(581),/* MSG NUMBER                    */ 00940000
*      2 $TCC23 FIXED(32) INIT(0),  /* INCT LEN                      */ 00941000
*      2 $TCD23 BIT(8) INIT('00000000'B),/* FLAG                     */ 00942000
*      2 $TCE23 CHAR(4) INIT('01000000'X);/* MSSAGE MASK INVALID DATA   00943000
*                                      FLD                           */ 00944000
*   GOTO I00AC01;                   /* GO GET ENTIRE LAST LINE       */ 00945000
         B     I00AC01                                             0366 00946000
*I00AC0B:                                                          0367 00947000
*   IF $INBUFR(INDX1+1:INDX1+LENGTH(ENDATA))=ENDATA THEN           0367 00948000
I00AC0B  LH    @15,INDX1                                           0367 00949000
         N     @15,@CF00965                                        0367 00950000
         ALR   @15,WAPTR                                           0367 00951000
         CLC   $INBUFR(3,@15),ENDATA                               0367 00952000
         BE    @RT00367                                            0367 00953000
*     GOTO I00ACRET;                /* IF EOD THEN RETURN TO CALL    */ 00954000
*                                                                  0368 00955000
*   /*****************************************************************/ 00956000
*   /*                                                               */ 00957000
*   /* TCEC MSGN(581)MSGMSK('00800000'X) INVOKED                     */ 00958000
*   /*                                                               */ 00959000
*   /*****************************************************************/ 00960000
*                                                                  0369 00961000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00962000
         OI    $TCECM(WAPTR),B'00000001'                           0369 00963000
*   R1=ADDR($TCA24);                /* SET UP PARM LIST $TR          */ 00964000
         LA    R1,$TCA24                                           0370 00965000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00966000
         L     @15,@CV00781                                        0371 00967000
         BALR  @14,@15                                             0371 00968000
*   DCL                                                            0372 00969000
*     1 $TCA24,                     /* TCEC PARM LIST                */ 00970000
*      2 $TCB24 FIXED(32) INIT(581),/* MSG NUMBER                    */ 00971000
*      2 $TCC24 FIXED(32) INIT(0),  /* INCT LEN                      */ 00972000
*      2 $TCD24 BIT(8) INIT('00000000'B),/* FLAG                     */ 00973000
*      2 $TCE24 CHAR(4) INIT('00800000'X);/* MSSAGE MASK INVALID PARM*/ 00974000
*   GOTO I00AC01;                   /* RE-ENTER LAST LINE            */ 00975000
         B     I00AC01                                             0373 00976000
*I00ACRET:                                                         0374 00977000
*   IF DATASW='1'B                  /* IF THE DATA SW IS ON          */ 00978000
*     THEN                          /* THEN DO THE FOLLOWING         */ 00979000
I00ACRET L     @15,I00ACWK                                         0374 00980000
         TM    DATASW(@15),B'00000001'                             0374 00981000
         BNO   @RF00374                                            0374 00982000
*     DO;                                                          0375 00983000
*       DATASW='0'B;                /* TURN OF DATA SW               */ 00984000
         NI    DATASW(@15),B'11111110'                             0376 00985000
*       IF $CHANGE^='1'B            /* IF THIS IS NOT A CHANGE       */ 00986000
*         THEN                      /* THEN DO THE FOLLOWING         */ 00987000
         TM    $CHANGE(WAPTR),B'00100000'                          0377 00988000
         BO    @RF00377                                            0377 00989000
*         DO;                                                      0378 00990000
*           CDSBYTCT=DBCOUNT;       /* SET UP NEW BYTE COUNT         */ 00991000
         IC    @15,DBCOUNT                                         0379 00992000
         L     @12,CDSWKPTR                                        0379 00993000
         STC   @15,CDSBYTCT(,@12)                                  0379 00994000
*         END;                                                     0380 00995000
*       ELSE                        /* IF IT IS A CHANGE REQ         */ 00996000
*         DO;                       /* THEN DO THE FOLLOWING         */ 00997000
         B     @RC00377                                            0381 00998000
@RF00377 DS    0H                                                  0382 00999000
*           IF CDSBYTCT<DBCOUNT     /* IF ORIG COUNT IS LESS         */ 01000000
*             THEN                  /* THEN DO THE FOLLOWING         */ 01001000
         L     @15,CDSWKPTR                                        0382 01002000
         CLC   CDSBYTCT(1,@15),DBCOUNT                             0382 01003000
         BNL   @RF00382                                            0382 01004000
*             DO;                                                  0383 01005000
*               CDSBYTCT=DBCOUNT;   /* SET UP NEW BYTE COUNT         */ 01006000
         IC    @12,DBCOUNT                                         0384 01007000
         STC   @12,CDSBYTCT(,@15)                                  0384 01008000
*             END;                                                 0385 01009000
*         END;                                                     0386 01010000
*     END;                                                         0387 01011000
*   ELSE                            /* IF THE DATA SW WAS OFF        */ 01012000
*     DO;                           /* DO THE FOLLOWING              */ 01013000
         B     @RC00374                                            0388 01014000
@RF00374 DS    0H                                                  0389 01015000
*       IF $CHANGE^='1'B&$COPY^='1'B/* IF NOT CHNG OR COPY           */ 01016000
*         THEN                      /* THEN DO THE FOLLOWING         */ 01017000
         TM    $CHANGE(WAPTR),B'00100000'                          0389 01018000
         BO    @RF00389                                            0389 01019000
         TM    $COPY(WAPTR),B'00001000'                            0389 01020000
         BO    @RF00389                                            0389 01021000
*         DO;                                                      0390 01022000
*           CDSBYTCT=20;            /* SET MINIMUM BYTE COUNT        */ 01023000
         L     @15,CDSWKPTR                                        0391 01024000
         MVI   CDSBYTCT(@15),X'14'                                 0391 01025000
*         END;                                                     0392 01026000
*     END;                                                         0393 01027000
*   RETURN;                         /* RETURN TO CALLER              */ 01028000
         B     @EL00001                                            0394 01029000
*   GEN(EJECT);                                                    0395 01030000
*                                                                  0395 01031000
         EJECT                                                          01032000
*/********************************************************************/ 01033000
*/*  THIS ROUTINE DETERMINES THE LENGTH OF THE ACTUAL INPUT WHICH    */ 01034000
*/*  IS TO BE PLACED IN THE CDS. IT USES THE EQUAL (=) SIGN AS IT    */ 01035000
*/*  STARTING DELIMETER AND EITHER A BLANK OR A COMMA AS ITS ENDING  */ 01036000
*/*  DELIMETER                                                       */ 01037000
*/********************************************************************/ 01038000
*                                                                  0396 01039000
*I00ACLEN:                                                         0396 01040000
*   RETSAV1=LINKR;                  /* SAVE RET ADR PTR              */ 01041000
I00ACLEN ST    LINKR,RETSAV1                                       0396 01042000
*   EBCDICSW=OFF;                   /* RESET EBCDIC INPUT FLAG       */ 01043000
         L     @15,I00ACWK                                         0397 01044000
         NI    EBCDICSW(@15),B'11111011'                           0397 01045000
*   ERROR=OFF;                      /* RESET ERROR FLAG              */ 01046000
         NI    ERROR(@15),B'01111111'                              0398 01047000
*   IPLEN='0'X;                     /* ZERO OUT INPUT LEN FLD        */ 01048000
         MVI   IPLEN,X'00'                                         0399 01049000
*   IF DBSW='1'B THEN               /* IF THIS IS A DATA REQ         */ 01050000
         TM    DBSW(@15),B'00000010'                               0400 01051000
         BO    @RT00400                                            0400 01052000
*     GOTO I00ACL02;                /* THEN BR AND HANDLE            */ 01053000
*   DO WHILE($INBUFR(INDX1+1:INDX1+1)^=EQSIGN);                    0402 01054000
         B     @DE00402                                            0402 01055000
@DL00402 DS    0H                                                  0403 01056000
*     INDX1=INDX1+1;                /* UPDATE INDEX PTR              */ 01057000
         LH    @15,INDX1                                           0403 01058000
         LA    @15,1(,@15)                                         0403 01059000
         STH   @15,INDX1                                           0403 01060000
*   END;                                                           0404 01061000
@DE00402 LH    @15,INDX1                                           0404 01062000
         N     @15,@CF00965                                        0404 01063000
         ALR   @15,WAPTR                                           0404 01064000
         CLC   $INBUFR(1,@15),EQSIGN                               0404 01065000
         BNE   @DL00402                                            0404 01066000
*   INDX1=INDX1+1;                  /* GET PAST EQ SIGN              */ 01067000
         LH    @15,INDX1                                           0405 01068000
         N     @15,@CF00965                                        0405 01069000
         LA    @15,1(,@15)                                         0405 01070000
         STH   @15,INDX1                                           0405 01071000
*I00ACL01:                                                         0406 01072000
*   FRADRPTR=ADDR($INBUFR)+INDX1;   /* SET UP FROM ADDR FOR ITACONV  */ 01073000
I00ACL01 LA    @15,$INBUFR(,WAPTR)                                 0406 01074000
         LH    @12,INDX1                                           0406 01075000
         N     @12,@CF00965                                        0406 01076000
         ALR   @15,@12                                             0406 01077000
         ST    @15,FRADRPTR                                        0406 01078000
*   DO WHILE(($INBUFR(INDX1+1:INDX1+1)^=BLANK)&($INBUFR(INDX1+1:INDX1+1 01079000
*         )^=COMMA)&($INBUFR(INDX1+1:INDX1+1)^='00'X));            0407 01080000
         B     @DE00407                                            0407 01081000
@DL00407 DS    0H                                                  0408 01082000
*     INDX1=INDX1+1;                /* UPDATE INDEX PTR              */ 01083000
         LA    @15,1                                               0408 01084000
         LH    @12,INDX1                                           0408 01085000
         N     @12,@CF00965                                        0408 01086000
         ALR   @12,@15                                             0408 01087000
         STH   @12,INDX1                                           0408 01088000
*     IPLEN=IPLEN+1;                /* ADD ONE TO I/P LENGTH CTR     */ 01089000
         SLR   @12,@12                                             0409 01090000
         IC    @12,IPLEN                                           0409 01091000
         ALR   @15,@12                                             0409 01092000
         STC   @15,IPLEN                                           0409 01093000
*   END;                                                           0410 01094000
@DE00407 LH    @15,INDX1                                           0410 01095000
         N     @15,@CF00965                                        0410 01096000
         ALR   @15,WAPTR                                           0410 01097000
         CLC   $INBUFR(1,@15),BLANK                                0410 01098000
         BE    @DC00407                                            0410 01099000
         LH    @15,INDX1                                           0410 01100000
         N     @15,@CF00965                                        0410 01101000
         ALR   @15,WAPTR                                           0410 01102000
         CLC   $INBUFR(1,@15),COMMA                                0410 01103000
         BE    @DC00407                                            0410 01104000
         LH    @15,INDX1                                           0410 01105000
         N     @15,@CF00965                                        0410 01106000
         ALR   @15,WAPTR                                           0410 01107000
         CLI   $INBUFR(@15),X'00'                                  0410 01108000
         BNE   @DL00407                                            0410 01109000
@DC00407 DS    0H                                                  0411 01110000
*   GOTO I00ACL03;                  /* BR AROUND                     */ 01111000
         B     I00ACL03                                            0411 01112000
*I00ACL02:                                                         0412 01113000
*   DBSW='0'B;                      /* RESET DATA BYTE SW            */ 01114000
I00ACL02 L     @15,I00ACWK                                         0412 01115000
         NI    DBSW(@15),B'11111101'                               0412 01116000
*   INDX1=INDX1+2;                  /* GET PAST 'DB'                 */ 01117000
         LH    @15,INDX1                                           0413 01118000
         N     @15,@CF00965                                        0413 01119000
         LA    @15,2(,@15)                                         0413 01120000
         STH   @15,INDX1                                           0413 01121000
*   DB#='0000'X;                    /* ZERO OUT DATA BYTE NUMBER     */ 01122000
         SLR   @12,@12                                             0414 01123000
         STH   @12,DB#                                             0414 01124000
*   DB#LEN='0'X;                    /* ZERO OUT DATA BYTE # LEN      */ 01125000
         MVI   DB#LEN,X'00'                                        0415 01126000
*   FRADRPTR=ADDR($INBUFR)+INDX1;   /* SET UP FROM ADDR FOR ITACONV  */ 01127000
         LA    @12,$INBUFR(,WAPTR)                                 0416 01128000
         ALR   @12,@15                                             0416 01129000
         ST    @12,FRADRPTR                                        0416 01130000
*   INPTR=FRADRPTR;                 /* POINT TO DISPLACEMNT          */ 01131000
         ST    @12,INPTR                                           0417 01132000
*   DO WHILE($INBUFR(INDX1+1:INDX1+1)^=EQSIGN);                    0418 01133000
         B     @DE00418                                            0418 01134000
@DL00418 DS    0H                                                  0419 01135000
*     INDX1=INDX1+1;                /* UPDATE INDEX PTR              */ 01136000
         LA    @15,1                                               0419 01137000
         LH    @12,INDX1                                           0419 01138000
         N     @12,@CF00965                                        0419 01139000
         ALR   @12,@15                                             0419 01140000
         STH   @12,INDX1                                           0419 01141000
*     DB#LEN=DB#LEN+1;              /* ADD ONE TO DATA BYTE # LEN    */ 01142000
         SLR   @12,@12                                             0420 01143000
         IC    @12,DB#LEN                                          0420 01144000
         ALR   @15,@12                                             0420 01145000
         STC   @15,DB#LEN                                          0420 01146000
*   END;                                                           0421 01147000
@DE00418 LH    @15,INDX1                                           0421 01148000
         N     @15,@CF00965                                        0421 01149000
         ALR   @15,WAPTR                                           0421 01150000
         CLC   $INBUFR(1,@15),EQSIGN                               0421 01151000
         BNE   @DL00418                                            0421 01152000
*   DO INPTR=INPTR TO FRADRPTR+DB#LEN-1;/* LOOK AT DISPLACEMNT       */ 01153000
         L     @15,INPTR                                           0422 01154000
         B     @DE00422                                            0422 01155000
@DL00422 DS    0H                                                  0423 01156000
*     IF INPUT(1:4)^='1111'B        /* IF INPUT NOT NUMBERS          */ 01157000
*       THEN                        /* THEN                          */ 01158000
         TM    INPUT(@15),B'11110000'                              0423 01159000
         BO    @RF00423                                            0423 01160000
*       DO;                                                        0424 01161000
*         ERROR=ON;                 /* ERROR FLAG SET                */ 01162000
         L     @15,I00ACWK                                         0425 01163000
         OI    ERROR(@15),B'10000000'                              0425 01164000
*         GOTO I00ACL04;            /* RETURN                        */ 01165000
         B     I00ACL04                                            0426 01166000
*       END;                                                       0427 01167000
*   END;                                                           0428 01168000
@RF00423 LA    @15,1                                               0428 01169000
         AL    @15,INPTR                                           0428 01170000
         ST    @15,INPTR                                           0428 01171000
@DE00422 SLR   @12,@12                                             0428 01172000
         IC    @12,DB#LEN                                          0428 01173000
         AL    @12,FRADRPTR                                        0428 01174000
         BCTR  @12,0                                               0428 01175000
         CR    @15,@12                                             0428 01176000
         BNH   @DL00422                                            0428 01177000
*   IF DB#LEN=2                     /* IF DB# IS 20 TO 99            */ 01178000
*     THEN                                                         0429 01179000
         CLI   DB#LEN,2                                            0429 01180000
         BNE   @RF00429                                            0429 01181000
*     DO;                                                          0430 01182000
*       PACK(PKTO(1:2),FRADR(1:2)); /* PACK DB NUMBER                */ 01183000
         L     @15,FRADRPTR                                        0431 01184000
         PACK  PKTO(2),FRADR(2,@15)                                0431 01185000
*     END;                                                         0432 01186000
*   ELSE                            /* IF DB# IS 100-255 THEN DO     */ 01187000
*     DO;                                                          0433 01188000
         B     @RC00429                                            0433 01189000
@RF00429 DS    0H                                                  0434 01190000
*       PACK(PKTO(1:2),FRADR(1:3)); /* PACK 3-BYTE ENTRY             */ 01191000
         L     @15,FRADRPTR                                        0434 01192000
         PACK  PKTO(2),FRADR(3,@15)                                0434 01193000
*     END;                                                         0435 01194000
*   CVB(DB#,PKTO(1:2));             /* CONVERT DB# TO BINARY         */ 01195000
@RC00429 XC    @TS00001(8),@TS00001                                0436 01196000
         MVC   @TS00001+6(2),PKTO                                  0436 01197000
         CVB   @15,@TS00001                                        0436 01198000
         STH   @15,DB#                                             0436 01199000
*   INDX1=INDX1+1;                  /* GET PAST EQUAL SIGN           */ 01200000
         LH    @15,INDX1                                           0437 01201000
         N     @15,@CF00965                                        0437 01202000
         LA    @15,1(,@15)                                         0437 01203000
         STH   @15,INDX1                                           0437 01204000
*   IF $INBUFR(INDX1+1:INDX1+LENGTH(EBCDICEN))^=EBCDICEN THEN      0438 01205000
         ALR   @15,WAPTR                                           0438 01206000
         CLC   $INBUFR(2,@15),EBCDICEN                             0438 01207000
         BNE   @RT00438                                            0438 01208000
*     GOTO I00ACL01;                /* IF NOT EBCDIC THEN BR         */ 01209000
*   EBCDICSW='1'B;                  /* TURN ON EBCDIC SW             */ 01210000
         L     @15,I00ACWK                                         0440 01211000
         OI    EBCDICSW(@15),B'00000100'                           0440 01212000
*   INDX1=INDX1+2;                  /* GET TO FIRST EBCDIC CHAR      */ 01213000
         LH    @15,INDX1                                           0441 01214000
         N     @15,@CF00965                                        0441 01215000
         LA    @15,2(,@15)                                         0441 01216000
         STH   @15,INDX1                                           0441 01217000
*   FRADRPTR=ADDR($INBUFR)+INDX1;   /* GET STARTING ADDR OF EBCDIC   */ 01218000
         LA    @12,$INBUFR(,WAPTR)                                 0442 01219000
         ALR   @12,@15                                             0442 01220000
         ST    @12,FRADRPTR                                        0442 01221000
*   DO WHILE($INBUFR(INDX1+1:INDX1+1)^=SINSLASH);                  0443 01222000
         B     @DE00443                                            0443 01223000
@DL00443 DS    0H                                                  0444 01224000
*     INDX1=INDX1+1;                /* UPDATE INDEX PTR              */ 01225000
         LA    @15,1                                               0444 01226000
         LH    @12,INDX1                                           0444 01227000
         N     @12,@CF00965                                        0444 01228000
         ALR   @12,@15                                             0444 01229000
         STH   @12,INDX1                                           0444 01230000
*     IPLEN=IPLEN+1;                /* ADD ONE TO I/P LENGTH CTR     */ 01231000
         SLR   @12,@12                                             0445 01232000
         IC    @12,IPLEN                                           0445 01233000
         ALR   @15,@12                                             0445 01234000
         STC   @15,IPLEN                                           0445 01235000
*   END;                                                           0446 01236000
@DE00443 LH    @15,INDX1                                           0446 01237000
         N     @15,@CF00965                                        0446 01238000
         ALR   @15,WAPTR                                           0446 01239000
         CLC   $INBUFR(1,@15),SINSLASH                             0446 01240000
         BNE   @DL00443                                            0446 01241000
*   INDX1=INDX1+1;                  /* GET PAST SINGLE SLASH         */ 01242000
         LH    @15,INDX1                                           0447 01243000
         N     @15,@CF00965                                        0447 01244000
         LA    @15,1(,@15)                                         0447 01245000
         STH   @15,INDX1                                           0447 01246000
*   GOTO I00ACL03;                                                 0448 01247000
         B     I00ACL03                                            0448 01248000
*I00ACL03:                                                         0449 01249000
*   IF $INBUFR(INDX1+1:INDX1+1)=COMMA THEN                         0449 01250000
I00ACL03 LH    @15,INDX1                                           0449 01251000
         N     @15,@CF00965                                        0449 01252000
         ALR   @15,WAPTR                                           0449 01253000
         CLC   $INBUFR(1,@15),COMMA                                0449 01254000
         BNE   @RF00449                                            0449 01255000
*     DO;                                                          0450 01256000
*       INDX1=INDX1+1;              /* UPDATE INDEX PTR              */ 01257000
         LH    @15,INDX1                                           0451 01258000
         N     @15,@CF00965                                        0451 01259000
         LA    @15,1(,@15)                                         0451 01260000
         STH   @15,INDX1                                           0451 01261000
*       CONTSCAN='1'B;              /* SET THE CONTINUE SCAN SW      */ 01262000
         L     @15,I00ACWK                                         0452 01263000
         OI    CONTSCAN(@15),B'10000000'                           0452 01264000
*     END;                                                         0453 01265000
*I00ACL04:                                                         0454 01266000
*   LINKR=RETSAV1;                  /* GET RET ADDR                  */ 01267000
@RF00449 DS    0H                                                  0454 01268000
I00ACL04 L     LINKR,RETSAV1                                       0454 01269000
*   GEN(BR LINKR);                  /* RETURN TO CALLER              */ 01270000
         BR LINKR                                                       01271000
*   GEN(EJECT);                                                    0456 01272000
*                                                                  0456 01273000
         EJECT                                                          01274000
*/********************************************************************/ 01275000
*/*                  C O N V E R T  R O U T I N E                    */ 01276000
*/********************************************************************/ 01277000
*                                                                  0457 01278000
*I00ACONV:                                                         0457 01279000
*   RETSAV1=LINKR;                  /* SAVE RETURN ADDR              */ 01280000
*                                                                  0457 01281000
I00ACONV ST    LINKR,RETSAV1                                       0457 01282000
*   /*****************************************************************/ 01283000
*   /*                                                               */ 01284000
*   /* ITACONV FROM(FRADR)TO(TOADR)COUNT(IPLEN)TYPE(EH) INVOKED      */ 01285000
*   /*                                                               */ 01286000
*   /*****************************************************************/ 01287000
*                                                                  0458 01288000
*   DCL                                                            0458 01289000
*     1 ITATCPRM BDY(WORD),         /* CONVERT PARAMETER LIST        */ 01290000
*      2 * CHAR(4) INIT('0102F4F1'X),                              0458 01291000
*      2 ITATCFR PTR,               /* ADDRESS OF FROM FIELD         */ 01292000
*      2 ITATCTO PTR,               /* ADDRESS OF TO FIELD           */ 01293000
*      2 * BIT(8) INIT(0),          /* FLAGS FOR CONVERT MODULE      */ 01294000
*       3 ITATCTP BIT(1),           /* TYPE OF CONVERT REQUIRED      */ 01295000
*      2 ITATCNT FIXED(8);          /* NUMBER OF BYTES TO CONVERT    */ 01296000
*   ITATCFR=ADDR(FRADR);            /* SET THE FROM ADDRESS          */ 01297000
         L     @15,FRADRPTR                                        0459 01298000
         ST    @15,ITATCFR                                         0459 01299000
*   ITATCTO=ADDR(TOADR);            /* SET THE TO ADDRESS            */ 01300000
         L     @15,TOADRPTR                                        0460 01301000
         ST    @15,ITATCTO                                         0460 01302000
*   ITATCTP='0'B;                   /* SET THE TYPE OF CONVERT BIT   */ 01303000
         NI    ITATCTP,B'01111111'                                 0461 01304000
*   ITATCNT=IPLEN;                  /* GIVE THE CONVERT BYTE COUNT   */ 01305000
         IC    @15,IPLEN                                           0462 01306000
         STC   @15,ITATCNT                                         0462 01307000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 01308000
         LA    R1,ITATCPRM                                         0463 01309000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 01310000
         L     @15,@CV00961                                        0464 01311000
         BALR  @14,@15                                             0464 01312000
*   LINKR=RETSAV1;                  /* GET RETURN ADDR               */ 01313000
         L     LINKR,RETSAV1                                       0465 01314000
*   GEN(BR LINKR);                  /* RETURN TO CALLER              */ 01315000
         BR LINKR                                                       01316000
*   DO;                             /* ATDSPLY                       */ 01317000
*   END;                            /* ATDSPLY                       */ 01318000
*   END ISTIC00A;                                                  0469 01319000
         B     @EL00001                                            0469 01320000
@DATA    DS    0H                                                       01321000
@SM00970 MVC   CDSSYMBN(0,@15),FRADR(@10)                               01322000
@SM00973 MVC   CDSSYMBN(0,@10),FRADR(@12)                               01323000
@SM00975 MVC   CDSEXARA(0,@12),FRADR(@10)                               01324000
@SM00977 MVC   CDSSYMBN(0,@10),TOADR(@12)                               01325000
@SM00979 MVC   CDSEXARA(0,@12),TOADR(@10)                               01326000
         DS    0F                                                       01327000
@SA00001 DS    18F                                                      01328000
         DS    0F                                                       01329000
@CF00140 DC    F'2'                                                     01330000
@CF00137 DC    F'12'                                                    01331000
@CF00379 DC    F'20'                                                    01332000
@CF00050 DC    F'80'                                                    01333000
@CF00919 DC    F'255'                                                   01334000
@CF00084 DC    F'256'                                                   01335000
@CF00965 DC    XL4'0000FFFF'                                            01336000
@CV00781 DC    V(S20CEC03)                                              01337000
@CV00896 DC    V(ISTSC030)                                              01338000
@CV00961 DC    V(ISTSC021)                                              01339000
         DS    0D                                                       01340000
RCAPTR   DS    A                                                        01341000
CECMAP   DS    A                                                        01342000
CDSWKPTR DS    A                                                        01343000
FRADRPTR DS    A                                                        01344000
TOADRPTR DS    A                                                        01345000
INPTR    DS    A                                                        01346000
I00ACWK  DS    A                                                        01347000
DB#      DC    XL2'0000'                                                01348000
INDX1    DS    H                                                        01349000
INDX2    DC    XL1'00'                                                  01350000
MLNGTH   DC    XL1'2'                                                   01351000
FLNGTH   DC    XL1'2'                                                   01352000
CLNGTH   DC    XL1'2'                                                   01353000
TLNGTH   DC    XL1'2'                                                   01354000
FLGLNGTH DC    XL1'6'                                                   01355000
UALNGTH  DC    XL1'4'                                                   01356000
SNLNGTH  DC    XL1'8'                                                   01357000
DBLNGTH  DC    XL1'EB'                                                  01358000
         DS    0D                                                       01359000
@TS00001 DS    CL8                                                      01360000
@CC00907 DC    C'        '                                              01361000
BLANK    DC    CL1' '                                                   01362000
HWONE    DC    X'0001'                                                  01363000
ZERO     DC    X'00'                                                    01364000
I        DC    X'00'                                                    01365000
R        DC    X'00'                                                    01366000
         DS    CL2                                                      01367000
RETSAV1  DS    CL4                                                      01368000
PROMPT   DC    CL1'P'                                                   01369000
EQSIGN   DC    CL1'='                                                   01370000
COMMA    DC    CL1','                                                   01371000
MODEL    DC    CL2'M='                                                  01372000
FEAT     DC    CL2'F='                                                  01373000
CLASS    DC    CL2'C='                                                  01374000
TYPE     DC    CL2'T='                                                  01375000
FLAGS    DC    CL3'FL='                                                 01376000
UADR     DC    CL3'UA='                                                 01377000
SYMNME   DC    CL3'SN='                                                 01378000
DB       DC    CL2'DB'                                                  01379000
CDSWORK  DS    CL20                                                     01380000
DB#LEN   DS    CL1                                                      01381000
DBCOUNT  DC    X'00'                                                    01382000
EBCDICEN DC    CL2'E/'                                                  01383000
ENDATA   DC    CL3'END'                                                 01384000
IPLEN    DS    CL1                                                      01385000
PKTO     DS    CL2                                                      01386000
SINSLASH DC    CL1'/'                                                   01387000
         DS    CL3                                                      01388000
VERYTBL  DS    CL5                                                      01389000
         ORG   VERYTBL                                                  01390000
CDSPTR   DS    AL4                                                      01391000
@NM00053 DC    X'00'                                                    01392000
         ORG   VERYTBL+5                                                01393000
         DS    CL3                                                      01394000
$TCA09   DS    CL13                                                     01395000
         ORG   $TCA09                                                   01396000
$TCB09   DC    A(580)                                                   01397000
$TCC09   DC    A(61)                                                    01398000
$TCD09   DC    B'01000000'                                              01399000
$TCE09   DC    X'80000000'                                              01400000
         ORG   $TCA09+13                                                01401000
         DS    CL3                                                      01402000
$TCA10   DS    CL13                                                     01403000
         ORG   $TCA10                                                   01404000
$TCB10   DC    A(580)                                                   01405000
$TCC10   DC    A(0)                                                     01406000
$TCD10   DC    B'00000000'                                              01407000
$TCE10   DC    X'3FDFFC00'                                              01408000
         ORG   $TCA10+13                                                01409000
         DS    CL3                                                      01410000
$TCA11   DS    CL13                                                     01411000
         ORG   $TCA11                                                   01412000
$TCB11   DC    A(580)                                                   01413000
$TCC11   DC    A(0)                                                     01414000
$TCD11   DC    B'00000000'                                              01415000
$TCE11   DC    X'3FBFFC00'                                              01416000
         ORG   $TCA11+13                                                01417000
         DS    CL3                                                      01418000
$TCA12   DS    CL13                                                     01419000
         ORG   $TCA12                                                   01420000
$TCB12   DC    A(582)                                                   01421000
$TCC12   DC    A(61)                                                    01422000
$TCD12   DC    B'01000000'                                              01423000
$TCE12   DC    X'80000000'                                              01424000
         ORG   $TCA12+13                                                01425000
         DS    CL3                                                      01426000
$TCA13   DS    CL13                                                     01427000
         ORG   $TCA13                                                   01428000
$TCB13   DC    A(581)                                                   01429000
$TCC13   DC    A(0)                                                     01430000
$TCD13   DC    B'00000000'                                              01431000
$TCE13   DC    X'02000000'                                              01432000
         ORG   $TCA13+13                                                01433000
         DS    CL3                                                      01434000
$TCA14   DS    CL13                                                     01435000
         ORG   $TCA14                                                   01436000
$TCB14   DC    A(581)                                                   01437000
$TCC14   DC    A(0)                                                     01438000
$TCD14   DC    B'00000000'                                              01439000
$TCE14   DC    X'04000000'                                              01440000
         ORG   $TCA14+13                                                01441000
         DS    CL3                                                      01442000
$TCA15   DS    CL13                                                     01443000
         ORG   $TCA15                                                   01444000
$TCB15   DC    A(580)                                                   01445000
$TCC15   DC    A(61)                                                    01446000
$TCD15   DC    B'01000000'                                              01447000
$TCE15   DC    X'40000000'                                              01448000
         ORG   $TCA15+13                                                01449000
         DS    CL3                                                      01450000
$TCA16   DS    CL13                                                     01451000
         ORG   $TCA16                                                   01452000
$TCB16   DC    A(581)                                                   01453000
$TCC16   DC    A(0)                                                     01454000
$TCD16   DC    B'00000000'                                              01455000
$TCE16   DC    X'80000000'                                              01456000
         ORG   $TCA16+13                                                01457000
         DS    CL3                                                      01458000
$TCA17   DS    CL13                                                     01459000
         ORG   $TCA17                                                   01460000
$TCB17   DC    A(581)                                                   01461000
$TCC17   DC    A(0)                                                     01462000
$TCD17   DC    B'00000000'                                              01463000
$TCE17   DC    X'40000000'                                              01464000
         ORG   $TCA17+13                                                01465000
         DS    CL3                                                      01466000
$TCA18   DS    CL13                                                     01467000
         ORG   $TCA18                                                   01468000
$TCB18   DC    A(581)                                                   01469000
$TCC18   DC    A(0)                                                     01470000
$TCD18   DC    B'00000000'                                              01471000
$TCE18   DC    X'20000000'                                              01472000
         ORG   $TCA18+13                                                01473000
         DS    CL3                                                      01474000
$TCA19   DS    CL13                                                     01475000
         ORG   $TCA19                                                   01476000
$TCB19   DC    A(581)                                                   01477000
$TCC19   DC    A(0)                                                     01478000
$TCD19   DC    B'00000000'                                              01479000
$TCE19   DC    X'10000000'                                              01480000
         ORG   $TCA19+13                                                01481000
         DS    CL3                                                      01482000
$TCA20   DS    CL13                                                     01483000
         ORG   $TCA20                                                   01484000
$TCB20   DC    A(581)                                                   01485000
$TCC20   DC    A(0)                                                     01486000
$TCD20   DC    B'00000000'                                              01487000
$TCE20   DC    X'08000000'                                              01488000
         ORG   $TCA20+13                                                01489000
         DS    CL3                                                      01490000
$TCA21   DS    CL13                                                     01491000
         ORG   $TCA21                                                   01492000
$TCB21   DC    A(581)                                                   01493000
$TCC21   DC    A(0)                                                     01494000
$TCD21   DC    B'00000000'                                              01495000
$TCE21   DC    X'04000000'                                              01496000
         ORG   $TCA21+13                                                01497000
         DS    CL3                                                      01498000
$TCA22   DS    CL13                                                     01499000
         ORG   $TCA22                                                   01500000
$TCB22   DC    A(581)                                                   01501000
$TCC22   DC    A(0)                                                     01502000
$TCD22   DC    B'00000000'                                              01503000
$TCE22   DC    X'02000000'                                              01504000
         ORG   $TCA22+13                                                01505000
         DS    CL3                                                      01506000
$TCA23   DS    CL13                                                     01507000
         ORG   $TCA23                                                   01508000
$TCB23   DC    A(581)                                                   01509000
$TCC23   DC    A(0)                                                     01510000
$TCD23   DC    B'00000000'                                              01511000
$TCE23   DC    X'01000000'                                              01512000
         ORG   $TCA23+13                                                01513000
         DS    CL3                                                      01514000
$TCA24   DS    CL13                                                     01515000
         ORG   $TCA24                                                   01516000
$TCB24   DC    A(581)                                                   01517000
$TCC24   DC    A(0)                                                     01518000
$TCD24   DC    B'00000000'                                              01519000
$TCE24   DC    X'00800000'                                              01520000
         ORG   $TCA24+13                                                01521000
         DS    CL3                                                      01522000
ITATCPRM DS    CL14                                                     01523000
         ORG   ITATCPRM                                                 01524000
@NM00057 DC    X'0102F4F1'                                              01525000
ITATCFR  DS    AL4                                                      01526000
ITATCTO  DS    AL4                                                      01527000
@NM00058 DC    AL1(0)                                                   01528000
         ORG   @NM00058                                                 01529000
ITATCTP  DS    BL1                                                      01530000
         ORG   ITATCPRM+13                                              01531000
ITATCNT  DS    FL1                                                      01532000
         ORG   ITATCPRM+14                                              01533000
         DS    CL2                                                      01534000
PATCH    DC    40F'0'                                                   01535000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01536000
@01      EQU   01                                                       01537000
@02      EQU   02                                                       01538000
@03      EQU   03                                                       01539000
@04      EQU   04                                                       01540000
@05      EQU   05                                                       01541000
@06      EQU   06                                                       01542000
@07      EQU   07                                                       01543000
@08      EQU   08                                                       01544000
@09      EQU   09                                                       01545000
@10      EQU   10                                                       01546000
@11      EQU   11                                                       01547000
@12      EQU   12                                                       01548000
@13      EQU   13                                                       01549000
@14      EQU   14                                                       01550000
@15      EQU   15                                                       01551000
WAPTR    EQU   @02                                                      01552000
R1       EQU   @01                                                      01553000
R15      EQU   @15                                                      01554000
LINKR    EQU   @14                                                      01555000
R0       EQU   @00                                                      01556000
R10      EQU   @10                                                      01557000
R11      EQU   @11                                                      01558000
R12      EQU   @12                                                      01559000
R13      EQU   @13                                                      01560000
R14      EQU   @14                                                      01561000
R2       EQU   @02                                                      01562000
R3       EQU   @03                                                      01563000
R4       EQU   @04                                                      01564000
R5       EQU   @05                                                      01565000
R6       EQU   @06                                                      01566000
R7       EQU   @07                                                      01567000
R8       EQU   @08                                                      01568000
R9       EQU   @09                                                      01569000
$RCAAREA EQU   0                                                        01570000
$POINTER EQU   $RCAAREA+100                                             01571000
$TRTBLA  EQU   $POINTER+124                                             01572000
$CONSTNT EQU   $RCAAREA+244                                             01573000
$RCAFLG  EQU   $RCAAREA+604                                             01574000
TOLTEPWA EQU   0                                                        01575000
$SCTTBLE EQU   TOLTEPWA                                                 01576000
$TESTOPT EQU   $SCTTBLE+2                                               01577000
$ERROPT  EQU   $SCTTBLE+3                                               01578000
$PDEVFLG EQU   $SCTTBLE+10                                              01579000
$CDSFLGS EQU   $SCTTBLE+11                                              01580000
$CDS8T19 EQU   $SCTTBLE+20                                              01581000
$EXECFLG EQU   $SCTTBLE+33                                              01582000
$OLTFLGS EQU   $SCTTBLE+36                                              01583000
$OLTFLG2 EQU   $SCTTBLE+37                                              01584000
$TOTFLG1 EQU   $SCTTBLE+38                                              01585000
$ROUTMSK EQU   $SCTTBLE+40                                              01586000
$CDA     EQU   TOLTEPWA+100                                             01587000
$RCA     EQU   $CDA+44                                                  01588000
$OLTPTR  EQU   $CDA+52                                                  01589000
$LOWADDR EQU   $OLTPTR                                                  01590000
$HIMOREC EQU   $CDA+60                                                  01591000
$COMMFLG EQU   TOLTEPWA+224                                             01592000
$FLAG1   EQU   $COMMFLG                                                 01593000
$FLAG2   EQU   $COMMFLG+1                                               01594000
$FLAG3   EQU   $COMMFLG+2                                               01595000
$FLAG4   EQU   $COMMFLG+3                                               01596000
$FLAG5   EQU   $COMMFLG+4                                               01597000
$EOJ     EQU   $FLAG5                                                   01598000
$CANCEL  EQU   $EOJ                                                     01599000
$FLAG6   EQU   $COMMFLG+5                                               01600000
$CHANGE  EQU   $FLAG6                                                   01601000
$ABNDBIT EQU   $FLAG6                                                   01602000
$FLAG7   EQU   $COMMFLG+6                                               01603000
$FLAG8   EQU   $COMMFLG+7                                               01604000
$TCECM   EQU   $FLAG8                                                   01605000
$FLAG9   EQU   $COMMFLG+8                                               01606000
$REMSW   EQU   $FLAG9                                                   01607000
$COPY    EQU   $FLAG9                                                   01608000
$FLAG10  EQU   $COMMFLG+9                                               01609000
$FLAG11  EQU   $COMMFLG+10                                              01610000
$FLAG12  EQU   $COMMFLG+11                                              01611000
$FLAG13  EQU   $COMMFLG+12                                              01612000
$DEVTBLE EQU   TOLTEPWA+240                                             01613000
$DEVCDS  EQU   $DEVTBLE                                                 01614000
$DEVUNAD EQU   $DEVCDS                                                  01615000
@NM00039 EQU   $DEVUNAD+2                                               01616000
$DEVFEAT EQU   $DEVCDS+4                                                01617000
$DEVCDSF EQU   $DEVCDS+9                                                01618000
$DEVSDCF EQU   $DEVCDS+10                                               01619000
$$SYMNME EQU   $DEVCDS+12                                               01620000
$DEVFLG1 EQU   $DEVTBLE+20                                              01621000
$EVNCPLT EQU   $DEVFLG1                                                 01622000
$ATTNEXP EQU   $DEVFLG1                                                 01623000
$INTOCC  EQU   $DEVFLG1                                                 01624000
$DEVFLG2 EQU   $DEVTBLE+21                                              01625000
$DEVTECB EQU   $DEVTBLE+22                                              01626000
$OPIS    EQU   $DEVTECB                                                 01627000
$OPND    EQU   $DEVTECB+2                                               01628000
$DEVFLG3 EQU   $DEVTBLE+27                                              01629000
$SIOFLG  EQU   $DEVFLG3                                                 01630000
$IFTOUT  EQU   $DEVTBLE+36                                              01631000
$DEVSESP EQU   $IFTOUT                                                  01632000
$SSCPDAF EQU   $IFTOUT+6                                                01633000
$LDNCBPT EQU   $DEVTBLE+48                                              01634000
$RNINFO  EQU   $DEVTBLE+56                                              01635000
$DEVFLG5 EQU   $RNINFO+8                                                01636000
$DEVFLG4 EQU   $DEVTBLE+65                                              01637000
$SLTBL   EQU   TOLTEPWA+1468                                            01638000
$RUNTEST EQU   $SLTBL+13                                                01639000
$TESTFLG EQU   $SLTBL+21                                                01640000
$SECLST  EQU   $SLTBL+22                                                01641000
$INBUFR  EQU   TOLTEPWA+2104                                            01642000
#EXITA   EQU   TOLTEPWA+2632                                            01643000
$CCOMDAT EQU   TOLTEPWA+2644                                            01644000
$CFLGS   EQU   $CCOMDAT+16                                              01645000
$24FEMSG EQU   TOLTEPWA+2681                                            01646000
$24CATMG EQU   $24FEMSG+11                                              01647000
@NM00048 EQU   TOLTEPWA+2776                                            01648000
$OUNTPTR EQU   @NM00048+4                                               01649000
$NSPTR   EQU   $OUNTPTR                                                 01650000
$NSCNT   EQU   @NM00048+10                                              01651000
$ENXX    EQU   @NM00048+15                                              01652000
$IMITX   EQU   $ENXX                                                    01653000
SVESC033 EQU   TOLTEPWA+3160                                            01654000
SVECC013 EQU   TOLTEPWA+3232                                            01655000
SVEIC003 EQU   TOLTEPWA+3592                                            01656000
SVESC022 EQU   TOLTEPWA+3736                                            01657000
SVECC011 EQU   TOLTEPWA+4024                                            01658000
CECOMMAP EQU   0                                                        01659000
CDSMAP   EQU   0                                                        01660000
CDSUA    EQU   CDSMAP                                                   01661000
CDSMFCT  EQU   CDSMAP+4                                                 01662000
CDSMODEL EQU   CDSMFCT                                                  01663000
CDSFEAT  EQU   CDSMFCT+1                                                01664000
CDSCLASS EQU   CDSMFCT+2                                                01665000
CDSTYPE  EQU   CDSMFCT+3                                                01666000
CDSBYTCT EQU   CDSMAP+8                                                 01667000
CDSFLAG  EQU   CDSMAP+9                                                 01668000
CDSSYMBN EQU   CDSMAP+12                                                01669000
CDSEXARA EQU   CDSMAP+20                                                01670000
FRADR    EQU   0                                                        01671000
TOADR    EQU   0                                                        01672000
INPUT    EQU   0                                                        01673000
@NM00054 EQU   0                                                        01674000
I00ACSW  EQU   @NM00054                                                 01675000
CONTSCAN EQU   I00ACSW                                                  01676000
CLASSSW  EQU   I00ACSW                                                  01677000
TYPESW   EQU   I00ACSW                                                  01678000
FLAGSW   EQU   I00ACSW                                                  01679000
UASW     EQU   I00ACSW                                                  01680000
EBCDICSW EQU   I00ACSW                                                  01681000
DBSW     EQU   I00ACSW                                                  01682000
DATASW   EQU   I00ACSW                                                  01683000
@NM00055 EQU   @NM00054+1                                               01684000
ERROR    EQU   @NM00055                                                 01685000
$TRTBL   EQU   0                                                        01686000
#EXIT    EQU   0                                                        01687000
SVECC012 EQU   SVESC022                                                 01688000
SVEIC00A EQU   SVEIC003                                                 01689000
SVEIC004 EQU   SVEIC003                                                 01690000
SVEIC005 EQU   SVEIC003                                                 01691000
SVESC02A EQU   SVESC022                                                 01692000
SVESC02B EQU   SVESC022                                                 01693000
SVESC02D EQU   SVESC022                                                 01694000
SVESC02E EQU   SVESC022                                                 01695000
SVESC02F EQU   SVECC013                                                 01696000
SVESC024 EQU   SVESC022                                                 01697000
SVESC027 EQU   SVESC022                                                 01698000
SVESC029 EQU   SVESC033                                                 01699000
SVESC031 EQU   SVECC013                                                 01700000
SVESC032 EQU   SVECC011                                                 01701000
SVETC037 EQU   SVEIC003                                                 01702000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01703000
@NM00056 EQU   @NM00055                                                 01704000
CDSEXTM  EQU   CDSFLAG+2                                                01705000
CDSEXTB  EQU   CDSFLAG+2                                                01706000
CDSTMERB EQU   CDSFLAG+2                                                01707000
@NM00052 EQU   CDSFLAG+1                                                01708000
CDSDVPRO EQU   CDSFLAG+1                                                01709000
CDSNTPRI EQU   CDSFLAG+1                                                01710000
CDSLINCN EQU   CDSFLAG                                                  01711000
CDSREMSY EQU   CDSFLAG                                                  01712000
CDS2CHAN EQU   CDSFLAG                                                  01713000
CDSSYMB  EQU   CDSFLAG                                                  01714000
CDSEXTPR EQU   CDSFLAG                                                  01715000
CDSFEVOL EQU   CDSFLAG                                                  01716000
CDSSHAR  EQU   CDSFLAG                                                  01717000
CDSFPMD  EQU   CDSFLAG                                                  01718000
@NM00051 EQU   CDSFEAT                                                  01719000
CDSDEVM  EQU   CDSFEAT                                                  01720000
CDSDEVT  EQU   CDSFEAT                                                  01721000
CDSASCII EQU   CDSFEAT                                                  01722000
$CECFLAG EQU   CECOMMAP+20                                              01723000
$CEINCT  EQU   CECOMMAP+16                                              01724000
$CEINADR EQU   CECOMMAP+12                                              01725000
$CEOUTCT EQU   CECOMMAP+8                                               01726000
$CEOUTAD EQU   CECOMMAP+4                                               01727000
$CECIDNT EQU   CECOMMAP+2                                               01728000
$CECLEVL EQU   CECOMMAP+1                                               01729000
$CECTRMG EQU   CECOMMAP                                                 01730000
SVECC010 EQU   TOLTEPWA+3952                                            01731000
SVETC035 EQU   TOLTEPWA+3880                                            01732000
SVESC030 EQU   TOLTEPWA+3808                                            01733000
SVESC020 EQU   TOLTEPWA+3664                                            01734000
SVEIC002 EQU   TOLTEPWA+3520                                            01735000
SVECC014 EQU   TOLTEPWA+3376                                            01736000
SVESC120 EQU   TOLTEPWA+3304                                            01737000
SVESC025 EQU   TOLTEPWA+3088                                            01738000
@NM00050 EQU   TOLTEPWA+2980                                            01739000
$RPLERR  EQU   TOLTEPWA+2977                                            01740000
@NM00049 EQU   TOLTEPWA+2976                                            01741000
$R13PR3  EQU   TOLTEPWA+2972                                            01742000
$CEINT2  EQU   TOLTEPWA+2968                                            01743000
$CEINT1  EQU   TOLTEPWA+2964                                            01744000
$MSGGET  EQU   TOLTEPWA+2960                                            01745000
$ACQLIST EQU   TOLTEPWA+2956                                            01746000
$R4SAVE1 EQU   TOLTEPWA+2952                                            01747000
$CLSISS  EQU   TOLTEPWA+2950                                            01748000
$CLSCNT  EQU   TOLTEPWA+2948                                            01749000
$CUTABLE EQU   TOLTEPWA+2868                                            01750000
$BUFSZ2  EQU   TOLTEPWA+2864                                            01751000
$RESID2  EQU   TOLTEPWA+2860                                            01752000
$OLTCCW2 EQU   TOLTEPWA+2856                                            01753000
$ENDBFR2 EQU   TOLTEPWA+2852                                            01754000
$1STBFR2 EQU   TOLTEPWA+2848                                            01755000
$TECB2   EQU   TOLTEPWA+2844                                            01756000
$BUFSZ1  EQU   TOLTEPWA+2840                                            01757000
$RESID1  EQU   TOLTEPWA+2836                                            01758000
$OLTCCW1 EQU   TOLTEPWA+2832                                            01759000
$ENDBFR1 EQU   TOLTEPWA+2828                                            01760000
$1STBFR1 EQU   TOLTEPWA+2824                                            01761000
$TECB1   EQU   TOLTEPWA+2820                                            01762000
$WAITIME EQU   TOLTEPWA+2816                                            01763000
$TRTN#   EQU   TOLTEPWA+2815                                            01764000
$WIODEV  EQU   TOLTEPWA+2814                                            01765000
$RQSTSZE EQU   TOLTEPWA+2812                                            01766000
$RQSTPTR EQU   TOLTEPWA+2808                                            01767000
$R4SAVE  EQU   TOLTEPWA+2804                                            01768000
$PARTADR EQU   TOLTEPWA+2800                                            01769000
$TBSDATA EQU   TOLTEPWA+2796                                            01770000
$CTWIDTH EQU   TOLTEPWA+2795                                            01771000
$CTLINE  EQU   TOLTEPWA+2794                                            01772000
$APWIDTH EQU   TOLTEPWA+2793                                            01773000
$APLINE  EQU   TOLTEPWA+2792                                            01774000
$INDEX   EQU   $IMITX                                                   01775000
$UMXX    EQU   @NM00048+14                                              01776000
$NSXX    EQU   @NM00048+12                                              01777000
$ATACNT  EQU   $NSCNT                                                   01778000
$CTR     EQU   @NM00048+8                                               01779000
$ATAPTR  EQU   $NSPTR                                                   01780000
$DDRPTR  EQU   @NM00048                                                 01781000
$DTORESP EQU   TOLTEPWA+2712                                            01782000
$APNAME  EQU   TOLTEPWA+2704                                            01783000
$24SYMNE EQU   $24CATMG+4                                               01784000
$24DEVAD EQU   $24CATMG                                                 01785000
$24RTN#  EQU   $24FEMSG+8                                               01786000
$ESECTID EQU   $24FEMSG                                                 01787000
$24FLGS  EQU   TOLTEPWA+2680                                            01788000
$24SAVE2 EQU   TOLTEPWA+2676                                            01789000
$24SAVE1 EQU   TOLTEPWA+2672                                            01790000
$24UNADR EQU   TOLTEPWA+2668                                            01791000
$24SAV13 EQU   TOLTEPWA+2664                                            01792000
$24RETCD EQU   TOLTEPWA+2663                                            01793000
$MACID   EQU   TOLTEPWA+2661                                            01794000
$CSPARE  EQU   $CFLGS                                                   01795000
$C2WAY   EQU   $CFLGS                                                   01796000
$CINCT   EQU   $CCOMDAT+12                                              01797000
$CINADR  EQU   $CCOMDAT+8                                               01798000
$COUTCT  EQU   $CCOMDAT+4                                               01799000
$COUTAD  EQU   $CCOMDAT                                                 01800000
ROOTLOC  EQU   TOLTEPWA+2640                                            01801000
$RETREG  EQU   TOLTEPWA+2636                                            01802000
$WORK    EQU   TOLTEPWA+2376                                            01803000
$EXTA    EQU   TOLTEPWA+2320                                            01804000
$PASSONA EQU   TOLTEPWA+2264                                            01805000
$TRMINPT EQU   TOLTEPWA+2184                                            01806000
$BUFFER  EQU   TOLTEPWA+1976                                            01807000
$TLTRPL3 EQU   TOLTEPWA+1856                                            01808000
$TLTRPL2 EQU   TOLTEPWA+1736                                            01809000
$TLTRPL1 EQU   TOLTEPWA+1616                                            01810000
@NM00047 EQU   $SLTBL+135                                               01811000
$HIGHRTN EQU   $SLTBL+134                                               01812000
$PRIMADR EQU   $SLTBL+130                                               01813000
$CTSTPT  EQU   $SLTBL+128                                               01814000
$TSTCNT  EQU   $SLTBL+126                                               01815000
$SECFLGS EQU   $SECLST+3                                                01816000
$SECTION EQU   $SECLST                                                  01817000
$SECACT  EQU   $TESTFLG                                                 01818000
$CANTRUN EQU   $TESTFLG                                                 01819000
$FINAL   EQU   $TESTFLG                                                 01820000
$TESTSUF EQU   $RUNTEST+5                                               01821000
$TESTNUM EQU   $RUNTEST+1                                               01822000
$LETPRF  EQU   $RUNTEST                                                 01823000
$SYMBOLC EQU   $SLTBL+5                                                 01824000
$FAMILY  EQU   $SLTBL                                                   01825000
$CDEVPT  EQU   TOLTEPWA+1466                                            01826000
$DEVCNTS EQU   TOLTEPWA+1464                                            01827000
$FEEDBCK EQU   $DEVTBLE+66                                              01828000
$WTISUED EQU   $DEVFLG4                                                 01829000
$EXIOISD EQU   $DEVFLG4                                                 01830000
$REMWRIT EQU   $DEVFLG4                                                 01831000
$REMDONE EQU   $DEVFLG4                                                 01832000
$2NDUSED EQU   $DEVFLG4                                                 01833000
$1STUSED EQU   $DEVFLG4                                                 01834000
$IGLXIFB EQU   $DEVFLG4                                                 01835000
$EXIOLV3 EQU   $DEVFLG4                                                 01836000
@NM00046 EQU   $DEVFLG5                                                 01837000
$DVBASIC EQU   $DEVFLG5                                                 01838000
$ASCII   EQU   $DEVFLG5                                                 01839000
$DEVLU   EQU   $DEVFLG5                                                 01840000
$OPNDFAL EQU   $DEVFLG5                                                 01841000
$ACQNCB  EQU   $DEVFLG5                                                 01842000
$REMOTE  EQU   $DEVFLG5                                                 01843000
$ENDNODE EQU   $DEVFLG5                                                 01844000
$LINENME EQU   $RNINFO                                                  01845000
$CID     EQU   $DEVTBLE+52                                              01846000
$DVCOL   EQU   $LDNCBPT+2                                               01847000
$DVROW   EQU   $LDNCBPT                                                 01848000
$NCSPLP  EQU   $DEVTBLE+44                                              01849000
$DVLN    EQU   $SSCPDAF                                                 01850000
$DAF     EQU   $DEVSESP+4                                               01851000
$VARYPAB EQU   $DEVSESP                                                 01852000
$SYSMN   EQU   $DEVTBLE+28                                              01853000
@NM00045 EQU   $DEVFLG3                                                 01854000
$CLRSNT  EQU   $DEVFLG3                                                 01855000
$OLTERR  EQU   $DEVFLG3                                                 01856000
$SRTEST  EQU   $DEVFLG3                                                 01857000
$DVSNDOK EQU   $SIOFLG                                                  01858000
$POLLREQ EQU   $DEVFLG3                                                 01859000
$ACQRED  EQU   $DEVFLG3                                                 01860000
$NOTDEV  EQU   $DEVFLG3                                                 01861000
$DVINCT  EQU   $DEVTBLE+26                                              01862000
$DVBRKST EQU   $OPND+1                                                  01863000
$DVBRKSN EQU   $OPND                                                    01864000
$DVSEQNO EQU   $OPIS                                                    01865000
$CEINTRP EQU   $DEVFLG2                                                 01866000
$TESTMDE EQU   $DEVFLG2                                                 01867000
$DEVALOC EQU   $DEVFLG2                                                 01868000
$ALLDATA EQU   $DEVFLG2                                                 01869000
$ENDCNTL EQU   $DEVFLG2                                                 01870000
$CTLDEV  EQU   $DEVFLG2                                                 01871000
$NOCDS   EQU   $DEVFLG2                                                 01872000
$DATAIN  EQU   $DEVFLG2                                                 01873000
$PRIMARY EQU   $DEVFLG1                                                 01874000
$DVCTBYT EQU   $INTOCC                                                  01875000
$DEVACT  EQU   $DEVFLG1                                                 01876000
$DVLGMDE EQU   $ATTNEXP                                                 01877000
$DVSPRM  EQU   $EVNCPLT                                                 01878000
$GRABBED EQU   $DEVFLG1                                                 01879000
$CATASTR EQU   $DEVFLG1                                                 01880000
$LETGO   EQU   $DEVFLG1                                                 01881000
$CURELEM EQU   $$SYMNME+4                                               01882000
$MSGOTSD EQU   $$SYMNME                                                 01883000
$EXTDEV  EQU   $DEVCDS+11                                               01884000
@NM00044 EQU   $DEVSDCF                                                 01885000
$NOTPRIM EQU   $DEVSDCF                                                 01886000
@NM00043 EQU   $DEVCDSF                                                 01887000
@NM00042 EQU   $DEVCDSF                                                 01888000
@NM00041 EQU   $DEVCDSF                                                 01889000
$CDSNAME EQU   $DEVCDSF                                                 01890000
$EXTRN   EQU   $DEVCDSF                                                 01891000
$CEVOLUM EQU   $DEVCDSF                                                 01892000
$SHARD   EQU   $DEVCDSF                                                 01893000
$DEVFPM  EQU   $DEVCDSF                                                 01894000
$DEVCNT  EQU   $DEVCDS+8                                                01895000
$DEVTYPE EQU   $DEVFEAT+3                                               01896000
$DEVCLAS EQU   $DEVFEAT+2                                               01897000
$DEVFRRS EQU   $DEVFEAT+1                                               01898000
$DEVMOD  EQU   $DEVFEAT                                                 01899000
$DEVRDGT EQU   @NM00039+1                                               01900000
$DEVCTLU EQU   @NM00039+1                                               01901000
$DEVCHAN EQU   @NM00039                                                 01902000
@NM00040 EQU   @NM00039                                                 01903000
$CTINDX  EQU   $DEVUNAD                                                 01904000
$FLAG16  EQU   $COMMFLG+15                                              01905000
$FLAG15  EQU   $COMMFLG+14                                              01906000
$FLAG14  EQU   $COMMFLG+13                                              01907000
$TEP2ND  EQU   $FLAG13                                                  01908000
$TEP1ST  EQU   $FLAG13                                                  01909000
$CATMSG  EQU   $FLAG13                                                  01910000
$PRMPTSW EQU   $FLAG13                                                  01911000
$DEVENT  EQU   $FLAG13                                                  01912000
$OLTMACC EQU   $FLAG13                                                  01913000
$LGON    EQU   $FLAG13                                                  01914000
$CTLOGON EQU   $FLAG13                                                  01915000
@NM00038 EQU   $FLAG12                                                  01916000
$VARYINP EQU   $FLAG12                                                  01917000
$ENDTEST EQU   $FLAG12                                                  01918000
$VRYHRD  EQU   $FLAG12                                                  01919000
$VRYSFT  EQU   $FLAG12                                                  01920000
$POSTFLG EQU   $FLAG12                                                  01921000
$OPTMSG  EQU   $FLAG12                                                  01922000
$FEORCAT EQU   $FLAG11                                                  01923000
@NM00037 EQU   $FLAG11                                                  01924000
@NM00036 EQU   $FLAG10                                                  01925000
$INBND   EQU   $FLAG10                                                  01926000
$WAITFLG EQU   $FLAG10                                                  01927000
$DPRINT  EQU   $FLAG10                                                  01928000
$HOLD    EQU   $FLAG9                                                   01929000
$NOTRRCH EQU   $FLAG9                                                   01930000
@NM00035 EQU   $FLAG9                                                   01931000
$LSTLNSW EQU   $FLAG9                                                   01932000
$MULLNSW EQU   $FLAG9                                                   01933000
$IGRES   EQU   $FLAG9                                                   01934000
$VS2     EQU   $FLAG8                                                   01935000
$VS1     EQU   $FLAG8                                                   01936000
$EDOS    EQU   $FLAG8                                                   01937000
@NM00034 EQU   $FLAG8                                                   01938000
$TWOWAY  EQU   $FLAG8                                                   01939000
@NM00033 EQU   $FLAG8                                                   01940000
$RCVMSG  EQU   $FLAG7                                                   01941000
$RCVRFLG EQU   $FLAG7                                                   01942000
$SNDRFLG EQU   $FLAG7                                                   01943000
$LDOIS   EQU   $FLAG7                                                   01944000
$DCONTCT EQU   $FLAG7                                                   01945000
$EXIOWAT EQU   $FLAG7                                                   01946000
$2NDDATA EQU   $FLAG7                                                   01947000
$1STDATA EQU   $FLAG7                                                   01948000
$CIREQ   EQU   $FLAG6                                                   01949000
$ABTERM  EQU   $ABNDBIT                                                 01950000
$FSTMCIS EQU   $FLAG6                                                   01951000
$DISCREQ EQU   $FLAG6                                                   01952000
$DISCISS EQU   $FLAG6                                                   01953000
$CTERROR EQU   $FLAG6                                                   01954000
$RECAL11 EQU   $FLAG6                                                   01955000
@NM00032 EQU   $FLAG5                                                   01956000
$PROGCK  EQU   $CANCEL                                                  01957000
$PRINTAP EQU   $FLAG5                                                   01958000
@NM00031 EQU   $FLAG5                                                   01959000
$MSG922  EQU   $FLAG5                                                   01960000
$CT924   EQU   $FLAG5                                                   01961000
$FSTCAT  EQU   $FLAG5                                                   01962000
$FSTFE   EQU   $FLAG5                                                   01963000
$ACTOPND EQU   $FLAG4                                                   01964000
$ACQCUTT EQU   $FLAG4                                                   01965000
$CLSSACT EQU   $FLAG4                                                   01966000
$BACKINT EQU   $FLAG4                                                   01967000
$DMSGSW  EQU   $FLAG4                                                   01968000
$TSTDEVP EQU   $FLAG4                                                   01969000
$APRQPER EQU   $FLAG4                                                   01970000
$OPCOM   EQU   $FLAG4                                                   01971000
$NEWAP   EQU   $FLAG3                                                   01972000
$ALTPRTR EQU   $FLAG3                                                   01973000
$OPTERR  EQU   $FLAG3                                                   01974000
$PRTONLY EQU   $FLAG3                                                   01975000
$REQSTOR EQU   $FLAG3                                                   01976000
$LOGOFFE EQU   $FLAG3                                                   01977000
$TSTERR  EQU   $FLAG3                                                   01978000
$DEVERR  EQU   $FLAG3                                                   01979000
$PARTIAL EQU   $FLAG2                                                   01980000
$NRMTERM EQU   $FLAG2                                                   01981000
$VALDTST EQU   $FLAG2                                                   01982000
$VALDDEV EQU   $FLAG2                                                   01983000
$DBLSLSH EQU   $FLAG2                                                   01984000
$NDR     EQU   $FLAG2                                                   01985000
@NM00030 EQU   $FLAG2                                                   01986000
$FTTHR   EQU   $FLAG2                                                   01987000
$OLTACT  EQU   $FLAG1                                                   01988000
$NORELDV EQU   $FLAG1                                                   01989000
@NM00029 EQU   $FLAG1                                                   01990000
$OPTCHNG EQU   $FLAG1                                                   01991000
$DEVCHNG EQU   $FLAG1                                                   01992000
$TESTCNG EQU   $FLAG1                                                   01993000
$CNSLFG  EQU   $FLAG1                                                   01994000
$TEP3RD  EQU   $FLAG1                                                   01995000
@NM00028 EQU   $CDA+120                                                 01996000
$CUCNT   EQU   $CDA+118                                                 01997000
@NM00027 EQU   $CDA+117                                                 01998000
$PRTFORM EQU   $CDA+116                                                 01999000
$OPISCNT EQU   $CDA+114                                                 02000000
$OPNDCNT EQU   $CDA+112                                                 02001000
$GETMSZE EQU   $CDA+110                                                 02002000
$GRCNTS  EQU   $CDA+108                                                 02003000
$CTLCNT  EQU   $CDA+106                                                 02004000
$ACTLVL  EQU   $CDA+105                                                 02005000
$PRNTLVL EQU   $CDA+104                                                 02006000
$ERRCNTA EQU   $CDA+102                                                 02007000
$TLCNT   EQU   $CDA+100                                                 02008000
$TIMEALW EQU   $CDA+96                                                  02009000
$PTRAREA EQU   $CDA+92                                                  02010000
$GETMPTR EQU   $CDA+88                                                  02011000
$R13PTRT EQU   $CDA+84                                                  02012000
$R13PTR  EQU   $CDA+80                                                  02013000
$TEPEND  EQU   $CDA+76                                                  02014000
$PLINKDL EQU   $CDA+72                                                  02015000
$TEPBEGN EQU   $CDA+68                                                  02016000
$FRELPTR EQU   $CDA+64                                                  02017000
$HIGHADR EQU   $HIMOREC                                                 02018000
$LOMOREC EQU   $CDA+56                                                  02019000
$ENDCOMM EQU   $CDA+48                                                  02020000
$COMMON  EQU   $RCA                                                     02021000
$SLASHAD EQU   $CDA+32                                                  02022000
$PASSON  EQU   $CDA+28                                                  02023000
$TOLBRTB EQU   $CDA+24                                                  02024000
$SCTPTR8 EQU   $CDA+20                                                  02025000
$SCTPTR  EQU   $CDA+16                                                  02026000
$TBWDPTR EQU   $CDA+12                                                  02027000
$TFWDPTR EQU   $CDA+8                                                   02028000
@NM00026 EQU   $CDA                                                     02029000
@NM00025 EQU   $SCTTBLE+98                                              02030000
$SCTLWTC EQU   $SCTTBLE+96                                              02031000
$SCTLWTA EQU   $SCTTBLE+92                                              02032000
#EXT     EQU   $SCTTBLE+88                                              02033000
#PASS    EQU   $SCTTBLE+84                                              02034000
#TABLE   EQU   $SCTTBLE+80                                              02035000
#MSGIDAC EQU   $SCTTBLE+78                                              02036000
@NM00024 EQU   $SCTTBLE+71                                              02037000
$RETMASK EQU   $SCTTBLE+70                                              02038000
$R249255 EQU   $ROUTMSK+29                                              02039000
$R241248 EQU   $ROUTMSK+28                                              02040000
$R233240 EQU   $ROUTMSK+27                                              02041000
$R225232 EQU   $ROUTMSK+26                                              02042000
$R217224 EQU   $ROUTMSK+25                                              02043000
$R209216 EQU   $ROUTMSK+24                                              02044000
$R201208 EQU   $ROUTMSK+23                                              02045000
$R193200 EQU   $ROUTMSK+22                                              02046000
$R185192 EQU   $ROUTMSK+21                                              02047000
$R177184 EQU   $ROUTMSK+20                                              02048000
$R169176 EQU   $ROUTMSK+19                                              02049000
$R161168 EQU   $ROUTMSK+18                                              02050000
$R153160 EQU   $ROUTMSK+17                                              02051000
$R145152 EQU   $ROUTMSK+16                                              02052000
$R137144 EQU   $ROUTMSK+15                                              02053000
$R129136 EQU   $ROUTMSK+14                                              02054000
$R121128 EQU   $ROUTMSK+13                                              02055000
$R113120 EQU   $ROUTMSK+12                                              02056000
$R105112 EQU   $ROUTMSK+11                                              02057000
$R097104 EQU   $ROUTMSK+10                                              02058000
$R089096 EQU   $ROUTMSK+9                                               02059000
$R081088 EQU   $ROUTMSK+8                                               02060000
$R073080 EQU   $ROUTMSK+7                                               02061000
$R065072 EQU   $ROUTMSK+6                                               02062000
$R057064 EQU   $ROUTMSK+5                                               02063000
$R049056 EQU   $ROUTMSK+4                                               02064000
$R041048 EQU   $ROUTMSK+3                                               02065000
$R033040 EQU   $ROUTMSK+2                                               02066000
$R025032 EQU   $ROUTMSK+1                                               02067000
$R017024 EQU   $ROUTMSK                                                 02068000
$TOTFLG2 EQU   $SCTTBLE+39                                              02069000
@NM00023 EQU   $TOTFLG1                                                 02070000
@NM00022 EQU   $TOTFLG1                                                 02071000
@NM00021 EQU   $TOTFLG1                                                 02072000
$CURELOD EQU   $TOTFLG1                                                 02073000
$CTEQTT  EQU   $TOTFLG1                                                 02074000
@NM00020 EQU   $TOTFLG1                                                 02075000
@NM00019 EQU   $TOTFLG1                                                 02076000
$LINESHR EQU   $TOTFLG1                                                 02077000
@NM00018 EQU   $OLTFLG2                                                 02078000
@NM00017 EQU   $OLTFLG2                                                 02079000
@NM00016 EQU   $OLTFLG2                                                 02080000
@NM00015 EQU   $OLTFLG2                                                 02081000
@NM00014 EQU   $OLTFLG2                                                 02082000
@NM00013 EQU   $OLTFLG2                                                 02083000
@NM00012 EQU   $OLTFLG2                                                 02084000
$TALK    EQU   $OLTFLG2                                                 02085000
$DYCOM   EQU   $OLTFLGS                                                 02086000
@NM00011 EQU   $OLTFLGS                                                 02087000
$TRACE   EQU   $OLTFLGS                                                 02088000
$RETCODE EQU   $OLTFLGS                                                 02089000
$CONTCB  EQU   $OLTFLGS                                                 02090000
$RETAIN  EQU   $OLTFLGS                                                 02091000
$CLEANRT EQU   $OLTFLGS                                                 02092000
$MANINTV EQU   $OLTFLGS                                                 02093000
$OLTSIZE EQU   $SCTTBLE+34                                              02094000
$QSCTMOD EQU   $EXECFLG                                                 02095000
$CTRLMOD EQU   $EXECFLG                                                 02096000
$CLEANUP EQU   $EXECFLG                                                 02097000
$LSTPDEV EQU   $EXECFLG                                                 02098000
$ERRCNT  EQU   $EXECFLG                                                 02099000
$RTNSLCT EQU   $EXECFLG                                                 02100000
$MULTDEV EQU   $EXECFLG                                                 02101000
@NM00010 EQU   $EXECFLG                                                 02102000
$RMSKCNT EQU   $SCTTBLE+32                                              02103000
$SYNAME  EQU   $CDS8T19+4                                               02104000
$EXTSIG  EQU   $CDS8T19+3                                               02105000
$CDFLGS  EQU   $CDS8T19+1                                               02106000
$CDSCNT  EQU   $CDS8T19                                                 02107000
$PDEVDSC EQU   $SCTTBLE+16                                              02108000
$PDEVADR EQU   $SCTTBLE+12                                              02109000
$COMMCN  EQU   $CDSFLGS                                                 02110000
$CUSTSYM EQU   $CDSFLGS                                                 02111000
$TWOCHSW EQU   $CDSFLGS                                                 02112000
$SYMNAME EQU   $CDSFLGS                                                 02113000
$EXTINTC EQU   $CDSFLGS                                                 02114000
$CEVOL   EQU   $CDSFLGS                                                 02115000
$SHARED  EQU   $CDSFLGS                                                 02116000
$FPM     EQU   $CDSFLGS                                                 02117000
$LASTSUB EQU   $PDEVFLG                                                 02118000
@NM00009 EQU   $PDEVFLG                                                 02119000
@NM00008 EQU   $PDEVFLG                                                 02120000
@NM00007 EQU   $PDEVFLG                                                 02121000
$LASTDEV EQU   $PDEVFLG                                                 02122000
@NM00006 EQU   $PDEVFLG                                                 02123000
$EXFILPT EQU   $PDEVFLG                                                 02124000
$FPMOLD  EQU   $PDEVFLG                                                 02125000
$TSSSYM  EQU   $SCTTBLE+8                                               02126000
$SCTLEVL EQU   $SCTTBLE+7                                               02127000
$DRIVER  EQU   $SCTTBLE+6                                               02128000
$RT0916  EQU   $SCTTBLE+5                                               02129000
$RT0108  EQU   $SCTTBLE+4                                               02130000
$LOOPTST EQU   $ERROPT                                                  02131000
$LOOPERR EQU   $ERROPT                                                  02132000
$NERRPRT EQU   $ERROPT                                                  02133000
$NOCNTRL EQU   $ERROPT                                                  02134000
$ALTPRNT EQU   $ERROPT                                                  02135000
$CATERR  EQU   $ERROPT                                                  02136000
$ASTERIK EQU   $ERROPT                                                  02137000
$TESTERR EQU   $ERROPT                                                  02138000
$FSTCOMM EQU   $TESTOPT                                                 02139000
$INDEFLP EQU   $TESTOPT                                                 02140000
$NOPRT   EQU   $TESTOPT                                                 02141000
$PARAPRT EQU   $TESTOPT                                                 02142000
@NM00005 EQU   $TESTOPT                                                 02143000
$ERRLPCT EQU   $SCTTBLE                                                 02144000
$TLTEND  EQU   $RCAAREA+945                                             02145000
$CNSLID  EQU   $RCAAREA+936                                             02146000
$EXITSAV EQU   $RCAAREA+864                                             02147000
$TRASCII EQU   $RCAAREA+608                                             02148000
@NM00004 EQU   $RCAAREA+605                                             02149000
$VTAMEND EQU   $RCAFLG                                                  02150000
$TPPOSTD EQU   $RCAFLG                                                  02151000
$NEWCT   EQU   $RCAFLG                                                  02152000
$ABNDALL EQU   $RCAFLG                                                  02153000
$CUTESTB EQU   $RCAFLG                                                  02154000
$CONSOLE EQU   $RCAFLG                                                  02155000
$TPLOGON EQU   $RCAFLG                                                  02156000
$UPDATE  EQU   $RCAFLG                                                  02157000
$DEVAREA EQU   $RCAAREA+600                                             02158000
$CTDVAR  EQU   $RCAAREA+596                                             02159000
$BUFFS   EQU   $RCAAREA+464                                             02160000
$TLTNIB  EQU   $CONSTNT+140                                             02161000
$TLTPRPL EQU   $CONSTNT+20                                              02162000
@NM00003 EQU   $CONSTNT+4                                               02163000
@NM00002 EQU   $CONSTNT+2                                               02164000
$USECNT  EQU   $CONSTNT                                                 02165000
$CURRTWA EQU   $POINTER+140                                             02166000
$CTNAME  EQU   $POINTER+132                                             02167000
$CTARGX  EQU   $POINTER+128                                             02168000
$COMINT  EQU   $POINTER+120                                             02169000
$QUEHNDL EQU   $POINTER+116                                             02170000
@NM00001 EQU   $POINTER+36                                              02171000
$RTNPTR  EQU   $POINTER+32                                              02172000
$TLTECB2 EQU   $POINTER+28                                              02173000
$TLTECB1 EQU   $POINTER+24                                              02174000
$CLEANP  EQU   $POINTER+20                                              02175000
$ABEND   EQU   $POINTER+16                                              02176000
$LSTAREA EQU   $POINTER+12                                              02177000
$FSTAREA EQU   $POINTER+8                                               02178000
$CVTSAVE EQU   $POINTER+4                                               02179000
$TOLTEP  EQU   $POINTER                                                 02180000
$TLTACB  EQU   $RCAAREA                                                 02181000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02182000
@RT00100 EQU   I00AC01C                                                 02183000
@RT00106 EQU   I00AC03                                                  02184000
@RT00130 EQU   I00AC09A                                                 02185000
@RT00139 EQU   I00AC08A                                                 02186000
@RT00154 EQU   I00AC04                                                  02187000
@RT00157 EQU   I00AC03B                                                 02188000
@RT00160 EQU   I00AC03B                                                 02189000
@RT00163 EQU   I00AC02                                                  02190000
@RT00172 EQU   I00AC05                                                  02191000
@RT00175 EQU   I00AC04A                                                 02192000
@RT00178 EQU   I00AC04A                                                 02193000
@RT00181 EQU   I00AC02                                                  02194000
@RT00190 EQU   I00AC06                                                  02195000
@RT00193 EQU   I00AC05A                                                 02196000
@RT00196 EQU   I00AC05A                                                 02197000
@RT00200 EQU   I00AC02                                                  02198000
@RT00209 EQU   I00AC07                                                  02199000
@RT00212 EQU   I00AC06A                                                 02200000
@RT00215 EQU   I00AC06A                                                 02201000
@RT00219 EQU   I00AC02                                                  02202000
@RT00228 EQU   I00AC08                                                  02203000
@RT00231 EQU   I00AC07A                                                 02204000
@RT00234 EQU   I00AC07A                                                 02205000
@RT00238 EQU   I00AC02                                                  02206000
@RT00247 EQU   I00AC09                                                  02207000
@RT00249 EQU   I00AC08B                                                 02208000
@RT00252 EQU   I00AC081                                                 02209000
@RT00254 EQU   I00AC08B                                                 02210000
@RT00260 EQU   I00AC08B                                                 02211000
@RT00270 EQU   I00AC08B                                                 02212000
@RT00275 EQU   I00AC02                                                  02213000
@RT00283 EQU   I00AC01C                                                 02214000
@RT00286 EQU   I00AC0A                                                  02215000
@RT00288 EQU   I00AC09B                                                 02216000
@RT00291 EQU   I00AC09B                                                 02217000
@RT00300 EQU   I00AC09B                                                 02218000
@RT00304 EQU   I00AC02                                                  02219000
@RT00312 EQU   I00AC01C                                                 02220000
@RT00315 EQU   I00AC0B                                                  02221000
@RT00318 EQU   I00AC0AA                                                 02222000
@RT00320 EQU   I00AC0AC                                                 02223000
@RT00325 EQU   I00AC0AC                                                 02224000
@RT00333 EQU   I00AC0AC                                                 02225000
@RC00335 EQU   @RC00330                                                 02226000
@RT00341 EQU   I00AC0AC                                                 02227000
@RT00345 EQU   I00AC0AC                                                 02228000
@RT00348 EQU   I00AC0AC                                                 02229000
@RT00358 EQU   I00AC02                                                  02230000
@RT00367 EQU   I00ACRET                                                 02231000
@RC00374 EQU   @EL00001                                                 02232000
@RF00389 EQU   @EL00001                                                 02233000
@RT00400 EQU   I00ACL02                                                 02234000
@RT00438 EQU   I00ACL01                                                 02235000
@RC00377 EQU   @RC00374                                                 02236000
@RF00382 EQU   @RC00374                                                 02237000
@ENDDATA EQU   *                                                        02238000
         END   ISTIC00A,(C'PLS2056',0702,80232)                         02239000
