SVTM     TITLE ' SSCP  ISTINFY1  OS/VS APUNS TRANS I/O EXEC'            00001000
ISTINCY1 CSECT ,                                                01S0001 00002000
@MAINENT DS    0H                                               01S0001 00003000
         USING *,@15                                            01S0001 00004000
         B     @PROLOG                                          01S0001 00005000
         DC    AL1(16)                                          01S0001 00006000
         DC    C'ISTINCY1  80.267'                              01S0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00009000
         BALR  @12,0                                            01S0001 00010000
@PSTART  DS    0H                                               01S0001 00011000
         USING @PSTART,@12                                      01S0001 00012000
         PRINT OFF                                                      00013000
         PRINT ON                                                       00014000
         PRINT OFF                                                      00015000
         PRINT ON                                                       00016000
*      /* MAINLINE CODE OF ISTINFY1  */                         01S0539 00017000
* R1INPUT = R1;         /* SAVE ADDR(INPUT PARAMETER LIST) */   01S0539 00018000
         LR    R1INPUT,R1                                       01S0539 00019000
* RFY FY1PARML BASED(R1INPUT);     /* ADDRESSABILITY FOR PLIST */       00020000
* RFY GTSTOREG RSTD;       /* RESTRICT GETSTORE OUTPUT REG */   01S0541 00021000
*   DO; /* GETSTOR  SIZE(LENGTH(FY1WORKA)+@SIZDATD-4)TYPE(PAGEABLE)CLEA 00022000
*(NO)SAVE(NO) */                                                01S0542 00023000
*                                                               01S0543 00024000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */               01S0543 00025000
*/* END OF ATBUILD */                                           01S0543 00026000
*                                                               01S0543 00027000
*                                                               01S0543 00028000
*   DO;                                                         01S0543 00029000
*   END;                                                        01S0544 00030000
*                                                               01S0545 00031000
*                                                               01S0545 00032000
*   DO;                                                         01S0545 00033000
*   RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;                     01S0546 00034000
*   END;                                                        01S0547 00035000
*     GPR00F = LENGTH(FY1WORKA)+@SIZDATD-4;            /*SIZE IN REG0*/ 00036000
         L     GPR00F,@SIZDATD                                  01S0548 00037000
         SL    GPR00F,@CF03374                                  01S0548 00038000
*     DCL 1 CMZA0006 FIXED(31) STATIC LOCAL,                    01S0549 00039000
*           2 * FIXED(8) INIT(0),                    /* OPTION FLAGS */ 00040000
*           2 * FIXED(8) INIT(96),                    /* STORAGE KEY */ 00041000
*           2 * FIXED(8) INIT(231),                /* SUBPOOL NUMBER */ 00042000
*           2 * FIXED(8) INIT('00'X);                /* REQUEST TYPE */ 00043000
*     GPR03F = CMZA0006;                                        01S0550 00044000
*                                                               01S0550 00045000
         L     GPR03F,CMZA0006                                  01S0550 00046000
*   DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */               01S0551 00047000
*     GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/               01S0552 00048000
         L     GPR02P,ATCLCPTR                                  01S0552 00049000
*   END; /*LISATCVT*/                                           01S0553 00050000
*     CALL GPR02P -> ATCGTSTR;                        /*CALL ISTORFSR*/ 00051000
*                                                               01S0554 00052000
*                                                               01S0554 00053000
         L     @15,ATCGTSTR(,GPR02P)                            01S0554 00054000
         BALR  @14,@15                                          01S0554 00055000
*   DO;                                                         01S0555 00056000
*   RFY (GPR00P,GPR01P,GPR02P,GPR03P) UNRSTD;                   01S0556 00057000
*   END;                                                        01S0557 00058000
*                                                               01S0558 00059000
*   END;/* GETSTOR */                                           01S0558 00060000
* IF R15^=0                          /*GETSTORE OK ? */         01S0559 00061000
*    THEN RETCODE = THRTYTWO;               /* SET RC = 32  */  01S0559 00062000
         LTR   R15,R15                                          01S0559 00063000
         BZ    @RF00559                                         01S0559 00064000
         LA    RETCODE,32                                       01S0560 00065000
*      ELSE DO;                             /*GETSTOR OK    */  01S0561 00066000
         B     @RC00559                                         01S0561 00067000
@RF00559 DS    0H                                               01S0562 00068000
*      R15  = R13;                /*TEMP SAVE CALLERS REGSV PTR*/       00069000
         LR    R15,R13                                          01S0562 00070000
*      R13 =GTSTOREG;                /* REG SAVE PTR      */    01S0563 00071000
         LR    R13,GTSTOREG                                     01S0563 00072000
* RFY GTSTOREG UNRSTD;                                          01S0564 00073000
* RFY FY1WORKA BASED(R13);  /* ADDRESSABILITY FOR WORK AREA */  01S0565 00074000
* R15->FY1FWDPT = R13;              /* SET CALLERS FORWARD PTR */       00075000
         ST    R13,FY1FWDPT(,R15)                               01S0566 00076000
* R13->FY1BAKPT = R15;             /* SET ISTINFY1 BACK PTR */  01S0567 00077000
         ST    R15,FY1BAKPT(,R13)                               01S0567 00078000
* R13-> FY1FWDPT = 0;           /* ZERO ISTINFY1 FORWARD PTR */ 01S0568 00079000
         SLR   @14,@14                                          01S0568 00080000
         ST    @14,FY1FWDPT(,R13)                               01S0568 00081000
* R10 = ADDR(FY1EXTRA);           /* GET ADDR OF COMPILER VARIABLES */  00082000
         LA    R10,FY1EXTRA(,R13)                               01S0569 00083000
* GEN REFS(R10);                                                01S0570 00084000
      USING @DATD,R10            ADDRESSABILITY FOR COMPILER VARIABLES  00085000
*      RFY ISTNCSPL BASED(FY1NCSPL);       /* BASE FOR NCSPL */ 01S0571 00086000
*                                                               01S0571 00087000
*        FY1IOB = FY1IOB && FY1IOB;          /* ZERO IOB   */   01S0572 00088000
         XC    FY1IOB(40,R13),FY1IOB(R13)                       01S0572 00089000
*        FY1IOBW1= IOBWORD1;               /* INIT FIRST WD IOB */      00090000
         MVC   FY1IOBW1(4,R13),@CB03274                         01S0573 00091000
*        FY1IOBW2 = ADDR(FY1ECB);       /* W2 IOB = @ ECB */    01S0574 00092000
         LA    @14,FY1ECB(,R13)                                 01S0574 00093000
         ST    @14,FY1IOBW2(,R13)                               01S0574 00094000
*        FY1IOBW5 = FY1CHPGM;               /* W5 IOB = @ CHAN PGM*/    00095000
         L     @14,FY1CHPGM(,R1INPUT)                           01S0575 00096000
         ST    @14,FY1IOBW5(,R13)                               01S0575 00097000
*        FY1IOBW6 = NCSPLRPT->RPRNSNEA->RPRNCBA->ICNDCBAD;      01S0576 00098000
         L     @14,FY1NCSPL(,R1INPUT)                           01S0576 00099000
         L     @14,NCSPLRPT(,@14)                               01S0576 00100000
         L     @14,RPRNSNEA(,@14)                               01S0576 00101000
         L     @14,RPRNCBA(,@14)                                01S0576 00102000
         L     @09,ICNDCBAD-1(,@14)                             01S0576 00103000
         LA    @09,0(,@09)                                      01S0576 00104000
         ST    @09,FY1IOBW6(,R13)                               01S0576 00105000
*        FY1CC3WE = '1'B;                   /* POST ON CC=3  @ZA27624*/ 00106000
*                                                               01S0577 00107000
         OI    FY1CC3WE(R13),B'01000000'                        01S0577 00108000
*        ACDEBPTR = NCSPLRPT->RPRNSNEA->RPRNCBA->ICNDEBAD;      01S0578 00109000
         L     ACDEBPTR,ICNDEBAD-1(,@14)                        01S0578 00110000
         LA    ACDEBPTR,0(,ACDEBPTR)                            01S0578 00111000
*        ICNCBPTR = NCSPLRPT->RPRNSNEA->RPRNCBA;           /*@AM00431*/ 00112000
         LR    ICNCBPTR,@14                                     01S0579 00113000
*        RFY ISTACDEB BASED(ACDEBPTR); /* BASEING FOR ACDEB */  01S0580 00114000
*        RFY ISTICNCB BASED(ICNCBPTR); /* BASEING FOR ICNCB  @AM00431*/ 00115000
*                                                               01S0581 00116000
*        FY1ECB=ZERO;       /* ZERO ECB */                      01S0582 00117000
         SLR   @14,@14                                          01S0582 00118000
         ST    @14,FY1ECB(,R13)                                 01S0582 00119000
*   EVAL(FY1IOBW6+FORTFOUR)->DCBBITS=FY1BITON; /* BITS ON */    01S0583 00120000
         LA    @14,44                                           01S0583 00121000
         AL    @14,FY1IOBW6(,R13)                               01S0583 00122000
         OI    DCBBITS(@14),B'00001100'                         01S0583 00123000
*        FAPPADSV = ICNAPPAD;       /* SAVE CURRENT STATUS   @AM00431*/ 00124000
         L     FAPPADSV,ICNAPPAD-1(,ICNCBPTR)                   01S0584 00125000
         LA    FAPPADSV,0(,FAPPADSV)                            01S0584 00126000
*        ICNAPPAD = ADDR(ATCDAPVT); /*UNHOOK TPIOS APPENDAGE @AM00431*/ 00127000
*                                                               01S0585 00128000
         L     @14,ATCLCPTR                                     01S0585 00129000
         LA    @14,ATCDAPVT(,@14)                               01S0585 00130000
         STCM  @14,7,ICNAPPAD(ICNCBPTR)                         01S0585 00131000
*               /* END OF INITILIZATION OF IOB  */              01S0586 00132000
*                                                               01S0586 00133000
*/*VMDESET  ((15),ZERO,(2))*/                                   01S0586 00134000
*      DO;                               /* INVOKE MODESET MACRO    */  00135000
*        GEN SETS (2);                                          01S0587 00136000
*                                                               01S0587 00137000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      00138000
*      DO; /* CMZMREG (15) RESTRICT */                          01S0588 00139000
*      RFY (GPR15P) RSTD;                                       01S0589 00140000
*                                                               01S0589 00141000
*      END;/* CMZMREG */                                        01S0590 00142000
*        GPR15F=0;                                              01S0591 00143000
*                                                               01S0591 00144000
         SLR   GPR15F,GPR15F                                    01S0591 00145000
*      DO; /* CMZMREG (15) RELEASE */                           01S0592 00146000
*      RFY (GPR15P) UNRSTD;                                     01S0593 00147000
*                                                               01S0593 00148000
*      END;/* CMZMREG */                 /*PUT RETURN CODE IN RCREG*/   00149000
*      END;  /* VMDESET */                            /*@VS44020*/      00150000
*      R1 = ADDR(ICNUCBAD);                    /*PASS UCB    @VS44020*/ 00151000
         LA    R1,ICNUCBAD(,ICNCBPTR)                           01S0596 00152000
*      CALL ATCVIOPM;           /*GET PATH ASSUME SUCCESS    @VS44020*/ 00153000
*                                                               01S0597 00154000
         L     @09,ATCLCPTR                                     01S0597 00155000
         L     @15,ATCVIOPM(,@09)                               01S0597 00156000
         BALR  @14,@15                                          01S0597 00157000
*/*VMDESET  ((15),,,(2))*/                                      01S0598 00158000
*       DO;                              /* INVOKE MODESET MACRO    */  00159000
*         GEN SETS (2);                                         01S0599 00160000
*                                                               01S0599 00161000
         MODESET KEYADDR=(2),WORKREG=2                                  00162000
*       DO; /* CMZMREG (15) RESTRICT */                         01S0600 00163000
*       RFY (GPR15P) RSTD;                                      01S0601 00164000
*                                                               01S0601 00165000
*       END;/* CMZMREG */                                       01S0602 00166000
*         GPR15F=0;                                             01S0603 00167000
*                                                               01S0603 00168000
         SLR   GPR15F,GPR15F                                    01S0603 00169000
*       DO; /* CMZMREG (15) RELEASE */                          01S0604 00170000
*       RFY (GPR15P) UNRSTD;                                    01S0605 00171000
*                                                               01S0605 00172000
*       END;/* CMZMREG */                /*PUT RETURN CODE IN RCREG*/   00173000
*       END;  /* VMDESET */                              /*@VS44020*/   00174000
*        R1 = ADDR(FY1IOB);          /* ADDR OF IOB */          01S0608 00175000
         LA    R1,FY1IOB(,R13)                                  01S0608 00176000
* GEN CODE SETS(FY1IOB,FY1ECB) REFS(R1);                   /*@AM00432*/ 00177000
         EXCP (R1)                                                      00178000
         WAIT ECB=FY1ECB(,13)                                           00179000
*       IF FY1ECBRC = FY1IONRM              /*I/O COMP NORM?*/  01S0610 00180000
*         & FY1CSWST = FY1CEDE              /* AND CE, DE ONLY */       00181000
*         THEN                              /* YES  */          01S0610 00182000
         CLI   FY1ECBRC(R13),X'7F'                              01S0610 00183000
         BNE   @RF00610                                         01S0610 00184000
         CLC   FY1CSWST(2,R13),@CB00905                         01S0610 00185000
         BNE   @RF00610                                         01S0610 00186000
*           RETCODE = ZERO;                /* GOOD RC  */       01S0611 00187000
         SLR   RETCODE,RETCODE                                  01S0611 00188000
*         ELSE DO;                          /* NOT NORM I/O */  01S0612 00189000
         B     @RC00610                                         01S0612 00190000
@RF00610 DS    0H                                               01S0613 00191000
*           IF FY1SIOCC = FY1BITON          /* SIO CC = 3? */   01S0613 00192000
*              THEN                         /* YES  */          01S0613 00193000
         TM    FY1SIOCC(R13),B'00110000'                        01S0613 00194000
         BNO   @RF00613                                         01S0613 00195000
*                RETCODE = EIGHT;          /* RC = 8  */        01S0614 00196000
         LA    RETCODE,8                                        01S0614 00197000
*              ELSE DO;                     /* SIO CC ^=3 */    01S0615 00198000
         B     @RC00613                                         01S0615 00199000
@RF00613 DS    0H                                               01S0616 00200000
*                RETCODE = FOUR;           /* RC = 4  */        01S0616 00201000
         LA    RETCODE,4                                        01S0616 00202000
*                FYENDCSW->FY1CSW = FY1IOBW3;                   01S0617 00203000
         L     @14,FYENDCSW(,R1INPUT)                           01S0617 00204000
         MVC   FY1CSW(8,@14),FY1IOBW3(R13)                      01S0617 00205000
*                FY1SENSE->CY1SENS = FY1SDATA;                  01S0618 00206000
         L     @14,FY1SENSE(,R1INPUT)                           01S0618 00207000
         MVC   CY1SENS(2,@14),FY1SDATA(R13)                     01S0618 00208000
*                   END;                    /* END SIO CC ^=3 */        00209000
*              END;                         /* END NOT NORM I/O */      00210000
*                                                               01S0620 00211000
@RC00613 DS    0H                                               01S0621 00212000
*          ICNAPPAD = FAPPADSV;      /* HOOK UP TPIOS APDG   @AM00431*/ 00213000
@RC00610 STCM  FAPPADSV,7,ICNAPPAD(ICNCBPTR)                    01S0621 00214000
*   EVAL(FY1IOBW6+FORTFOUR)->DCBBITS=FY1BTOFF; /* BITS ON    @AM00430*/ 00215000
         LA    @14,44                                           01S0622 00216000
         AL    @14,FY1IOBW6(,R13)                               01S0622 00217000
         NI    DCBBITS(@14),B'11110011'                         01S0622 00218000
*    R13 = R13->FY1BAKPT;    /* RESTORE ADDR CALLER SAVE AREA */        00219000
         L     R13,FY1BAKPT(,R13)                               01S0623 00220000
*    R11 = RETCODE;        /* SAVE EXTERNAL RETURN CODE */      01S0624 00221000
*                                                               01S0624 00222000
         LR    R11,RETCODE                                      01S0624 00223000
*     DO; /* FREESTOR  AREA((R13->FY1FWDPT))SIZE(LENGTH(FY1WORKA)+@SIZD 00224000
*TD-4)TYPE(PAGEABLE)CLEAR(NO)SAVE(NO) */                        01S0625 00225000
*                                                               01S0626 00226000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */               01S0626 00227000
*/* END OF ATBUILD */                                           01S0626 00228000
*                                                               01S0626 00229000
*                                                               01S0626 00230000
*     DO;                                                       01S0626 00231000
*     END;                                                      01S0627 00232000
*                                                               01S0628 00233000
*                                                               01S0628 00234000
*     DO;                                                       01S0628 00235000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;                   01S0629 00236000
*     END;                                                      01S0630 00237000
*       GPR00F = LENGTH(FY1WORKA)+@SIZDATD-4;          /*SIZE IN REG0*/ 00238000
         L     GPR00F,@SIZDATD                                  01S0631 00239000
         SL    GPR00F,@CF03374                                  01S0631 00240000
*       DCL 1 CMZA0044 FIXED(31) STATIC LOCAL,                  01S0632 00241000
*             2 * FIXED(8) INIT(0),                  /* OPTION FLAGS */ 00242000
*             2 * FIXED(8) INIT(96),                  /* STORAGE KEY */ 00243000
*             2 * FIXED(8) INIT(231),              /* SUBPOOL NUMBER */ 00244000
*             2 * FIXED(8) INIT('01'X);              /* REQUEST TYPE */ 00245000
*       GPR03F = CMZA0044;                                      01S0633 00246000
*                                                               01S0633 00247000
*                                                               01S0633 00248000
         L     GPR03F,CMZA0044                                  01S0633 00249000
*     DO;                                                       01S0634 00250000
*     RFY (GPR04P) RSTD;                                        01S0635 00251000
*     END;                                                      01S0636 00252000
*       GPR04P = (R13->FY1FWDPT);         /*PUT FREEMAIN ADDR IN REG4*/ 00253000
*                                                               01S0637 00254000
         L     GPR04P,FY1FWDPT(,R13)                            01S0637 00255000
*     DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */             01S0638 00256000
*       GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/             01S0639 00257000
         L     GPR02P,ATCLCPTR                                  01S0639 00258000
*     END; /*LISATCVT*/                                         01S0640 00259000
*       CALL GPR02P -> ATCGTSTR;                      /*CALL ISTORFSR*/ 00260000
*                                                               01S0641 00261000
*                                                               01S0641 00262000
         L     @15,ATCGTSTR(,GPR02P)                            01S0641 00263000
         BALR  @14,@15                                          01S0641 00264000
*     DO;                                                       01S0642 00265000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P) UNRSTD;          01S0643 00266000
*     END;                                                      01S0644 00267000
*                                                               01S0645 00268000
*     END;/* FREESTOR */                                        01S0645 00269000
*                                                               01S0645 00270000
*                                                               01S0645 00271000
*    END;                           /* END GET STOR OK */       01S0646 00272000
*RETURN CODE(R11);      /* RETURN TO THE CALLER */              01S0647 00273000
*                                                               01S0647 00274000
@RC00559 LR    @15,R11                                          01S0647 00275000
         L     @14,12(,@13)                                     01S0647 00276000
         LM    @00,@12,20(@13)                                  01S0647 00277000
         BR    @14                                              01S0647 00278000
*   DO; /* TPEPILOG   */                                        01S0648 00279000
*                                                               01S0649 00280000
*   GEN (PRINT OFF);                                            01S0649 00281000
*                                                               01S0649 00282000
         PRINT OFF                                                      00283000
*   DO;                                                         01S0650 00284000
*   DCL GPR00F FIXED(31) REG(00),GPR00P PTR(31) REG(00),GPR01F FIXED(31 00285000
* REG(01),GPR01P PTR(31) REG(01),GPR02F FIXED(31) REG(02),GPR02P PTR(31 00286000
* REG(02),GPR03F FIXED(31) REG(03),GPR03P PTR(31) REG(03),GPR04F FIXED( 00287000
*1) REG(04),GPR04P PTR(31) REG(04),GPR05F FIXED(31) REG(05),GPR05P PTR( 00288000
*1) REG(05),GPR06F FIXED(31) REG(06),GPR06P PTR(31) REG(06),GPR07F FIXE 00289000
*(31) REG(07),GPR07P PTR(31) REG(07),GPR08F FIXED(31) REG(08),GPR08P PT 00290000
*(31) REG(08),GPR09F FIXED(31) REG(09),GPR09P PTR(31) REG(09),GPR10F FI 00291000
*ED(31) REG(10),GPR10P PTR(31) REG(10),GPR11F FIXED(31) REG(11),GPR11P  00292000
*TR(31) REG(11),GPR12F FIXED(31) REG(12),GPR12P PTR(31) REG(12),GPR13F  00293000
*IXED(31) REG(13),GPR13P PTR(31) REG(13),GPR14F FIXED(31) REG(14),GPR14 00294000
* PTR(31) REG(14),GPR15F FIXED(31) REG(15),GPR15P PTR(31) REG(15);      00295000
*   END;                                                        01S0652 00296000
*                                                               01S0653 00297000
*   GEN (PRINT ON);                                             01S0653 00298000
         PRINT ON                                                       00299000
*   END;/* TPEPILOG */                                          01S0654 00300000
*      END                   /* END OF PROCEDURE ISTINFY1 */    01S0655 00301000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00302000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                        * 00303000
*/*%INCLUDE SYSLIB  (IHASRB  )                                        * 00304000
*/*%INCLUDE SYSLIB  (IEZIOB  )                                        * 00305000
*;                                                              01S0655 00306000
@EL00001 DS    0H                                               01S0655 00307000
@EF00001 DS    0H                                               01S0655 00308000
@ER00001 LM    @14,@12,12(@13)                                  01S0655 00309000
         BR    @14                                              01S0655 00310000
@DATA    DS    0H                                                       00311000
@DATD    DSECT                                                          00312000
         DS    0F                                                       00313000
ISTINCY1 CSECT                                                          00314000
         DS    0F                                                       00315000
@CF03374 DC    F'-120'                                                  00316000
@DATD    DSECT                                                          00317000
         DS    0D                                                       00318000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00319000
@ENDDATD EQU   *                                                        00320000
ISTINCY1 CSECT                                                          00321000
         DS    0F                                                       00322000
@SIZDATD DC    AL1(0)                                                   00323000
         DC    AL3(@ENDDATD-@DATD)                                      00324000
         DS    0D                                                       00325000
CMZA0006 DS    FL4                                                      00326000
         ORG   CMZA0006                                                 00327000
@NM00250 DC    AL1(0)                                                   00328000
@NM00251 DC    AL1(96)                                                  00329000
@NM00252 DC    AL1(231)                                                 00330000
@NM00253 DC    XL1'00'                                                  00331000
         ORG   CMZA0006+4                                               00332000
CMZA0044 DS    FL4                                                      00333000
         ORG   CMZA0044                                                 00334000
@NM00254 DC    AL1(0)                                                   00335000
@NM00255 DC    AL1(96)                                                  00336000
@NM00256 DC    AL1(231)                                                 00337000
@NM00257 DC    XL1'01'                                                  00338000
         ORG   CMZA0044+4                                               00339000
@CB03274 DC    X'42000000'                                              00340000
@CB00905 DC    X'0C00'                                                  00341000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00342000
@01      EQU   01                                                       00343000
@02      EQU   02                                                       00344000
@03      EQU   03                                                       00345000
@04      EQU   04                                                       00346000
@05      EQU   05                                                       00347000
@06      EQU   06                                                       00348000
@07      EQU   07                                                       00349000
@08      EQU   08                                                       00350000
@09      EQU   09                                                       00351000
@10      EQU   10                                                       00352000
@11      EQU   11                                                       00353000
@12      EQU   12                                                       00354000
@13      EQU   13                                                       00355000
@14      EQU   14                                                       00356000
@15      EQU   15                                                       00357000
RETCODE  EQU   @07                                                      00358000
FAPPADSV EQU   @08                                                      00359000
ICNCBPTR EQU   @04                                                      00360000
ACDEBPTR EQU   @04                                                      00361000
NCBREG00 EQU   @00                                                      00362000
RPHPTR   EQU   @01                                                      00363000
R0       EQU   @00                                                      00364000
R1       EQU   @01                                                      00365000
R2       EQU   @02                                                      00366000
R1INPUT  EQU   @11                                                      00367000
GTSTOREG EQU   @03                                                      00368000
BASEREG  EQU   @12                                                      00369000
R10      EQU   @10                                                      00370000
R11      EQU   @11                                                      00371000
R13      EQU   @13                                                      00372000
R15      EQU   @15                                                      00373000
GPR00P   EQU   @00                                                      00374000
GPR01P   EQU   @01                                                      00375000
GPR02P   EQU   @02                                                      00376000
GPR03P   EQU   @03                                                      00377000
GPR00F   EQU   @00                                                      00378000
GPR03F   EQU   @03                                                      00379000
GPR15P   EQU   @15                                                      00380000
GPR15F   EQU   @15                                                      00381000
GPR04P   EQU   @04                                                      00382000
GPR01F   EQU   @01                                                      00383000
GPR02F   EQU   @02                                                      00384000
GPR04F   EQU   @04                                                      00385000
GPR05F   EQU   @05                                                      00386000
GPR05P   EQU   @05                                                      00387000
GPR06F   EQU   @06                                                      00388000
GPR06P   EQU   @06                                                      00389000
GPR07F   EQU   @07                                                      00390000
GPR07P   EQU   @07                                                      00391000
GPR08F   EQU   @08                                                      00392000
GPR08P   EQU   @08                                                      00393000
GPR09F   EQU   @09                                                      00394000
GPR09P   EQU   @09                                                      00395000
GPR10F   EQU   @10                                                      00396000
GPR10P   EQU   @10                                                      00397000
GPR11F   EQU   @11                                                      00398000
GPR11P   EQU   @11                                                      00399000
GPR12F   EQU   @12                                                      00400000
GPR12P   EQU   @12                                                      00401000
GPR13F   EQU   @13                                                      00402000
GPR13P   EQU   @13                                                      00403000
GPR14F   EQU   @14                                                      00404000
GPR14P   EQU   @14                                                      00405000
ATCLCPTR EQU   1032                                                     00406000
IOSB     EQU   0                                                        00407000
IOSFLA   EQU   IOSB                                                     00408000
IOSACHN  EQU   IOSFLA                                                   00409000
IOSFLB   EQU   IOSB+1                                                   00410000
IOSFLC   EQU   IOSB+2                                                   00411000
IOSDVALT EQU   IOSFLC                                                   00412000
IOSPKEY  EQU   IOSB+12                                                  00413000
IOSOPT   EQU   IOSB+14                                                  00414000
IOSOPT2  EQU   IOSB+15                                                  00415000
@NM00002 EQU   IOSB+20                                                  00416000
IOSCSW   EQU   @NM00002+1                                               00417000
IOSTATUS EQU   IOSCSW+3                                                 00418000
IOSIPIB  EQU   IOSB+44                                                  00419000
IOSPATH  EQU   IOSB+86                                                  00420000
IOSCHN   EQU   IOSPATH                                                  00421000
IOSCKEY  EQU   IOSB+89                                                  00422000
IOSEEKA  EQU   IOSB+100                                                 00423000
IOSCCHH  EQU   IOSEEKA+3                                                00424000
IOSSKHH  EQU   IOSCCHH+2                                                00425000
SRBSECT  EQU   0                                                        00426000
SRBFLC   EQU   SRBSECT+12                                               00427000
IOBPREFX EQU   0                                                        00428000
IOBCFLG1 EQU   IOBPREFX                                                 00429000
IOBSTDRD EQU   0                                                        00430000
IOBFLAG1 EQU   IOBSTDRD                                                 00431000
IOBCYCCK EQU   IOBFLAG1                                                 00432000
IOBRSTRT EQU   IOBFLAG1                                                 00433000
IOBFLAG2 EQU   IOBSTDRD+1                                               00434000
IOBPURGE EQU   IOBFLAG2                                                 00435000
IOBRDHA0 EQU   IOBFLAG2                                                 00436000
IOBSENS0 EQU   IOBSTDRD+2                                               00437000
IOBS0B7  EQU   IOBSENS0                                                 00438000
IOBSENS1 EQU   IOBSTDRD+3                                               00439000
IOBECBPT EQU   IOBSTDRD+4                                               00440000
IOBFLAG3 EQU   IOBSTDRD+8                                               00441000
IOBFL3   EQU   IOBFLAG3                                                 00442000
IOBCNC   EQU   IOBFL3                                                   00443000
IOBICL   EQU   IOBFL3                                                   00444000
IOBCSW   EQU   IOBSTDRD+9                                               00445000
IOBIOCSW EQU   IOBCSW                                                   00446000
IOBSTBYT EQU   IOBIOCSW+3                                               00447000
IOBUSTAT EQU   IOBSTBYT                                                 00448000
IOBCSTAT EQU   IOBSTBYT+1                                               00449000
IOBSTART EQU   IOBSTDRD+16                                              00450000
IOBDCBPT EQU   IOBSTDRD+20                                              00451000
IOBFLAG4 EQU   IOBDCBPT                                                 00452000
IOBRESTR EQU   IOBSTDRD+24                                              00453000
IOBINCAM EQU   IOBSTDRD+28                                              00454000
IOBBTAMF EQU   IOBINCAM                                                 00455000
ISTPOHD  EQU   0                                                        00456000
POHSTAT  EQU   ISTPOHD+1                                                00457000
ISTCPCB  EQU   0                                                        00458000
CPCBFL   EQU   ISTCPCB+2                                                00459000
CPCBTD   EQU   ISTCPCB+8                                                00460000
@NM00010 EQU   CPCBTD                                                   00461000
CPCBPH   EQU   CPCBTD+4                                                 00462000
CPCBOPC  EQU   ISTCPCB+16                                               00463000
ISTNCSPL EQU   0                                                        00464000
NCSPFX   EQU   ISTNCSPL                                                 00465000
NCSFLAGS EQU   NCSPFX+2                                                 00466000
NCSPLWEL EQU   NCSPFX+8                                                 00467000
@NM00018 EQU   NCSPFX+16                                                00468000
NCSVERB  EQU   @NM00018+1                                               00469000
NCSPLVBF EQU   NCSVERB+1                                                00470000
NCSPLSID EQU   NCSPFX+35                                                00471000
NCSPLSTA EQU   NCSPLSID                                                 00472000
NCSPLPHD EQU   NCSPLSID+1                                               00473000
NCSCRRTN EQU   ISTNCSPL+44                                              00474000
NCSPLVFL EQU   ISTNCSPL+45                                              00475000
NCSPLLID EQU   ISTNCSPL+61                                              00476000
NCSCDRMN EQU   NCSPLLID                                                 00477000
NCSTROPT EQU   ISTNCSPL+79                                              00478000
NCSPLRPT EQU   ISTNCSPL+80                                              00479000
NCSPLCMD EQU   ISTNCSPL+88                                              00480000
NCSCMDA  EQU   NCSPLCMD                                                 00481000
NCSITFL2 EQU   ISTNCSPL+90                                              00482000
NCSCRFLG EQU   ISTNCSPL+95                                              00483000
NCSIOCID EQU   ISTNCSPL+176                                             00484000
NCSPLCID EQU   NCSIOCID                                                 00485000
NCSMDFY  EQU   ISTNCSPL+188                                             00486000
NCSPLFSB EQU   ISTNCSPL+196                                             00487000
NCSPLFL1 EQU   ISTNCSPL+200                                             00488000
NCSPLFL2 EQU   ISTNCSPL+201                                             00489000
NCSPLFL3 EQU   ISTNCSPL+202                                             00490000
NCSPLFL4 EQU   ISTNCSPL+203                                             00491000
NCSPLFL5 EQU   ISTNCSPL+205                                             00492000
NCSPLAPP EQU   ISTNCSPL+228                                             00493000
NCSSENSE EQU   ISTNCSPL+264                                             00494000
NCSPLREP EQU   ISTNCSPL+268                                             00495000
NCSCRMSK EQU   ISTNCSPL+284                                             00496000
NCSCHKPT EQU   NCSCRMSK                                                 00497000
NCSCRMOD EQU   NCSCRMSK+2                                               00498000
NCSPLFL6 EQU   ISTNCSPL+316                                             00499000
NCSNCPLF EQU   ISTNCSPL+333                                             00500000
NCSNCPDF EQU   ISTNCSPL+341                                             00501000
NCSPLITF EQU   0                                                        00502000
NCSITFL1 EQU   NCSPLITF                                                 00503000
NCSAPP   EQU   0                                                        00504000
NCSAPBUE EQU   NCSAPP+88                                                00505000
NCSUSSRU EQU   0                                                        00506000
ISTSRT   EQU   0                                                        00507000
SRTSRTE  EQU   ISTSRT+8                                                 00508000
SRTXTNBS EQU   ISTSRT+13                                                00509000
ISTDEVCH EQU   0                                                        00510000
DEVSHCH  EQU   ISTDEVCH                                                 00511000
DEVCHAR  EQU   DEVSHCH                                                  00512000
DEVTCODE EQU   ISTDEVCH+1                                               00513000
DEVFLAGS EQU   ISTDEVCH+3                                               00514000
DEVFCCTL EQU   DEVFLAGS                                                 00515000
DEVCHAR3 EQU   DEVFLAGS                                                 00516000
DEVMODE  EQU   ISTDEVCH+5                                               00517000
ISTLOK   EQU   0                                                        00518000
LOKCHN   EQU   ISTLOK+1                                                 00519000
LOKCHNG  EQU   LOKCHN                                                   00520000
@NM00037 EQU   LOKCHNG+2                                                00521000
ISTRPRE  EQU   0                                                        00522000
RPRSRTHD EQU   ISTRPRE                                                  00523000
RPRDAFID EQU   ISTRPRE+16                                               00524000
RPRNCBA  EQU   ISTRPRE+40                                               00525000
RPRNSNEA EQU   ISTRPRE+44                                               00526000
RPRSTATE EQU   ISTRPRE+56                                               00527000
RPRCURST EQU   RPRSTATE                                                 00528000
RPRDESST EQU   RPRSTATE+2                                               00529000
RPRBITAN EQU   ISTRPRE+61                                               00530000
RPRFLAGS EQU   ISTRPRE+66                                               00531000
ISTRCPRE EQU   0                                                        00532000
RCPSARRY EQU   ISTRCPRE+84                                              00533000
RCPPACE  EQU   ISTRCPRE+108                                             00534000
RCPNCPPC EQU   ISTRCPRE+110                                             00535000
RCPPMODE EQU   ISTRCPRE+113                                             00536000
RCPCYMOD EQU   RCPPMODE                                                 00537000
RCPCYSET EQU   RCPPMODE                                                 00538000
RCPSESSM EQU   ISTRCPRE+115                                             00539000
RCPBITAN EQU   ISTRCPRE+116                                             00540000
ISTRAP   EQU   0                                                        00541000
RAPBITAN EQU   ISTRAP+165                                               00542000
ISTRDT   EQU   0                                                        00543000
RDTPLEN  EQU   ISTRDT+84                                                00544000
RDTPRIOR EQU   RDTPLEN                                                  00545000
RDTBITAN EQU   ISTRDT+113                                               00546000
RDTCRIA  EQU   ISTRDT+116                                               00547000
ISTRLN   EQU   0                                                        00548000
RLNADR   EQU   ISTRLN+84                                                00549000
RLNFLAG  EQU   RLNADR                                                   00550000
RLNUCBAD EQU   RLNADR+1                                                 00551000
RLNCSLRC EQU   ISTRLN+104                                               00552000
RLNBITAN EQU   ISTRLN+112                                               00553000
RLNRACNT EQU   RLNBITAN                                                 00554000
RLNCONCT EQU   RLNBITAN+2                                               00555000
RLNLSCMD EQU   RLNBITAN+3                                               00556000
RLNINBFR EQU   ISTRLN+132                                               00557000
ISTRPU   EQU   0                                                        00558000
RPUSTAID EQU   ISTRPU+92                                                00559000
RPUID48  EQU   RPUSTAID+2                                               00560000
ISTRAPRE EQU   0                                                        00561000
ISTRTR   EQU   0                                                        00562000
RTRADR   EQU   ISTRTR+144                                               00563000
RTRFLAG  EQU   RTRADR                                                   00564000
RTRBITAN EQU   ISTRTR+164                                               00565000
RTRRAALL EQU   RTRBITAN                                                 00566000
RTRBSCID EQU   ISTRTR+171                                               00567000
ISTRSW   EQU   0                                                        00568000
ISTRRN   EQU   0                                                        00569000
RRNADR   EQU   ISTRRN+136                                               00570000
RRNFLAG  EQU   RRNADR                                                   00571000
RRNUCBAD EQU   RRNADR+1                                                 00572000
RRNHPRE  EQU   ISTRRN+196                                               00573000
RRNBITAN EQU   ISTRRN+201                                               00574000
RRNLVL   EQU   ISTRRN+204                                               00575000
RRNNMDPD EQU   ISTRRN+232                                               00576000
RRNLDFSM EQU   ISTRRN+298                                               00577000
ISTRPX   EQU   0                                                        00578000
ISTRPT   EQU   0                                                        00579000
RPTXTCID EQU   ISTRPT+136                                               00580000
RPTLNCID EQU   RPTXTCID                                                 00581000
RPTDITT  EQU   ISTRPT+144                                               00582000
RPTBITAN EQU   ISTRPT+166                                               00583000
ISTRLX   EQU   0                                                        00584000
RLXBITAN EQU   ISTRLX+92                                                00585000
ISTRLU   EQU   0                                                        00586000
RLUBITAN EQU   ISTRLU+146                                               00587000
ISTRLS   EQU   0                                                        00588000
ISTRLC   EQU   0                                                        00589000
RLCADR   EQU   ISTRLC+84                                                00590000
RLCFLAG  EQU   RLCADR                                                   00591000
ISTRIN   EQU   0                                                        00592000
RINDAFID EQU   ISTRIN+124                                               00593000
RINBITAN EQU   ISTRIN+130                                               00594000
RINFLAGS EQU   ISTRIN+149                                               00595000
ISTRGP   EQU   0                                                        00596000
RGPBITAN EQU   ISTRGP+94                                                00597000
ISTRDS   EQU   0                                                        00598000
ISTRDA   EQU   0                                                        00599000
ISTRCL   EQU   0                                                        00600000
RCLADR   EQU   ISTRCL+84                                                00601000
RCLFLAG  EQU   RCLADR                                                   00602000
ISTRCDRS EQU   0                                                        00603000
@NM00142 EQU   ISTRCDRS+166                                             00604000
ISTRCDRM EQU   0                                                        00605000
RCDRMPDN EQU   ISTRCDRM+188                                             00606000
RCDRMRPQ EQU   ISTRCDRM+196                                             00607000
RCDRMFGS EQU   ISTRCDRM+208                                             00608000
ISTRCC   EQU   0                                                        00609000
RCCBITAN EQU   ISTRCC+105                                               00610000
ISTPAT   EQU   0                                                        00611000
PATFLAGA EQU   ISTPAT+7                                                 00612000
ISTGNT   EQU   0                                                        00613000
ISTDOT   EQU   0                                                        00614000
ISTDNT   EQU   0                                                        00615000
DNTTELNO EQU   ISTDNT+1                                                 00616000
ISTPAB   EQU   0                                                        00617000
PABWQCHN EQU   ISTPAB                                                   00618000
PABWEQA  EQU   PABWQCHN                                                 00619000
PABCHAIN EQU   PABWQCHN+4                                               00620000
PABRPHFG EQU   ISTPAB+12                                                00621000
PABFLAGS EQU   PABRPHFG                                                 00622000
PABEND   EQU   ISTPAB+16                                                00623000
ISTDYPAB EQU   0                                                        00624000
DYPCHAIN EQU   ISTDYPAB+4                                               00625000
DYPPACMD EQU   ISTDYPAB+12                                              00626000
ISTCCW   EQU   0                                                        00627000
CCWVADDR EQU   ISTCCW                                                   00628000
CCWFLAGS EQU   ISTCCW+4                                                 00629000
ISTNCB   EQU   0                                                        00630000
NCBBASE  EQU   ISTNCB                                                   00631000
NCBPCDYP EQU   NCBBASE+16                                               00632000
NCBDLCIA EQU   ISTNCB+48                                                00633000
NCBPENDQ EQU   NCBDLCIA+32                                              00634000
NCBBUFFQ EQU   NCBDLCIA+40                                              00635000
NCBSENSE EQU   NCBDLCIA+60                                              00636000
NCBBFT   EQU   NCBDLCIA+76                                              00637000
NCBFLAGS EQU   NCBDLCIA+92                                              00638000
NCBDSFLG EQU   NCBFLAGS                                                 00639000
NCBUFFLG EQU   NCBFLAGS+1                                               00640000
NCBCEFLG EQU   NCBFLAGS+2                                               00641000
ISTICNCB EQU   0                                                        00642000
ICNDEVCA EQU   ISTICNCB+152                                             00643000
@NM00176 EQU   ISTICNCB+220                                             00644000
ICNSYSUA EQU   ISTICNCB+240                                             00645000
ICNCKFLD EQU   ICNSYSUA                                                 00646000
ICNDCDEB EQU   ICNSYSUA+16                                              00647000
ICNDCBAD EQU   ICNDCDEB+25                                              00648000
ICNAPPAD EQU   ICNDCDEB+29                                              00649000
ICNUCBAD EQU   ICNDCDEB+32                                              00650000
ICNDIDEB EQU   ICNDCDEB+36                                              00651000
ICNDEBAD EQU   ICNDIDEB+1                                               00652000
ICNSPACE EQU   ICNDCDEB+40                                              00653000
ISTRPH   EQU   0                                                        00654000
RPHCNTL  EQU   ISTRPH                                                   00655000
RPHFLAGS EQU   RPHCNTL+2                                                00656000
RPHFLGB  EQU   RPHCNTL+3                                                00657000
RPHRPHA  EQU   ISTRPH+4                                                 00658000
RPHTSKID EQU   ISTRPH+8                                                 00659000
RPHRESMA EQU   ISTRPH+16                                                00660000
RPHWPFLG EQU   RPHRESMA                                                 00661000
RPHWEA   EQU   ISTRPH+24                                                00662000
RPHSRPRM EQU   ISTRPH+28                                                00663000
RPHWORK  EQU   ISTRPH+36                                                00664000
RPHSAVE1 EQU   RPHWORK                                                  00665000
RPHSBITS EQU   RPHSAVE1+1                                               00666000
ISTATCVT EQU   0                                                        00667000
ATCRPTCH EQU   ISTATCVT                                                 00668000
ATCITFLD EQU   ISTATCVT+8                                               00669000
ATCITPRM EQU   ATCITFLD                                                 00670000
ATCITCDS EQU   ATCITFLD+8                                               00671000
ATCITFLG EQU   ATCITCDS+4                                               00672000
ATCITRA1 EQU   ATCITFLG+2                                               00673000
ATCSMPAB EQU   ISTATCVT+88                                              00674000
ATCLDTIL EQU   ISTATCVT+408                                             00675000
ATCGTSTR EQU   ISTATCVT+644                                             00676000
ATCLUDVT EQU   ISTATCVT+800                                             00677000
ATCANYDT EQU   ISTATCVT+808                                             00678000
@NM00201 EQU   ISTATCVT+812                                             00679000
ATCPODVT EQU   ISTATCVT+832                                             00680000
ATCSSDVT EQU   ISTATCVT+940                                             00681000
ATCSODVT EQU   ISTATCVT+944                                             00682000
ATCMBDVT EQU   ISTATCVT+952                                             00683000
ATCSTAT  EQU   ISTATCVT+972                                             00684000
ATCSTAT1 EQU   ATCSTAT                                                  00685000
@NM00202 EQU   ATCSTAT+1                                                00686000
ATCPOFLG EQU   ATCSTAT+2                                                00687000
ATCSTAT4 EQU   ATCSTAT+3                                                00688000
ATCBITAN EQU   ISTATCVT+976                                             00689000
ATCFLAG2 EQU   ATCBITAN+1                                               00690000
ATCONID  EQU   ISTATCVT+980                                             00691000
ATCSSCPA EQU   ISTATCVT+984                                             00692000
ATCHPGM  EQU   ISTATCVT+1040                                            00693000
ATCRNO   EQU   ISTATCVT+1044                                            00694000
ATCCPDVT EQU   ISTATCVT+1092                                            00695000
ATCSMSDQ EQU   ISTATCVT+1128                                            00696000
ATCRID   EQU   ISTATCVT+1144                                            00697000
ATCTKFLD EQU   ISTATCVT+1156                                            00698000
ATCIOINT EQU   ISTATCVT+1176                                            00699000
ATCTOD   EQU   ISTATCVT+1220                                            00700000
ATCVRTIL EQU   ISTATCVT+1264                                            00701000
ATCLKSWP EQU   ISTATCVT+1440                                            00702000
ATCWUDYP EQU   ISTATCVT+1448                                            00703000
ATCSQAFR EQU   ISTATCVT+1560                                            00704000
ATCORTCB EQU   ATCSQAFR+4                                               00705000
ATCORSRB EQU   ATCORTCB                                                 00706000
ATCLDAPP EQU   ISTATCVT+1600                                            00707000
ATCDAPVT EQU   ISTATCVT+1620                                            00708000
ATCGSRBQ EQU   ISTATCVT+1672                                            00709000
ATCGSRBG EQU   ATCGSRBQ                                                 00710000
ATCENFLG EQU   ISTATCVT+1722                                            00711000
ATCCSCB  EQU   ISTATCVT+1724                                            00712000
ATCVTFLG EQU   ISTATCVT+1784                                            00713000
@NM00232 EQU   ISTATCVT+1816                                            00714000
ATCVIOPM EQU   ISTATCVT+1832                                            00715000
ATCCRA   EQU   ISTATCVT+1840                                            00716000
ATCCRACN EQU   ATCCRA+4                                                 00717000
ATCCRPL  EQU   ISTATCVT+1848                                            00718000
ATCRPLCN EQU   ATCCRPL+4                                                00719000
ISTACDEB EQU   0                                                        00720000
ACDANYQ  EQU   ISTACDEB+48                                              00721000
ACDLUFLG EQU   ISTACDEB+102                                             00722000
@NM00238 EQU   ISTACDEB+114                                             00723000
FY1WORKA EQU   0                                                        00724000
FY1IOB   EQU   FY1WORKA+72                                              00725000
FY1IOBW1 EQU   FY1IOB                                                   00726000
FY1SDATA EQU   FY1IOBW1+2                                               00727000
FY1IOBW2 EQU   FY1IOB+4                                                 00728000
FY1IOBW3 EQU   FY1IOB+8                                                 00729000
FY1IOBW4 EQU   FY1IOBW3+4                                               00730000
FY1CSWST EQU   FY1IOBW4                                                 00731000
FY1IOBW5 EQU   FY1IOB+16                                                00732000
FY1SIOCC EQU   FY1IOBW5                                                 00733000
FY1IOBW6 EQU   FY1IOB+20                                                00734000
FY1CC3WE EQU   FY1IOBW6                                                 00735000
FY1ECB   EQU   FY1WORKA+112                                             00736000
FY1ECBRC EQU   FY1ECB                                                   00737000
FY1EXTRA EQU   FY1WORKA+120                                             00738000
FY1CSW   EQU   0                                                        00739000
CY1SENS  EQU   0                                                        00740000
FY1PARML EQU   0                                                        00741000
FY1CHPGM EQU   FY1PARML                                                 00742000
FY1NCSPL EQU   FY1PARML+4                                               00743000
FYENDCSW EQU   FY1PARML+8                                               00744000
FY1SENSE EQU   FY1PARML+12                                              00745000
FY1DBITS EQU   0                                                        00746000
DCBBITS  EQU   FY1DBITS                                                 00747000
FY1RGSAV EQU   0                                                        00748000
FY1BAKPT EQU   FY1RGSAV+4                                               00749000
FY1FWDPT EQU   FY1RGSAV+8                                               00750000
ISTXDYP  EQU   0                                                        00751000
IOSATTSC EQU   IOSIPIB                                                  00752000
IOSWTOWA EQU   IOSIPIB                                                  00753000
IOSPCISC EQU   IOSIPIB                                                  00754000
IOBORG01 EQU   IOBPREFX+8                                               00755000
IOBNIOBA EQU   IOBORG01                                                 00756000
IOBNFLG1 EQU   IOBNIOBA                                                 00757000
IOBPRTOV EQU   IOBNFLG1                                                 00758000
IOBORG02 EQU   IOBPREFX+8                                               00759000
IOBDQADA EQU   IOBORG02                                                 00760000
IOBDEQIN EQU   IOBDQADA                                                 00761000
IOBORG03 EQU   IOBPREFX+12                                              00762000
IOBORG04 EQU   IOBINCAM                                                 00763000
IOBORG12 EQU   IOBINCAM                                                 00764000
IOBFL4   EQU   IOBORG12                                                 00765000
IOBEXTEN EQU   IOBSTDRD+32                                              00766000
IOBSEEK  EQU   IOBEXTEN                                                 00767000
IOBBB    EQU   IOBSEEK+1                                                00768000
IOBCC    EQU   IOBSEEK+3                                                00769000
IOBHH    EQU   IOBSEEK+5                                                00770000
IOBORG05 EQU   IOBEXTEN                                                 00771000
IOBORG06 EQU   IOBEXTEN                                                 00772000
IOBNXTPT EQU   IOBORG06+4                                               00773000
IOBSTATA EQU   IOBNXTPT                                                 00774000
IOBORG07 EQU   IOBEXTEN+8                                               00775000
W1IEXTEN EQU   IOBORG07                                                 00776000
IOBORG08 EQU   IOBEXTEN+8                                               00777000
IOBINDCT EQU   IOBORG08+4                                               00778000
IOBUNSQR EQU   IOBORG08+5                                               00779000
IOBFCHAD EQU   IOBORG08+8                                               00780000
IOBORG09 EQU   IOBEXTEN+8                                               00781000
IOBDPLAD EQU   IOBORG09+4                                               00782000
IOBDTYPE EQU   IOBORG09+8                                               00783000
IOBDTYP2 EQU   IOBORG09+9                                               00784000
IOBDSTAT EQU   IOBORG09+10                                              00785000
IOBSTAT1 EQU   IOBDSTAT                                                 00786000
IOBORG10 EQU   IOBEXTEN+8                                               00787000
IOBSEEK2 EQU   IOBORG10                                                 00788000
IOBORG11 EQU   IOBEXTEN                                                 00789000
IOBERCT  EQU   IOBORG11                                                 00790000
IOBUCBXV EQU   IOBERCT                                                  00791000
IOBNAME  EQU   IOBORG11+4                                               00792000
IOBORG13 EQU   IOBEXTEN                                                 00793000
IOBSKADR EQU   IOBORG13                                                 00794000
NCSTUNST EQU   NCSMDFY                                                  00795000
NCSTSFLG EQU   NCSTUNST+2                                               00796000
NCSLS    EQU   NCSMDFY                                                  00797000
NCSCYPTO EQU   NCSMDFY                                                  00798000
NCSCYFLG EQU   NCSCYPTO                                                 00799000
SRTXTNSN EQU   SRTXTNBS                                                 00800000
PABXTNSN EQU   PABEND                                                   00801000
@NM00182 EQU   ICNSPACE                                                 00802000
ICNZH002 EQU   @NM00182+12                                              00803000
ICNZS002 EQU   ICNZH002                                                 00804000
ICNZS003 EQU   ICNZH002                                                 00805000
ICNZS004 EQU   ICNZH002                                                 00806000
ICNZS006 EQU   ICNZH002                                                 00807000
ICNZS007 EQU   ICNZH002                                                 00808000
ICNZS008 EQU   ICNZH002                                                 00809000
ICNZS009 EQU   ICNZH002+1                                               00810000
ICNZS00A EQU   ICNZH002+1                                               00811000
@NM00183 EQU   @NM00182+19                                              00812000
ICNRSRT  EQU   @NM00183                                                 00813000
@NM00185 EQU   @NM00182+20                                              00814000
ICNSENSE EQU   NCBSENSE                                                 00815000
@NM00190 EQU   ICNSENSE                                                 00816000
ICNDTCHK EQU   @NM00190                                                 00817000
ICNOVRUN EQU   @NM00190                                                 00818000
@NM00191 EQU   ICNSENSE+1                                               00819000
ISTICNCT EQU   ISTICNCB                                                 00820000
ICNSTATS EQU   ISTICNCT+472                                             00821000
RCPSIBQ  EQU   RCPSARRY                                                 00822000
SRB      EQU   SRBSECT                                                  00823000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00824000
ICNSLODN EQU   ICNSTATS+28                                              00825000
ICNRDBUF EQU   ICNSTATS+24                                              00826000
ICNOPIU  EQU   ICNSTATS+20                                              00827000
ICNIPIU  EQU   ICNSTATS+16                                              00828000
ICNRDATN EQU   ICNSTATS+12                                              00829000
ICNATTN  EQU   ICNSTATS+8                                               00830000
ICNCHRD  EQU   ICNSTATS+4                                               00831000
ICNCHWR  EQU   ICNSTATS                                                 00832000
@NM00193 EQU   ISTICNCT                                                 00833000
@NM00192 EQU   @NM00191                                                 00834000
ICNDTREJ EQU   @NM00191                                                 00835000
ICNDLCHK EQU   @NM00191                                                 00836000
ICNABORT EQU   @NM00190                                                 00837000
ICNIPLRQ EQU   @NM00190                                                 00838000
ICNSN02  EQU   ICNOVRUN                                                 00839000
ICNSN01  EQU   ICNDTCHK                                                 00840000
ICNEQCHK EQU   @NM00190                                                 00841000
ICNBOCHK EQU   @NM00190                                                 00842000
ICNINTRQ EQU   @NM00190                                                 00843000
ICNCMDRJ EQU   @NM00190                                                 00844000
@NM00189 EQU   @NM00182+23                                              00845000
ICNHKMSK EQU   @NM00182+22                                              00846000
ICNERCNT EQU   @NM00182+21                                              00847000
@NM00188 EQU   @NM00185                                                 00848000
@NM00187 EQU   @NM00185                                                 00849000
@NM00186 EQU   @NM00185                                                 00850000
ICNZF026 EQU   @NM00185                                                 00851000
ICNZF024 EQU   @NM00185                                                 00852000
ICNZF023 EQU   @NM00185                                                 00853000
ICNZF022 EQU   @NM00185                                                 00854000
ICNZF021 EQU   @NM00185                                                 00855000
@NM00184 EQU   @NM00183                                                 00856000
ICNZF016 EQU   @NM00183                                                 00857000
ICNZF011 EQU   @NM00183                                                 00858000
ICNZF00E EQU   ICNRSRT                                                  00859000
ICNZF00A EQU   @NM00183                                                 00860000
ICNZF005 EQU   @NM00183                                                 00861000
ICNZF004 EQU   @NM00183                                                 00862000
ICNZF001 EQU   @NM00183                                                 00863000
ICNZX013 EQU   @NM00182+18                                              00864000
ICNZX012 EQU   @NM00182+17                                              00865000
ICNZX011 EQU   @NM00182+16                                              00866000
ICNZX010 EQU   @NM00182+14                                              00867000
ICNZS010 EQU   ICNZH002+1                                               00868000
ICNZS00F EQU   ICNZH002+1                                               00869000
ICNZS00E EQU   ICNZH002+1                                               00870000
ICNZS00D EQU   ICNZH002+1                                               00871000
ICNZS00C EQU   ICNZH002+1                                               00872000
ICNZS00B EQU   ICNZH002+1                                               00873000
ICNZS01A EQU   ICNZS00A                                                 00874000
ICNZS019 EQU   ICNZS009                                                 00875000
ICNZS018 EQU   ICNZS008                                                 00876000
ICNZS017 EQU   ICNZS007                                                 00877000
ICNZS016 EQU   ICNZS006                                                 00878000
ICNZS005 EQU   ICNZH002                                                 00879000
ICNZS014 EQU   ICNZS004                                                 00880000
ICNZS013 EQU   ICNZS003                                                 00881000
ICNZS012 EQU   ICNZS002                                                 00882000
ICNZS001 EQU   ICNZH002                                                 00883000
ICNZV006 EQU   @NM00182+8                                               00884000
ICNZC001 EQU   @NM00182                                                 00885000
@NM00172 EQU   PABXTNSN+12                                              00886000
PABNPSSQ EQU   PABXTNSN+8                                               00887000
PABLOCK  EQU   PABXTNSN+4                                               00888000
PABLAST  EQU   PABXTNSN                                                 00889000
SRTDATA  EQU   SRTXTNSN+3                                               00890000
SRTUSELN EQU   SRTXTNSN+1                                               00891000
SRTFLAGS EQU   SRTXTNSN                                                 00892000
@NM00034 EQU   NCSCYPTO+1                                               00893000
@NM00033 EQU   NCSCYFLG                                                 00894000
NCSENCR  EQU   NCSCYFLG                                                 00895000
@NM00032 EQU   NCSLS+2                                                  00896000
NCSPLRCD EQU   NCSLS+1                                                  00897000
NCSLSCMD EQU   NCSLS                                                    00898000
@NM00031 EQU   NCSTUNST+3                                               00899000
@NM00030 EQU   NCSTSFLG                                                 00900000
NCSTUNCS EQU   NCSTSFLG                                                 00901000
NCSTUNON EQU   NCSTSFLG                                                 00902000
NCSTUTIM EQU   NCSTUNST                                                 00903000
IOBSKSS  EQU   IOBSKADR+3                                               00904000
IOBSK0   EQU   IOBSKADR+2                                               00905000
IOBSKTT  EQU   IOBSKADR+1                                               00906000
IOBSKRV  EQU   IOBSKADR                                                 00907000
IOBCSWSV EQU   IOBORG11+17                                              00908000
IOBSENSV EQU   IOBORG11+16                                              00909000
IOBRCD   EQU   IOBORG11+12                                              00910000
IOBMDREC EQU   IOBORG11+8                                               00911000
IOBNAMEA EQU   IOBNAME+1                                                00912000
IOBNAMSZ EQU   IOBNAME                                                  00913000
IOBERCTA EQU   IOBERCT+1                                                00914000
IOBRTYPE EQU   IOBUCBXV                                                 00915000
IOBRDCHP EQU   IOBORG10+20                                              00916000
IOBNEXTA EQU   IOBORG10+16                                              00917000
IOBREADA EQU   IOBORG10+12                                              00918000
IOBBUFC  EQU   IOBORG10+8                                               00919000
IOBSK2R  EQU   IOBSEEK2+7                                               00920000
IOBSK2HH EQU   IOBSEEK2+5                                               00921000
IOBSK2CC EQU   IOBSEEK2+3                                               00922000
IOBSK2BB EQU   IOBSEEK2+1                                               00923000
IOBSK2M  EQU   IOBSEEK2                                                 00924000
IOBCHNPR EQU   IOBORG09+40                                              00925000
IOBDNCRF EQU   IOBORG09+32                                              00926000
IOBRSV35 EQU   IOBORG09+24                                              00927000
IOBDQPTR EQU   IOBORG09+20                                              00928000
IOBRSV34 EQU   IOBORG09+18                                              00929000
IOBDBYTN EQU   IOBORG09+16                                              00930000
IOBDCPND EQU   IOBORG09+12                                              00931000
IOBSTAT2 EQU   IOBDSTAT+1                                               00932000
IOBSIORT EQU   IOBSTAT1                                                 00933000
IOBADDVU EQU   IOBSTAT1                                                 00934000
IOBBUFF  EQU   IOBSTAT1                                                 00935000
IOBENQUE EQU   IOBSTAT1                                                 00936000
IOBPASS2 EQU   IOBSTAT1                                                 00937000
IOBSYNCH EQU   IOBSTAT1                                                 00938000
IOBNEWVL EQU   IOBSTAT1                                                 00939000
IOBABNRM EQU   IOBSTAT1                                                 00940000
IOBRELEX EQU   IOBDTYP2                                                 00941000
IOBADDTY EQU   IOBDTYP2                                                 00942000
IOBTYPE  EQU   IOBDTYP2                                                 00943000
IOBRQUST EQU   IOBDTYP2                                                 00944000
IOBSUFFX EQU   IOBDTYP2                                                 00945000
IOBSBLKL EQU   IOBDTYP2                                                 00946000
IOBSKEY  EQU   IOBDTYP2                                                 00947000
IOBRELBL EQU   IOBDTYPE                                                 00948000
IOBRDEXC EQU   IOBDTYPE                                                 00949000
IOBDYNBF EQU   IOBDTYPE                                                 00950000
IOBACTAD EQU   IOBDTYPE                                                 00951000
IOBFDBCK EQU   IOBDTYPE                                                 00952000
IOBEXTSC EQU   IOBDTYPE                                                 00953000
IOBOVFLO EQU   IOBDTYPE                                                 00954000
IOBVERFY EQU   IOBDTYPE                                                 00955000
IOBDPLB  EQU   IOBDPLAD+1                                               00956000
IOBDAYLI EQU   IOBDPLAD                                                 00957000
IOBDIOBS EQU   IOBORG09+2                                               00958000
IOBDBYTR EQU   IOBORG09                                                 00959000
IOBBCHAD EQU   IOBORG08+12                                              00960000
IOBFCHNB EQU   IOBFCHAD+1                                               00961000
IOBCOUNT EQU   IOBFCHAD                                                 00962000
IOBASYN  EQU   IOBORG08+7                                               00963000
IOBAPP   EQU   IOBORG08+6                                               00964000
IOBRSV32 EQU   IOBUNSQR                                                 00965000
IOBRSV31 EQU   IOBUNSQR                                                 00966000
IOBRSV30 EQU   IOBUNSQR                                                 00967000
IOBKNRWR EQU   IOBUNSQR                                                 00968000
IOBKNWR  EQU   IOBUNSQR                                                 00969000
IOBNTAV2 EQU   IOBUNSQR                                                 00970000
IOBNTAV1 EQU   IOBUNSQR                                                 00971000
IOBCPBSY EQU   IOBUNSQR                                                 00972000
IOBCHNNL EQU   IOBINDCT                                                 00973000
IOBRSV29 EQU   IOBINDCT                                                 00974000
IOBRSV28 EQU   IOBINDCT                                                 00975000
IOBRSV27 EQU   IOBINDCT                                                 00976000
IOBKEYAD EQU   IOBINDCT                                                 00977000
IOBOVPTR EQU   IOBINDCT                                                 00978000
IOBUNSCH EQU   IOBINDCT                                                 00979000
IOBDEQCP EQU   IOBINDCT                                                 00980000
IOBCCWAD EQU   IOBORG08                                                 00981000
W1OEXTEN EQU   W1IEXTEN                                                 00982000
IOBCCW   EQU   IOBORG06+8                                               00983000
IOBNXTPB EQU   IOBNXTPT+1                                               00984000
IOBRSV26 EQU   IOBSTATA                                                 00985000
IOBRSV25 EQU   IOBSTATA                                                 00986000
IOBRSV24 EQU   IOBSTATA                                                 00987000
IOBRSV23 EQU   IOBSTATA                                                 00988000
IOBRSV22 EQU   IOBSTATA                                                 00989000
IOBRSV21 EQU   IOBSTATA                                                 00990000
IOBRSV20 EQU   IOBSTATA                                                 00991000
IOBAVLFL EQU   IOBSTATA                                                 00992000
IOBRSV37 EQU   IOBORG06+1                                               00993000
IOBUCBXG EQU   IOBORG06                                                 00994000
IOBCPA   EQU   IOBORG05+32                                              00995000
IOBERINF EQU   IOBORG05+16                                              00996000
IOBERCCW EQU   IOBORG05+8                                               00997000
IOBSNDPT EQU   IOBORG05+7                                               00998000
IOBRCVPT EQU   IOBORG05+6                                               00999000
IOBWORK  EQU   IOBORG05+1                                               01000000
IOBUCBX  EQU   IOBORG05                                                 01001000
IOBR     EQU   IOBSEEK+7                                                01002000
IOBHH2   EQU   IOBHH+1                                                  01003000
IOBHH1   EQU   IOBHH                                                    01004000
IOBCC2   EQU   IOBCC+1                                                  01005000
IOBCC1   EQU   IOBCC                                                    01006000
IOBBB2   EQU   IOBBB+1                                                  01007000
IOBBB1   EQU   IOBBB                                                    01008000
IOBM     EQU   IOBSEEK                                                  01009000
IOBRSV46 EQU   IOBFL4                                                   01010000
IOBRSV47 EQU   IOBFL4                                                   01011000
IOBENT   EQU   IOBFL4                                                   01012000
IOBEQP   EQU   IOBFL4                                                   01013000
IOBBUS   EQU   IOBFL4                                                   01014000
IOBDCK   EQU   IOBFL4                                                   01015000
IOBREJ   EQU   IOBFL4                                                   01016000
IOBOVR   EQU   IOBFL4                                                   01017000
IOBCRILC EQU   IOBORG04+1                                               01018000
IOBCRDCC EQU   IOBORG04                                                 01019000
IOBGQECB EQU   IOBORG03                                                 01020000
IOBSWAP  EQU   IOBORG02+4                                               01021000
IOBDQADB EQU   IOBDQADA+1                                               01022000
IOBRSV13 EQU   IOBDEQIN                                                 01023000
IOBRSV12 EQU   IOBDEQIN                                                 01024000
IOBRSV11 EQU   IOBDEQIN                                                 01025000
IOBRSV10 EQU   IOBDEQIN                                                 01026000
IOBRSV09 EQU   IOBDEQIN                                                 01027000
IOBRSV08 EQU   IOBDEQIN                                                 01028000
IOBRSV07 EQU   IOBDEQIN                                                 01029000
IOBDEQ   EQU   IOBDEQIN                                                 01030000
IOBNECB  EQU   IOBORG01+4                                               01031000
IOBNIOBB EQU   IOBNIOBA+1                                               01032000
IOBFIRST EQU   IOBNFLG1                                                 01033000
IOBUPERR EQU   IOBNFLG1                                                 01034000
IOBSPAN  EQU   IOBNFLG1                                                 01035000
IOBBKSPC EQU   IOBNFLG1                                                 01036000
IOBUPDAT EQU   IOBNFLG1                                                 01037000
IOBREAD  EQU   IOBNFLG1                                                 01038000
IOBWRITE EQU   IOBNFLG1                                                 01039000
IOBSEGMT EQU   IOBPRTOV                                                 01040000
IOSPCIWA EQU   IOSPCISC+44                                              01041000
IOSPCIRS EQU   IOSPCISC+8                                               01042000
@NM00007 EQU   IOSPCISC+4                                               01043000
@NM00006 EQU   IOSPCISC                                                 01044000
IOSWRNDR EQU   IOSWTOWA+4                                               01045000
IOSWTOPT EQU   IOSWTOWA+3                                               01046000
IOSWTOCP EQU   IOSWTOWA+2                                               01047000
IOSWTOCH EQU   IOSWTOWA                                                 01048000
IOSATTWA EQU   IOSATTSC+40                                              01049000
@NM00005 EQU   IOSATTSC+24                                              01050000
IOSATTSN EQU   IOSATTSC                                                 01051000
@NM00249 EQU   FY1RGSAV+12                                              01052000
@NM00248 EQU   FY1RGSAV                                                 01053000
@NM00247 EQU   FY1DBITS                                                 01054000
@NM00246 EQU   FY1IOB+24                                                01055000
@NM00245 EQU   FY1IOBW6                                                 01056000
@NM00244 EQU   FY1IOBW6                                                 01057000
@NM00243 EQU   FY1IOBW5                                                 01058000
@NM00242 EQU   FY1IOBW3                                                 01059000
@NM00241 EQU   FY1IOBW1                                                 01060000
FY1REGSV EQU   FY1WORKA                                                 01061000
ACDNIB   EQU   ISTACDEB+116                                             01062000
@NM00240 EQU   ISTACDEB+115                                             01063000
@NM00239 EQU   @NM00238                                                 01064000
ACDAUTH  EQU   @NM00238                                                 01065000
ACDSSCIP EQU   @NM00238                                                 01066000
ACDVFRR  EQU   @NM00238                                                 01067000
ACDSRBX  EQU   @NM00238                                                 01068000
ACDMMEM  EQU   @NM00238                                                 01069000
ACDEAS   EQU   ISTACDEB+112                                             01070000
ACDUNTNM EQU   ISTACDEB+104                                             01071000
@NM00237 EQU   ACDLUFLG+1                                               01072000
ACDAACQ  EQU   ACDLUFLG+1                                               01073000
ACDAPASS EQU   ACDLUFLG+1                                               01074000
ACDCSM   EQU   ACDLUFLG+1                                               01075000
ACDPARS  EQU   ACDLUFLG+1                                               01076000
ACDTSO   EQU   ACDLUFLG+1                                               01077000
ACDSCIP  EQU   ACDLUFLG+1                                               01078000
ACDNSEXT EQU   ACDLUFLG+1                                               01079000
ACDAUTHE EQU   ACDLUFLG                                                 01080000
ACDTPEND EQU   ACDLUFLG                                                 01081000
ACDABEND EQU   ACDLUFLG                                                 01082000
ACDCLOSE EQU   ACDLUFLG                                                 01083000
ACDQUIES EQU   ACDLUFLG                                                 01084000
ACDNSESS EQU   ACDLUFLG                                                 01085000
ACDREADY EQU   ACDLUFLG                                                 01086000
ACDACTIV EQU   ACDLUFLG                                                 01087000
ACDRQID  EQU   ISTACDEB+100                                             01088000
ACDSMCNT EQU   ISTACDEB+96                                              01089000
ACDPACNT EQU   ISTACDEB+92                                              01090000
ACDASCNT EQU   ISTACDEB+88                                              01091000
@NM00236 EQU   ISTACDEB+84                                              01092000
ACDSSCNT EQU   ISTACDEB+80                                              01093000
ACDECB   EQU   ISTACDEB+76                                              01094000
ACDLUCBA EQU   ISTACDEB+72                                              01095000
ACDLOCK  EQU   ISTACDEB+68                                              01096000
ACDACB   EQU   ISTACDEB+64                                              01097000
ACDDEB   EQU   ISTACDEB+60                                              01098000
ACDTCB   EQU   ISTACDEB+56                                              01099000
ACDRARQ  EQU   ACDANYQ+4                                                01100000
ACDRAFQ  EQU   ACDANYQ                                                  01101000
ACDSSPAB EQU   ISTACDEB+32                                              01102000
ACDNEPAB EQU   ISTACDEB+16                                              01103000
ACDRDTE  EQU   ISTACDEB+12                                              01104000
ACDTSKID EQU   ISTACDEB+8                                               01105000
ACDCHN   EQU   ISTACDEB+4                                               01106000
ACDSAF   EQU   ISTACDEB+2                                               01107000
ACDLNGTH EQU   ISTACDEB+1                                               01108000
ACDTYPE  EQU   ISTACDEB                                                 01109000
ATCAOS   EQU   ISTATCVT+2184                                            01110000
@NM00235 EQU   ISTATCVT+1928                                            01111000
ATCITECB EQU   ISTATCVT+1924                                            01112000
ATCINCTV EQU   ISTATCVT+1920                                            01113000
@NM00234 EQU   ISTATCVT+1918                                            01114000
ATCSAF   EQU   ISTATCVT+1916                                            01115000
ATCAPCSX EQU   ISTATCVT+1912                                            01116000
ATCTSC3I EQU   ISTATCVT+1908                                            01117000
ATCHWCSA EQU   ISTATCVT+1904                                            01118000
ATCAPCRM EQU   ISTATCVT+1900                                            01119000
ATCAPCFR EQU   ISTATCVT+1896                                            01120000
ATCCACSA EQU   ISTATCVT+1892                                            01121000
ATCMXCSA EQU   ISTATCVT+1888                                            01122000
ATCTPMPB EQU   ISTATCVT+1856                                            01123000
ATCRPLAC EQU   ATCRPLCN+2                                               01124000
ATCRPLRC EQU   ATCRPLCN                                                 01125000
ATCCRPLQ EQU   ATCCRPL                                                  01126000
ATCCRAAC EQU   ATCCRACN+2                                               01127000
ATCCRARC EQU   ATCCRACN                                                 01128000
ATCCRAQ  EQU   ATCCRA                                                   01129000
ATCITSAV EQU   ISTATCVT+1836                                            01130000
ATCTPMMI EQU   ISTATCVT+1828                                            01131000
ATCPXSRB EQU   ISTATCVT+1824                                            01132000
ATCRPLCT EQU   ISTATCVT+1822                                            01133000
ATCCRACT EQU   ISTATCVT+1820                                            01134000
ATCSRBCT EQU   ISTATCVT+1818                                            01135000
ATCSTNSM EQU   ISTATCVT+1817                                            01136000
@NM00233 EQU   @NM00232                                                 01137000
ATCNOSTR EQU   @NM00232                                                 01138000
ATCVTMAB EQU   @NM00232                                                 01139000
ATCTPCP1 EQU   ISTATCVT+1812                                            01140000
ATCTPCP0 EQU   ISTATCVT+1808                                            01141000
ATCZR01  EQU   ISTATCVT+1804                                            01142000
ATCASCB  EQU   ISTATCVT+1800                                            01143000
ATCMPSTQ EQU   ISTATCVT+1796                                            01144000
ATCOCCSM EQU   ISTATCVT+1792                                            01145000
ATCPSTA  EQU   ISTATCVT+1788                                            01146000
@NM00231 EQU   ATCVTFLG                                                 01147000
ATCVTACT EQU   ATCVTFLG                                                 01148000
@NM00230 EQU   ISTATCVT+1732                                            01149000
ATCTRMWA EQU   ISTATCVT+1728                                            01150000
ATCCSCBG EQU   ATCCSCB                                                  01151000
@NM00229 EQU   ISTATCVT+1723                                            01152000
ATCSNUF  EQU   ATCENFLG                                                 01153000
ATCOPKL  EQU   ATCENFLG                                                 01154000
ATCABEN  EQU   ATCENFLG                                                 01155000
ATCSRDN  EQU   ATCENFLG                                                 01156000
ATCDLDN  EQU   ATCENFLG                                                 01157000
ATCACTRM EQU   ISTATCVT+1720                                            01158000
ATCSMABF EQU   ISTATCVT+1716                                            01159000
ATCSMAPR EQU   ISTATCVT+1712                                            01160000
ATCSMAID EQU   ISTATCVT+1708                                            01161000
ATCSMARA EQU   ISTATCVT+1704                                            01162000
ATCCACXA EQU   ISTATCVT+1700                                            01163000
ATCATA10 EQU   ISTATCVT+1696                                            01164000
ATCHLTCB EQU   ISTATCVT+1692                                            01165000
ATCCCOOC EQU   ISTATCVT+1688                                            01166000
ATCAIWT  EQU   ISTATCVT+1684                                            01167000
ATCOROBT EQU   ISTATCVT+1680                                            01168000
ATCPXCRA EQU   ISTATCVT+1676                                            01169000
ATCGSRBF EQU   ATCGSRBG                                                 01170000
ATCTSCPC EQU   ISTATCVT+1668                                            01171000
ATCCDTCB EQU   ISTATCVT+1664                                            01172000
ATCORFRL EQU   ISTATCVT+1660                                            01173000
ATCORFPX EQU   ISTATCVT+1656                                            01174000
ATCORFMG EQU   ISTATCVT+1652                                            01175000
ATCSMBQ  EQU   ISTATCVT+1648                                            01176000
ATCINFDD EQU   ISTATCVT+1644                                            01177000
@NM00228 EQU   ATCDAPVT+22                                              01178000
ATCDAPDG EQU   ATCDAPVT+20                                              01179000
ATCDXCEA EQU   ATCDAPVT+16                                              01180000
ATCDCEA  EQU   ATCDAPVT+12                                              01181000
ATCDPCIA EQU   ATCDAPVT+8                                               01182000
ATCDSIOA EQU   ATCDAPVT+4                                               01183000
ATCDEOEA EQU   ATCDAPVT                                                 01184000
ATCZLAEA EQU   ATCLDAPP+16                                              01185000
ATCZLCEA EQU   ATCLDAPP+12                                              01186000
ATCZLPCI EQU   ATCLDAPP+8                                               01187000
ATCSMFRR EQU   ATCLDAPP+4                                               01188000
ATCCDTID EQU   ATCLDAPP                                                 01189000
ATCTRMPB EQU   ISTATCVT+1568                                            01190000
ATCORQG  EQU   ATCORSRB                                                 01191000
ATCORTBF EQU   ATCSQAFR                                                 01192000
@NM00227 EQU   ISTATCVT+1560                                            01193000
@NM00226 EQU   ISTATCVT+1556                                            01194000
ATCTSCLR EQU   ISTATCVT+1552                                            01195000
@NM00225 EQU   ISTATCVT+1532                                            01196000
ATCCDCNE EQU   ISTATCVT+1528                                            01197000
@NM00224 EQU   ISTATCVT+1526                                            01198000
ATCHASHN EQU   ISTATCVT+1524                                            01199000
ATCNOST  EQU   ISTATCVT+1520                                            01200000
ATCSMMWA EQU   ISTATCVT+1516                                            01201000
ATCSDCFR EQU   ISTATCVT+1512                                            01202000
ATCTSCRA EQU   ISTATCVT+1508                                            01203000
ATCSOCNT EQU   ISTATCVT+1504                                            01204000
ATCSOTHR EQU   ISTATCVT+1502                                            01205000
ATCSOPR2 EQU   ISTATCVT+1501                                            01206000
ATCSOPR1 EQU   ISTATCVT+1500                                            01207000
ATCAPCAT EQU   ISTATCVT+1496                                            01208000
ATCTSCWU EQU   ISTATCVT+1492                                            01209000
ATCMWRDT EQU   ISTATCVT+1488                                            01210000
ATCSTCK  EQU   ISTATCVT+1480                                            01211000
ATCWUPAB EQU   ATCWUDYP+16                                              01212000
@NM00223 EQU   ATCWUDYP                                                 01213000
ATCLKCNT EQU   ATCLKSWP+4                                               01214000
ATCCLOCK EQU   ATCLKSWP                                                 01215000
ATCNCBQ  EQU   ISTATCVT+1436                                            01216000
ATCPUCWC EQU   ISTATCVT+1432                                            01217000
ATCTSCQV EQU   ISTATCVT+1428                                            01218000
ATCTSCQU EQU   ISTATCVT+1424                                            01219000
ATCTSCQM EQU   ISTATCVT+1420                                            01220000
ATCTSCQF EQU   ISTATCVT+1416                                            01221000
ATCAPCVR EQU   ISTATCVT+1412                                            01222000
ATCHSQLK EQU   ISTATCVT+1408                                            01223000
ATCICIDM EQU   ISTATCVT+1406                                            01224000
ATCYRANG EQU   ISTATCVT+1405                                            01225000
ATCDRNUM EQU   ISTATCVT+1404                                            01226000
ATCSACNT EQU   ISTATCVT+1400                                            01227000
ATCTSCFA EQU   ISTATCVT+1396                                            01228000
ATCCDCVR EQU   ISTATCVT+1392                                            01229000
ATCCDCRI EQU   ISTATCVT+1388                                            01230000
ATCCDCRT EQU   ISTATCVT+1384                                            01231000
ATCVRNDX EQU   ISTATCVT+1380                                            01232000
ATCRACVB EQU   ISTATCVT+1376                                            01233000
ATCPSTLK EQU   ISTATCVT+1372                                            01234000
ATCOCAOA EQU   ISTATCVT+1368                                            01235000
ATCPUCEF EQU   ISTATCVT+1364                                            01236000
ATCPUCBM EQU   ISTATCVT+1360                                            01237000
ATCAPCES EQU   ISTATCVT+1356                                            01238000
ATCAPCPC EQU   ISTATCVT+1352                                            01239000
ATCAPCTE EQU   ISTATCVT+1348                                            01240000
ATCAPCIN EQU   ISTATCVT+1344                                            01241000
ATCAPCPD EQU   ISTATCVT+1340                                            01242000
ATCAPCAD EQU   ISTATCVT+1336                                            01243000
ATCAPCSD EQU   ISTATCVT+1332                                            01244000
ATCAPCIE EQU   ISTATCVT+1328                                            01245000
ATCAPCUE EQU   ISTATCVT+1324                                            01246000
ATCAPCRP EQU   ISTATCVT+1320                                            01247000
ATCAPCRS EQU   ISTATCVT+1316                                            01248000
ATCAPCTP EQU   ISTATCVT+1312                                            01249000
ATCAPCTW EQU   ISTATCVT+1308                                            01250000
ATCAPCPS EQU   ISTATCVT+1304                                            01251000
ATCAPCTS EQU   ISTATCVT+1300                                            01252000
ATCAPCTQ EQU   ISTATCVT+1296                                            01253000
ATCAPCTX EQU   ISTATCVT+1292                                            01254000
ATCSDCOS EQU   ISTATCVT+1288                                            01255000
ATCEXCVR EQU   ISTATCVT+1284                                            01256000
ATCCPCSV EQU   ISTATCVT+1280                                            01257000
ATCVRECB EQU   ATCVRTIL+12                                              01258000
ATCVRLCK EQU   ATCVRTIL+8                                               01259000
ATCVRWEL EQU   ATCVRTIL+4                                               01260000
ATCVRWEQ EQU   ATCVRTIL                                                 01261000
ATCMGPAB EQU   ISTATCVT+1248                                            01262000
ATCTSCMS EQU   ISTATCVT+1244                                            01263000
ATCVRATB EQU   ISTATCVT+1240                                            01264000
ATCVRWAP EQU   ISTATCVT+1236                                            01265000
ATCPVRAQ EQU   ISTATCVT+1232                                            01266000
ATCTOWA  EQU   ISTATCVT+1228                                            01267000
ATCTOD2  EQU   ATCTOD+4                                                 01268000
ATCTOD1  EQU   ATCTOD                                                   01269000
ATCERTP  EQU   ISTATCVT+1216                                            01270000
ATCBINDQ EQU   ISTATCVT+1212                                            01271000
ATCTIMER EQU   ISTATCVT+1208                                            01272000
ATCTSCDN EQU   ISTATCVT+1204                                            01273000
ATCTSCCN EQU   ISTATCVT+1200                                            01274000
ATCTSCL0 EQU   ISTATCVT+1196                                            01275000
ATCTSCP2 EQU   ISTATCVT+1192                                            01276000
ATCTSC3S EQU   ISTATCVT+1188                                            01277000
ATCTSC3R EQU   ISTATCVT+1184                                            01278000
ATCTSC3O EQU   ISTATCVT+1180                                            01279000
ATCIOPRG EQU   ATCIOINT                                                 01280000
ATCTSCMI EQU   ISTATCVT+1172                                            01281000
ATCTSCMO EQU   ISTATCVT+1168                                            01282000
ATCTSCP4 EQU   ISTATCVT+1164                                            01283000
ATCPUSCT EQU   ISTATCVT+1160                                            01284000
ATCTKINT EQU   ATCTKFLD+2                                               01285000
ATCTKCNT EQU   ATCTKFLD                                                 01286000
ATCTIMCK EQU   ISTATCVT+1152                                            01287000
@NM00222 EQU   ATCRID+2                                                 01288000
ATCCDRMA EQU   ATCRID                                                   01289000
ATCCPCGD EQU   ISTATCVT+1140                                            01290000
@NM00221 EQU   ATCSMSDQ+8                                               01291000
@NM00220 EQU   ATCSMSDQ+4                                               01292000
@NM00219 EQU   ATCSMSDQ                                                 01293000
ATCSEQNO EQU   ISTATCVT+1124                                            01294000
ATCSMPMD EQU   ISTATCVT+1120                                            01295000
ATCPAREA EQU   ISTATCVT+1116                                            01296000
ATCCPCSM EQU   ISTATCVT+1112                                            01297000
ATCSQCDS EQU   ISTATCVT+1108                                            01298000
ATCUSSVT EQU   ISTATCVT+1104                                            01299000
ATCNOSQ  EQU   ISTATCVT+1100                                            01300000
ATCINCIP EQU   ATCCPDVT+4                                               01301000
ATCTSCNI EQU   ATCCPDVT                                                 01302000
ATCMGCRT EQU   ISTATCVT+1088                                            01303000
ATCMACRT EQU   ISTATCVT+1084                                            01304000
ATCCSMT  EQU   ISTATCVT+1080                                            01305000
ATCINCNO EQU   ISTATCVT+1076                                            01306000
ATCRACON EQU   ISTATCVT+1072                                            01307000
ATCCFCDR EQU   ISTATCVT+1068                                            01308000
ATCONFIG EQU   ISTATCVT+1060                                            01309000
ATCNODEL EQU   ISTATCVT+1052                                            01310000
ATCCDTIM EQU   ISTATCVT+1050                                            01311000
ATCNMCTR EQU   ISTATCVT+1048                                            01312000
ATCPOIA  EQU   ATCRNO+1                                                 01313000
@NM00218 EQU   ATCRNO                                                   01314000
ATCHBSIZ EQU   ATCHPGM+2                                                01315000
ATCHBFNO EQU   ATCHPGM                                                  01316000
ATCMROUT EQU   ISTATCVT+1031                                            01317000
ATCXRANG EQU   ISTATCVT+1030                                            01318000
ATCMAXID EQU   ISTATCVT+1029                                            01319000
ATCMSGSP EQU   ISTATCVT+1028                                            01320000
ATCECTLP EQU   ISTATCVT+1024                                            01321000
ATCECSES EQU   ISTATCVT+1020                                            01322000
ATCECDSP EQU   ISTATCVT+1016                                            01323000
ATCECVRY EQU   ISTATCVT+1012                                            01324000
ATCECHLT EQU   ISTATCVT+1008                                            01325000
ATCECMOD EQU   ISTATCVT+1004                                            01326000
ATCRDTLK EQU   ISTATCVT+1000                                            01327000
ATCVOCLK EQU   ISTATCVT+996                                             01328000
ATCCIDM  EQU   ISTATCVT+994                                             01329000
ATCITLIM EQU   ISTATCVT+992                                             01330000
ATCTMINV EQU   ISTATCVT+990                                             01331000
ATCHOSTA EQU   ISTATCVT+988                                             01332000
ATCPUNSA EQU   ISTATCVT+986                                             01333000
ATCVTMID EQU   ATCSSCPA                                                 01334000
ATCHCNID EQU   ATCONID+2                                                01335000
ATCSCNID EQU   ATCONID                                                  01336000
@NM00217 EQU   ATCBITAN+3                                               01337000
@NM00216 EQU   ATCBITAN+2                                               01338000
@NM00215 EQU   ATCFLAG2                                                 01339000
ATCMSGID EQU   ATCFLAG2                                                 01340000
ATCINACT EQU   ATCFLAG2                                                 01341000
ATCCRYPF EQU   ATCFLAG2                                                 01342000
ATCTUNCL EQU   ATCFLAG2                                                 01343000
ATCTUNRQ EQU   ATCFLAG2                                                 01344000
ATCTUNAC EQU   ATCFLAG2                                                 01345000
ATCCDLRA EQU   ATCFLAG2                                                 01346000
@NM00214 EQU   ATCBITAN                                                 01347000
@NM00213 EQU   ATCSTAT4                                                 01348000
@NM00212 EQU   ATCSTAT4                                                 01349000
@NM00211 EQU   ATCSTAT4                                                 01350000
ATCPUIOT EQU   ATCSTAT4                                                 01351000
ATCPUBUF EQU   ATCSTAT4                                                 01352000
@NM00210 EQU   ATCSTAT4                                                 01353000
ATCNCSD  EQU   ATCSTAT4                                                 01354000
ATCMTST  EQU   ATCSTAT4                                                 01355000
@NM00209 EQU   ATCPOFLG                                                 01356000
@NM00208 EQU   ATCPOFLG                                                 01357000
@NM00207 EQU   ATCPOFLG                                                 01358000
@NM00206 EQU   ATCPOFLG                                                 01359000
@NM00205 EQU   ATCPOFLG                                                 01360000
@NM00204 EQU   ATCPOFLG                                                 01361000
@NM00203 EQU   ATCPOFLG                                                 01362000
ATCPOUNS EQU   ATCPOFLG                                                 01363000
ATCITEXT EQU   @NM00202                                                 01364000
ATCHIP   EQU   ATCSTAT1                                                 01365000
ATCMDHLT EQU   ATCSTAT1                                                 01366000
ATCINHLT EQU   ATCSTAT1                                                 01367000
ATCNETSL EQU   ATCSTAT1                                                 01368000
ATCQKHLT EQU   ATCSTAT1                                                 01369000
ATCSNHLT EQU   ATCSTAT1                                                 01370000
ATCACTIV EQU   ATCSTAT1                                                 01371000
ATCSTART EQU   ATCSTAT1                                                 01372000
ATCNOP00 EQU   ISTATCVT+968                                             01373000
ATCTSBUF EQU   ISTATCVT+964                                             01374000
ATCSSOQH EQU   ISTATCVT+960                                             01375000
ATCSSIQH EQU   ISTATCVT+956                                             01376000
ATCTSCMB EQU   ATCMBDVT                                                 01377000
ATCSOPAC EQU   ISTATCVT+950                                             01378000
ATCSOTIM EQU   ISTATCVT+948                                             01379000
ATCTSCON EQU   ATCSODVT                                                 01380000
ATCTSCSC EQU   ATCSSDVT                                                 01381000
ATCTSCRO EQU   ISTATCVT+936                                             01382000
ATCTSCRI EQU   ISTATCVT+932                                             01383000
ATCFEPT  EQU   ISTATCVT+928                                             01384000
ATCFDVT  EQU   ISTATCVT+924                                             01385000
ATCCONFT EQU   ISTATCVT+920                                             01386000
ATCSIBQ  EQU   ISTATCVT+916                                             01387000
ATCDSPLQ EQU   ISTATCVT+912                                             01388000
ATCVARYQ EQU   ISTATCVT+908                                             01389000
ATCHALTQ EQU   ISTATCVT+904                                             01390000
ATCMODQ  EQU   ISTATCVT+900                                             01391000
ATCSRT   EQU   ISTATCVT+896                                             01392000
ATCRDT   EQU   ISTATCVT+892                                             01393000
ATCSDVT  EQU   ISTATCVT+888                                             01394000
ATCDLRPT EQU   ISTATCVT+884                                             01395000
ATCBPDA  EQU   ISTATCVT+880                                             01396000
ATCACDA  EQU   ISTATCVT+876                                             01397000
ATCMNT   EQU   ISTATCVT+872                                             01398000
ATCNODDS EQU   ISTATCVT+868                                             01399000
ATCITRT  EQU   ISTATCVT+864                                             01400000
ATCTODVT EQU   ISTATCVT+860                                             01401000
ATCTRCPT EQU   ISTATCVT+856                                             01402000
ATCMODTB EQU   ISTATCVT+852                                             01403000
ATCUSSPT EQU   ISTATCVT+848                                             01404000
ATCTUBUF EQU   ISTATCVT+844                                             01405000
ATCTACB  EQU   ISTATCVT+840                                             01406000
ATCDWA   EQU   ISTATCVT+836                                             01407000
ATCCFCR2 EQU   ATCPODVT                                                 01408000
ATCPULQB EQU   @NM00201+16                                              01409000
ATCMCQAB EQU   @NM00201+12                                              01410000
ATCLUSMQ EQU   @NM00201+8                                               01411000
ATCLUIOQ EQU   @NM00201+4                                               01412000
ATCIOLQB EQU   @NM00201                                                 01413000
ATCTSCAP EQU   ATCANYDT                                                 01414000
ATCTSCCO EQU   ATCLUDVT+4                                               01415000
ATCTSCSR EQU   ATCLUDVT                                                 01416000
ATCVTLOD EQU   ISTATCVT+796                                             01417000
ATCTSCLF EQU   ISTATCVT+792                                             01418000
ATCTSCLE EQU   ISTATCVT+788                                             01419000
ATCTSCLB EQU   ISTATCVT+784                                             01420000
ATCTSCLS EQU   ISTATCVT+780                                             01421000
ATCTSCCF EQU   ISTATCVT+776                                             01422000
ATCTSCFV EQU   ISTATCVT+772                                             01423000
ATCTSCCE EQU   ISTATCVT+768                                             01424000
ATCTSCCB EQU   ISTATCVT+764                                             01425000
ATCTSCWS EQU   ISTATCVT+760                                             01426000
ATCTSCEM EQU   ISTATCVT+756                                             01427000
ATCTSCNS EQU   ISTATCVT+752                                             01428000
ATCTSCER EQU   ISTATCVT+748                                             01429000
ATCTSCPR EQU   ISTATCVT+744                                             01430000
ATCTSCGR EQU   ISTATCVT+740                                             01431000
ATCTSCCI EQU   ISTATCVT+736                                             01432000
ATCTSVT  EQU   ISTATCVT+732                                             01433000
ATCDVLOD EQU   ISTATCVT+728                                             01434000
ATCCDCNR EQU   ISTATCVT+724                                             01435000
ATCCDCNF EQU   ISTATCVT+720                                             01436000
ATCCDCND EQU   ISTATCVT+716                                             01437000
ATCCDCNA EQU   ISTATCVT+712                                             01438000
ATCCDCCP EQU   ISTATCVT+708                                             01439000
ATCCDFDN EQU   ISTATCVT+704                                             01440000
ATCCDFIN EQU   ISTATCVT+700                                             01441000
ATCCDFND EQU   ISTATCVT+696                                             01442000
ATCCDDEL EQU   ISTATCVT+692                                             01443000
ATCCDADD EQU   ISTATCVT+688                                             01444000
ATCTCLIM EQU   ISTATCVT+684                                             01445000
ATCRACTR EQU   ISTATCVT+680                                             01446000
ATCRACTI EQU   ISTATCVT+676                                             01447000
ATCREMOV EQU   ISTATCVT+672                                             01448000
ATCRACIO EQU   ISTATCVT+668                                             01449000
ATCADD   EQU   ISTATCVT+664                                             01450000
ATCPUCRT EQU   ISTATCVT+660                                             01451000
ATCSMRS  EQU   ISTATCVT+656                                             01452000
ATCSMRQ  EQU   ISTATCVT+652                                             01453000
ATCORCAF EQU   ISTATCVT+648                                             01454000
ATCFRSTR EQU   ATCGTSTR                                                 01455000
ATCSTMA  EQU   ISTATCVT+640                                             01456000
ATCSRTAD EQU   ISTATCVT+636                                             01457000
ATCOCCFS EQU   ISTATCVT+632                                             01458000
ATCOCCFP EQU   ISTATCVT+628                                             01459000
ATCSRTDF EQU   ISTATCVT+624                                             01460000
ATCLUCRT EQU   ISTATCVT+620                                             01461000
ATCINCY5 EQU   ISTATCVT+616                                             01462000
ATCINCW3 EQU   ISTATCVT+612                                             01463000
ATCINCU6 EQU   ISTATCVT+608                                             01464000
ATCINCTQ EQU   ISTATCVT+604                                             01465000
ATCINCS1 EQU   ISTATCVT+600                                             01466000
ATCSRTAB EQU   ISTATCVT+596                                             01467000
ATCINCRD EQU   ISTATCVT+592                                             01468000
ATCINCPH EQU   ISTATCVT+588                                             01469000
ATCINCLQ EQU   ISTATCVT+584                                             01470000
ATCNOCRT EQU   ISTATCVT+580                                             01471000
ATCINCF1 EQU   ISTATCVT+576                                             01472000
ATCINCCI EQU   ISTATCVT+572                                             01473000
ATCINCCO EQU   ISTATCVT+568                                             01474000
ATCBLDLA EQU   ISTATCVT+564                                             01475000
ATCALOAD EQU   ISTATCVT+560                                             01476000
ATCADEL  EQU   ISTATCVT+556                                             01477000
ATCRACEP EQU   ISTATCVT+552                                             01478000
ATCESC01 EQU   ISTATCVT+548                                             01479000
ATCDEC01 EQU   ISTATCVT+544                                             01480000
ATCDEC00 EQU   ISTATCVT+540                                             01481000
ATCCPCRT EQU   ISTATCVT+536                                             01482000
ATCAP35  EQU   ISTATCVT+532                                             01483000
ATCCPCFR EQU   ISTATCVT+528                                             01484000
ATCCPCGR EQU   ISTATCVT+524                                             01485000
ATCCPCPP EQU   ISTATCVT+520                                             01486000
ATCCPCNT EQU   ISTATCVT+516                                             01487000
ATCAUTHA EQU   ISTATCVT+512                                             01488000
ATCACCTA EQU   ISTATCVT+508                                             01489000
ATCMSGP  EQU   ISTATCVT+504                                             01490000
ATCAP39  EQU   ISTATCVT+500                                             01491000
ATCAP36  EQU   ISTATCVT+496                                             01492000
ATCMSGM  EQU   ISTATCVT+492                                             01493000
ATCAP33  EQU   ISTATCVT+488                                             01494000
ATCAICPT EQU   ISTATCVT+484                                             01495000
ATCAPI   EQU   ISTATCVT+480                                             01496000
ATCACC01 EQU   ISTATCVT+476                                             01497000
ATCACC00 EQU   ISTATCVT+472                                             01498000
ATCMBPAB EQU   ISTATCVT+456                                             01499000
ATCSOPAB EQU   ISTATCVT+440                                             01500000
ATCSSPAB EQU   ISTATCVT+424                                             01501000
ATCLDECB EQU   ATCLDTIL+12                                              01502000
ATCLDLCK EQU   ATCLDTIL+8                                               01503000
ATCLDLST EQU   ATCLDTIL+4                                               01504000
ATCLDNCS EQU   ATCLDTIL                                                 01505000
ATCNOSPB EQU   ISTATCVT+376                                             01506000
ATCNSPAB EQU   ISTATCVT+344                                             01507000
ATCLUSRT EQU   ISTATCVT+312                                             01508000
ATCPUIOP EQU   ISTATCVT+280                                             01509000
ATCPUPAB EQU   ISTATCVT+248                                             01510000
ATCPXPAB EQU   ISTATCVT+216                                             01511000
ATCPOPAB EQU   ISTATCVT+184                                             01512000
ATCVDPAB EQU   ISTATCVT+152                                             01513000
ATCTCIPB EQU   ISTATCVT+120                                             01514000
ATCCSPAB EQU   ATCSMPAB+16                                              01515000
@NM00200 EQU   ATCSMPAB                                                 01516000
ATCTMRPB EQU   ISTATCVT+56                                              01517000
ATCITPAB EQU   ISTATCVT+24                                              01518000
@NM00199 EQU   ATCITRA1+1                                               01519000
ATCITCIO EQU   ATCITRA1                                                 01520000
ATCITSCP EQU   ATCITRA1                                                 01521000
ATCITMSG EQU   ATCITRA1                                                 01522000
ATCITPIU EQU   ATCITRA1                                                 01523000
ATCITSMS EQU   ATCITRA1                                                 01524000
ATCITPSS EQU   ATCITRA1                                                 01525000
ATCITLCK EQU   ATCITRA1                                                 01526000
ATCITAPI EQU   ATCITRA1                                                 01527000
ATCITCNT EQU   ATCITFLG                                                 01528000
ATCITRPH EQU   ATCITCDS                                                 01529000
ATCITTBL EQU   ATCITFLD+4                                               01530000
ATCITMAX EQU   ATCITPRM                                                 01531000
ATCPTCHA EQU   ATCRPTCH+4                                               01532000
ATCVTLVL EQU   ATCRPTCH                                                 01533000
RPHUPSTA EQU   ISTRPH+100                                               01534000
RPHSAV16 EQU   RPHWORK+60                                               01535000
RPHSAV15 EQU   RPHWORK+56                                               01536000
RPHSAV14 EQU   RPHWORK+52                                               01537000
RPHSAV13 EQU   RPHWORK+48                                               01538000
RPHSAV12 EQU   RPHWORK+44                                               01539000
RPHSAV11 EQU   RPHWORK+40                                               01540000
RPHSAV10 EQU   RPHWORK+36                                               01541000
RPHSAVE9 EQU   RPHWORK+32                                               01542000
RPHSAVE8 EQU   RPHWORK+28                                               01543000
RPHSAVE7 EQU   RPHWORK+24                                               01544000
RPHSAVE6 EQU   RPHWORK+20                                               01545000
RPHSAVE5 EQU   RPHWORK+16                                               01546000
RPHSAVE4 EQU   RPHWORK+12                                               01547000
RPHSAVE3 EQU   RPHWORK+8                                                01548000
RPHSAVE2 EQU   RPHWORK+4                                                01549000
RPHSHALF EQU   RPHSAVE1+2                                               01550000
RPHSBIT8 EQU   RPHSBITS                                                 01551000
RPHSBIT7 EQU   RPHSBITS                                                 01552000
RPHSBIT6 EQU   RPHSBITS                                                 01553000
RPHSBIT5 EQU   RPHSBITS                                                 01554000
RPHSBIT4 EQU   RPHSBITS                                                 01555000
RPHSBIT3 EQU   RPHSBITS                                                 01556000
RPHSBIT2 EQU   RPHSBITS                                                 01557000
RPHSBIT1 EQU   RPHSBITS                                                 01558000
RPHSBYTE EQU   RPHSAVE1                                                 01559000
RPHCRR   EQU   ISTRPH+32                                                01560000
RPHSRP34 EQU   RPHSRPRM+2                                               01561000
RPHSRP12 EQU   RPHSRPRM                                                 01562000
RPHWEGT  EQU   RPHWEA                                                   01563000
RPHMAJCB EQU   ISTRPH+21                                                01564000
RPHPABOF EQU   ISTRPH+20                                                01565000
RPHRESUM EQU   RPHRESMA+1                                               01566000
@NM00198 EQU   RPHWPFLG                                                 01567000
RPHPURGE EQU   RPHWPFLG                                                 01568000
RPHPT    EQU   RPHWPFLG                                                 01569000
RPHWT    EQU   RPHWPFLG                                                 01570000
RPHRSKEY EQU   RPHWPFLG                                                 01571000
RPHDVTA  EQU   ISTRPH+12                                                01572000
RPHTIK   EQU   RPHTSKID+3                                               01573000
@NM00197 EQU   RPHTSKID                                                 01574000
RPHRPHAP EQU   RPHRPHA+1                                                01575000
@NM00196 EQU   RPHRPHA                                                  01576000
RPHGATE  EQU   RPHRPHA                                                  01577000
@NM00195 EQU   RPHFLGB                                                  01578000
RPHABEND EQU   RPHFLGB                                                  01579000
RPHUWAIT EQU   RPHFLGB                                                  01580000
RPHRLCRA EQU   RPHFLGB                                                  01581000
RPHSYNCH EQU   RPHFLGB                                                  01582000
RPHPGCMP EQU   RPHFLGB                                                  01583000
RPHLOCK  EQU   RPHFLGB                                                  01584000
@NM00194 EQU   RPHFLAGS                                                 01585000
RPHSMCLR EQU   RPHFLAGS                                                 01586000
RPHSMTYP EQU   RPHFLAGS                                                 01587000
RPHSMQ   EQU   RPHFLAGS                                                 01588000
RPHLNGTH EQU   RPHCNTL+1                                                01589000
RPHTYPE  EQU   RPHCNTL                                                  01590000
@NM00181 EQU   ICNSYSUA+232                                             01591000
ICNSRB   EQU   ICNSYSUA+188                                             01592000
ICNIOSB  EQU   ICNDCDEB+64                                              01593000
ICNDCBIF EQU   ICNDIDEB                                                 01594000
ICNEXSCL EQU   ICNDCDEB+28                                              01595000
ICNDEBID EQU   ICNDCDEB+24                                              01596000
@NM00180 EQU   ICNDCDEB                                                 01597000
ICNERPWA EQU   ICNSYSUA+8                                               01598000
ICNCNTRL EQU   ICNSYSUA+4                                               01599000
ICNCKPAB EQU   ICNCKFLD+1                                               01600000
@NM00179 EQU   ICNCKFLD                                                 01601000
ICNCKBIT EQU   ICNCKFLD                                                 01602000
ICNQDSIO EQU   ISTICNCB+238                                             01603000
ICNQDPTH EQU   ISTICNCB+236                                             01604000
ICNMWRDT EQU   ISTICNCB+232                                             01605000
ICNCLOCK EQU   ISTICNCB+228                                             01606000
ICNNCBQ  EQU   ISTICNCB+224                                             01607000
ICNNPIUS EQU   ISTICNCB+222                                             01608000
@NM00178 EQU   ISTICNCB+221                                             01609000
@NM00177 EQU   @NM00176                                                 01610000
ICNREAD  EQU   @NM00176                                                 01611000
ICNMM    EQU   @NM00176                                                 01612000
ICNLCLUS EQU   @NM00176                                                 01613000
ICNTGN   EQU   ISTICNCB+219                                             01614000
ICNLNKMD EQU   ISTICNCB+218                                             01615000
ICNPUNA  EQU   ISTICNCB+216                                             01616000
ICNSUBA  EQU   ISTICNCB+212                                             01617000
ICNMSIZE EQU   ISTICNCB+208                                             01618000
ICNRSTIC EQU   ICNDEVCA+48                                              01619000
ICNRSCCW EQU   ICNDEVCA+40                                              01620000
ICNSMNOP EQU   ICNDEVCA+32                                              01621000
ICNNPCCW EQU   ICNDEVCA+24                                              01622000
ICNWBCCW EQU   ICNDEVCA+16                                              01623000
ICNWSTIC EQU   ICNDEVCA+8                                               01624000
ICNWSCCW EQU   ICNDEVCA                                                 01625000
ICNCB    EQU   ISTICNCB                                                 01626000
NCBEND   EQU   ISTNCB+152                                               01627000
@NM00175 EQU   NCBDLCIA+102                                             01628000
NCBSTANA EQU   NCBDLCIA+100                                             01629000
NCBUFRPH EQU   NCBDLCIA+96                                              01630000
NCBDCFLG EQU   NCBFLAGS+3                                               01631000
NCBCEALK EQU   NCBCEFLG                                                 01632000
NCBERP   EQU   NCBCEFLG                                                 01633000
NCBEXSDA EQU   NCBCEFLG                                                 01634000
NCBEXSNO EQU   NCBCEFLG                                                 01635000
NCBEXAIL EQU   NCBCEFLG                                                 01636000
NCBEXAIC EQU   NCBCEFLG                                                 01637000
NCBPOSTF EQU   NCBCEFLG                                                 01638000
NCBERROR EQU   NCBCEFLG                                                 01639000
NCBWRREQ EQU   NCBUFFLG                                                 01640000
@NM00174 EQU   NCBUFFLG                                                 01641000
NCBURQCN EQU   NCBUFFLG                                                 01642000
NCBUIOEM EQU   NCBUFFLG                                                 01643000
NCBUDELR EQU   NCBUFFLG                                                 01644000
NCBRHELD EQU   NCBDSFLG                                                 01645000
NCBASYNC EQU   NCBDSFLG                                                 01646000
NCBVIRT  EQU   NCBDSFLG                                                 01647000
NCBPOLL  EQU   NCBDSFLG                                                 01648000
NCBSLOW  EQU   NCBDSFLG                                                 01649000
NCBRDREQ EQU   NCBDSFLG                                                 01650000
NCBIOTRC EQU   NCBDSFLG                                                 01651000
NCBBUSYF EQU   NCBDSFLG                                                 01652000
NCBLOCK  EQU   NCBDLCIA+88                                              01653000
NCBSIB   EQU   NCBDLCIA+84                                              01654000
NCBUNAME EQU   NCBDLCIA+80                                              01655000
NCBLUST  EQU   NCBBFT                                                   01656000
NCBPUREQ EQU   NCBDLCIA+72                                              01657000
NCBWRUPE EQU   NCBDLCIA+68                                              01658000
NCBHRUPE EQU   NCBDLCIA+64                                              01659000
NCBSIOCT EQU   NCBDLCIA+62                                              01660000
NCBSNS2  EQU   NCBSENSE+1                                               01661000
NCBSNS1  EQU   NCBSENSE                                                 01662000
NCBCAW   EQU   NCBDLCIA+56                                              01663000
NCBCSW   EQU   NCBDLCIA+48                                              01664000
NCBBUFRQ EQU   NCBBUFFQ+6                                               01665000
NCBBUFNO EQU   NCBBUFFQ+4                                               01666000
NCBBUFQH EQU   NCBBUFFQ                                                 01667000
NCBPNDQT EQU   NCBPENDQ+4                                               01668000
NCBPNDQH EQU   NCBPENDQ                                                 01669000
NCBUFPAB EQU   NCBDLCIA+16                                              01670000
NCBPUPAB EQU   NCBDLCIA                                                 01671000
NCBPCPAB EQU   NCBBASE+32                                               01672000
NCBWORKQ EQU   NCBPCDYP+12                                              01673000
@NM00173 EQU   NCBPCDYP                                                 01674000
NCBUSECT EQU   NCBBASE+14                                               01675000
NCBLNKST EQU   NCBBASE+13                                               01676000
NCBTECT  EQU   NCBBASE+12                                               01677000
NCBTSKID EQU   NCBBASE+8                                                01678000
NCBRDTE  EQU   NCBBASE+4                                                01679000
NCBDAF   EQU   NCBBASE+2                                                01680000
NCBLNGTH EQU   NCBBASE+1                                                01681000
NCBTYPE  EQU   NCBBASE                                                  01682000
CCWCOUNT EQU   ISTCCW+6                                                 01683000
CCWSPARE EQU   ISTCCW+5                                                 01684000
CCWNULL  EQU   CCWFLAGS                                                 01685000
CCWPCI   EQU   CCWFLAGS                                                 01686000
CCWSKIP  EQU   CCWFLAGS                                                 01687000
CCWSLI   EQU   CCWFLAGS                                                 01688000
CCWCC    EQU   CCWFLAGS                                                 01689000
CCWCD    EQU   CCWFLAGS                                                 01690000
CCWADDR  EQU   CCWVADDR+1                                               01691000
CCWCODE  EQU   CCWVADDR                                                 01692000
DYPPAB   EQU   ISTDYPAB+16                                              01693000
DYPOCRPH EQU   DYPPACMD                                                 01694000
DYPTSKID EQU   ISTDYPAB+8                                               01695000
DYPPACTB EQU   DYPCHAIN                                                 01696000
DYPFLGS  EQU   ISTDYPAB+2                                               01697000
DYPLNGTH EQU   ISTDYPAB+1                                               01698000
DYPTYPE  EQU   ISTDYPAB                                                 01699000
PABRPHA  EQU   PABRPHFG+1                                               01700000
@NM00171 EQU   PABFLAGS                                                 01701000
PABKPRPH EQU   PABFLAGS                                                 01702000
PABNODQ  EQU   PABFLAGS                                                 01703000
PABXTND  EQU   PABFLAGS                                                 01704000
PABSYNCH EQU   PABFLAGS                                                 01705000
PABCDP   EQU   PABFLAGS                                                 01706000
PABUNCON EQU   PABFLAGS                                                 01707000
PABDVTA  EQU   ISTPAB+9                                                 01708000
PABOFFST EQU   ISTPAB+8                                                 01709000
PABCHNGP EQU   PABCHAIN+1                                               01710000
@NM00170 EQU   PABCHAIN                                                 01711000
PABCHNG  EQU   PABCHAIN                                                 01712000
PABWEQP  EQU   PABWEQA+1                                                01713000
@NM00169 EQU   PABWEQA                                                  01714000
PABWEQG  EQU   PABWEQA                                                  01715000
DNTNAME  EQU   DNTTELNO                                                 01716000
DNTCTDIG EQU   ISTDNT                                                   01717000
DOTADTRM EQU   ISTDOT                                                   01718000
GNTGRPNM EQU   ISTGNT                                                   01719000
@NM00168 EQU   PATFLAGA                                                 01720000
@NM00167 EQU   PATFLAGA                                                 01721000
@NM00166 EQU   PATFLAGA                                                 01722000
@NM00165 EQU   PATFLAGA                                                 01723000
@NM00164 EQU   PATFLAGA                                                 01724000
@NM00163 EQU   PATFLAGA                                                 01725000
PATDCALL EQU   PATFLAGA                                                 01726000
PATUSEFG EQU   PATFLAGA                                                 01727000
PATRDCNT EQU   ISTPAT+6                                                 01728000
PATGRPID EQU   ISTPAT+5                                                 01729000
PATPTHID EQU   ISTPAT+4                                                 01730000
PATDINDX EQU   ISTPAT+2                                                 01731000
PATGINDX EQU   ISTPAT                                                   01732000
RCCEND   EQU   ISTRCC+132                                               01733000
@NM00162 EQU   ISTRCC+130                                               01734000
RCCSESCT EQU   ISTRCC+129                                               01735000
RCCCNCNT EQU   ISTRCC+128                                               01736000
RCCPUXPT EQU   ISTRCC+124                                               01737000
@NM00161 EQU   ISTRCC+122                                               01738000
RCCINDEX EQU   ISTRCC+120                                               01739000
RCCPATHZ EQU   ISTRCC+118                                               01740000
RCCCTELU EQU   ISTRCC+116                                               01741000
RCCTIMER EQU   ISTRCC+112                                               01742000
RCCPATHT EQU   ISTRCC+108                                               01743000
@NM00160 EQU   ISTRCC+107                                               01744000
@NM00159 EQU   RCCBITAN+1                                               01745000
@NM00158 EQU   RCCBITAN+1                                               01746000
@NM00157 EQU   RCCBITAN+1                                               01747000
@NM00156 EQU   RCCBITAN+1                                               01748000
@NM00155 EQU   RCCBITAN+1                                               01749000
@NM00154 EQU   RCCBITAN+1                                               01750000
RCCANS   EQU   RCCBITAN+1                                               01751000
RCCBNNSP EQU   RCCBITAN+1                                               01752000
RCCIRETR EQU   RCCBITAN                                                 01753000
RCCDSNPR EQU   RCCBITAN                                                 01754000
RCCACTPU EQU   RCCBITAN                                                 01755000
RCCBRKCN EQU   RCCBITAN                                                 01756000
RCCFINAL EQU   RCCBITAN                                                 01757000
RCCDIALP EQU   RCCBITAN                                                 01758000
RCCBRKF  EQU   RCCBITAN                                                 01759000
RCCCTPGD EQU   RCCBITAN                                                 01760000
RCCCDFLG EQU   ISTRCC+104                                               01761000
RCCPRE   EQU   ISTRCC                                                   01762000
RCDRMEND EQU   ISTRCDRM+220                                             01763000
@NM00153 EQU   ISTRCDRM+218                                             01764000
RCDRMSEQ EQU   ISTRCDRM+216                                             01765000
@NM00152 EQU   ISTRCDRM+213                                             01766000
RCDRMSC  EQU   ISTRCDRM+212                                             01767000
@NM00151 EQU   RCDRMFGS+3                                               01768000
@NM00150 EQU   RCDRMFGS+3                                               01769000
@NM00149 EQU   RCDRMFGS+3                                               01770000
@NM00148 EQU   RCDRMFGS+3                                               01771000
@NM00147 EQU   RCDRMFGS+3                                               01772000
@NM00146 EQU   RCDRMFGS+3                                               01773000
@NM00145 EQU   RCDRMFGS+3                                               01774000
RCDRMCD2 EQU   RCDRMFGS+3                                               01775000
RCDRCDRS EQU   RCDRMFGS+2                                               01776000
RCDRMDYN EQU   RCDRMFGS+2                                               01777000
RCDRMRID EQU   RCDRMFGS+2                                               01778000
RCDRMLOQ EQU   RCDRMFGS+2                                               01779000
RCDRMNMP EQU   RCDRMFGS+2                                               01780000
RCDRMPS  EQU   RCDRMFGS+2                                               01781000
RCDRMURC EQU   RCDRMFGS+2                                               01782000
RCDRMNAP EQU   RCDRMFGS+2                                               01783000
RCDRMVL  EQU   RCDRMFGS+1                                               01784000
RCDRMSPC EQU   RCDRMFGS+1                                               01785000
RCDRMINC EQU   RCDRMFGS+1                                               01786000
RCDRMLPS EQU   RCDRMFGS+1                                               01787000
RCDRMTCR EQU   RCDRMFGS+1                                               01788000
RCDRMDTC EQU   RCDRMFGS+1                                               01789000
RCDRMDT  EQU   RCDRMFGS+1                                               01790000
RCDRMCLR EQU   RCDRMFGS+1                                               01791000
RCDRMCLC EQU   RCDRMFGS                                                 01792000
RCDRMDCD EQU   RCDRMFGS                                                 01793000
RCDRMOVR EQU   RCDRMFGS                                                 01794000
RCDRMSDT EQU   RCDRMFGS                                                 01795000
RCDRMACT EQU   RCDRMFGS                                                 01796000
RCDRMSCA EQU   RCDRMFGS                                                 01797000
RCDRMPRI EQU   RCDRMFGS                                                 01798000
RCDRMHST EQU   RCDRMFGS                                                 01799000
RCDRMRP  EQU   ISTRCDRM+204                                             01800000
RCDRMLRP EQU   RCDRMRPQ+4                                               01801000
RCDRMFRP EQU   RCDRMRPQ                                                 01802000
RCDRMARP EQU   ISTRCDRM+192                                             01803000
RCDRMPDT EQU   RCDRMPDN                                                 01804000
RCDRMPR  EQU   ISTRCDRM                                                 01805000
RCDRSEND EQU   ISTRCDRS+168                                             01806000
@NM00144 EQU   ISTRCDRS+167                                             01807000
@NM00143 EQU   @NM00142                                                 01808000
RCDRDYN  EQU   @NM00142                                                 01809000
RCDTKCNT EQU   ISTRCDRS+164                                             01810000
RCDCDRMN EQU   ISTRCDRS+156                                             01811000
RCDRCDRM EQU   ISTRCDRS+148                                             01812000
RCDRSARP EQU   ISTRCDRS+144                                             01813000
RCDRSPR  EQU   ISTRCDRS                                                 01814000
RCLEND   EQU   ISTRCL+100                                               01815000
@NM00141 EQU   ISTRCL+98                                                01816000
RCLCTNGP EQU   ISTRCL+96                                                01817000
RCLCTECM EQU   ISTRCL+94                                                01818000
RCLCTETR EQU   ISTRCL+92                                                01819000
RCLGPOLA EQU   ISTRCL+88                                                01820000
RCLGPADR EQU   RCLADR+1                                                 01821000
@NM00140 EQU   RCLFLAG                                                  01822000
@NM00139 EQU   RCLFLAG                                                  01823000
@NM00138 EQU   RCLFLAG                                                  01824000
@NM00137 EQU   RCLFLAG                                                  01825000
@NM00136 EQU   RCLFLAG                                                  01826000
@NM00135 EQU   RCLFLAG                                                  01827000
@NM00134 EQU   RCLFLAG                                                  01828000
RCLBATCH EQU   RCLFLAG                                                  01829000
RCLPRE   EQU   ISTRCL                                                   01830000
RDAEND   EQU   ISTRDA+136                                               01831000
RDAPRE   EQU   ISTRDA                                                   01832000
RDSEND   EQU   ISTRDS+92                                                01833000
RDSCTATR EQU   ISTRDS+90                                                01834000
RDSCTTRM EQU   ISTRDS+88                                                01835000
RDSADDOT EQU   ISTRDS+84                                                01836000
RDSPRE   EQU   ISTRDS                                                   01837000
RGPEND   EQU   ISTRGP+96                                                01838000
@NM00133 EQU   ISTRGP+95                                                01839000
@NM00132 EQU   RGPBITAN                                                 01840000
@NM00131 EQU   RGPBITAN                                                 01841000
@NM00130 EQU   RGPBITAN                                                 01842000
RGPX21SW EQU   RGPBITAN                                                 01843000
RGPASDLC EQU   RGPBITAN                                                 01844000
RGPABSC  EQU   RGPBITAN                                                 01845000
RGPASS   EQU   RGPBITAN                                                 01846000
RGPADIL  EQU   RGPBITAN                                                 01847000
@NM00129 EQU   ISTRGP+92                                                01848000
@NM00128 EQU   ISTRGP+90                                                01849000
@NM00127 EQU   ISTRGP+88                                                01850000
@NM00126 EQU   ISTRGP+86                                                01851000
@NM00125 EQU   ISTRGP+84                                                01852000
RGPPRE   EQU   ISTRGP                                                   01853000
RINEND   EQU   ISTRIN+152                                               01854000
@NM00124 EQU   ISTRIN+150                                               01855000
@NM00123 EQU   RINFLAGS                                                 01856000
RINCHCON EQU   RINFLAGS                                                 01857000
RINTG    EQU   ISTRIN+148                                               01858000
RINXTRIN EQU   ISTRIN+144                                               01859000
RINNCPPT EQU   ISTRIN+140                                               01860000
RINREAL  EQU   ISTRIN+132                                               01861000
RINDEFTG EQU   ISTRIN+131                                               01862000
RINBCKUP EQU   RINBITAN                                                 01863000
RINCHAN  EQU   RINBITAN                                                 01864000
RINPRSWD EQU   RINBITAN                                                 01865000
RINLOCAL EQU   RINBITAN                                                 01866000
RINPEER  EQU   RINBITAN                                                 01867000
RINLDISC EQU   RINBITAN                                                 01868000
RINNODEF EQU   RINBITAN                                                 01869000
RINREMPO EQU   RINBITAN                                                 01870000
RINCNCNT EQU   ISTRIN+129                                               01871000
RINNODID EQU   ISTRIN+128                                               01872000
RINRLDAF EQU   RINDAFID+2                                               01873000
@NM00122 EQU   RINDAFID                                                 01874000
RINLOCRN EQU   ISTRIN+120                                               01875000
RINCPLVL EQU   ISTRIN+116                                               01876000
RINCTDRU EQU   ISTRIN+112                                               01877000
RINREMOT EQU   ISTRIN+108                                               01878000
RINTRENT EQU   ISTRIN+104                                               01879000
RINCRPRE EQU   ISTRIN                                                   01880000
RLCEND   EQU   ISTRLC+92                                                01881000
@NM00121 EQU   ISTRLC+91                                                01882000
RLCLCCUA EQU   ISTRLC+88                                                01883000
RLCUCBAD EQU   RLCADR+1                                                 01884000
@NM00120 EQU   RLCFLAG                                                  01885000
@NM00119 EQU   RLCFLAG                                                  01886000
@NM00118 EQU   RLCFLAG                                                  01887000
@NM00117 EQU   RLCFLAG                                                  01888000
@NM00116 EQU   RLCFLAG                                                  01889000
@NM00115 EQU   RLCFLAG                                                  01890000
RLCACNT  EQU   RLCFLAG                                                  01891000
RLCALLOC EQU   RLCFLAG                                                  01892000
RLCPRE   EQU   ISTRLC                                                   01893000
RLSEND   EQU   ISTRLS+140                                               01894000
@NM00114 EQU   ISTRLS+138                                               01895000
RLSCTELU EQU   ISTRLS+136                                               01896000
RLSPRE   EQU   ISTRLS                                                   01897000
RLUEND   EQU   ISTRLU+152                                               01898000
RLUSEQNO EQU   ISTRLU+148                                               01899000
@NM00113 EQU   RLUBITAN+1                                               01900000
@NM00112 EQU   RLUBITAN+1                                               01901000
@NM00111 EQU   RLUBITAN+1                                               01902000
@NM00110 EQU   RLUBITAN+1                                               01903000
@NM00109 EQU   RLUBITAN+1                                               01904000
@NM00108 EQU   RLUBITAN+1                                               01905000
@NM00107 EQU   RLUBITAN+1                                               01906000
@NM00106 EQU   RLUBITAN+1                                               01907000
@NM00105 EQU   RLUBITAN                                                 01908000
RLUOSAIP EQU   RLUBITAN                                                 01909000
RLULOCSE EQU   RLUBITAN                                                 01910000
RLUCLNUP EQU   RLUBITAN                                                 01911000
RLUACTLU EQU   RLUBITAN                                                 01912000
RLUCDCTL EQU   RLUBITAN                                                 01913000
RLUNDSES EQU   RLUBITAN                                                 01914000
RLUBATCH EQU   RLUBITAN                                                 01915000
RLULOCAD EQU   ISTRLU+145                                               01916000
RLUTYPE  EQU   ISTRLU+144                                               01917000
RLUCRPR  EQU   ISTRLU                                                   01918000
RLXEND   EQU   ISTRLX+96                                                01919000
@NM00104 EQU   ISTRLX+93                                                01920000
@NM00103 EQU   RLXBITAN                                                 01921000
@NM00102 EQU   RLXBITAN                                                 01922000
@NM00101 EQU   RLXBITAN                                                 01923000
@NM00100 EQU   RLXBITAN                                                 01924000
@NM00099 EQU   RLXBITAN                                                 01925000
@NM00098 EQU   RLXBITAN                                                 01926000
@NM00097 EQU   RLXBITAN                                                 01927000
RLXINUSE EQU   RLXBITAN                                                 01928000
RLXLUPTR EQU   ISTRLX+88                                                01929000
RLXNLUX  EQU   ISTRLX+84                                                01930000
RLXPRE   EQU   ISTRLX                                                   01931000
RPTEND   EQU   ISTRPT+176                                               01932000
RPTCTNM  EQU   ISTRPT+168                                               01933000
@NM00096 EQU   RPTBITAN+1                                               01934000
@NM00095 EQU   RPTBITAN+1                                               01935000
@NM00094 EQU   RPTBITAN+1                                               01936000
@NM00093 EQU   RPTBITAN+1                                               01937000
@NM00092 EQU   RPTBITAN+1                                               01938000
@NM00091 EQU   RPTBITAN+1                                               01939000
@NM00090 EQU   RPTBITAN+1                                               01940000
@NM00089 EQU   RPTBITAN+1                                               01941000
RPTISTAT EQU   RPTBITAN                                                 01942000
RPTDYNAM EQU   RPTBITAN                                                 01943000
RPTVYIMM EQU   RPTBITAN                                                 01944000
RPTVIODN EQU   RPTBITAN                                                 01945000
RPTONLIN EQU   RPTBITAN                                                 01946000
RPTHLVPD EQU   RPTBITAN                                                 01947000
RPTVRYPD EQU   RPTBITAN                                                 01948000
RPTASLEP EQU   RPTBITAN                                                 01949000
RPTDAFSV EQU   ISTRPT+164                                               01950000
RPTPTHCT EQU   ISTRPT+162                                               01951000
RPTPEPCT EQU   ISTRPT+160                                               01952000
RPTNSNSV EQU   ISTRPT+156                                               01953000
RPTUTERM EQU   ISTRPT+152                                               01954000
RPTATERM EQU   ISTRPT+148                                               01955000
RPTDIVT  EQU   RPTDITT                                                  01956000
@NM00088 EQU   RPTXTCID+4                                               01957000
RPTLNDAF EQU   RPTLNCID+2                                               01958000
RPTLNSAF EQU   RPTLNCID                                                 01959000
RPTLN    EQU   ISTRPT                                                   01960000
RPXEND   EQU   ISTRPX+96                                                01961000
@NM00087 EQU   ISTRPX+93                                                01962000
RPXMAXLU EQU   ISTRPX+92                                                01963000
RPXPUPTR EQU   ISTRPX+88                                                01964000
RPXFLUX  EQU   ISTRPX+84                                                01965000
RPXPRE   EQU   ISTRPX                                                   01966000
RRNEND   EQU   ISTRRN+332                                               01967000
RRNLDRID EQU   ISTRRN+324                                               01968000
RRNCLDST EQU   ISTRRN+316                                               01969000
RRNGDSTA EQU   ISTRRN+308                                               01970000
RRNGLSTA EQU   ISTRRN+300                                               01971000
RRNLDCAT EQU   RRNLDFSM                                                 01972000
RRNVRID  EQU   ISTRRN+296                                               01973000
RRNPUXTN EQU   ISTRRN+292                                               01974000
RRNLUCT  EQU   ISTRRN+290                                               01975000
RRNPUCT  EQU   ISTRRN+288                                               01976000
RRNLPPTR EQU   ISTRRN+284                                               01977000
RRNTPPTR EQU   ISTRRN+280                                               01978000
RRNFNAEQ EQU   ISTRRN+276                                               01979000
@NM00086 EQU   ISTRRN+270                                               01980000
RRNMARTY EQU   ISTRRN+268                                               01981000
RRNMATID EQU   ISTRRN+264                                               01982000
@NM00085 EQU   ISTRRN+260                                               01983000
RRNNMNCP EQU   ISTRRN+252                                               01984000
@NM00084 EQU   ISTRRN+251                                               01985000
RRNOLRC  EQU   ISTRRN+250                                               01986000
RRNILRC  EQU   ISTRRN+249                                               01987000
RRNAMNUM EQU   ISTRRN+248                                               01988000
RRNAMLST EQU   ISTRRN+244                                               01989000
RRNCDPWE EQU   ISTRRN+240                                               01990000
RRNPUBI  EQU   RRNNMDPD+6                                               01991000
RRNDPLUB EQU   RRNNMDPD                                                 01992000
RRNINBFR EQU   ISTRRN+231                                               01993000
RRNDEFLV EQU   ISTRRN+230                                               01994000
RRNRNCUA EQU   ISTRRN+227                                               01995000
RRNRDCUA EQU   ISTRRN+224                                               01996000
RRNNCPNM EQU   ISTRRN+217                                               01997000
RRNCTPCC EQU   ISTRRN+216                                               01998000
RRNCPLUB EQU   ISTRRN+210                                               01999000
RRNDELAY EQU   ISTRRN+208                                               02000000
RRNMODL  EQU   RRNLVL+2                                                 02001000
RRNRELL  EQU   RRNLVL                                                   02002000
@NM00083 EQU   RRNBITAN+2                                               02003000
@NM00082 EQU   RRNBITAN+2                                               02004000
RRNAMLDA EQU   RRNBITAN+2                                               02005000
RRNLODNO EQU   RRNBITAN+2                                               02006000
RRNLODYS EQU   RRNBITAN+2                                               02007000
RRNRBMDL EQU   RRNBITAN+2                                               02008000
RRNALLOC EQU   RRNBITAN+2                                               02009000
RRNACQRD EQU   RRNBITAN+2                                               02010000
RRNREMPO EQU   RRNBITAN+1                                               02011000
RRNRBBUP EQU   RRNBITAN+1                                               02012000
RRNRBCT2 EQU   RRNBITAN+1                                               02013000
RRNRBCT1 EQU   RRNBITAN+1                                               02014000
RRNRBSEC EQU   RRNBITAN+1                                               02015000
RRNRBCCT EQU   RRNBITAN+1                                               02016000
RRNRBCCL EQU   RRNBITAN+1                                               02017000
RRNRBREM EQU   RRNBITAN+1                                               02018000
RRNRSYN  EQU   RRNBITAN                                                 02019000
RRNRAPEP EQU   RRNBITAN                                                 02020000
RRNRANCP EQU   RRNBITAN                                                 02021000
RRNRAOLT EQU   RRNBITAN                                                 02022000
RRNRASYN EQU   RRNBITAN                                                 02023000
RRNRADMP EQU   RRNBITAN                                                 02024000
RRNRAIPL EQU   RRNBITAN                                                 02025000
RRNRASHT EQU   RRNBITAN                                                 02026000
RRNHSTID EQU   ISTRRN+200                                               02027000
RRNHBUFS EQU   ISTRRN+198                                               02028000
RRNHLENT EQU   RRNHPRE+1                                                02029000
RRNHLENH EQU   RRNHPRE                                                  02030000
RRNNODCT EQU   ISTRRN+194                                               02031000
RRNEPADR EQU   ISTRRN+192                                               02032000
RRNCTENT EQU   ISTRRN+190                                               02033000
RRNCTECM EQU   ISTRRN+188                                               02034000
RRNCTEIN EQU   ISTRRN+186                                               02035000
RRNCTETR EQU   ISTRRN+184                                               02036000
RRNCTECL EQU   ISTRRN+182                                               02037000
RRNCTELI EQU   ISTRRN+180                                               02038000
RRNCTEGP EQU   ISTRRN+178                                               02039000
RRNCTBHS EQU   ISTRRN+176                                               02040000
RRNTABCT EQU   ISTRRN+172                                               02041000
RRNLASTE EQU   ISTRRN+168                                               02042000
RRNNCSPL EQU   ISTRRN+164                                               02043000
RRNRPLPT EQU   ISTRRN+160                                               02044000
RRNMSIZE EQU   ISTRRN+156                                               02045000
RRNFLUX  EQU   ISTRRN+152                                               02046000
RRNBHSET EQU   ISTRRN+148                                               02047000
RRNRINQP EQU   ISTRRN+144                                               02048000
RRNGRPA  EQU   ISTRRN+140                                               02049000
RRNLUBA  EQU   RRNUCBAD+1                                               02050000
RRNCHQI  EQU   RRNUCBAD                                                 02051000
RRNRNAME EQU   RRNFLAG                                                  02052000
RRNACBAQ EQU   RRNFLAG                                                  02053000
RRNCHCON EQU   RRNFLAG                                                  02054000
RRNVFYLM EQU   RRNFLAG                                                  02055000
RRNLDET  EQU   RRNFLAG                                                  02056000
RRNRIMIP EQU   RRNFLAG                                                  02057000
RRNLCDIE EQU   RRNFLAG                                                  02058000
RRNLCSIP EQU   RRNFLAG                                                  02059000
RRNPRE   EQU   ISTRRN                                                   02060000
RSWEND   EQU   ISTRSW+152                                               02061000
@NM00081 EQU   ISTRSW+150                                               02062000
RSWCTELU EQU   ISTRSW+148                                               02063000
RSWGRUPZ EQU   ISTRSW+146                                               02064000
RSWDIALZ EQU   ISTRSW+144                                               02065000
RSWGRUPT EQU   ISTRSW+140                                               02066000
RSWDIALT EQU   ISTRSW+136                                               02067000
RSWPRE   EQU   ISTRSW                                                   02068000
RTREND   EQU   ISTRTR+208                                               02069000
RTRCADDR EQU   ISTRTR+200                                               02070000
RTRBHSN1 EQU   ISTRTR+192                                               02071000
RTRIDCAS EQU   RTRBSCID+1                                               02072000
RTRIDLEN EQU   RTRBSCID                                                 02073000
RTRLCTI  EQU   ISTRTR+170                                               02074000
RTRTRMAX EQU   ISTRTR+169                                               02075000
@NM00080 EQU   RTRBITAN+4                                               02076000
@NM00079 EQU   RTRBITAN+4                                               02077000
@NM00078 EQU   RTRBITAN+4                                               02078000
@NM00077 EQU   RTRBITAN+4                                               02079000
@NM00076 EQU   RTRBITAN+4                                               02080000
@NM00075 EQU   RTRBITAN+4                                               02081000
@NM00074 EQU   RTRBITAN+4                                               02082000
@NM00073 EQU   RTRBITAN+4                                               02083000
@NM00072 EQU   RTRBITAN+3                                               02084000
RTRDTRLM EQU   RTRBITAN+3                                               02085000
RTRRAATN EQU   RTRBITAN+3                                               02086000
RTRLSCMD EQU   RTRBITAN+3                                               02087000
RTRRFDEK EQU   RTRBITAN+3                                               02088000
RTRRFANK EQU   RTRBITAN+3                                               02089000
RTRRFPFK EQU   RTRBITAN+3                                               02090000
RTRRFPEN EQU   RTRBITAN+3                                               02091000
RTRRFXCT EQU   RTRBITAN+2                                               02092000
RTRRESCT EQU   RTRBITAN+2                                               02093000
RTRRESUP EQU   RTRBITAN+2                                               02094000
RTRREATT EQU   RTRBITAN+2                                               02095000
RTRRECHK EQU   RTRBITAN+2                                               02096000
RTRREACR EQU   RTRBITAN+2                                               02097000
@NM00071 EQU   RTRBITAN+2                                               02098000
RTRREBRK EQU   RTRBITAN+2                                               02099000
RTRRDBHI EQU   RTRBITAN+1                                               02100000
RTRRDBHD EQU   RTRBITAN+1                                               02101000
RTRRDBHN EQU   RTRBITAN+1                                               02102000
RTRRCXMS EQU   RTRBITAN+1                                               02103000
RTRRCMSG EQU   RTRBITAN+1                                               02104000
RTRRCBLK EQU   RTRBITAN+1                                               02105000
RTRRCPT3 EQU   RTRBITAN+1                                               02106000
RTRRCIT2 EQU   RTRBITAN+1                                               02107000
RTRRCIT1 EQU   RTRBITAN                                                 02108000
RTRRBEND EQU   RTRBITAN                                                 02109000
RTRRBECT EQU   RTRBITAN                                                 02110000
RTRRACTR EQU   RTRBITAN                                                 02111000
RTRRACDT EQU   RTRBITAN                                                 02112000
RTRRAPT3 EQU   RTRRAALL                                                 02113000
RTRRAPT2 EQU   RTRRAALL                                                 02114000
RTRRAPT1 EQU   RTRRAALL                                                 02115000
RTRCTADR EQU   ISTRTR+162                                               02116000
RTRCTPOL EQU   ISTRTR+160                                               02117000
RTRCTDIA EQU   ISTRTR+158                                               02118000
RTRCTECM EQU   ISTRTR+156                                               02119000
RTRDIAA  EQU   ISTRTR+152                                               02120000
RTRPOLA  EQU   ISTRTR+148                                               02121000
RTRADRPT EQU   RTRADR+1                                                 02122000
@NM00070 EQU   RTRFLAG                                                  02123000
@NM00069 EQU   RTRFLAG                                                  02124000
@NM00068 EQU   RTRFLAG                                                  02125000
@NM00067 EQU   RTRFLAG                                                  02126000
@NM00066 EQU   RTRFLAG                                                  02127000
@NM00065 EQU   RTRFLAG                                                  02128000
@NM00064 EQU   RTRFLAG                                                  02129000
RTRVTERM EQU   RTRFLAG                                                  02130000
RTRCRPR  EQU   ISTRTR                                                   02131000
RAPREND  EQU   ISTRAPRE+144                                             02132000
RAPHPRE  EQU   ISTRAPRE                                                 02133000
RPUEND   EQU   ISTRPU+104                                               02134000
RPUENTAD EQU   ISTRPU+100                                               02135000
RPUIDNUM EQU   RPUID48+3                                                02136000
RPUIDBLK EQU   RPUID48+2                                                02137000
RPUIDPA2 EQU   RPUID48+1                                                02138000
RPUIDPUT EQU   RPUID48                                                  02139000
RPUIDPA1 EQU   RPUSTAID                                                 02140000
RPUPASSL EQU   ISTRPU+91                                                02141000
RPUMXOUT EQU   ISTRPU+90                                                02142000
RPUMXDAT EQU   ISTRPU+88                                                02143000
RPURSV01 EQU   ISTRPU+87                                                02144000
RPURETYM EQU   ISTRPU+86                                                02145000
RPUADDR  EQU   ISTRPU+85                                                02146000
RPUTYPE  EQU   ISTRPU+84                                                02147000
RPUPRE   EQU   ISTRPU                                                   02148000
RLNEND   EQU   ISTRLN+136                                               02149000
RLNTGCS  EQU   ISTRLN+135                                               02150000
RLNCURTR EQU   ISTRLN+134                                               02151000
RLNINBMX EQU   RLNINBFR+1                                               02152000
RLNINBN  EQU   RLNINBFR                                                 02153000
RLNRTYM  EQU   ISTRLN+131                                               02154000
RLNSERVL EQU   ISTRLN+130                                               02155000
RLNREPTO EQU   ISTRLN+129                                               02156000
RLNACTTO EQU   ISTRLN+128                                               02157000
RLNCTPCC EQU   ISTRLN+127                                               02158000
RLNPUBI  EQU   ISTRLN+126                                               02159000
RLNDCUA  EQU   ISTRLN+123                                               02160000
RLNCUA   EQU   ISTRLN+120                                               02161000
RLNPAUSE EQU   ISTRLN+119                                               02162000
RLNPOLMT EQU   ISTRLN+118                                               02163000
RLNCTSES EQU   ISTRLN+117                                               02164000
@NM00063 EQU   ISTRLN+116                                               02165000
@NM00062 EQU   RLNBITAN+3                                               02166000
@NM00061 EQU   RLNBITAN+3                                               02167000
RLNSWEP  EQU   RLNBITAN+3                                               02168000
RLNSVSKP EQU   RLNLSCMD                                                 02169000
RLNSESLM EQU   RLNLSCMD                                                 02170000
RLNNPRLM EQU   RLNLSCMD                                                 02171000
RLNSWNCP EQU   RLNBITAN+3                                               02172000
RLNACTLN EQU   RLNBITAN+2                                               02173000
@NM00060 EQU   RLNBITAN+2                                               02174000
@NM00059 EQU   RLNBITAN+2                                               02175000
@NM00058 EQU   RLNBITAN+2                                               02176000
@NM00057 EQU   RLNBITAN+2                                               02177000
RLNDCALL EQU   RLNCONCT                                                 02178000
RLNAUTO  EQU   RLNCONCT                                                 02179000
RLNMANUL EQU   RLNCONCT                                                 02180000
@NM00056 EQU   RLNBITAN+1                                               02181000
RLNWANSW EQU   RLNBITAN+1                                               02182000
RLNINUSE EQU   RLNBITAN+1                                               02183000
RLNMULTP EQU   RLNBITAN+1                                               02184000
RLNIDV   EQU   RLNBITAN+1                                               02185000
RLNTTV   EQU   RLNBITAN+1                                               02186000
@NM00055 EQU   RLNBITAN+1                                               02187000
RLNRBUSE EQU   RLNBITAN+1                                               02188000
RLNRAPEP EQU   RLNBITAN                                                 02189000
RLNRANCP EQU   RLNBITAN                                                 02190000
RLNRAEP  EQU   RLNBITAN                                                 02191000
RLNRAPOL EQU   RLNBITAN                                                 02192000
RLNRATRN EQU   RLNBITAN                                                 02193000
RLNGANSW EQU   RLNBITAN                                                 02194000
RLNRACAN EQU   RLNRACNT                                                 02195000
RLNRACAT EQU   RLNRACNT                                                 02196000
@NM00054 EQU   ISTRLN+111                                               02197000
RLNMAXLA EQU   ISTRLN+110                                               02198000
RLNDESAM EQU   ISTRLN+109                                               02199000
RLNCURAM EQU   ISTRLN+108                                               02200000
RLNACTSN EQU   RLNCSLRC+2                                               02201000
RLNACTRM EQU   RLNCSLRC+1                                               02202000
RLNLRC   EQU   RLNCSLRC                                                 02203000
RLNAUTOA EQU   ISTRLN+102                                               02204000
RLNACTCT EQU   ISTRLN+100                                               02205000
RLNCTECM EQU   ISTRLN+98                                                02206000
RLNCTEIN EQU   ISTRLN+96                                                02207000
RLNCTETR EQU   ISTRLN+94                                                02208000
RLNCTECL EQU   ISTRLN+92                                                02209000
RLNENTAD EQU   ISTRLN+88                                                02210000
RLNLUBA  EQU   RLNUCBAD+1                                               02211000
RLNCHQI  EQU   RLNUCBAD                                                 02212000
@NM00053 EQU   RLNFLAG                                                  02213000
@NM00052 EQU   RLNFLAG                                                  02214000
RLNIDACT EQU   RLNFLAG                                                  02215000
RLNCHAN  EQU   RLNFLAG                                                  02216000
RLNACLNK EQU   RLNFLAG                                                  02217000
RLNBKDUP EQU   RLNFLAG                                                  02218000
RLNBCKUP EQU   RLNFLAG                                                  02219000
RLNCDLNK EQU   RLNFLAG                                                  02220000
RLNPRE   EQU   ISTRLN                                                   02221000
RDTEND   EQU   ISTRDT+136                                               02222000
RDTVSRPL EQU   RDTCRIA+16                                               02223000
RDTCRSPW EQU   RDTCRIA+8                                                02224000
RDTCRSDS EQU   RDTCRIA                                                  02225000
@NM00051 EQU   ISTRDT+114                                               02226000
@NM00050 EQU   RDTBITAN                                                 02227000
@NM00049 EQU   RDTBITAN                                                 02228000
@NM00048 EQU   RDTBITAN                                                 02229000
RDTSSFLG EQU   RDTBITAN                                                 02230000
RDTHCDRM EQU   RDTBITAN                                                 02231000
RDTBHSET EQU   RDTBITAN                                                 02232000
RDTCDCTL EQU   RDTBITAN                                                 02233000
RDTCTPGD EQU   RDTBITAN                                                 02234000
RDTLGCT  EQU   ISTRDT+112                                               02235000
RDTNODID EQU   ISTRDT+111                                               02236000
RDTMAXID EQU   ISTRDT+110                                               02237000
@NM00047 EQU   ISTRDT+108                                               02238000
RDTVYRPH EQU   ISTRDT+104                                               02239000
RDTBACK  EQU   ISTRDT+100                                               02240000
RDTFORW  EQU   ISTRDT+96                                                02241000
RDTNAMTB EQU   ISTRDT+92                                                02242000
RDTENTAD EQU   ISTRDT+88                                                02243000
RDTLEN   EQU   RDTPLEN+1                                                02244000
RDTPRICA EQU   RDTPRIOR                                                 02245000
RDTPRILS EQU   RDTPRIOR                                                 02246000
RDTPRISW EQU   RDTPRIOR                                                 02247000
RDTPRIRN EQU   RDTPRIOR                                                 02248000
RDTPRILC EQU   RDTPRIOR                                                 02249000
RDTPRIAP EQU   RDTPRIOR                                                 02250000
RDTCDRSC EQU   RDTPRIOR                                                 02251000
RDTCDRM  EQU   RDTPRIOR                                                 02252000
RDTPRE   EQU   ISTRDT                                                   02253000
RAPEND   EQU   ISTRAP+188                                               02254000
RAPMAXPV EQU   ISTRAP+184                                               02255000
RAPAPPWD EQU   ISTRAP+176                                               02256000
RAPACBN  EQU   ISTRAP+168                                               02257000
@NM00046 EQU   RAPBITAN+2                                               02258000
@NM00045 EQU   RAPBITAN+2                                               02259000
RAPSRTLN EQU   RAPBITAN+2                                               02260000
RAPSONSC EQU   RAPBITAN+2                                               02261000
RAPVFRR  EQU   RAPBITAN+2                                               02262000
RAPSRBX  EQU   RAPBITAN+2                                               02263000
@NM00044 EQU   RAPBITAN+2                                               02264000
RAPCSMA  EQU   RAPBITAN+2                                               02265000
RAPTSO   EQU   RAPBITAN+1                                               02266000
RAPAUTHE EQU   RAPBITAN+1                                               02267000
RAPANVPC EQU   RAPBITAN+1                                               02268000
RAPASPO  EQU   RAPBITAN+1                                               02269000
RAPAPPO  EQU   RAPBITAN+1                                               02270000
RAPAACQ  EQU   RAPBITAN+1                                               02271000
RAPAPRMT EQU   RAPBITAN+1                                               02272000
RAPAPASS EQU   RAPBITAN+1                                               02273000
RAPABLCK EQU   RAPBITAN                                                 02274000
RAPALLF  EQU   RAPBITAN                                                 02275000
RAPPARS  EQU   RAPBITAN                                                 02276000
RAPLSIZ  EQU   RAPBITAN                                                 02277000
RAPATLGN EQU   RAPBITAN                                                 02278000
RAPASLGI EQU   RAPBITAN                                                 02279000
RAPAQUI  EQU   RAPBITAN                                                 02280000
RAPABLGN EQU   RAPBITAN                                                 02281000
RAPBFACT EQU   ISTRAP+164                                               02282000
RAPBNA   EQU   ISTRAP+162                                               02283000
RAPEAS   EQU   ISTRAP+160                                               02284000
RAPACDEB EQU   ISTRAP+156                                               02285000
RAPACBA  EQU   ISTRAP+152                                               02286000
RAPENTAD EQU   ISTRAP+148                                               02287000
@NM00043 EQU   ISTRAP+146                                               02288000
RAPTRPRE EQU   ISTRAP+144                                               02289000
RAPPRE   EQU   ISTRAP                                                   02290000
RCPEND   EQU   ISTRCPRE+144                                             02291000
RCPLGMOD EQU   ISTRCPRE+136                                             02292000
RCPDLGMD EQU   ISTRCPRE+128                                             02293000
RCPLGNAP EQU   ISTRCPRE+120                                             02294000
RCPQCNT  EQU   ISTRCPRE+118                                             02295000
@NM00042 EQU   ISTRCPRE+117                                             02296000
RCPOSAIP EQU   RCPBITAN                                                 02297000
RCPVLMSG EQU   RCPBITAN                                                 02298000
RCPCSM   EQU   RCPBITAN                                                 02299000
RCPALLOC EQU   RCPBITAN                                                 02300000
RCPSEC   EQU   RCPBITAN                                                 02301000
RCPSESSC EQU   RCPSESSM                                                 02302000
RCPSESPR EQU   RCPSESSM                                                 02303000
RCPSSCFM EQU   ISTRCPRE+114                                             02304000
RCPSTCAP EQU   RCPCYSET                                                 02305000
RCPSTRQD EQU   RCPCYSET                                                 02306000
RCPMDCAP EQU   RCPCYMOD                                                 02307000
RCPMDRQD EQU   RCPCYMOD                                                 02308000
RCPPRIM  EQU   RCPPMODE                                                 02309000
RCPCROSS EQU   RCPPMODE                                                 02310000
RCPRRECD EQU   RCPPMODE                                                 02311000
RCPRBASC EQU   RCPPMODE                                                 02312000
RCPBFLIM EQU   ISTRCPRE+112                                             02313000
RCPNCPPM EQU   RCPNCPPC+1                                               02314000
RCPNCPPN EQU   RCPNCPPC                                                 02315000
RCPPACEM EQU   RCPPACE+1                                                02316000
RCPPACEN EQU   RCPPACE                                                  02317000
RCPBHSI2 EQU   ISTRCPRE+107                                             02318000
RCPBHSI1 EQU   ISTRCPRE+106                                             02319000
RCPSESLM EQU   ISTRCPRE+104                                             02320000
RCPSESCT EQU   ISTRCPRE+102                                             02321000
RCPINTTI EQU   ISTRCPRE+100                                             02322000
RCPUSSTI EQU   ISTRCPRE+98                                              02323000
RCPMODTI EQU   ISTRCPRE+96                                              02324000
RCPLNAPA EQU   ISTRCPRE+92                                              02325000
RCPSIBS  EQU   RCPSARRY+4                                               02326000
RCPSIBP  EQU   RCPSARRY                                                 02327000
RCPPRE   EQU   ISTRCPRE                                                 02328000
RPREND   EQU   ISTRPRE+84                                               02329000
RPRDEVCH EQU   ISTRPRE+76                                               02330000
RPRCONID EQU   ISTRPRE+67                                               02331000
@NM00041 EQU   RPRFLAGS                                                 02332000
RPRDYNAM EQU   RPRFLAGS                                                 02333000
RPRNOACT EQU   RPRFLAGS                                                 02334000
RPRDAFAD EQU   RPRBITAN+4                                               02335000
RPRENTVA EQU   RPRBITAN+4                                               02336000
RPRDUMMY EQU   RPRBITAN+4                                               02337000
RPRIMPCH EQU   RPRBITAN+4                                               02338000
RPRIMPAC EQU   RPRBITAN+4                                               02339000
RPRNEO   EQU   RPRBITAN+4                                               02340000
RPRRNAA  EQU   RPRBITAN+4                                               02341000
RPRDRADD EQU   RPRBITAN+4                                               02342000
RPRFADD  EQU   RPRBITAN+3                                               02343000
RPRINTST EQU   RPRBITAN+3                                               02344000
RPRCLVPD EQU   RPRBITAN+3                                               02345000
RPRSHAD  EQU   RPRBITAN+3                                               02346000
RPRGIST  EQU   RPRBITAN+3                                               02347000
RPRRBISA EQU   RPRBITAN+3                                               02348000
RPRENTVT EQU   RPRBITAN+3                                               02349000
RPRDINOP EQU   RPRBITAN+3                                               02350000
RPRDINUS EQU   RPRBITAN+2                                               02351000
RPRCRCPT EQU   RPRBITAN+2                                               02352000
RPRNOSRT EQU   RPRBITAN+2                                               02353000
RPRDOM   EQU   RPRBITAN+2                                               02354000
RPRNOUSE EQU   RPRBITAN+2                                               02355000
RPRNOSNA EQU   RPRBITAN+2                                               02356000
RPRCLNUP EQU   RPRBITAN+2                                               02357000
RPRCONLD EQU   RPRBITAN+2                                               02358000
RPRCONP  EQU   RPRBITAN+1                                               02359000
RPRACTP  EQU   RPRBITAN+1                                               02360000
RPRINTIO EQU   RPRBITAN+1                                               02361000
RPRCONCT EQU   RPRBITAN+1                                               02362000
RPRHLVPD EQU   RPRBITAN+1                                               02363000
RPRHLACT EQU   RPRBITAN+1                                               02364000
RPRONLIN EQU   RPRBITAN+1                                               02365000
RPRRINOP EQU   RPRBITAN+1                                               02366000
RPRAOPN  EQU   RPRBITAN                                                 02367000
RPRENTVH EQU   RPRBITAN                                                 02368000
RPRLIVE  EQU   RPRBITAN                                                 02369000
RPRENTED EQU   RPRBITAN                                                 02370000
RPRLTASN EQU   RPRBITAN                                                 02371000
RPRENTIO EQU   RPRBITAN                                                 02372000
RPRENTBF EQU   RPRBITAN                                                 02373000
RPRINV   EQU   RPRBITAN                                                 02374000
RPRDEFLV EQU   RPRSTATE+4                                               02375000
RPRDESS1 EQU   RPRDESST                                                 02376000
RPRCURS1 EQU   RPRCURST                                                 02377000
RPRCMDWE EQU   ISTRPRE+52                                               02378000
RPRTNTQP EQU   ISTRPRE+48                                               02379000
RPRPELEN EQU   ISTRPRE+36                                               02380000
RPRELEN  EQU   ISTRPRE+32                                               02381000
RPRALPAD EQU   ISTRPRE+28                                               02382000
RPRENTAD EQU   ISTRPRE+24                                               02383000
RPRREQCT EQU   ISTRPRE+22                                               02384000
RPRINDEX EQU   ISTRPRE+20                                               02385000
RPRDAF   EQU   RPRDAFID+2                                               02386000
@NM00040 EQU   RPRDAFID                                                 02387000
@NM00039 EQU   ISTRPRE+15                                               02388000
RPRHDTYP EQU   ISTRPRE+14                                               02389000
RPRENTRY EQU   ISTRPRE+13                                               02390000
RPRNAME  EQU   RPRSRTHD                                                 02391000
LOKXCL   EQU   @NM00037                                                 02392000
LOKPRY   EQU   @NM00037                                                 02393000
@NM00038 EQU   @NM00037                                                 02394000
@NM00036 EQU   LOKCHNG                                                  02395000
LOKCT    EQU   ISTLOK                                                   02396000
DEVRSV01 EQU   ISTDEVCH+7                                               02397000
DEVAUXTP EQU   ISTDEVCH+6                                               02398000
DEVADVFE EQU   DEVMODE                                                  02399000
@NM00035 EQU   DEVMODE                                                  02400000
DEVBASIC EQU   DEVMODE                                                  02401000
DEVREC   EQU   DEVMODE                                                  02402000
DEVPHYSA EQU   ISTDEVCH+4                                               02403000
DEVCSLPN EQU   DEVCHAR3                                                 02404000
DEVCSTCL EQU   DEVCHAR3                                                 02405000
DEVCCHEK EQU   DEVCHAR3                                                 02406000
DEVCATTN EQU   DEVCHAR3                                                 02407000
DEVCSWL  EQU   DEVFCCTL                                                 02408000
DEVCRVB  EQU   DEVFCCTL                                                 02409000
DEVCSSL  EQU   DEVFCCTL                                                 02410000
DEVCBSC  EQU   DEVFCCTL                                                 02411000
DEVMCODE EQU   ISTDEVCH+2                                               02412000
DEVCHAR2 EQU   DEVTCODE                                                 02413000
DEVSPOLL EQU   DEVCHAR                                                  02414000
DEVCCTL  EQU   DEVCHAR                                                  02415000
DEVNNSPT EQU   DEVCHAR                                                  02416000
DEVSPS   EQU   DEVCHAR                                                  02417000
DEVSUBND EQU   DEVCHAR                                                  02418000
DEVCONVR EQU   DEVCHAR                                                  02419000
DEVOTPUT EQU   DEVCHAR                                                  02420000
DEVINPUT EQU   DEVCHAR                                                  02421000
SRTTYPE  EQU   ISTSRT+12                                                02422000
SRTSPECE EQU   SRTSRTE                                                  02423000
SRTSYMNM EQU   ISTSRT                                                   02424000
NCSRUITS EQU   NCSUSSRU+2                                               02425000
NCSRULEN EQU   NCSUSSRU                                                 02426000
NCSAPPAB EQU   NCSAPP+608                                               02427000
NCSAPDAT EQU   NCSAPBUE+8                                               02428000
NCSAPRU  EQU   NCSAPBUE+3                                               02429000
NCSAPLEN EQU   NCSAPBUE+1                                               02430000
NCSRSV04 EQU   NCSAPBUE                                                 02431000
NCSAPEND EQU   NCSAPP+84                                                02432000
NCSAPTXT EQU   NCSAPP+76                                                02433000
NCSAPECB EQU   NCSAPP+72                                                02434000
NCSAPSA  EQU   NCSAPP                                                   02435000
NCSITSIZ EQU   NCSPLITF+2                                               02436000
@NM00029 EQU   NCSITFL1+1                                               02437000
NCSITCIO EQU   NCSITFL1                                                 02438000
NCSITSCP EQU   NCSITFL1                                                 02439000
NCSITMSG EQU   NCSITFL1                                                 02440000
NCSITPIU EQU   NCSITFL1                                                 02441000
NCSITSMS EQU   NCSITFL1                                                 02442000
NCSITPSS EQU   NCSITFL1                                                 02443000
NCSITLCK EQU   NCSITFL1                                                 02444000
NCSITAPI EQU   NCSITFL1                                                 02445000
NCSLDDCB EQU   ISTNCSPL+352                                             02446000
NCSLDPUB EQU   ISTNCSPL+351                                             02447000
NCSLDLUB EQU   ISTNCSPL+349                                             02448000
@NM00028 EQU   NCSNCPDF+6                                               02449000
NCSNCPDL EQU   NCSNCPDF                                                 02450000
@NM00027 EQU   NCSNCPLF+6                                               02451000
NCSNCPLL EQU   NCSNCPLF                                                 02452000
NCSNCPLM EQU   ISTNCSPL+325                                             02453000
NCSNCPNM EQU   ISTNCSPL+317                                             02454000
NCSPLITU EQU   NCSPLFL6                                                 02455000
NCSNCPIT EQU   NCSPLFL6                                                 02456000
NCSCTP23 EQU   NCSPLFL6                                                 02457000
NCSNCPCA EQU   NCSPLFL6                                                 02458000
NCSCDLIN EQU   NCSPLFL6                                                 02459000
NCSHALT  EQU   NCSPLFL6                                                 02460000
NCSLODYS EQU   NCSPLFL6                                                 02461000
NCSLODNO EQU   NCSPLFL6                                                 02462000
NCSDPSTA EQU   ISTNCSPL+308                                             02463000
NCSLDSTA EQU   ISTNCSPL+300                                             02464000
NCSDRDS  EQU   ISTNCSPL+292                                             02465000
NCSRNMLT EQU   ISTNCSPL+288                                             02466000
NCSRNMCT EQU   ISTNCSPL+287                                             02467000
NCSRSVD2 EQU   NCSCRMOD                                                 02468000
NCSPTMOD EQU   NCSCRMOD                                                 02469000
NCSAIMOD EQU   NCSCRMOD                                                 02470000
NCSRSVD1 EQU   NCSCHKPT+1                                               02471000
NCSCKCRY EQU   NCSCHKPT+1                                               02472000
NCSCKRIN EQU   NCSCHKPT+1                                               02473000
NCSPTUSE EQU   NCSCHKPT+1                                               02474000
NCSRNME  EQU   NCSCHKPT+1                                               02475000
NCSCUA   EQU   NCSCHKPT+1                                               02476000
NCSANSMD EQU   NCSCHKPT+1                                               02477000
NCSLGMOD EQU   NCSCHKPT                                                 02478000
NCSLGAPL EQU   NCSCHKPT                                                 02479000
NCSDTRLM EQU   NCSCHKPT                                                 02480000
NCSESLM  EQU   NCSCHKPT                                                 02481000
NCSNRPL  EQU   NCSCHKPT                                                 02482000
NCSPOLD  EQU   NCSCHKPT                                                 02483000
NCSPACTV EQU   NCSCHKPT                                                 02484000
NCSACTV  EQU   NCSCHKPT                                                 02485000
NCSPLRTY EQU   ISTNCSPL+283                                             02486000
NCSPLRH  EQU   ISTNCSPL+280                                             02487000
NCSUFMCB EQU   ISTNCSPL+276                                             02488000
NCSMGLPT EQU   NCSPLREP+4                                               02489000
NCSCPWPT EQU   NCSPLREP                                                 02490000
NCSSENS2 EQU   NCSSENSE+2                                               02491000
NCSSNS2  EQU   NCSSENSE+1                                               02492000
NCSSNS1  EQU   NCSSENSE                                                 02493000
NCSPLNSN EQU   ISTNCSPL+260                                             02494000
NCSPLMID EQU   ISTNCSPL+252                                             02495000
NCSPLPID EQU   ISTNCSPL+251                                             02496000
NCSPLGID EQU   ISTNCSPL+250                                             02497000
NCSPLSQN EQU   ISTNCSPL+248                                             02498000
NCSCDRMO EQU   ISTNCSPL+240                                             02499000
NCSLDRID EQU   ISTNCSPL+232                                             02500000
NCSPLRUI EQU   ISTNCSPL+224                                             02501000
NCSPLRUO EQU   ISTNCSPL+220                                             02502000
NCSPLRRP EQU   ISTNCSPL+216                                             02503000
NCSCRWKA EQU   ISTNCSPL+212                                             02504000
NCSPLSPL EQU   ISTNCSPL+208                                             02505000
NCSPLOLN EQU   ISTNCSPL+206                                             02506000
NCSPLHIS EQU   NCSPLFL5                                                 02507000
NCSCDLRA EQU   NCSPLFL5                                                 02508000
NCSINACT EQU   NCSPLFL5                                                 02509000
NCSERP2N EQU   NCSPLFL5                                                 02510000
NCSSKPSC EQU   NCSPLFL5                                                 02511000
NCSFORCE EQU   NCSPLFL5                                                 02512000
NCSSDLK  EQU   NCSPLFL5                                                 02513000
NCSSCPPS EQU   NCSPLFL5                                                 02514000
NCSDLRSN EQU   ISTNCSPL+204                                             02515000
NCSPL2AP EQU   NCSPLFL4                                                 02516000
NCSDSPN  EQU   NCSPLFL4                                                 02517000
NCSDSPI  EQU   NCSPLFL4                                                 02518000
NCSDSPA  EQU   NCSPLFL4                                                 02519000
NCSDSPE  EQU   NCSPLFL4                                                 02520000
NCSPLVID EQU   NCSPLFL4                                                 02521000
NCSPLRSO EQU   NCSPLFL4                                                 02522000
NCSDLNID EQU   NCSPLFL4                                                 02523000
NCSEND   EQU   NCSPLFL3                                                 02524000
NCSFINAL EQU   NCSPLFL3                                                 02525000
NCSANS   EQU   NCSPLFL3                                                 02526000
NCSPID   EQU   NCSPLFL3                                                 02527000
NCSGID   EQU   NCSPLFL3                                                 02528000
NCSPLANS EQU   NCSPLFL3                                                 02529000
NCSEPP   EQU   NCSPLFL3                                                 02530000
NCSPLMOM EQU   NCSPLFL3                                                 02531000
NCSPLVIT EQU   NCSPLFL2                                                 02532000
NCSPLVIS EQU   NCSPLFL2                                                 02533000
NCSREMPO EQU   NCSPLFL2                                                 02534000
NCSPLDS  EQU   NCSPLFL2                                                 02535000
NCSOUFMC EQU   NCSPLFL2                                                 02536000
NCSPLRIO EQU   NCSPLFL2                                                 02537000
NCSPLRSF EQU   NCSPLFL2                                                 02538000
NCSPLVDP EQU   NCSPLFL2                                                 02539000
NCSPLPOS EQU   NCSPLFL1                                                 02540000
NCSPL2CN EQU   NCSPLFL1                                                 02541000
NCSPLAPU EQU   NCSPLFL1                                                 02542000
NCSMSG   EQU   NCSPLFL1                                                 02543000
NCSPLSMN EQU   NCSPLFL1                                                 02544000
NCSPLEBN EQU   NCSPLFL1                                                 02545000
NCSPLSOM EQU   NCSPLFL1                                                 02546000
NCSPL2IN EQU   NCSPLFL1                                                 02547000
NCSPLECB EQU   ISTNCSPL+192                                             02548000
NCSPLCVT EQU   ISTNCSPL+184                                             02549000
NCSPLWKA EQU   ISTNCSPL+180                                             02550000
NCSPLDAF EQU   NCSPLCID+2                                               02551000
NCSPLSAF EQU   NCSPLCID                                                 02552000
NCSPLRAD EQU   ISTNCSPL+172                                             02553000
NCSPLWRF EQU   ISTNCSPL+100                                             02554000
NCSPLWRE EQU   ISTNCSPL+96                                              02555000
NCSSTCMD EQU   NCSCRFLG                                                 02556000
NCSUSRNF EQU   NCSCRFLG                                                 02557000
NCSOPRQU EQU   NCSCRFLG                                                 02558000
NCSCRDSE EQU   NCSCRFLG                                                 02559000
NCSFMERP EQU   NCSCRFLG                                                 02560000
NCSFMCLD EQU   NCSCRFLG                                                 02561000
NCSPLCLD EQU   NCSCRFLG                                                 02562000
NCSPLWRM EQU   NCSCRFLG                                                 02563000
NCSPLUAD EQU   ISTNCSPL+92                                              02564000
NCSMSGSP EQU   ISTNCSPL+91                                              02565000
@NM00026 EQU   NCSITFL2                                                 02566000
NCSITEND EQU   NCSITFL2                                                 02567000
NCSITEXT EQU   NCSITFL2                                                 02568000
NCSITINT EQU   NCSITFL2                                                 02569000
NCSCMDB  EQU   NCSPLCMD+1                                               02570000
@NM00025 EQU   NCSCMDA                                                  02571000
NCSPLINT EQU   NCSCMDA                                                  02572000
NCSPLUFM EQU   NCSCMDA                                                  02573000
NCSPLFLO EQU   NCSCMDA                                                  02574000
NCSPLSYN EQU   NCSCMDA                                                  02575000
NCSPLCTL EQU   NCSCMDA                                                  02576000
NCSPLSYS EQU   NCSCMDA                                                  02577000
NCSPLLPT EQU   ISTNCSPL+84                                              02578000
@NM00024 EQU   NCSTROPT                                                 02579000
NCSTVOPT EQU   NCSTROPT                                                 02580000
NCSCMDNT EQU   ISTNCSPL+78                                              02581000
NCSNCPEP EQU   ISTNCSPL+77                                              02582000
NCSCRPID EQU   ISTNCSPL+76                                              02583000
NCSCRCMD EQU   ISTNCSPL+75                                              02584000
NCSDLID  EQU   ISTNCSPL+69                                              02585000
NCSDEST  EQU   NCSCDRMN+4                                               02586000
NCSADJ   EQU   NCSCDRMN                                                 02587000
NCSPLRID EQU   ISTNCSPL+53                                              02588000
NCSRRNPT EQU   ISTNCSPL+49                                              02589000
NCSDRFLG EQU   ISTNCSPL+48                                              02590000
NCSPRMRC EQU   ISTNCSPL+47                                              02591000
NCSSCOPE EQU   ISTNCSPL+46                                              02592000
NCSPLREL EQU   NCSPLVFL                                                 02593000
NCSDCTCT EQU   NCSPLVFL                                                 02594000
NCSDACLK EQU   NCSPLVFL                                                 02595000
NCSABCON EQU   NCSPLVFL                                                 02596000
NCSDCONT EQU   NCSPLVFL                                                 02597000
NCSPLACQ EQU   NCSPLVFL                                                 02598000
NCSVDEL  EQU   NCSPLVFL                                                 02599000
NCSVNCSA EQU   NCSPLVFL                                                 02600000
@NM00023 EQU   NCSCRRTN                                                 02601000
NCSMDRQD EQU   NCSCRRTN                                                 02602000
NCSPLPDB EQU   NCSPLSID+5                                               02603000
NCSPLNID EQU   NCSPLPHD                                                 02604000
NCSPLPO  EQU   NCSPLSTA                                                 02605000
NCSFSCON EQU   NCSPLSTA                                                 02606000
NCSRSVD4 EQU   NCSPLSTA                                                 02607000
@NM00022 EQU   NCSPFX+33                                                02608000
@NM00021 EQU   NCSPFX+24                                                02609000
@NM00020 EQU   NCSPFX+20                                                02610000
NCSVBF16 EQU   NCSPLVBF+1                                               02611000
NCSVBF15 EQU   NCSPLVBF+1                                               02612000
NCSVBF14 EQU   NCSPLVBF+1                                               02613000
NCSVBF13 EQU   NCSPLVBF+1                                               02614000
NCSVBF12 EQU   NCSPLVBF+1                                               02615000
NCSVBF11 EQU   NCSPLVBF+1                                               02616000
NCSVBF10 EQU   NCSPLVBF+1                                               02617000
NCSVBF09 EQU   NCSPLVBF+1                                               02618000
NCSVBF08 EQU   NCSPLVBF                                                 02619000
NCSVBF07 EQU   NCSPLVBF                                                 02620000
NCSVBF06 EQU   NCSPLVBF                                                 02621000
NCSVBF05 EQU   NCSPLVBF                                                 02622000
NCSVBF04 EQU   NCSPLVBF                                                 02623000
NCSVBF03 EQU   NCSPLVBF                                                 02624000
NCSVBF02 EQU   NCSPLVBF                                                 02625000
NCSVBF01 EQU   NCSPLVBF                                                 02626000
NCSPLVCD EQU   NCSVERB                                                  02627000
@NM00019 EQU   @NM00018                                                 02628000
NCSPLRPH EQU   NCSPFX+12                                                02629000
NCSWLPTR EQU   NCSPLWEL+1                                               02630000
@NM00017 EQU   NCSPLWEL                                                 02631000
@NM00016 EQU   NCSPFX+4                                                 02632000
NCSIORC  EQU   NCSPFX+3                                                 02633000
@NM00015 EQU   NCSFLAGS                                                 02634000
@NM00014 EQU   NCSFLAGS                                                 02635000
@NM00013 EQU   NCSFLAGS                                                 02636000
@NM00012 EQU   NCSFLAGS                                                 02637000
NCSPLNON EQU   NCSFLAGS                                                 02638000
NCSPRIV  EQU   NCSFLAGS                                                 02639000
NCSPLREQ EQU   NCSFLAGS                                                 02640000
NCSVSTAT EQU   NCSFLAGS                                                 02641000
@NM00011 EQU   NCSPFX+1                                                 02642000
NCSCBID  EQU   NCSPFX                                                   02643000
CPCBCON  EQU   ISTCPCB+35                                               02644000
CPCBR00  EQU   ISTCPCB+34                                               02645000
CPCBMNR  EQU   ISTCPCB+33                                               02646000
CPCBURC  EQU   ISTCPCB+24                                               02647000
CPCBUSR  EQU   ISTCPCB+20                                               02648000
CPCBFMH  EQU   CPCBOPC+1                                                02649000
CPCBCAT  EQU   CPCBOPC                                                  02650000
CPCB13   EQU   CPCBPH                                                   02651000
CPCBFA   EQU   @NM00010                                                 02652000
CPCBQP   EQU   ISTCPCB+4                                                02653000
CPCBRC   EQU   ISTCPCB+3                                                02654000
CPCBNW   EQU   CPCBFL                                                   02655000
CPCBXC   EQU   CPCBFL                                                   02656000
CPCBDX   EQU   CPCBFL                                                   02657000
CPCBIB   EQU   CPCBFL                                                   02658000
CPCBXN   EQU   CPCBFL                                                   02659000
CPCBPV   EQU   CPCBFL                                                   02660000
CPCBRS   EQU   CPCBFL                                                   02661000
CPCBST   EQU   CPCBFL                                                   02662000
CPCBLN   EQU   ISTCPCB+1                                                02663000
CPCBID   EQU   ISTCPCB                                                  02664000
POHID    EQU   ISTPOHD+2                                                02665000
POHGEN   EQU   POHSTAT                                                  02666000
POHRREQ  EQU   POHSTAT                                                  02667000
POHRSVD2 EQU   POHSTAT                                                  02668000
POHCNTRL EQU   POHSTAT                                                  02669000
POHLBL   EQU   POHSTAT                                                  02670000
POHDATA  EQU   POHSTAT                                                  02671000
POHEND   EQU   POHSTAT                                                  02672000
POHRSVD1 EQU   ISTPOHD                                                  02673000
IOBERRCT EQU   IOBSTDRD+30                                              02674000
IOBRSV19 EQU   IOBINCAM+1                                               02675000
IOBOLTST EQU   IOBBTAMF                                                 02676000
IOBRFTMG EQU   IOBBTAMF                                                 02677000
IOBRSV17 EQU   IOBBTAMF                                                 02678000
IOBRSV16 EQU   IOBBTAMF                                                 02679000
IOBRSV15 EQU   IOBBTAMF                                                 02680000
IOBRSV14 EQU   IOBBTAMF                                                 02681000
IOBINUSE EQU   IOBBTAMF                                                 02682000
IOBPRMER EQU   IOBBTAMF                                                 02683000
IOBRSTRB EQU   IOBRESTR+1                                               02684000
IOBREPOS EQU   IOBRESTR                                                 02685000
IOBDCBPB EQU   IOBDCBPT+1                                               02686000
IOBRSV44 EQU   IOBFLAG4                                                 02687000
IOBJES3I EQU   IOBFLAG4                                                 02688000
IOBRSV42 EQU   IOBFLAG4                                                 02689000
IOBRSV41 EQU   IOBFLAG4                                                 02690000
IOBRSV40 EQU   IOBFLAG4                                                 02691000
IOBPMERR EQU   IOBFLAG4                                                 02692000
IOBCC3WE EQU   IOBFLAG4                                                 02693000
IOBGDPOL EQU   IOBFLAG4                                                 02694000
IOBSTRTB EQU   IOBSTART+1                                               02695000
IOBSIOCC EQU   IOBSTART                                                 02696000
IOBCSB7  EQU   IOBCSTAT                                                 02697000
IOBCSB6  EQU   IOBCSTAT                                                 02698000
IOBCSB5  EQU   IOBCSTAT                                                 02699000
IOBCSB4  EQU   IOBCSTAT                                                 02700000
IOBCSB3  EQU   IOBCSTAT                                                 02701000
IOBCSB2  EQU   IOBCSTAT                                                 02702000
IOBCSB1  EQU   IOBCSTAT                                                 02703000
IOBCSB0  EQU   IOBCSTAT                                                 02704000
IOBUSB7  EQU   IOBUSTAT                                                 02705000
IOBUSB6  EQU   IOBUSTAT                                                 02706000
IOBUSB5  EQU   IOBUSTAT                                                 02707000
IOBUSB4  EQU   IOBUSTAT                                                 02708000
IOBUSB3  EQU   IOBUSTAT                                                 02709000
IOBUSB2  EQU   IOBUSTAT                                                 02710000
IOBUSB1  EQU   IOBUSTAT                                                 02711000
IOBUSB0  EQU   IOBUSTAT                                                 02712000
IOBCMDA  EQU   IOBIOCSW                                                 02713000
IOBLOG   EQU   IOBFL3                                                   02714000
IOBJAM   EQU   IOBICL                                                   02715000
IOBMSG   EQU   IOBFL3                                                   02716000
IOBSDR   EQU   IOBCNC                                                   02717000
IOBACU   EQU   IOBFL3                                                   02718000
IOBCDC   EQU   IOBFL3                                                   02719000
IOBICC   EQU   IOBFL3                                                   02720000
IOBCCC   EQU   IOBFL3                                                   02721000
IOBECBPB EQU   IOBECBPT+1                                               02722000
IOBECBCC EQU   IOBECBPT                                                 02723000
IOBS1B7  EQU   IOBSENS1                                                 02724000
IOBS1B6  EQU   IOBSENS1                                                 02725000
IOBS1B5  EQU   IOBSENS1                                                 02726000
IOBS1B4  EQU   IOBSENS1                                                 02727000
IOBS1B3  EQU   IOBSENS1                                                 02728000
IOBS1B2  EQU   IOBSENS1                                                 02729000
IOBS1B1  EQU   IOBSENS1                                                 02730000
IOBS1B0  EQU   IOBSENS1                                                 02731000
IOBSNSC9 EQU   IOBS0B7                                                  02732000
IOBS0B6  EQU   IOBSENS0                                                 02733000
IOBS0B5  EQU   IOBSENS0                                                 02734000
IOBS0B4  EQU   IOBSENS0                                                 02735000
IOBS0B3  EQU   IOBSENS0                                                 02736000
IOBS0B2  EQU   IOBSENS0                                                 02737000
IOBS0B1  EQU   IOBSENS0                                                 02738000
IOBS0B0  EQU   IOBSENS0                                                 02739000
IOBPNCH  EQU   IOBFLAG2                                                 02740000
IOBSTATO EQU   IOBFLAG2                                                 02741000
IOBSKUPD EQU   IOBFLAG2                                                 02742000
IOBALTTR EQU   IOBFLAG2                                                 02743000
IOBRRT2  EQU   IOBRDHA0                                                 02744000
IOBRRT3  EQU   IOBPURGE                                                 02745000
IOBSENSE EQU   IOBFLAG2                                                 02746000
IOBHALT  EQU   IOBFLAG2                                                 02747000
IOBSPSVC EQU   IOBRSTRT                                                 02748000
IOBUNREL EQU   IOBFLAG1                                                 02749000
IOBIOERR EQU   IOBFLAG1                                                 02750000
IOBFCREX EQU   IOBCYCCK                                                 02751000
IOBRPSTN EQU   IOBFLAG1                                                 02752000
IOBERRTN EQU   IOBFLAG1                                                 02753000
IOBCMDCH EQU   IOBFLAG1                                                 02754000
IOBDATCH EQU   IOBFLAG1                                                 02755000
IOBCNOPA EQU   IOBPREFX+12                                              02756000
IOBCICB  EQU   IOBPREFX+8                                               02757000
IOBCECB  EQU   IOBPREFX+4                                               02758000
IOBCONOP EQU   IOBPREFX+3                                               02759000
IOBCINOP EQU   IOBPREFX+2                                               02760000
IOBRSV05 EQU   IOBPREFX+1                                               02761000
IOBPCI   EQU   IOBCFLG1                                                 02762000
IOBRSTCH EQU   IOBCFLG1                                                 02763000
IOBABAPP EQU   IOBCFLG1                                                 02764000
IOBPTST  EQU   IOBCFLG1                                                 02765000
IOBRSV04 EQU   IOBCFLG1                                                 02766000
IOBRSV03 EQU   IOBCFLG1                                                 02767000
IOBRSV02 EQU   IOBCFLG1                                                 02768000
IOBRSV01 EQU   IOBCFLG1                                                 02769000
@NM00009 EQU   SRBSECT+40                                               02770000
@NM00008 EQU   SRBSECT+38                                               02771000
SRBPRIOR EQU   SRBSECT+37                                               02772000
SRBPKF   EQU   SRBSECT+36                                               02773000
SRBSAVE  EQU   SRBSECT+32                                               02774000
SRBPARM  EQU   SRBSECT+28                                               02775000
SRBRMTR  EQU   SRBSECT+24                                               02776000
SRBEP    EQU   SRBSECT+20                                               02777000
SRBPTCB  EQU   SRBFLC+4                                                 02778000
SRBPASID EQU   SRBFLC+2                                                 02779000
SRBCPAFF EQU   SRBFLC                                                   02780000
SRBASCB  EQU   SRBSECT+8                                                02781000
SRBFLNK  EQU   SRBSECT+4                                                02782000
SRBID    EQU   SRBSECT                                                  02783000
IOSEND   EQU   IOSB+108                                                 02784000
IOSSKR   EQU   IOSEEKA+7                                                02785000
IOSSKH2  EQU   IOSSKHH+1                                                02786000
IOSSKH1  EQU   IOSSKHH                                                  02787000
IOSSKCC  EQU   IOSCCHH                                                  02788000
IOSSKBB  EQU   IOSEEKA+1                                                02789000
IOSSKM   EQU   IOSEEKA                                                  02790000
IOSEEK   EQU   IOSB+92                                                  02791000
IOSMDM   EQU   IOSB+91                                                  02792000
IOSMDB   EQU   IOSB+90                                                  02793000
IOSCKEY7 EQU   IOSCKEY                                                  02794000
IOSCKEY6 EQU   IOSCKEY                                                  02795000
IOSCKEY5 EQU   IOSCKEY                                                  02796000
IOSCKEY4 EQU   IOSCKEY                                                  02797000
@NM00004 EQU   IOSCKEY                                                  02798000
IOSFMSK  EQU   IOSB+88                                                  02799000
IOSCUDEV EQU   IOSPATH+1                                                02800000
@NM00003 EQU   IOSCHN                                                   02801000
IOSPATH3 EQU   IOSCHN                                                   02802000
IOSPATH2 EQU   IOSCHN                                                   02803000
IOSEXP   EQU   IOSCHN                                                   02804000
IOSGDP   EQU   IOSCHN                                                   02805000
IOSAFF   EQU   IOSB+85                                                  02806000
IOSRSS1B EQU   IOSB+84                                                  02807000
IOSDSID  EQU   IOSB+80                                                  02808000
IOSVST   EQU   IOSB+76                                                  02809000
IOSRST   EQU   IOSB+72                                                  02810000
IOSDIE   EQU   IOSB+68                                                  02811000
IOSABN   EQU   IOSB+64                                                  02812000
IOSNRM   EQU   IOSB+60                                                  02813000
IOSPCI   EQU   IOSB+56                                                  02814000
IOSERP   EQU   IOSB+52                                                  02815000
IOSPCHN  EQU   IOSB+48                                                  02816000
IOSSNS   EQU   IOSB+42                                                  02817000
IOSAPMSK EQU   IOSB+40                                                  02818000
IOSRES4A EQU   IOSB+36                                                  02819000
IOSUSE   EQU   IOSB+32                                                  02820000
IOSSRB   EQU   IOSB+28                                                  02821000
IOSCSWRC EQU   IOSCSW+5                                                 02822000
IOSTSB   EQU   IOSTATUS+1                                               02823000
IOSTSA   EQU   IOSTATUS                                                 02824000
IOSCSWCA EQU   IOSCSW                                                   02825000
IOSCC    EQU   @NM00002                                                 02826000
IOSUCB   EQU   IOSB+16                                                  02827000
IOSOPT2X EQU   IOSOPT2                                                  02828000
IOSHTP   EQU   IOSOPT2                                                  02829000
IOSRELSE EQU   IOSOPT                                                   02830000
IOSAPR   EQU   IOSOPT                                                   02831000
IOSTSLL  EQU   IOSOPT                                                   02832000
IOSNERP  EQU   IOSOPT                                                   02833000
IOSPSLL  EQU   IOSOPT                                                   02834000
IOSQISCE EQU   IOSOPT                                                   02835000
IOSDEP   EQU   IOSOPT                                                   02836000
IOSBYP   EQU   IOSOPT                                                   02837000
IOSCOD   EQU   IOSB+13                                                  02838000
IOSPKY7  EQU   IOSPKEY                                                  02839000
IOSPGDPX EQU   IOSPKEY                                                  02840000
IOSIDR   EQU   IOSPKEY                                                  02841000
IOSLCL   EQU   IOSPKEY                                                  02842000
@NM00001 EQU   IOSPKEY                                                  02843000
IOSPGAD  EQU   IOSB+8                                                   02844000
IOSASID  EQU   IOSB+6                                                   02845000
IOSPRLVL EQU   IOSB+5                                                   02846000
IOSDVRID EQU   IOSB+4                                                   02847000
IOSPROC  EQU   IOSB+3                                                   02848000
IOSFLC7  EQU   IOSFLC                                                   02849000
IOSFLC6  EQU   IOSFLC                                                   02850000
IOSRWAIT EQU   IOSFLC                                                   02851000
IOSTP    EQU   IOSFLC                                                   02852000
IOSCC3WE EQU   IOSFLC                                                   02853000
IOSVERIF EQU   IOSDVALT                                                 02854000
IOSDVMNT EQU   IOSFLC                                                   02855000
IOSLOG   EQU   IOSFLB                                                   02856000
IOSBDCST EQU   IOSFLB                                                   02857000
IOSMSG   EQU   IOSFLB                                                   02858000
IOSFLB4  EQU   IOSFLB                                                   02859000
IOSFLB3  EQU   IOSFLB                                                   02860000
IOSFLB2  EQU   IOSFLB                                                   02861000
IOSSDR   EQU   IOSFLB                                                   02862000
IOSDIESE EQU   IOSFLB                                                   02863000
IOSIOSB  EQU   IOSFLA                                                   02864000
IOSDOM   EQU   IOSFLA                                                   02865000
IOSEX    EQU   IOSFLA                                                   02866000
IOSSMDB  EQU   IOSFLA                                                   02867000
IOSSMDA  EQU   IOSFLA                                                   02868000
IOSERR   EQU   IOSFLA                                                   02869000
IOSCCHN  EQU   IOSACHN                                                  02870000
IOSDCHN  EQU   IOSACHN                                                  02871000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02872000
@ENDDATA EQU   *                                                        02873000
         END   ISTINCY1,(C'PLS1247',0702,80267)                         02874000
