         TITLE 'ISTIC005-OPTION DECODE'                                 00001000
ISTIC005 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTIC005  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
*   R3=R13;                                                        0046 00013000
         LR    R3,R13                                              0046 00014000
*   R13=ADDR(SVEIC003);                                            0047 00015000
         LA    R13,SVEIC003(,WAPTR)                                0047 00016000
*   BACKSAVE(3)=R13;                                               0048 00017000
         ST    R13,BACKSAVE+8(,R3)                                 0048 00018000
*   SVEIC003(2)=R3;                                                0049 00019000
         ST    R3,SVEIC003+4(,WAPTR)                               0049 00020000
*   OPTS=A33OPTN;                   /* MOVE OPTIONS TO WORK          */ 00021000
         MVC   OPTS(44),A33OPTN                                    0050 00022000
*   IF $OPTMSG='1'B THEN            /* OPTION MSG REQUESTED ?        */ 00023000
         TM    $OPTMSG(WAPTR),B'10000000'                          0051 00024000
         BNO   @RF00051                                            0051 00025000
*     DO;                           /* SET UP OPTIONS ARE MSG        */ 00026000
*       EBTL='N';                                                  0053 00027000
         MVI   EBTL,C'N'                                           0053 00028000
*       IF $LOOPTST='1'B THEN       /* TEST LOOP (TL)                */ 00029000
         TM    $LOOPTST(WAPTR),B'00000001'                         0054 00030000
         BNO   @RF00054                                            0054 00031000
*         EBTL=' ';                                                0055 00032000
         MVI   EBTL,C' '                                           0055 00033000
*       EBEL='N';                                                  0056 00034000
@RF00054 MVI   EBEL,C'N'                                           0056 00035000
*       IF $LOOPERR='1'B THEN       /* ERROR LOOP (EL)               */ 00036000
         TM    $LOOPERR(WAPTR),B'00000010'                         0057 00037000
         BNO   @RF00057                                            0057 00038000
*         EBEL=' ';                                                0058 00039000
         MVI   EBEL,C' '                                           0058 00040000
*       EBPP='N';                                                  0059 00041000
@RF00057 MVI   EBPP,C'N'                                           0059 00042000
*       IF $ALTPRNT='1'B THEN       /* PARALLEL PRINT (PP)           */ 00043000
         TM    $ALTPRNT(WAPTR),B'00010000'                         0060 00044000
         BNO   @RF00060                                            0060 00045000
*         EBPP=' ';                                                0061 00046000
         MVI   EBPP,C' '                                           0061 00047000
*       EBFE='N';                                                  0062 00048000
@RF00060 MVI   EBFE,C'N'                                           0062 00049000
*       IF $FSTCOMM='1'B THEN       /* FIRST ERROR COMM. (FE)        */ 00050000
         TM    $FSTCOMM(WAPTR),B'00000001'                         0063 00051000
         BNO   @RF00063                                            0063 00052000
*         EBFE=' ';                                                0064 00053000
         MVI   EBFE,C' '                                           0064 00054000
*       EBMI='N';                                                  0065 00055000
@RF00063 MVI   EBMI,C'N'                                           0065 00056000
*       IF $MANINTV='1'B THEN       /* MANUAL INTERVENT (MI)         */ 00057000
         TM    $MANINTV(WAPTR),B'10000000'                         0066 00058000
         BNO   @RF00066                                            0066 00059000
*         EBMI=' ';                                                0067 00060000
         MVI   EBMI,C' '                                           0067 00061000
*       EBEP='N';                                                  0068 00062000
@RF00066 MVI   EBEP,C'N'                                           0068 00063000
*       IF $NERRPRT='0'B THEN       /* ERROR PRINT (EP)              */ 00064000
         TM    $NERRPRT(WAPTR),B'00000100'                         0069 00065000
         BNZ   @RF00069                                            0069 00066000
*         EBEP=' ';                                                0070 00067000
         MVI   EBEP,C' '                                           0070 00068000
*       EBCP='N';                                                  0071 00069000
@RF00069 MVI   EBCP,C'N'                                           0071 00070000
*       IF $NOCNTRL='1'B THEN       /* CONTROL PRINT (CP)            */ 00071000
         TM    $NOCNTRL(WAPTR),B'00001000'                         0072 00072000
         BNO   @RF00072                                            0072 00073000
*         EBCP=' ';                                                0073 00074000
         MVI   EBCP,C' '                                           0073 00075000
*       EBPR='N';                                                  0074 00076000
@RF00072 MVI   EBPR,C'N'                                           0074 00077000
*       IF $NOPRT='1'B THEN         /* PRINT (PR)                    */ 00078000
         TM    $NOPRT(WAPTR),B'00000100'                           0075 00079000
         BNO   @RF00075                                            0075 00080000
*         EBPR=' ';                                                0076 00081000
         MVI   EBPR,C' '                                           0076 00082000
*       EBTR='N';                                                  0077 00083000
@RF00075 MVI   EBTR,C'N'                                           0077 00084000
*       IF $TRACE='1'B THEN         /* TRACE (TR)                    */ 00085000
         TM    $TRACE(WAPTR),B'00000100'                           0078 00086000
         BNO   @RF00078                                            0078 00087000
*         EBTR=' ';                                                0079 00088000
         MVI   EBTR,C' '                                           0079 00089000
*       EBAP='N';                                                  0080 00090000
@RF00078 MVI   EBAP,C'N'                                           0080 00091000
*       IF $ALTPRTR='1'B THEN       /* ALTERNATE PRINT (AP)          */ 00092000
         TM    $ALTPRTR(WAPTR),B'00000010'                         0081 00093000
         BNO   @RF00081                                            0081 00094000
*         EBAP=' ';                                                0082 00095000
         MVI   EBAP,C' '                                           0082 00096000
*       $INBUFR(1:43)=OPTS;         /* MOVE OPTIONS FOR CECOM        */ 00097000
*                                                                  0083 00098000
@RF00081 MVC   $INBUFR(43,WAPTR),OPTS                              0083 00099000
*       /*************************************************************/ 00100000
*       /*                                                           */ 00101000
*       /* TCEC MSGN(107)SUB(YES) INVOKED                            */ 00102000
*       /*                                                           */ 00103000
*       /*************************************************************/ 00104000
*                                                                  0084 00105000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 00106000
         OI    $TCECM(WAPTR),B'00000001'                           0084 00107000
*       R1=ADDR($TCA09);            /* SET UP PARM LIST $TR          */ 00108000
         LA    R1,$TCA09                                           0085 00109000
*       CALL #EXIT;                 /* CALL CECOM                    */ 00110000
         L     @15,#EXITA(,WAPTR)                                  0086 00111000
         BALR  @14,@15                                             0086 00112000
*       DCL                                                        0087 00113000
*         1 $TCA09,                 /* TCEC PARM LIST                */ 00114000
*          2 $TCB09 FIXED(32) INIT(107),/* MSG NUMBER                */ 00115000
*          2 $TCC09 FIXED(32) INIT(0),/* INCT LEN                    */ 00116000
*          2 $TCD09 BIT(8) INIT('10000000'B),/* FLAG                 */ 00117000
*          2 $TCE09 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK ISSUE 0087 00118000
*                                      OPTIONS ARE ....              */ 00119000
*       R3=$EXTA(1);                /* GET EXTERNAL DATA SIZE        */ 00120000
         SLR   R3,R3                                               0088 00121000
         IC    R3,$EXTA(,WAPTR)                                    0088 00122000
*       IF R3^=0 THEN               /* IF EXT= HAS BEEN ENTER        */ 00123000
         LTR   R3,R3                                               0089 00124000
         BZ    @RF00089                                            0089 00125000
*         DO;                       /* THEN SET UP TO WRITE NS       */ 00126000
*           R4=R3+1;                                               0091 00127000
         LA    R4,1                                                0091 00128000
         ALR   R4,R3                                               0091 00129000
*           $INBUFR(1:54)='';                                      0092 00130000
         MVI   $INBUFR(WAPTR),C' '                                 0092 00131000
         MVC   $INBUFR+1(53,WAPTR),$INBUFR(WAPTR)                  0092 00132000
*           $INBUFR(1:R3)=$EXTA(2:R4);                             0093 00133000
*                                                                  0093 00134000
         LR    @14,R3                                              0093 00135000
         BCTR  @14,0                                               0093 00136000
         EX    @14,@SM00861                                        0093 00137000
*           /*********************************************************/ 00138000
*           /*                                                       */ 00139000
*           /* TCEC MSGN(327)SUB(YES) INVOKED                        */ 00140000
*           /*                                                       */ 00141000
*           /*********************************************************/ 00142000
*                                                                  0094 00143000
*           $TCECM='1'B;            /* SET TCEC SW IN RCA            */ 00144000
         OI    $TCECM(WAPTR),B'00000001'                           0094 00145000
*           R1=ADDR($TCA10);        /* SET UP PARM LIST $TR          */ 00146000
         LA    R1,$TCA10                                           0095 00147000
*           CALL #EXIT;             /* CALL CECOM                    */ 00148000
         L     @15,#EXITA(,WAPTR)                                  0096 00149000
         BALR  @14,@15                                             0096 00150000
*           DCL                                                    0097 00151000
*             1 $TCA10,             /* TCEC PARM LIST                */ 00152000
*              2 $TCB10 FIXED(32) INIT(327),/* MSG NUMBER            */ 00153000
*              2 $TCC10 FIXED(32) INIT(0),/* INCT LEN                */ 00154000
*              2 $TCD10 BIT(8) INIT('10000000'B),/* FLAG             */ 00155000
*              2 $TCE10 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK   0097 00156000
*                                      ISSUE EXT= MSG                */ 00157000
*         END;                                                     0098 00158000
*       $OPTMSG='0'B;               /* RESET OPT MESSAGE SWT         */ 00159000
@RF00089 NI    $OPTMSG(WAPTR),B'01111111'                          0099 00160000
*       GO TO OPT900;                                              0100 00161000
         B     OPT900                                              0100 00162000
*     END;                                                         0101 00163000
*   R3=$SLASHAD(2)+1;               /* PT TO 1ST CHAR OF OPTS        */ 00164000
@RF00051 LA    R3,1                                                0102 00165000
         AL    R3,$SLASHAD+4(,WAPTR)                               0102 00166000
*   IF R3=$SLASHAD(3) THEN          /* SLASH ENTERED ?               */ 00167000
         C     R3,$SLASHAD+8(,WAPTR)                               0103 00168000
         BE    @RT00103                                            0103 00169000
*     GO TO OPT900;                                                0104 00170000
*   A33SAVE=A33SAVE&&A33SAVE;       /* CLEAR SAVE AREA               */ 00171000
         XC    A33SAVE(11),A33SAVE                                 0105 00172000
*   A33SAVE(1)=$TESTOPT;            /* SAVE                          */ 00173000
         MVC   A33SAVE(1),$TESTOPT(WAPTR)                          0106 00174000
*   A33SAVE(2)=$ERROPT;             /* OLD                           */ 00175000
         MVC   A33SAVE+1(1),$ERROPT(WAPTR)                         0107 00176000
*   A33SAVE(3)=$EXECFLG;            /* OPTIONS                       */ 00177000
         MVC   A33SAVE+2(1),$EXECFLG(WAPTR)                        0108 00178000
*   A33SAVE(4)=$OLTFLGS;            /* AND                           */ 00179000
         MVC   A33SAVE+3(1),$OLTFLGS(WAPTR)                        0109 00180000
*   A33SAVE(5)=$PRNTLVL;            /* CONSTANTS                     */ 00181000
         MVC   A33SAVE+4(1),$PRNTLVL(WAPTR)                        0110 00182000
*   A33SAVE(6:7)=$ERRCNTA;          /*                               */ 00183000
         MVC   A33SAVE+5(2),$ERRCNTA(WAPTR)                        0111 00184000
*   A33SAVE(8:9)=$TLCNT;                                           0112 00185000
         MVC   A33SAVE+7(2),$TLCNT(WAPTR)                          0112 00186000
*   A33SAVE(10)=$FLAG9;                                            0113 00187000
         MVC   A33SAVE+9(1),$FLAG9(WAPTR)                          0113 00188000
*   INTFLAGS=INTFLAGS&&INTFLAGS;    /* INIT INTERNAL FLAGS           */ 00189000
         XC    INTFLAGS(1),INTFLAGS                                0114 00190000
*                                                                  0115 00191000
*   /*****************************************************************/ 00192000
*   /*                                                               */ 00193000
*   /* DECODE OPTION FIELD                                           */ 00194000
*   /*                                                               */ 00195000
*   /*****************************************************************/ 00196000
*                                                                  0115 00197000
*OPT050:                                                           0115 00198000
*   NO='0'B;                        /* SET NEGATIVE OPT FLAG         */ 00199000
OPT050   NI    NO,B'01111111'                                      0115 00200000
*   IF INPUTBUF(1)='N' THEN         /* CHK 1ST CHAR= N               */ 00201000
         CLI   INPUTBUF(R3),C'N'                                   0116 00202000
         BNE   @RF00116                                            0116 00203000
*     DO;                                                          0117 00204000
*       NO='1'B;                    /* YES SET FLAG ON               */ 00205000
         OI    NO,B'10000000'                                      0118 00206000
*       R3=R3+1;                    /* PT TO OPTION                  */ 00207000
         AL    R3,@CF00072                                         0119 00208000
*     END;                                                         0120 00209000
*   IF INPUTBUF(1:2)='TL' THEN      /* TEST LOOP SPECIFIED           */ 00210000
@RF00116 CLC   INPUTBUF(2,R3),@CC00764                             0121 00211000
         BNE   @RF00121                                            0121 00212000
*     DO;                           /* YES                           */ 00213000
*       IF NO='0'B THEN             /* NTL SPECIFIED                 */ 00214000
         TM    NO,B'10000000'                                      0123 00215000
         BZ    @RT00123                                            0123 00216000
*         GO TO OPT300;             /* NO,PROCESS TL                 */ 00217000
*       $LOOPTST='0'B;              /* TURN TL OFF                   */ 00218000
         NI    $LOOPTST(WAPTR),B'11111110'                         0125 00219000
*       $TLCNT=1;                   /* INITIALIZE COUNT              */ 00220000
         MVC   $TLCNT(2,WAPTR),@CH00072                            0126 00221000
*       GO TO OPT070;               /* SET UP TO DECODE NEXT         */ 00222000
         B     OPT070                                              0127 00223000
*     END;                                                         0128 00224000
*   IF INPUTBUF(1:2)='EL' THEN      /* ERROR LOOP SPECIFIED          */ 00225000
@RF00121 CLC   INPUTBUF(2,R3),@CC00767                             0129 00226000
         BNE   @RF00129                                            0129 00227000
*     DO;                           /* YES                           */ 00228000
*       IF NO='0'B THEN             /* NEL SPECIFIED                 */ 00229000
         TM    NO,B'10000000'                                      0131 00230000
         BZ    @RT00131                                            0131 00231000
*         GO TO OPT200;             /* NO,PROCESS EL                 */ 00232000
*       $LOOPERR='0'B;              /* TURN EL OFF                   */ 00233000
         NI    $LOOPERR(WAPTR),B'11111101'                         0133 00234000
*       GO TO OPT070;               /* SET UP TO DECODE NEXT         */ 00235000
         B     OPT070                                              0134 00236000
*     END;                                                         0135 00237000
*   IF INPUTBUF(1:2)='PP' THEN      /* PARALLEL PRINT SPECIFED       */ 00238000
@RF00129 CLC   INPUTBUF(2,R3),@CC00769                             0136 00239000
         BNE   @RF00136                                            0136 00240000
*     DO;                           /* YES                           */ 00241000
*       IF NO='0'B THEN             /* NPP SPECIFIED                 */ 00242000
         TM    NO,B'10000000'                                      0138 00243000
         BZ    @RT00138                                            0138 00244000
*         GO TO OPT100;             /* NO PROCESS PP                 */ 00245000
*       $ALTPRNT='0'B;              /* TURN OFF PP                   */ 00246000
         NI    $ALTPRNT(WAPTR),B'11101111'                         0140 00247000
*       GO TO OPT070;               /* SET UP TO DECODE NEXT         */ 00248000
         B     OPT070                                              0141 00249000
*     END;                                                         0142 00250000
*   IF INPUTBUF(1:2)='AP'&$OLTACT='0'B THEN/* ALTERNATE PRINTER      */ 00251000
@RF00136 CLC   INPUTBUF(2,R3),@CC00771                             0143 00252000
         BNE   @RF00143                                            0143 00253000
         TM    $OLTACT(WAPTR),B'00000001'                          0143 00254000
         BNZ   @RF00143                                            0143 00255000
*     DO;                           /* YES                           */ 00256000
*       GO TO OPT400;                                              0145 00257000
         B     OPT400                                              0145 00258000
*     END;                                                         0146 00259000
*   IF INPUTBUF(1:2)='FE' THEN      /* FIRST ERROR COMM              */ 00260000
@RF00143 CLC   INPUTBUF(2,R3),@CC00773                             0147 00261000
         BNE   @RF00147                                            0147 00262000
*     DO;                           /* YES                           */ 00263000
*       $FSTCOMM='0'B;              /* SET NFE                       */ 00264000
         NI    $FSTCOMM(WAPTR),B'11111110'                         0149 00265000
*       IF NO='0'B THEN             /* FE SPECIFIED                  */ 00266000
         TM    NO,B'10000000'                                      0150 00267000
         BNZ   @RF00150                                            0150 00268000
*         $FSTCOMM='1'B;            /* YES                           */ 00269000
         OI    $FSTCOMM(WAPTR),B'00000001'                         0151 00270000
*       GO TO OPT070;               /* DECODE NEXT                   */ 00271000
         B     OPT070                                              0152 00272000
*     END;                                                         0153 00273000
*   IF INPUTBUF(1:2)='MI' THEN      /* MANUAL INTERVENTION           */ 00274000
@RF00147 CLC   INPUTBUF(2,R3),@CC00774                             0154 00275000
         BNE   @RF00154                                            0154 00276000
*     DO;                           /* YES                           */ 00277000
*       $MANINTV='0'B;              /* SET NMI                       */ 00278000
         NI    $MANINTV(WAPTR),B'01111111'                         0156 00279000
*       IF NO='0'B THEN             /* MI SPECIFIED                  */ 00280000
         TM    NO,B'10000000'                                      0157 00281000
         BNZ   @RF00157                                            0157 00282000
*         $MANINTV='1'B;            /* YES                           */ 00283000
         OI    $MANINTV(WAPTR),B'10000000'                         0158 00284000
*       GO TO OPT070;               /* DECODE NEXT                   */ 00285000
         B     OPT070                                              0159 00286000
*     END;                                                         0160 00287000
*   IF INPUTBUF(1:2)='EP' THEN      /* ERROR PRINT                   */ 00288000
@RF00154 CLC   INPUTBUF(2,R3),@CC00775                             0161 00289000
         BNE   @RF00161                                            0161 00290000
*     DO;                           /* YES                           */ 00291000
*       $NERRPRT='1'B;              /* SET NEP                       */ 00292000
         OI    $NERRPRT(WAPTR),B'00000100'                         0163 00293000
*       IF NO='0'B THEN             /* EP SPECIFIED                  */ 00294000
         TM    NO,B'10000000'                                      0164 00295000
         BNZ   @RF00164                                            0164 00296000
*         $NERRPRT='0'B;            /* YES                           */ 00297000
         NI    $NERRPRT(WAPTR),B'11111011'                         0165 00298000
*       GO TO OPT070;               /* DECODE NEXT                   */ 00299000
         B     OPT070                                              0166 00300000
*     END;                                                         0167 00301000
*   IF INPUTBUF(1:2)='CP' THEN      /* CONTROL PRINT                 */ 00302000
@RF00161 CLC   INPUTBUF(2,R3),@CC00776                             0168 00303000
         BNE   @RF00168                                            0168 00304000
*     DO;                           /* YES                           */ 00305000
*       $NOCNTRL='0'B;              /* SET NCP                       */ 00306000
         NI    $NOCNTRL(WAPTR),B'11110111'                         0170 00307000
*       IF NO='0'B THEN             /* CP SPECIFIED                  */ 00308000
         TM    NO,B'10000000'                                      0171 00309000
         BNZ   @RF00171                                            0171 00310000
*         $NOCNTRL='1'B;            /* YES                           */ 00311000
         OI    $NOCNTRL(WAPTR),B'00001000'                         0172 00312000
*       GO TO OPT070;               /* DECODE NEXT                   */ 00313000
         B     OPT070                                              0173 00314000
*     END;                                                         0174 00315000
*   IF INPUTBUF(1:2)='PR' THEN      /* PRINT                         */ 00316000
@RF00168 CLC   INPUTBUF(2,R3),@CC00777                             0175 00317000
         BNE   @RF00175                                            0175 00318000
*     DO;                           /* YES                           */ 00319000
*       $NOPRT='0'B;                /* SET NPR                       */ 00320000
         NI    $NOPRT(WAPTR),B'11111011'                           0177 00321000
*       IF NO='0'B THEN             /* PR SPECIFIED                  */ 00322000
         TM    NO,B'10000000'                                      0178 00323000
         BNZ   @RF00178                                            0178 00324000
*         $NOPRT='1'B;              /* YES                           */ 00325000
         OI    $NOPRT(WAPTR),B'00000100'                           0179 00326000
*       GO TO OPT070;               /* DECODE NEXT                   */ 00327000
         B     OPT070                                              0180 00328000
*     END;                                                         0181 00329000
*   IF INPUTBUF(1:2)='TR' THEN      /* TRACE                         */ 00330000
@RF00175 CLC   INPUTBUF(2,R3),@CC00778                             0182 00331000
         BNE   @RF00182                                            0182 00332000
*     DO;                           /* YES                           */ 00333000
*       $TRACE='0'B;                /* SET NTR                       */ 00334000
         NI    $TRACE(WAPTR),B'11111011'                           0184 00335000
*       IF NO='0'B THEN             /* TR SPECIFIED                  */ 00336000
         TM    NO,B'10000000'                                      0185 00337000
         BNZ   @RF00185                                            0185 00338000
*         $TRACE='1'B;              /* YES                           */ 00339000
         OI    $TRACE(WAPTR),B'00000100'                           0186 00340000
*       GO TO OPT070;               /* DECODE NEXT                   */ 00341000
         B     OPT070                                              0187 00342000
*     END;                                                         0188 00343000
*   IF INPUTBUF(1:4)='EXT=' THEN    /* EXTERNAL DATA                 */ 00344000
@RF00182 CLC   INPUTBUF(4,R3),@CC00779                             0189 00345000
         BNE   @RF00189                                            0189 00346000
*     DO;                           /* YES                           */ 00347000
*       R3=R3+4;                    /* POINT TO DATA                 */ 00348000
         AL    R3,@CF00068                                         0191 00349000
*       IF INPUTBUF(1)='/' THEN     /* END OF OPTION FIELD           */ 00350000
         CLI   INPUTBUF(R3),C'/'                                   0192 00351000
         BNE   @RF00192                                            0192 00352000
*         DO;                       /* YES,CONTINUE                  */ 00353000
*           $EXTA=$EXTA&&$EXTA;     /* INIT EXTERNAL DATA AREA       */ 00354000
         XC    $EXTA(56,WAPTR),$EXTA(WAPTR)                        0194 00355000
*           GO TO OPT080;           /* CHECK FOR END OF FIELD        */ 00356000
         B     OPT080                                              0195 00357000
*         END;                                                     0196 00358000
*       R4=$SLASHAD(3)-R3;          /* CALCULATE LENGTH              */ 00359000
@RF00192 L     R4,$SLASHAD+8(,WAPTR)                               0197 00360000
         SLR   R4,R3                                               0197 00361000
*       IF R4<1|                    /* CHECK FOR                     */ 00362000
*           R4>54 THEN              /* VALID LENGTH                  */ 00363000
         LA    @14,1                                               0198 00364000
         CR    R4,@14                                              0198 00365000
         BL    @RT00198                                            0198 00366000
         C     R4,@CF00753                                         0198 00367000
         BH    @RT00198                                            0198 00368000
*         GO TO OPT800;             /* INVALID LENGTH                */ 00369000
*       $EXTA=$EXTA&&$EXTA;         /* CLEAR AREA                    */ 00370000
         XC    $EXTA(56,WAPTR),$EXTA(WAPTR)                        0200 00371000
*       EXTNUMFX=R4;                /* MOVE COUNT                    */ 00372000
         ST    R4,EXTNUMFX                                         0201 00373000
*       $EXTA(1)=EXTNUMCH;          /* INTO FIRST BYTE               */ 00374000
         MVC   $EXTA(1,WAPTR),EXTNUMCH                             0202 00375000
*       R4=R4+1;                    /* ADD 1 FOR SUBSCRIPT           */ 00376000
         ALR   R4,@14                                              0203 00377000
*       $EXTA(2:R4)=INPUTBUF;       /* MOVE IN DATA                  */ 00378000
         LR    @14,R4                                              0204 00379000
         BCTR  @14,0                                               0204 00380000
         BCTR  @14,0                                               0204 00381000
         EX    @14,@SM00871                                        0204 00382000
*       R3=R3+EXTNUMFX;                                            0205 00383000
         L     @14,EXTNUMFX                                        0205 00384000
         ALR   R3,@14                                              0205 00385000
*       GO TO OPT080;               /* CHK FOR MUTALLY EXCL          */ 00386000
         B     OPT080                                              0206 00387000
*     END;                                                         0207 00388000
*   R3=R3+1;                        /* PT TO INVALID OPTION          */ 00389000
@RF00189 AL    R3,@CF00072                                         0208 00390000
*   GO TO OPT800;                   /* ERROR,INVALID OPTION          */ 00391000
         B     OPT800                                              0209 00392000
*OPT070:                                                           0210 00393000
*   R3=R3+2;                        /* PT TO NEXT ENTRY              */ 00394000
OPT070   AL    R3,@CF00139                                         0210 00395000
*OPT075:                                                           0211 00396000
*   IF INPUTBUF(1)=',' THEN         /* IS IT A COMMA                 */ 00397000
OPT075   CLI   INPUTBUF(R3),C','                                   0211 00398000
         BNE   @RF00211                                            0211 00399000
*     DO;                                                          0212 00400000
*       R3=R3+1;                    /* PT TO NEXT OPTION             */ 00401000
         AL    R3,@CF00072                                         0213 00402000
*       GO TO OPT050;               /* DEODE NEXT ENTRY              */ 00403000
         B     OPT050                                              0214 00404000
*     END;                                                         0215 00405000
*OPT080:                                                           0216 00406000
*   IF INPUTBUF(1)='/' THEN         /* END OF OPT FIELD              */ 00407000
@RF00211 DS    0H                                                  0216 00408000
OPT080   CLI   INPUTBUF(R3),C'/'                                   0216 00409000
         BE    @RT00216                                            0216 00410000
*     GO TO OPT900;                 /* YES,RETURN                    */ 00411000
*   GO TO OPT800;                   /* NO,ERROR                      */ 00412000
         B     OPT800                                              0218 00413000
*                                                                  0219 00414000
*   /*****************************************************************/ 00415000
*   /*                                                               */ 00416000
*   /* PP OPTION ENTRY                                               */ 00417000
*   /*                                                               */ 00418000
*   /*****************************************************************/ 00419000
*                                                                  0219 00420000
*OPT100:                                                           0219 00421000
*   $ALTPRNT='1'B;                  /* SET PARALLEL PRINT            */ 00422000
OPT100   OI    $ALTPRNT(WAPTR),B'00010000'                         0219 00423000
*   $PRNTLVL='2';                   /* SET DEFAULT LEVEL             */ 00424000
         MVI   $PRNTLVL(WAPTR),C'2'                                0220 00425000
*   IF INPUTBUF(3)='(' THEN         /* WILL PRNT LVL BE SPEC ?       */ 00426000
         CLI   INPUTBUF+2(R3),C'('                                 0221 00427000
         BNE   @RF00221                                            0221 00428000
*     DO;                                                          0222 00429000
*       IF INPUTBUF(4)<'0'|         /* YES                           */ 00430000
*           INPUTBUF(4)>'3' THEN    /* CHK HIGH-LOW LEGAL RNGE       */ 00431000
         CLI   INPUTBUF+3(R3),C'0'                                 0223 00432000
         BL    @RT00223                                            0223 00433000
         CLI   INPUTBUF+3(R3),C'3'                                 0223 00434000
         BNH   @RF00223                                            0223 00435000
@RT00223 DS    0H                                                  0224 00436000
*         DO;                                                      0224 00437000
*           R3=R3+3;                /* ERROR                         */ 00438000
         AL    R3,@CF00081                                         0225 00439000
*           GO TO OPT800;                                          0226 00440000
         B     OPT800                                              0226 00441000
*         END;                                                     0227 00442000
*       $PRNTLVL=INPUTBUF(4);       /* MOVE PRNT LEVEL TO TWA        */ 00443000
@RF00223 MVC   $PRNTLVL(1,WAPTR),INPUTBUF+3(R3)                    0228 00444000
*OPT150:                                                           0229 00445000
*       IF INPUTBUF(5)^=')' THEN    /* CHK SYNTAX                    */ 00446000
OPT150   CLI   INPUTBUF+4(R3),C')'                                 0229 00447000
         BE    @RF00229                                            0229 00448000
*         DO;                                                      0230 00449000
*           R3=R3+4;                /* ERROR                         */ 00450000
         AL    R3,@CF00068                                         0231 00451000
*           GO TO OPT800;                                          0232 00452000
         B     OPT800                                              0232 00453000
*         END;                                                     0233 00454000
*       R3=R3+5;                    /* PT TO , OR /                  */ 00455000
@RF00229 AL    R3,@CF00351                                         0234 00456000
*       GO TO OPT075;                                              0235 00457000
         B     OPT075                                              0235 00458000
*     END;                                                         0236 00459000
*   GO TO OPT070;                   /* GO CHK IT                     */ 00460000
         B     OPT070                                              0237 00461000
*                                                                  0238 00462000
*   /*****************************************************************/ 00463000
*   /*                                                               */ 00464000
*   /* EL OPTION ENTRY                                               */ 00465000
*   /*                                                               */ 00466000
*   /*****************************************************************/ 00467000
*                                                                  0238 00468000
*OPT200:                                                           0238 00469000
*   $LOOPERR='1'B;                  /* SET EL BIT ON                 */ 00470000
OPT200   OI    $LOOPERR(WAPTR),B'00000010'                         0238 00471000
*   $ERRCNT='0'B;                   /* TURN OFF COUNT GIVEN          */ 00472000
         NI    $ERRCNT(WAPTR),B'11101111'                          0239 00473000
*   IF INPUTBUF(3)='(' THEN         /* COUNT SPECIFIED ?             */ 00474000
         CLI   INPUTBUF+2(R3),C'('                                 0240 00475000
         BNE   @RF00240                                            0240 00476000
*     DO;                                                          0241 00477000
*       IF INPUTBUF(4)='I' THEN     /* INDEFINITE LOOP               */ 00478000
         CLI   INPUTBUF+3(R3),C'I'                                 0242 00479000
         BNE   @RF00242                                            0242 00480000
*         DO;                       /* YES                           */ 00481000
*           $INDEFLP='1'B;          /* TURN ON SWITCH                */ 00482000
         OI    $INDEFLP(WAPTR),B'00000010'                         0244 00483000
*           GO TO OPT150;           /* GO CHK LEFT PAREN             */ 00484000
         B     OPT150                                              0245 00485000
*         END;                                                     0246 00486000
*       R3=R3+3;                    /* PT TO NUMBER                  */ 00487000
@RF00242 AL    R3,@CF00081                                         0247 00488000
*       GEN(BAL  R11,OPT350);       /* CONVERT NUMBER                */ 00489000
         BAL  R11,OPT350                                                00490000
*       IF HEXNUM=0 THEN            /* LOOP CNT=0                    */ 00491000
         L     @14,HEXNUM                                          0249 00492000
         LTR   @14,@14                                             0249 00493000
         BNZ   @RF00249                                            0249 00494000
*         DO;                       /* YES,CONTINUE                  */ 00495000
*           $LOOPERR='0'B;          /* SET ERROR LOOP OFF            */ 00496000
         NI    $LOOPERR(WAPTR),B'11111101'                         0251 00497000
*           GO TO OPT075;           /* CONTINUE DECODING             */ 00498000
         B     OPT075                                              0252 00499000
*         END;                                                     0253 00500000
*       $ERRCNTA=HEXNUM;            /* STORE COUNT FOR OLT           */ 00501000
@RF00249 L     @14,HEXNUM                                          0254 00502000
         STH   @14,$ERRCNTA(,WAPTR)                                0254 00503000
*       $ERRLPCT=$ERRCNTA;          /* PUT IN SCT ALSO               */ 00504000
         STH   @14,$ERRLPCT(,WAPTR)                                0255 00505000
*       $ERRCNT='1'B;               /* SET COUNT GIVEN BIT           */ 00506000
         OI    $ERRCNT(WAPTR),B'00010000'                          0256 00507000
*       $INDEFLP='0'B;              /* RESET INDEFINITE LOOP         */ 00508000
         NI    $INDEFLP(WAPTR),B'11111101'                         0257 00509000
*       GO TO OPT075;               /* DECODE NEXT CHAR              */ 00510000
         B     OPT075                                              0258 00511000
*     END;                                                         0259 00512000
*   $ERRLPCT=$COUNT;                /* USE OLT DEFAULT               */ 00513000
@RF00240 L     @14,$LOWADDR(,WAPTR)                                0260 00514000
         LH    @10,RTNDISP(,@14)                                   0260 00515000
         ALR   @10,@14                                             0260 00516000
         LH    @14,$COUNT(,@10)                                    0260 00517000
         N     @14,@CF00875                                        0260 00518000
         STH   @14,$ERRLPCT(,WAPTR)                                0260 00519000
*   $INDEFLP='0'B;                  /* RESET INDEFINITE LOOP         */ 00520000
         NI    $INDEFLP(WAPTR),B'11111101'                         0261 00521000
*   GO TO OPT070;                   /* DECODE NEXT CHAR              */ 00522000
         B     OPT070                                              0262 00523000
*                                                                  0263 00524000
*   /*****************************************************************/ 00525000
*   /*                                                               */ 00526000
*   /* TL OPTION ENTRY                                               */ 00527000
*   /*                                                               */ 00528000
*   /*****************************************************************/ 00529000
*                                                                  0263 00530000
*OPT300:                                                           0263 00531000
*   $LOOPTST='1'B;                  /* SET TL BIT                    */ 00532000
OPT300   OI    $LOOPTST(WAPTR),B'00000001'                         0263 00533000
*   $TLCNT=500;                     /* SET DEFAULT COUNT             */ 00534000
         MVC   $TLCNT(2,WAPTR),@CH00799                            0264 00535000
*   IF INPUTBUF(3)='(' THEN         /* COUNT SPECIFIED ?             */ 00536000
         CLI   INPUTBUF+2(R3),C'('                                 0265 00537000
         BNE   @RF00265                                            0265 00538000
*     DO;                           /* YES                           */ 00539000
*       R3=R3+3;                    /* PT TO COUNT                   */ 00540000
         AL    R3,@CF00081                                         0267 00541000
*       GEN(BAL  R11,OPT350);       /* DECODE & CONVERT CNT          */ 00542000
         BAL  R11,OPT350                                                00543000
*       $TLCNT=HEXNUM;              /* MOVE IN COUNT FOR OLT         */ 00544000
         L     @14,HEXNUM                                          0269 00545000
         STH   @14,$TLCNT(,WAPTR)                                  0269 00546000
*       GO TO OPT075;               /* DECODE NEXT                   */ 00547000
         B     OPT075                                              0270 00548000
*     END;                                                         0271 00549000
*   GO TO OPT070;                   /* DECODE NEXT                   */ 00550000
         B     OPT070                                              0272 00551000
*OPT350:                            /* CONVERT ROUTINE               */ 00552000
*   WORK=EBCF0;                     /* INITIALIZE WORKAREA           */ 00553000
OPT350   MVC   WORK(8),EBCF0                                       0273 00554000
*   DO I=1 TO 6 BY 1;               /* SCAN FOR RT. PAREN            */ 00555000
         LA    @14,1                                               0274 00556000
         STH   @14,I                                               0274 00557000
@DL00274 DS    0H                                                  0275 00558000
*     IF INPUTBUF(I)=')' THEN       /* FOUND                         */ 00559000
         ALR   @14,R3                                              0275 00560000
         BCTR  @14,0                                               0275 00561000
         CLI   INPUTBUF(@14),C')'                                  0275 00562000
         BE    @RT00275                                            0275 00563000
*       GO TO OPT355;               /* YES,DECODE & CONVERT          */ 00564000
*     IF APFLAG='0'B THEN           /* IS THIS AN ALT PRTR           */ 00565000
         TM    APFLAG,B'01000000'                                  0277 00566000
         BNZ   @RF00277                                            0277 00567000
*       DO;                         /* NO,CONTINUE                   */ 00568000
*         IF INPUTBUF(I)>'9'|       /* IS CHAR                       */ 00569000
*             '0'>INPUTBUF(I) THEN  /* NUMERIC                       */ 00570000
         LH    @14,I                                               0279 00571000
         ALR   @14,R3                                              0279 00572000
         BCTR  @14,0                                               0279 00573000
         CLI   INPUTBUF(@14),C'9'                                  0279 00574000
         BH    @RT00279                                            0279 00575000
         LH    @14,I                                               0279 00576000
         ALR   @14,R3                                              0279 00577000
         BCTR  @14,0                                               0279 00578000
         CLI   INPUTBUF(@14),C'0'                                  0279 00579000
         BNL   @RF00279                                            0279 00580000
@RT00279 DS    0H                                                  0280 00581000
*           DO;                     /* NO,ERROR                      */ 00582000
*             R3=R3+I;              /* POINT TO ERROR                */ 00583000
         AH    R3,I                                                0281 00584000
*             GO TO OPT360;                                        0282 00585000
         B     OPT360                                              0282 00586000
*           END;                                                   0283 00587000
*       END;                                                       0284 00588000
@RF00279 DS    0H                                                  0285 00589000
*   END;                                                           0285 00590000
@RF00277 LA    @14,1                                               0285 00591000
         AH    @14,I                                               0285 00592000
         STH   @14,I                                               0285 00593000
         C     @14,@CF00449                                        0285 00594000
         BNH   @DL00274                                            0285 00595000
*   R3=R3+5;                        /* ERROR TOO MANY CHARS          */ 00596000
         AL    R3,@CF00351                                         0286 00597000
*   GO TO OPT800;                   /* ISSUE 115 ERROR MSG           */ 00598000
         B     OPT800                                              0287 00599000
*OPT355:                                                           0288 00600000
*   I=I-1;                          /* COMPUTE WORK AREA SUBSCR      */ 00601000
OPT355   LH    @14,I                                               0288 00602000
         BCTR  @14,0                                               0288 00603000
         STH   @14,I                                               0288 00604000
*   IF I=0 THEN                     /* NOTHING FOUND?                */ 00605000
         LTR   @14,@14                                             0289 00606000
         BZ    @RT00289                                            0289 00607000
*     GO TO OPT800;                 /* YES,ERROR                     */ 00608000
*   N=9-I;                          /* NUMBER OF CHARACTERS          */ 00609000
         LA    @10,9                                               0291 00610000
         SLR   @10,@14                                             0291 00611000
         STH   @10,N                                               0291 00612000
*   WORK(N:8)=INPUTBUF(1:I);        /* MOVE IN EBCDIC NUM            */ 00613000
         LA    @08,WORK-1(@10)                                     0292 00614000
         LCR   @10,@10                                             0292 00615000
         AL    @10,@CF00054                                        0292 00616000
         EX    @10,@SM00876                                        0292 00617000
*   R3=R3+I;                        /* INCR INPUT POINTER            */ 00618000
*                                                                  0293 00619000
         ALR   R3,@14                                              0293 00620000
*   /*****************************************************************/ 00621000
*   /*                                                               */ 00622000
*   /* ITACONV FROM(WORK)TO(WORKA)TYPE(EH)COUNT(8) INVOKED           */ 00623000
*   /*                                                               */ 00624000
*   /*****************************************************************/ 00625000
*                                                                  0294 00626000
*   DCL                                                            0294 00627000
*     1 ITATCPRM BDY(WORD),         /* CONVERT PARAMETER LIST        */ 00628000
*      2 * CHAR(4) INIT('0102F4F1'X),                              0294 00629000
*      2 ITATCFR PTR,               /* ADDRESS OF FROM FIELD         */ 00630000
*      2 ITATCTO PTR,               /* ADDRESS OF TO FIELD           */ 00631000
*      2 * BIT(8) INIT(0),          /* FLAGS FOR CONVERT MODULE      */ 00632000
*       3 ITATCTP BIT(1),           /* TYPE OF CONVERT REQUIRED      */ 00633000
*      2 ITATCNT FIXED(8);          /* NUMBER OF BYTES TO CONVERT    */ 00634000
*   ITATCFR=ADDR(WORK);             /* SET THE FROM ADDRESS          */ 00635000
         LA    @14,WORK                                            0295 00636000
         ST    @14,ITATCFR                                         0295 00637000
*   ITATCTO=ADDR(WORKA);            /* SET THE TO ADDRESS            */ 00638000
         LA    @14,WORKA                                           0296 00639000
         ST    @14,ITATCTO                                         0296 00640000
*   ITATCTP='0'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00641000
         NI    ITATCTP,B'01111111'                                 0297 00642000
*   ITATCNT=8;                      /* GIVE THE CONVERT BYTE COUNT   */ 00643000
         MVI   ITATCNT,X'08'                                       0298 00644000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00645000
         LA    R1,ITATCPRM                                         0299 00646000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00647000
         L     @15,@CV00814                                        0300 00648000
         BALR  @14,@15                                             0300 00649000
*   IF R15^=0 THEN                  /* ERROR CONVERTING              */ 00650000
         LTR   R15,R15                                             0301 00651000
         BNZ   @RT00301                                            0301 00652000
*     GO TO OPT800;                 /* YES,GO ISSUE 115 MSG          */ 00653000
*   IF APFLAG='1'B THEN             /* IS THIS AN AP ENTRY ENT       */ 00654000
         TM    APFLAG,B'01000000'                                  0303 00655000
         BO    @RT00303                                            0303 00656000
*     GO TO OPT370;                                                0304 00657000
*   HEXNUM=WORKA*16+12;             /* CONVERT TO                    */ 00658000
         L     @14,WORKA                                           0305 00659000
         SLL   @14,4                                               0305 00660000
         AL    @14,@CF00136                                        0305 00661000
         ST    @14,HEXNUM                                          0305 00662000
*   CVB(HEXNUM,HEXNUMA);            /* HEX                           */ 00663000
         XC    @TS00001(8),@TS00001                                0306 00664000
         MVC   @TS00001+4(4),HEXNUMA                               0306 00665000
         CVB   @14,@TS00001                                        0306 00666000
         ST    @14,HEXNUM                                          0306 00667000
*   IF HEXNUM>32767 THEN            /* NUM HAS TO FIT IN HALF        */ 00668000
         C     @14,@CF00817                                        0307 00669000
         BNH   @RF00307                                            0307 00670000
*     DO;                           /* IT DOESNT,ERROR               */ 00671000
*OPT360:                                                           0309 00672000
*       R3=R3-1;                    /* POINT TO ERROR                */ 00673000
OPT360   BCTR  R3,0                                                0309 00674000
*       GO TO OPT800;               /* ISSUE 115 MSG                 */ 00675000
         B     OPT800                                              0310 00676000
*     END;                                                         0311 00677000
*OPT370:                                                           0312 00678000
*   R3=R3+1;                        /* POINT TO ERROR CHAR           */ 00679000
@RF00307 DS    0H                                                  0312 00680000
OPT370   AL    R3,@CF00072                                         0312 00681000
*   GEN(BR   R11);                  /* RETURN TO CALLER              */ 00682000
         BR   R11                                                       00683000
*                                                                  0314 00684000
*   /*****************************************************************/ 00685000
*   /*                                                               */ 00686000
*   /* AP OPTION ENTRY                                               */ 00687000
*   /*                                                               */ 00688000
*   /*****************************************************************/ 00689000
*                                                                  0314 00690000
*OPT400:                                                           0314 00691000
*   IF $ALTPRTR='1'B|               /* IS THERE AN ACTIVE AP OR      */ 00692000
*       ($NOTDEV(2)='1'B&$ACQRED(2)='1'B)/* ONE WITH ERROR           */ 00693000
*     THEN                          /* IF EITHER DO                  */ 00694000
OPT400   TM    $ALTPRTR(WAPTR),B'00000010'                         0314 00695000
         BO    @RT00314                                            0314 00696000
         TM    $NOTDEV+68(WAPTR),B'11000000'                       0314 00697000
         BNO   @RF00314                                            0314 00698000
@RT00314 DS    0H                                                  0315 00699000
*     DO;                           /* YES CONTINUE                  */ 00700000
*       SYM=ADDR($SYSMN(2));        /* GET NAME FOR RELEASE          */ 00701000
         LA    @14,$SYSMN+68(,WAPTR)                               0316 00702000
         ST    @14,SYM                                             0316 00703000
*       R1=ADDR(RELPARM);           /* RELEASE PARM LIST             */ 00704000
         LA    R1,RELPARM                                          0317 00705000
*       CALL #EXIT;                 /* RELEASE PRESENT AP            */ 00706000
         L     @15,#EXITA(,WAPTR)                                  0318 00707000
         BALR  @14,@15                                             0318 00708000
*       IF R15^=0 THEN              /* ERROR ?                       */ 00709000
         LTR   R15,R15                                             0319 00710000
         BNZ   @RT00319                                            0319 00711000
*         GO TO OPT890;             /* YES                           */ 00712000
*     END;                                                         0321 00713000
*   $NOTDEV(2)='0'B;                /* NOT A TEST DEVICE             */ 00714000
@RF00314 NI    $NOTDEV+68(WAPTR),B'01111111'                       0322 00715000
*   $ALTPRTR='0'B;                  /* RESET AP BIT                  */ 00716000
*   $NEWAP='0'B;                    /* RESET NEW ALT PRTR FLAG       */ 00717000
         NI    $ALTPRTR(WAPTR),B'11111100'                         0324 00718000
*   $APNAME='';                     /* INITIALIZE ALT PRT NAME       */ 00719000
         MVI   $APNAME(WAPTR),C' '                                 0325 00720000
         MVC   $APNAME+1(7,WAPTR),$APNAME(WAPTR)                   0325 00721000
*   IF NO='1'B THEN                 /* AP SPECIFIED                  */ 00722000
         TM    NO,B'10000000'                                      0326 00723000
         BO    @RT00326                                            0326 00724000
*     GO TO OPT070;                 /* NO DECODE NEXT                */ 00725000
*   IF INPUTBUF(3)^='(' THEN        /* ALT PRINTER SPEC              */ 00726000
         CLI   INPUTBUF+2(R3),C'('                                 0328 00727000
         BE    @RF00328                                            0328 00728000
*     DO;                           /* NO                            */ 00729000
*       R3=R3+2;                    /* ERROR                         */ 00730000
         AL    R3,@CF00139                                         0330 00731000
*       GO TO OPT800;               /* ISSUE ERROR MSG               */ 00732000
         B     OPT800                                              0331 00733000
*     END;                                                         0332 00734000
*   R3=R3+3;                        /* PT TO 1ST CHAR OF NAME        */ 00735000
@RF00328 AL    R3,@CF00081                                         0333 00736000
*   $DEVCDSF(2)='00'X;              /* CDS DEVICE FLAGS              */ 00737000
*                                                                  0334 00738000
         MVI   $DEVCDSF+68(WAPTR),X'00'                            0334 00739000
*   /*****************************************************************/ 00740000
*   /*                                                               */ 00741000
*   /* INITIALIZE SYMBOLIC NAME FIELD                                */ 00742000
*   /*                                                               */ 00743000
*   /*****************************************************************/ 00744000
*                                                                  0335 00745000
*   $$SYMNME(2)=$$SYMNME(2)&&$$SYMNME(2);                          0335 00746000
         XC    $$SYMNME+68(8,WAPTR),$$SYMNME+68(WAPTR)             0335 00747000
*   I=1;                            /* SET SUBSCRIPT                 */ 00748000
         MVC   I(2),@CH00072                                       0336 00749000
*   IF INPUTBUF(1)>'Z' THEN         /* UNIT ADDRESS ?                */ 00750000
         CLI   INPUTBUF(R3),C'Z'                                   0337 00751000
         BNH   @RF00337                                            0337 00752000
*     DO;                           /* YES                           */ 00753000
*       APFLAG='1'B;                /* SET INT AP FLAG               */ 00754000
         OI    APFLAG,B'01000000'                                  0339 00755000
*       GEN(BAL  R11,OPT350);       /* CONVERT UNIT ADDR TO HEX      */ 00756000
         BAL  R11,OPT350                                                00757000
*       APFLAG='0'B;                /* RESET AP FLAG                 */ 00758000
         NI    APFLAG,B'10111111'                                  0341 00759000
*       IF NUM>4095 THEN            /* MORE THAN 3 HEX DIGITS ?      */ 00760000
         CLC   NUM(2),@CH00824                                     0342 00761000
         BNH   @RF00342                                            0342 00762000
*         DO;                       /* YES,ERROR                     */ 00763000
*           R3=R3-2;                /* BACK UP TO LAST DIGIT         */ 00764000
         BCTR  R3,0                                                0344 00765000
         BCTR  R3,0                                                0344 00766000
*           GO TO OPT800;           /* ERROR HANDLING                */ 00767000
         B     OPT800                                              0345 00768000
*         END;                                                     0346 00769000
*       $APNAME(1:I)=WORK(N:8);     /* MOVE AP UNIT ADR              */ 00770000
@RF00342 LH    @14,I                                               0347 00771000
         BCTR  @14,0                                               0347 00772000
         LH    @10,N                                               0347 00773000
         LA    @08,WORK-1(@10)                                     0347 00774000
         EX    @14,@SM00880                                        0347 00775000
*       $DEVUNAD(2)=WORKA;          /* UNIT ADDR TO DEV TBLE         */ 00776000
         MVC   $DEVUNAD+68(4,WAPTR),WORKA                          0348 00777000
*       GO TO OPT450;               /* GO INQUIRE                    */ 00778000
         B     OPT450                                              0349 00779000
*     END;                                                         0350 00780000
*OPT420:                                                           0351 00781000
*   IF INPUTBUF(I)='$'|             /* CHECK FOR                     */ 00782000
*       INPUTBUF(I)='@'|            /* LEGAL                         */ 00783000
*       INPUTBUF(I)='#'|            /* SYMBOLIC                      */ 00784000
*       INPUTBUF(I)>='A' THEN       /* NAME                          */ 00785000
@RF00337 DS    0H                                                  0351 00786000
OPT420   LH    @14,I                                               0351 00787000
         ALR   @14,R3                                              0351 00788000
         BCTR  @14,0                                               0351 00789000
         CLI   INPUTBUF(@14),C'$'                                  0351 00790000
         BE    @RT00351                                            0351 00791000
         LH    @14,I                                               0351 00792000
         ALR   @14,R3                                              0351 00793000
         BCTR  @14,0                                               0351 00794000
         CLI   INPUTBUF(@14),C'@'                                  0351 00795000
         BE    @RT00351                                            0351 00796000
         LH    @14,I                                               0351 00797000
         ALR   @14,R3                                              0351 00798000
         BCTR  @14,0                                               0351 00799000
         CLI   INPUTBUF(@14),C'#'                                  0351 00800000
         BE    @RT00351                                            0351 00801000
         LH    @14,I                                               0351 00802000
         ALR   @14,R3                                              0351 00803000
         BCTR  @14,0                                               0351 00804000
         CLI   INPUTBUF(@14),C'A'                                  0351 00805000
         BL    @RF00351                                            0351 00806000
@RT00351 DS    0H                                                  0352 00807000
*     DO;                                                          0352 00808000
*       I=I+1;                      /* PT TO NEXT CHAR               */ 00809000
         LA    @14,1                                               0353 00810000
         AH    @14,I                                               0353 00811000
         STH   @14,I                                               0353 00812000
*       IF I>9 THEN                 /* MORE THAN 8 CHARS             */ 00813000
         C     @14,@CF00087                                        0354 00814000
         BH    @RT00354                                            0354 00815000
*         GO TO OPT430;             /* YES,ERROR                     */ 00816000
*       GO TO OPT420;               /* CHK NEXT CHAR                 */ 00817000
         B     OPT420                                              0356 00818000
*     END;                                                         0357 00819000
*   IF INPUTBUF(I)^=')'|            /* IF NOT END OF FIELD OR        */ 00820000
*       I=1 THEN                    /* NO NAME SPECIFIED             */ 00821000
@RF00351 LH    @14,I                                               0358 00822000
         ALR   @14,R3                                              0358 00823000
         BCTR  @14,0                                               0358 00824000
         CLI   INPUTBUF(@14),C')'                                  0358 00825000
         BNE   @RT00358                                            0358 00826000
         LH    @14,I                                               0358 00827000
         C     @14,@CF00072                                        0358 00828000
         BNE   @RF00358                                            0358 00829000
@RT00358 DS    0H                                                  0359 00830000
*     DO;                           /* ERROR                         */ 00831000
*OPT430:                                                           0360 00832000
*       R3=R3+I-1;                  /* POINT TO ERROR                */ 00833000
OPT430   LR    @14,R3                                              0360 00834000
         AH    @14,I                                               0360 00835000
         BCTR  @14,0                                               0360 00836000
         LR    R3,@14                                              0360 00837000
*       GO TO OPT800;               /* WRITE ERROR MSG               */ 00838000
         B     OPT800                                              0361 00839000
*     END;                                                         0362 00840000
*   $DEVCDSF(2)='0A'X;              /* CDS DEVICE FLAGS              */ 00841000
@RF00358 MVI   $DEVCDSF+68(WAPTR),X'0A'                            0363 00842000
*   $$SYMNME(2)='';                 /* INIT SYM NAME                 */ 00843000
         MVI   $$SYMNME+68(WAPTR),C' '                             0364 00844000
         MVC   $$SYMNME+69(7,WAPTR),$$SYMNME+68(WAPTR)             0364 00845000
*   I=I-1;                          /* RESET SUBSCRIPT               */ 00846000
         LH    @14,I                                               0365 00847000
         BCTR  @14,0                                               0365 00848000
         STH   @14,I                                               0365 00849000
*   $$SYMNME(2,1:I)=INPUTBUF(1:I);  /* MOVE NAME TO DEV TBL          */ 00850000
         LR    @10,@14                                             0366 00851000
         BCTR  @10,0                                               0366 00852000
         EX    @10,@SM00882                                        0366 00853000
*   $APNAME=$$SYMNME(2);            /* ALSO MOVE TO APNAME           */ 00854000
         MVC   $APNAME(8,WAPTR),$$SYMNME+68(WAPTR)                 0367 00855000
*   R3=R3+I+1;                      /* INCR INPUT PTR                */ 00856000
         ALR   @14,R3                                              0368 00857000
         AL    @14,@CF00072                                        0368 00858000
         LR    R3,@14                                              0368 00859000
*OPT450:                                                           0369 00860000
*   CDSADDR=ADDR($DEVTBLE(2));      /* CDS FOR ACQ/VER               */ 00861000
OPT450   LA    @14,$DEVTBLE+68(,WAPTR)                             0369 00862000
         ST    @14,CDSADDR                                         0369 00863000
*   R1=ADDR(ACQPARM);               /* ADDRESS OF ACQ PARM LST       */ 00864000
         LA    R1,ACQPARM                                          0370 00865000
*   CALL ISTSC030;                  /* CALL ACQUISITION              */ 00866000
         L     @15,@CV00836                                        0371 00867000
         BALR  @14,@15                                             0371 00868000
*   IF R15^=0 THEN                  /* ERROR                         */ 00869000
         LTR   R15,R15                                             0372 00870000
         BNZ   @RT00372                                            0372 00871000
*     GO TO OPT890;                 /* YES                           */ 00872000
*   IF SYMNAME=$SYSMN(1) THEN       /* ALT PRT = CONTROL TERM        */ 00873000
         L     @14,SYMPTR+2376(,WAPTR)                             0374 00874000
         CLC   SYMNAME(8,@14),$SYSMN(WAPTR)                        0374 00875000
         BNE   @RF00374                                            0374 00876000
*     DO;                           /* YES                           */ 00877000
*OPT460:                                                           0376 00878000
*       R3=R3-2;                    /* PT TO ERROR                   */ 00879000
OPT460   BCTR  R3,0                                                0376 00880000
         BCTR  R3,0                                                0376 00881000
*       GO TO OPT800;               /* ERROR HANDLING                */ 00882000
         B     OPT800                                              0377 00883000
*     END;                                                         0378 00884000
*   $MSGOTSD(2)=0;                  /* CLCAB WORD FOR QUE            */ 00885000
@RF00374 SLR   @14,@14                                             0379 00886000
         ST    @14,$MSGOTSD+68(,WAPTR)                             0379 00887000
*   $DEVFEAT(2)=DEVCHAR;            /* MOVE DEV CHARS FOR 200        */ 00888000
         L     @14,DVCHRPTR+2376(,WAPTR)                           0380 00889000
         MVC   $DEVFEAT+68(4,WAPTR),DEVCHAR(@14)                   0380 00890000
*   R1=DVCHRPTR;                    /* POINT TO PARM LIST            */ 00891000
         LR    R1,@14                                              0381 00892000
*   CALL I00C0200;                  /* CAN DEV BE AN ALT PRTR        */ 00893000
         L     @15,@CV00839                                        0382 00894000
         BALR  @14,@15                                             0382 00895000
*   IF R15>4 THEN                   /* CHECK R/C                     */ 00896000
         C     R15,@CF00068                                        0383 00897000
         BH    @RT00383                                            0383 00898000
*     GO TO OPT800;                 /* CANT BE ALT PRTR              */ 00899000
*   $SYSMN(2)=SYMNAME;              /* MOVE SYM NAME TOO             */ 00900000
         LA    @14,2376                                            0385 00901000
         ALR   @14,WAPTR                                           0385 00902000
         L     @10,SYMPTR(,@14)                                    0385 00903000
         MVC   $SYSMN+68(8,WAPTR),SYMNAME(@10)                     0385 00904000
*   $LINENME(2)=NAMERN;             /* MOVE NAME TO DEF TABLE        */ 00905000
         MVC   $LINENME+68(8,WAPTR),NAMERN(@14)                    0386 00906000
*   $DEVFLG5(2)=FLG5;               /* MOVE DEVICE FLAGS             */ 00907000
         MVC   $DEVFLG5+68(1,WAPTR),FLG5(@14)                      0387 00908000
*   $NEWAP='1'B;                    /* SET NEW AP FLAG               */ 00909000
         OI    $NEWAP(WAPTR),B'00000001'                           0388 00910000
*   $APRQPER='1'B;                  /* AP REQ. PERMISSION            */ 00911000
         OI    $APRQPER(WAPTR),B'01000000'                         0389 00912000
*   APFLAG='0'B;                    /* TURN OFF INT FLAG             */ 00913000
         NI    APFLAG,B'10111111'                                  0390 00914000
*   GO TO OPT075;                   /* DECODE NEXT ENTRY             */ 00915000
         B     OPT075                                              0391 00916000
*OPT800:                                                           0392 00917000
*                                                                  0392 00918000
*   /*****************************************************************/ 00919000
*   /*                                                               */ 00920000
*   /* ERROR HANDLING                                                */ 00921000
*   /*                                                               */ 00922000
*   /*****************************************************************/ 00923000
*                                                                  0392 00924000
*   R4=$SLASHAD(2)+1;               /* ADDR OF 1ST INPUT CHAR        */ 00925000
OPT800   LA    R4,1                                                0392 00926000
         AL    R4,$SLASHAD+4(,WAPTR)                               0392 00927000
*   IF R3>$SLASHAD(3) THEN          /* BEYOND OPTION FIELD           */ 00928000
         L     @14,$SLASHAD+8(,WAPTR)                              0393 00929000
         CR    R3,@14                                              0393 00930000
         BNH   @RF00393                                            0393 00931000
*     R3=$SLASHAD(3);               /* YES,RESET POINTER             */ 00932000
         LR    R3,@14                                              0394 00933000
*   R6=R3;                          /* SET ERROR INPUT PTR           */ 00934000
@RF00393 LR    R6,R3                                               0395 00935000
*   $INBUFR(1:8)=' ';               /* BLK OUT WORK AREA             */ 00936000
         MVI   $INBUFR+1(WAPTR),C' '                               0396 00937000
         MVC   $INBUFR+2(6,WAPTR),$INBUFR+1(WAPTR)                 0396 00938000
         MVI   $INBUFR(WAPTR),C' '                                 0396 00939000
*   DO I=8 TO 1 BY-1;               /* SCAN INPUT                    */ 00940000
         LA    @14,8                                               0397 00941000
         STH   @14,I                                               0397 00942000
@DL00397 DS    0H                                                  0398 00943000
*     $INBUFR(I)=ERRINPUT(1);       /* MOVE ERROR TO SUB FIELD       */ 00944000
         ALR   @14,WAPTR                                           0398 00945000
         MVC   $INBUFR-1(1,@14),ERRINPUT(R6)                       0398 00946000
*     IF R6=R4 THEN                 /* END OF OPT FIELD              */ 00947000
         CR    R6,R4                                               0399 00948000
         BE    @RT00399                                            0399 00949000
*       GO TO OPT820;               /* YES WRITE ERROR MSG           */ 00950000
*     R6=R6-1;                      /* DECR INPUT PTR                */ 00951000
         BCTR  R6,0                                                0401 00952000
*   END;                                                           0402 00953000
         LH    @10,I                                               0402 00954000
         BCTR  @10,0                                               0402 00955000
         LR    @14,@10                                             0402 00956000
         STH   @14,I                                               0402 00957000
         LTR   @14,@14                                             0402 00958000
         BP    @DL00397                                            0402 00959000
*OPT820:                                                           0403 00960000
*                                                                  0403 00961000
*   /*****************************************************************/ 00962000
*   /*                                                               */ 00963000
*   /* TCEC MSGN(115)SUB(YES) INVOKED                                */ 00964000
*   /*                                                               */ 00965000
*   /*****************************************************************/ 00966000
*                                                                  0403 00967000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00968000
OPT820   OI    $TCECM(WAPTR),B'00000001'                           0403 00969000
*   R1=ADDR($TCA12);                /* SET UP PARM LIST $TR          */ 00970000
         LA    R1,$TCA12                                           0404 00971000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00972000
         L     @15,#EXITA(,WAPTR)                                  0405 00973000
         BALR  @14,@15                                             0405 00974000
*   DCL                                                            0406 00975000
*     1 $TCA12,                     /* TCEC PARM LIST                */ 00976000
*      2 $TCB12 FIXED(32) INIT(115),/* MSG NUMBER                    */ 00977000
*      2 $TCC12 FIXED(32) INIT(0),  /* INCT LEN                      */ 00978000
*      2 $TCD12 BIT(8) INIT('10000000'B),/* FLAG                     */ 00979000
*      2 $TCE12 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK ISSUE ERROR    00980000
*                                      MSG                           */ 00981000
*OPT850:                                                           0407 00982000
*   $TESTOPT=A33SAVE(1);            /* RESTORE                       */ 00983000
OPT850   MVC   $TESTOPT(1,WAPTR),A33SAVE                           0407 00984000
*   $ERROPT=A33SAVE(2);             /* OLD                           */ 00985000
         MVC   $ERROPT(1,WAPTR),A33SAVE+1                          0408 00986000
*   $EXECFLG=A33SAVE(3);            /* OPTIONS                       */ 00987000
         MVC   $EXECFLG(1,WAPTR),A33SAVE+2                         0409 00988000
*   $OLTFLGS=A33SAVE(4);            /* AND                           */ 00989000
         MVC   $OLTFLGS(1,WAPTR),A33SAVE+3                         0410 00990000
*   $PRNTLVL=A33SAVE(5);            /* CONSTANTS                     */ 00991000
         MVC   $PRNTLVL(1,WAPTR),A33SAVE+4                         0411 00992000
*   $ERRCNTA=A33SAVE(6:9);          /*                               */ 00993000
         MVC   $ERRCNTA(2,WAPTR),A33SAVE+7                         0412 00994000
*   $TLCNT=A33SAVE(8:9);            /*                               */ 00995000
         MVC   $TLCNT(2,WAPTR),A33SAVE+7                           0413 00996000
*   $FLAG9=A33SAVE(10);             /*                               */ 00997000
         MVC   $FLAG9(1,WAPTR),A33SAVE+9                           0414 00998000
*   $NEWAP='0'B;                    /* RESET ALT PRT FLAG            */ 00999000
         NI    $NEWAP(WAPTR),B'11111110'                           0415 01000000
*OPT890:                                                           0416 01001000
*   $OPTERR='1'B;                   /* INDICATE ERROR                */ 01002000
OPT890   OI    $OPTERR(WAPTR),B'00000100'                          0416 01003000
*   IF $ALTPRTR='0'B&               /* ALT PRINTER                   */ 01004000
*       $NEWAP='0'B THEN            /* OR NEW ALT PRINTER            */ 01005000
         TM    $ALTPRTR(WAPTR),B'00000011'                         0417 01006000
         BNZ   @RF00417                                            0417 01007000
*     DO;                                                          0418 01008000
*       $DEVTBLE(2)=$DEVTBLE(2)&&$DEVTBLE(2);/* CLEAR ENTRY          */ 01009000
         XC    $DEVTBLE+68(68,WAPTR),$DEVTBLE+68(WAPTR)            0419 01010000
*       $NOTDEV(2)='1'B;            /* SET NOT DEVICE FOR AP         */ 01011000
         OI    $NOTDEV+68(WAPTR),B'10000000'                       0420 01012000
*     END;                                                         0421 01013000
*OPT895:                            /* SCAN FOR NEXT ENTRY           */ 01014000
*   IF INPUTBUF(1)=',' THEN         /* REACHED NEXT ENTRY?           */ 01015000
@RF00417 DS    0H                                                  0422 01016000
OPT895   CLI   INPUTBUF(R3),C','                                   0422 01017000
         BNE   @RF00422                                            0422 01018000
*     DO;                           /* YES CONTINUE                  */ 01019000
*       R3=R3+1;                    /* POINT TO NEXT ENTRY           */ 01020000
         AL    R3,@CF00072                                         0424 01021000
*       GO TO OPT050;               /* CONTINUE DECODING             */ 01022000
         B     OPT050                                              0425 01023000
*     END;                                                         0426 01024000
*   IF INPUTBUF(1)='/' THEN         /* END OF INPUT?                 */ 01025000
@RF00422 CLI   INPUTBUF(R3),C'/'                                   0427 01026000
         BE    @RT00427                                            0427 01027000
*     GO TO OPT900;                 /* YES,RETURN TO COMM INT        */ 01028000
*   R3=R3+1;                        /* UPDATE POINTER                */ 01029000
         AL    R3,@CF00072                                         0429 01030000
*   GO TO OPT895;                   /* LOOK FOR END OF ENTRY         */ 01031000
         B     OPT895                                              0430 01032000
*OPT900:                                                           0431 01033000
*   R13=SVEIC003(2);                /* MY SAVE PTR                   */ 01034000
OPT900   L     R13,SVEIC003+4(,WAPTR)                              0431 01035000
*   RETURN;                         /* GO TO COMM INT                */ 01036000
@EL00001 DS    0H                                                  0432 01037000
@EF00001 DS    0H                                                  0432 01038000
@ER00001 LM    @14,@12,12(@13)                                     0432 01039000
         BR    @14                                                 0432 01040000
*   DO;                             /* ATDSPLY                       */ 01041000
*   END;                            /* ATDSPLY                       */ 01042000
*   END ISTIC005;                                                  0435 01043000
@DATA    DS    0H                                                       01044000
@CH00799 DC    H'500'                                                   01045000
@CH00824 DC    H'4095'                                                  01046000
@SM00861 MVC   $INBUFR(0,WAPTR),$EXTA+1(WAPTR)                          01047000
@SM00871 MVC   $EXTA+1(0,WAPTR),INPUTBUF(R3)                            01048000
@SM00876 MVC   0(0,@08),INPUTBUF(R3)                                    01049000
@SM00880 MVC   $APNAME(0,WAPTR),0(@08)                                  01050000
@SM00882 MVC   $$SYMNME+68(0,WAPTR),INPUTBUF(R3)                        01051000
         DS    0F                                                       01052000
         DS    0F                                                       01053000
@CF00072 DC    F'1'                                                     01054000
@CH00072 EQU   @CF00072+2                                               01055000
@CF00139 DC    F'2'                                                     01056000
@CF00081 DC    F'3'                                                     01057000
@CF00068 DC    F'4'                                                     01058000
@CF00351 DC    F'5'                                                     01059000
@CF00449 DC    F'6'                                                     01060000
@CF00054 DC    F'8'                                                     01061000
@CF00087 DC    F'9'                                                     01062000
@CF00136 DC    F'12'                                                    01063000
@CF00753 DC    F'54'                                                    01064000
@CF00817 DC    F'32767'                                                 01065000
@CF00875 DC    XL4'0000FFFF'                                            01066000
@CV00814 DC    V(ISTSC021)                                              01067000
@CV00836 DC    V(ISTSC030)                                              01068000
@CV00839 DC    V(I00C0200)                                              01069000
         DS    0D                                                       01070000
RCAPTR   DS    A                                                        01071000
         DS    0D                                                       01072000
@TS00001 DS    CL8                                                      01073000
@CC00779 DC    C'EXT='                                                  01074000
@CC00764 DC    C'TL'                                                    01075000
@CC00767 DC    C'EL'                                                    01076000
@CC00769 DC    C'PP'                                                    01077000
@CC00771 DC    C'AP'                                                    01078000
@CC00773 DC    C'FE'                                                    01079000
@CC00774 DC    C'MI'                                                    01080000
@CC00775 DC    C'EP'                                                    01081000
@CC00776 DC    C'CP'                                                    01082000
@CC00777 DC    C'PR'                                                    01083000
@CC00778 DC    C'TR'                                                    01084000
A33OPTN  DC    CL44'NTL,NEL,NPP,NFE,NMI,NEP,NCP,NPR,NTR,NAP'            01085000
@NM00055 DS    CL90                                                     01086000
         ORG   @NM00055                                                 01087000
N        DS    FL2                                                      01088000
I        DS    FL2                                                      01089000
EXTNUMFX DS    FL4                                                      01090000
         ORG   EXTNUMFX                                                 01091000
@NM00056 DS    CL3                                                      01092000
EXTNUMCH DS    CL1                                                      01093000
         ORG   @NM00055+8                                               01094000
@NM00057 DS    CL12                                                     01095000
         ORG   @NM00057                                                 01096000
WORK     DS    CL8                                                      01097000
WORKA    DS    CL4                                                      01098000
         ORG   WORKA                                                    01099000
@NM00058 DS    CL2                                                      01100000
NUM      DS    CL2                                                      01101000
         ORG   @NM00055+20                                              01102000
HEXNUM   DS    FL4                                                      01103000
         ORG   HEXNUM                                                   01104000
HEXNUMA  DS    CL4                                                      01105000
         ORG   @NM00055+24                                              01106000
OPTS     DS    CL44                                                     01107000
         ORG   OPTS                                                     01108000
EBTL     DS    CL1                                                      01109000
@NM00059 DS    CL3                                                      01110000
EBEL     DS    CL1                                                      01111000
@NM00060 DS    CL3                                                      01112000
EBPP     DS    CL1                                                      01113000
@NM00061 DS    CL3                                                      01114000
EBFE     DS    CL1                                                      01115000
@NM00062 DS    CL3                                                      01116000
EBMI     DS    CL1                                                      01117000
@NM00063 DS    CL3                                                      01118000
EBEP     DS    CL1                                                      01119000
@NM00064 DS    CL3                                                      01120000
EBCP     DS    CL1                                                      01121000
@NM00065 DS    CL3                                                      01122000
EBPR     DS    CL1                                                      01123000
@NM00066 DS    CL3                                                      01124000
EBTR     DS    CL1                                                      01125000
@NM00067 DS    CL3                                                      01126000
EBAP     DS    CL1                                                      01127000
@NM00068 DS    CL3                                                      01128000
         ORG   @NM00055+68                                              01129000
A33SAVE  DS    CL11                                                     01130000
INTFLAGS DS    CL1                                                      01131000
         ORG   INTFLAGS                                                 01132000
NO       DS    BL1                                                      01133000
APFLAG   EQU   INTFLAGS+0                                               01134000
@NM00069 EQU   INTFLAGS+0                                               01135000
         ORG   @NM00055+90                                              01136000
         DS    CL2                                                      01137000
RELPARM  DS    CL9                                                      01138000
         ORG   RELPARM                                                  01139000
@NM00070 DC    X'0102F3F1'                                              01140000
SYM      DS    AL4                                                      01141000
@NM00071 DC    B'10000000'                                              01142000
         ORG   RELPARM+9                                                01143000
         DS    CL3                                                      01144000
ACQPARM  DS    CL5                                                      01145000
         ORG   ACQPARM                                                  01146000
CDSADDR  DS    AL4                                                      01147000
@NM00072 DC    B'00100000'                                              01148000
         ORG   ACQPARM+5                                                01149000
EBCF0    DC    CL8'00000000'                                            01150000
         DS    CL3                                                      01151000
$TCA09   DS    CL13                                                     01152000
         ORG   $TCA09                                                   01153000
$TCB09   DC    A(107)                                                   01154000
$TCC09   DC    A(0)                                                     01155000
$TCD09   DC    B'10000000'                                              01156000
$TCE09   DC    X'FFFFFFFF'                                              01157000
         ORG   $TCA09+13                                                01158000
         DS    CL3                                                      01159000
$TCA10   DS    CL13                                                     01160000
         ORG   $TCA10                                                   01161000
$TCB10   DC    A(327)                                                   01162000
$TCC10   DC    A(0)                                                     01163000
$TCD10   DC    B'10000000'                                              01164000
$TCE10   DC    X'FFFFFFFF'                                              01165000
         ORG   $TCA10+13                                                01166000
         DS    CL3                                                      01167000
ITATCPRM DS    CL14                                                     01168000
         ORG   ITATCPRM                                                 01169000
@NM00074 DC    X'0102F4F1'                                              01170000
ITATCFR  DS    AL4                                                      01171000
ITATCTO  DS    AL4                                                      01172000
@NM00075 DC    AL1(0)                                                   01173000
         ORG   @NM00075                                                 01174000
ITATCTP  DS    BL1                                                      01175000
         ORG   ITATCPRM+13                                              01176000
ITATCNT  DS    FL1                                                      01177000
         ORG   ITATCPRM+14                                              01178000
         DS    CL2                                                      01179000
$TCA12   DS    CL13                                                     01180000
         ORG   $TCA12                                                   01181000
$TCB12   DC    A(115)                                                   01182000
$TCC12   DC    A(0)                                                     01183000
$TCD12   DC    B'10000000'                                              01184000
$TCE12   DC    X'FFFFFFFF'                                              01185000
         ORG   $TCA12+13                                                01186000
         DS    CL3                                                      01187000
PATCH    DC    15F'0'                                                   01188000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01189000
@01      EQU   01                                                       01190000
@02      EQU   02                                                       01191000
@03      EQU   03                                                       01192000
@04      EQU   04                                                       01193000
@05      EQU   05                                                       01194000
@06      EQU   06                                                       01195000
@07      EQU   07                                                       01196000
@08      EQU   08                                                       01197000
@09      EQU   09                                                       01198000
@10      EQU   10                                                       01199000
@11      EQU   11                                                       01200000
@12      EQU   12                                                       01201000
@13      EQU   13                                                       01202000
@14      EQU   14                                                       01203000
@15      EQU   15                                                       01204000
WAPTR    EQU   @02                                                      01205000
R1       EQU   @01                                                      01206000
R2       EQU   @02                                                      01207000
R3       EQU   @03                                                      01208000
R4       EQU   @04                                                      01209000
R6       EQU   @06                                                      01210000
R9       EQU   @09                                                      01211000
R11      EQU   @11                                                      01212000
R13      EQU   @13                                                      01213000
R15      EQU   @15                                                      01214000
$RCAAREA EQU   0                                                        01215000
$POINTER EQU   $RCAAREA+100                                             01216000
$TRTBLA  EQU   $POINTER+124                                             01217000
$CONSTNT EQU   $RCAAREA+244                                             01218000
$RCAFLG  EQU   $RCAAREA+604                                             01219000
TOLTEPWA EQU   0                                                        01220000
$SCTTBLE EQU   TOLTEPWA                                                 01221000
$ERRLPCT EQU   $SCTTBLE                                                 01222000
$TESTOPT EQU   $SCTTBLE+2                                               01223000
$NOPRT   EQU   $TESTOPT                                                 01224000
$INDEFLP EQU   $TESTOPT                                                 01225000
$FSTCOMM EQU   $TESTOPT                                                 01226000
$ERROPT  EQU   $SCTTBLE+3                                               01227000
$ALTPRNT EQU   $ERROPT                                                  01228000
$NOCNTRL EQU   $ERROPT                                                  01229000
$NERRPRT EQU   $ERROPT                                                  01230000
$LOOPERR EQU   $ERROPT                                                  01231000
$LOOPTST EQU   $ERROPT                                                  01232000
$PDEVFLG EQU   $SCTTBLE+10                                              01233000
$CDSFLGS EQU   $SCTTBLE+11                                              01234000
$CDS8T19 EQU   $SCTTBLE+20                                              01235000
$EXECFLG EQU   $SCTTBLE+33                                              01236000
$ERRCNT  EQU   $EXECFLG                                                 01237000
$OLTFLGS EQU   $SCTTBLE+36                                              01238000
$MANINTV EQU   $OLTFLGS                                                 01239000
$TRACE   EQU   $OLTFLGS                                                 01240000
$OLTFLG2 EQU   $SCTTBLE+37                                              01241000
$TOTFLG1 EQU   $SCTTBLE+38                                              01242000
$ROUTMSK EQU   $SCTTBLE+40                                              01243000
$CDA     EQU   TOLTEPWA+100                                             01244000
$SLASHAD EQU   $CDA+32                                                  01245000
$RCA     EQU   $CDA+44                                                  01246000
$OLTPTR  EQU   $CDA+52                                                  01247000
$LOWADDR EQU   $OLTPTR                                                  01248000
$HIMOREC EQU   $CDA+60                                                  01249000
$TLCNT   EQU   $CDA+100                                                 01250000
$ERRCNTA EQU   $CDA+102                                                 01251000
$PRNTLVL EQU   $CDA+104                                                 01252000
$COMMFLG EQU   TOLTEPWA+224                                             01253000
$FLAG1   EQU   $COMMFLG                                                 01254000
$OLTACT  EQU   $FLAG1                                                   01255000
$FLAG2   EQU   $COMMFLG+1                                               01256000
$FLAG3   EQU   $COMMFLG+2                                               01257000
$OPTERR  EQU   $FLAG3                                                   01258000
$ALTPRTR EQU   $FLAG3                                                   01259000
$NEWAP   EQU   $FLAG3                                                   01260000
$FLAG4   EQU   $COMMFLG+3                                               01261000
$APRQPER EQU   $FLAG4                                                   01262000
$FLAG5   EQU   $COMMFLG+4                                               01263000
$EOJ     EQU   $FLAG5                                                   01264000
$CANCEL  EQU   $EOJ                                                     01265000
$FLAG6   EQU   $COMMFLG+5                                               01266000
$ABNDBIT EQU   $FLAG6                                                   01267000
$FLAG7   EQU   $COMMFLG+6                                               01268000
$FLAG8   EQU   $COMMFLG+7                                               01269000
$TCECM   EQU   $FLAG8                                                   01270000
$FLAG9   EQU   $COMMFLG+8                                               01271000
$FLAG10  EQU   $COMMFLG+9                                               01272000
$FLAG11  EQU   $COMMFLG+10                                              01273000
$FLAG12  EQU   $COMMFLG+11                                              01274000
$OPTMSG  EQU   $FLAG12                                                  01275000
$FLAG13  EQU   $COMMFLG+12                                              01276000
$DEVTBLE EQU   TOLTEPWA+240                                             01277000
$DEVCDS  EQU   $DEVTBLE                                                 01278000
$DEVUNAD EQU   $DEVCDS                                                  01279000
@NM00039 EQU   $DEVUNAD+2                                               01280000
$DEVFEAT EQU   $DEVCDS+4                                                01281000
$DEVCDSF EQU   $DEVCDS+9                                                01282000
$DEVSDCF EQU   $DEVCDS+10                                               01283000
$$SYMNME EQU   $DEVCDS+12                                               01284000
$MSGOTSD EQU   $$SYMNME                                                 01285000
$DEVFLG1 EQU   $DEVTBLE+20                                              01286000
$EVNCPLT EQU   $DEVFLG1                                                 01287000
$ATTNEXP EQU   $DEVFLG1                                                 01288000
$INTOCC  EQU   $DEVFLG1                                                 01289000
$DEVFLG2 EQU   $DEVTBLE+21                                              01290000
$DEVTECB EQU   $DEVTBLE+22                                              01291000
$OPIS    EQU   $DEVTECB                                                 01292000
$OPND    EQU   $DEVTECB+2                                               01293000
$DEVFLG3 EQU   $DEVTBLE+27                                              01294000
$NOTDEV  EQU   $DEVFLG3                                                 01295000
$ACQRED  EQU   $DEVFLG3                                                 01296000
$SIOFLG  EQU   $DEVFLG3                                                 01297000
$SYSMN   EQU   $DEVTBLE+28                                              01298000
$IFTOUT  EQU   $DEVTBLE+36                                              01299000
$DEVSESP EQU   $IFTOUT                                                  01300000
$SSCPDAF EQU   $IFTOUT+6                                                01301000
$LDNCBPT EQU   $DEVTBLE+48                                              01302000
$RNINFO  EQU   $DEVTBLE+56                                              01303000
$LINENME EQU   $RNINFO                                                  01304000
$DEVFLG5 EQU   $RNINFO+8                                                01305000
$DEVFLG4 EQU   $DEVTBLE+65                                              01306000
$SLTBL   EQU   TOLTEPWA+1468                                            01307000
$RUNTEST EQU   $SLTBL+13                                                01308000
$TESTFLG EQU   $SLTBL+21                                                01309000
$SECLST  EQU   $SLTBL+22                                                01310000
$INBUFR  EQU   TOLTEPWA+2104                                            01311000
$EXTA    EQU   TOLTEPWA+2320                                            01312000
$WORK    EQU   TOLTEPWA+2376                                            01313000
#EXITA   EQU   TOLTEPWA+2632                                            01314000
$CCOMDAT EQU   TOLTEPWA+2644                                            01315000
$CFLGS   EQU   $CCOMDAT+16                                              01316000
$24FEMSG EQU   TOLTEPWA+2681                                            01317000
$24CATMG EQU   $24FEMSG+11                                              01318000
$APNAME  EQU   TOLTEPWA+2704                                            01319000
@NM00048 EQU   TOLTEPWA+2776                                            01320000
$OUNTPTR EQU   @NM00048+4                                               01321000
$NSPTR   EQU   $OUNTPTR                                                 01322000
$NSCNT   EQU   @NM00048+10                                              01323000
$ENXX    EQU   @NM00048+15                                              01324000
$IMITX   EQU   $ENXX                                                    01325000
SVESC033 EQU   TOLTEPWA+3160                                            01326000
SVECC013 EQU   TOLTEPWA+3232                                            01327000
SVEIC003 EQU   TOLTEPWA+3592                                            01328000
SVESC022 EQU   TOLTEPWA+3736                                            01329000
SVECC011 EQU   TOLTEPWA+4024                                            01330000
#EXIT    EQU   0                                                        01331000
@NM00051 EQU   0                                                        01332000
RTNDISP  EQU   @NM00051+10                                              01333000
INST     EQU   @NM00051+12                                              01334000
$NEWSPRF EQU   0                                                        01335000
#FLAGS   EQU   $NEWSPRF+16                                              01336000
$COUNT   EQU   $NEWSPRF+18                                              01337000
INPUTBUF EQU   0                                                        01338000
@NM00073 EQU   0                                                        01339000
SYMPTR   EQU   @NM00073                                                 01340000
DVCHRPTR EQU   @NM00073+4                                               01341000
NAMERN   EQU   @NM00073+8                                               01342000
FLG5     EQU   @NM00073+16                                              01343000
SYMNAME  EQU   0                                                        01344000
DEVCHAR  EQU   0                                                        01345000
ERRINPUT EQU   0                                                        01346000
BACKSAVE EQU   0                                                        01347000
$TRTBL   EQU   0                                                        01348000
OLTENTRY EQU   0                                                        01349000
SVECC012 EQU   SVESC022                                                 01350000
SVEIC00A EQU   SVEIC003                                                 01351000
SVEIC004 EQU   SVEIC003                                                 01352000
SVEIC005 EQU   SVEIC003                                                 01353000
SVESC02A EQU   SVESC022                                                 01354000
SVESC02B EQU   SVESC022                                                 01355000
SVESC02D EQU   SVESC022                                                 01356000
SVESC02E EQU   SVESC022                                                 01357000
SVESC02F EQU   SVECC013                                                 01358000
SVESC024 EQU   SVESC022                                                 01359000
SVESC027 EQU   SVESC022                                                 01360000
SVESC029 EQU   SVESC033                                                 01361000
SVESC031 EQU   SVECC013                                                 01362000
SVESC032 EQU   SVECC011                                                 01363000
SVETC037 EQU   SVEIC003                                                 01364000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01365000
$RME     EQU   $NEWSPRF+36                                              01366000
@NM00054 EQU   $NEWSPRF+35                                              01367000
$ECA     EQU   $NEWSPRF+32                                              01368000
$DCHB    EQU   $NEWSPRF+28                                              01369000
$MOSIZE  EQU   $NEWSPRF+24                                              01370000
$RTSIZE  EQU   $NEWSPRF+20                                              01371000
$REFNUM  EQU   $NEWSPRF+17                                              01372000
@NM00053 EQU   #FLAGS                                                   01373000
#MSGIDRQ EQU   #FLAGS                                                   01374000
#PLKMCOR EQU   #FLAGS                                                   01375000
@NM00052 EQU   #FLAGS                                                   01376000
$VIRTUAL EQU   #FLAGS                                                   01377000
$PLINK$  EQU   $NEWSPRF+12                                              01378000
$SCTREQ  EQU   $NEWSPRF+11                                              01379000
$RM      EQU   $NEWSPRF+9                                               01380000
$CTYPE   EQU   $NEWSPRF+8                                               01381000
$CCLASS  EQU   $NEWSPRF+7                                               01382000
$CFEAT   EQU   $NEWSPRF+6                                               01383000
$CMODEL  EQU   $NEWSPRF+5                                               01384000
$TYPE    EQU   $NEWSPRF+4                                               01385000
$CLASS   EQU   $NEWSPRF+3                                               01386000
$FEAT    EQU   $NEWSPRF+2                                               01387000
$MODEL   EQU   $NEWSPRF+1                                               01388000
$RTN#    EQU   $NEWSPRF                                                 01389000
#MSGID   EQU   @NM00051+16                                              01390000
LEVEL    EQU   @NM00051+8                                               01391000
SECTID   EQU   @NM00051                                                 01392000
SVECC010 EQU   TOLTEPWA+3952                                            01393000
SVETC035 EQU   TOLTEPWA+3880                                            01394000
SVESC030 EQU   TOLTEPWA+3808                                            01395000
SVESC020 EQU   TOLTEPWA+3664                                            01396000
SVEIC002 EQU   TOLTEPWA+3520                                            01397000
SVECC014 EQU   TOLTEPWA+3376                                            01398000
SVESC120 EQU   TOLTEPWA+3304                                            01399000
SVESC025 EQU   TOLTEPWA+3088                                            01400000
@NM00050 EQU   TOLTEPWA+2980                                            01401000
$RPLERR  EQU   TOLTEPWA+2977                                            01402000
@NM00049 EQU   TOLTEPWA+2976                                            01403000
$R13PR3  EQU   TOLTEPWA+2972                                            01404000
$CEINT2  EQU   TOLTEPWA+2968                                            01405000
$CEINT1  EQU   TOLTEPWA+2964                                            01406000
$MSGGET  EQU   TOLTEPWA+2960                                            01407000
$ACQLIST EQU   TOLTEPWA+2956                                            01408000
$R4SAVE1 EQU   TOLTEPWA+2952                                            01409000
$CLSISS  EQU   TOLTEPWA+2950                                            01410000
$CLSCNT  EQU   TOLTEPWA+2948                                            01411000
$CUTABLE EQU   TOLTEPWA+2868                                            01412000
$BUFSZ2  EQU   TOLTEPWA+2864                                            01413000
$RESID2  EQU   TOLTEPWA+2860                                            01414000
$OLTCCW2 EQU   TOLTEPWA+2856                                            01415000
$ENDBFR2 EQU   TOLTEPWA+2852                                            01416000
$1STBFR2 EQU   TOLTEPWA+2848                                            01417000
$TECB2   EQU   TOLTEPWA+2844                                            01418000
$BUFSZ1  EQU   TOLTEPWA+2840                                            01419000
$RESID1  EQU   TOLTEPWA+2836                                            01420000
$OLTCCW1 EQU   TOLTEPWA+2832                                            01421000
$ENDBFR1 EQU   TOLTEPWA+2828                                            01422000
$1STBFR1 EQU   TOLTEPWA+2824                                            01423000
$TECB1   EQU   TOLTEPWA+2820                                            01424000
$WAITIME EQU   TOLTEPWA+2816                                            01425000
$TRTN#   EQU   TOLTEPWA+2815                                            01426000
$WIODEV  EQU   TOLTEPWA+2814                                            01427000
$RQSTSZE EQU   TOLTEPWA+2812                                            01428000
$RQSTPTR EQU   TOLTEPWA+2808                                            01429000
$R4SAVE  EQU   TOLTEPWA+2804                                            01430000
$PARTADR EQU   TOLTEPWA+2800                                            01431000
$TBSDATA EQU   TOLTEPWA+2796                                            01432000
$CTWIDTH EQU   TOLTEPWA+2795                                            01433000
$CTLINE  EQU   TOLTEPWA+2794                                            01434000
$APWIDTH EQU   TOLTEPWA+2793                                            01435000
$APLINE  EQU   TOLTEPWA+2792                                            01436000
$INDEX   EQU   $IMITX                                                   01437000
$UMXX    EQU   @NM00048+14                                              01438000
$NSXX    EQU   @NM00048+12                                              01439000
$ATACNT  EQU   $NSCNT                                                   01440000
$CTR     EQU   @NM00048+8                                               01441000
$ATAPTR  EQU   $NSPTR                                                   01442000
$DDRPTR  EQU   @NM00048                                                 01443000
$DTORESP EQU   TOLTEPWA+2712                                            01444000
$24SYMNE EQU   $24CATMG+4                                               01445000
$24DEVAD EQU   $24CATMG                                                 01446000
$24RTN#  EQU   $24FEMSG+8                                               01447000
$ESECTID EQU   $24FEMSG                                                 01448000
$24FLGS  EQU   TOLTEPWA+2680                                            01449000
$24SAVE2 EQU   TOLTEPWA+2676                                            01450000
$24SAVE1 EQU   TOLTEPWA+2672                                            01451000
$24UNADR EQU   TOLTEPWA+2668                                            01452000
$24SAV13 EQU   TOLTEPWA+2664                                            01453000
$24RETCD EQU   TOLTEPWA+2663                                            01454000
$MACID   EQU   TOLTEPWA+2661                                            01455000
$CSPARE  EQU   $CFLGS                                                   01456000
$C2WAY   EQU   $CFLGS                                                   01457000
$CINCT   EQU   $CCOMDAT+12                                              01458000
$CINADR  EQU   $CCOMDAT+8                                               01459000
$COUTCT  EQU   $CCOMDAT+4                                               01460000
$COUTAD  EQU   $CCOMDAT                                                 01461000
ROOTLOC  EQU   TOLTEPWA+2640                                            01462000
$RETREG  EQU   TOLTEPWA+2636                                            01463000
$PASSONA EQU   TOLTEPWA+2264                                            01464000
$TRMINPT EQU   TOLTEPWA+2184                                            01465000
$BUFFER  EQU   TOLTEPWA+1976                                            01466000
$TLTRPL3 EQU   TOLTEPWA+1856                                            01467000
$TLTRPL2 EQU   TOLTEPWA+1736                                            01468000
$TLTRPL1 EQU   TOLTEPWA+1616                                            01469000
@NM00047 EQU   $SLTBL+135                                               01470000
$HIGHRTN EQU   $SLTBL+134                                               01471000
$PRIMADR EQU   $SLTBL+130                                               01472000
$CTSTPT  EQU   $SLTBL+128                                               01473000
$TSTCNT  EQU   $SLTBL+126                                               01474000
$SECFLGS EQU   $SECLST+3                                                01475000
$SECTION EQU   $SECLST                                                  01476000
$SECACT  EQU   $TESTFLG                                                 01477000
$CANTRUN EQU   $TESTFLG                                                 01478000
$FINAL   EQU   $TESTFLG                                                 01479000
$TESTSUF EQU   $RUNTEST+5                                               01480000
$TESTNUM EQU   $RUNTEST+1                                               01481000
$LETPRF  EQU   $RUNTEST                                                 01482000
$SYMBOLC EQU   $SLTBL+5                                                 01483000
$FAMILY  EQU   $SLTBL                                                   01484000
$CDEVPT  EQU   TOLTEPWA+1466                                            01485000
$DEVCNTS EQU   TOLTEPWA+1464                                            01486000
$FEEDBCK EQU   $DEVTBLE+66                                              01487000
$WTISUED EQU   $DEVFLG4                                                 01488000
$EXIOISD EQU   $DEVFLG4                                                 01489000
$REMWRIT EQU   $DEVFLG4                                                 01490000
$REMDONE EQU   $DEVFLG4                                                 01491000
$2NDUSED EQU   $DEVFLG4                                                 01492000
$1STUSED EQU   $DEVFLG4                                                 01493000
$IGLXIFB EQU   $DEVFLG4                                                 01494000
$EXIOLV3 EQU   $DEVFLG4                                                 01495000
@NM00046 EQU   $DEVFLG5                                                 01496000
$DVBASIC EQU   $DEVFLG5                                                 01497000
$ASCII   EQU   $DEVFLG5                                                 01498000
$DEVLU   EQU   $DEVFLG5                                                 01499000
$OPNDFAL EQU   $DEVFLG5                                                 01500000
$ACQNCB  EQU   $DEVFLG5                                                 01501000
$REMOTE  EQU   $DEVFLG5                                                 01502000
$ENDNODE EQU   $DEVFLG5                                                 01503000
$CID     EQU   $DEVTBLE+52                                              01504000
$DVCOL   EQU   $LDNCBPT+2                                               01505000
$DVROW   EQU   $LDNCBPT                                                 01506000
$NCSPLP  EQU   $DEVTBLE+44                                              01507000
$DVLN    EQU   $SSCPDAF                                                 01508000
$DAF     EQU   $DEVSESP+4                                               01509000
$VARYPAB EQU   $DEVSESP                                                 01510000
@NM00045 EQU   $DEVFLG3                                                 01511000
$CLRSNT  EQU   $DEVFLG3                                                 01512000
$OLTERR  EQU   $DEVFLG3                                                 01513000
$SRTEST  EQU   $DEVFLG3                                                 01514000
$DVSNDOK EQU   $SIOFLG                                                  01515000
$POLLREQ EQU   $DEVFLG3                                                 01516000
$DVINCT  EQU   $DEVTBLE+26                                              01517000
$DVBRKST EQU   $OPND+1                                                  01518000
$DVBRKSN EQU   $OPND                                                    01519000
$DVSEQNO EQU   $OPIS                                                    01520000
$CEINTRP EQU   $DEVFLG2                                                 01521000
$TESTMDE EQU   $DEVFLG2                                                 01522000
$DEVALOC EQU   $DEVFLG2                                                 01523000
$ALLDATA EQU   $DEVFLG2                                                 01524000
$ENDCNTL EQU   $DEVFLG2                                                 01525000
$CTLDEV  EQU   $DEVFLG2                                                 01526000
$NOCDS   EQU   $DEVFLG2                                                 01527000
$DATAIN  EQU   $DEVFLG2                                                 01528000
$PRIMARY EQU   $DEVFLG1                                                 01529000
$DVCTBYT EQU   $INTOCC                                                  01530000
$DEVACT  EQU   $DEVFLG1                                                 01531000
$DVLGMDE EQU   $ATTNEXP                                                 01532000
$DVSPRM  EQU   $EVNCPLT                                                 01533000
$GRABBED EQU   $DEVFLG1                                                 01534000
$CATASTR EQU   $DEVFLG1                                                 01535000
$LETGO   EQU   $DEVFLG1                                                 01536000
$CURELEM EQU   $$SYMNME+4                                               01537000
$EXTDEV  EQU   $DEVCDS+11                                               01538000
@NM00044 EQU   $DEVSDCF                                                 01539000
$NOTPRIM EQU   $DEVSDCF                                                 01540000
@NM00043 EQU   $DEVCDSF                                                 01541000
@NM00042 EQU   $DEVCDSF                                                 01542000
@NM00041 EQU   $DEVCDSF                                                 01543000
$CDSNAME EQU   $DEVCDSF                                                 01544000
$EXTRN   EQU   $DEVCDSF                                                 01545000
$CEVOLUM EQU   $DEVCDSF                                                 01546000
$SHARD   EQU   $DEVCDSF                                                 01547000
$DEVFPM  EQU   $DEVCDSF                                                 01548000
$DEVCNT  EQU   $DEVCDS+8                                                01549000
$DEVTYPE EQU   $DEVFEAT+3                                               01550000
$DEVCLAS EQU   $DEVFEAT+2                                               01551000
$DEVFRRS EQU   $DEVFEAT+1                                               01552000
$DEVMOD  EQU   $DEVFEAT                                                 01553000
$DEVRDGT EQU   @NM00039+1                                               01554000
$DEVCTLU EQU   @NM00039+1                                               01555000
$DEVCHAN EQU   @NM00039                                                 01556000
@NM00040 EQU   @NM00039                                                 01557000
$CTINDX  EQU   $DEVUNAD                                                 01558000
$FLAG16  EQU   $COMMFLG+15                                              01559000
$FLAG15  EQU   $COMMFLG+14                                              01560000
$FLAG14  EQU   $COMMFLG+13                                              01561000
$TEP2ND  EQU   $FLAG13                                                  01562000
$TEP1ST  EQU   $FLAG13                                                  01563000
$CATMSG  EQU   $FLAG13                                                  01564000
$PRMPTSW EQU   $FLAG13                                                  01565000
$DEVENT  EQU   $FLAG13                                                  01566000
$OLTMACC EQU   $FLAG13                                                  01567000
$LGON    EQU   $FLAG13                                                  01568000
$CTLOGON EQU   $FLAG13                                                  01569000
@NM00038 EQU   $FLAG12                                                  01570000
$VARYINP EQU   $FLAG12                                                  01571000
$ENDTEST EQU   $FLAG12                                                  01572000
$VRYHRD  EQU   $FLAG12                                                  01573000
$VRYSFT  EQU   $FLAG12                                                  01574000
$POSTFLG EQU   $FLAG12                                                  01575000
$FEORCAT EQU   $FLAG11                                                  01576000
@NM00037 EQU   $FLAG11                                                  01577000
@NM00036 EQU   $FLAG10                                                  01578000
$INBND   EQU   $FLAG10                                                  01579000
$WAITFLG EQU   $FLAG10                                                  01580000
$DPRINT  EQU   $FLAG10                                                  01581000
$HOLD    EQU   $FLAG9                                                   01582000
$NOTRRCH EQU   $FLAG9                                                   01583000
@NM00035 EQU   $FLAG9                                                   01584000
$COPY    EQU   $FLAG9                                                   01585000
$LSTLNSW EQU   $FLAG9                                                   01586000
$MULLNSW EQU   $FLAG9                                                   01587000
$REMSW   EQU   $FLAG9                                                   01588000
$IGRES   EQU   $FLAG9                                                   01589000
$VS2     EQU   $FLAG8                                                   01590000
$VS1     EQU   $FLAG8                                                   01591000
$EDOS    EQU   $FLAG8                                                   01592000
@NM00034 EQU   $FLAG8                                                   01593000
$TWOWAY  EQU   $FLAG8                                                   01594000
@NM00033 EQU   $FLAG8                                                   01595000
$RCVMSG  EQU   $FLAG7                                                   01596000
$RCVRFLG EQU   $FLAG7                                                   01597000
$SNDRFLG EQU   $FLAG7                                                   01598000
$LDOIS   EQU   $FLAG7                                                   01599000
$DCONTCT EQU   $FLAG7                                                   01600000
$EXIOWAT EQU   $FLAG7                                                   01601000
$2NDDATA EQU   $FLAG7                                                   01602000
$1STDATA EQU   $FLAG7                                                   01603000
$CIREQ   EQU   $FLAG6                                                   01604000
$ABTERM  EQU   $ABNDBIT                                                 01605000
$FSTMCIS EQU   $FLAG6                                                   01606000
$DISCREQ EQU   $FLAG6                                                   01607000
$DISCISS EQU   $FLAG6                                                   01608000
$CHANGE  EQU   $FLAG6                                                   01609000
$CTERROR EQU   $FLAG6                                                   01610000
$RECAL11 EQU   $FLAG6                                                   01611000
@NM00032 EQU   $FLAG5                                                   01612000
$PROGCK  EQU   $CANCEL                                                  01613000
$PRINTAP EQU   $FLAG5                                                   01614000
@NM00031 EQU   $FLAG5                                                   01615000
$MSG922  EQU   $FLAG5                                                   01616000
$CT924   EQU   $FLAG5                                                   01617000
$FSTCAT  EQU   $FLAG5                                                   01618000
$FSTFE   EQU   $FLAG5                                                   01619000
$ACTOPND EQU   $FLAG4                                                   01620000
$ACQCUTT EQU   $FLAG4                                                   01621000
$CLSSACT EQU   $FLAG4                                                   01622000
$BACKINT EQU   $FLAG4                                                   01623000
$DMSGSW  EQU   $FLAG4                                                   01624000
$TSTDEVP EQU   $FLAG4                                                   01625000
$OPCOM   EQU   $FLAG4                                                   01626000
$PRTONLY EQU   $FLAG3                                                   01627000
$REQSTOR EQU   $FLAG3                                                   01628000
$LOGOFFE EQU   $FLAG3                                                   01629000
$TSTERR  EQU   $FLAG3                                                   01630000
$DEVERR  EQU   $FLAG3                                                   01631000
$PARTIAL EQU   $FLAG2                                                   01632000
$NRMTERM EQU   $FLAG2                                                   01633000
$VALDTST EQU   $FLAG2                                                   01634000
$VALDDEV EQU   $FLAG2                                                   01635000
$DBLSLSH EQU   $FLAG2                                                   01636000
$NDR     EQU   $FLAG2                                                   01637000
@NM00030 EQU   $FLAG2                                                   01638000
$FTTHR   EQU   $FLAG2                                                   01639000
$NORELDV EQU   $FLAG1                                                   01640000
@NM00029 EQU   $FLAG1                                                   01641000
$OPTCHNG EQU   $FLAG1                                                   01642000
$DEVCHNG EQU   $FLAG1                                                   01643000
$TESTCNG EQU   $FLAG1                                                   01644000
$CNSLFG  EQU   $FLAG1                                                   01645000
$TEP3RD  EQU   $FLAG1                                                   01646000
@NM00028 EQU   $CDA+120                                                 01647000
$CUCNT   EQU   $CDA+118                                                 01648000
@NM00027 EQU   $CDA+117                                                 01649000
$PRTFORM EQU   $CDA+116                                                 01650000
$OPISCNT EQU   $CDA+114                                                 01651000
$OPNDCNT EQU   $CDA+112                                                 01652000
$GETMSZE EQU   $CDA+110                                                 01653000
$GRCNTS  EQU   $CDA+108                                                 01654000
$CTLCNT  EQU   $CDA+106                                                 01655000
$ACTLVL  EQU   $CDA+105                                                 01656000
$TIMEALW EQU   $CDA+96                                                  01657000
$PTRAREA EQU   $CDA+92                                                  01658000
$GETMPTR EQU   $CDA+88                                                  01659000
$R13PTRT EQU   $CDA+84                                                  01660000
$R13PTR  EQU   $CDA+80                                                  01661000
$TEPEND  EQU   $CDA+76                                                  01662000
$PLINKDL EQU   $CDA+72                                                  01663000
$TEPBEGN EQU   $CDA+68                                                  01664000
$FRELPTR EQU   $CDA+64                                                  01665000
$HIGHADR EQU   $HIMOREC                                                 01666000
$LOMOREC EQU   $CDA+56                                                  01667000
$ENDCOMM EQU   $CDA+48                                                  01668000
$COMMON  EQU   $RCA                                                     01669000
$PASSON  EQU   $CDA+28                                                  01670000
$TOLBRTB EQU   $CDA+24                                                  01671000
$SCTPTR8 EQU   $CDA+20                                                  01672000
$SCTPTR  EQU   $CDA+16                                                  01673000
$TBWDPTR EQU   $CDA+12                                                  01674000
$TFWDPTR EQU   $CDA+8                                                   01675000
@NM00026 EQU   $CDA                                                     01676000
@NM00025 EQU   $SCTTBLE+98                                              01677000
$SCTLWTC EQU   $SCTTBLE+96                                              01678000
$SCTLWTA EQU   $SCTTBLE+92                                              01679000
#EXT     EQU   $SCTTBLE+88                                              01680000
#PASS    EQU   $SCTTBLE+84                                              01681000
#TABLE   EQU   $SCTTBLE+80                                              01682000
#MSGIDAC EQU   $SCTTBLE+78                                              01683000
@NM00024 EQU   $SCTTBLE+71                                              01684000
$RETMASK EQU   $SCTTBLE+70                                              01685000
$R249255 EQU   $ROUTMSK+29                                              01686000
$R241248 EQU   $ROUTMSK+28                                              01687000
$R233240 EQU   $ROUTMSK+27                                              01688000
$R225232 EQU   $ROUTMSK+26                                              01689000
$R217224 EQU   $ROUTMSK+25                                              01690000
$R209216 EQU   $ROUTMSK+24                                              01691000
$R201208 EQU   $ROUTMSK+23                                              01692000
$R193200 EQU   $ROUTMSK+22                                              01693000
$R185192 EQU   $ROUTMSK+21                                              01694000
$R177184 EQU   $ROUTMSK+20                                              01695000
$R169176 EQU   $ROUTMSK+19                                              01696000
$R161168 EQU   $ROUTMSK+18                                              01697000
$R153160 EQU   $ROUTMSK+17                                              01698000
$R145152 EQU   $ROUTMSK+16                                              01699000
$R137144 EQU   $ROUTMSK+15                                              01700000
$R129136 EQU   $ROUTMSK+14                                              01701000
$R121128 EQU   $ROUTMSK+13                                              01702000
$R113120 EQU   $ROUTMSK+12                                              01703000
$R105112 EQU   $ROUTMSK+11                                              01704000
$R097104 EQU   $ROUTMSK+10                                              01705000
$R089096 EQU   $ROUTMSK+9                                               01706000
$R081088 EQU   $ROUTMSK+8                                               01707000
$R073080 EQU   $ROUTMSK+7                                               01708000
$R065072 EQU   $ROUTMSK+6                                               01709000
$R057064 EQU   $ROUTMSK+5                                               01710000
$R049056 EQU   $ROUTMSK+4                                               01711000
$R041048 EQU   $ROUTMSK+3                                               01712000
$R033040 EQU   $ROUTMSK+2                                               01713000
$R025032 EQU   $ROUTMSK+1                                               01714000
$R017024 EQU   $ROUTMSK                                                 01715000
$TOTFLG2 EQU   $SCTTBLE+39                                              01716000
@NM00023 EQU   $TOTFLG1                                                 01717000
@NM00022 EQU   $TOTFLG1                                                 01718000
@NM00021 EQU   $TOTFLG1                                                 01719000
$CURELOD EQU   $TOTFLG1                                                 01720000
$CTEQTT  EQU   $TOTFLG1                                                 01721000
@NM00020 EQU   $TOTFLG1                                                 01722000
@NM00019 EQU   $TOTFLG1                                                 01723000
$LINESHR EQU   $TOTFLG1                                                 01724000
@NM00018 EQU   $OLTFLG2                                                 01725000
@NM00017 EQU   $OLTFLG2                                                 01726000
@NM00016 EQU   $OLTFLG2                                                 01727000
@NM00015 EQU   $OLTFLG2                                                 01728000
@NM00014 EQU   $OLTFLG2                                                 01729000
@NM00013 EQU   $OLTFLG2                                                 01730000
@NM00012 EQU   $OLTFLG2                                                 01731000
$TALK    EQU   $OLTFLG2                                                 01732000
$DYCOM   EQU   $OLTFLGS                                                 01733000
@NM00011 EQU   $OLTFLGS                                                 01734000
$RETCODE EQU   $OLTFLGS                                                 01735000
$CONTCB  EQU   $OLTFLGS                                                 01736000
$RETAIN  EQU   $OLTFLGS                                                 01737000
$CLEANRT EQU   $OLTFLGS                                                 01738000
$OLTSIZE EQU   $SCTTBLE+34                                              01739000
$QSCTMOD EQU   $EXECFLG                                                 01740000
$CTRLMOD EQU   $EXECFLG                                                 01741000
$CLEANUP EQU   $EXECFLG                                                 01742000
$LSTPDEV EQU   $EXECFLG                                                 01743000
$RTNSLCT EQU   $EXECFLG                                                 01744000
$MULTDEV EQU   $EXECFLG                                                 01745000
@NM00010 EQU   $EXECFLG                                                 01746000
$RMSKCNT EQU   $SCTTBLE+32                                              01747000
$SYNAME  EQU   $CDS8T19+4                                               01748000
$EXTSIG  EQU   $CDS8T19+3                                               01749000
$CDFLGS  EQU   $CDS8T19+1                                               01750000
$CDSCNT  EQU   $CDS8T19                                                 01751000
$PDEVDSC EQU   $SCTTBLE+16                                              01752000
$PDEVADR EQU   $SCTTBLE+12                                              01753000
$COMMCN  EQU   $CDSFLGS                                                 01754000
$CUSTSYM EQU   $CDSFLGS                                                 01755000
$TWOCHSW EQU   $CDSFLGS                                                 01756000
$SYMNAME EQU   $CDSFLGS                                                 01757000
$EXTINTC EQU   $CDSFLGS                                                 01758000
$CEVOL   EQU   $CDSFLGS                                                 01759000
$SHARED  EQU   $CDSFLGS                                                 01760000
$FPM     EQU   $CDSFLGS                                                 01761000
$LASTSUB EQU   $PDEVFLG                                                 01762000
@NM00009 EQU   $PDEVFLG                                                 01763000
@NM00008 EQU   $PDEVFLG                                                 01764000
@NM00007 EQU   $PDEVFLG                                                 01765000
$LASTDEV EQU   $PDEVFLG                                                 01766000
@NM00006 EQU   $PDEVFLG                                                 01767000
$EXFILPT EQU   $PDEVFLG                                                 01768000
$FPMOLD  EQU   $PDEVFLG                                                 01769000
$TSSSYM  EQU   $SCTTBLE+8                                               01770000
$SCTLEVL EQU   $SCTTBLE+7                                               01771000
$DRIVER  EQU   $SCTTBLE+6                                               01772000
$RT0916  EQU   $SCTTBLE+5                                               01773000
$RT0108  EQU   $SCTTBLE+4                                               01774000
$CATERR  EQU   $ERROPT                                                  01775000
$ASTERIK EQU   $ERROPT                                                  01776000
$TESTERR EQU   $ERROPT                                                  01777000
$PARAPRT EQU   $TESTOPT                                                 01778000
@NM00005 EQU   $TESTOPT                                                 01779000
$TLTEND  EQU   $RCAAREA+945                                             01780000
$CNSLID  EQU   $RCAAREA+936                                             01781000
$EXITSAV EQU   $RCAAREA+864                                             01782000
$TRASCII EQU   $RCAAREA+608                                             01783000
@NM00004 EQU   $RCAAREA+605                                             01784000
$VTAMEND EQU   $RCAFLG                                                  01785000
$TPPOSTD EQU   $RCAFLG                                                  01786000
$NEWCT   EQU   $RCAFLG                                                  01787000
$ABNDALL EQU   $RCAFLG                                                  01788000
$CUTESTB EQU   $RCAFLG                                                  01789000
$CONSOLE EQU   $RCAFLG                                                  01790000
$TPLOGON EQU   $RCAFLG                                                  01791000
$UPDATE  EQU   $RCAFLG                                                  01792000
$DEVAREA EQU   $RCAAREA+600                                             01793000
$CTDVAR  EQU   $RCAAREA+596                                             01794000
$BUFFS   EQU   $RCAAREA+464                                             01795000
$TLTNIB  EQU   $CONSTNT+140                                             01796000
$TLTPRPL EQU   $CONSTNT+20                                              01797000
@NM00003 EQU   $CONSTNT+4                                               01798000
@NM00002 EQU   $CONSTNT+2                                               01799000
$USECNT  EQU   $CONSTNT                                                 01800000
$CURRTWA EQU   $POINTER+140                                             01801000
$CTNAME  EQU   $POINTER+132                                             01802000
$CTARGX  EQU   $POINTER+128                                             01803000
$COMINT  EQU   $POINTER+120                                             01804000
$QUEHNDL EQU   $POINTER+116                                             01805000
@NM00001 EQU   $POINTER+36                                              01806000
$RTNPTR  EQU   $POINTER+32                                              01807000
$TLTECB2 EQU   $POINTER+28                                              01808000
$TLTECB1 EQU   $POINTER+24                                              01809000
$CLEANP  EQU   $POINTER+20                                              01810000
$ABEND   EQU   $POINTER+16                                              01811000
$LSTAREA EQU   $POINTER+12                                              01812000
$FSTAREA EQU   $POINTER+8                                               01813000
$CVTSAVE EQU   $POINTER+4                                               01814000
$TOLTEP  EQU   $POINTER                                                 01815000
$TLTACB  EQU   $RCAAREA                                                 01816000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01817000
@RT00103 EQU   OPT900                                                   01818000
@RT00123 EQU   OPT300                                                   01819000
@RT00131 EQU   OPT200                                                   01820000
@RT00138 EQU   OPT100                                                   01821000
@RF00150 EQU   OPT070                                                   01822000
@RF00157 EQU   OPT070                                                   01823000
@RF00164 EQU   OPT070                                                   01824000
@RF00171 EQU   OPT070                                                   01825000
@RF00178 EQU   OPT070                                                   01826000
@RF00185 EQU   OPT070                                                   01827000
@RT00198 EQU   OPT800                                                   01828000
@RT00216 EQU   OPT900                                                   01829000
@RF00221 EQU   OPT070                                                   01830000
@RF00265 EQU   OPT070                                                   01831000
@RT00275 EQU   OPT355                                                   01832000
@RT00289 EQU   OPT800                                                   01833000
@RT00301 EQU   OPT800                                                   01834000
@RT00303 EQU   OPT370                                                   01835000
@RT00319 EQU   OPT890                                                   01836000
@RT00326 EQU   OPT070                                                   01837000
@RT00354 EQU   OPT430                                                   01838000
@RT00372 EQU   OPT890                                                   01839000
@RT00383 EQU   OPT800                                                   01840000
@RT00399 EQU   OPT820                                                   01841000
@RT00427 EQU   OPT900                                                   01842000
@ENDDATA EQU   *                                                        01843000
         END   ISTIC005,(C'PLS2103',0702,80232)                         01844000
