         TITLE 'ISTIC004-TEST DECODE'                                   00001000
ISTIC004 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTIC004  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
*   R5=R13;                         /* CALLERS SAVE PTR              */ 00013000
         LR    R5,R13                                              0055 00014000
*   R13=ADDR(SVEIC003);             /* PTR TO MY SAVEAREA            */ 00015000
         LA    R13,SVEIC003(,WAPTR)                                0056 00016000
*   BACKSAVE(3)=R13;                /* INTO CALLERS SAVE             */ 00017000
         ST    R13,BACKSAVE+8(,R5)                                 0057 00018000
*   SVEIC003(2)=R5;                 /* INTO MY SAVE                  */ 00019000
         ST    R5,SVEIC003+4(,WAPTR)                               0058 00020000
*   RCAPTR=$RCA;                    /* GET POINTER TO RCA            */ 00021000
         L     RCAPTR,$RCA(,WAPTR)                                 0059 00022000
*   $CUTESTB='0'B;                  /* TURN OFF CUTEST ACTIVE FLAG   */ 00023000
         NI    $CUTESTB(RCAPTR),B'11101111'                        0060 00024000
*   $CUCNT=0;                       /* SET CUTEST COUNT TO ZERO      */ 00025000
         SLR   @15,@15                                             0061 00026000
         STH   @15,$CUCNT(,WAPTR)                                  0061 00027000
*   R5=$SLASHAD(1)+1;               /* GET INBUFR POINTER            */ 00028000
         LA    R5,1                                                0062 00029000
         AL    R5,$SLASHAD(,WAPTR)                                 0062 00030000
*   GO TO CECTST04;                 /* NO, CONTINUE TO DECODE        */ 00031000
         B     CECTST04                                            0063 00032000
*CECTST03:                                                         0064 00033000
*                                                                  0064 00034000
*   /*****************************************************************/ 00035000
*   /*                                                               */ 00036000
*   /* PWTO MESSAGES IFD112I AND IFD155I                             */ 00037000
*   /*                                                               */ 00038000
*   /*****************************************************************/ 00039000
*                                                                  0064 00040000
*   R9=$SLASHAD(1)+1;               /* PT TO FIRST CHAR OF INPUT     */ 00041000
CECTST03 LA    R9,1                                                0064 00042000
         AL    R9,$SLASHAD(,WAPTR)                                 0064 00043000
*   $INBUFR(1:8)=' ';               /* BLK OUT SUB FIELD             */ 00044000
         MVI   $INBUFR+1(WAPTR),C' '                               0065 00045000
         MVC   $INBUFR+2(6,WAPTR),$INBUFR+1(WAPTR)                 0065 00046000
         MVI   $INBUFR(WAPTR),C' '                                 0065 00047000
*   DO I=8 TO 1 BY-1;               /* SCAN INPUT                    */ 00048000
         LA    I,8                                                 0066 00049000
@DL00066 DS    0H                                                  0067 00050000
*     $INBUFR(I)=INPUTBUF(1);       /* MOVE ERROR IN MSG             */ 00051000
         LR    @15,WAPTR                                           0067 00052000
         ALR   @15,I                                               0067 00053000
         MVC   $INBUFR-1(1,@15),INPUTBUF(R5)                       0067 00054000
*     IF R9=R5 THEN                 /* END OF FIELD ?                */ 00055000
         CR    R9,R5                                               0068 00056000
         BE    @RT00068                                            0068 00057000
*       GO TO CECTST05;             /* GO WRITE MSG                  */ 00058000
*     R5=R5-1;                      /* DECR INPUT PTR                */ 00059000
         BCTR  R5,0                                                0070 00060000
*   END;                                                           0071 00061000
         BCTR  I,0                                                 0071 00062000
         LTR   I,I                                                 0071 00063000
         BP    @DL00066                                            0071 00064000
*CECTST05:                                                         0072 00065000
*                                                                  0072 00066000
*   /*****************************************************************/ 00067000
*   /*                                                               */ 00068000
*   /* ISSUE MESSAGE 112 TCEC MSGN(112)SUB(YES) INVOKED              */ 00069000
*   /*                                                               */ 00070000
*   /*****************************************************************/ 00071000
*                                                                  0072 00072000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00073000
CECTST05 OI    $TCECM(WAPTR),B'00000001'                           0072 00074000
*   R1=ADDR($TCA09);                /* SET UP PARM LIST $TR          */ 00075000
         LA    R1,$TCA09                                           0073 00076000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00077000
         L     @15,#EXITA(,WAPTR)                                  0074 00078000
         BALR  @14,@15                                             0074 00079000
*   DCL                                                            0075 00080000
*     1 $TCA09,                     /* TCEC PARM LIST                */ 00081000
*      2 $TCB09 FIXED(32) INIT(112),/* MSG NUMBER                    */ 00082000
*      2 $TCC09 FIXED(32) INIT(0),  /* INCT LEN                      */ 00083000
*      2 $TCD09 BIT(8) INIT('10000000'B),/* FLAG                     */ 00084000
*      2 $TCE09 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK             */ 00085000
*   GO TO CECTST07;                 /* SET TST ERROR FLAG ON         */ 00086000
         B     CECTST07                                            0076 00087000
*CECTST06:                                                         0077 00088000
*                                                                  0077 00089000
*   /*****************************************************************/ 00090000
*   /*                                                               */ 00091000
*   /* ISSUE MESSAGE 155 TCEC MSGN(155)SUB(NO) INVOKED               */ 00092000
*   /*                                                               */ 00093000
*   /*****************************************************************/ 00094000
*                                                                  0077 00095000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00096000
CECTST06 OI    $TCECM(WAPTR),B'00000001'                           0077 00097000
*   R1=ADDR($TCA10);                /* SET UP PARM LIST $TR          */ 00098000
         LA    R1,$TCA10                                           0078 00099000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00100000
         L     @15,#EXITA(,WAPTR)                                  0079 00101000
         BALR  @14,@15                                             0079 00102000
*   DCL                                                            0080 00103000
*     1 $TCA10,                     /* TCEC PARM LIST                */ 00104000
*      2 $TCB10 FIXED(32) INIT(155),/* MSG NUMBER                    */ 00105000
*      2 $TCC10 FIXED(32) INIT(0),  /* INCT LEN                      */ 00106000
*      2 $TCD10 BIT(8) INIT('00000000'B),/* FLAG                     */ 00107000
*      2 $TCE10 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK             */ 00108000
*   $TSTERR='1'B;                   /* SET ERROR FLAG ON             */ 00109000
         OI    $TSTERR(WAPTR),B'01000000'                          0081 00110000
*   GO TO CECTST99;                 /* RETURN TO COMM INT            */ 00111000
         B     CECTST99                                            0082 00112000
*CECTST07:                          /* SET ERROR FLAG ON             */ 00113000
*   $TSTERR='1'B;                                                  0083 00114000
CECTST07 OI    $TSTERR(WAPTR),B'01000000'                          0083 00115000
*   GO TO CECTST77;                 /* RETURN TO COMM INT            */ 00116000
         B     CECTST77                                            0084 00117000
*CECTST04:                                                         0085 00118000
*                                                                  0085 00119000
*   /*****************************************************************/ 00120000
*   /*                                                               */ 00121000
*   /* INITIALIZE TEST DECODE                                        */ 00122000
*   /*                                                               */ 00123000
*   /*****************************************************************/ 00124000
*                                                                  0085 00125000
*   $TSTCNT=$TSTCNT&&$TSTCNT;       /* INIT SECTION COUNT            */ 00126000
CECTST04 LH    @15,$TSTCNT(,WAPTR)                                 0085 00127000
         LR    @00,@15                                             0085 00128000
         XR    @00,@15                                             0085 00129000
         STH   @00,$TSTCNT(,WAPTR)                                 0085 00130000
*   $RTNSLCT='0'B;                  /* INIT RTN SELECT BIT           */ 00131000
         NI    $RTNSLCT(WAPTR),B'11011111'                         0086 00132000
*   $FAMILY(1)=' ';                 /* INIT FAMILY OF TESTS          */ 00133000
         MVI   $FAMILY(WAPTR),C' '                                 0087 00134000
*   $FAMILY(2:5)=$FAMILY(1:4);      /* BE RUN                        */ 00135000
         MVC   @TS00001(4),$FAMILY(WAPTR)                          0088 00136000
         MVC   $FAMILY+1(4,WAPTR),@TS00001                         0088 00137000
*   $VALDTST='0'B;                  /* INIT VALID TEST BIT           */ 00138000
         NI    $VALDTST(WAPTR),B'11111011'                         0089 00139000
*   SWITCHES=SWITCHES&&SWITCHES;    /* INIT INTERNAL SWCHS           */ 00140000
         XC    SWITCHES(1),SWITCHES                                0090 00141000
*   $RT0108=$RT0108&&$RT0108;       /* INITIALIZE                    */ 00142000
         XC    $RT0108(1,WAPTR),$RT0108(WAPTR)                     0091 00143000
*   $RT0916=$RT0916&&$RT0916;       /* ROUTINE                       */ 00144000
         XC    $RT0916(1,WAPTR),$RT0916(WAPTR)                     0092 00145000
*   $ROUTMSK=$ROUTMSK&&$ROUTMSK;    /* MASKS                         */ 00146000
         XC    $ROUTMSK(30,WAPTR),$ROUTMSK(WAPTR)                  0093 00147000
*   DO I=1 TO 26 BY 1;              /* CLEAR OUT SECTION LIST        */ 00148000
         LA    I,1                                                 0094 00149000
@DL00094 DS    0H                                                  0095 00150000
*     $SECLST(I)=SECINIT;                                          0095 00151000
         LR    @15,I                                               0095 00152000
         SLA   @15,2                                               0095 00153000
         ALR   @15,WAPTR                                           0095 00154000
         MVC   $SECLST-4(4,@15),SECINIT                            0095 00155000
*   END;                                                           0096 00156000
         AL    I,@CF00072                                          0096 00157000
         C     I,@CF00494                                          0096 00158000
         BNH   @DL00094                                            0096 00159000
*   SECCNTR=0;                                                     0097 00160000
         SLR   @15,@15                                             0097 00161000
         ST    @15,SECCNTR                                         0097 00162000
*   R8=ADDR($SECLST);               /* GET ADDR OF SECT LIST         */ 00163000
         LA    R8,$SECLST(,WAPTR)                                  0098 00164000
*   $FAMILY(1)='T';                 /* ENTER T AS DEFAULT            */ 00165000
         MVI   $FAMILY(WAPTR),C'T'                                 0099 00166000
*   IF INPUTBUF(1)='T'|             /* IF                            */ 00167000
*       INPUTBUF(1)='P'|            /* TEST PREFIX                   */ 00168000
*       INPUTBUF(1)='N'|            /* IS VALID                      */ 00169000
*       INPUTBUF(1)='R' THEN        /* MOVE IT                       */ 00170000
         CLI   INPUTBUF(R5),C'T'                                   0100 00171000
         BE    @RT00100                                            0100 00172000
         CLI   INPUTBUF(R5),C'P'                                   0100 00173000
         BE    @RT00100                                            0100 00174000
         CLI   INPUTBUF(R5),C'N'                                   0100 00175000
         BE    @RT00100                                            0100 00176000
         CLI   INPUTBUF(R5),C'R'                                   0100 00177000
         BNE   @RF00100                                            0100 00178000
@RT00100 DS    0H                                                  0101 00179000
*     DO;                           /* TO THE                        */ 00180000
*       $FAMILY(1)=INPUTBUF(1);     /* SECTION LIST                  */ 00181000
         MVC   $FAMILY(1,WAPTR),INPUTBUF(R5)                       0102 00182000
*       R5=R5+1;                    /* POINT TO NUMERICS             */ 00183000
         AL    R5,@CF00072                                         0103 00184000
*     END;                                                         0104 00185000
*CECTST11:                                                         0105 00186000
*                                                                  0105 00187000
*   /*****************************************************************/ 00188000
*   /*                                                               */ 00189000
*   /* IS TEST ID NUMERIC                                            */ 00190000
*   /*                                                               */ 00191000
*   /*****************************************************************/ 00192000
*                                                                  0105 00193000
*   DO J=1 TO 4;                    /* ARE ALL CHARACTERS IN         */ 00194000
@RF00100 DS    0H                                                  0105 00195000
CECTST11 LA    @15,1                                               0105 00196000
         STH   @15,J                                               0105 00197000
@DL00105 DS    0H                                                  0106 00198000
*     R6=ADDR(NUMBERS);             /* ID NUMERIC. NO, SET           */ 00199000
         LA    R6,NUMBERS                                          0106 00200000
*     DO I=10 TO 1 BY-1;            /* ERROR CODE TO -05-            */ 00201000
         LA    I,10                                                0107 00202000
@DL00107 DS    0H                                                  0108 00203000
*       IF INPUTBUF(J)=NUMBER THEN  /* AND PRINT ERROR               */ 00204000
         LH    @15,J                                               0108 00205000
         ALR   @15,R5                                              0108 00206000
         BCTR  @15,0                                               0108 00207000
         CLC   INPUTBUF(1,@15),NUMBER(R6)                          0108 00208000
         BE    @RT00108                                            0108 00209000
*         GO TO CECTST12;           /* MESSAGE IFD112I               */ 00210000
*       R6=R6+1;                    /* YES, CONTINUE TO              */ 00211000
         AL    R6,@CF00072                                         0110 00212000
*     END;                          /* DECODE                        */ 00213000
         BCTR  I,0                                                 0111 00214000
         LTR   I,I                                                 0111 00215000
         BP    @DL00107                                            0111 00216000
*     R5=R5+J-1;                    /* PT TO ERROR                   */ 00217000
         LR    @15,R5                                              0112 00218000
         AH    @15,J                                               0112 00219000
         BCTR  @15,0                                               0112 00220000
         LR    R5,@15                                              0112 00221000
*     GO TO CECTST03;                                              0113 00222000
         B     CECTST03                                            0113 00223000
*CECTST12:                                                         0114 00224000
*   END;                                                           0114 00225000
CECTST12 LA    @15,1                                               0114 00226000
         AH    @15,J                                               0114 00227000
         STH   @15,J                                               0114 00228000
         C     @15,@CF00068                                        0114 00229000
         BNH   @DL00105                                            0114 00230000
*   $FAMILY(2:5)=INPUTBUF(1:4);     /* MOVE NUMERIC ENTRY            */ 00231000
         MVC   $FAMILY+1(4,WAPTR),INPUTBUF(R5)                     0115 00232000
*CECTST13:                                                         0116 00233000
*                                                                  0116 00234000
*   /*****************************************************************/ 00235000
*   /*                                                               */ 00236000
*   /* DECODE SECTIONS ENTERED, IF THERE ARE ANY. IF NONE ARE        */ 00237000
*   /* ENTERED, USE DEFAULT RANGE A-Z.                               */ 00238000
*   /*                                                               */ 00239000
*   /*****************************************************************/ 00240000
*                                                                  0116 00241000
*   R5=R5+4;                        /* INCREMENT INBUFR POINTER BY 4 */ 00242000
CECTST13 AL    R5,@CF00068                                         0116 00243000
*   IF INPUTBUF(1)='/' THEN         /* IS CHAR IN INBUFR+0 A SLASH.  */ 00244000
         CLI   INPUTBUF(R5),C'/'                                   0117 00245000
         BNE   @RF00117                                            0117 00246000
*     DO;                           /* YES, SET BIT INDICATING       */ 00247000
*       SECTIONS='100'B;            /* TEST SECTION HAS A LENGTH     */ 00248000
*                                                                  0119 00249000
         NI    SECTIONS,B'10011111'                                0119 00250000
         OI    SECTIONS,B'10000000'                                0119 00251000
*       /*************************************************************/ 00252000
*       /*                                                           */ 00253000
*       /* OF ONE & SET DEFAULT RANGE                                */ 00254000
*       /*                                                           */ 00255000
*       /*************************************************************/ 00256000
*                                                                  0120 00257000
*       FSTSEC='  A';               /* OF SECTIONS A-Z & SET         */ 00258000
         MVC   FSTSEC(3),@CC00765                                  0120 00259000
*       LSTSEC='  Z';               /* POINTER 1 TO ADDRESS OF 1ST   */ 00260000
         MVC   LSTSEC(3),@CC00766                                  0121 00261000
*       LET1PTR=ADDR(ALPHABET);     /* LETTER IN ALPHABET & GO TO    */ 00262000
         LA    @15,ALPHABET                                        0122 00263000
         ST    @15,LET1PTR                                         0122 00264000
*       GO TO CECTST29;             /* ROUTINE THAT BUILDS SECLST    */ 00265000
         B     CECTST29                                            0123 00266000
*     END;                                                         0124 00267000
*CECTST14:                                                         0125 00268000
*                                                                  0125 00269000
*   /*****************************************************************/ 00270000
*   /*                                                               */ 00271000
*   /* DECODE THE ENTERED SECTIONS                                   */ 00272000
*   /*                                                               */ 00273000
*   /*****************************************************************/ 00274000
*                                                                  0125 00275000
*   FSTSEC='   ';                   /* INITIALIZE CONSTANTS          */ 00276000
@RF00117 DS    0H                                                  0125 00277000
CECTST14 MVC   FSTSEC(3),@CC00769                                  0125 00278000
*   LSTSEC=FSTSEC;                  /* TO DECODE SECTIONS            */ 00279000
         MVC   LSTSEC(3),FSTSEC                                    0126 00280000
*   R6=ADDR(ALPHABET);              /* IS THE CHAR. IN INBUFR        */ 00281000
         LA    R6,ALPHABET                                         0127 00282000
*   DO I=26 TO 1 BY-1;              /* ALPHABETIC. YES, SET          */ 00283000
         LA    I,26                                                0128 00284000
@DL00128 DS    0H                                                  0129 00285000
*     IF INPUTBUF(1)=LETTER THEN    /* POINTER TO IT AND             */ 00286000
         CLC   INPUTBUF(1,R5),LETTER(R6)                           0129 00287000
         BNE   @RF00129                                            0129 00288000
*       DO;                         /* CONTINUE DECODING. NO         */ 00289000
*         LET1PTR=R6;               /* SET ERROR CODE -06- AND       */ 00290000
         ST    R6,LET1PTR                                          0131 00291000
*         GO TO CECTST15;           /* PRINT ERROR MESSAGE           */ 00292000
         B     CECTST15                                            0132 00293000
*       END;                        /* IFD112I                       */ 00294000
*     R6=R6+1;                                                     0134 00295000
@RF00129 AL    R6,@CF00072                                         0134 00296000
*   END;                                                           0135 00297000
         BCTR  I,0                                                 0135 00298000
         LTR   I,I                                                 0135 00299000
         BP    @DL00128                                            0135 00300000
*   GOTO CECTST03;                                                 0136 00301000
         B     CECTST03                                            0136 00302000
*CECTST15:                          /* DOES SECTION NAME HAVE LENGTH    00303000
*                                      TWO                           */ 00304000
*   SECTIONS='000'B;                /* CLEAR BITS THAT INDICATE THE  */ 00305000
*                                                                  0137 00306000
CECTST15 NI    SECTIONS,B'00011111'                                0137 00307000
*   /*****************************************************************/ 00308000
*   /*                                                               */ 00309000
*   /* LENGTH OF THE TEST SECTION                                    */ 00310000
*   /*                                                               */ 00311000
*   /*****************************************************************/ 00312000
*                                                                  0138 00313000
*   R6=ADDR(ALPHABET);              /* IS THE CHAR IN INBUFR+1       */ 00314000
         LA    R6,ALPHABET                                         0138 00315000
*   DO I=26 TO 1 BY-1;              /* ALPHABETIC. YES, SET A        */ 00316000
         LA    I,26                                                0139 00317000
@DL00139 DS    0H                                                  0140 00318000
*     IF INPUTBUF(2)=LETTER THEN    /* POINTER TO IT AND CONTINUE    */ 00319000
         CLC   INPUTBUF+1(1,R5),LETTER(R6)                         0140 00320000
         BNE   @RF00140                                            0140 00321000
*       DO;                         /* TO DECODE.                    */ 00322000
*         LET2PTR=LET1PTR;                                         0142 00323000
         L     @15,LET1PTR                                         0142 00324000
         ST    @15,LET2PTR                                         0142 00325000
*         LET1PTR=R6;                                              0143 00326000
         ST    R6,LET1PTR                                          0143 00327000
*         GO TO CECTST21;                                          0144 00328000
         B     CECTST21                                            0144 00329000
*       END;                                                       0145 00330000
*     R6=R6+1;                                                     0146 00331000
@RF00140 AL    R6,@CF00072                                         0146 00332000
*   END;                                                           0147 00333000
         BCTR  I,0                                                 0147 00334000
         LTR   I,I                                                 0147 00335000
         BP    @DL00139                                            0147 00336000
*   SECT1='1'B;                     /* NO, SET BIT INDICATING TEST   */ 00337000
*                                                                  0148 00338000
         OI    SECT1,B'10000000'                                   0148 00339000
*   /*****************************************************************/ 00340000
*   /*                                                               */ 00341000
*   /* SECTION OF LENGTH ONE                                         */ 00342000
*   /*                                                               */ 00343000
*   /*****************************************************************/ 00344000
*                                                                  0149 00345000
*   FSTSEC2=INPUTBUF(1);            /* RETAIN SECTION NAME.          */ 00346000
         MVC   FSTSEC2(1),INPUTBUF(R5)                             0149 00347000
*   IF INPUTBUF(2)='-' THEN         /* IS THE CHAR. IN INBUFR+1      */ 00348000
         CLI   INPUTBUF+1(R5),C'-'                                 0150 00349000
         BNE   @RF00150                                            0150 00350000
*     DO;                                                          0151 00351000
*       DASH='1'B;                                                 0152 00352000
         OI    DASH,B'00000001'                                    0152 00353000
*       GO TO CECTST17;             /* A HYPHEN. YES,CONTINUE        */ 00354000
         B     CECTST17                                            0153 00355000
*     END;                                                         0154 00356000
*                                                                  0154 00357000
*   /*****************************************************************/ 00358000
*   /*                                                               */ 00359000
*   /* DECODING. NO, SET LAST                                        */ 00360000
*   /*                                                               */ 00361000
*   /*****************************************************************/ 00362000
*                                                                  0155 00363000
*CECTST16:                          /* ROUTINE FOR INCLUSIVE SECTIONS   00364000
*                                      OF LENGTH ONE                 */ 00365000
*   LSTSEC2=INPUTBUF(1);            /* SECTION EQUAL TO FIRST        */ 00366000
*                                                                  0155 00367000
@RF00150 DS    0H                                                  0155 00368000
CECTST16 MVC   LSTSEC2(1),INPUTBUF(R5)                             0155 00369000
*   /*****************************************************************/ 00370000
*   /*                                                               */ 00371000
*   /* SECTION                                                       */ 00372000
*   /*                                                               */ 00373000
*   /*****************************************************************/ 00374000
*                                                                  0156 00375000
*   R5=R5+1;                        /* INCREMENT INBUFR PTR          */ 00376000
         AL    R5,@CF00072                                         0156 00377000
*   GO TO CECTST29;                 /* GO TO ROUTINE THAT            */ 00378000
*                                                                  0157 00379000
         B     CECTST29                                            0157 00380000
*   /*****************************************************************/ 00381000
*   /*                                                               */ 00382000
*   /* BUILDS SECLST                                                 */ 00383000
*   /*                                                               */ 00384000
*   /*****************************************************************/ 00385000
*                                                                  0158 00386000
*CECTST17:                                                         0158 00387000
*                                                                  0158 00388000
*   /*****************************************************************/ 00389000
*   /*                                                               */ 00390000
*   /* IS A VALID INCLUSIVE RANGE ENTERED                            */ 00391000
*   /*                                                               */ 00392000
*   /*****************************************************************/ 00393000
*                                                                  0158 00394000
*   R6=ADDR(ALPHABET);              /* IS THE CHAR. IN INBUFR+2      */ 00395000
CECTST17 LA    R6,ALPHABET                                         0158 00396000
*   DO I=26 TO 1 BY-1;              /* ALPHABETIC. NO, SET ERROR     */ 00397000
         LA    I,26                                                0159 00398000
@DL00159 DS    0H                                                  0160 00399000
*     IF INPUTBUF(3)=LETTER THEN    /* CODE 07 AND PRINT ERROR       */ 00400000
         CLC   INPUTBUF+2(1,R5),LETTER(R6)                         0160 00401000
         BE    @RT00160                                            0160 00402000
*       GO TO CECTST19;             /* MESSAGE IFD112I. YES,         */ 00403000
*     R6=R6+1;                      /* CONTINUE TO DECODE            */ 00404000
         AL    R6,@CF00072                                         0162 00405000
*   END;                                                           0163 00406000
         BCTR  I,0                                                 0163 00407000
         LTR   I,I                                                 0163 00408000
         BP    @DL00159                                            0163 00409000
*   R5=R5+2;                        /* PT TO ERROR                   */ 00410000
         AL    R5,@CF00139                                         0164 00411000
*   GO TO CECTST03;                                                0165 00412000
         B     CECTST03                                            0165 00413000
*CECTST19:                          /* IS SECTION NAME OF INCLUSIVE     00414000
*                                      RANGE LENGTH TWO              */ 00415000
*   R5=R5+2;                        /* INCREMENT INBUFR PTR          */ 00416000
CECTST19 AL    R5,@CF00139                                         0166 00417000
*   R6=ADDR(ALPHABET);              /* IS THE CHAR. IN INBUFR+1      */ 00418000
         LA    R6,ALPHABET                                         0167 00419000
*   DO I=26 TO 1 BY-1;              /* ALPHABETIC. NO, GO TO         */ 00420000
         LA    I,26                                                0168 00421000
@DL00168 DS    0H                                                  0169 00422000
*     IF INPUTBUF(2)=LETTER THEN    /* ROUTINE FOR INCLUSIVE         */ 00423000
         CLC   INPUTBUF+1(1,R5),LETTER(R6)                         0169 00424000
         BE    @RT00169                                            0169 00425000
*       GO TO CECTST20;             /* SECTIONS OF LENGTH ONE        */ 00426000
*     R6=R6+1;                      /* YES, CONTINUE TO DECODE       */ 00427000
         AL    R6,@CF00072                                         0171 00428000
*   END;                                                           0172 00429000
         BCTR  I,0                                                 0172 00430000
         LTR   I,I                                                 0172 00431000
         BP    @DL00168                                            0172 00432000
*   GO TO CECTST16;                 /* CONTINUE DECODING.            */ 00433000
         B     CECTST16                                            0173 00434000
*CECTST20:                          /* IS SECTION NAME OF INCLUSIVE     00435000
*                                      RANGE LENGTH THREE            */ 00436000
*   R6=ADDR(ALPHABET);              /* IS THE CHAR. IN INBUFR+2      */ 00437000
CECTST20 LA    R6,ALPHABET                                         0174 00438000
*   DO I=26 TO 1 BY-1;              /* ALPHABETIC. NO,GO TO          */ 00439000
         LA    I,26                                                0175 00440000
@DL00175 DS    0H                                                  0176 00441000
*     IF INPUTBUF(3)=LETTER THEN    /* ROUTINE FOR INCLUSIVE         */ 00442000
         CLC   INPUTBUF+2(1,R5),LETTER(R6)                         0176 00443000
         BE    @RT00176                                            0176 00444000
*       GO TO CECTST26;             /* SECTIONS OF LENGTH TWO        */ 00445000
*     R6=R6+1;                      /* YES,GO TO ROUTINE FOR         */ 00446000
         AL    R6,@CF00072                                         0178 00447000
*   END;                            /* INCLUSIVE SECTIONS OF         */ 00448000
         BCTR  I,0                                                 0179 00449000
         LTR   I,I                                                 0179 00450000
         BP    @DL00175                                            0179 00451000
*   GO TO CECTST22;                 /* LENGTH THREE.                 */ 00452000
         B     CECTST22                                            0180 00453000
*CECTST21:                          /* DOES SECTION NAME HAVE LENGTH    00454000
*                                      THREE                         */ 00455000
*   R6=ADDR(ALPHABET);              /* IS THE CHAR. IN INBUFR+2      */ 00456000
CECTST21 LA    R6,ALPHABET                                         0181 00457000
*   DO I=26 TO 1 BY-1;              /* ALPHABETIC. YES, SET          */ 00458000
         LA    I,26                                                0182 00459000
@DL00182 DS    0H                                                  0183 00460000
*     IF INPUTBUF(3)=LETTER THEN    /* POINTER TO IT AND             */ 00461000
         CLC   INPUTBUF+2(1,R5),LETTER(R6)                         0183 00462000
         BNE   @RF00183                                            0183 00463000
*       DO;                         /* CONTINUE TO DECODE            */ 00464000
*         LET3PTR=LET2PTR;                                         0185 00465000
         L     @15,LET2PTR                                         0185 00466000
         ST    @15,LET3PTR                                         0185 00467000
*         LET2PTR=LET1PTR;                                         0186 00468000
         L     @15,LET1PTR                                         0186 00469000
         ST    @15,LET2PTR                                         0186 00470000
*         LET1PTR=R6;                                              0187 00471000
         ST    R6,LET1PTR                                          0187 00472000
*         GO TO CECTST25;                                          0188 00473000
         B     CECTST25                                            0188 00474000
*       END;                                                       0189 00475000
*     R6=R6+1;                                                     0190 00476000
@RF00183 AL    R6,@CF00072                                         0190 00477000
*   END;                                                           0191 00478000
         BCTR  I,0                                                 0191 00479000
         LTR   I,I                                                 0191 00480000
         BP    @DL00182                                            0191 00481000
*   SECTIONS='010'B;                /* NO, SET BIT INDICATING        */ 00482000
*                                                                  0192 00483000
         NI    SECTIONS,B'01011111'                                0192 00484000
         OI    SECTIONS,B'01000000'                                0192 00485000
*   /*****************************************************************/ 00486000
*   /*                                                               */ 00487000
*   /* TEST SECTION OF LENGTH TWO & SAVE THE SECTION                 */ 00488000
*   /*                                                               */ 00489000
*   /*****************************************************************/ 00490000
*                                                                  0193 00491000
*   FSTSEC1=INPUTBUF(1:2);          /* IN FSTSEC.                    */ 00492000
         MVC   FSTSEC1(2),INPUTBUF(R5)                             0193 00493000
*   IF INPUTBUF(3)='-' THEN         /* IS CHAR. IN INBUFR+2 A -.     */ 00494000
         CLI   INPUTBUF+2(R5),C'-'                                 0194 00495000
         BNE   @RF00194                                            0194 00496000
*     DO;                                                          0195 00497000
*       DASH='1'B;                                                 0196 00498000
         OI    DASH,B'00000001'                                    0196 00499000
*       GO TO CECTST23;             /* YES, CONTINUE TO DECODE       */ 00500000
         B     CECTST23                                            0197 00501000
*     END;                                                         0198 00502000
*CECTST22:                          /* ROUTINE FOR INCLUSIVE SECTIONS   00503000
*                                      OF LENGTH TWO                 */ 00504000
*   LSTSEC1=INPUTBUF(1:2);          /* PUT SECTION IN LSTSEC         */ 00505000
@RF00194 DS    0H                                                  0199 00506000
CECTST22 MVC   LSTSEC1(2),INPUTBUF(R5)                             0199 00507000
*   R5=R5+2;                        /* INCREMENT INBUFR POINTER      */ 00508000
         AL    R5,@CF00139                                         0200 00509000
*   GO TO CECTST29;                 /* GO TO THE ROUTINE FOR         */ 00510000
*                                                                  0201 00511000
         B     CECTST29                                            0201 00512000
*   /*****************************************************************/ 00513000
*   /*                                                               */ 00514000
*   /* BUILDING SECLST                                               */ 00515000
*   /*                                                               */ 00516000
*   /*****************************************************************/ 00517000
*                                                                  0202 00518000
*CECTST23:                          /* IS INCLUSIVE RANGE VALID      */ 00519000
*   R5=R5+3;                        /* INCREMENT INBUFR PTR          */ 00520000
CECTST23 AL    R5,@CF00081                                         0202 00521000
*   DO J=1 TO 2;                    /* ARE THE CHAR. IN INBUFR AND   */ 00522000
         LA    @15,1                                               0203 00523000
         STH   @15,J                                               0203 00524000
@DL00203 DS    0H                                                  0204 00525000
*     R6=ADDR(ALPHABET);            /* INBUFR+1 ALPHABETIC. YES,     */ 00526000
         LA    R6,ALPHABET                                         0204 00527000
*     DO I=26 TO 1 BY-1;            /* CONTINUE TO DECODE. NO, SET   */ 00528000
         LA    I,26                                                0205 00529000
@DL00205 DS    0H                                                  0206 00530000
*       IF INPUTBUF(J)=LETTER THEN  /* ERROR CODE TO -07-            */ 00531000
         LH    @15,J                                               0206 00532000
         ALR   @15,R5                                              0206 00533000
         BCTR  @15,0                                               0206 00534000
         CLC   INPUTBUF(1,@15),LETTER(R6)                          0206 00535000
         BE    @RT00206                                            0206 00536000
*         GO TO CECTST24;           /* AND PRINT ERROR               */ 00537000
*       R6=R6+1;                    /* MESSAGE IFD112I               */ 00538000
         AL    R6,@CF00072                                         0208 00539000
*     END;                                                         0209 00540000
         BCTR  I,0                                                 0209 00541000
         LTR   I,I                                                 0209 00542000
         BP    @DL00205                                            0209 00543000
*     R5=R5+J-1;                    /* PT TO ERROR                   */ 00544000
         LR    @15,R5                                              0210 00545000
         AH    @15,J                                               0210 00546000
         BCTR  @15,0                                               0210 00547000
         LR    R5,@15                                              0210 00548000
*     GOTO CECTST03;                                               0211 00549000
         B     CECTST03                                            0211 00550000
*CECTST24:                                                         0212 00551000
*   END;                                                           0212 00552000
CECTST24 LA    @15,1                                               0212 00553000
         AH    @15,J                                               0212 00554000
         STH   @15,J                                               0212 00555000
         C     @15,@CF00139                                        0212 00556000
         BNH   @DL00203                                            0212 00557000
*   R6=ADDR(ALPHABET);              /* IS THE CHAR. IN INBUFR+2      */ 00558000
         LA    R6,ALPHABET                                         0213 00559000
*   DO I=26 TO 1 BY-1;              /* ALPHABETIC. YES,GO TO THE     */ 00560000
         LA    I,26                                                0214 00561000
@DL00214 DS    0H                                                  0215 00562000
*     IF INPUTBUF(3)=LETTER THEN    /* ROUTINE FOR INCLUSIVE         */ 00563000
         CLC   INPUTBUF+2(1,R5),LETTER(R6)                         0215 00564000
         BE    @RT00215                                            0215 00565000
*       GO TO CECTST26;             /* SECTIONS OF LENGTH THREE      */ 00566000
*     R6=R6+1;                      /* NO, SEE IF INPUTBUF(1:2)      */ 00567000
         AL    R6,@CF00072                                         0217 00568000
*   END;                            /* IS > FSTSEC+1. YES,           */ 00569000
         BCTR  I,0                                                 0218 00570000
         LTR   I,I                                                 0218 00571000
         BP    @DL00214                                            0218 00572000
*   IF INPUTBUF(1:2)>FSTSEC1 THEN   /* CONTINUE TO DECODE. NO,       */ 00573000
         CLC   INPUTBUF(2,R5),FSTSEC1                              0219 00574000
         BH    @RT00219                                            0219 00575000
*     GO TO CECTST22;               /* SET ERROR CODE -07- AND       */ 00576000
*   R5=R5+1;                        /* PT TO ERROR                   */ 00577000
         AL    R5,@CF00072                                         0221 00578000
*   GOTO CECTST03;                                                 0222 00579000
         B     CECTST03                                            0222 00580000
*CECTST25:                          /* SECTION NAME OF LENGTH THREE  */ 00581000
*   SECTIONS='001'B;                /* SET BIT TO INDICATE SECTION   */ 00582000
*                                                                  0223 00583000
CECTST25 NI    SECTIONS,B'00111111'                                0223 00584000
         OI    SECTIONS,B'00100000'                                0223 00585000
*   /*****************************************************************/ 00586000
*   /*                                                               */ 00587000
*   /* NAME OF LENGTH THREE                                          */ 00588000
*   /*                                                               */ 00589000
*   /*****************************************************************/ 00590000
*                                                                  0224 00591000
*   FSTSEC=INPUTBUF(1:3);           /* SAVE SECTION NAME             */ 00592000
         MVC   FSTSEC(3),INPUTBUF(R5)                              0224 00593000
*   IF INPUTBUF(4)='-' THEN         /* IS THE CHAR. IN INBUFR+3 A    */ 00594000
         CLI   INPUTBUF+3(R5),C'-'                                 0225 00595000
         BNE   @RF00225                                            0225 00596000
*     DO;                                                          0226 00597000
*       DASH='1'B;                                                 0227 00598000
         OI    DASH,B'00000001'                                    0227 00599000
*       GO TO CECTST27;             /* HYPHEN. YES,CONTINUE TO DECODE*/ 00600000
         B     CECTST27                                            0228 00601000
*     END;                                                         0229 00602000
*                                                                  0229 00603000
*   /*****************************************************************/ 00604000
*   /*                                                               */ 00605000
*   /* NO, GO TO ROUTINE THAT BUILDS SECLST                          */ 00606000
*   /*                                                               */ 00607000
*   /*****************************************************************/ 00608000
*                                                                  0230 00609000
*CECTST26:                          /* ROUTINE FOR INCLUSIVE SECTIONS   00610000
*                                      OF LENGTH THREE               */ 00611000
*   LSTSEC=INPUTBUF(1:3);           /* SET LSTSEC EQUAL TO SECTION   */ 00612000
*                                                                  0230 00613000
@RF00225 DS    0H                                                  0230 00614000
CECTST26 MVC   LSTSEC(3),INPUTBUF(R5)                              0230 00615000
*   /*****************************************************************/ 00616000
*   /*                                                               */ 00617000
*   /* IN INBUFR                                                     */ 00618000
*   /*                                                               */ 00619000
*   /*****************************************************************/ 00620000
*                                                                  0231 00621000
*   R5=R5+3;                        /* INCREMENT INBUFR PTR          */ 00622000
         AL    R5,@CF00081                                         0231 00623000
*   GO TO CECTST29;                 /* GO TO ROUTINE THAT            */ 00624000
*                                                                  0232 00625000
         B     CECTST29                                            0232 00626000
*   /*****************************************************************/ 00627000
*   /*                                                               */ 00628000
*   /* BUILDS SECLST                                                 */ 00629000
*   /*                                                               */ 00630000
*   /*****************************************************************/ 00631000
*                                                                  0233 00632000
*CECTST27:                          /* IS SECTION NAME OF INCLUSIVE     00633000
*                                      RANGE LENGTH THREE            */ 00634000
*                                                                  0233 00635000
*   /*****************************************************************/ 00636000
*   /*                                                               */ 00637000
*   /* AND IS IT A VALID INCLUSIVE RANGE                             */ 00638000
*   /*                                                               */ 00639000
*   /*****************************************************************/ 00640000
*                                                                  0233 00641000
*   R5=R5+4;                        /* INCREMENT INBUFR PTR          */ 00642000
CECTST27 AL    R5,@CF00068                                         0233 00643000
*   DO J=1 TO 3;                    /* ARE THE CHAR. INBUFR,INBUFR+1 */ 00644000
         LA    @15,1                                               0234 00645000
         STH   @15,J                                               0234 00646000
@DL00234 DS    0H                                                  0235 00647000
*     R6=ADDR(ALPHABET);            /* AND INBUFR+2 ALPHABETIC. YES  */ 00648000
         LA    R6,ALPHABET                                         0235 00649000
*     DO I=26 TO 1 BY-1;            /* CONTINUE TO DECODE. NO,SET    */ 00650000
         LA    I,26                                                0236 00651000
@DL00236 DS    0H                                                  0237 00652000
*       IF INPUTBUF(J)=LETTER THEN  /* ERROR CODE -07- AND           */ 00653000
         LH    @15,J                                               0237 00654000
         ALR   @15,R5                                              0237 00655000
         BCTR  @15,0                                               0237 00656000
         CLC   INPUTBUF(1,@15),LETTER(R6)                          0237 00657000
         BE    @RT00237                                            0237 00658000
*         GO TO CECTST28;           /* PRINT ERROR MESSAGE           */ 00659000
*       R6=R6+1;                    /* IFD112I                       */ 00660000
         AL    R6,@CF00072                                         0239 00661000
*     END;                                                         0240 00662000
         BCTR  I,0                                                 0240 00663000
         LTR   I,I                                                 0240 00664000
         BP    @DL00236                                            0240 00665000
*     R5=R5+J-1;                    /* PT TO ERROR                   */ 00666000
         LR    @15,R5                                              0241 00667000
         AH    @15,J                                               0241 00668000
         BCTR  @15,0                                               0241 00669000
         LR    R5,@15                                              0241 00670000
*     GOTO CECTST03;                                               0242 00671000
         B     CECTST03                                            0242 00672000
*CECTST28:                                                         0243 00673000
*   END;                                                           0243 00674000
CECTST28 LA    @15,1                                               0243 00675000
         AH    @15,J                                               0243 00676000
         STH   @15,J                                               0243 00677000
         C     @15,@CF00081                                        0243 00678000
         BNH   @DL00234                                            0243 00679000
*   GO TO CECTST26;                 /* GO TO ROUTINE FOR INCLUSIVE   */ 00680000
*                                                                  0244 00681000
         B     CECTST26                                            0244 00682000
*   /*****************************************************************/ 00683000
*   /*                                                               */ 00684000
*   /* SECTIONS OF LENGTH THREE.                                     */ 00685000
*   /*                                                               */ 00686000
*   /*****************************************************************/ 00687000
*                                                                  0245 00688000
*CECTST29:                          /* CHECK FOR INCL RNG DONE       */ 00689000
*   IF FSTSEC=LSTSEC&               /* ARE SECTS NOW EQUAL           */ 00690000
*       DASH='1'B THEN              /* +IS THIS AN INCL RANGE        */ 00691000
CECTST29 CLC   FSTSEC(3),LSTSEC                                    0245 00692000
         BNE   @RF00245                                            0245 00693000
         TM    DASH,B'00000001'                                    0245 00694000
         BNO   @RF00245                                            0245 00695000
*     DO;                           /* YES                           */ 00696000
*CECTST2B:                          /* SET UP FOR NEXT ENTRY         */ 00697000
*       R5=R5-1;                    /* UPDATE INPUT PTR              */ 00698000
CECTST2B BCTR  R5,0                                                0247 00699000
*       GO TO CECTST03;             /* PROCESS NEXT ENTRY            */ 00700000
         B     CECTST03                                            0248 00701000
*     END;                                                         0249 00702000
*CECTST2A:                                                         0250 00703000
*                                                                  0250 00704000
*   /*****************************************************************/ 00705000
*   /*                                                               */ 00706000
*   /* ROUTINE FOR BUILDING SECLST                                   */ 00707000
*   /*                                                               */ 00708000
*   /*****************************************************************/ 00709000
*                                                                  0250 00710000
*   IF FSTSEC>LSTSEC THEN           /* IS INCLUSIVE RANGE VALID.     */ 00711000
@RF00245 DS    0H                                                  0250 00712000
CECTST2A CLC   FSTSEC(3),LSTSEC                                    0250 00713000
         BH    @RT00250                                            0250 00714000
*     GOTO CECTST2B;                                               0251 00715000
*                                                                  0251 00716000
*   /*****************************************************************/ 00717000
*   /*                                                               */ 00718000
*   /* IFD112I WITH ERROR CODE 07.                                   */ 00719000
*   /*                                                               */ 00720000
*   /*****************************************************************/ 00721000
*                                                                  0252 00722000
*   IF SECCNTR=26 THEN              /* IS SECTION COUNTER 26. YES,   */ 00723000
         CLC   SECCNTR(4),@CF00494                                 0252 00724000
         BE    @RT00252                                            0252 00725000
*     GO TO CECTST06;               /* FIND SLASH AND PRINT          */ 00726000
*                                                                  0253 00727000
*   /*****************************************************************/ 00728000
*   /*                                                               */ 00729000
*   /* MESSAGE INDICATING MORE THAN 26 SECTIONS SPECIFIED            */ 00730000
*   /*                                                               */ 00731000
*   /*****************************************************************/ 00732000
*                                                                  0254 00733000
*   TSTFLG=TSTFLG&&TSTFLG;          /* INIT FLAG                     */ 00734000
         XC    TSTFLG(1,R8),TSTFLG(R8)                             0254 00735000
*   IF SECT1='1'B THEN              /* PUT SECTION NAME IN SECLST.   */ 00736000
         TM    SECT1,B'10000000'                                   0255 00737000
         BNO   @RF00255                                            0255 00738000
*     TSTSCTN1=FSTSEC2;                                            0256 00739000
         MVC   TSTSCTN1(1,R8),FSTSEC2                              0256 00740000
*   IF SECT2='1'B THEN                                             0257 00741000
@RF00255 TM    SECT2,B'01000000'                                   0257 00742000
         BNO   @RF00257                                            0257 00743000
*     TSTSCTN2=FSTSEC1;                                            0258 00744000
         MVC   TSTSCTN2(2,R8),FSTSEC1                              0258 00745000
*   IF SECT3='1'B THEN                                             0259 00746000
@RF00257 TM    SECT3,B'00100000'                                   0259 00747000
         BNO   @RF00259                                            0259 00748000
*     TSTSCTN3=FSTSEC;                                             0260 00749000
         MVC   TSTSCTN3(3,R8),FSTSEC                               0260 00750000
*   SECCNTR=SECCNTR+1;              /* INCREMENT SECTION COUNTER     */ 00751000
@RF00259 LA    @15,1                                               0261 00752000
         AL    @15,SECCNTR                                         0261 00753000
         ST    @15,SECCNTR                                         0261 00754000
*   R8=R8+4;                        /* UPDATE SECLST POINTER.        */ 00755000
         AL    R8,@CF00068                                         0262 00756000
*   IF LSTSEC=FSTSEC THEN           /* HAS THIS BEEN FULLY DECODED   */ 00757000
         CLC   LSTSEC(3),FSTSEC                                    0263 00758000
         BE    @RT00263                                            0263 00759000
*     GO TO CECTST34;               /* YES, CONTINUE TO DECODE       */ 00760000
*   IF SECT1^='1'B THEN             /* DOES THE SECTION NAME HAVE    */ 00761000
         TM    SECT1,B'10000000'                                   0265 00762000
         BNO   @RT00265                                            0265 00763000
*     GO TO CECTST31;               /* LENGTH ONE. NO, FIND HOW      */ 00764000
*                                                                  0266 00765000
*   /*****************************************************************/ 00766000
*   /*                                                               */ 00767000
*   /* LONG IT IS.                                                   */ 00768000
*   /*                                                               */ 00769000
*   /*****************************************************************/ 00770000
*                                                                  0267 00771000
*   IF FSTSEC2='Z' THEN             /* YES, SEE IF AN UPDATE MUST    */ 00772000
         CLI   FSTSEC2,C'Z'                                        0267 00773000
         BNE   @RF00267                                            0267 00774000
*     DO;                           /* OCCUR. YES, PERFORM UPDATE    */ 00775000
*       SECTIONS='010'B;            /* NO, CONTINUE.                 */ 00776000
         NI    SECTIONS,B'01011111'                                0269 00777000
         OI    SECTIONS,B'01000000'                                0269 00778000
*       FSTSEC=' AA';                                              0270 00779000
         MVC   FSTSEC(3),@CC00809                                  0270 00780000
*       LET1PTR=ADDR(ALPHABET);                                    0271 00781000
         LA    @15,ALPHABET                                        0271 00782000
         ST    @15,LET1PTR                                         0271 00783000
*       LET2PTR=LET1PTR;                                           0272 00784000
         ST    @15,LET2PTR                                         0272 00785000
*       GO TO CECTST2A;                                            0273 00786000
         B     CECTST2A                                            0273 00787000
*     END;                                                         0274 00788000
*CECTST30:                          /* UPDATE POINTER TO LAST LETTER    00789000
*                                      IN SECTION NAME               */ 00790000
*   R6=LET1PTR+1;                   /* UPDATE POINTER TO POINT TO    */ 00791000
@RF00267 DS    0H                                                  0275 00792000
CECTST30 LA    R6,1                                                0275 00793000
         AL    R6,LET1PTR                                          0275 00794000
*   FSTSEC2=LETTER;                 /* NEXT LETTER IN ALPHABET AND   */ 00795000
         MVC   FSTSEC2(1),LETTER(R6)                               0276 00796000
*   LET1PTR=R6;                     /* UPDATE FIRST SECTION TO       */ 00797000
         ST    R6,LET1PTR                                          0277 00798000
*   GO TO CECTST2A;                 /* REFLECT CHANGE AND CONTINUE   */ 00799000
         B     CECTST2A                                            0278 00800000
*CECTST31:                          /* UPDATE POINTERS TO SHOW     0279 00801000
*                                      SECTION HAS REACHED LENGTH  0279 00802000
*                                      THREE                         */ 00803000
*   IF SECT2^='1'B THEN             /* DOES SECTION NAME HAVE        */ 00804000
CECTST31 TM    SECT2,B'01000000'                                   0279 00805000
         BNO   @RT00279                                            0279 00806000
*     GO TO CECTST33;               /* LENGTH ONE. NO, FIND          */ 00807000
*                                                                  0280 00808000
*   /*****************************************************************/ 00809000
*   /*                                                               */ 00810000
*   /* HOW LONG IT IS.                                               */ 00811000
*   /*                                                               */ 00812000
*   /*****************************************************************/ 00813000
*                                                                  0281 00814000
*   IF FSTSEC2^='Z' THEN            /* YES, SEE IF LAST LETTER OF  0281 00815000
*                                      NAME                          */ 00816000
         CLI   FSTSEC2,C'Z'                                        0281 00817000
         BNE   @RT00281                                            0281 00818000
*     GO TO CECTST30;               /* IS A Z. NO,GO TO ROUTINE THAT */ 00819000
*                                                                  0282 00820000
*   /*****************************************************************/ 00821000
*   /*                                                               */ 00822000
*   /* PERFORMS UPDATE OF LAST LETTER                                */ 00823000
*   /*                                                               */ 00824000
*   /*****************************************************************/ 00825000
*                                                                  0283 00826000
*   IF FSTSEC(2)='Z' THEN           /* YES, SEE IF MIDDLE LETTER OF  */ 00827000
         CLI   FSTSEC+1,C'Z'                                       0283 00828000
         BNE   @RF00283                                            0283 00829000
*     DO;                           /* NAME IS A Z. YES,PERFORM    0284 00830000
*                                      UPDATE                        */ 00831000
*       SECTIONS='001'B;            /* TO SECTION OF LENGTH THREE. 0285 00832000
*                                      NO,                           */ 00833000
         NI    SECTIONS,B'00111111'                                0285 00834000
         OI    SECTIONS,B'00100000'                                0285 00835000
*       FSTSEC='AAA';               /* PERFORM REGULAR UPDATE FOR    */ 00836000
         MVC   FSTSEC(3),@CC00814                                  0286 00837000
*       LET1PTR=ADDR(ALPHABET);     /* MIDDLE LETTER OF SECTION NAME */ 00838000
         LA    @15,ALPHABET                                        0287 00839000
         ST    @15,LET1PTR                                         0287 00840000
*       LET2PTR=LET1PTR;                                           0288 00841000
         ST    @15,LET2PTR                                         0288 00842000
*       LET3PTR=LET1PTR;                                           0289 00843000
         ST    @15,LET3PTR                                         0289 00844000
*       GO TO CECTST2A;                                            0290 00845000
         B     CECTST2A                                            0290 00846000
*     END;                                                         0291 00847000
*CECTST32:                          /* UPDATE POINTER TO MIDDLE OR 0292 00848000
*                                      FIRST LETTER IN SECTION NAME  */ 00849000
*   R6=LET2PTR+1;                   /* PERFORM UPDATE FOR MIDDLE     */ 00850000
@RF00283 DS    0H                                                  0292 00851000
CECTST32 LA    R6,1                                                0292 00852000
         AL    R6,LET2PTR                                          0292 00853000
*   FSTSEC(2)=LETTER;               /* LETTER OF SECTION NAME        */ 00854000
         MVC   FSTSEC+1(1),LETTER(R6)                              0293 00855000
*   LET2PTR=R6;                                                    0294 00856000
         ST    R6,LET2PTR                                          0294 00857000
*   FSTSEC2='A';                                                   0295 00858000
         MVI   FSTSEC2,C'A'                                        0295 00859000
*   LET1PTR=ADDR(ALPHABET);                                        0296 00860000
         LA    @15,ALPHABET                                        0296 00861000
         ST    @15,LET1PTR                                         0296 00862000
*   GO TO CECTST2A;                 /* CONTINUE                      */ 00863000
         B     CECTST2A                                            0297 00864000
*CECTST33:                          /* UPDATE POINTERS FOR FIRST   0298 00865000
*                                      LETTER OF SECTION LENGTH THREE*/ 00866000
*   IF FSTSEC2^='Z' THEN            /* TRIPLE LETTER SECTION. IS LAST*/ 00867000
CECTST33 CLI   FSTSEC2,C'Z'                                        0298 00868000
         BNE   @RT00298                                            0298 00869000
*     GO TO CECTST30;               /* LETTER IN NAME A Z. NO,     0299 00870000
*                                      PERFORM                       */ 00871000
*                                                                  0299 00872000
*   /*****************************************************************/ 00873000
*   /*                                                               */ 00874000
*   /* NORMAL UPDATE FOR LAST LETTER IN TEST SECTION NAME            */ 00875000
*   /*                                                               */ 00876000
*   /*****************************************************************/ 00877000
*                                                                  0300 00878000
*   IF FSTSEC(2)^='Z' THEN          /* IS MIDDLE LETTER IN NAME A Z  */ 00879000
         CLI   FSTSEC+1,C'Z'                                       0300 00880000
         BNE   @RT00300                                            0300 00881000
*     GO TO CECTST32;               /* NO, PERFORM NORMAL UPDATE FOR */ 00882000
*                                                                  0301 00883000
*   /*****************************************************************/ 00884000
*   /*                                                               */ 00885000
*   /* MIDDLE LETTER IN SECTION NAME                                 */ 00886000
*   /*                                                               */ 00887000
*   /*****************************************************************/ 00888000
*                                                                  0302 00889000
*   IF FSTSEC(1)='Z' THEN           /* IF FIRST LETTER IN TRIPLE     */ 00890000
         CLI   FSTSEC,C'Z'                                         0302 00891000
         BE    @RT00302                                            0302 00892000
*     GOTO CECTST03;                                               0303 00893000
*                                                                  0303 00894000
*   /*****************************************************************/ 00895000
*   /*                                                               */ 00896000
*   /* SET ERROR CODE -07- AND PRINT ERROR MESSAGE IFD112I           */ 00897000
*   /*                                                               */ 00898000
*   /*****************************************************************/ 00899000
*                                                                  0304 00900000
*   R6=LET3PTR+1;                   /* NO, PERFORM NORMAL UPDATE     */ 00901000
         LA    R6,1                                                0304 00902000
         AL    R6,LET3PTR                                          0304 00903000
*   FSTSEC(1)=LETTER;               /* FOR FIRST LETTER OF TRIPLE    */ 00904000
         MVC   FSTSEC(1),LETTER(R6)                                0305 00905000
*   LET3PTR=R6;                     /* SECTION NAME                  */ 00906000
         ST    R6,LET3PTR                                          0306 00907000
*   FSTSEC1='AA';                                                  0307 00908000
         MVC   FSTSEC1(2),@CC00819                                 0307 00909000
*   LET1PTR=ADDR(ALPHABET);                                        0308 00910000
         LA    @15,ALPHABET                                        0308 00911000
         ST    @15,LET1PTR                                         0308 00912000
*   LET2PTR=LET1PTR;                                               0309 00913000
         ST    @15,LET2PTR                                         0309 00914000
*   GO TO CECTST2A;                 /* CONTINUE                      */ 00915000
         B     CECTST2A                                            0310 00916000
*CECTST34:                                                         0311 00917000
*                                                                  0311 00918000
*   /*****************************************************************/ 00919000
*   /*                                                               */ 00920000
*   /* DECODE THE DELIMITERS                                         */ 00921000
*   /*                                                               */ 00922000
*   /*****************************************************************/ 00923000
*                                                                  0311 00924000
*   IF INPUTBUF(1)='/' THEN         /* IS CHAR. IN INBUFR+0 A        */ 00925000
CECTST34 CLI   INPUTBUF(R5),C'/'                                   0311 00926000
         BE    @RT00311                                            0311 00927000
*     GO TO CECTST99;               /* SLASH. YES, CONTINUE TO       */ 00928000
*   IF INPUTBUF(1)^=',' THEN        /* DECODE. NO, IS THE CHAR.      */ 00929000
         CLI   INPUTBUF(R5),C','                                   0313 00930000
         BNE   @RT00313                                            0313 00931000
*     GOTO CECTST03;                                               0314 00932000
*   DASH='0'B;                      /* INIT INT FLAG FOR RANGE       */ 00933000
         NI    DASH,B'11111110'                                    0315 00934000
*   R6=ADDR(NUMBERS);               /* PTR TO NUM BUFFER             */ 00935000
         LA    R6,NUMBERS                                          0316 00936000
*   DO I=10 TO 1 BY-1;              /* INBUFR+1 NUMERIC. YES,        */ 00937000
         LA    I,10                                                0317 00938000
@DL00317 DS    0H                                                  0318 00939000
*     IF INPUTBUF(2)=NUMBER THEN    /* STOP LOOKING FOR TEST         */ 00940000
         CLC   INPUTBUF+1(1,R5),NUMBER(R6)                         0318 00941000
         BNE   @RF00318                                            0318 00942000
*       DO;                                                        0319 00943000
*                                                                  0319 00944000
*         /***********************************************************/ 00945000
*         /*                                                         */ 00946000
*         /* SCAN TST FIELD FOR LEADING ZERO ENTRIES                 */ 00947000
*         /*                                                         */ 00948000
*         /***********************************************************/ 00949000
*                                                                  0320 00950000
*         N=1;                      /* INIT PTR                      */ 00951000
         MVC   N(2),@CH00072                                       0320 00952000
*CECTST36:                                                         0321 00953000
*         IF INPUTBUF(N)=','|       /* NEW                           */ 00954000
*             INPUTBUF(N)='-' THEN  /* ENTRY                         */ 00955000
CECTST36 LH    @15,N                                               0321 00956000
         ALR   @15,R5                                              0321 00957000
         BCTR  @15,0                                               0321 00958000
         CLI   INPUTBUF(@15),C','                                  0321 00959000
         BE    @RT00321                                            0321 00960000
         LH    @15,N                                               0321 00961000
         ALR   @15,R5                                              0321 00962000
         BCTR  @15,0                                               0321 00963000
         CLI   INPUTBUF(@15),C'-'                                  0321 00964000
         BNE   @RF00321                                            0321 00965000
@RT00321 DS    0H                                                  0322 00966000
*           DO;                     /* YES,SCAN FOR ZERO'S           */ 00967000
*             N=N+1;                /* INCR PTR TO NUM               */ 00968000
         LA    @15,1                                               0323 00969000
         AH    @15,N                                               0323 00970000
         STH   @15,N                                               0323 00971000
*             IF INPUTBUF(N)='0' THEN/* IS CHAR=0                    */ 00972000
         ALR   @15,R5                                              0324 00973000
         BCTR  @15,0                                               0324 00974000
         CLI   INPUTBUF(@15),C'0'                                  0324 00975000
         BNE   @RF00324                                            0324 00976000
*               DO;                 /* YES,ERROR                     */ 00977000
*                 R5=R5+N-1;        /* POINT TO ERROR                */ 00978000
         LH    @15,N                                               0326 00979000
         ALR   @15,R5                                              0326 00980000
         BCTR  @15,0                                               0326 00981000
         LR    R5,@15                                              0326 00982000
*                 GO TO CECTST03;   /* ISSUE ERROR MSG               */ 00983000
         B     CECTST03                                            0327 00984000
*               END;                                               0328 00985000
*           END;                                                   0329 00986000
@RF00324 DS    0H                                                  0330 00987000
*         IF INPUTBUF(N)='/' THEN   /* END OF TEST FIELD             */ 00988000
@RF00321 LH    @15,N                                               0330 00989000
         ALR   @15,R5                                              0330 00990000
         BCTR  @15,0                                               0330 00991000
         CLI   INPUTBUF(@15),C'/'                                  0330 00992000
         BE    @RT00330                                            0330 00993000
*           GO TO CECTST37;         /* YES,DECODE ROUTINES           */ 00994000
*         N=N+1;                    /* POINT TO NEXT CHAR            */ 00995000
         LH    @15,N                                               0332 00996000
         LA    @15,1(,@15)                                         0332 00997000
         STH   @15,N                                               0332 00998000
*         GO TO CECTST36;           /* CONTINUE SCANING              */ 00999000
         B     CECTST36                                            0333 01000000
*CECTST37:                                                         0334 01001000
*         R5=R5+1;                  /* POINT TO NEXT ENTRY           */ 01002000
CECTST37 AL    R5,@CF00072                                         0334 01003000
*         GO TO CECTST38;           /* SECTIONS. NO,CONTINUE TO      */ 01004000
         B     CECTST38                                            0335 01005000
*       END;                                                       0336 01006000
*     R6=R6+1;                      /* DECODE                        */ 01007000
@RF00318 AL    R6,@CF00072                                         0337 01008000
*   END;                                                           0338 01009000
         BCTR  I,0                                                 0338 01010000
         LTR   I,I                                                 0338 01011000
         BP    @DL00317                                            0338 01012000
*   R5=R5+1;                        /* POINT TO NEXT ENTRY           */ 01013000
         AL    R5,@CF00072                                         0339 01014000
*   GO TO CECTST14;                 /* DECODE NEXT SECTION           */ 01015000
         B     CECTST14                                            0340 01016000
*CECTST38:                                                         0341 01017000
*                                                                  0341 01018000
*   /*****************************************************************/ 01019000
*   /*                                                               */ 01020000
*   /* DECODE ROUTINES SELECTED                                      */ 01021000
*   /*                                                               */ 01022000
*   /*****************************************************************/ 01023000
*                                                                  0341 01024000
*   IF SECCNTR^=1 THEN                                             0341 01025000
CECTST38 CLC   SECCNTR(4),@CF00072                                 0341 01026000
         BNE   @RT00341                                            0341 01027000
*     GOTO CECTST03;                                               0342 01028000
*   FRSTRTN=FRSTRTN&&FRSTRTN;       /* CLEAR AREA SET ASIDE FOR      */ 01029000
         XC    FRSTRTN(4),FRSTRTN                                  0343 01030000
*CECTST39:                          /* IS DOUBLE NUMBER ROUTINE    0344 01031000
*                                      SELECTED                      */ 01032000
*   DUBNUM='1'B;                    /* SET DOUBLE NUMBER INDICATOR   */ 01033000
CECTST39 OI    DUBNUM,B'00001000'                                  0344 01034000
*   R6=ADDR(NUMBERS);               /* IS THE CHAR. IN INBUFR+1      */ 01035000
         LA    R6,NUMBERS                                          0345 01036000
*   DO I=10 TO 1 BY-1;              /* NUMERIC. YES, CONTINUE TO     */ 01037000
         LA    I,10                                                0346 01038000
@DL00346 DS    0H                                                  0347 01039000
*     IF INPUTBUF(2)=NUMBER THEN    /* DECODE. NO, CLEAR DOUBLE      */ 01040000
         CLC   INPUTBUF+1(1,R5),NUMBER(R6)                         0347 01041000
         BE    @RT00347                                            0347 01042000
*       GO TO CECTST40;             /* NUMBER INDICATOR AND GO       */ 01043000
*     R6=R6+1;                      /* TO ROUTINE WHICH SETS THE     */ 01044000
         AL    R6,@CF00072                                         0349 01045000
*   END;                            /* SCT ROUTINE FLAGS             */ 01046000
         BCTR  I,0                                                 0350 01047000
         LTR   I,I                                                 0350 01048000
         BP    @DL00346                                            0350 01049000
*   DUBNUM='0'B;                                                   0351 01050000
         NI    DUBNUM,B'11110111'                                  0351 01051000
*   GO TO CECTST42;                                                0352 01052000
         B     CECTST42                                            0352 01053000
*CECTST40:                          /* IS TRIPLE NUMBER ROUTINE    0353 01054000
*                                      SELECTED                      */ 01055000
*   TRINUM='1'B;                    /* SET TRIPLE NUMBER INDICATOR   */ 01056000
CECTST40 OI    TRINUM,B'00000100'                                  0353 01057000
*   R6=ADDR(NUMBERS);               /* IS THE CHAR. IN INBUFR+2      */ 01058000
         LA    R6,NUMBERS                                          0354 01059000
*   DO I=10 TO 1 BY-1;              /* NUMERIC. YES, CONTINUE TO     */ 01060000
         LA    I,10                                                0355 01061000
@DL00355 DS    0H                                                  0356 01062000
*     IF INPUTBUF(3)=NUMBER THEN    /* DECODE. NO, CLEAR TRIPLE      */ 01063000
         CLC   INPUTBUF+2(1,R5),NUMBER(R6)                         0356 01064000
         BE    @RT00356                                            0356 01065000
*       GO TO CECTST41;             /* NUMBER INDICATOR.             */ 01066000
*     R6=R6+1;                                                     0358 01067000
         AL    R6,@CF00072                                         0358 01068000
*   END;                                                           0359 01069000
         BCTR  I,0                                                 0359 01070000
         LTR   I,I                                                 0359 01071000
         BP    @DL00355                                            0359 01072000
*   TRINUM='0'B;                                                   0360 01073000
         NI    TRINUM,B'11111011'                                  0360 01074000
*   GO TO CECTST42;                 /* BYPASS CLEARING DOUBLE        */ 01075000
*                                                                  0361 01076000
         B     CECTST42                                            0361 01077000
*   /*****************************************************************/ 01078000
*   /*                                                               */ 01079000
*   /* NUMBER ROUTINE INDICATOR.                                     */ 01080000
*   /*                                                               */ 01081000
*   /*****************************************************************/ 01082000
*                                                                  0362 01083000
*CECTST41:                          /* CLEAR DOUBLE NUMBER INDICATOR */ 01084000
*   DUBNUM='0'B;                    /* CLEAR DOUBLE NUMBER INDICATOR */ 01085000
CECTST41 NI    DUBNUM,B'11110111'                                  0362 01086000
*CECTST42:                          /* DETERMINE WHICH TYPE OF     0363 01087000
*                                      ROUTINE SELECTED              */ 01088000
*   $RTNSLCT='1'B;                                                 0363 01089000
CECTST42 OI    $RTNSLCT(WAPTR),B'00100000'                         0363 01090000
*   IF DUBNUM='1'B THEN             /* HAS A DOUBLE NUMBER ROUTINE   */ 01091000
         TM    DUBNUM,B'00001000'                                  0364 01092000
         BO    @RT00364                                            0364 01093000
*     GO TO CECTST43;               /* BEEN ENTERED. YES, GO TO      */ 01094000
*                                                                  0365 01095000
*   /*****************************************************************/ 01096000
*   /*                                                               */ 01097000
*   /* DOUBLE NUMBER ROUTINE                                         */ 01098000
*   /*                                                               */ 01099000
*   /*****************************************************************/ 01100000
*                                                                  0366 01101000
*   IF TRINUM='1'B THEN             /* HAS A TRIPLE NUMBER ROUTINE   */ 01102000
         TM    TRINUM,B'00000100'                                  0366 01103000
         BO    @RT00366                                            0366 01104000
*     GO TO CECTST59;               /* BEEN ENTERED. YES, GO TO      */ 01105000
*                                                                  0367 01106000
*   /*****************************************************************/ 01107000
*   /*                                                               */ 01108000
*   /* TRIPLE NUMBER ROUTINE                                         */ 01109000
*   /*                                                               */ 01110000
*   /*****************************************************************/ 01111000
*                                                                  0368 01112000
*   GO TO CECTST64;                 /* GO TO SINGLE NUMBER ROUTINE   */ 01113000
         B     CECTST64                                            0368 01114000
*CECTST43:                          /* ROUTINE TO HANDLE DOUBLE    0369 01115000
*                                      NUMBER ROUTINE SELECTED       */ 01116000
*   FRSTRTN2=INPUTBUF(1:2);         /* CONVERT DOUBLE NUMBER         */ 01117000
CECTST43 MVC   FRSTRTN2(2),INPUTBUF(R5)                            0369 01118000
*   GEN;                                                           0370 01119000
*                                  /* ROUTINE TO BINARY     */          01120000
         PACK  DOUBLEWD(8),FRSTRTN(4)                                   01121000
         CVB   FSTRTN,DOUBLEWD                                          01122000
*   R5=R5+2;                        /* INCREMENT INBUFR POINTER      */ 01123000
         AL    R5,@CF00139                                         0371 01124000
*   DUBNUM='0'B;                    /* RESET DOUBLE NUMBER INDICATOR */ 01125000
         NI    DUBNUM,B'11110111'                                  0372 01126000
*   IF FSTRTN>16 THEN               /* IS FIRST ROUTINE > 16. YES, GO*/ 01127000
         C     FSTRTN,@CF00061                                     0373 01128000
         BH    @RT00373                                            0373 01129000
*     GO TO CECTST50;               /* TO ROUTINE FOR ROUTINES > 16. */ 01130000
*   IF INPUTBUF(1)^='-' THEN        /* IS CHAR. IN INBUFR+0 A HYPHEN.*/ 01131000
         CLI   INPUTBUF(R5),C'-'                                   0375 01132000
         BNE   @RT00375                                            0375 01133000
*     GO TO CECTST46;               /* NO, CONTINUE BY FINDING OUT   */ 01134000
*                                                                  0376 01135000
*   /*****************************************************************/ 01136000
*   /*                                                               */ 01137000
*   /* WHAT IT IS                                                    */ 01138000
*   /*                                                               */ 01139000
*   /*****************************************************************/ 01140000
*                                                                  0377 01141000
*   R5=R5+1;                        /* INCREMENT INBUFR POINTER      */ 01142000
         LA    @15,1                                               0377 01143000
         ALR   R5,@15                                              0377 01144000
*   DO J=1 TO 2;                    /* ARE THE CHAR. IN INBUFR+0 AND */ 01145000
         STH   @15,J                                               0378 01146000
@DL00378 DS    0H                                                  0379 01147000
*     R6=ADDR(NUMBERS);             /* INBUFR+1 NUMERIC. YES,      0379 01148000
*                                      CONTINUE                      */ 01149000
         LA    R6,NUMBERS                                          0379 01150000
*     DO I=10 TO 1 BY-1;            /* TO DECODE. NO, SET ERROR CODE */ 01151000
         LA    I,10                                                0380 01152000
@DL00380 DS    0H                                                  0381 01153000
*       IF INPUTBUF(J)=NUMBER THEN  /* -10- AND PRINT ERROR MESSAGE  */ 01154000
         LH    @15,J                                               0381 01155000
         ALR   @15,R5                                              0381 01156000
         BCTR  @15,0                                               0381 01157000
         CLC   INPUTBUF(1,@15),NUMBER(R6)                          0381 01158000
         BE    @RT00381                                            0381 01159000
*         GO TO CECTST45;           /* IFD112I                       */ 01160000
*       R6=R6+1;                                                   0383 01161000
         AL    R6,@CF00072                                         0383 01162000
*     END;                                                         0384 01163000
         BCTR  I,0                                                 0384 01164000
         LTR   I,I                                                 0384 01165000
         BP    @DL00380                                            0384 01166000
*CECTST44:                                                         0385 01167000
*                                                                  0385 01168000
*     /***************************************************************/ 01169000
*     /*                                                             */ 01170000
*     /* ERROR, INVALID INCLUSIVE RANGE OF ROUTINES                  */ 01171000
*     /*                                                             */ 01172000
*     /***************************************************************/ 01173000
*                                                                  0385 01174000
*     R5=R5+J-1;                    /* PT TO ERROR                   */ 01175000
CECTST44 LR    @15,R5                                              0385 01176000
         AH    @15,J                                               0385 01177000
         BCTR  @15,0                                               0385 01178000
         LR    R5,@15                                              0385 01179000
*     GO TO CECTST03;                                              0386 01180000
         B     CECTST03                                            0386 01181000
*CECTST45:                                                         0387 01182000
*   END;                                                           0387 01183000
CECTST45 LA    @15,1                                               0387 01184000
         AH    @15,J                                               0387 01185000
         STH   @15,J                                               0387 01186000
         C     @15,@CF00139                                        0387 01187000
         BNH   @DL00378                                            0387 01188000
*   R6=ADDR(NUMBERS);               /* IS THE CHAR. IN INBUFR+2      */ 01189000
         LA    R6,NUMBERS                                          0388 01190000
*   DO I=10 TO 1 BY-1;              /* NUMERIC. YES, GO TO ROUTINE   */ 01191000
         LA    I,10                                                0389 01192000
@DL00389 DS    0H                                                  0390 01193000
*     IF INPUTBUF(3)=NUMBER THEN    /* THAT CONVERTS TRIPLE          */ 01194000
         CLC   INPUTBUF+2(1,R5),NUMBER(R6)                         0390 01195000
         BE    @RT00390                                            0390 01196000
*       GO TO CECTST75;             /* NUMBER FOR LAST ROUTINE IN    */ 01197000
*     R6=R6+1;                      /* AN INCLUSIVE SERIES OF        */ 01198000
         AL    R6,@CF00072                                         0392 01199000
*   END;                            /* ROUTINES. NO, GO TO ROUTINE   */ 01200000
         BCTR  I,0                                                 0393 01201000
         LTR   I,I                                                 0393 01202000
         BP    @DL00389                                            0393 01203000
*   GO TO CECTST73;                 /* THAT CONVERTS DOUBLE NUMBER   */ 01204000
*                                                                  0394 01205000
         B     CECTST73                                            0394 01206000
*   /*****************************************************************/ 01207000
*   /*                                                               */ 01208000
*   /* FOR LAST ROUTINE IN AN INCLUSIVE SERIES OF ROUTINES           */ 01209000
*   /*                                                               */ 01210000
*   /*****************************************************************/ 01211000
*                                                                  0395 01212000
*CECTST46:                          /* FIRST ROUTINE EQUALS LAST   0395 01213000
*                                      ROUTINE.                      */ 01214000
*                                                                  0395 01215000
*   /*****************************************************************/ 01216000
*   /*                                                               */ 01217000
*   /* NORMAL ROUTINE SELECTION FIELD.                               */ 01218000
*   /*                                                               */ 01219000
*   /*****************************************************************/ 01220000
*                                                                  0395 01221000
*   LSTRTN=FSTRTN;                  /* SET LAST ROUTINE EQUAL TO   0395 01222000
*                                      FIRST                         */ 01223000
CECTST46 LR    LSTRTN,FSTRTN                                       0395 01224000
*   CALL CECTST80;                  /* ROUTINE AND GO TO SUB-ROUTINE */ 01225000
*                                                                  0396 01226000
         BAL   @14,CECTST80                                        0396 01227000
*   /*****************************************************************/ 01228000
*   /*                                                               */ 01229000
*   /* THAT SETS ROUTINE FLAGS IN THE NORMAL ROUTINE AREA            */ 01230000
*   /*                                                               */ 01231000
*   /*****************************************************************/ 01232000
*                                                                  0397 01233000
*   GO TO CECTST58;                 /* CONTINUE TO DECODE.           */ 01234000
         B     CECTST58                                            0397 01235000
*CECTST50:                          /* ROUTINE FOR HANDLING ROUTINES    01236000
*                                      IN                            */ 01237000
*                                                                  0398 01238000
*   /*****************************************************************/ 01239000
*   /*                                                               */ 01240000
*   /* EXPANDED ROUTINE SELECTION FIELD.                             */ 01241000
*   /*                                                               */ 01242000
*   /*****************************************************************/ 01243000
*                                                                  0398 01244000
*   IF INPUTBUF(1)^='-' THEN        /* IS CHAR. IN INBUFR+0 A HYPHEN.*/ 01245000
CECTST50 CLI   INPUTBUF(R5),C'-'                                   0398 01246000
         BNE   @RT00398                                            0398 01247000
*     GO TO CECTST53;               /* NO, FIND OUT WHAT IT IS       */ 01248000
*   R5=R5+1;                        /* YES, INCREMENT INBUFR POINTER */ 01249000
         LA    @15,1                                               0400 01250000
         ALR   R5,@15                                              0400 01251000
*   DO J=1 TO 2;                    /* ARE THE CHAR. IN INBUFR AND   */ 01252000
         STH   @15,J                                               0401 01253000
@DL00401 DS    0H                                                  0402 01254000
*     R6=ADDR(NUMBERS);             /* INBUFR+1 NUMERIC. NO, SET     */ 01255000
         LA    R6,NUMBERS                                          0402 01256000
*     DO I=10 TO 1 BY-1;            /* ERROR CODE -10- AND PRINT     */ 01257000
         LA    I,10                                                0403 01258000
@DL00403 DS    0H                                                  0404 01259000
*       IF INPUTBUF(J)=NUMBER THEN  /* ERROR MESSAGE IFD112I         */ 01260000
         LH    @15,J                                               0404 01261000
         ALR   @15,R5                                              0404 01262000
         BCTR  @15,0                                               0404 01263000
         CLC   INPUTBUF(1,@15),NUMBER(R6)                          0404 01264000
         BE    @RT00404                                            0404 01265000
*         GO TO CECTST51;           /* YES, CONTINUE TO DECODE       */ 01266000
*       R6=R6+1;                                                   0406 01267000
         AL    R6,@CF00072                                         0406 01268000
*     END;                                                         0407 01269000
         BCTR  I,0                                                 0407 01270000
         LTR   I,I                                                 0407 01271000
         BP    @DL00403                                            0407 01272000
*     GO TO CECTST44;                                              0408 01273000
         B     CECTST44                                            0408 01274000
*CECTST51:                                                         0409 01275000
*   END;                                                           0409 01276000
CECTST51 LA    @15,1                                               0409 01277000
         AH    @15,J                                               0409 01278000
         STH   @15,J                                               0409 01279000
         C     @15,@CF00139                                        0409 01280000
         BNH   @DL00401                                            0409 01281000
*   R6=ADDR(NUMBERS);               /* IS THE CHAR IN INBUFR+2     0410 01282000
*                                      NUMERIC                       */ 01283000
         LA    R6,NUMBERS                                          0410 01284000
*   DO I=10 TO 1 BY-1;              /* YES, GO TO ROUTINE THAT       */ 01285000
         LA    I,10                                                0411 01286000
@DL00411 DS    0H                                                  0412 01287000
*     IF INPUTBUF(3)=NUMBER THEN    /* CONVERTS A TRIPLE NUMBER FOR  */ 01288000
         CLC   INPUTBUF+2(1,R5),NUMBER(R6)                         0412 01289000
         BE    @RT00412                                            0412 01290000
*       GO TO CECTST62;             /* A LAST ROUTINE IN AN INCLUSIVE*/ 01291000
*     R6=R6+1;                      /* RANGE. NO,                    */ 01292000
         AL    R6,@CF00072                                         0414 01293000
*   END;                            /* CONVERT A DOUBLE NUMBER FOR   */ 01294000
*                                                                  0415 01295000
         BCTR  I,0                                                 0415 01296000
         LTR   I,I                                                 0415 01297000
         BP    @DL00411                                            0415 01298000
*   /*****************************************************************/ 01299000
*   /*                                                               */ 01300000
*   /* A LAST ROUTINE IN AN INCLUSIVE RANGE                          */ 01301000
*   /*                                                               */ 01302000
*   /*****************************************************************/ 01303000
*                                                                  0416 01304000
*   LASTRTN2=INPUTBUF(1:2);                                        0416 01305000
         MVC   LASTRTN2(2),INPUTBUF(R5)                            0416 01306000
*   GEN;                                                           0417 01307000
         PACK  DOUBLEWD(8),LASTRTN(4)                                   01308000
         CVB   LSTRTN,DOUBLEWD                                          01309000
*   IF LSTRTN<=FSTRTN THEN          /* IS INCLUSIVE RANGE VALID.     */ 01310000
         CR    LSTRTN,FSTRTN                                       0418 01311000
         BH    @RF00418                                            0418 01312000
*     DO;                                                          0419 01313000
*       R5=R5+1;                                                   0420 01314000
         AL    R5,@CF00072                                         0420 01315000
*       GOTO CECTST03;                                             0421 01316000
         B     CECTST03                                            0421 01317000
*     END;                                                         0422 01318000
*                                                                  0422 01319000
*   /*****************************************************************/ 01320000
*   /*                                                               */ 01321000
*   /* PRINT MESSAGE IFD112I AND RETURN TO CALLER. YES, CONTINUE.    */ 01322000
*   /*                                                               */ 01323000
*   /*****************************************************************/ 01324000
*                                                                  0423 01325000
*   R5=R5+2;                        /* INCREMENT INBUFR POINTER      */ 01326000
@RF00418 AL    R5,@CF00139                                         0423 01327000
*   CALL CECTST78;                  /* GO TO ROUTINE TO SET ROUTINE  */ 01328000
         BAL   @14,CECTST78                                        0424 01329000
*   GO TO CECTST58;                 /* FLAGS IN EXPANDED AREA OF SCT */ 01330000
*                                                                  0425 01331000
         B     CECTST58                                            0425 01332000
*   /*****************************************************************/ 01333000
*   /*                                                               */ 01334000
*   /* AND UPON RETURN CONTINUE TO DECODE                            */ 01335000
*   /*                                                               */ 01336000
*   /*****************************************************************/ 01337000
*                                                                  0426 01338000
*CECTST53:                          /* FIRST ROUTINE EQUALS LAST   0426 01339000
*                                      ROUTINE,                      */ 01340000
*                                                                  0426 01341000
*   /*****************************************************************/ 01342000
*   /*                                                               */ 01343000
*   /* EXPANDED ROUTINE SELECTION FIELD.                             */ 01344000
*   /*                                                               */ 01345000
*   /*****************************************************************/ 01346000
*                                                                  0426 01347000
*   LSTRTN=FSTRTN;                  /* SET LAST ROUTINE EQUAL TO   0426 01348000
*                                      FIRST                         */ 01349000
CECTST53 LR    LSTRTN,FSTRTN                                       0426 01350000
*   CALL CECTST78;                  /* CALL ROUTINE TO SET ROUTINE   */ 01351000
*                                                                  0427 01352000
         BAL   @14,CECTST78                                        0427 01353000
*   /*****************************************************************/ 01354000
*   /*                                                               */ 01355000
*   /* FLAGS IN EXPANDED AREA OF SCT                                 */ 01356000
*   /*                                                               */ 01357000
*   /*****************************************************************/ 01358000
*                                                                  0428 01359000
*CECTST58:                                                         0428 01360000
*                                                                  0428 01361000
*   /*****************************************************************/ 01362000
*   /*                                                               */ 01363000
*   /* DECODE DELIMITERS                                             */ 01364000
*   /*                                                               */ 01365000
*   /*****************************************************************/ 01366000
*                                                                  0428 01367000
*   IF INPUTBUF(1)^=',' THEN        /* IS CHAR. IN INBUFR+0 A COMMA. */ 01368000
CECTST58 CLI   INPUTBUF(R5),C','                                   0428 01369000
         BNE   @RT00428                                            0428 01370000
*     GO TO CECTST55;               /* NO, FIND OUT WHAT IT IS       */ 01371000
*CECTST54:                          /* DELIMITER IS LEGAL, CONTINUE     01372000
*                                      TO DECODE                     */ 01373000
*   R5=R5+1;                        /* YES, INCREMENT INBUFR POINTER */ 01374000
CECTST54 AL    R5,@CF00072                                         0430 01375000
*   GO TO CECTST38;                 /* AND CONTINUE TO DECODE        */ 01376000
         B     CECTST38                                            0431 01377000
*CECTST55:                          /* IS THE DELIMITER A SLASH      */ 01378000
*   IF INPUTBUF(1)='/' THEN         /* IS CHAR. IN INBUFR+0 A SLASH. */ 01379000
CECTST55 CLI   INPUTBUF(R5),C'/'                                   0432 01380000
         BE    @RT00432                                            0432 01381000
*     GO TO CECTST99;               /* YES, RETURN TO CALLER. NO,    */ 01382000
*CECTST56:                                                         0434 01383000
*                                                                  0434 01384000
*   /*****************************************************************/ 01385000
*   /*                                                               */ 01386000
*   /* ERROR, ILLEGAL DELIMITER                                      */ 01387000
*   /*                                                               */ 01388000
*   /*****************************************************************/ 01389000
*                                                                  0434 01390000
*   GO TO CECTST03;                 /* PRINT ERROR MESSAGE IFD112I   */ 01391000
         B     CECTST03                                            0434 01392000
*CECTST59:                          /* ROUTINE TO HANDLE TRIPLE    0435 01393000
*                                      NUMBER ROUTINE SELECTED       */ 01394000
*   FRSTRTN1=INPUTBUF(1:3);         /* PUT TRIPLE NUMBER IN FRSTRTN  */ 01395000
CECTST59 MVC   FRSTRTN1(3),INPUTBUF(R5)                            0435 01396000
*   GEN;                                                           0436 01397000
*                                  /* AND CONVERT IT TO BINARY     */   01398000
         PACK  DOUBLEWD(8),FRSTRTN(4)                                   01399000
         CVB   FSTRTN,DOUBLEWD                                          01400000
*   TRINUM='0'B;                    /* CLEAR TRIPLE NUMBER INDICATOR */ 01401000
         NI    TRINUM,B'11111011'                                  0437 01402000
*   IF FSTRTN>255 THEN              /* IS ROUTINE NUMBER > 255. YES, */ 01403000
         C     FSTRTN,@CF00865                                     0438 01404000
         BNH   @RF00438                                            0438 01405000
*     DO;                                                          0439 01406000
*       R5=R5+2;                    /* PT TO ERROR                   */ 01407000
         AL    R5,@CF00139                                         0440 01408000
*       GOTO CECTST03;                                             0441 01409000
         B     CECTST03                                            0441 01410000
*     END;                                                         0442 01411000
*   R5=R5+3;                        /* NO, INCREMENT INBUFR POINTER  */ 01412000
@RF00438 AL    R5,@CF00081                                         0443 01413000
*   IF INPUTBUF(1)^='-' THEN        /* IS CHAR. IN INBUFR+0 A HYPHEN.*/ 01414000
         CLI   INPUTBUF(R5),C'-'                                   0444 01415000
         BNE   @RT00444                                            0444 01416000
*     GO TO CECTST53;               /* NO, FIND OUT WHAT IT IS       */ 01417000
*   R5=R5+1;                        /* YES, INCREMENT INBUFR POINTER */ 01418000
         LA    @15,1                                               0446 01419000
         ALR   R5,@15                                              0446 01420000
*   DO J=1 TO 3;                    /* ARE THE CHAR. IN INBUFR+0,    */ 01421000
         STH   @15,J                                               0447 01422000
@DL00447 DS    0H                                                  0448 01423000
*     R6=ADDR(NUMBERS);             /* INBUFR+1 AND INBUFR+2         */ 01424000
         LA    R6,NUMBERS                                          0448 01425000
*     DO I=10 TO 1 BY-1;            /* NUMERIC. YES, CONTINUE        */ 01426000
         LA    I,10                                                0449 01427000
@DL00449 DS    0H                                                  0450 01428000
*       IF INPUTBUF(J)=NUMBER THEN  /* NO, SET ERROR CODE -10-       */ 01429000
         LH    @15,J                                               0450 01430000
         ALR   @15,R5                                              0450 01431000
         BCTR  @15,0                                               0450 01432000
         CLC   INPUTBUF(1,@15),NUMBER(R6)                          0450 01433000
         BE    @RT00450                                            0450 01434000
*         GO TO CECTST61;           /* AND PRINT ERROR MESSAGE       */ 01435000
*       R6=R6+1;                    /* IFD112I                       */ 01436000
         AL    R6,@CF00072                                         0452 01437000
*     END;                                                         0453 01438000
         BCTR  I,0                                                 0453 01439000
         LTR   I,I                                                 0453 01440000
         BP    @DL00449                                            0453 01441000
*     GO TO CECTST44;                                              0454 01442000
         B     CECTST44                                            0454 01443000
*CECTST61:                                                         0455 01444000
*   END;                                                           0455 01445000
CECTST61 LA    @15,1                                               0455 01446000
         AH    @15,J                                               0455 01447000
         STH   @15,J                                               0455 01448000
         C     @15,@CF00081                                        0455 01449000
         BNH   @DL00447                                            0455 01450000
*CECTST62:                          /* ROUTINE FOR INCLUSIVE ROUTINES   01451000
*                                      IN                            */ 01452000
*                                                                  0456 01453000
*   /*****************************************************************/ 01454000
*   /*                                                               */ 01455000
*   /* EXPANDED ROUTINE SELECTION FIELD                              */ 01456000
*   /*                                                               */ 01457000
*   /*****************************************************************/ 01458000
*                                                                  0456 01459000
*   LASTRTN1=INPUTBUF(1:3);         /* PUT TRIPLE NUMBER IN LASTRTN  */ 01460000
CECTST62 MVC   LASTRTN1(3),INPUTBUF(R5)                            0456 01461000
*   GEN;                                                           0457 01462000
*                                  /* AND CONVERT IT TO BINARY    */    01463000
         PACK  DOUBLEWD(8),LASTRTN(4)                                   01464000
         CVB   LSTRTN,DOUBLEWD                                          01465000
*   IF LSTRTN<=FSTRTN|              /* CHECK FOR INVALID             */ 01466000
*       LSTRTN>255 THEN             /* RANGE OF ROUTINES             */ 01467000
         CR    LSTRTN,FSTRTN                                       0458 01468000
         BNH   @RT00458                                            0458 01469000
         C     LSTRTN,@CF00865                                     0458 01470000
         BNH   @RF00458                                            0458 01471000
@RT00458 DS    0H                                                  0459 01472000
*     DO;                                                          0459 01473000
*       R5=R5+2;                    /* PT TO ERROR                   */ 01474000
         AL    R5,@CF00139                                         0460 01475000
*       GOTO CECTST03;                                             0461 01476000
         B     CECTST03                                            0461 01477000
*     END;                                                         0462 01478000
*   R5=R5+3;                        /* INBUFR POINTER BY THREE       */ 01479000
@RF00458 AL    R5,@CF00081                                         0463 01480000
*   CALL CECTST78;                  /* SET ROUTINE FLAGS IN EXPANDED */ 01481000
*                                                                  0464 01482000
         BAL   @14,CECTST78                                        0464 01483000
*   /*****************************************************************/ 01484000
*   /*                                                               */ 01485000
*   /* AREA                                                          */ 01486000
*   /*                                                               */ 01487000
*   /*****************************************************************/ 01488000
*                                                                  0465 01489000
*   GO TO CECTST58;                 /* CONTINUE TO DECODE.           */ 01490000
         B     CECTST58                                            0465 01491000
*CECTST64:                          /* ROUTINE TO HANDLE SINGLE    0466 01492000
*                                      NUMBER ROUTINE SELECTED       */ 01493000
*   IF INPUTBUF(1)<'1' THEN                                        0466 01494000
CECTST64 CLI   INPUTBUF(R5),C'1'                                   0466 01495000
         BL    @RT00466                                            0466 01496000
*     GO TO CECTST03;                                              0467 01497000
*   FRSTRTN3=INPUTBUF(1);           /* PUT SINGLE NUMBER IN FRSTRTN  */ 01498000
         MVC   FRSTRTN3(1),INPUTBUF(R5)                            0468 01499000
*   GEN;                                                           0469 01500000
*                                  /* AND CONVERT IT TO BINARY.      */ 01501000
         PACK  DOUBLEWD(8),LASTRTN(4)                                   01502000
         CVB   FSTRTN,DOUBLEWD                                          01503000
*   R5=R5+1;                        /* INCREMENT INBUFR POINTER      */ 01504000
         AL    R5,@CF00072                                         0470 01505000
*   IF INPUTBUF(1)='-' THEN         /* IS CHAR. IN INBUFR+0 A HYPHEN */ 01506000
         CLI   INPUTBUF(R5),C'-'                                   0471 01507000
         BE    @RT00471                                            0471 01508000
*     GO TO CECTST68;               /* YES, DECODE NUMBER THAT     0472 01509000
*                                      FOLLOWS                       */ 01510000
*   LSTRTN=FSTRTN;                  /* PUT FIRST ROUTINE IN LSTRTN   */ 01511000
         LR    LSTRTN,FSTRTN                                       0473 01512000
*   CALL CECTST80;                  /* GO TO ROUTINE THAT SETS FLAGS */ 01513000
*                                                                  0474 01514000
         BAL   @14,CECTST80                                        0474 01515000
*   /*****************************************************************/ 01516000
*   /*                                                               */ 01517000
*   /* IN NORMAL ROUTINE AREA                                        */ 01518000
*   /*                                                               */ 01519000
*   /*****************************************************************/ 01520000
*                                                                  0475 01521000
*   GO TO CECTST58;                 /* CONTINUE TO DECODE.           */ 01522000
         B     CECTST58                                            0475 01523000
*CECTST68:                          /* ROUTINE TO HANDLE INCLUSIVE 0476 01524000
*                                      ROUTINES SELECTED THAT        */ 01525000
*                                                                  0476 01526000
*   /*****************************************************************/ 01527000
*   /*                                                               */ 01528000
*   /* CARRY OVER INTO BOTH THE NORMAL AND EXPANDED ROUTINE SELECTION*/ 01529000
*   /* FIELD.                                                        */ 01530000
*   /*                                                               */ 01531000
*   /*****************************************************************/ 01532000
*                                                                  0476 01533000
*   R5=R5+1;                        /* INCREMENT INBUFR POINTER      */ 01534000
CECTST68 AL    R5,@CF00072                                         0476 01535000
*   R6=ADDR(NUMBERS);               /* IS THE CHAR. IN INBUFR NUMERIC*/ 01536000
         LA    R6,NUMBERS                                          0477 01537000
*   DO I=10 TO 1 BY-1;              /* NO, SET ERROR CODE -10- AND   */ 01538000
         LA    I,10                                                0478 01539000
@DL00478 DS    0H                                                  0479 01540000
*     IF INPUTBUF(1)=NUMBER THEN    /* PRINT ERROR MESSAGE IFD112I.  */ 01541000
         CLC   INPUTBUF(1,R5),NUMBER(R6)                           0479 01542000
         BE    @RT00479                                            0479 01543000
*       GO TO CECTST69;             /* YES, CONTINUE TO DECODE       */ 01544000
*     R6=R6+1;                                                     0481 01545000
         AL    R6,@CF00072                                         0481 01546000
*   END;                                                           0482 01547000
         BCTR  I,0                                                 0482 01548000
         LTR   I,I                                                 0482 01549000
         BP    @DL00478                                            0482 01550000
*   GOTO CECTST03;                                                 0483 01551000
         B     CECTST03                                            0483 01552000
*CECTST69:                                                         0484 01553000
*   R6=ADDR(NUMBERS);               /* IS THE CHAR. IN INBUFR+1      */ 01554000
CECTST69 LA    R6,NUMBERS                                          0484 01555000
*   DO I=10 TO 1 BY-1;              /* NUMERIC. YES, CONTINUE TO     */ 01556000
         LA    I,10                                                0485 01557000
@DL00485 DS    0H                                                  0486 01558000
*     IF INPUTBUF(2)=NUMBER THEN    /* DECODE. NO, PUT INCLUSIVE     */ 01559000
         CLC   INPUTBUF+1(1,R5),NUMBER(R6)                         0486 01560000
         BE    @RT00486                                            0486 01561000
*       GO TO CECTST72;             /* ROUTINE NUMBER IN LASTRTN     */ 01562000
*     R6=R6+1;                      /* AND CONVERT IT TO BINARY      */ 01563000
         AL    R6,@CF00072                                         0488 01564000
*   END;                                                           0489 01565000
         BCTR  I,0                                                 0489 01566000
         LTR   I,I                                                 0489 01567000
         BP    @DL00485                                            0489 01568000
*   LASTRTN3=INPUTBUF(1);           /* PUT SINGLE NUMBER IN LASTRTN  */ 01569000
         MVC   LASTRTN3(1),INPUTBUF(R5)                            0490 01570000
*   GEN;                                                           0491 01571000
*                                  /* AND CONVERT IT TO BINARY.      */ 01572000
         PACK  DOUBLEWD(8),LASTRTN(4)                                   01573000
         CVB   LSTRTN,DOUBLEWD                                          01574000
*   IF LSTRTN<=FSTRTN THEN          /* IS INCLUSIVE RANGE VALID.     */ 01575000
         CR    LSTRTN,FSTRTN                                       0492 01576000
         BNH   @RT00492                                            0492 01577000
*     GOTO CECTST03;                                               0493 01578000
*                                                                  0493 01579000
*   /*****************************************************************/ 01580000
*   /*                                                               */ 01581000
*   /* PRINT MESSAGE IFD112I AND RETURN TO CALLER. YES, CONTINUE.    */ 01582000
*   /*                                                               */ 01583000
*   /*****************************************************************/ 01584000
*                                                                  0494 01585000
*   R5=R5+1;                        /* INCREMENT INBUFR POINTER AND     01586000
*                                      GO                            */ 01587000
         AL    R5,@CF00072                                         0494 01588000
*CECTST70:                                                         0495 01589000
*   CALL CECTST80;                  /* TO ROUTINE WHICH FLAGS      0495 01590000
*                                      ROUTINES                      */ 01591000
CECTST70 BAL   @14,CECTST80                                        0495 01592000
*   GO TO CECTST58;                 /* SELECTED IN NORMAL AREA, THEN */ 01593000
*                                                                  0496 01594000
         B     CECTST58                                            0496 01595000
*   /*****************************************************************/ 01596000
*   /*                                                               */ 01597000
*   /* CONTINUE TO DECODE.                                           */ 01598000
*   /*                                                               */ 01599000
*   /*****************************************************************/ 01600000
*                                                                  0497 01601000
*CECTST72:                                                         0497 01602000
*   R6=ADDR(NUMBERS);               /* IS THE CHAR. IN INBUFR+2      */ 01603000
CECTST72 LA    R6,NUMBERS                                          0497 01604000
*   DO I=10 TO 1 BY-1;              /* NUMERIC. YES, HANDLE TRIPLE   */ 01605000
         LA    I,10                                                0498 01606000
@DL00498 DS    0H                                                  0499 01607000
*     IF INPUTBUF(3)=NUMBER THEN    /* NUMBER ROUTINE. NO, CONVERT   */ 01608000
         CLC   INPUTBUF+2(1,R5),NUMBER(R6)                         0499 01609000
         BE    @RT00499                                            0499 01610000
*       GO TO CECTST75;             /* DOUBLE NUMBER TO BINARY AND   */ 01611000
*     R6=R6+1;                      /* SET ROUTINE FLAGS IN SCT      */ 01612000
         AL    R6,@CF00072                                         0501 01613000
*   END;                                                           0502 01614000
         BCTR  I,0                                                 0502 01615000
         LTR   I,I                                                 0502 01616000
         BP    @DL00498                                            0502 01617000
*CECTST73:                          /* ROUTINE THAT CONVERTS DOUBLE     01618000
*                                      NUMBER FOR LAST               */ 01619000
*                                                                  0503 01620000
*   /*****************************************************************/ 01621000
*   /*                                                               */ 01622000
*   /* ROUTINE IN AN INCLUSIVE SERIES OF ROUTINES                    */ 01623000
*   /*                                                               */ 01624000
*   /*****************************************************************/ 01625000
*                                                                  0503 01626000
*   LASTRTN2=INPUTBUF(1:2);         /* CONVERT DOUBLE NUMBER         */ 01627000
CECTST73 MVC   LASTRTN2(2),INPUTBUF(R5)                            0503 01628000
*   GEN;                                                           0504 01629000
*                                  /* TO BINARY             */          01630000
         PACK  DOUBLEWD(8),LASTRTN(4)                                   01631000
         CVB   LSTRTN,DOUBLEWD                                          01632000
*   R5=R5+1;                        /* INCREMENT INBUFR POINTER      */ 01633000
         LA    @15,1                                               0505 01634000
         ALR   R5,@15                                              0505 01635000
*   IF LSTRTN<=FSTRTN THEN                                         0506 01636000
         CR    LSTRTN,FSTRTN                                       0506 01637000
         BNH   @RT00506                                            0506 01638000
*     GO TO CECTST03;                                              0507 01639000
*   R5=R5+1;                                                       0508 01640000
         ALR   R5,@15                                              0508 01641000
*   IF LSTRTN^>16 THEN              /* IS LSTRTN > 16. NO, GO TO     */ 01642000
         LA    @15,16                                              0509 01643000
         CR    LSTRTN,@15                                          0509 01644000
         BNH   @RT00509                                            0509 01645000
*     GO TO CECTST70;               /* ROUTINE THAT SETS ROUTINE     */ 01646000
*   LASTRTN=LSTRTN;                 /* FLAGS IN NORMAL AREA.         */ 01647000
         ST    LSTRTN,LASTRTN                                      0511 01648000
*   LSTRTN=16;                      /* YES, SET FLAGS IN BOTH        */ 01649000
         LR    LSTRTN,@15                                          0512 01650000
*   CALL CECTST80;                  /* AREAS RESERVED FOR ROUTINE    */ 01651000
         BAL   @14,CECTST80                                        0513 01652000
*   FSTRTN=17;                      /* FLAGS                         */ 01653000
         LA    FSTRTN,17                                           0514 01654000
*   LSTRTN=LASTRTN;                                                0515 01655000
         L     LSTRTN,LASTRTN                                      0515 01656000
*   CALL CECTST78;                                                 0516 01657000
         BAL   @14,CECTST78                                        0516 01658000
*   GO TO CECTST58;                 /* CONTINUE TO DECODE            */ 01659000
         B     CECTST58                                            0517 01660000
*CECTST75:                                                         0518 01661000
*   LASTRTN1=INPUTBUF(1:3);         /* CONVERT TRIPLE NUMBER TO    0518 01662000
*                                      BINARY                        */ 01663000
CECTST75 MVC   LASTRTN1(3),INPUTBUF(R5)                            0518 01664000
*   GEN;                                                           0519 01665000
         PACK  DOUBLEWD(8),LASTRTN(4)                                   01666000
         CVB   LSTRTN,DOUBLEWD                                          01667000
*   IF LSTRTN>255 THEN              /* IS LAST INCLUSIVE ROUTINE     */ 01668000
         C     LSTRTN,@CF00865                                     0520 01669000
         BNH   @RF00520                                            0520 01670000
*     DO;                                                          0521 01671000
*       R5=R5+2;                    /* PT TO ERROR                   */ 01672000
         AL    R5,@CF00139                                         0522 01673000
*       GOTO CECTST03;                                             0523 01674000
         B     CECTST03                                            0523 01675000
*     END;                                                         0524 01676000
*   R5=R5+3;                        /* SET ERROR CODE -10- AND       */ 01677000
@RF00520 AL    R5,@CF00081                                         0525 01678000
*   FSTRTN=17;                      /* PRINT ERROR MESSAGE IFD112I   */ 01679000
         LA    FSTRTN,17                                           0526 01680000
*   DO;                                                            0527 01681000
*     LASTRTN=LSTRTN;                                              0528 01682000
         ST    LSTRTN,LASTRTN                                      0528 01683000
*     LSTRTN=16;                                                   0529 01684000
         LA    LSTRTN,16                                           0529 01685000
*     CALL CECTST80;                                               0530 01686000
         BAL   @14,CECTST80                                        0530 01687000
*     LSTRTN=LASTRTN;                                              0531 01688000
         L     LSTRTN,LASTRTN                                      0531 01689000
*     FSTRTN=17;                                                   0532 01690000
         LA    FSTRTN,17                                           0532 01691000
*   END;                                                           0533 01692000
*   IF FSTRTN<19 THEN                                              0534 01693000
         C     FSTRTN,@CF00881                                     0534 01694000
         BNL   @RF00534                                            0534 01695000
*     CALL CECTST78;                /* NO, SET ROUTINE FLAGS ON      */ 01696000
         BAL   @14,CECTST78                                        0535 01697000
*   GO TO CECTST58;                 /* IN SCT                        */ 01698000
         B     CECTST58                                            0536 01699000
*CECTST99:                                                         0537 01700000
*   $TSTCNT=SECCNTR;                /* SECTION COUNT                 */ 01701000
CECTST99 L     @15,SECCNTR                                         0537 01702000
         STH   @15,$TSTCNT(,WAPTR)                                 0537 01703000
*   $VALDTST='1'B;                                                 0538 01704000
         OI    $VALDTST(WAPTR),B'00000100'                         0538 01705000
*CECTST77:                                                         0539 01706000
*   R13=SVEIC003(2);                                               0539 01707000
CECTST77 L     R13,SVEIC003+4(,WAPTR)                              0539 01708000
*   RETURN;                                                        0540 01709000
@EL00001 DS    0H                                                  0540 01710000
@EF00001 DS    0H                                                  0540 01711000
@ER00001 LM    @14,@12,12(@13)                                     0540 01712000
         BR    @14                                                 0540 01713000
*CECTST78:                                                         0541 01714000
*                                                                  0541 01715000
*   /*****************************************************************/ 01716000
*   /*                                                               */ 01717000
*   /* SUBROUTINE FOR SETTING ROUTINE FLAGS IN EXPANDED AND NORMAL   */ 01718000
*   /* ROUTINE SELECTION FIELDS.                                     */ 01719000
*   /*                                                               */ 01720000
*   /*****************************************************************/ 01721000
*                                                                  0541 01722000
*   PROC OPTIONS(NOSAVEAREA,DONTSAVE);                             0541 01723000
CECTST78 DS    0H                                                  0542 01724000
*   SAVR14=R14;                     /* SAVE RETURN REGISTER          */ 01725000
         ST    R14,SAVR14                                          0542 01726000
*   EXPFLG='1'B;                    /* SET INDICATOR SAYING FLAGS    */ 01727000
*                                                                  0543 01728000
         OI    EXPFLG,B'00010000'                                  0543 01729000
*   /*****************************************************************/ 01730000
*   /*                                                               */ 01731000
*   /* ARE IN EXPANDED AREA                                          */ 01732000
*   /*                                                               */ 01733000
*   /*****************************************************************/ 01734000
*                                                                  0544 01735000
*CECTST79:                                                         0544 01736000
*   R7=ADDR($ROUTMSK);                                             0544 01737000
CECTST79 LA    R7,$ROUTMSK(,WAPTR)                                 0544 01738000
*   R7=(FSTRTN+7)/8-3+R7;           /* EXPANDED ROUTINE BYTE         */ 01739000
         LA    @10,7                                               0545 01740000
         ALR   @10,FSTRTN                                          0545 01741000
         SRDA  @10,32                                              0545 01742000
         D     @10,@CF00054                                        0545 01743000
         SL    @11,@CF00081                                        0545 01744000
         ALR   R7,@11                                              0545 01745000
*   GO TO CECTST82;                 /* SKIP TO NEXT NEEDED         0546 01746000
*                                      INSTRUCTION                   */ 01747000
         B     CECTST82                                            0546 01748000
*CECTST80:                                                         0547 01749000
*                                                                  0547 01750000
*   /*****************************************************************/ 01751000
*   /*                                                               */ 01752000
*   /* SUBROUTINE FOR SETTING ROUTINE FLAGS IN NORMAL ROUTINE        */ 01753000
*   /* SELECTION FIELD                                               */ 01754000
*   /*                                                               */ 01755000
*   /*****************************************************************/ 01756000
*                                                                  0547 01757000
*   ENTRY;                                                         0547 01758000
CECTST80 DS    0H                                                  0548 01759000
*   SAVR14=R14;                     /* SAVE RETURN REGISTER.         */ 01760000
         ST    R14,SAVR14                                          0548 01761000
*CECTST81:                                                         0549 01762000
*   R7=ADDR(RTNFLDXX)-1;            /* CALCULATE POINTER TO NEEDED   */ 01763000
CECTST81 LR    R7,WAPTR                                            0549 01764000
         SL    R7,@CF00898                                         0549 01765000
*   R7=(FSTRTN+7)/8+R7;             /* NORMAL ROUTINE BYTE           */ 01766000
         LA    @10,7                                               0550 01767000
         ALR   @10,FSTRTN                                          0550 01768000
         SRDA  @10,32                                              0550 01769000
         D     @10,@CF00054                                        0550 01770000
         ALR   R7,@11                                              0550 01771000
*CECTST82:                                                         0551 01772000
*   R6=(FSTRTN//8)+ADDR(MSKTABLE);  /* CALC. PTR                     */ 01773000
CECTST82 LR    @10,FSTRTN                                          0551 01774000
         SRDA  @10,32                                              0551 01775000
         D     @10,@CF00054                                        0551 01776000
         LA    R6,MSKTABLE                                         0551 01777000
         ALR   @10,R6                                              0551 01778000
         LR    R6,@10                                              0551 01779000
*   RTNFIELD=RTNFIELD|MASK;         /* SET BIT IN ROUTINE FIELD      */ 01780000
         OC    RTNFIELD(1,R7),MASK(R6)                             0552 01781000
*   FSTRTN=FSTRTN+1;                /* INCREMENT FIRST ROUTINE       */ 01782000
         AL    FSTRTN,@CF00072                                     0553 01783000
*   IF FSTRTN>LSTRTN THEN           /* IS ROUTINE FINISHED. YES,   0554 01784000
*                                      CLEAN                         */ 01785000
         CR    FSTRTN,LSTRTN                                       0554 01786000
         BH    @RT00554                                            0554 01787000
*     GO TO CECTST83;               /* UP. NO, DETERMINE WHICH SUB-  */ 01788000
*   IF EXPFLG='1'B THEN             /* ROUTINE IS BEING USED AND DO  */ 01789000
         TM    EXPFLG,B'00010000'                                  0556 01790000
         BO    @RT00556                                            0556 01791000
*     GO TO CECTST79;               /* IT AGAIN                      */ 01792000
*   GO TO CECTST81;                                                0558 01793000
         B     CECTST81                                            0558 01794000
*CECTST83:                                                         0559 01795000
*   EXPFLG='0'B;                    /* CLEANUP AND RETURN            */ 01796000
CECTST83 NI    EXPFLG,B'11101111'                                  0559 01797000
*   $HIGHRTN=LSTRTN;                                               0560 01798000
         STC   LSTRTN,$HIGHRTN(,WAPTR)                             0560 01799000
*   R14=SAVR14;                     /* RESTORE RETURN REGISTER       */ 01800000
         L     R14,SAVR14                                          0561 01801000
*   RETURN;                                                        0562 01802000
@EL00002 DS    0H                                                  0562 01803000
@EF00002 DS    0H                                                  0562 01804000
@ER00002 BR    @14                                                 0562 01805000
*   END CECTST78;                                                  0563 01806000
*   DO;                             /* ATDSPLY                       */ 01807000
*   END;                            /* ATDSPLY                       */ 01808000
*   END ISTIC004;                                                  0566 01809000
@DATA    DS    0H                                                       01810000
         DS    0F                                                       01811000
         DS    0F                                                       01812000
@CF00072 DC    F'1'                                                     01813000
@CH00072 EQU   @CF00072+2                                               01814000
@CF00139 DC    F'2'                                                     01815000
@CF00081 DC    F'3'                                                     01816000
@CF00068 DC    F'4'                                                     01817000
@CF00054 DC    F'8'                                                     01818000
@CF00061 DC    F'16'                                                    01819000
@CF00881 DC    F'19'                                                    01820000
@CF00494 DC    F'26'                                                    01821000
@CF00865 DC    F'255'                                                   01822000
@CF00898 DC    F'-3'                                                    01823000
         DS    0D                                                       01824000
CECMAP   DS    A                                                        01825000
@TS00001 DS    CL4                                                      01826000
@CC00765 DC    C'  A'                                                   01827000
@CC00766 DC    C'  Z'                                                   01828000
@CC00769 DC    C'   '                                                   01829000
@CC00809 DC    C' AA'                                                   01830000
@CC00814 DC    C'AAA'                                                   01831000
@CC00819 EQU   @CC00814                                                 01832000
         DS    CL1                                                      01833000
SECINIT  DC    X'40404000'                                              01834000
         DS    CL4                                                      01835000
@NM00051 DS    CL40                                                     01836000
         ORG   @NM00051                                                 01837000
LET1PTR  DS    AL4                                                      01838000
LET2PTR  DS    AL4                                                      01839000
LET3PTR  DS    AL4                                                      01840000
J        DS    FL2                                                      01841000
N        DS    FL2                                                      01842000
DOUBLEWD DS    CL8                                                      01843000
         ORG   DOUBLEWD                                                 01844000
SAVR14   DS    AL4                                                      01845000
         ORG   @NM00051+24                                              01846000
FRSTRTN  DS    CL4                                                      01847000
         ORG   FRSTRTN                                                  01848000
LASTRTN  DS    CL4                                                      01849000
         ORG   LASTRTN                                                  01850000
@NM00052 DS    CL1                                                      01851000
FRSTRTN1 DS    CL3                                                      01852000
         ORG   FRSTRTN1                                                 01853000
LASTRTN1 DS    CL3                                                      01854000
         ORG   LASTRTN1                                                 01855000
@NM00053 DS    CL1                                                      01856000
FRSTRTN2 DS    CL2                                                      01857000
         ORG   FRSTRTN2                                                 01858000
LASTRTN2 DS    CL2                                                      01859000
         ORG   LASTRTN2                                                 01860000
@NM00054 DS    CL1                                                      01861000
FRSTRTN3 DS    CL1                                                      01862000
         ORG   FRSTRTN3                                                 01863000
LASTRTN3 DS    CL1                                                      01864000
         ORG   @NM00051+28                                              01865000
SECCNTR  DS    FL4                                                      01866000
SWITCHES DC    X'00'                                                    01867000
         ORG   SWITCHES                                                 01868000
SECTIONS DS    BL1                                                      01869000
         ORG   SECTIONS                                                 01870000
SECT1    DS    BL1                                                      01871000
SECT2    EQU   SECTIONS+0                                               01872000
SECT3    EQU   SECTIONS+0                                               01873000
         ORG   SWITCHES+0                                               01874000
EXPFLG   EQU   SWITCHES+0                                               01875000
DUBNUM   EQU   SWITCHES+0                                               01876000
TRINUM   EQU   SWITCHES+0                                               01877000
@NM00055 EQU   SWITCHES+0                                               01878000
DASH     EQU   SWITCHES+0                                               01879000
         ORG   @NM00051+33                                              01880000
FSTSEC   DS    CL3                                                      01881000
         ORG   FSTSEC                                                   01882000
@NM00056 DS    CL1                                                      01883000
FSTSEC1  DS    CL2                                                      01884000
         ORG   FSTSEC1                                                  01885000
FSTSECT1 DS    CL1                                                      01886000
FSTSEC2  DS    CL1                                                      01887000
         ORG   @NM00051+36                                              01888000
LSTSEC   DS    CL3                                                      01889000
         ORG   LSTSEC                                                   01890000
@NM00057 DS    CL1                                                      01891000
LSTSEC1  DS    CL2                                                      01892000
         ORG   LSTSEC1                                                  01893000
@NM00058 DS    CL1                                                      01894000
LSTSEC2  DS    CL1                                                      01895000
         ORG   @NM00051+40                                              01896000
MSKTABLE DC    X'0180402010080402'                                      01897000
ALPHABET DC    CL26'ABCDEFGHIJKLMNOPQRSTUVWXYZ'                         01898000
NUMBERS  DC    CL10'0123456789'                                         01899000
$TCA09   DS    CL13                                                     01900000
         ORG   $TCA09                                                   01901000
$TCB09   DC    A(112)                                                   01902000
$TCC09   DC    A(0)                                                     01903000
$TCD09   DC    B'10000000'                                              01904000
$TCE09   DC    X'FFFFFFFF'                                              01905000
         ORG   $TCA09+13                                                01906000
         DS    CL3                                                      01907000
$TCA10   DS    CL13                                                     01908000
         ORG   $TCA10                                                   01909000
$TCB10   DC    A(155)                                                   01910000
$TCC10   DC    A(0)                                                     01911000
$TCD10   DC    B'00000000'                                              01912000
$TCE10   DC    X'FFFFFFFF'                                              01913000
         ORG   $TCA10+13                                                01914000
         DS    CL3                                                      01915000
PATCH    DC    15F'0'                                                   01916000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01917000
@01      EQU   01                                                       01918000
@02      EQU   02                                                       01919000
@03      EQU   03                                                       01920000
@04      EQU   04                                                       01921000
@05      EQU   05                                                       01922000
@06      EQU   06                                                       01923000
@07      EQU   07                                                       01924000
@08      EQU   08                                                       01925000
@09      EQU   09                                                       01926000
@10      EQU   10                                                       01927000
@11      EQU   11                                                       01928000
@12      EQU   12                                                       01929000
@13      EQU   13                                                       01930000
@14      EQU   14                                                       01931000
@15      EQU   15                                                       01932000
RCAPTR   EQU   @04                                                      01933000
WAPTR    EQU   @02                                                      01934000
R1       EQU   @01                                                      01935000
R2       EQU   @02                                                      01936000
I        EQU   @03                                                      01937000
R5       EQU   @05                                                      01938000
R6       EQU   @06                                                      01939000
R7       EQU   @07                                                      01940000
FSTRTN   EQU   @08                                                      01941000
R8       EQU   @08                                                      01942000
R9       EQU   @09                                                      01943000
LSTRTN   EQU   @09                                                      01944000
R13      EQU   @13                                                      01945000
R14      EQU   @14                                                      01946000
R10      EQU   @10                                                      01947000
R15      EQU   @15                                                      01948000
$RCAAREA EQU   0                                                        01949000
$POINTER EQU   $RCAAREA+100                                             01950000
$TRTBLA  EQU   $POINTER+124                                             01951000
$CONSTNT EQU   $RCAAREA+244                                             01952000
$RCAFLG  EQU   $RCAAREA+604                                             01953000
$CUTESTB EQU   $RCAFLG                                                  01954000
TOLTEPWA EQU   0                                                        01955000
$SCTTBLE EQU   TOLTEPWA                                                 01956000
$TESTOPT EQU   $SCTTBLE+2                                               01957000
$ERROPT  EQU   $SCTTBLE+3                                               01958000
$RT0108  EQU   $SCTTBLE+4                                               01959000
$RT0916  EQU   $SCTTBLE+5                                               01960000
$PDEVFLG EQU   $SCTTBLE+10                                              01961000
$CDSFLGS EQU   $SCTTBLE+11                                              01962000
$CDS8T19 EQU   $SCTTBLE+20                                              01963000
$EXECFLG EQU   $SCTTBLE+33                                              01964000
$RTNSLCT EQU   $EXECFLG                                                 01965000
$OLTFLGS EQU   $SCTTBLE+36                                              01966000
$OLTFLG2 EQU   $SCTTBLE+37                                              01967000
$TOTFLG1 EQU   $SCTTBLE+38                                              01968000
$ROUTMSK EQU   $SCTTBLE+40                                              01969000
$CDA     EQU   TOLTEPWA+100                                             01970000
$SLASHAD EQU   $CDA+32                                                  01971000
$RCA     EQU   $CDA+44                                                  01972000
$OLTPTR  EQU   $CDA+52                                                  01973000
$HIMOREC EQU   $CDA+60                                                  01974000
$CUCNT   EQU   $CDA+118                                                 01975000
$COMMFLG EQU   TOLTEPWA+224                                             01976000
$FLAG1   EQU   $COMMFLG                                                 01977000
$FLAG2   EQU   $COMMFLG+1                                               01978000
$VALDTST EQU   $FLAG2                                                   01979000
$FLAG3   EQU   $COMMFLG+2                                               01980000
$TSTERR  EQU   $FLAG3                                                   01981000
$FLAG4   EQU   $COMMFLG+3                                               01982000
$FLAG5   EQU   $COMMFLG+4                                               01983000
$EOJ     EQU   $FLAG5                                                   01984000
$CANCEL  EQU   $EOJ                                                     01985000
$FLAG6   EQU   $COMMFLG+5                                               01986000
$ABNDBIT EQU   $FLAG6                                                   01987000
$FLAG7   EQU   $COMMFLG+6                                               01988000
$FLAG8   EQU   $COMMFLG+7                                               01989000
$TCECM   EQU   $FLAG8                                                   01990000
$FLAG9   EQU   $COMMFLG+8                                               01991000
$FLAG10  EQU   $COMMFLG+9                                               01992000
$FLAG11  EQU   $COMMFLG+10                                              01993000
$FLAG12  EQU   $COMMFLG+11                                              01994000
$FLAG13  EQU   $COMMFLG+12                                              01995000
$DEVTBLE EQU   TOLTEPWA+240                                             01996000
$DEVCDS  EQU   $DEVTBLE                                                 01997000
$DEVUNAD EQU   $DEVCDS                                                  01998000
@NM00039 EQU   $DEVUNAD+2                                               01999000
$DEVFEAT EQU   $DEVCDS+4                                                02000000
$DEVCDSF EQU   $DEVCDS+9                                                02001000
$DEVSDCF EQU   $DEVCDS+10                                               02002000
$$SYMNME EQU   $DEVCDS+12                                               02003000
$DEVFLG1 EQU   $DEVTBLE+20                                              02004000
$EVNCPLT EQU   $DEVFLG1                                                 02005000
$ATTNEXP EQU   $DEVFLG1                                                 02006000
$INTOCC  EQU   $DEVFLG1                                                 02007000
$DEVFLG2 EQU   $DEVTBLE+21                                              02008000
$DEVTECB EQU   $DEVTBLE+22                                              02009000
$OPIS    EQU   $DEVTECB                                                 02010000
$OPND    EQU   $DEVTECB+2                                               02011000
$DEVFLG3 EQU   $DEVTBLE+27                                              02012000
$SIOFLG  EQU   $DEVFLG3                                                 02013000
$IFTOUT  EQU   $DEVTBLE+36                                              02014000
$DEVSESP EQU   $IFTOUT                                                  02015000
$SSCPDAF EQU   $IFTOUT+6                                                02016000
$LDNCBPT EQU   $DEVTBLE+48                                              02017000
$RNINFO  EQU   $DEVTBLE+56                                              02018000
$DEVFLG5 EQU   $RNINFO+8                                                02019000
$DEVFLG4 EQU   $DEVTBLE+65                                              02020000
$SLTBL   EQU   TOLTEPWA+1468                                            02021000
$FAMILY  EQU   $SLTBL                                                   02022000
$RUNTEST EQU   $SLTBL+13                                                02023000
$TESTFLG EQU   $SLTBL+21                                                02024000
$SECLST  EQU   $SLTBL+22                                                02025000
$TSTCNT  EQU   $SLTBL+126                                               02026000
$HIGHRTN EQU   $SLTBL+134                                               02027000
$INBUFR  EQU   TOLTEPWA+2104                                            02028000
#EXITA   EQU   TOLTEPWA+2632                                            02029000
$CCOMDAT EQU   TOLTEPWA+2644                                            02030000
$CFLGS   EQU   $CCOMDAT+16                                              02031000
$24FEMSG EQU   TOLTEPWA+2681                                            02032000
$24CATMG EQU   $24FEMSG+11                                              02033000
@NM00048 EQU   TOLTEPWA+2776                                            02034000
$OUNTPTR EQU   @NM00048+4                                               02035000
$NSPTR   EQU   $OUNTPTR                                                 02036000
$NSCNT   EQU   @NM00048+10                                              02037000
$ENXX    EQU   @NM00048+15                                              02038000
$IMITX   EQU   $ENXX                                                    02039000
SVESC033 EQU   TOLTEPWA+3160                                            02040000
SVECC013 EQU   TOLTEPWA+3232                                            02041000
SVEIC003 EQU   TOLTEPWA+3592                                            02042000
SVESC022 EQU   TOLTEPWA+3736                                            02043000
SVECC011 EQU   TOLTEPWA+4024                                            02044000
#EXIT    EQU   0                                                        02045000
CECOMMAP EQU   0                                                        02046000
SECLSTXX EQU   0                                                        02047000
TSTSECTN EQU   SECLSTXX                                                 02048000
TSTSCTN3 EQU   TSTSECTN                                                 02049000
TSTSCTN2 EQU   TSTSCTN3                                                 02050000
TSTSCTN1 EQU   TSTSCTN2                                                 02051000
TSTFLG   EQU   SECLSTXX+3                                               02052000
MASK     EQU   0                                                        02053000
LETTER   EQU   0                                                        02054000
NUMBER   EQU   0                                                        02055000
RTNFLDXX EQU   0                                                        02056000
RTNFIELD EQU   0                                                        02057000
INPUTBUF EQU   0                                                        02058000
BACKSAVE EQU   0                                                        02059000
$TRTBL   EQU   0                                                        02060000
SVECC012 EQU   SVESC022                                                 02061000
SVEIC00A EQU   SVEIC003                                                 02062000
SVEIC004 EQU   SVEIC003                                                 02063000
SVEIC005 EQU   SVEIC003                                                 02064000
SVESC02A EQU   SVESC022                                                 02065000
SVESC02B EQU   SVESC022                                                 02066000
SVESC02D EQU   SVESC022                                                 02067000
SVESC02E EQU   SVESC022                                                 02068000
SVESC02F EQU   SVECC013                                                 02069000
SVESC024 EQU   SVESC022                                                 02070000
SVESC027 EQU   SVESC022                                                 02071000
SVESC029 EQU   SVESC033                                                 02072000
SVESC031 EQU   SVECC013                                                 02073000
SVESC032 EQU   SVECC011                                                 02074000
SVETC037 EQU   SVEIC003                                                 02075000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02076000
$CECFLAG EQU   CECOMMAP+20                                              02077000
$CEINCT  EQU   CECOMMAP+16                                              02078000
$CEINADR EQU   CECOMMAP+12                                              02079000
$CEOUTCT EQU   CECOMMAP+8                                               02080000
$CEOUTAD EQU   CECOMMAP+4                                               02081000
$CECIDNT EQU   CECOMMAP+2                                               02082000
$CECLEVL EQU   CECOMMAP+1                                               02083000
$CECTRMG EQU   CECOMMAP                                                 02084000
SVECC010 EQU   TOLTEPWA+3952                                            02085000
SVETC035 EQU   TOLTEPWA+3880                                            02086000
SVESC030 EQU   TOLTEPWA+3808                                            02087000
SVESC020 EQU   TOLTEPWA+3664                                            02088000
SVEIC002 EQU   TOLTEPWA+3520                                            02089000
SVECC014 EQU   TOLTEPWA+3376                                            02090000
SVESC120 EQU   TOLTEPWA+3304                                            02091000
SVESC025 EQU   TOLTEPWA+3088                                            02092000
@NM00050 EQU   TOLTEPWA+2980                                            02093000
$RPLERR  EQU   TOLTEPWA+2977                                            02094000
@NM00049 EQU   TOLTEPWA+2976                                            02095000
$R13PR3  EQU   TOLTEPWA+2972                                            02096000
$CEINT2  EQU   TOLTEPWA+2968                                            02097000
$CEINT1  EQU   TOLTEPWA+2964                                            02098000
$MSGGET  EQU   TOLTEPWA+2960                                            02099000
$ACQLIST EQU   TOLTEPWA+2956                                            02100000
$R4SAVE1 EQU   TOLTEPWA+2952                                            02101000
$CLSISS  EQU   TOLTEPWA+2950                                            02102000
$CLSCNT  EQU   TOLTEPWA+2948                                            02103000
$CUTABLE EQU   TOLTEPWA+2868                                            02104000
$BUFSZ2  EQU   TOLTEPWA+2864                                            02105000
$RESID2  EQU   TOLTEPWA+2860                                            02106000
$OLTCCW2 EQU   TOLTEPWA+2856                                            02107000
$ENDBFR2 EQU   TOLTEPWA+2852                                            02108000
$1STBFR2 EQU   TOLTEPWA+2848                                            02109000
$TECB2   EQU   TOLTEPWA+2844                                            02110000
$BUFSZ1  EQU   TOLTEPWA+2840                                            02111000
$RESID1  EQU   TOLTEPWA+2836                                            02112000
$OLTCCW1 EQU   TOLTEPWA+2832                                            02113000
$ENDBFR1 EQU   TOLTEPWA+2828                                            02114000
$1STBFR1 EQU   TOLTEPWA+2824                                            02115000
$TECB1   EQU   TOLTEPWA+2820                                            02116000
$WAITIME EQU   TOLTEPWA+2816                                            02117000
$TRTN#   EQU   TOLTEPWA+2815                                            02118000
$WIODEV  EQU   TOLTEPWA+2814                                            02119000
$RQSTSZE EQU   TOLTEPWA+2812                                            02120000
$RQSTPTR EQU   TOLTEPWA+2808                                            02121000
$R4SAVE  EQU   TOLTEPWA+2804                                            02122000
$PARTADR EQU   TOLTEPWA+2800                                            02123000
$TBSDATA EQU   TOLTEPWA+2796                                            02124000
$CTWIDTH EQU   TOLTEPWA+2795                                            02125000
$CTLINE  EQU   TOLTEPWA+2794                                            02126000
$APWIDTH EQU   TOLTEPWA+2793                                            02127000
$APLINE  EQU   TOLTEPWA+2792                                            02128000
$INDEX   EQU   $IMITX                                                   02129000
$UMXX    EQU   @NM00048+14                                              02130000
$NSXX    EQU   @NM00048+12                                              02131000
$ATACNT  EQU   $NSCNT                                                   02132000
$CTR     EQU   @NM00048+8                                               02133000
$ATAPTR  EQU   $NSPTR                                                   02134000
$DDRPTR  EQU   @NM00048                                                 02135000
$DTORESP EQU   TOLTEPWA+2712                                            02136000
$APNAME  EQU   TOLTEPWA+2704                                            02137000
$24SYMNE EQU   $24CATMG+4                                               02138000
$24DEVAD EQU   $24CATMG                                                 02139000
$24RTN#  EQU   $24FEMSG+8                                               02140000
$ESECTID EQU   $24FEMSG                                                 02141000
$24FLGS  EQU   TOLTEPWA+2680                                            02142000
$24SAVE2 EQU   TOLTEPWA+2676                                            02143000
$24SAVE1 EQU   TOLTEPWA+2672                                            02144000
$24UNADR EQU   TOLTEPWA+2668                                            02145000
$24SAV13 EQU   TOLTEPWA+2664                                            02146000
$24RETCD EQU   TOLTEPWA+2663                                            02147000
$MACID   EQU   TOLTEPWA+2661                                            02148000
$CSPARE  EQU   $CFLGS                                                   02149000
$C2WAY   EQU   $CFLGS                                                   02150000
$CINCT   EQU   $CCOMDAT+12                                              02151000
$CINADR  EQU   $CCOMDAT+8                                               02152000
$COUTCT  EQU   $CCOMDAT+4                                               02153000
$COUTAD  EQU   $CCOMDAT                                                 02154000
ROOTLOC  EQU   TOLTEPWA+2640                                            02155000
$RETREG  EQU   TOLTEPWA+2636                                            02156000
$WORK    EQU   TOLTEPWA+2376                                            02157000
$EXTA    EQU   TOLTEPWA+2320                                            02158000
$PASSONA EQU   TOLTEPWA+2264                                            02159000
$TRMINPT EQU   TOLTEPWA+2184                                            02160000
$BUFFER  EQU   TOLTEPWA+1976                                            02161000
$TLTRPL3 EQU   TOLTEPWA+1856                                            02162000
$TLTRPL2 EQU   TOLTEPWA+1736                                            02163000
$TLTRPL1 EQU   TOLTEPWA+1616                                            02164000
@NM00047 EQU   $SLTBL+135                                               02165000
$PRIMADR EQU   $SLTBL+130                                               02166000
$CTSTPT  EQU   $SLTBL+128                                               02167000
$SECFLGS EQU   $SECLST+3                                                02168000
$SECTION EQU   $SECLST                                                  02169000
$SECACT  EQU   $TESTFLG                                                 02170000
$CANTRUN EQU   $TESTFLG                                                 02171000
$FINAL   EQU   $TESTFLG                                                 02172000
$TESTSUF EQU   $RUNTEST+5                                               02173000
$TESTNUM EQU   $RUNTEST+1                                               02174000
$LETPRF  EQU   $RUNTEST                                                 02175000
$SYMBOLC EQU   $SLTBL+5                                                 02176000
$CDEVPT  EQU   TOLTEPWA+1466                                            02177000
$DEVCNTS EQU   TOLTEPWA+1464                                            02178000
$FEEDBCK EQU   $DEVTBLE+66                                              02179000
$WTISUED EQU   $DEVFLG4                                                 02180000
$EXIOISD EQU   $DEVFLG4                                                 02181000
$REMWRIT EQU   $DEVFLG4                                                 02182000
$REMDONE EQU   $DEVFLG4                                                 02183000
$2NDUSED EQU   $DEVFLG4                                                 02184000
$1STUSED EQU   $DEVFLG4                                                 02185000
$IGLXIFB EQU   $DEVFLG4                                                 02186000
$EXIOLV3 EQU   $DEVFLG4                                                 02187000
@NM00046 EQU   $DEVFLG5                                                 02188000
$DVBASIC EQU   $DEVFLG5                                                 02189000
$ASCII   EQU   $DEVFLG5                                                 02190000
$DEVLU   EQU   $DEVFLG5                                                 02191000
$OPNDFAL EQU   $DEVFLG5                                                 02192000
$ACQNCB  EQU   $DEVFLG5                                                 02193000
$REMOTE  EQU   $DEVFLG5                                                 02194000
$ENDNODE EQU   $DEVFLG5                                                 02195000
$LINENME EQU   $RNINFO                                                  02196000
$CID     EQU   $DEVTBLE+52                                              02197000
$DVCOL   EQU   $LDNCBPT+2                                               02198000
$DVROW   EQU   $LDNCBPT                                                 02199000
$NCSPLP  EQU   $DEVTBLE+44                                              02200000
$DVLN    EQU   $SSCPDAF                                                 02201000
$DAF     EQU   $DEVSESP+4                                               02202000
$VARYPAB EQU   $DEVSESP                                                 02203000
$SYSMN   EQU   $DEVTBLE+28                                              02204000
@NM00045 EQU   $DEVFLG3                                                 02205000
$CLRSNT  EQU   $DEVFLG3                                                 02206000
$OLTERR  EQU   $DEVFLG3                                                 02207000
$SRTEST  EQU   $DEVFLG3                                                 02208000
$DVSNDOK EQU   $SIOFLG                                                  02209000
$POLLREQ EQU   $DEVFLG3                                                 02210000
$ACQRED  EQU   $DEVFLG3                                                 02211000
$NOTDEV  EQU   $DEVFLG3                                                 02212000
$DVINCT  EQU   $DEVTBLE+26                                              02213000
$DVBRKST EQU   $OPND+1                                                  02214000
$DVBRKSN EQU   $OPND                                                    02215000
$DVSEQNO EQU   $OPIS                                                    02216000
$CEINTRP EQU   $DEVFLG2                                                 02217000
$TESTMDE EQU   $DEVFLG2                                                 02218000
$DEVALOC EQU   $DEVFLG2                                                 02219000
$ALLDATA EQU   $DEVFLG2                                                 02220000
$ENDCNTL EQU   $DEVFLG2                                                 02221000
$CTLDEV  EQU   $DEVFLG2                                                 02222000
$NOCDS   EQU   $DEVFLG2                                                 02223000
$DATAIN  EQU   $DEVFLG2                                                 02224000
$PRIMARY EQU   $DEVFLG1                                                 02225000
$DVCTBYT EQU   $INTOCC                                                  02226000
$DEVACT  EQU   $DEVFLG1                                                 02227000
$DVLGMDE EQU   $ATTNEXP                                                 02228000
$DVSPRM  EQU   $EVNCPLT                                                 02229000
$GRABBED EQU   $DEVFLG1                                                 02230000
$CATASTR EQU   $DEVFLG1                                                 02231000
$LETGO   EQU   $DEVFLG1                                                 02232000
$CURELEM EQU   $$SYMNME+4                                               02233000
$MSGOTSD EQU   $$SYMNME                                                 02234000
$EXTDEV  EQU   $DEVCDS+11                                               02235000
@NM00044 EQU   $DEVSDCF                                                 02236000
$NOTPRIM EQU   $DEVSDCF                                                 02237000
@NM00043 EQU   $DEVCDSF                                                 02238000
@NM00042 EQU   $DEVCDSF                                                 02239000
@NM00041 EQU   $DEVCDSF                                                 02240000
$CDSNAME EQU   $DEVCDSF                                                 02241000
$EXTRN   EQU   $DEVCDSF                                                 02242000
$CEVOLUM EQU   $DEVCDSF                                                 02243000
$SHARD   EQU   $DEVCDSF                                                 02244000
$DEVFPM  EQU   $DEVCDSF                                                 02245000
$DEVCNT  EQU   $DEVCDS+8                                                02246000
$DEVTYPE EQU   $DEVFEAT+3                                               02247000
$DEVCLAS EQU   $DEVFEAT+2                                               02248000
$DEVFRRS EQU   $DEVFEAT+1                                               02249000
$DEVMOD  EQU   $DEVFEAT                                                 02250000
$DEVRDGT EQU   @NM00039+1                                               02251000
$DEVCTLU EQU   @NM00039+1                                               02252000
$DEVCHAN EQU   @NM00039                                                 02253000
@NM00040 EQU   @NM00039                                                 02254000
$CTINDX  EQU   $DEVUNAD                                                 02255000
$FLAG16  EQU   $COMMFLG+15                                              02256000
$FLAG15  EQU   $COMMFLG+14                                              02257000
$FLAG14  EQU   $COMMFLG+13                                              02258000
$TEP2ND  EQU   $FLAG13                                                  02259000
$TEP1ST  EQU   $FLAG13                                                  02260000
$CATMSG  EQU   $FLAG13                                                  02261000
$PRMPTSW EQU   $FLAG13                                                  02262000
$DEVENT  EQU   $FLAG13                                                  02263000
$OLTMACC EQU   $FLAG13                                                  02264000
$LGON    EQU   $FLAG13                                                  02265000
$CTLOGON EQU   $FLAG13                                                  02266000
@NM00038 EQU   $FLAG12                                                  02267000
$VARYINP EQU   $FLAG12                                                  02268000
$ENDTEST EQU   $FLAG12                                                  02269000
$VRYHRD  EQU   $FLAG12                                                  02270000
$VRYSFT  EQU   $FLAG12                                                  02271000
$POSTFLG EQU   $FLAG12                                                  02272000
$OPTMSG  EQU   $FLAG12                                                  02273000
$FEORCAT EQU   $FLAG11                                                  02274000
@NM00037 EQU   $FLAG11                                                  02275000
@NM00036 EQU   $FLAG10                                                  02276000
$INBND   EQU   $FLAG10                                                  02277000
$WAITFLG EQU   $FLAG10                                                  02278000
$DPRINT  EQU   $FLAG10                                                  02279000
$HOLD    EQU   $FLAG9                                                   02280000
$NOTRRCH EQU   $FLAG9                                                   02281000
@NM00035 EQU   $FLAG9                                                   02282000
$COPY    EQU   $FLAG9                                                   02283000
$LSTLNSW EQU   $FLAG9                                                   02284000
$MULLNSW EQU   $FLAG9                                                   02285000
$REMSW   EQU   $FLAG9                                                   02286000
$IGRES   EQU   $FLAG9                                                   02287000
$VS2     EQU   $FLAG8                                                   02288000
$VS1     EQU   $FLAG8                                                   02289000
$EDOS    EQU   $FLAG8                                                   02290000
@NM00034 EQU   $FLAG8                                                   02291000
$TWOWAY  EQU   $FLAG8                                                   02292000
@NM00033 EQU   $FLAG8                                                   02293000
$RCVMSG  EQU   $FLAG7                                                   02294000
$RCVRFLG EQU   $FLAG7                                                   02295000
$SNDRFLG EQU   $FLAG7                                                   02296000
$LDOIS   EQU   $FLAG7                                                   02297000
$DCONTCT EQU   $FLAG7                                                   02298000
$EXIOWAT EQU   $FLAG7                                                   02299000
$2NDDATA EQU   $FLAG7                                                   02300000
$1STDATA EQU   $FLAG7                                                   02301000
$CIREQ   EQU   $FLAG6                                                   02302000
$ABTERM  EQU   $ABNDBIT                                                 02303000
$FSTMCIS EQU   $FLAG6                                                   02304000
$DISCREQ EQU   $FLAG6                                                   02305000
$DISCISS EQU   $FLAG6                                                   02306000
$CHANGE  EQU   $FLAG6                                                   02307000
$CTERROR EQU   $FLAG6                                                   02308000
$RECAL11 EQU   $FLAG6                                                   02309000
@NM00032 EQU   $FLAG5                                                   02310000
$PROGCK  EQU   $CANCEL                                                  02311000
$PRINTAP EQU   $FLAG5                                                   02312000
@NM00031 EQU   $FLAG5                                                   02313000
$MSG922  EQU   $FLAG5                                                   02314000
$CT924   EQU   $FLAG5                                                   02315000
$FSTCAT  EQU   $FLAG5                                                   02316000
$FSTFE   EQU   $FLAG5                                                   02317000
$ACTOPND EQU   $FLAG4                                                   02318000
$ACQCUTT EQU   $FLAG4                                                   02319000
$CLSSACT EQU   $FLAG4                                                   02320000
$BACKINT EQU   $FLAG4                                                   02321000
$DMSGSW  EQU   $FLAG4                                                   02322000
$TSTDEVP EQU   $FLAG4                                                   02323000
$APRQPER EQU   $FLAG4                                                   02324000
$OPCOM   EQU   $FLAG4                                                   02325000
$NEWAP   EQU   $FLAG3                                                   02326000
$ALTPRTR EQU   $FLAG3                                                   02327000
$OPTERR  EQU   $FLAG3                                                   02328000
$PRTONLY EQU   $FLAG3                                                   02329000
$REQSTOR EQU   $FLAG3                                                   02330000
$LOGOFFE EQU   $FLAG3                                                   02331000
$DEVERR  EQU   $FLAG3                                                   02332000
$PARTIAL EQU   $FLAG2                                                   02333000
$NRMTERM EQU   $FLAG2                                                   02334000
$VALDDEV EQU   $FLAG2                                                   02335000
$DBLSLSH EQU   $FLAG2                                                   02336000
$NDR     EQU   $FLAG2                                                   02337000
@NM00030 EQU   $FLAG2                                                   02338000
$FTTHR   EQU   $FLAG2                                                   02339000
$OLTACT  EQU   $FLAG1                                                   02340000
$NORELDV EQU   $FLAG1                                                   02341000
@NM00029 EQU   $FLAG1                                                   02342000
$OPTCHNG EQU   $FLAG1                                                   02343000
$DEVCHNG EQU   $FLAG1                                                   02344000
$TESTCNG EQU   $FLAG1                                                   02345000
$CNSLFG  EQU   $FLAG1                                                   02346000
$TEP3RD  EQU   $FLAG1                                                   02347000
@NM00028 EQU   $CDA+120                                                 02348000
@NM00027 EQU   $CDA+117                                                 02349000
$PRTFORM EQU   $CDA+116                                                 02350000
$OPISCNT EQU   $CDA+114                                                 02351000
$OPNDCNT EQU   $CDA+112                                                 02352000
$GETMSZE EQU   $CDA+110                                                 02353000
$GRCNTS  EQU   $CDA+108                                                 02354000
$CTLCNT  EQU   $CDA+106                                                 02355000
$ACTLVL  EQU   $CDA+105                                                 02356000
$PRNTLVL EQU   $CDA+104                                                 02357000
$ERRCNTA EQU   $CDA+102                                                 02358000
$TLCNT   EQU   $CDA+100                                                 02359000
$TIMEALW EQU   $CDA+96                                                  02360000
$PTRAREA EQU   $CDA+92                                                  02361000
$GETMPTR EQU   $CDA+88                                                  02362000
$R13PTRT EQU   $CDA+84                                                  02363000
$R13PTR  EQU   $CDA+80                                                  02364000
$TEPEND  EQU   $CDA+76                                                  02365000
$PLINKDL EQU   $CDA+72                                                  02366000
$TEPBEGN EQU   $CDA+68                                                  02367000
$FRELPTR EQU   $CDA+64                                                  02368000
$HIGHADR EQU   $HIMOREC                                                 02369000
$LOMOREC EQU   $CDA+56                                                  02370000
$LOWADDR EQU   $OLTPTR                                                  02371000
$ENDCOMM EQU   $CDA+48                                                  02372000
$COMMON  EQU   $RCA                                                     02373000
$PASSON  EQU   $CDA+28                                                  02374000
$TOLBRTB EQU   $CDA+24                                                  02375000
$SCTPTR8 EQU   $CDA+20                                                  02376000
$SCTPTR  EQU   $CDA+16                                                  02377000
$TBWDPTR EQU   $CDA+12                                                  02378000
$TFWDPTR EQU   $CDA+8                                                   02379000
@NM00026 EQU   $CDA                                                     02380000
@NM00025 EQU   $SCTTBLE+98                                              02381000
$SCTLWTC EQU   $SCTTBLE+96                                              02382000
$SCTLWTA EQU   $SCTTBLE+92                                              02383000
#EXT     EQU   $SCTTBLE+88                                              02384000
#PASS    EQU   $SCTTBLE+84                                              02385000
#TABLE   EQU   $SCTTBLE+80                                              02386000
#MSGIDAC EQU   $SCTTBLE+78                                              02387000
@NM00024 EQU   $SCTTBLE+71                                              02388000
$RETMASK EQU   $SCTTBLE+70                                              02389000
$R249255 EQU   $ROUTMSK+29                                              02390000
$R241248 EQU   $ROUTMSK+28                                              02391000
$R233240 EQU   $ROUTMSK+27                                              02392000
$R225232 EQU   $ROUTMSK+26                                              02393000
$R217224 EQU   $ROUTMSK+25                                              02394000
$R209216 EQU   $ROUTMSK+24                                              02395000
$R201208 EQU   $ROUTMSK+23                                              02396000
$R193200 EQU   $ROUTMSK+22                                              02397000
$R185192 EQU   $ROUTMSK+21                                              02398000
$R177184 EQU   $ROUTMSK+20                                              02399000
$R169176 EQU   $ROUTMSK+19                                              02400000
$R161168 EQU   $ROUTMSK+18                                              02401000
$R153160 EQU   $ROUTMSK+17                                              02402000
$R145152 EQU   $ROUTMSK+16                                              02403000
$R137144 EQU   $ROUTMSK+15                                              02404000
$R129136 EQU   $ROUTMSK+14                                              02405000
$R121128 EQU   $ROUTMSK+13                                              02406000
$R113120 EQU   $ROUTMSK+12                                              02407000
$R105112 EQU   $ROUTMSK+11                                              02408000
$R097104 EQU   $ROUTMSK+10                                              02409000
$R089096 EQU   $ROUTMSK+9                                               02410000
$R081088 EQU   $ROUTMSK+8                                               02411000
$R073080 EQU   $ROUTMSK+7                                               02412000
$R065072 EQU   $ROUTMSK+6                                               02413000
$R057064 EQU   $ROUTMSK+5                                               02414000
$R049056 EQU   $ROUTMSK+4                                               02415000
$R041048 EQU   $ROUTMSK+3                                               02416000
$R033040 EQU   $ROUTMSK+2                                               02417000
$R025032 EQU   $ROUTMSK+1                                               02418000
$R017024 EQU   $ROUTMSK                                                 02419000
$TOTFLG2 EQU   $SCTTBLE+39                                              02420000
@NM00023 EQU   $TOTFLG1                                                 02421000
@NM00022 EQU   $TOTFLG1                                                 02422000
@NM00021 EQU   $TOTFLG1                                                 02423000
$CURELOD EQU   $TOTFLG1                                                 02424000
$CTEQTT  EQU   $TOTFLG1                                                 02425000
@NM00020 EQU   $TOTFLG1                                                 02426000
@NM00019 EQU   $TOTFLG1                                                 02427000
$LINESHR EQU   $TOTFLG1                                                 02428000
@NM00018 EQU   $OLTFLG2                                                 02429000
@NM00017 EQU   $OLTFLG2                                                 02430000
@NM00016 EQU   $OLTFLG2                                                 02431000
@NM00015 EQU   $OLTFLG2                                                 02432000
@NM00014 EQU   $OLTFLG2                                                 02433000
@NM00013 EQU   $OLTFLG2                                                 02434000
@NM00012 EQU   $OLTFLG2                                                 02435000
$TALK    EQU   $OLTFLG2                                                 02436000
$DYCOM   EQU   $OLTFLGS                                                 02437000
@NM00011 EQU   $OLTFLGS                                                 02438000
$TRACE   EQU   $OLTFLGS                                                 02439000
$RETCODE EQU   $OLTFLGS                                                 02440000
$CONTCB  EQU   $OLTFLGS                                                 02441000
$RETAIN  EQU   $OLTFLGS                                                 02442000
$CLEANRT EQU   $OLTFLGS                                                 02443000
$MANINTV EQU   $OLTFLGS                                                 02444000
$OLTSIZE EQU   $SCTTBLE+34                                              02445000
$QSCTMOD EQU   $EXECFLG                                                 02446000
$CTRLMOD EQU   $EXECFLG                                                 02447000
$CLEANUP EQU   $EXECFLG                                                 02448000
$LSTPDEV EQU   $EXECFLG                                                 02449000
$ERRCNT  EQU   $EXECFLG                                                 02450000
$MULTDEV EQU   $EXECFLG                                                 02451000
@NM00010 EQU   $EXECFLG                                                 02452000
$RMSKCNT EQU   $SCTTBLE+32                                              02453000
$SYNAME  EQU   $CDS8T19+4                                               02454000
$EXTSIG  EQU   $CDS8T19+3                                               02455000
$CDFLGS  EQU   $CDS8T19+1                                               02456000
$CDSCNT  EQU   $CDS8T19                                                 02457000
$PDEVDSC EQU   $SCTTBLE+16                                              02458000
$PDEVADR EQU   $SCTTBLE+12                                              02459000
$COMMCN  EQU   $CDSFLGS                                                 02460000
$CUSTSYM EQU   $CDSFLGS                                                 02461000
$TWOCHSW EQU   $CDSFLGS                                                 02462000
$SYMNAME EQU   $CDSFLGS                                                 02463000
$EXTINTC EQU   $CDSFLGS                                                 02464000
$CEVOL   EQU   $CDSFLGS                                                 02465000
$SHARED  EQU   $CDSFLGS                                                 02466000
$FPM     EQU   $CDSFLGS                                                 02467000
$LASTSUB EQU   $PDEVFLG                                                 02468000
@NM00009 EQU   $PDEVFLG                                                 02469000
@NM00008 EQU   $PDEVFLG                                                 02470000
@NM00007 EQU   $PDEVFLG                                                 02471000
$LASTDEV EQU   $PDEVFLG                                                 02472000
@NM00006 EQU   $PDEVFLG                                                 02473000
$EXFILPT EQU   $PDEVFLG                                                 02474000
$FPMOLD  EQU   $PDEVFLG                                                 02475000
$TSSSYM  EQU   $SCTTBLE+8                                               02476000
$SCTLEVL EQU   $SCTTBLE+7                                               02477000
$DRIVER  EQU   $SCTTBLE+6                                               02478000
$LOOPTST EQU   $ERROPT                                                  02479000
$LOOPERR EQU   $ERROPT                                                  02480000
$NERRPRT EQU   $ERROPT                                                  02481000
$NOCNTRL EQU   $ERROPT                                                  02482000
$ALTPRNT EQU   $ERROPT                                                  02483000
$CATERR  EQU   $ERROPT                                                  02484000
$ASTERIK EQU   $ERROPT                                                  02485000
$TESTERR EQU   $ERROPT                                                  02486000
$FSTCOMM EQU   $TESTOPT                                                 02487000
$INDEFLP EQU   $TESTOPT                                                 02488000
$NOPRT   EQU   $TESTOPT                                                 02489000
$PARAPRT EQU   $TESTOPT                                                 02490000
@NM00005 EQU   $TESTOPT                                                 02491000
$ERRLPCT EQU   $SCTTBLE                                                 02492000
$TLTEND  EQU   $RCAAREA+945                                             02493000
$CNSLID  EQU   $RCAAREA+936                                             02494000
$EXITSAV EQU   $RCAAREA+864                                             02495000
$TRASCII EQU   $RCAAREA+608                                             02496000
@NM00004 EQU   $RCAAREA+605                                             02497000
$VTAMEND EQU   $RCAFLG                                                  02498000
$TPPOSTD EQU   $RCAFLG                                                  02499000
$NEWCT   EQU   $RCAFLG                                                  02500000
$ABNDALL EQU   $RCAFLG                                                  02501000
$CONSOLE EQU   $RCAFLG                                                  02502000
$TPLOGON EQU   $RCAFLG                                                  02503000
$UPDATE  EQU   $RCAFLG                                                  02504000
$DEVAREA EQU   $RCAAREA+600                                             02505000
$CTDVAR  EQU   $RCAAREA+596                                             02506000
$BUFFS   EQU   $RCAAREA+464                                             02507000
$TLTNIB  EQU   $CONSTNT+140                                             02508000
$TLTPRPL EQU   $CONSTNT+20                                              02509000
@NM00003 EQU   $CONSTNT+4                                               02510000
@NM00002 EQU   $CONSTNT+2                                               02511000
$USECNT  EQU   $CONSTNT                                                 02512000
$CURRTWA EQU   $POINTER+140                                             02513000
$CTNAME  EQU   $POINTER+132                                             02514000
$CTARGX  EQU   $POINTER+128                                             02515000
$COMINT  EQU   $POINTER+120                                             02516000
$QUEHNDL EQU   $POINTER+116                                             02517000
@NM00001 EQU   $POINTER+36                                              02518000
$RTNPTR  EQU   $POINTER+32                                              02519000
$TLTECB2 EQU   $POINTER+28                                              02520000
$TLTECB1 EQU   $POINTER+24                                              02521000
$CLEANP  EQU   $POINTER+20                                              02522000
$ABEND   EQU   $POINTER+16                                              02523000
$LSTAREA EQU   $POINTER+12                                              02524000
$FSTAREA EQU   $POINTER+8                                               02525000
$CVTSAVE EQU   $POINTER+4                                               02526000
$TOLTEP  EQU   $POINTER                                                 02527000
$TLTACB  EQU   $RCAAREA                                                 02528000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02529000
@RT00068 EQU   CECTST05                                                 02530000
@RT00108 EQU   CECTST12                                                 02531000
@RT00160 EQU   CECTST19                                                 02532000
@RT00169 EQU   CECTST20                                                 02533000
@RT00176 EQU   CECTST26                                                 02534000
@RT00206 EQU   CECTST24                                                 02535000
@RT00215 EQU   CECTST26                                                 02536000
@RT00219 EQU   CECTST22                                                 02537000
@RT00237 EQU   CECTST28                                                 02538000
@RT00250 EQU   CECTST2B                                                 02539000
@RT00252 EQU   CECTST06                                                 02540000
@RT00263 EQU   CECTST34                                                 02541000
@RT00265 EQU   CECTST31                                                 02542000
@RT00279 EQU   CECTST33                                                 02543000
@RT00281 EQU   CECTST30                                                 02544000
@RT00298 EQU   CECTST30                                                 02545000
@RT00300 EQU   CECTST32                                                 02546000
@RT00302 EQU   CECTST03                                                 02547000
@RT00311 EQU   CECTST99                                                 02548000
@RT00313 EQU   CECTST03                                                 02549000
@RT00330 EQU   CECTST37                                                 02550000
@RT00341 EQU   CECTST03                                                 02551000
@RT00347 EQU   CECTST40                                                 02552000
@RT00356 EQU   CECTST41                                                 02553000
@RT00364 EQU   CECTST43                                                 02554000
@RT00366 EQU   CECTST59                                                 02555000
@RT00373 EQU   CECTST50                                                 02556000
@RT00375 EQU   CECTST46                                                 02557000
@RT00381 EQU   CECTST45                                                 02558000
@RT00390 EQU   CECTST75                                                 02559000
@RT00398 EQU   CECTST53                                                 02560000
@RT00404 EQU   CECTST51                                                 02561000
@RT00412 EQU   CECTST62                                                 02562000
@RT00428 EQU   CECTST55                                                 02563000
@RT00432 EQU   CECTST99                                                 02564000
CECTST56 EQU   CECTST03                                                 02565000
@RT00444 EQU   CECTST53                                                 02566000
@RT00450 EQU   CECTST61                                                 02567000
@RT00466 EQU   CECTST03                                                 02568000
@RT00471 EQU   CECTST68                                                 02569000
@RT00479 EQU   CECTST69                                                 02570000
@RT00486 EQU   CECTST72                                                 02571000
@RT00492 EQU   CECTST03                                                 02572000
@RT00499 EQU   CECTST75                                                 02573000
@RT00506 EQU   CECTST03                                                 02574000
@RT00509 EQU   CECTST70                                                 02575000
@RF00534 EQU   CECTST58                                                 02576000
@RT00554 EQU   CECTST83                                                 02577000
@RT00556 EQU   CECTST79                                                 02578000
@ENDDATA EQU   *                                                        02579000
         END   ISTIC004,(C'PLS2100',0702,80232)                         02580000
