         TITLE 'ISTIC009,CHANGE - ALLOWS CHANGE TO AN EXISTING CDS'     00001000
ISTIC009 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTIC009  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  ST    @14,12(,@13)                                        0001 00009000
         STM   @00,@12,20(@13)                                     0001 00010000
         BALR  @11,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@11                                         0001 00013000
         ST    @13,@SA00001+4                                      0001 00014000
         LA    @12,@SA00001                                        0001 00015000
         ST    @12,8(,@13)                                         0001 00016000
         LR    @13,@12                                             0001 00017000
         EJECT                                                          00018000
OPENFLAG EQU  48                                                        00019000
GOODOPEN EQU  16                                                        00020000
         EJECT                                                          00021000
         EJECT                                                          00022000
I009C01  DS    0H                                                  0075 00023000
*   CDSWKPTR=$LOWADDR;              /* SET UP BASE                   */ 00024000
         L     @15,$LOWADDR(,WAPTR)                                0075 00025000
         ST    @15,CDSWKPTR                                        0075 00026000
*   CDSWKPTR=CDSWKPTR+80;           /* GET CDS WORK AREA OFFSET      */ 00027000
         AH    @15,@CH00075                                        0076 00028000
         ST    @15,CDSWKPTR                                        0076 00029000
*   IF $REMSW^='1'B THEN            /* IF ITS NOT A REMOTE REQ       */ 00030000
         TM    $REMSW(WAPTR),B'01000000'                           0077 00031000
         BNO   @RT00077                                            0077 00032000
*     GOTO I009C01A;                /* THEN BR AROUND                */ 00033000
*   CDSSYMB='1'B;                   /* TURN ON SYMBOLIC BIT          */ 00034000
*   CDSREMSY='1'B;                  /* TURN ON REMOTE BIT            */ 00035000
         OI    CDSSYMB(@15),B'00001010'                            0080 00036000
*I009C01A:                                                         0081 00037000
*   DCL                                                            0081 00038000
*     1 ZZZGTPRM BDY(WORD),         /* GETCONFG PARAMETER LIST       */ 00039000
*      2 * CHAR(4) INIT('0102F1F6'X),                              0081 00040000
*      2 ZZZGTCD PTR,               /* POINTER TO BASIC CDS INFO     */ 00041000
*      2 ZZZGTAD PTR,               /* POINTER TO RECEIVING BUFFER   */ 00042000
*      2 ZZZGTCT FIXED(8);          /* NUMBER OF CDS BYTES NEEDED    */ 00043000
I009C01A DS    0H                                                  0082 00044000
*   ZZZGTAD=ADDR(CDSUA);            /* POINTER TO RECEIVING BUFFER   */ 00045000
         L     @15,CDSWKPTR                                        0082 00046000
         ST    @15,ZZZGTAD                                         0082 00047000
*   ZZZGTCD=ADDR(CDSUA);            /* POINTER TO BASIC CDS INFO     */ 00048000
         ST    @15,ZZZGTCD                                         0083 00049000
*   ZZZGTCT=20;                     /* NUMBER OF BYTES NEEDED        */ 00050000
         MVI   ZZZGTCT,X'14'                                       0084 00051000
*   R1=ADDR(ZZZGTPRM);              /* POINT TO THE PARM LIST        */ 00052000
         LA    R1,ZZZGTPRM                                         0085 00053000
*   CALL ISTSC029;                  /* CALL THE GETCONFG FUNCTION    */ 00054000
         L     @15,@CV00772                                        0086 00055000
         BALR  @14,@15                                             0086 00056000
*   IF R15^=12 THEN                                                0087 00057000
         CH    R15,@CH00081                                        0087 00058000
         BNE   @RT00087                                            0087 00059000
*     GOTO I009C02;                 /* BR AROUND                     */ 00060000
*I009C01B:                                                         0089 00061000
*                                                                  0089 00062000
*   /*****************************************************************/ 00063000
*   /*                                                               */ 00064000
*   /* TCEC MSGN(572) INVOKED                                        */ 00065000
*   /*                                                               */ 00066000
*   /*****************************************************************/ 00067000
*                                                                  0089 00068000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00069000
I009C01B OI    $TCECM(WAPTR),B'00000001'                           0089 00070000
*   R1=ADDR($TCA10);                /* SET UP PARM LIST $TR          */ 00071000
         LA    R1,$TCA10                                           0090 00072000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00073000
         L     @15,#EXITA(,WAPTR)                                  0091 00074000
         BALR  @14,@15                                             0091 00075000
*   DCL                                                            0092 00076000
*     1 $TCA10,                     /* TCEC PARM LIST                */ 00077000
*      2 $TCB10 FIXED(32) INIT(572),/* MSG NUMBER                    */ 00078000
*      2 $TCC10 FIXED(32) INIT(0),  /* INCT LEN                      */ 00079000
*      2 $TCD10 BIT(8) INIT('00000000'B),/* FLAG                     */ 00080000
*      2 $TCE10 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK CDS NOT   0092 00081000
*                                      FOUND                         */ 00082000
*   GOTO I009CRET;                  /* RETURN TO CONTROL MODULE      */ 00083000
         B     I009CRET                                            0093 00084000
*I009C02:                                                          0094 00085000
*   OLDCDSLN=CDSBYTCT;              /* SAVE THE ORGINAL BYTE CNT     */ 00086000
I009C02  L     @15,CDSWKPTR                                        0094 00087000
         MVC   OLDCDSLN(1),CDSBYTCT(@15)                           0094 00088000
*   IF $REMSW='1'B                  /* IF ITS A REMOTE REQUEST       */ 00089000
*     THEN                                                         0095 00090000
         TM    $REMSW(WAPTR),B'01000000'                           0095 00091000
         BNO   @RF00095                                            0095 00092000
*     DO;                                                          0096 00093000
*       DCBPTR=ADDR(RDREMCDS);      /* THEN SET UP DCB POINTER       */ 00094000
         LA    DCBPTR,RDREMCDS                                     0097 00095000
*       STOWNAME=CDSSYMBN;          /* SET UP STOW NAME              */ 00096000
         MVC   STOWNAME(8),CDSSYMBN(@15)                           0098 00097000
*     END;                                                         0099 00098000
*   ELSE                            /* OTHERWISE SET PTR             */ 00099000
*     DO;                                                          0100 00100000
         B     @RC00095                                            0100 00101000
@RF00095 DS    0H                                                  0101 00102000
*       DCBPTR=ADDR(RDLOCCDS);      /* TO POINT TO LOCAL CDS         */ 00103000
*                                                                  0101 00104000
         LA    DCBPTR,RDLOCCDS                                     0101 00105000
*       /*************************************************************/ 00106000
*       /*                                                           */ 00107000
*       /* ITACONV FROM(CDSUA)TO(STOWNAME)COUNT(4)TYPE(HE) INVOKED   */ 00108000
*       /*                                                           */ 00109000
*       /*************************************************************/ 00110000
*                                                                  0102 00111000
*       DCL                                                        0102 00112000
*         1 ITATCPRM BDY(WORD),     /* CONVERT PARAMETER LIST        */ 00113000
*          2 * CHAR(4) INIT('0102F4F1'X),                          0102 00114000
*          2 ITATCFR PTR,           /* ADDRESS OF FROM FIELD         */ 00115000
*          2 ITATCTO PTR,           /* ADDRESS OF TO FIELD           */ 00116000
*          2 * BIT(8) INIT(0),      /* FLAGS FOR CONVERT MODULE      */ 00117000
*           3 ITATCTP BIT(1),       /* TYPE OF CONVERT REQUIRED      */ 00118000
*          2 ITATCNT FIXED(8);      /* NUMBER OF BYTES TO CONVERT    */ 00119000
*       ITATCFR=ADDR(CDSUA);        /* SET THE FROM ADDRESS          */ 00120000
         MVC   ITATCFR(4),CDSWKPTR                                 0103 00121000
*       ITATCTO=ADDR(STOWNAME);     /* SET THE TO ADDRESS            */ 00122000
         LA    @15,STOWNAME                                        0104 00123000
         ST    @15,ITATCTO                                         0104 00124000
*       ITATCTP='1'B;               /* SET THE TYPE OF CONVERT BIT   */ 00125000
         OI    ITATCTP,B'10000000'                                 0105 00126000
*       ITATCNT=4;                  /* GIVE THE CONVERT BYTE COUNT   */ 00127000
         MVI   ITATCNT,X'04'                                       0106 00128000
*       R1=ADDR(ITATCPRM);          /* POINT TO CONVERT PARM LIST    */ 00129000
         LA    R1,ITATCPRM                                         0107 00130000
*       CALL ISTSC021;              /* CALL CONVERT DIRECTLY         */ 00131000
         L     @15,@CV00794                                        0108 00132000
         BALR  @14,@15                                             0108 00133000
*       GEN(MVC STOWNAME(1),UANAME);/* SET UP PREFIX ID              */ 00134000
         MVC STOWNAME(1),UANAME                                         00135000
*     END;                                                         0110 00136000
*   NAMEPTR=ADDR(STOWNAME);         /* GET PTR TO CDS NAME           */ 00137000
@RC00095 LA    NAMEPTR,STOWNAME                                    0111 00138000
*   GEN(BAL LINKR,I009CRD);         /* GO READ ESD,TXT,CDS REC       */ 00139000
         BAL LINKR,I009CRD                                              00140000
*I009C03:                                                          0113 00141000
*   CALL ISTIC00A;                  /* GO CONFIGURE CDS              */ 00142000
I009C03  L     @15,@CV00796                                        0113 00143000
         BALR  @14,@15                                             0113 00144000
*   IF $COPY='1'B                   /* IF THIS IS A COPY REQUEST     */ 00145000
*     THEN                          /*                               */ 00146000
         TM    $COPY(WAPTR),B'00001000'                            0114 00147000
         BNO   @RF00114                                            0114 00148000
*     DO;                           /* DO THE FOLLOWING              */ 00149000
*       ZZZGTAD=ADDR(WKAREA2);      /* POINTER TO RECEIVING BUFFER   */ 00150000
         LA    @15,WKAREA2                                         0116 00151000
         ST    @15,ZZZGTAD                                         0116 00152000
*       ZZZGTCD=ADDR(CDSUA);        /* POINTER TO BASIC CDS INFO     */ 00153000
         MVC   ZZZGTCD(4),CDSWKPTR                                 0117 00154000
*       ZZZGTCT=20;                 /* NUMBER OF BYTES NEEDED        */ 00155000
         MVI   ZZZGTCT,X'14'                                       0118 00156000
*       R1=ADDR(ZZZGTPRM);          /* POINT TO THE PARM LIST        */ 00157000
         LA    R1,ZZZGTPRM                                         0119 00158000
*       CALL ISTSC029;              /* CALL THE GETCONFG FUNCTION    */ 00159000
         L     @15,@CV00772                                        0120 00160000
         BALR  @14,@15                                             0120 00161000
*       IF R15^=12                  /* IF A CDS ALREADY EXIST        */ 00162000
*         THEN                      /* THEN DO THE FOLLOWING         */ 00163000
         CH    R15,@CH00081                                        0121 00164000
         BE    @RF00121                                            0121 00165000
*         DO;                                                      0122 00166000
*                                                                  0122 00167000
*           /*********************************************************/ 00168000
*           /*                                                       */ 00169000
*           /* TCEC MSGN(576)MSGMSK('40000000'X) INVOKED             */ 00170000
*           /*                                                       */ 00171000
*           /*********************************************************/ 00172000
*                                                                  0123 00173000
*           $TCECM='1'B;            /* SET TCEC SW IN RCA            */ 00174000
         OI    $TCECM(WAPTR),B'00000001'                           0123 00175000
*           R1=ADDR($TCA13);        /* SET UP PARM LIST $TR          */ 00176000
         LA    R1,$TCA13                                           0124 00177000
*           CALL S20CEC03;          /* CALL TCEC-MULTIPLE LN         */ 00178000
         L     @15,@CV00799                                        0125 00179000
         BALR  @14,@15                                             0125 00180000
*           DCL                                                    0126 00181000
*             1 $TCA13,             /* TCEC PARM LIST                */ 00182000
*              2 $TCB13 FIXED(32) INIT(576),/* MSG NUMBER            */ 00183000
*              2 $TCC13 FIXED(32) INIT(0),/* INCT LEN                */ 00184000
*              2 $TCD13 BIT(8) INIT('00000000'B),/* FLAG             */ 00185000
*              2 $TCE13 CHAR(4) INIT('40000000'X);/* MSSAGE MASK     */ 00186000
*           GOTO I009CRET;          /* PRT ERROR-CDS EXISTS,DELETE   */ 00187000
         B     I009CRET                                            0127 00188000
*         END;                                                     0128 00189000
*       ELSE                        /* IF A CDS DOES NOT EXIST       */ 00190000
*         DO;                       /* THEN DO THE FOLLOWING         */ 00191000
@RF00121 DS    0H                                                  0130 00192000
*           IF $REMSW='1'B          /* IF THIS IS A REMOTE REQUEST   */ 00193000
*             THEN                  /* THEN DO THE FOLLOWING         */ 00194000
         TM    $REMSW(WAPTR),B'01000000'                           0130 00195000
         BNO   @RF00130                                            0130 00196000
*             DO;                                                  0131 00197000
*               STOWNAME=CDSSYMBN;  /* SET UP SYMBOLIC STOW NAME     */ 00198000
         L     @15,CDSWKPTR                                        0132 00199000
         MVC   STOWNAME(8),CDSSYMBN(@15)                           0132 00200000
*               ESDNME1=CDSSYMBN;   /* SET UP SYMB NAME IN ESD REC   */ 00201000
         MVC   ESDNME1(8),CDSSYMBN(@15)                            0133 00202000
*             END;                                                 0134 00203000
*           ELSE                    /* IF THIS IS NOT A REM REQ      */ 00204000
*             DO;                   /* THEN DO THE FOLLOWING         */ 00205000
*                                                                  0135 00206000
         B     @RC00130                                            0135 00207000
@RF00130 DS    0H                                                  0136 00208000
*               /*****************************************************/ 00209000
*               /*                                                   */ 00210000
*               /* ITACONV FROM(CDSUA)TO(STOWNAME)COUNT(4)TYPE(HE)   */ 00211000
*               /* INVOKED                                           */ 00212000
*               /*                                                   */ 00213000
*               /*****************************************************/ 00214000
*                                                                  0136 00215000
*               ITATCFR=ADDR(CDSUA);/* SET THE FROM ADDRESS          */ 00216000
         MVC   ITATCFR(4),CDSWKPTR                                 0136 00217000
*               ITATCTO=ADDR(STOWNAME);/* SET THE TO ADDRESS         */ 00218000
         LA    @15,STOWNAME                                        0137 00219000
         ST    @15,ITATCTO                                         0137 00220000
*               ITATCTP='1'B;       /* SET THE TYPE OF CONVERT BIT   */ 00221000
         OI    ITATCTP,B'10000000'                                 0138 00222000
*               ITATCNT=4;          /* GIVE THE CONVERT BYTE COUNT   */ 00223000
         MVI   ITATCNT,X'04'                                       0139 00224000
*               R1=ADDR(ITATCPRM);  /* POINT TO CONVERT PARM LIST    */ 00225000
         LA    R1,ITATCPRM                                         0140 00226000
*               CALL ISTSC021;      /* CALL CONVERT DIRECTLY         */ 00227000
         L     @15,@CV00794                                        0141 00228000
         BALR  @14,@15                                             0141 00229000
*               GEN(MVC STOWNAME(1),UANAME);/* SET UP PREFIX         */ 00230000
         MVC STOWNAME(1),UANAME                                         00231000
*               ESDNME1=STOWNAME;   /* SET UP NEW ESD NAME           */ 00232000
         MVC   ESDNME1(8),STOWNAME                                 0143 00233000
*             END;                                                 0144 00234000
*         END;                                                     0145 00235000
@RC00130 DS    0H                                                  0146 00236000
*     END;                                                         0146 00237000
*   IF $REMSW='1'B                  /* IF THIS IS A REMOTE REQUEST   */ 00238000
*     THEN                          /* AND THE SYMBOLIC BIT IS ON    */ 00239000
@RF00114 TM    $REMSW(WAPTR),B'01000000'                           0147 00240000
         BNO   @RF00147                                            0147 00241000
*     DO;                           /* AND THE REMOTE BIT IS ON      */ 00242000
*       IF CDSSYMB='1'B&CDSREMSY='1'B&CDSSYMBN(1:1)^=BLANK THEN    0149 00243000
         L     @15,CDSWKPTR                                        0149 00244000
         TM    CDSSYMB(@15),B'00001010'                            0149 00245000
         BNO   @RF00149                                            0149 00246000
         CLC   CDSSYMBN(1,@15),BLANK                               0149 00247000
         BNE   @RT00149                                            0149 00248000
*         GOTO I009C04;             /* THEN IT OK-CONTINUE           */ 00249000
*       GOTO I009C03A;              /* OTHERWISE IT AN ERROR         */ 00250000
         B     I009C03A                                            0151 00251000
*     END;                                                         0152 00252000
*   ELSE                                                           0153 00253000
*     DO;                                                          0153 00254000
@RF00147 DS    0H                                                  0154 00255000
*       IF CDSSYMB='1'B             /* IF IT NOT A REMOTE REQ AND    */ 00256000
*         THEN                      /* THE SYMBOLIC BIT IS ON        */ 00257000
         L     @15,CDSWKPTR                                        0154 00258000
         TM    CDSSYMB(@15),B'00001000'                            0154 00259000
         BNO   @RF00154                                            0154 00260000
*         DO;                       /* THEN CK FOR SYMBOLIC NAME     */ 00261000
*           IF CDSSYMBN=BLANK       /* IF BLANK                      */ 00262000
*             THEN                  /* THEN                          */ 00263000
         CLC   CDSSYMBN(1,@15),BLANK                               0156 00264000
         BE    @RT00156                                            0156 00265000
*             GOTO I009C04;         /* IT OK-CONTINUE                */ 00266000
*           GOTO I009C03A;          /* OTHERWISE PRT ERROR           */ 00267000
         B     I009C03A                                            0158 00268000
*         END;                                                     0159 00269000
*       ELSE                        /* IF THE SYMBOLIC BIT IS OFF    */ 00270000
*         GOTO I009C04;             /* IT OK-CONTINUE                */ 00271000
*     END;                                                         0161 00272000
*I009C03A:                                                         0162 00273000
*                                                                  0162 00274000
*   /*****************************************************************/ 00275000
*   /*                                                               */ 00276000
*   /* TCEC MSGN(581)MSGMSK('00400000'X) INVOKED                     */ 00277000
*   /*                                                               */ 00278000
*   /*****************************************************************/ 00279000
*                                                                  0162 00280000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00281000
I009C03A OI    $TCECM(WAPTR),B'00000001'                           0162 00282000
*   R1=ADDR($TCA15);                /* SET UP PARM LIST $TR          */ 00283000
         LA    R1,$TCA15                                           0163 00284000
*   CALL S20CEC03;                  /* CALL TCEC-MULTIPLE LN         */ 00285000
         L     @15,@CV00799                                        0164 00286000
         BALR  @14,@15                                             0164 00287000
*   DCL                                                            0165 00288000
*     1 $TCA15,                     /* TCEC PARM LIST                */ 00289000
*      2 $TCB15 FIXED(32) INIT(581),/* MSG NUMBER                    */ 00290000
*      2 $TCC15 FIXED(32) INIT(0),  /* INCT LEN                      */ 00291000
*      2 $TCD15 BIT(8) INIT('00000000'B),/* FLAG                     */ 00292000
*      2 $TCE15 CHAR(4) INIT('00400000'X);/* MSSAGE MASK INV SYM NME    00293000
*                                      OR FLAG                       */ 00294000
*   GO TO I009C03;                  /* GO RECONFIGURE                */ 00295000
         B     I009C03                                             0166 00296000
*I009C04:                                                          0167 00297000
*   IF $COPY='1'B THEN              /* IF THIS IS A COPY REQUEST     */ 00298000
I009C04  TM    $COPY(WAPTR),B'00001000'                            0167 00299000
         BO    @RT00167                                            0167 00300000
*     GOTO I009C05;                 /* THEN BR AROUND                */ 00301000
*   IF CDSBYTCT^>OLDCDSLN           /* IF THE CDS RECORD DID NOT     */ 00302000
*     THEN                          /* INCREASE IN SIZE              */ 00303000
         L     @15,CDSWKPTR                                        0169 00304000
         CLC   CDSBYTCT(1,@15),OLDCDSLN                            0169 00305000
         BH    @RF00169                                            0169 00306000
*     DO;                           /* THEN SET UP TTR TO POINT      */ 00307000
*       GEN(B I009CWR2);            /* GO WRT CDS RECORD ONLY        */ 00308000
         B I009CWR2                                                     00309000
*     END;                                                         0172 00310000
*   ELSE                            /* IF CDS DID INCREASE IN SIZE   */ 00311000
*     DO;                           /* THEN DO FOLLOWING             */ 00312000
         B     @RC00169                                            0173 00313000
@RF00169 DS    0H                                                  0174 00314000
*I009C05:                                                          0174 00315000
*       GEN;                                                       0174 00316000
I009C05  DS    0H                                                  0174 00317000
*                            /*                                         00318000
               CLOSE ((DCBPTR))           CLOSE IT OUT               */ 00319000
*       IF $REMSW='1'B              /* IF THIS IS A REMOTE REQUEST   */ 00320000
*         THEN                      /* THEN DO THE FOLLOWING         */ 00321000
         TM    $REMSW(WAPTR),B'01000000'                           0175 00322000
         BNO   @RF00175                                            0175 00323000
*         DO;                                                      0176 00324000
*           DCBPTR=ADDR(WRREMCDS);  /* SET UP WRITE DCB PTR          */ 00325000
         LA    DCBPTR,WRREMCDS                                     0177 00326000
*         END;                                                     0178 00327000
*       ELSE                        /* OTHERWISE SET UP LOCAL        */ 00328000
*         DO;                                                      0179 00329000
         B     @RC00175                                            0179 00330000
@RF00175 DS    0H                                                  0180 00331000
*           DCBPTR=ADDR(WRLOCCDS);  /* CDS PTR                       */ 00332000
         LA    DCBPTR,WRLOCCDS                                     0180 00333000
*         END;                                                     0181 00334000
*       GEN;                                                       0182 00335000
@RC00175 DS    0H                                                  0182 00336000
               OPEN  ((DCBPTR),(OUTPUT)) /*OPEN IT UP AGAIN          */ 00337000
               TM    OPENFLAG(DCBPTR),GOODOPEN /*CK IF OPEN OK       */ 00338000
               BZ    I009CER1           /*ERROR-BR                   */ 00339000
*     END;                                                         0183 00340000
*   GEN(BAL LINKR,I009CWRT);        /* GO WRITE CDS RECORDS          */ 00341000
@RC00169 DS    0H                                                  0184 00342000
         BAL LINKR,I009CWRT                                             00343000
*   STOWTTR=TTRZSAV(1:3);           /* SET UP MEMBR PTR IN DIRCTY    */ 00344000
         MVC   STOWTTR(3),TTRZSAV                                  0185 00345000
*   GEN;                                                           0186 00346000
*                                       /*                              00347000
         STOW  (DCBPTR),STOWCON,R         REPLACE DIRCTY ENTRY       */ 00348000
*   IF R15=12 THEN                  /* IF RET CODE EQ 12 THEN        */ 00349000
         LA    @12,12                                              0187 00350000
         CR    R15,@12                                             0187 00351000
         BE    @RT00187                                            0187 00352000
*     GOTO I009CER2;                /* GO PRINT ERROR-NO SPACE       */ 00353000
*   IF R15>12 THEN                  /* IF RET CODE IS GREATER 12     */ 00354000
         CR    R15,@12                                             0189 00355000
         BH    @RT00189                                            0189 00356000
*     GOTO I009CER3;                /* THEN GO PRT I/O ERROR         */ 00357000
*                                                                  0190 00358000
*   /*****************************************************************/ 00359000
*   /*                                                               */ 00360000
*   /* TCEC MSGN(562) INVOKED                                        */ 00361000
*   /*                                                               */ 00362000
*   /*****************************************************************/ 00363000
*                                                                  0191 00364000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00365000
         OI    $TCECM(WAPTR),B'00000001'                           0191 00366000
*   R1=ADDR($TCA16);                /* SET UP PARM LIST $TR          */ 00367000
         LA    R1,$TCA16                                           0192 00368000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00369000
         L     @15,#EXITA(,WAPTR)                                  0193 00370000
         BALR  @14,@15                                             0193 00371000
*   DCL                                                            0194 00372000
*     1 $TCA16,                     /* TCEC PARM LIST                */ 00373000
*      2 $TCB16 FIXED(32) INIT(562),/* MSG NUMBER                    */ 00374000
*      2 $TCC16 FIXED(32) INIT(0),  /* INCT LEN                      */ 00375000
*      2 $TCD16 BIT(8) INIT('00000000'B),/* FLAG                     */ 00376000
*      2 $TCE16 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK CDS ADDED TO   00377000
*                                      LIBRARY                       */ 00378000
*   GOTO I009CRET;                  /* RETURN TO CALLER              */ 00379000
         B     I009CRET                                            0195 00380000
*   GEN(EJECT);                                                    0196 00381000
         EJECT                                                          00382000
*I009CER1:                                                         0197 00383000
*   IF $REMSW='1'B                  /* IF ITS A REMOTE REQ THEN      */ 00384000
*     THEN                                                         0197 00385000
I009CER1 TM    $REMSW(WAPTR),B'01000000'                           0197 00386000
         BNO   @RF00197                                            0197 00387000
*     DO;                                                          0198 00388000
*       $INBUFR(1:8)=CDSREMDD;      /* SET UP REM DD CARD NAME       */ 00389000
         MVC   $INBUFR(8,WAPTR),CDSREMDD                           0199 00390000
*     END;                          /* IN THE ERROR MSG              */ 00391000
*   ELSE                            /* OTHERWISE                     */ 00392000
*     DO;                           /* SET UP THE                    */ 00393000
         B     @RC00197                                            0201 00394000
@RF00197 DS    0H                                                  0202 00395000
*       $INBUFR(1:8)=CDSLOCDD;      /* LOCAL DD CARD NAME            */ 00396000
         MVC   $INBUFR(8,WAPTR),CDSLOCDD                           0202 00397000
*     END;                                                         0203 00398000
*                                                                  0203 00399000
*   /*****************************************************************/ 00400000
*   /*                                                               */ 00401000
*   /* TCEC MSGN(901)SUB(YES) INVOKED                                */ 00402000
*   /*                                                               */ 00403000
*   /*****************************************************************/ 00404000
*                                                                  0204 00405000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00406000
@RC00197 OI    $TCECM(WAPTR),B'00000001'                           0204 00407000
*   R1=ADDR($TCA17);                /* SET UP PARM LIST $TR          */ 00408000
         LA    R1,$TCA17                                           0205 00409000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00410000
         L     @15,#EXITA(,WAPTR)                                  0206 00411000
         BALR  @14,@15                                             0206 00412000
*   DCL                                                            0207 00413000
*     1 $TCA17,                     /* TCEC PARM LIST                */ 00414000
*      2 $TCB17 FIXED(32) INIT(901),/* MSG NUMBER                    */ 00415000
*      2 $TCC17 FIXED(32) INIT(0),  /* INCT LEN                      */ 00416000
*      2 $TCD17 BIT(8) INIT('10000000'B),/* FLAG                     */ 00417000
*      2 $TCE17 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK PRT XXXX DO    00418000
*                                      FAILED TO OPEN                */ 00419000
*   GOTO I009CRET;                  /* RETURN TO CALLER              */ 00420000
         B     I009CRET                                            0208 00421000
*I009CER2:                                                         0209 00422000
*                                                                  0209 00423000
*   /*****************************************************************/ 00424000
*   /*                                                               */ 00425000
*   /* TCEC MSGN(571) INVOKED                                        */ 00426000
*   /*                                                               */ 00427000
*   /*****************************************************************/ 00428000
*                                                                  0209 00429000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00430000
I009CER2 OI    $TCECM(WAPTR),B'00000001'                           0209 00431000
*   R1=ADDR($TCA18);                /* SET UP PARM LIST $TR          */ 00432000
         LA    R1,$TCA18                                           0210 00433000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00434000
         L     @15,#EXITA(,WAPTR)                                  0211 00435000
         BALR  @14,@15                                             0211 00436000
*   DCL                                                            0212 00437000
*     1 $TCA18,                     /* TCEC PARM LIST                */ 00438000
*      2 $TCB18 FIXED(32) INIT(571),/* MSG NUMBER                    */ 00439000
*      2 $TCC18 FIXED(32) INIT(0),  /* INCT LEN                      */ 00440000
*      2 $TCD18 BIT(8) INIT('00000000'B),/* FLAG                     */ 00441000
*      2 $TCE18 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK LIBRARY FULL*/ 00442000
*   GOTO I009CRET;                  /* RETURN TO CALLER              */ 00443000
         B     I009CRET                                            0213 00444000
*I009CER3:                                                         0214 00445000
*   GEN;                                                           0214 00446000
*                                                                  0214 00447000
I009CER3 DS    0H                                                  0214 00448000
               POINT (DCBPTR),TTRZSAV   /*THEN POINT TO BEGINNING    */ 00449000
*   /*****************************************************************/ 00450000
*   /*                                                               */ 00451000
*   /* TCEC MSGN(570) INVOKED                                        */ 00452000
*   /*                                                               */ 00453000
*   /*****************************************************************/ 00454000
*                                                                  0215 00455000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00456000
         OI    $TCECM(WAPTR),B'00000001'                           0215 00457000
*   R1=ADDR($TCA19);                /* SET UP PARM LIST $TR          */ 00458000
         LA    R1,$TCA19                                           0216 00459000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00460000
         L     @15,#EXITA(,WAPTR)                                  0217 00461000
         BALR  @14,@15                                             0217 00462000
*   DCL                                                            0218 00463000
*     1 $TCA19,                     /* TCEC PARM LIST                */ 00464000
*      2 $TCB19 FIXED(32) INIT(570),/* MSG NUMBER                    */ 00465000
*      2 $TCC19 FIXED(32) INIT(0),  /* INCT LEN                      */ 00466000
*      2 $TCD19 BIT(8) INIT('00000000'B),/* FLAG                     */ 00467000
*      2 $TCE19 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK I/O ERROR   */ 00468000
*   GOTO I009CRET;                  /* GO RETURN TO CALLER           */ 00469000
         B     I009CRET                                            0219 00470000
*I009CER4:                                                         0220 00471000
*                                                                  0220 00472000
*   /*****************************************************************/ 00473000
*   /*                                                               */ 00474000
*   /* TCEC MSGN(569) INVOKED                                        */ 00475000
*   /*                                                               */ 00476000
*   /*****************************************************************/ 00477000
*                                                                  0220 00478000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 00479000
I009CER4 OI    $TCECM(WAPTR),B'00000001'                           0220 00480000
*   R1=ADDR($TCA20);                /* SET UP PARM LIST $TR          */ 00481000
         LA    R1,$TCA20                                           0221 00482000
*   CALL #EXIT;                     /* CALL CECOM                    */ 00483000
         L     @15,#EXITA(,WAPTR)                                  0222 00484000
         BALR  @14,@15                                             0222 00485000
*   DCL                                                            0223 00486000
*     1 $TCA20,                     /* TCEC PARM LIST                */ 00487000
*      2 $TCB20 FIXED(32) INIT(569),/* MSG NUMBER                    */ 00488000
*      2 $TCC20 FIXED(32) INIT(0),  /* INCT LEN                      */ 00489000
*      2 $TCD20 BIT(8) INIT('00000000'B),/* FLAG                     */ 00490000
*      2 $TCE20 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK UNABLE TO 0223 00491000
*                                      DELETE CDS                    */ 00492000
*   GOTO I009CRET;                  /* RETURN TO CONTROL MODULE      */ 00493000
         B     I009CRET                                            0224 00494000
*   GEN(EJECT);                                                    0225 00495000
         EJECT                                                          00496000
*I009CRET:                                                         0226 00497000
*   GEN;                                                           0226 00498000
I009CRET DS    0H                                                  0226 00499000
*                                       /*                              00500000
         CLOSE ((DCBPTR))                 CLOSE CDS                 */  00501000
*   $REMSW='0'B;                    /* RESET REMOTE SW               */ 00502000
         NI    $REMSW(WAPTR),B'10111111'                           0227 00503000
*   $CHANGE='0'B;                   /* RESET CHANGE SW               */ 00504000
         NI    $CHANGE(WAPTR),B'11011111'                          0228 00505000
*   $COPY='0'B;                     /* RESET COPY SW                 */ 00506000
         NI    $COPY(WAPTR),B'11110111'                            0229 00507000
*   RETURN;                         /* RETURN TO CALLER              */ 00508000
@EL00001 L     @13,4(,@13)                                         0230 00509000
@EF00001 DS    0H                                                  0230 00510000
@ER00001 L     @14,12(,@13)                                        0230 00511000
         LM    @00,@12,20(@13)                                     0230 00512000
         BR    @14                                                 0230 00513000
*   GEN(EJECT);                                                    0231 00514000
*                                                                  0231 00515000
         EJECT                                                          00516000
*/********************************************************************/ 00517000
*/*                     R E A D   R O U T I N E                      */ 00518000
*/*                                                                  */ 00519000
*/*  THIS ROUTINE WILL READ THE ESD & TXTHDR RECORD INTO CORR AND    */ 00520000
*/*  SAVE THEIR STARTING ADDRESS                                     */ 00521000
*/*                                                                  */ 00522000
*/********************************************************************/ 00523000
*                                                                  0232 00524000
*I009CRD:                                                          0232 00525000
*   RETSAV=LINKR;                   /* SAVE RETURN PTR               */ 00526000
I009CRD  ST    LINKR,RETSAV                                        0232 00527000
*   IF $REMSW='1'B THEN             /* IF THIS IS A REMOTE REQ       */ 00528000
         TM    $REMSW(WAPTR),B'01000000'                           0233 00529000
         BO    @RT00233                                            0233 00530000
*     GOTO I009CRD1;                /* THEN BR AROUND                */ 00531000
*   GEN;                                                           0235 00532000
*                                       /*                              00533000
          OPEN ((DCBPTR),(UPDAT))         OPEN LOCAL DCB                00534000
          TM   OPENFLAG(DCBPTR),GOODOPEN  DID IT OPEN                   00535000
          BZ   I009CER1                   NO-ERROR                      00536000
          B    I009CRD3                   BR-AROUND                     00537000
*I009CRD1:                                                         0236 00538000
*   GEN;                                                           0236 00539000
I009CRD1 DS    0H                                                  0236 00540000
*                                       /*                              00541000
          OPEN ((DCBPTR),(UPDAT))         OPEN REMOTE DCB               00542000
          TM   OPENFLAG(DCBPTR),GOODOPEN  DID IT OPEN                   00543000
         BZ    I009CER1                   NO-ERROR                      00544000
I009CRD3 DS   0H                                                        00545000
          FIND (DCBPTR),(NAMEPTR),D       LOOK FOR REQUESTED MEMBER     00546000
          LTR  R15,R15                    WAS FIND SUCCESSFUL           00547000
          BNZ  I009C01B                   NO-BR                         00548000
          READ CDSDECB,SF,(DCBPTR),ESDREC,80,MF=E READ ESD RECORD       00549000
          CHECK  CDSDECB                  WAIT FOR I/O COMPLETION       00550000
          NOTE (DCBPTR)                   GET PTR TO ESD REC            00551000
          ST   PARMREG1,TTRZSAV           SAVE START ADR OF ESD         00552000
          ST   PARMREG1,TTRZ              SAVE START ADR TO TXTHDR      00553000
          MVI  TTRZ+3,X'01'               SET UP TO READ NXT REACORD    00554000
          POINT (DCBPTR),TTRZ             SET UP TO RD NXT REC          00555000
          READ CDSDECB,SF,(DCBPTR),TXTHDR,80,MF=E READ TXTHDR RECORD    00556000
          CHECK  CDSDECB                  WAIT FOR I/O COMPLETION       00557000
          NOTE (DCBPTR)                   SET UP PTR TO NXT RECORD      00558000
          ST   PARMREG1,TTRZ              SAVE START ADR TO CDSREC      00559000
          MVI  TTRZ+3,X'01'               SET UP READ NXT RECORD        00560000
          POINT (DCBPTR),TTRZ             SET UP READ DCB               00561000
*   CDSRPTR=ADDR(CDSUA);            /* GET PTR TO READ BUFFER        */ 00562000
         L     CDSRPTR,CDSWKPTR                                    0237 00563000
*   GEN;                                                           0238 00564000
*                                       /*                              00565000
          SR   CDSRLREG,CDSRLREG          ZERO WK REG                   00566000
          IC   CDSRLREG,TXTHCNT+2         GET LEN OF CDSREC             00567000
          READ CDSDECB,SF,(DCBPTR),(CDSRPTR),(CDSRLREG),MF=E            00568000
          CHECK  CDSDECB                  WAIT FOR I/O COMPLETION       00569000
*I009CRD4:                                                         0239 00570000
*   GEN;                                                           0239 00571000
I009CRD4 DS    0H                                                  0239 00572000
*                                            /*                         00573000
          L    LINKR,RETSAV               GET RETURN ADDR               00574000
          BR   LINKR                      RETURN TO CALLER              00575000
          EJECT                                                         00576000
*                                                                  0240 00577000
*/********************************************************************/ 00578000
*/*                      W R I T E  R O U T I N E                    */ 00579000
*/*                                                                  */ 00580000
*/*  THIS ROUTINE WILL WRITE THE ESD RECORD, TXTHDR RECORD, CDS      */ 00581000
*/*  RECORD AND THE END RECORD                                       */ 00582000
*/*                                                                  */ 00583000
*/********************************************************************/ 00584000
*                                                                  0240 00585000
*I009CWRT:                                                         0240 00586000
*   RETSAV=LINKR;                   /* SAVE RETURN ADDR PTR          */ 00587000
I009CWRT ST    LINKR,RETSAV                                        0240 00588000
*   ESDSIZE=CDSBYTCT;               /* PUT CDS BYTE COUNT IN ESD     */ 00589000
         L     @15,CDSWKPTR                                        0241 00590000
         SLR   @12,@12                                             0241 00591000
         IC    @12,CDSBYTCT(,@15)                                  0241 00592000
         STC   @12,ESDSIZE                                         0241 00593000
*   TXTHCNT(3:3)=CDSBYTCT;          /* PUT CDS BYTE CNT IN TXTHDR    */ 00594000
         STC   @12,TXTHCNT+2                                       0242 00595000
*   TXTHNAME=TXTHDRNM;              /* INDICATE TOLTEP CHANGED CDS   */ 00596000
         MVC   TXTHNAME(9),TXTHDRNM                                0243 00597000
*I009CWR1:                                                         0244 00598000
*   GEN;                                                           0244 00599000
I009CWR1 DS    0H                                                  0244 00600000
*                                       /*                              00601000
         WRITE CDSDECB,SF,(DCBPTR),ESDREC,80,MF=E  WRITE ESD RECORD     00602000
         CHECK CDSDECB                    WAIT FOR I/O COMPLETION       00603000
         NOTE  (DCBPTR)                   SAVE BEGINNING ADDRESS IN     00604000
         ST    PARMREG1,TTRZSAV           CASE OF AN ERROR              00605000
         WRITE CDSDECB,SF,(DCBPTR),TXTHDR,80,MF=E  WRITE TXTHDR RECORD  00606000
         CHECK CDSDECB                    WAIT FOR I/O COMPLETION       00607000
*   CDSRPTR=ADDR(CDSUA);            /* GET PTR TO CDS RECORD         */ 00608000
         L     CDSRPTR,CDSWKPTR                                    0245 00609000
*I009CWR2:                                                         0246 00610000
*   GEN(XC CDSRECL,CDSRECL);        /* ZERO OUT REC LENGTH AREA      */ 00611000
I009CWR2 XC CDSRECL,CDSRECL                                             00612000
*   CDSRECL(2:2)=CDSBYTCT;          /* SET UP CDSREC LEN FOR WRITE   */ 00613000
         L     @15,CDSWKPTR                                        0247 00614000
         MVC   CDSRECL+1(1),CDSBYTCT(@15)                          0247 00615000
*   GEN;                                                           0248 00616000
*                                       /*                              00617000
         SR  CDSRLREG,CDSRLREG            ZERO OUT WORK REG             00618000
         LH  CDSRLREG,CDSRECL             PUT CDS REC LN IN REG         00619000
         WRITE CDSDECB,SF,(DCBPTR),(CDSRPTR),(CDSRLREG),MF=E WRT CDSREC 00620000
         CHECK CDSDECB                    WAIT FOR I/O COMPLETION       00621000
*   IF $CHANGE='1'B                 /* IF ITS A CHANGE REQUEST       */ 00622000
*     THEN                          /* THEN CHECK TO SEE IF ITS      */ 00623000
         TM    $CHANGE(WAPTR),B'00100000'                          0249 00624000
         BNO   @RF00249                                            0249 00625000
*     DO;                           /* A CHANGE IN PLACE             */ 00626000
*       IF CDSBYTCT^>OLDCDSLN THEN  /* IF YES THEN BR AROUND         */ 00627000
         L     @15,CDSWKPTR                                        0251 00628000
         CLC   CDSBYTCT(1,@15),OLDCDSLN                            0251 00629000
         BNH   @RT00251                                            0251 00630000
*         GOTO I009CRET;            /* NEXT WRITE                    */ 00631000
*     END;                                                         0253 00632000
*   GEN;                                                           0254 00633000
@RF00249 DS    0H                                                  0254 00634000
         WRITE CDSDECB,SF,(DCBPTR),ENDREC,80,MF=E  WRITE END RECORD     00635000
         CHECK CDSDECB                    WAIT FOR I/O COMPLETION       00636000
         L     LINKR,RETSAV               RETURN TO                     00637000
         BR    LINKR                        CALLER                      00638000
         EJECT                                                          00639000
*                                                                  0255 00640000
*/********************************************************************/ 00641000
*/*        D A T A  C O N T R O L  B L O C K S                       */ 00642000
*/********************************************************************/ 00643000
*                                                                  0255 00644000
*   GEN;                                                           0255 00645000
RDREMCDS   DS    0F                                                     00646000
         DCB   DDNAME=SYMSYM,DSORG=PO,RECFM=UT,MACRF=(R,W),            X00647000
               LRECL=80,BLKSIZE=3600,SYNAD=I009CER3,EODAD=I009CRD4      00648000
          SPACE                                                         00649000
RDLOCCDS   DS    0F                                                     00650000
         DCB   DDNAME=OLTCDSDD,DSORG=PO,RECFM=UT,MACRF=(R,W),          X00651000
               LRECL=80,BLKSIZE=3600,SYNAD=I009CER3,EODAD=I009CRD4      00652000
          SPACE                                                         00653000
WRREMCDS   DS    0F                                                     00654000
         DCB   DDNAME=SYMSYM,DSORG=PO,RECFM=UT,MACRF=(R,W),            X00655000
               LRECL=80,BLKSIZE=3600,SYNAD=I009CER3                     00656000
          SPACE                                                         00657000
WRLOCCDS DS    0F                                                       00658000
         DCB   DDNAME=OLTCDSDD,DSORG=PO,RECFM=UT,MACRF=(R,W),          X00659000
               LRECL=80,BLKSIZE=3600,SYNAD=I009CER3                     00660000
          SPACE                                                         00661000
         WRITE CDSDECB,SF,MF=L                                          00662000
          SPACE                                                         00663000
*   DO;                             /* ATDSPLY                       */ 00664000
*   END;                            /* ATDSPLY                       */ 00665000
*   END ISTIC009;                                                  0258 00666000
         B     @EL00001                                            0258 00667000
@DATA    DS    0H                                                       00668000
@CH00081 DC    H'12'                                                    00669000
@CH00075 DC    H'80'                                                    00670000
         DS    0F                                                       00671000
@SA00001 DS    18F                                                      00672000
         DS    0F                                                       00673000
@CV00772 DC    V(ISTSC029)                                              00674000
@CV00794 DC    V(ISTSC021)                                              00675000
@CV00796 DC    V(ISTIC00A)                                              00676000
@CV00799 DC    V(S20CEC03)                                              00677000
         DS    0D                                                       00678000
CDSWKPTR DS    A                                                        00679000
RCAPTR   DS    A                                                        00680000
CECMAP   DS    A                                                        00681000
TTRZ     DS    F                                                        00682000
RETSAV   DS    CL4                                                      00683000
WKAREA2  DS    CL20                                                     00684000
CDSRECL  DS    CL2                                                      00685000
         DS    CL2                                                      00686000
TTRZSAV  DS    CL4                                                      00687000
OLDCDSLN DS    CL1                                                      00688000
BLANK    DC    CL1' '                                                   00689000
TXTHDRNM DC    CL9'VS TOLTEP'                                           00690000
CDSLOCDD DC    CL8'OLTCDSDD'                                            00691000
CDSREMDD DC    CL8'SYMSYM  '                                            00692000
UANAME   DC    CL1'G'                                                   00693000
STOWCON  DS    CL32                                                     00694000
         ORG   STOWCON                                                  00695000
STOWNAME DS    CL8                                                      00696000
STOWTTR  DS    CL3                                                      00697000
STOWUSSZ DC    X'0A'                                                    00698000
STOWUSRI DC    20X'00'                                                  00699000
         ORG   STOWCON+32                                               00700000
ESDREC   DS    CL80                                                     00701000
         ORG   ESDREC                                                   00702000
@NM00001 DC    X'02'                                                    00703000
@NM00002 DC    CL3'ESD'                                                 00704000
@NM00003 DC    X'00'                                                    00705000
         DC    XL11'0'                                                  00706000
ESDNME1  DS    CL8                                                      00707000
@NM00004 DC    X'00'                                                    00708000
         DC    XL6'0'                                                   00709000
ESDSIZE  DS    CL1                                                      00710000
ESDNME2  DC    CL8'#OLT00'                                              00711000
@NM00005 DC    X'00'                                                    00712000
         DC    XL7'0'                                                   00713000
ESDNME3  DC    CL8'#CTLCAAA'                                            00714000
@NM00006 DC    X'00'                                                    00715000
         DC    XL23'0'                                                  00716000
         ORG   ESDREC+80                                                00717000
TXTHDR   DS    CL80                                                     00718000
         ORG   TXTHDR                                                   00719000
@NM00007 DC    X'02'                                                    00720000
@NM00008 DC    CL6'TXTHDR'                                              00721000
TXTHNAME DC    CL9'VS TOLTEP'                                           00722000
TXTHCCW  DS    CL8                                                      00723000
         ORG   TXTHCCW                                                  00724000
@NM00009 DC    X'02'                                                    00725000
THRELADR DC    X'000000'                                                00726000
@NM00010 DC    X'20'                                                    00727000
TXTHCNT  DC    X'000000'                                                00728000
         ORG   TXTHDR+24                                                00729000
@NM00011 DC    X'00'                                                    00730000
         DC    XL55'0'                                                  00731000
         ORG   TXTHDR+80                                                00732000
ENDREC   DS    CL80                                                     00733000
         ORG   ENDREC                                                   00734000
@NM00012 DC    X'02'                                                    00735000
@NM00013 DC    CL3'END'                                                 00736000
@NM00014 DC    CL72' '                                                  00737000
@NM00015 DC    CL4'0003'                                                00738000
         ORG   ENDREC+80                                                00739000
ZZZGTPRM DS    CL13                                                     00740000
         ORG   ZZZGTPRM                                                 00741000
@NM00068 DC    X'0102F1F6'                                              00742000
ZZZGTCD  DS    AL4                                                      00743000
ZZZGTAD  DS    AL4                                                      00744000
ZZZGTCT  DS    FL1                                                      00745000
         ORG   ZZZGTPRM+13                                              00746000
         DS    CL3                                                      00747000
$TCA10   DS    CL13                                                     00748000
         ORG   $TCA10                                                   00749000
$TCB10   DC    A(572)                                                   00750000
$TCC10   DC    A(0)                                                     00751000
$TCD10   DC    B'00000000'                                              00752000
$TCE10   DC    X'FFFFFFFF'                                              00753000
         ORG   $TCA10+13                                                00754000
         DS    CL3                                                      00755000
ITATCPRM DS    CL14                                                     00756000
         ORG   ITATCPRM                                                 00757000
@NM00069 DC    X'0102F4F1'                                              00758000
ITATCFR  DS    AL4                                                      00759000
ITATCTO  DS    AL4                                                      00760000
@NM00070 DC    AL1(0)                                                   00761000
         ORG   @NM00070                                                 00762000
ITATCTP  DS    BL1                                                      00763000
         ORG   ITATCPRM+13                                              00764000
ITATCNT  DS    FL1                                                      00765000
         ORG   ITATCPRM+14                                              00766000
         DS    CL2                                                      00767000
$TCA13   DS    CL13                                                     00768000
         ORG   $TCA13                                                   00769000
$TCB13   DC    A(576)                                                   00770000
$TCC13   DC    A(0)                                                     00771000
$TCD13   DC    B'00000000'                                              00772000
$TCE13   DC    X'40000000'                                              00773000
         ORG   $TCA13+13                                                00774000
         DS    CL3                                                      00775000
$TCA15   DS    CL13                                                     00776000
         ORG   $TCA15                                                   00777000
$TCB15   DC    A(581)                                                   00778000
$TCC15   DC    A(0)                                                     00779000
$TCD15   DC    B'00000000'                                              00780000
$TCE15   DC    X'00400000'                                              00781000
         ORG   $TCA15+13                                                00782000
         DS    CL3                                                      00783000
$TCA16   DS    CL13                                                     00784000
         ORG   $TCA16                                                   00785000
$TCB16   DC    A(562)                                                   00786000
$TCC16   DC    A(0)                                                     00787000
$TCD16   DC    B'00000000'                                              00788000
$TCE16   DC    X'FFFFFFFF'                                              00789000
         ORG   $TCA16+13                                                00790000
         DS    CL3                                                      00791000
$TCA17   DS    CL13                                                     00792000
         ORG   $TCA17                                                   00793000
$TCB17   DC    A(901)                                                   00794000
$TCC17   DC    A(0)                                                     00795000
$TCD17   DC    B'10000000'                                              00796000
$TCE17   DC    X'FFFFFFFF'                                              00797000
         ORG   $TCA17+13                                                00798000
         DS    CL3                                                      00799000
$TCA18   DS    CL13                                                     00800000
         ORG   $TCA18                                                   00801000
$TCB18   DC    A(571)                                                   00802000
$TCC18   DC    A(0)                                                     00803000
$TCD18   DC    B'00000000'                                              00804000
$TCE18   DC    X'FFFFFFFF'                                              00805000
         ORG   $TCA18+13                                                00806000
         DS    CL3                                                      00807000
$TCA19   DS    CL13                                                     00808000
         ORG   $TCA19                                                   00809000
$TCB19   DC    A(570)                                                   00810000
$TCC19   DC    A(0)                                                     00811000
$TCD19   DC    B'00000000'                                              00812000
$TCE19   DC    X'FFFFFFFF'                                              00813000
         ORG   $TCA19+13                                                00814000
         DS    CL3                                                      00815000
$TCA20   DS    CL13                                                     00816000
         ORG   $TCA20                                                   00817000
$TCB20   DC    A(569)                                                   00818000
$TCC20   DC    A(0)                                                     00819000
$TCD20   DC    B'00000000'                                              00820000
$TCE20   DC    X'FFFFFFFF'                                              00821000
         ORG   $TCA20+13                                                00822000
NAME     DS    CL8                                                      00823000
WKAREA   DS    CL8                                                      00824000
         DS    CL3                                                      00825000
PATCH    DC    40F'0'                                                   00826000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00827000
@01      EQU   01                                                       00828000
@02      EQU   02                                                       00829000
@03      EQU   03                                                       00830000
@04      EQU   04                                                       00831000
@05      EQU   05                                                       00832000
@06      EQU   06                                                       00833000
@07      EQU   07                                                       00834000
@08      EQU   08                                                       00835000
@09      EQU   09                                                       00836000
@10      EQU   10                                                       00837000
@11      EQU   11                                                       00838000
@12      EQU   12                                                       00839000
@13      EQU   13                                                       00840000
@14      EQU   14                                                       00841000
@15      EQU   15                                                       00842000
LINKR    EQU   @14                                                      00843000
DCBPTR   EQU   @05                                                      00844000
CDSRPTR  EQU   @04                                                      00845000
WKREG1   EQU   @04                                                      00846000
CDSRLREG EQU   @06                                                      00847000
NAMEPTR  EQU   @06                                                      00848000
WAPTR    EQU   @02                                                      00849000
R1       EQU   @01                                                      00850000
R15      EQU   @15                                                      00851000
PARMREG1 EQU   @01                                                      00852000
R0       EQU   @00                                                      00853000
R10      EQU   @10                                                      00854000
R11      EQU   @11                                                      00855000
R12      EQU   @12                                                      00856000
R13      EQU   @13                                                      00857000
R14      EQU   @14                                                      00858000
R2       EQU   @02                                                      00859000
R3       EQU   @03                                                      00860000
R4       EQU   @04                                                      00861000
R5       EQU   @05                                                      00862000
R6       EQU   @06                                                      00863000
R7       EQU   @07                                                      00864000
R8       EQU   @08                                                      00865000
R9       EQU   @09                                                      00866000
$RCAAREA EQU   0                                                        00867000
$POINTER EQU   $RCAAREA+100                                             00868000
$TRTBLA  EQU   $POINTER+124                                             00869000
$CONSTNT EQU   $RCAAREA+244                                             00870000
$RCAFLG  EQU   $RCAAREA+604                                             00871000
TOLTEPWA EQU   0                                                        00872000
$SCTTBLE EQU   TOLTEPWA                                                 00873000
$TESTOPT EQU   $SCTTBLE+2                                               00874000
$ERROPT  EQU   $SCTTBLE+3                                               00875000
$PDEVFLG EQU   $SCTTBLE+10                                              00876000
$CDSFLGS EQU   $SCTTBLE+11                                              00877000
$CDS8T19 EQU   $SCTTBLE+20                                              00878000
$EXECFLG EQU   $SCTTBLE+33                                              00879000
$OLTFLGS EQU   $SCTTBLE+36                                              00880000
$OLTFLG2 EQU   $SCTTBLE+37                                              00881000
$TOTFLG1 EQU   $SCTTBLE+38                                              00882000
$ROUTMSK EQU   $SCTTBLE+40                                              00883000
$CDA     EQU   TOLTEPWA+100                                             00884000
$RCA     EQU   $CDA+44                                                  00885000
$OLTPTR  EQU   $CDA+52                                                  00886000
$LOWADDR EQU   $OLTPTR                                                  00887000
$HIMOREC EQU   $CDA+60                                                  00888000
$COMMFLG EQU   TOLTEPWA+224                                             00889000
$FLAG1   EQU   $COMMFLG                                                 00890000
$FLAG2   EQU   $COMMFLG+1                                               00891000
$FLAG3   EQU   $COMMFLG+2                                               00892000
$FLAG4   EQU   $COMMFLG+3                                               00893000
$FLAG5   EQU   $COMMFLG+4                                               00894000
$EOJ     EQU   $FLAG5                                                   00895000
$CANCEL  EQU   $EOJ                                                     00896000
$FLAG6   EQU   $COMMFLG+5                                               00897000
$CHANGE  EQU   $FLAG6                                                   00898000
$ABNDBIT EQU   $FLAG6                                                   00899000
$FLAG7   EQU   $COMMFLG+6                                               00900000
$FLAG8   EQU   $COMMFLG+7                                               00901000
$TCECM   EQU   $FLAG8                                                   00902000
$FLAG9   EQU   $COMMFLG+8                                               00903000
$REMSW   EQU   $FLAG9                                                   00904000
$COPY    EQU   $FLAG9                                                   00905000
$FLAG10  EQU   $COMMFLG+9                                               00906000
$FLAG11  EQU   $COMMFLG+10                                              00907000
$FLAG12  EQU   $COMMFLG+11                                              00908000
$FLAG13  EQU   $COMMFLG+12                                              00909000
$DEVTBLE EQU   TOLTEPWA+240                                             00910000
$DEVCDS  EQU   $DEVTBLE                                                 00911000
$DEVUNAD EQU   $DEVCDS                                                  00912000
@NM00054 EQU   $DEVUNAD+2                                               00913000
$DEVFEAT EQU   $DEVCDS+4                                                00914000
$DEVCDSF EQU   $DEVCDS+9                                                00915000
$DEVSDCF EQU   $DEVCDS+10                                               00916000
$$SYMNME EQU   $DEVCDS+12                                               00917000
$DEVFLG1 EQU   $DEVTBLE+20                                              00918000
$EVNCPLT EQU   $DEVFLG1                                                 00919000
$ATTNEXP EQU   $DEVFLG1                                                 00920000
$INTOCC  EQU   $DEVFLG1                                                 00921000
$DEVFLG2 EQU   $DEVTBLE+21                                              00922000
$DEVTECB EQU   $DEVTBLE+22                                              00923000
$OPIS    EQU   $DEVTECB                                                 00924000
$OPND    EQU   $DEVTECB+2                                               00925000
$DEVFLG3 EQU   $DEVTBLE+27                                              00926000
$SIOFLG  EQU   $DEVFLG3                                                 00927000
$IFTOUT  EQU   $DEVTBLE+36                                              00928000
$DEVSESP EQU   $IFTOUT                                                  00929000
$SSCPDAF EQU   $IFTOUT+6                                                00930000
$LDNCBPT EQU   $DEVTBLE+48                                              00931000
$RNINFO  EQU   $DEVTBLE+56                                              00932000
$DEVFLG5 EQU   $RNINFO+8                                                00933000
$DEVFLG4 EQU   $DEVTBLE+65                                              00934000
$SLTBL   EQU   TOLTEPWA+1468                                            00935000
$RUNTEST EQU   $SLTBL+13                                                00936000
$TESTFLG EQU   $SLTBL+21                                                00937000
$SECLST  EQU   $SLTBL+22                                                00938000
$INBUFR  EQU   TOLTEPWA+2104                                            00939000
#EXITA   EQU   TOLTEPWA+2632                                            00940000
$CCOMDAT EQU   TOLTEPWA+2644                                            00941000
$CFLGS   EQU   $CCOMDAT+16                                              00942000
$24FEMSG EQU   TOLTEPWA+2681                                            00943000
$24CATMG EQU   $24FEMSG+11                                              00944000
@NM00063 EQU   TOLTEPWA+2776                                            00945000
$OUNTPTR EQU   @NM00063+4                                               00946000
$NSPTR   EQU   $OUNTPTR                                                 00947000
$NSCNT   EQU   @NM00063+10                                              00948000
$ENXX    EQU   @NM00063+15                                              00949000
$IMITX   EQU   $ENXX                                                    00950000
SVESC033 EQU   TOLTEPWA+3160                                            00951000
SVECC013 EQU   TOLTEPWA+3232                                            00952000
SVEIC003 EQU   TOLTEPWA+3592                                            00953000
SVESC022 EQU   TOLTEPWA+3736                                            00954000
SVECC011 EQU   TOLTEPWA+4024                                            00955000
#EXIT    EQU   0                                                        00956000
CECOMMAP EQU   0                                                        00957000
CDSMAP   EQU   0                                                        00958000
CDSUA    EQU   CDSMAP                                                   00959000
CDSMFCT  EQU   CDSMAP+4                                                 00960000
CDSFEAT  EQU   CDSMFCT+1                                                00961000
CDSBYTCT EQU   CDSMAP+8                                                 00962000
CDSFLAG  EQU   CDSMAP+9                                                 00963000
CDSSYMB  EQU   CDSFLAG                                                  00964000
CDSREMSY EQU   CDSFLAG                                                  00965000
CDSSYMBN EQU   CDSMAP+12                                                00966000
$TRTBL   EQU   0                                                        00967000
SVECC012 EQU   SVESC022                                                 00968000
SVEIC00A EQU   SVEIC003                                                 00969000
SVEIC004 EQU   SVEIC003                                                 00970000
SVEIC005 EQU   SVEIC003                                                 00971000
SVESC02A EQU   SVESC022                                                 00972000
SVESC02B EQU   SVESC022                                                 00973000
SVESC02D EQU   SVESC022                                                 00974000
SVESC02E EQU   SVESC022                                                 00975000
SVESC02F EQU   SVECC013                                                 00976000
SVESC024 EQU   SVESC022                                                 00977000
SVESC027 EQU   SVESC022                                                 00978000
SVESC029 EQU   SVESC033                                                 00979000
SVESC031 EQU   SVECC013                                                 00980000
SVESC032 EQU   SVECC011                                                 00981000
SVETC037 EQU   SVEIC003                                                 00982000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00983000
CDSEXARA EQU   CDSMAP+20                                                00984000
CDSEXTM  EQU   CDSFLAG+2                                                00985000
CDSEXTB  EQU   CDSFLAG+2                                                00986000
CDSTMERB EQU   CDSFLAG+2                                                00987000
@NM00067 EQU   CDSFLAG+1                                                00988000
CDSDVPRO EQU   CDSFLAG+1                                                00989000
CDSNTPRI EQU   CDSFLAG+1                                                00990000
CDSLINCN EQU   CDSFLAG                                                  00991000
CDS2CHAN EQU   CDSFLAG                                                  00992000
CDSEXTPR EQU   CDSFLAG                                                  00993000
CDSFEVOL EQU   CDSFLAG                                                  00994000
CDSSHAR  EQU   CDSFLAG                                                  00995000
CDSFPMD  EQU   CDSFLAG                                                  00996000
CDSTYPE  EQU   CDSMFCT+3                                                00997000
CDSCLASS EQU   CDSMFCT+2                                                00998000
@NM00066 EQU   CDSFEAT                                                  00999000
CDSDEVM  EQU   CDSFEAT                                                  01000000
CDSDEVT  EQU   CDSFEAT                                                  01001000
CDSASCII EQU   CDSFEAT                                                  01002000
CDSMODEL EQU   CDSMFCT                                                  01003000
$CECFLAG EQU   CECOMMAP+20                                              01004000
$CEINCT  EQU   CECOMMAP+16                                              01005000
$CEINADR EQU   CECOMMAP+12                                              01006000
$CEOUTCT EQU   CECOMMAP+8                                               01007000
$CEOUTAD EQU   CECOMMAP+4                                               01008000
$CECIDNT EQU   CECOMMAP+2                                               01009000
$CECLEVL EQU   CECOMMAP+1                                               01010000
$CECTRMG EQU   CECOMMAP                                                 01011000
SVECC010 EQU   TOLTEPWA+3952                                            01012000
SVETC035 EQU   TOLTEPWA+3880                                            01013000
SVESC030 EQU   TOLTEPWA+3808                                            01014000
SVESC020 EQU   TOLTEPWA+3664                                            01015000
SVEIC002 EQU   TOLTEPWA+3520                                            01016000
SVECC014 EQU   TOLTEPWA+3376                                            01017000
SVESC120 EQU   TOLTEPWA+3304                                            01018000
SVESC025 EQU   TOLTEPWA+3088                                            01019000
@NM00065 EQU   TOLTEPWA+2980                                            01020000
$RPLERR  EQU   TOLTEPWA+2977                                            01021000
@NM00064 EQU   TOLTEPWA+2976                                            01022000
$R13PR3  EQU   TOLTEPWA+2972                                            01023000
$CEINT2  EQU   TOLTEPWA+2968                                            01024000
$CEINT1  EQU   TOLTEPWA+2964                                            01025000
$MSGGET  EQU   TOLTEPWA+2960                                            01026000
$ACQLIST EQU   TOLTEPWA+2956                                            01027000
$R4SAVE1 EQU   TOLTEPWA+2952                                            01028000
$CLSISS  EQU   TOLTEPWA+2950                                            01029000
$CLSCNT  EQU   TOLTEPWA+2948                                            01030000
$CUTABLE EQU   TOLTEPWA+2868                                            01031000
$BUFSZ2  EQU   TOLTEPWA+2864                                            01032000
$RESID2  EQU   TOLTEPWA+2860                                            01033000
$OLTCCW2 EQU   TOLTEPWA+2856                                            01034000
$ENDBFR2 EQU   TOLTEPWA+2852                                            01035000
$1STBFR2 EQU   TOLTEPWA+2848                                            01036000
$TECB2   EQU   TOLTEPWA+2844                                            01037000
$BUFSZ1  EQU   TOLTEPWA+2840                                            01038000
$RESID1  EQU   TOLTEPWA+2836                                            01039000
$OLTCCW1 EQU   TOLTEPWA+2832                                            01040000
$ENDBFR1 EQU   TOLTEPWA+2828                                            01041000
$1STBFR1 EQU   TOLTEPWA+2824                                            01042000
$TECB1   EQU   TOLTEPWA+2820                                            01043000
$WAITIME EQU   TOLTEPWA+2816                                            01044000
$TRTN#   EQU   TOLTEPWA+2815                                            01045000
$WIODEV  EQU   TOLTEPWA+2814                                            01046000
$RQSTSZE EQU   TOLTEPWA+2812                                            01047000
$RQSTPTR EQU   TOLTEPWA+2808                                            01048000
$R4SAVE  EQU   TOLTEPWA+2804                                            01049000
$PARTADR EQU   TOLTEPWA+2800                                            01050000
$TBSDATA EQU   TOLTEPWA+2796                                            01051000
$CTWIDTH EQU   TOLTEPWA+2795                                            01052000
$CTLINE  EQU   TOLTEPWA+2794                                            01053000
$APWIDTH EQU   TOLTEPWA+2793                                            01054000
$APLINE  EQU   TOLTEPWA+2792                                            01055000
$INDEX   EQU   $IMITX                                                   01056000
$UMXX    EQU   @NM00063+14                                              01057000
$NSXX    EQU   @NM00063+12                                              01058000
$ATACNT  EQU   $NSCNT                                                   01059000
$CTR     EQU   @NM00063+8                                               01060000
$ATAPTR  EQU   $NSPTR                                                   01061000
$DDRPTR  EQU   @NM00063                                                 01062000
$DTORESP EQU   TOLTEPWA+2712                                            01063000
$APNAME  EQU   TOLTEPWA+2704                                            01064000
$24SYMNE EQU   $24CATMG+4                                               01065000
$24DEVAD EQU   $24CATMG                                                 01066000
$24RTN#  EQU   $24FEMSG+8                                               01067000
$ESECTID EQU   $24FEMSG                                                 01068000
$24FLGS  EQU   TOLTEPWA+2680                                            01069000
$24SAVE2 EQU   TOLTEPWA+2676                                            01070000
$24SAVE1 EQU   TOLTEPWA+2672                                            01071000
$24UNADR EQU   TOLTEPWA+2668                                            01072000
$24SAV13 EQU   TOLTEPWA+2664                                            01073000
$24RETCD EQU   TOLTEPWA+2663                                            01074000
$MACID   EQU   TOLTEPWA+2661                                            01075000
$CSPARE  EQU   $CFLGS                                                   01076000
$C2WAY   EQU   $CFLGS                                                   01077000
$CINCT   EQU   $CCOMDAT+12                                              01078000
$CINADR  EQU   $CCOMDAT+8                                               01079000
$COUTCT  EQU   $CCOMDAT+4                                               01080000
$COUTAD  EQU   $CCOMDAT                                                 01081000
ROOTLOC  EQU   TOLTEPWA+2640                                            01082000
$RETREG  EQU   TOLTEPWA+2636                                            01083000
$WORK    EQU   TOLTEPWA+2376                                            01084000
$EXTA    EQU   TOLTEPWA+2320                                            01085000
$PASSONA EQU   TOLTEPWA+2264                                            01086000
$TRMINPT EQU   TOLTEPWA+2184                                            01087000
$BUFFER  EQU   TOLTEPWA+1976                                            01088000
$TLTRPL3 EQU   TOLTEPWA+1856                                            01089000
$TLTRPL2 EQU   TOLTEPWA+1736                                            01090000
$TLTRPL1 EQU   TOLTEPWA+1616                                            01091000
@NM00062 EQU   $SLTBL+135                                               01092000
$HIGHRTN EQU   $SLTBL+134                                               01093000
$PRIMADR EQU   $SLTBL+130                                               01094000
$CTSTPT  EQU   $SLTBL+128                                               01095000
$TSTCNT  EQU   $SLTBL+126                                               01096000
$SECFLGS EQU   $SECLST+3                                                01097000
$SECTION EQU   $SECLST                                                  01098000
$SECACT  EQU   $TESTFLG                                                 01099000
$CANTRUN EQU   $TESTFLG                                                 01100000
$FINAL   EQU   $TESTFLG                                                 01101000
$TESTSUF EQU   $RUNTEST+5                                               01102000
$TESTNUM EQU   $RUNTEST+1                                               01103000
$LETPRF  EQU   $RUNTEST                                                 01104000
$SYMBOLC EQU   $SLTBL+5                                                 01105000
$FAMILY  EQU   $SLTBL                                                   01106000
$CDEVPT  EQU   TOLTEPWA+1466                                            01107000
$DEVCNTS EQU   TOLTEPWA+1464                                            01108000
$FEEDBCK EQU   $DEVTBLE+66                                              01109000
$WTISUED EQU   $DEVFLG4                                                 01110000
$EXIOISD EQU   $DEVFLG4                                                 01111000
$REMWRIT EQU   $DEVFLG4                                                 01112000
$REMDONE EQU   $DEVFLG4                                                 01113000
$2NDUSED EQU   $DEVFLG4                                                 01114000
$1STUSED EQU   $DEVFLG4                                                 01115000
$IGLXIFB EQU   $DEVFLG4                                                 01116000
$EXIOLV3 EQU   $DEVFLG4                                                 01117000
@NM00061 EQU   $DEVFLG5                                                 01118000
$DVBASIC EQU   $DEVFLG5                                                 01119000
$ASCII   EQU   $DEVFLG5                                                 01120000
$DEVLU   EQU   $DEVFLG5                                                 01121000
$OPNDFAL EQU   $DEVFLG5                                                 01122000
$ACQNCB  EQU   $DEVFLG5                                                 01123000
$REMOTE  EQU   $DEVFLG5                                                 01124000
$ENDNODE EQU   $DEVFLG5                                                 01125000
$LINENME EQU   $RNINFO                                                  01126000
$CID     EQU   $DEVTBLE+52                                              01127000
$DVCOL   EQU   $LDNCBPT+2                                               01128000
$DVROW   EQU   $LDNCBPT                                                 01129000
$NCSPLP  EQU   $DEVTBLE+44                                              01130000
$DVLN    EQU   $SSCPDAF                                                 01131000
$DAF     EQU   $DEVSESP+4                                               01132000
$VARYPAB EQU   $DEVSESP                                                 01133000
$SYSMN   EQU   $DEVTBLE+28                                              01134000
@NM00060 EQU   $DEVFLG3                                                 01135000
$CLRSNT  EQU   $DEVFLG3                                                 01136000
$OLTERR  EQU   $DEVFLG3                                                 01137000
$SRTEST  EQU   $DEVFLG3                                                 01138000
$DVSNDOK EQU   $SIOFLG                                                  01139000
$POLLREQ EQU   $DEVFLG3                                                 01140000
$ACQRED  EQU   $DEVFLG3                                                 01141000
$NOTDEV  EQU   $DEVFLG3                                                 01142000
$DVINCT  EQU   $DEVTBLE+26                                              01143000
$DVBRKST EQU   $OPND+1                                                  01144000
$DVBRKSN EQU   $OPND                                                    01145000
$DVSEQNO EQU   $OPIS                                                    01146000
$CEINTRP EQU   $DEVFLG2                                                 01147000
$TESTMDE EQU   $DEVFLG2                                                 01148000
$DEVALOC EQU   $DEVFLG2                                                 01149000
$ALLDATA EQU   $DEVFLG2                                                 01150000
$ENDCNTL EQU   $DEVFLG2                                                 01151000
$CTLDEV  EQU   $DEVFLG2                                                 01152000
$NOCDS   EQU   $DEVFLG2                                                 01153000
$DATAIN  EQU   $DEVFLG2                                                 01154000
$PRIMARY EQU   $DEVFLG1                                                 01155000
$DVCTBYT EQU   $INTOCC                                                  01156000
$DEVACT  EQU   $DEVFLG1                                                 01157000
$DVLGMDE EQU   $ATTNEXP                                                 01158000
$DVSPRM  EQU   $EVNCPLT                                                 01159000
$GRABBED EQU   $DEVFLG1                                                 01160000
$CATASTR EQU   $DEVFLG1                                                 01161000
$LETGO   EQU   $DEVFLG1                                                 01162000
$CURELEM EQU   $$SYMNME+4                                               01163000
$MSGOTSD EQU   $$SYMNME                                                 01164000
$EXTDEV  EQU   $DEVCDS+11                                               01165000
@NM00059 EQU   $DEVSDCF                                                 01166000
$NOTPRIM EQU   $DEVSDCF                                                 01167000
@NM00058 EQU   $DEVCDSF                                                 01168000
@NM00057 EQU   $DEVCDSF                                                 01169000
@NM00056 EQU   $DEVCDSF                                                 01170000
$CDSNAME EQU   $DEVCDSF                                                 01171000
$EXTRN   EQU   $DEVCDSF                                                 01172000
$CEVOLUM EQU   $DEVCDSF                                                 01173000
$SHARD   EQU   $DEVCDSF                                                 01174000
$DEVFPM  EQU   $DEVCDSF                                                 01175000
$DEVCNT  EQU   $DEVCDS+8                                                01176000
$DEVTYPE EQU   $DEVFEAT+3                                               01177000
$DEVCLAS EQU   $DEVFEAT+2                                               01178000
$DEVFRRS EQU   $DEVFEAT+1                                               01179000
$DEVMOD  EQU   $DEVFEAT                                                 01180000
$DEVRDGT EQU   @NM00054+1                                               01181000
$DEVCTLU EQU   @NM00054+1                                               01182000
$DEVCHAN EQU   @NM00054                                                 01183000
@NM00055 EQU   @NM00054                                                 01184000
$CTINDX  EQU   $DEVUNAD                                                 01185000
$FLAG16  EQU   $COMMFLG+15                                              01186000
$FLAG15  EQU   $COMMFLG+14                                              01187000
$FLAG14  EQU   $COMMFLG+13                                              01188000
$TEP2ND  EQU   $FLAG13                                                  01189000
$TEP1ST  EQU   $FLAG13                                                  01190000
$CATMSG  EQU   $FLAG13                                                  01191000
$PRMPTSW EQU   $FLAG13                                                  01192000
$DEVENT  EQU   $FLAG13                                                  01193000
$OLTMACC EQU   $FLAG13                                                  01194000
$LGON    EQU   $FLAG13                                                  01195000
$CTLOGON EQU   $FLAG13                                                  01196000
@NM00053 EQU   $FLAG12                                                  01197000
$VARYINP EQU   $FLAG12                                                  01198000
$ENDTEST EQU   $FLAG12                                                  01199000
$VRYHRD  EQU   $FLAG12                                                  01200000
$VRYSFT  EQU   $FLAG12                                                  01201000
$POSTFLG EQU   $FLAG12                                                  01202000
$OPTMSG  EQU   $FLAG12                                                  01203000
$FEORCAT EQU   $FLAG11                                                  01204000
@NM00052 EQU   $FLAG11                                                  01205000
@NM00051 EQU   $FLAG10                                                  01206000
$INBND   EQU   $FLAG10                                                  01207000
$WAITFLG EQU   $FLAG10                                                  01208000
$DPRINT  EQU   $FLAG10                                                  01209000
$HOLD    EQU   $FLAG9                                                   01210000
$NOTRRCH EQU   $FLAG9                                                   01211000
@NM00050 EQU   $FLAG9                                                   01212000
$LSTLNSW EQU   $FLAG9                                                   01213000
$MULLNSW EQU   $FLAG9                                                   01214000
$IGRES   EQU   $FLAG9                                                   01215000
$VS2     EQU   $FLAG8                                                   01216000
$VS1     EQU   $FLAG8                                                   01217000
$EDOS    EQU   $FLAG8                                                   01218000
@NM00049 EQU   $FLAG8                                                   01219000
$TWOWAY  EQU   $FLAG8                                                   01220000
@NM00048 EQU   $FLAG8                                                   01221000
$RCVMSG  EQU   $FLAG7                                                   01222000
$RCVRFLG EQU   $FLAG7                                                   01223000
$SNDRFLG EQU   $FLAG7                                                   01224000
$LDOIS   EQU   $FLAG7                                                   01225000
$DCONTCT EQU   $FLAG7                                                   01226000
$EXIOWAT EQU   $FLAG7                                                   01227000
$2NDDATA EQU   $FLAG7                                                   01228000
$1STDATA EQU   $FLAG7                                                   01229000
$CIREQ   EQU   $FLAG6                                                   01230000
$ABTERM  EQU   $ABNDBIT                                                 01231000
$FSTMCIS EQU   $FLAG6                                                   01232000
$DISCREQ EQU   $FLAG6                                                   01233000
$DISCISS EQU   $FLAG6                                                   01234000
$CTERROR EQU   $FLAG6                                                   01235000
$RECAL11 EQU   $FLAG6                                                   01236000
@NM00047 EQU   $FLAG5                                                   01237000
$PROGCK  EQU   $CANCEL                                                  01238000
$PRINTAP EQU   $FLAG5                                                   01239000
@NM00046 EQU   $FLAG5                                                   01240000
$MSG922  EQU   $FLAG5                                                   01241000
$CT924   EQU   $FLAG5                                                   01242000
$FSTCAT  EQU   $FLAG5                                                   01243000
$FSTFE   EQU   $FLAG5                                                   01244000
$ACTOPND EQU   $FLAG4                                                   01245000
$ACQCUTT EQU   $FLAG4                                                   01246000
$CLSSACT EQU   $FLAG4                                                   01247000
$BACKINT EQU   $FLAG4                                                   01248000
$DMSGSW  EQU   $FLAG4                                                   01249000
$TSTDEVP EQU   $FLAG4                                                   01250000
$APRQPER EQU   $FLAG4                                                   01251000
$OPCOM   EQU   $FLAG4                                                   01252000
$NEWAP   EQU   $FLAG3                                                   01253000
$ALTPRTR EQU   $FLAG3                                                   01254000
$OPTERR  EQU   $FLAG3                                                   01255000
$PRTONLY EQU   $FLAG3                                                   01256000
$REQSTOR EQU   $FLAG3                                                   01257000
$LOGOFFE EQU   $FLAG3                                                   01258000
$TSTERR  EQU   $FLAG3                                                   01259000
$DEVERR  EQU   $FLAG3                                                   01260000
$PARTIAL EQU   $FLAG2                                                   01261000
$NRMTERM EQU   $FLAG2                                                   01262000
$VALDTST EQU   $FLAG2                                                   01263000
$VALDDEV EQU   $FLAG2                                                   01264000
$DBLSLSH EQU   $FLAG2                                                   01265000
$NDR     EQU   $FLAG2                                                   01266000
@NM00045 EQU   $FLAG2                                                   01267000
$FTTHR   EQU   $FLAG2                                                   01268000
$OLTACT  EQU   $FLAG1                                                   01269000
$NORELDV EQU   $FLAG1                                                   01270000
@NM00044 EQU   $FLAG1                                                   01271000
$OPTCHNG EQU   $FLAG1                                                   01272000
$DEVCHNG EQU   $FLAG1                                                   01273000
$TESTCNG EQU   $FLAG1                                                   01274000
$CNSLFG  EQU   $FLAG1                                                   01275000
$TEP3RD  EQU   $FLAG1                                                   01276000
@NM00043 EQU   $CDA+120                                                 01277000
$CUCNT   EQU   $CDA+118                                                 01278000
@NM00042 EQU   $CDA+117                                                 01279000
$PRTFORM EQU   $CDA+116                                                 01280000
$OPISCNT EQU   $CDA+114                                                 01281000
$OPNDCNT EQU   $CDA+112                                                 01282000
$GETMSZE EQU   $CDA+110                                                 01283000
$GRCNTS  EQU   $CDA+108                                                 01284000
$CTLCNT  EQU   $CDA+106                                                 01285000
$ACTLVL  EQU   $CDA+105                                                 01286000
$PRNTLVL EQU   $CDA+104                                                 01287000
$ERRCNTA EQU   $CDA+102                                                 01288000
$TLCNT   EQU   $CDA+100                                                 01289000
$TIMEALW EQU   $CDA+96                                                  01290000
$PTRAREA EQU   $CDA+92                                                  01291000
$GETMPTR EQU   $CDA+88                                                  01292000
$R13PTRT EQU   $CDA+84                                                  01293000
$R13PTR  EQU   $CDA+80                                                  01294000
$TEPEND  EQU   $CDA+76                                                  01295000
$PLINKDL EQU   $CDA+72                                                  01296000
$TEPBEGN EQU   $CDA+68                                                  01297000
$FRELPTR EQU   $CDA+64                                                  01298000
$HIGHADR EQU   $HIMOREC                                                 01299000
$LOMOREC EQU   $CDA+56                                                  01300000
$ENDCOMM EQU   $CDA+48                                                  01301000
$COMMON  EQU   $RCA                                                     01302000
$SLASHAD EQU   $CDA+32                                                  01303000
$PASSON  EQU   $CDA+28                                                  01304000
$TOLBRTB EQU   $CDA+24                                                  01305000
$SCTPTR8 EQU   $CDA+20                                                  01306000
$SCTPTR  EQU   $CDA+16                                                  01307000
$TBWDPTR EQU   $CDA+12                                                  01308000
$TFWDPTR EQU   $CDA+8                                                   01309000
@NM00041 EQU   $CDA                                                     01310000
@NM00040 EQU   $SCTTBLE+98                                              01311000
$SCTLWTC EQU   $SCTTBLE+96                                              01312000
$SCTLWTA EQU   $SCTTBLE+92                                              01313000
#EXT     EQU   $SCTTBLE+88                                              01314000
#PASS    EQU   $SCTTBLE+84                                              01315000
#TABLE   EQU   $SCTTBLE+80                                              01316000
#MSGIDAC EQU   $SCTTBLE+78                                              01317000
@NM00039 EQU   $SCTTBLE+71                                              01318000
$RETMASK EQU   $SCTTBLE+70                                              01319000
$R249255 EQU   $ROUTMSK+29                                              01320000
$R241248 EQU   $ROUTMSK+28                                              01321000
$R233240 EQU   $ROUTMSK+27                                              01322000
$R225232 EQU   $ROUTMSK+26                                              01323000
$R217224 EQU   $ROUTMSK+25                                              01324000
$R209216 EQU   $ROUTMSK+24                                              01325000
$R201208 EQU   $ROUTMSK+23                                              01326000
$R193200 EQU   $ROUTMSK+22                                              01327000
$R185192 EQU   $ROUTMSK+21                                              01328000
$R177184 EQU   $ROUTMSK+20                                              01329000
$R169176 EQU   $ROUTMSK+19                                              01330000
$R161168 EQU   $ROUTMSK+18                                              01331000
$R153160 EQU   $ROUTMSK+17                                              01332000
$R145152 EQU   $ROUTMSK+16                                              01333000
$R137144 EQU   $ROUTMSK+15                                              01334000
$R129136 EQU   $ROUTMSK+14                                              01335000
$R121128 EQU   $ROUTMSK+13                                              01336000
$R113120 EQU   $ROUTMSK+12                                              01337000
$R105112 EQU   $ROUTMSK+11                                              01338000
$R097104 EQU   $ROUTMSK+10                                              01339000
$R089096 EQU   $ROUTMSK+9                                               01340000
$R081088 EQU   $ROUTMSK+8                                               01341000
$R073080 EQU   $ROUTMSK+7                                               01342000
$R065072 EQU   $ROUTMSK+6                                               01343000
$R057064 EQU   $ROUTMSK+5                                               01344000
$R049056 EQU   $ROUTMSK+4                                               01345000
$R041048 EQU   $ROUTMSK+3                                               01346000
$R033040 EQU   $ROUTMSK+2                                               01347000
$R025032 EQU   $ROUTMSK+1                                               01348000
$R017024 EQU   $ROUTMSK                                                 01349000
$TOTFLG2 EQU   $SCTTBLE+39                                              01350000
@NM00038 EQU   $TOTFLG1                                                 01351000
@NM00037 EQU   $TOTFLG1                                                 01352000
@NM00036 EQU   $TOTFLG1                                                 01353000
$CURELOD EQU   $TOTFLG1                                                 01354000
$CTEQTT  EQU   $TOTFLG1                                                 01355000
@NM00035 EQU   $TOTFLG1                                                 01356000
@NM00034 EQU   $TOTFLG1                                                 01357000
$LINESHR EQU   $TOTFLG1                                                 01358000
@NM00033 EQU   $OLTFLG2                                                 01359000
@NM00032 EQU   $OLTFLG2                                                 01360000
@NM00031 EQU   $OLTFLG2                                                 01361000
@NM00030 EQU   $OLTFLG2                                                 01362000
@NM00029 EQU   $OLTFLG2                                                 01363000
@NM00028 EQU   $OLTFLG2                                                 01364000
@NM00027 EQU   $OLTFLG2                                                 01365000
$TALK    EQU   $OLTFLG2                                                 01366000
$DYCOM   EQU   $OLTFLGS                                                 01367000
@NM00026 EQU   $OLTFLGS                                                 01368000
$TRACE   EQU   $OLTFLGS                                                 01369000
$RETCODE EQU   $OLTFLGS                                                 01370000
$CONTCB  EQU   $OLTFLGS                                                 01371000
$RETAIN  EQU   $OLTFLGS                                                 01372000
$CLEANRT EQU   $OLTFLGS                                                 01373000
$MANINTV EQU   $OLTFLGS                                                 01374000
$OLTSIZE EQU   $SCTTBLE+34                                              01375000
$QSCTMOD EQU   $EXECFLG                                                 01376000
$CTRLMOD EQU   $EXECFLG                                                 01377000
$CLEANUP EQU   $EXECFLG                                                 01378000
$LSTPDEV EQU   $EXECFLG                                                 01379000
$ERRCNT  EQU   $EXECFLG                                                 01380000
$RTNSLCT EQU   $EXECFLG                                                 01381000
$MULTDEV EQU   $EXECFLG                                                 01382000
@NM00025 EQU   $EXECFLG                                                 01383000
$RMSKCNT EQU   $SCTTBLE+32                                              01384000
$SYNAME  EQU   $CDS8T19+4                                               01385000
$EXTSIG  EQU   $CDS8T19+3                                               01386000
$CDFLGS  EQU   $CDS8T19+1                                               01387000
$CDSCNT  EQU   $CDS8T19                                                 01388000
$PDEVDSC EQU   $SCTTBLE+16                                              01389000
$PDEVADR EQU   $SCTTBLE+12                                              01390000
$COMMCN  EQU   $CDSFLGS                                                 01391000
$CUSTSYM EQU   $CDSFLGS                                                 01392000
$TWOCHSW EQU   $CDSFLGS                                                 01393000
$SYMNAME EQU   $CDSFLGS                                                 01394000
$EXTINTC EQU   $CDSFLGS                                                 01395000
$CEVOL   EQU   $CDSFLGS                                                 01396000
$SHARED  EQU   $CDSFLGS                                                 01397000
$FPM     EQU   $CDSFLGS                                                 01398000
$LASTSUB EQU   $PDEVFLG                                                 01399000
@NM00024 EQU   $PDEVFLG                                                 01400000
@NM00023 EQU   $PDEVFLG                                                 01401000
@NM00022 EQU   $PDEVFLG                                                 01402000
$LASTDEV EQU   $PDEVFLG                                                 01403000
@NM00021 EQU   $PDEVFLG                                                 01404000
$EXFILPT EQU   $PDEVFLG                                                 01405000
$FPMOLD  EQU   $PDEVFLG                                                 01406000
$TSSSYM  EQU   $SCTTBLE+8                                               01407000
$SCTLEVL EQU   $SCTTBLE+7                                               01408000
$DRIVER  EQU   $SCTTBLE+6                                               01409000
$RT0916  EQU   $SCTTBLE+5                                               01410000
$RT0108  EQU   $SCTTBLE+4                                               01411000
$LOOPTST EQU   $ERROPT                                                  01412000
$LOOPERR EQU   $ERROPT                                                  01413000
$NERRPRT EQU   $ERROPT                                                  01414000
$NOCNTRL EQU   $ERROPT                                                  01415000
$ALTPRNT EQU   $ERROPT                                                  01416000
$CATERR  EQU   $ERROPT                                                  01417000
$ASTERIK EQU   $ERROPT                                                  01418000
$TESTERR EQU   $ERROPT                                                  01419000
$FSTCOMM EQU   $TESTOPT                                                 01420000
$INDEFLP EQU   $TESTOPT                                                 01421000
$NOPRT   EQU   $TESTOPT                                                 01422000
$PARAPRT EQU   $TESTOPT                                                 01423000
@NM00020 EQU   $TESTOPT                                                 01424000
$ERRLPCT EQU   $SCTTBLE                                                 01425000
$TLTEND  EQU   $RCAAREA+945                                             01426000
$CNSLID  EQU   $RCAAREA+936                                             01427000
$EXITSAV EQU   $RCAAREA+864                                             01428000
$TRASCII EQU   $RCAAREA+608                                             01429000
@NM00019 EQU   $RCAAREA+605                                             01430000
$VTAMEND EQU   $RCAFLG                                                  01431000
$TPPOSTD EQU   $RCAFLG                                                  01432000
$NEWCT   EQU   $RCAFLG                                                  01433000
$ABNDALL EQU   $RCAFLG                                                  01434000
$CUTESTB EQU   $RCAFLG                                                  01435000
$CONSOLE EQU   $RCAFLG                                                  01436000
$TPLOGON EQU   $RCAFLG                                                  01437000
$UPDATE  EQU   $RCAFLG                                                  01438000
$DEVAREA EQU   $RCAAREA+600                                             01439000
$CTDVAR  EQU   $RCAAREA+596                                             01440000
$BUFFS   EQU   $RCAAREA+464                                             01441000
$TLTNIB  EQU   $CONSTNT+140                                             01442000
$TLTPRPL EQU   $CONSTNT+20                                              01443000
@NM00018 EQU   $CONSTNT+4                                               01444000
@NM00017 EQU   $CONSTNT+2                                               01445000
$USECNT  EQU   $CONSTNT                                                 01446000
$CURRTWA EQU   $POINTER+140                                             01447000
$CTNAME  EQU   $POINTER+132                                             01448000
$CTARGX  EQU   $POINTER+128                                             01449000
$COMINT  EQU   $POINTER+120                                             01450000
$QUEHNDL EQU   $POINTER+116                                             01451000
@NM00016 EQU   $POINTER+36                                              01452000
$RTNPTR  EQU   $POINTER+32                                              01453000
$TLTECB2 EQU   $POINTER+28                                              01454000
$TLTECB1 EQU   $POINTER+24                                              01455000
$CLEANP  EQU   $POINTER+20                                              01456000
$ABEND   EQU   $POINTER+16                                              01457000
$LSTAREA EQU   $POINTER+12                                              01458000
$FSTAREA EQU   $POINTER+8                                               01459000
$CVTSAVE EQU   $POINTER+4                                               01460000
$TOLTEP  EQU   $POINTER                                                 01461000
$TLTACB  EQU   $RCAAREA                                                 01462000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01463000
@RT00077 EQU   I009C01A                                                 01464000
@RT00087 EQU   I009C02                                                  01465000
@RT00149 EQU   I009C04                                                  01466000
@RF00149 EQU   I009C03A                                                 01467000
@RT00156 EQU   I009C04                                                  01468000
@RF00154 EQU   I009C04                                                  01469000
@RT00167 EQU   I009C05                                                  01470000
@RT00187 EQU   I009CER2                                                 01471000
@RT00189 EQU   I009CER3                                                 01472000
@RT00233 EQU   I009CRD1                                                 01473000
@RT00251 EQU   I009CRET                                                 01474000
@ENDDATA EQU   *                                                        01475000
         END   ISTIC009,(C'PLS2111',0702,80232)                         01476000
