         TITLE '     ISTINCIT - INITIALIZATION CONTROL'                 00001000
ISTINCIT CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTINCIT  80.241'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @14,@SA00001                                        0001 00014000
         ST    @14,8(,@13)                                         0001 00015000
         LR    @13,@14                                             0001 00016000
         PRINT OFF                                                      00017000
         PRINT ON                                                       00018000
*                                                                  0191 00019000
*/* END OF ATBUILD */                /* @ZA03720*/                 0191 00020000
*/*------------------------------------------------------------------*/ 00021000
*/* THHIS MODULE INVOKS VTAM INITALIZATION MODULES                   */ 00022000
*/*-----------------------------------------------------------------*/  00023000
*                                                                  0191 00024000
*                                                                  0191 00025000
*  DO; /* LISATCVT CVTBASE(PAGEABLE,(ATCVTPTR)) */                 0191 00026000
*    ATCVTPTR = ATCLCPTR; /*SET UP ATCVT POINTER*/                 0192 00027000
         L     ATCVTPTR,ATCLCPTR                                   0192 00028000
*  END; /*LISATCVT*/        /*         @ZA03720*/                  0193 00029000
*        RFY ISTATCVT BASED (ATCVTPTR);                            0194 00030000
*        RFY ISTCONFT BASED (ATCCONFT);                            0195 00031000
*        CONF01SV = CHASAVE;                                       0196 00032000
         L     @14,ATCCONFT(,ATCVTPTR)                             0196 00033000
         L     @05,CHASAVE(,CITR13)                                0196 00034000
         ST    @05,CONF01SV(,@14)                                  0196 00035000
*        CALL  ISTINCIB;           /* LINK TO BASIC INITIALIZATION 0197 00036000
*                                     ROUTINE TO ESTABLISH BASE    0197 00037000
*                                     ENVIORNMENT                    */ 00038000
         L     @15,@CV00042                                        0197 00039000
         BALR  @14,@15                                             0197 00040000
*        IF  CITR15=0  THEN        /*    RETURN CODE EQUAL ZERO?    */  00041000
         LTR   CITR15,CITR15                                       0198 00042000
         BNZ   @RF00198                                            0198 00043000
*              CONSTAFP='7FFFFFFF'X; /* INDICATE CALL CRR   @ZA03720*/  00044000
         L     @14,ATCCONFT(,ATCVTPTR)                             0199 00045000
         MVC   CONSTAFP(4,@14),@CF00103                            0199 00046000
*            ELSE GOTO CITTREL;    /* NO-GO TO RELEASE RESOURCES RTN */ 00047000
*        CALL  ISTINCCC;           /*YES-LINK TO THE CONFIGURATION 0201 00048000
*                                         CONTROL RTN TO PROCESS   0201 00049000
*                                         OPTION PARAMETERS        */   00050000
         L     @15,@CV00040                                        0201 00051000
         BALR  @14,@15                                             0201 00052000
*        IF  CITR15=0  THEN;        /* RETURN CODE EQUAL ZERO?    */    00053000
         LTR   CITR15,CITR15                                       0202 00054000
         BNZ   @RF00202                                            0202 00055000
*            ELSE GOTO CITTREL;     /*NO-GO TO RELEASE RESOURCES RTN */ 00056000
*        CALL  ISTINCCF;            /*YES-LINK TO THE CONFIGURATION     00057000
*                                         ROUTINE                    */ 00058000
         L     @15,@CV00041                                        0205 00059000
         BALR  @14,@15                                             0205 00060000
*        IF  CITR15=0  THEN;        /* RETURN CODE EQUAL ZERO?    */    00061000
         LTR   CITR15,CITR15                                       0206 00062000
         BNZ   @RF00206                                            0206 00063000
*            ELSE GOTO CITTREL;     /*NO-GO TO RELEASE RESOURCES RTN */ 00064000
*        CALL  ISTINCOS;            /*YES-LINK TO THE OPTIONAL SERVICES 00065000
*                                         ROUTINE TO PROCESS OPTIONS */ 00066000
         L     @15,@CV00043                                        0209 00067000
         BALR  @14,@15                                             0209 00068000
*        IF  CITR15=0  THEN            /* RETURN CODE EQUAL ZERO?    */ 00069000
         LTR   CITR15,CITR15                                       0210 00070000
         BNZ   @RF00210                                            0210 00071000
*              CALL  ISTINCAW;      /*YES-LINK TO TASK CONTROL RTN   */ 00072000
         L     @15,@CV00039                                        0211 00073000
         BALR  @14,@15                                             0211 00074000
*            ELSE                                                  0212 00075000
*        CITTREL:       CALL ISTINCRR; /*NO-LINK TO THE RELEASE    0212 00076000
*                                        RESOURCES ROUTINE           */ 00077000
*                                                                  0212 00078000
         B     @RC00210                                            0212 00079000
@RF00210 DS    0H                                                  0212 00080000
CITTREL  L     @15,@CV00044                                        0212 00081000
         BALR  @14,@15                                             0212 00082000
* DO; /* TPEPILOG   */                                             0213 00083000
@RC00210 DS    0H                                                  0214 00084000
*                                                                  0214 00085000
* GEN (PRINT OFF);                                                 0214 00086000
         PRINT OFF                                                      00087000
* GEN (PRINT ON);                                                  0215 00088000
         PRINT ON                                                       00089000
* END;/* TPEPILOG */                                               0216 00090000
*        END;                                                      0217 00091000
@EL00001 L     @13,4(,@13)                                         0217 00092000
@EF00001 DS    0H                                                  0217 00093000
@ER00001 LM    @14,@12,12(@13)                                     0217 00094000
         BR    @14                                                 0217 00095000
@DATA    DS    0H                                                       00096000
         DS    0F                                                       00097000
@SA00001 DS    18F                                                      00098000
         DS    0F                                                       00099000
@CF00103 DC    XL4'7FFFFFFF'                                            00100000
@CV00039 DC    V(ISTINCAW)                                              00101000
@CV00040 DC    V(ISTINCCC)                                              00102000
@CV00041 DC    V(ISTINCCF)                                              00103000
@CV00042 DC    V(ISTINCIB)                                              00104000
@CV00043 DC    V(ISTINCOS)                                              00105000
@CV00044 DC    V(ISTINCRR)                                              00106000
         DS    0D                                                       00107000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00108000
@01      EQU   01                                                       00109000
@02      EQU   02                                                       00110000
@03      EQU   03                                                       00111000
@04      EQU   04                                                       00112000
@05      EQU   05                                                       00113000
@06      EQU   06                                                       00114000
@07      EQU   07                                                       00115000
@08      EQU   08                                                       00116000
@09      EQU   09                                                       00117000
@10      EQU   10                                                       00118000
@11      EQU   11                                                       00119000
@12      EQU   12                                                       00120000
@13      EQU   13                                                       00121000
@14      EQU   14                                                       00122000
@15      EQU   15                                                       00123000
ATCVTPTR EQU   @04                                                      00124000
CITR13   EQU   @13                                                      00125000
CITR15   EQU   @15                                                      00126000
RPHPTR   EQU   @01                                                      00127000
LDPRMPTR EQU   @01                                                      00128000
ATCLCPTR EQU   1032                                                     00129000
CITSAVE  EQU   0                                                        00130000
CHASAVE  EQU   CITSAVE+4                                                00131000
ISTLOK   EQU   0                                                        00132000
LOKCHN   EQU   ISTLOK+1                                                 00133000
LOKCHNG  EQU   LOKCHN                                                   00134000
@NM00003 EQU   LOKCHNG+2                                                00135000
ISTPAB   EQU   0                                                        00136000
PABWQCHN EQU   ISTPAB                                                   00137000
PABWEQA  EQU   PABWQCHN                                                 00138000
PABCHAIN EQU   PABWQCHN+4                                               00139000
PABRPHFG EQU   ISTPAB+12                                                00140000
PABFLAGS EQU   PABRPHFG                                                 00141000
PABEND   EQU   ISTPAB+16                                                00142000
ISTDYPAB EQU   0                                                        00143000
DYPCHAIN EQU   ISTDYPAB+4                                               00144000
DYPPACMD EQU   ISTDYPAB+12                                              00145000
ISTRPH   EQU   0                                                        00146000
RPHCNTL  EQU   ISTRPH                                                   00147000
RPHFLAGS EQU   RPHCNTL+2                                                00148000
RPHFLGB  EQU   RPHCNTL+3                                                00149000
RPHRPHA  EQU   ISTRPH+4                                                 00150000
RPHTSKID EQU   ISTRPH+8                                                 00151000
RPHRESMA EQU   ISTRPH+16                                                00152000
RPHWPFLG EQU   RPHRESMA                                                 00153000
RPHWEA   EQU   ISTRPH+24                                                00154000
RPHSRPRM EQU   ISTRPH+28                                                00155000
RPHWORK  EQU   ISTRPH+36                                                00156000
RPHSAVE1 EQU   RPHWORK                                                  00157000
RPHSBITS EQU   RPHSAVE1+1                                               00158000
ISTATCVT EQU   0                                                        00159000
ATCRPTCH EQU   ISTATCVT                                                 00160000
ATCITFLD EQU   ISTATCVT+8                                               00161000
ATCITPRM EQU   ATCITFLD                                                 00162000
ATCITCDS EQU   ATCITFLD+8                                               00163000
ATCITFLG EQU   ATCITCDS+4                                               00164000
ATCITRA1 EQU   ATCITFLG+2                                               00165000
ATCSMPAB EQU   ISTATCVT+88                                              00166000
ATCLDTIL EQU   ISTATCVT+408                                             00167000
ATCGTSTR EQU   ISTATCVT+644                                             00168000
ATCTSCIO EQU   ISTATCVT+736                                             00169000
ATCTSCUF EQU   ISTATCVT+776                                             00170000
@NM00016 EQU   ISTATCVT+792                                             00171000
ATCLUDVT EQU   ISTATCVT+800                                             00172000
ATCANYDT EQU   ISTATCVT+808                                             00173000
@NM00017 EQU   ISTATCVT+812                                             00174000
ATCPODVT EQU   ISTATCVT+832                                             00175000
ATCCONFT EQU   ISTATCVT+920                                             00176000
ATCSSDVT EQU   ISTATCVT+940                                             00177000
ATCSODVT EQU   ISTATCVT+944                                             00178000
ATCMBDVT EQU   ISTATCVT+952                                             00179000
ATCSTAT  EQU   ISTATCVT+972                                             00180000
ATCSTAT1 EQU   ATCSTAT                                                  00181000
@NM00018 EQU   ATCSTAT+1                                                00182000
ATCPOFLG EQU   ATCSTAT+2                                                00183000
ATCSTAT4 EQU   ATCSTAT+3                                                00184000
ATCBITAN EQU   ISTATCVT+976                                             00185000
ATCFLAG2 EQU   ATCBITAN+1                                               00186000
ATCONID  EQU   ISTATCVT+980                                             00187000
ATCSSCPA EQU   ISTATCVT+984                                             00188000
ATCHPGM  EQU   ISTATCVT+1040                                            00189000
ATCRNO   EQU   ISTATCVT+1044                                            00190000
ATCCPDVT EQU   ISTATCVT+1092                                            00191000
ATCSMSDQ EQU   ISTATCVT+1128                                            00192000
ATCRID   EQU   ISTATCVT+1144                                            00193000
ATCTKFLD EQU   ISTATCVT+1156                                            00194000
ATCIOINT EQU   ISTATCVT+1176                                            00195000
ATCTOD   EQU   ISTATCVT+1220                                            00196000
ATCVRTIL EQU   ISTATCVT+1264                                            00197000
ATCLKSWP EQU   ISTATCVT+1440                                            00198000
ATCWUDYP EQU   ISTATCVT+1448                                            00199000
ATCXCNCB EQU   ISTATCVT+1544                                            00200000
ATCSQAFR EQU   ISTATCVT+1560                                            00201000
ATCORTCB EQU   ATCSQAFR+4                                               00202000
ATCORSRB EQU   ATCORTCB                                                 00203000
ATCLDAPP EQU   ISTATCVT+1600                                            00204000
ATCDAPVT EQU   ISTATCVT+1620                                            00205000
ATCGSRBQ EQU   ISTATCVT+1672                                            00206000
ATCGSRBG EQU   ATCGSRBQ                                                 00207000
ATCENFLG EQU   ISTATCVT+1722                                            00208000
ATCCSCB  EQU   ISTATCVT+1724                                            00209000
ATCVTFLG EQU   ISTATCVT+1784                                            00210000
@NM00050 EQU   ISTATCVT+1816                                            00211000
ATCCRA   EQU   ISTATCVT+1840                                            00212000
ATCCRACN EQU   ATCCRA+4                                                 00213000
ATCCRPL  EQU   ISTATCVT+1848                                            00214000
ATCRPLCN EQU   ATCCRPL+4                                                00215000
ISTSRT   EQU   0                                                        00216000
SRTSRTE  EQU   ISTSRT+8                                                 00217000
SRTXTNBS EQU   ISTSRT+13                                                00218000
ISTDEVCH EQU   0                                                        00219000
DEVSHCH  EQU   ISTDEVCH                                                 00220000
DEVCHAR  EQU   DEVSHCH                                                  00221000
DEVTCODE EQU   ISTDEVCH+1                                               00222000
DEVFLAGS EQU   ISTDEVCH+3                                               00223000
DEVFCCTL EQU   DEVFLAGS                                                 00224000
DEVCHAR3 EQU   DEVFLAGS                                                 00225000
DEVMODE  EQU   ISTDEVCH+5                                               00226000
ISTRPRE  EQU   0                                                        00227000
RPRSRTHD EQU   ISTRPRE                                                  00228000
RPRDAFID EQU   ISTRPRE+16                                               00229000
RPRSTATE EQU   ISTRPRE+56                                               00230000
RPRCURST EQU   RPRSTATE                                                 00231000
RPRDESST EQU   RPRSTATE+2                                               00232000
RPRBITAN EQU   ISTRPRE+61                                               00233000
RPRFLAGS EQU   ISTRPRE+66                                               00234000
ISTRCPRE EQU   0                                                        00235000
RCPSARRY EQU   ISTRCPRE+84                                              00236000
RCPPACE  EQU   ISTRCPRE+108                                             00237000
RCPNCPPC EQU   ISTRCPRE+110                                             00238000
RCPPMODE EQU   ISTRCPRE+113                                             00239000
RCPCYMOD EQU   RCPPMODE                                                 00240000
RCPCYSET EQU   RCPPMODE                                                 00241000
RCPSESSM EQU   ISTRCPRE+115                                             00242000
RCPBITAN EQU   ISTRCPRE+116                                             00243000
ISTRDT   EQU   0                                                        00244000
RDTPLEN  EQU   ISTRDT+84                                                00245000
RDTPRIOR EQU   RDTPLEN                                                  00246000
RDTBITAN EQU   ISTRDT+113                                               00247000
RDTCRIA  EQU   ISTRDT+116                                               00248000
ISTRAP   EQU   0                                                        00249000
RAPBITAN EQU   ISTRAP+165                                               00250000
ISTLDPRM EQU   0                                                        00251000
LDPFG    EQU   ISTLDPRM+20                                              00252000
LDPFB2   EQU   ISTLDPRM+21                                              00253000
ISTUILTE EQU   0                                                        00254000
ISTRGP   EQU   0                                                        00255000
RGPBITAN EQU   ISTRGP+94                                                00256000
ISTSMHDR EQU   0                                                        00257000
SMHCHAR  EQU   ISTSMHDR+8                                               00258000
ISTSCHDR EQU   0                                                        00259000
SCHCHAR  EQU   ISTSCHDR                                                 00260000
ISTECB   EQU   0                                                        00261000
@NM00091 EQU   ISTECB                                                   00262000
ISTRRN   EQU   0                                                        00263000
RRNADR   EQU   ISTRRN+136                                               00264000
RRNFLAG  EQU   RRNADR                                                   00265000
RRNUCBAD EQU   RRNADR+1                                                 00266000
RRNHPRE  EQU   ISTRRN+196                                               00267000
RRNBITAN EQU   ISTRRN+201                                               00268000
RRNLVL   EQU   ISTRRN+204                                               00269000
RRNNMDPD EQU   ISTRRN+232                                               00270000
RRNLDFSM EQU   ISTRRN+298                                               00271000
ISTRCDRM EQU   0                                                        00272000
RCDRMPDN EQU   ISTRCDRM+188                                             00273000
RCDRMRPQ EQU   ISTRCDRM+196                                             00274000
RCDRMFGS EQU   ISTRCDRM+208                                             00275000
ISTCONFT EQU   0                                                        00276000
CONSTAFP EQU   ISTCONFT+100                                             00277000
CONF01SV EQU   ISTCONFT+116                                             00278000
CONECBAA EQU   ISTCONFT+136                                             00279000
CONSBFAA EQU   ISTCONFT+140                                             00280000
CONDBFAA EQU   ISTCONFT+144                                             00281000
CONVTHAA EQU   ISTCONFT+148                                             00282000
CONPUNAA EQU   ISTCONFT+152                                             00283000
CONTOLAA EQU   ISTCONFT+156                                             00284000
CONTRCAA EQU   ISTCONFT+160                                             00285000
CONNETAA EQU   ISTCONFT+164                                             00286000
CONUSSAA EQU   ISTCONFT+168                                             00287000
CONRVYAA EQU   ISTCONFT+172                                             00288000
CONSCPAA EQU   ISTCONFT+176                                             00289000
CONFNSAA EQU   ISTCONFT+180                                             00290000
CONFTRAA EQU   ISTCONFT+184                                             00291000
CONFLDAA EQU   ISTCONFT+188                                             00292000
CONFXXAA EQU   ISTCONFT+192                                             00293000
CONFTTAA EQU   ISTCONFT+196                                             00294000
CONFVRAA EQU   ISTCONFT+200                                             00295000
CONTUNAA EQU   ISTCONFT+204                                             00296000
CONCDPAA EQU   ISTCONFT+208                                             00297000
CONTDPAA EQU   ISTCONFT+212                                             00298000
CONAREAA EQU   ISTCONFT+216                                             00299000
CONSRTAA EQU   ISTCONFT+220                                             00300000
CONGRPAA EQU   ISTCONFT+224                                             00301000
CONEND   EQU   ISTCONFT+240                                             00302000
CONVARA  EQU   0                                                        00303000
CONAREAS EQU   CONVARA                                                  00304000
CONFLG01 EQU   CONAREAS                                                 00305000
CONHALT  EQU   CONAREAS+8                                               00306000
CONFLAGS EQU   CONAREAS+12                                              00307000
CONDSFLG EQU   CONFLAGS                                                 00308000
CONOPTFL EQU   CONFLAGS+1                                               00309000
CONSTAT  EQU   CONFLAGS+2                                               00310000
CONBUFF  EQU   CONFLAGS+3                                               00311000
CONSCPID EQU   CONAREAS+26                                              00312000
CONSTAID EQU   CONSCPID+3                                               00313000
CONDYPA  EQU   CONVARA+56                                               00314000
CONRDTA  EQU   CONVARA+120                                              00315000
CONLDPA  EQU   CONVARA+1844                                             00316000
CONECBA  EQU   CONVARA+2124                                             00317000
CONBUFA  EQU   CONVARA+2164                                             00318000
CONSRTA  EQU   CONVARA+2548                                             00319000
CONECBL  EQU   0                                                        00320000
CONSBFA  EQU   0                                                        00321000
CONDBFA  EQU   0                                                        00322000
ISTAVT   EQU   0                                                        00323000
ISTRETRG EQU   ISTAVT+44                                                00324000
CONCDRMP EQU   0                                                        00325000
CONFLDAT EQU   0                                                        00326000
CONFNSAT EQU   0                                                        00327000
CONFTRAT EQU   0                                                        00328000
CONFTTAT EQU   0                                                        00329000
CONFVRAT EQU   0                                                        00330000
CONFXXAT EQU   0                                                        00331000
CONNTSOL EQU   0                                                        00332000
CONRECON EQU   0                                                        00333000
CONSRTE  EQU   0                                                        00334000
CONTERMP EQU   0                                                        00335000
CONTOLTP EQU   0                                                        00336000
CONTRACE EQU   0                                                        00337000
CONTUNAT EQU   0                                                        00338000
CONUILTA EQU   0                                                        00339000
CONUSNOP EQU   0                                                        00340000
CONVGRP  EQU   0                                                        00341000
CONVPUNS EQU   0                                                        00342000
CONVTHDR EQU   0                                                        00343000
CONVVTAM EQU   0                                                        00344000
ISTXDYP  EQU   0                                                        00345000
PABXTNSN EQU   PABEND                                                   00346000
SRTXTNSN EQU   SRTXTNBS                                                 00347000
RCPSIBQ  EQU   RCPSARRY                                                 00348000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00349000
SRTDATA  EQU   SRTXTNSN+3                                               00350000
SRTUSELN EQU   SRTXTNSN+1                                               00351000
SRTFLAGS EQU   SRTXTNSN                                                 00352000
@NM00008 EQU   PABXTNSN+12                                              00353000
PABNPSSQ EQU   PABXTNSN+8                                               00354000
PABLOCK  EQU   PABXTNSN+4                                               00355000
PABLAST  EQU   PABXTNSN                                                 00356000
ISTRETR7 EQU   ISTRETRG+4                                               00357000
ISTRETR6 EQU   ISTRETRG                                                 00358000
ISTRSV01 EQU   ISTAVT+42                                                00359000
ISTPDAVP EQU   ISTAVT+38                                                00360000
ISTVTTP  EQU   ISTAVT+36                                                00361000
ISTAGTWT EQU   ISTAVT+34                                                00362000
ISTATRT  EQU   ISTAVT+32                                                00363000
ISTARID  EQU   ISTAVT+30                                                00364000
ISTX1    EQU   ISTAVT+29                                                00365000
ISTPHNM  EQU   ISTAVT+24                                                00366000
ISTAPSEX EQU   ISTAVT+20                                                00367000
ISTVTTIK EQU   ISTAVT+18                                                00368000
AVTASID  EQU   ISTAVT+16                                                00369000
ISTAPSTA EQU   ISTAVT+12                                                00370000
ISTAS53  EQU   ISTAVT+8                                                 00371000
ISTAS49  EQU   ISTAVT+4                                                 00372000
ISTACVT  EQU   ISTAVT                                                   00373000
CONCRPLD EQU   CONDBFA+192                                              00374000
CONPPDBF EQU   CONDBFA+176                                              00375000
CONNPDBF EQU   CONDBFA+160                                              00376000
CONAPDBF EQU   CONDBFA+144                                              00377000
CONWPDBF EQU   CONDBFA+128                                              00378000
CONIODBF EQU   CONDBFA+112                                              00379000
CONUEDBF EQU   CONDBFA+96                                               00380000
CONVPDBF EQU   CONDBFA+80                                               00381000
CONVFDBF EQU   CONDBFA+64                                               00382000
CONLPDBF EQU   CONDBFA+48                                               00383000
CONLFDBF EQU   CONDBFA+32                                               00384000
CONSPDBF EQU   CONDBFA+16                                               00385000
CONSFDBF EQU   CONDBFA                                                  00386000
CONCRPLS EQU   CONSBFA+176                                              00387000
CONPPSBF EQU   CONSBFA+160                                              00388000
CONNPSBF EQU   CONSBFA+144                                              00389000
CONAPSBF EQU   CONSBFA+128                                              00390000
CONWPSBF EQU   CONSBFA+112                                              00391000
CONIOSBF EQU   CONSBFA+96                                               00392000
CONVPSBF EQU   CONSBFA+80                                               00393000
CONVFSBF EQU   CONSBFA+64                                               00394000
CONLPSBF EQU   CONSBFA+48                                               00395000
CONLFSBF EQU   CONSBFA+32                                               00396000
CONSPSBF EQU   CONSBFA+16                                               00397000
CONSFSBF EQU   CONSBFA                                                  00398000
CONECDET EQU   CONECBL+28                                               00399000
CONAPPLE EQU   CONECBL+24                                               00400000
CONGRECB EQU   CONECBL+20                                               00401000
CONIOECB EQU   CONECBL+16                                               00402000
CONCDRME EQU   CONECBL+12                                               00403000
CONTERM  EQU   CONECBL+8                                                00404000
CONTIMER EQU   CONECBL+4                                                00405000
CONDEACT EQU   CONECBL                                                  00406000
CONSRTEA EQU   CONSRTA                                                  00407000
CONDBFSA EQU   CONBUFA+192                                              00408000
CONSBFSA EQU   CONBUFA                                                  00409000
@NM00134 EQU   CONECBA                                                  00410000
CONTUNLA EQU   CONLDPA+240                                              00411000
CONFVRLA EQU   CONLDPA+200                                              00412000
CONFTTLA EQU   CONLDPA+160                                              00413000
CONFXXLA EQU   CONLDPA+120                                              00414000
CONFLDLA EQU   CONLDPA+80                                               00415000
CONFTRLA EQU   CONLDPA+40                                               00416000
CONFNSLA EQU   CONLDPA                                                  00417000
CONGRPRA EQU   CONRDTA+1628                                             00418000
CONPUNRA EQU   CONRDTA+1296                                             00419000
CONNETRA EQU   CONRDTA+1108                                             00420000
CONRVYRA EQU   CONRDTA+920                                              00421000
CONUSSRA EQU   CONRDTA+732                                              00422000
CONTRCRA EQU   CONRDTA+544                                              00423000
CONTOLRA EQU   CONRDTA+356                                              00424000
CONSCPRA EQU   CONRDTA+136                                              00425000
CONVTHRA EQU   CONRDTA                                                  00426000
CONTDYPA EQU   CONDYPA+32                                               00427000
CONCDYPA EQU   CONDYPA                                                  00428000
@NM00133 EQU   CONAREAS+50                                              00429000
CONDLRVL EQU   CONAREAS+48                                              00430000
CONUESBF EQU   CONAREAS+32                                              00431000
CONSTVAR EQU   CONSTAID+1                                               00432000
CONSTFIL EQU   CONSTAID                                                 00433000
CONBLKNO EQU   CONSCPID+2                                               00434000
CONFILL  EQU   CONSCPID+1                                               00435000
CONFCNL  EQU   CONSCPID                                                 00436000
CONUNITS EQU   CONAREAS+24                                              00437000
@NM00132 EQU   CONAREAS+23                                              00438000
CONGLBBH EQU   CONAREAS+22                                              00439000
CONLIST  EQU   CONAREAS+20                                              00440000
CONMAXPL EQU   CONAREAS+18                                              00441000
@NM00131 EQU   CONAREAS+17                                              00442000
@NM00130 EQU   CONBUFF+1                                                00443000
@NM00129 EQU   CONBUFF+1                                                00444000
@NM00128 EQU   CONBUFF+1                                                00445000
CONCRPL  EQU   CONBUFF+1                                                00446000
CONPPEX  EQU   CONBUFF+1                                                00447000
CONNPEX  EQU   CONBUFF+1                                                00448000
CONAPEX  EQU   CONBUFF+1                                                00449000
CONWPEX  EQU   CONBUFF+1                                                00450000
CONIOEX  EQU   CONBUFF                                                  00451000
CONUECB  EQU   CONBUFF                                                  00452000
CONVPEX  EQU   CONBUFF                                                  00453000
CONVFEX  EQU   CONBUFF                                                  00454000
CONLPEX  EQU   CONBUFF                                                  00455000
CONLFEX  EQU   CONBUFF                                                  00456000
CONSPEX  EQU   CONBUFF                                                  00457000
CONSFEX  EQU   CONBUFF                                                  00458000
CONACTV  EQU   CONSTAT                                                  00459000
CONVRYIN EQU   CONSTAT                                                  00460000
CONLODED EQU   CONSTAT                                                  00461000
CONDSOPN EQU   CONSTAT                                                  00462000
CONSTOR  EQU   CONSTAT                                                  00463000
CONHSTDF EQU   CONSTAT                                                  00464000
@NM00127 EQU   CONSTAT                                                  00465000
@NM00126 EQU   CONSTAT                                                  00466000
CONIOTR  EQU   CONOPTFL                                                 00467000
CONMODTR EQU   CONOPTFL                                                 00468000
CONBTUTR EQU   CONOPTFL                                                 00469000
CONBUFTR EQU   CONOPTFL                                                 00470000
@NM00125 EQU   CONOPTFL                                                 00471000
@NM00124 EQU   CONOPTFL                                                 00472000
@NM00123 EQU   CONOPTFL                                                 00473000
CONWRMST EQU   CONOPTFL                                                 00474000
@NM00122 EQU   CONDSFLG                                                 00475000
@NM00121 EQU   CONDSFLG                                                 00476000
CONSYLST EQU   CONDSFLG                                                 00477000
CONSYLIB EQU   CONDSFLG                                                 00478000
CONSYOBJ EQU   CONDSFLG                                                 00479000
@NM00120 EQU   CONDSFLG                                                 00480000
@NM00119 EQU   CONDSFLG                                                 00481000
@NM00118 EQU   CONDSFLG                                                 00482000
CONMODFY EQU   CONAREAS+11                                              00483000
CONDISPL EQU   CONAREAS+10                                              00484000
CONVARY  EQU   CONAREAS+9                                               00485000
@NM00117 EQU   CONHALT                                                  00486000
@NM00116 EQU   CONHALT                                                  00487000
@NM00115 EQU   CONHALT                                                  00488000
@NM00114 EQU   CONHALT                                                  00489000
@NM00113 EQU   CONHALT                                                  00490000
@NM00112 EQU   CONHALT                                                  00491000
CONHLTS  EQU   CONHALT                                                  00492000
CONHLTQ  EQU   CONHALT                                                  00493000
CONLAST  EQU   CONAREAS+7                                               00494000
@NM00111 EQU   CONAREAS+6                                               00495000
CONCID   EQU   CONAREAS+4                                               00496000
CONBUFSZ EQU   CONAREAS+2                                               00497000
@NM00110 EQU   CONAREAS+1                                               00498000
CONNSNEC EQU   CONFLG01                                                 00499000
CONFTPSA EQU   CONFLG01                                                 00500000
CONFTTA  EQU   CONFLG01                                                 00501000
CONFTNSA EQU   CONFLG01                                                 00502000
CONFTNAC EQU   CONFLG01                                                 00503000
CONFTEXS EQU   CONFLG01                                                 00504000
CONFTTMR EQU   CONFLG01                                                 00505000
CONFTSTM EQU   CONFLG01                                                 00506000
CONUSSTN EQU   ISTCONFT+228                                             00507000
CONUILAA EQU   CONSRTAA                                                 00508000
CONDCDRM EQU   ISTCONFT+132                                             00509000
CONHCDRM EQU   ISTCONFT+128                                             00510000
CONINCTO EQU   ISTCONFT+124                                             00511000
CONCDCRT EQU   ISTCONFT+120                                             00512000
CONSDMLC EQU   ISTCONFT+112                                             00513000
CONSDECB EQU   ISTCONFT+108                                             00514000
CONCSCB  EQU   ISTCONFT+104                                             00515000
CONTPNCS EQU   ISTCONFT+96                                              00516000
CONDCBBA EQU   ISTCONFT+92                                              00517000
CONDCBLA EQU   ISTCONFT+88                                              00518000
CONDCBOA EQU   ISTCONFT+84                                              00519000
CONLDPRM EQU   ISTCONFT+80                                              00520000
CONRDBUF EQU   ISTCONFT+76                                              00521000
CONSTCIB EQU   ISTCONFT+72                                              00522000
CONENDLA EQU   ISTCONFT+68                                              00523000
CONVARLA EQU   ISTCONFT+64                                              00524000
CONMODLA EQU   ISTCONFT+60                                              00525000
CONHLTLA EQU   ISTCONFT+56                                              00526000
CONNCSLA EQU   ISTCONFT+52                                              00527000
CONDISLA EQU   ISTCONFT+48                                              00528000
CONCIBAD EQU   ISTCONFT+44                                              00529000
CONACB   EQU   ISTCONFT+40                                              00530000
CONFBPNM EQU   ISTCONFT+32                                              00531000
CONDMNM  EQU   ISTCONFT+24                                              00532000
CONAPSNM EQU   ISTCONFT+16                                              00533000
CONAPINM EQU   ISTCONFT+8                                               00534000
CONCONFG EQU   ISTCONFT                                                 00535000
RCDRMEND EQU   ISTRCDRM+220                                             00536000
@NM00109 EQU   ISTRCDRM+218                                             00537000
RCDRMSEQ EQU   ISTRCDRM+216                                             00538000
@NM00108 EQU   ISTRCDRM+213                                             00539000
RCDRMSC  EQU   ISTRCDRM+212                                             00540000
@NM00107 EQU   RCDRMFGS+3                                               00541000
@NM00106 EQU   RCDRMFGS+3                                               00542000
@NM00105 EQU   RCDRMFGS+3                                               00543000
@NM00104 EQU   RCDRMFGS+3                                               00544000
@NM00103 EQU   RCDRMFGS+3                                               00545000
@NM00102 EQU   RCDRMFGS+3                                               00546000
@NM00101 EQU   RCDRMFGS+3                                               00547000
RCDRMCD2 EQU   RCDRMFGS+3                                               00548000
RCDRCDRS EQU   RCDRMFGS+2                                               00549000
RCDRMDYN EQU   RCDRMFGS+2                                               00550000
RCDRMRID EQU   RCDRMFGS+2                                               00551000
RCDRMLOQ EQU   RCDRMFGS+2                                               00552000
RCDRMNMP EQU   RCDRMFGS+2                                               00553000
RCDRMPS  EQU   RCDRMFGS+2                                               00554000
RCDRMURC EQU   RCDRMFGS+2                                               00555000
RCDRMNAP EQU   RCDRMFGS+2                                               00556000
RCDRMVL  EQU   RCDRMFGS+1                                               00557000
RCDRMSPC EQU   RCDRMFGS+1                                               00558000
RCDRMINC EQU   RCDRMFGS+1                                               00559000
RCDRMLPS EQU   RCDRMFGS+1                                               00560000
RCDRMTCR EQU   RCDRMFGS+1                                               00561000
RCDRMDTC EQU   RCDRMFGS+1                                               00562000
RCDRMDT  EQU   RCDRMFGS+1                                               00563000
RCDRMCLR EQU   RCDRMFGS+1                                               00564000
RCDRMCLC EQU   RCDRMFGS                                                 00565000
RCDRMDCD EQU   RCDRMFGS                                                 00566000
RCDRMOVR EQU   RCDRMFGS                                                 00567000
RCDRMSDT EQU   RCDRMFGS                                                 00568000
RCDRMACT EQU   RCDRMFGS                                                 00569000
RCDRMSCA EQU   RCDRMFGS                                                 00570000
RCDRMPRI EQU   RCDRMFGS                                                 00571000
RCDRMHST EQU   RCDRMFGS                                                 00572000
RCDRMRP  EQU   ISTRCDRM+204                                             00573000
RCDRMLRP EQU   RCDRMRPQ+4                                               00574000
RCDRMFRP EQU   RCDRMRPQ                                                 00575000
RCDRMARP EQU   ISTRCDRM+192                                             00576000
RCDRMPDT EQU   RCDRMPDN                                                 00577000
RCDRMPR  EQU   ISTRCDRM                                                 00578000
RRNEND   EQU   ISTRRN+332                                               00579000
RRNLDRID EQU   ISTRRN+324                                               00580000
RRNCLDST EQU   ISTRRN+316                                               00581000
RRNGDSTA EQU   ISTRRN+308                                               00582000
RRNGLSTA EQU   ISTRRN+300                                               00583000
RRNLDCAT EQU   RRNLDFSM                                                 00584000
RRNVRID  EQU   ISTRRN+296                                               00585000
RRNPUXTN EQU   ISTRRN+292                                               00586000
RRNLUCT  EQU   ISTRRN+290                                               00587000
RRNPUCT  EQU   ISTRRN+288                                               00588000
RRNLPPTR EQU   ISTRRN+284                                               00589000
RRNTPPTR EQU   ISTRRN+280                                               00590000
RRNFNAEQ EQU   ISTRRN+276                                               00591000
@NM00100 EQU   ISTRRN+264                                               00592000
@NM00099 EQU   ISTRRN+260                                               00593000
RRNNMNCP EQU   ISTRRN+252                                               00594000
@NM00098 EQU   ISTRRN+249                                               00595000
RRNAMNUM EQU   ISTRRN+248                                               00596000
RRNAMLST EQU   ISTRRN+244                                               00597000
RRNCDPWE EQU   ISTRRN+240                                               00598000
RRNPUBI  EQU   RRNNMDPD+6                                               00599000
RRNDPLUB EQU   RRNNMDPD                                                 00600000
RRNINBFR EQU   ISTRRN+231                                               00601000
RRNDEFLV EQU   ISTRRN+230                                               00602000
RRNRNCUA EQU   ISTRRN+227                                               00603000
RRNRDCUA EQU   ISTRRN+224                                               00604000
RRNNCPNM EQU   ISTRRN+217                                               00605000
RRNCTPCC EQU   ISTRRN+216                                               00606000
RRNCPLUB EQU   ISTRRN+210                                               00607000
RRNDELAY EQU   ISTRRN+208                                               00608000
RRNMODL  EQU   RRNLVL+2                                                 00609000
RRNRELL  EQU   RRNLVL                                                   00610000
@NM00097 EQU   RRNBITAN+2                                               00611000
@NM00096 EQU   RRNBITAN+2                                               00612000
RRNAMLDA EQU   RRNBITAN+2                                               00613000
RRNLODNO EQU   RRNBITAN+2                                               00614000
RRNLODYS EQU   RRNBITAN+2                                               00615000
RRNRBMDL EQU   RRNBITAN+2                                               00616000
RRNALLOC EQU   RRNBITAN+2                                               00617000
RRNACQRD EQU   RRNBITAN+2                                               00618000
RRNREMPO EQU   RRNBITAN+1                                               00619000
RRNRBBUP EQU   RRNBITAN+1                                               00620000
RRNRBCT2 EQU   RRNBITAN+1                                               00621000
RRNRBCT1 EQU   RRNBITAN+1                                               00622000
RRNRBSEC EQU   RRNBITAN+1                                               00623000
RRNRBCCT EQU   RRNBITAN+1                                               00624000
RRNRBCCL EQU   RRNBITAN+1                                               00625000
RRNRBREM EQU   RRNBITAN+1                                               00626000
RRNRSYN  EQU   RRNBITAN                                                 00627000
RRNRAPEP EQU   RRNBITAN                                                 00628000
RRNRANCP EQU   RRNBITAN                                                 00629000
RRNRAOLT EQU   RRNBITAN                                                 00630000
RRNRASYN EQU   RRNBITAN                                                 00631000
RRNRADMP EQU   RRNBITAN                                                 00632000
RRNRAIPL EQU   RRNBITAN                                                 00633000
RRNRASHT EQU   RRNBITAN                                                 00634000
RRNHSTID EQU   ISTRRN+200                                               00635000
RRNHBUFS EQU   ISTRRN+198                                               00636000
RRNHLENT EQU   RRNHPRE+1                                                00637000
RRNHLENH EQU   RRNHPRE                                                  00638000
RRNNODCT EQU   ISTRRN+194                                               00639000
RRNEPADR EQU   ISTRRN+192                                               00640000
RRNCTENT EQU   ISTRRN+190                                               00641000
RRNCTECM EQU   ISTRRN+188                                               00642000
RRNCTEIN EQU   ISTRRN+186                                               00643000
RRNCTETR EQU   ISTRRN+184                                               00644000
RRNCTECL EQU   ISTRRN+182                                               00645000
RRNCTELI EQU   ISTRRN+180                                               00646000
RRNCTEGP EQU   ISTRRN+178                                               00647000
RRNCTBHS EQU   ISTRRN+176                                               00648000
RRNTABCT EQU   ISTRRN+172                                               00649000
RRNLASTE EQU   ISTRRN+168                                               00650000
RRNNCSPL EQU   ISTRRN+164                                               00651000
RRNRPLPT EQU   ISTRRN+160                                               00652000
RRNMSIZE EQU   ISTRRN+156                                               00653000
RRNFLUX  EQU   ISTRRN+152                                               00654000
RRNBHSET EQU   ISTRRN+148                                               00655000
RRNRINQP EQU   ISTRRN+144                                               00656000
RRNGRPA  EQU   ISTRRN+140                                               00657000
RRNLUBA  EQU   RRNUCBAD+1                                               00658000
RRNCHQI  EQU   RRNUCBAD                                                 00659000
@NM00095 EQU   RRNFLAG                                                  00660000
RRNACBAQ EQU   RRNFLAG                                                  00661000
RRNCHCON EQU   RRNFLAG                                                  00662000
RRNVFYLM EQU   RRNFLAG                                                  00663000
RRNLDET  EQU   RRNFLAG                                                  00664000
RRNRIMIP EQU   RRNFLAG                                                  00665000
RRNLCDIE EQU   RRNFLAG                                                  00666000
RRNLCSIP EQU   RRNFLAG                                                  00667000
RRNPRE   EQU   ISTRRN                                                   00668000
@NM00094 EQU   ISTECB+1                                                 00669000
@NM00093 EQU   @NM00091                                                 00670000
ECBCOMP  EQU   @NM00091                                                 00671000
@NM00092 EQU   @NM00091                                                 00672000
SCHLONG  EQU   ISTSCHDR+4                                               00673000
@NM00090 EQU   SCHCHAR+3                                                00674000
SCHKEY   EQU   SCHCHAR+2                                                00675000
@NM00089 EQU   SCHCHAR+1                                                00676000
@NM00088 EQU   SCHCHAR+1                                                00677000
@NM00087 EQU   SCHCHAR+1                                                00678000
@NM00086 EQU   SCHCHAR+1                                                00679000
@NM00085 EQU   SCHCHAR+1                                                00680000
@NM00084 EQU   SCHCHAR+1                                                00681000
SCHCSQAF EQU   SCHCHAR+1                                                00682000
SCHPGFR  EQU   SCHCHAR+1                                                00683000
SCHSBPL  EQU   SCHCHAR                                                  00684000
SMHLONG  EQU   ISTSMHDR+12                                              00685000
@NM00083 EQU   SMHCHAR+3                                                00686000
SMHKEY   EQU   SMHCHAR+2                                                00687000
@NM00082 EQU   SMHCHAR+1                                                00688000
@NM00081 EQU   SMHCHAR+1                                                00689000
@NM00080 EQU   SMHCHAR+1                                                00690000
@NM00079 EQU   SMHCHAR+1                                                00691000
@NM00078 EQU   SMHCHAR+1                                                00692000
@NM00077 EQU   SMHCHAR+1                                                00693000
SMHCSQAF EQU   SMHCHAR+1                                                00694000
SMHPGFR  EQU   SMHCHAR+1                                                00695000
SMHSBPL  EQU   SMHCHAR                                                  00696000
SMHCHTBF EQU   ISTSMHDR+4                                               00697000
SMHCHOBT EQU   ISTSMHDR                                                 00698000
RGPEND   EQU   ISTRGP+96                                                00699000
@NM00076 EQU   ISTRGP+95                                                00700000
@NM00075 EQU   RGPBITAN                                                 00701000
@NM00074 EQU   RGPBITAN                                                 00702000
@NM00073 EQU   RGPBITAN                                                 00703000
RGPX21SW EQU   RGPBITAN                                                 00704000
RGPASDLC EQU   RGPBITAN                                                 00705000
RGPABSC  EQU   RGPBITAN                                                 00706000
RGPASS   EQU   RGPBITAN                                                 00707000
RGPADIL  EQU   RGPBITAN                                                 00708000
@NM00072 EQU   ISTRGP+92                                                00709000
@NM00071 EQU   ISTRGP+90                                                00710000
@NM00070 EQU   ISTRGP+88                                                00711000
@NM00069 EQU   ISTRGP+86                                                00712000
@NM00068 EQU   ISTRGP+84                                                00713000
RGPPRE   EQU   ISTRGP                                                   00714000
UILEND   EQU   ISTUILTE+8                                               00715000
UILNAME  EQU   ISTUILTE                                                 00716000
LDPRSV04 EQU   ISTLDPRM+37                                              00717000
LDPRCNID EQU   ISTLDPRM+28                                              00718000
LDPTCEP  EQU   ISTLDPRM+24                                              00719000
LDPRSV02 EQU   ISTLDPRM+22                                              00720000
LDPRSV01 EQU   LDPFB2                                                   00721000
LDPTPPST EQU   LDPFB2                                                   00722000
LDPLOAD  EQU   LDPFB2                                                   00723000
LDPACTIF EQU   LDPFB2                                                   00724000
LDPATACH EQU   LDPFB2                                                   00725000
LDPFLAST EQU   LDPFB2                                                   00726000
LDPRSV03 EQU   LDPFG                                                    00727000
LDPRSYSD EQU   LDPFG                                                    00728000
LDPPB    EQU   LDPFG                                                    00729000
LDPFX    EQU   LDPFG                                                    00730000
LDPDCBA  EQU   ISTLDPRM+16                                              00731000
LDPPDS   EQU   ISTLDPRM+8                                               00732000
LDPMBR   EQU   ISTLDPRM                                                 00733000
RAPEND   EQU   ISTRAP+188                                               00734000
RAPMAXPV EQU   ISTRAP+184                                               00735000
RAPAPPWD EQU   ISTRAP+176                                               00736000
RAPACBN  EQU   ISTRAP+168                                               00737000
@NM00067 EQU   RAPBITAN+2                                               00738000
@NM00066 EQU   RAPBITAN+2                                               00739000
RAPSRTLN EQU   RAPBITAN+2                                               00740000
RAPSONSC EQU   RAPBITAN+2                                               00741000
RAPVFRR  EQU   RAPBITAN+2                                               00742000
RAPSRBX  EQU   RAPBITAN+2                                               00743000
@NM00065 EQU   RAPBITAN+2                                               00744000
RAPCSMA  EQU   RAPBITAN+2                                               00745000
RAPTSO   EQU   RAPBITAN+1                                               00746000
RAPAUTHE EQU   RAPBITAN+1                                               00747000
RAPANVPC EQU   RAPBITAN+1                                               00748000
RAPASPO  EQU   RAPBITAN+1                                               00749000
RAPAPPO  EQU   RAPBITAN+1                                               00750000
RAPAACQ  EQU   RAPBITAN+1                                               00751000
RAPAPRMT EQU   RAPBITAN+1                                               00752000
RAPAPASS EQU   RAPBITAN+1                                               00753000
RAPABLCK EQU   RAPBITAN                                                 00754000
RAPALLF  EQU   RAPBITAN                                                 00755000
RAPPARS  EQU   RAPBITAN                                                 00756000
RAPLSIZ  EQU   RAPBITAN                                                 00757000
RAPATLGN EQU   RAPBITAN                                                 00758000
RAPASLGI EQU   RAPBITAN                                                 00759000
RAPAQUI  EQU   RAPBITAN                                                 00760000
RAPABLGN EQU   RAPBITAN                                                 00761000
RAPBFACT EQU   ISTRAP+164                                               00762000
RAPBNA   EQU   ISTRAP+162                                               00763000
RAPEAS   EQU   ISTRAP+160                                               00764000
RAPACDEB EQU   ISTRAP+156                                               00765000
RAPACBA  EQU   ISTRAP+152                                               00766000
RAPENTAD EQU   ISTRAP+148                                               00767000
@NM00064 EQU   ISTRAP+146                                               00768000
RAPTRPRE EQU   ISTRAP+144                                               00769000
RAPPRE   EQU   ISTRAP                                                   00770000
RDTEND   EQU   ISTRDT+136                                               00771000
RDTVSRPL EQU   RDTCRIA+16                                               00772000
RDTCRSPW EQU   RDTCRIA+8                                                00773000
RDTCRSDS EQU   RDTCRIA                                                  00774000
@NM00063 EQU   ISTRDT+114                                               00775000
@NM00062 EQU   RDTBITAN                                                 00776000
@NM00061 EQU   RDTBITAN                                                 00777000
@NM00060 EQU   RDTBITAN                                                 00778000
RDTSSFLG EQU   RDTBITAN                                                 00779000
RDTHCDRM EQU   RDTBITAN                                                 00780000
RDTBHSET EQU   RDTBITAN                                                 00781000
RDTCDCTL EQU   RDTBITAN                                                 00782000
RDTCTPGD EQU   RDTBITAN                                                 00783000
RDTLGCT  EQU   ISTRDT+112                                               00784000
RDTNODID EQU   ISTRDT+111                                               00785000
RDTMAXID EQU   ISTRDT+110                                               00786000
@NM00059 EQU   ISTRDT+108                                               00787000
RDTVYRPH EQU   ISTRDT+104                                               00788000
RDTBACK  EQU   ISTRDT+100                                               00789000
RDTFORW  EQU   ISTRDT+96                                                00790000
RDTNAMTB EQU   ISTRDT+92                                                00791000
RDTENTAD EQU   ISTRDT+88                                                00792000
RDTLEN   EQU   RDTPLEN+1                                                00793000
RDTPRICA EQU   RDTPRIOR                                                 00794000
RDTPRILS EQU   RDTPRIOR                                                 00795000
RDTPRISW EQU   RDTPRIOR                                                 00796000
RDTPRIRN EQU   RDTPRIOR                                                 00797000
RDTPRILC EQU   RDTPRIOR                                                 00798000
RDTPRIAP EQU   RDTPRIOR                                                 00799000
RDTCDRSC EQU   RDTPRIOR                                                 00800000
RDTCDRM  EQU   RDTPRIOR                                                 00801000
RDTPRE   EQU   ISTRDT                                                   00802000
RCPEND   EQU   ISTRCPRE+144                                             00803000
RCPLGMOD EQU   ISTRCPRE+136                                             00804000
RCPDLGMD EQU   ISTRCPRE+128                                             00805000
RCPLGNAP EQU   ISTRCPRE+120                                             00806000
RCPQCNT  EQU   ISTRCPRE+118                                             00807000
@NM00058 EQU   ISTRCPRE+117                                             00808000
RCPOSAIP EQU   RCPBITAN                                                 00809000
RCPVLMSG EQU   RCPBITAN                                                 00810000
RCPCSM   EQU   RCPBITAN                                                 00811000
RCPALLOC EQU   RCPBITAN                                                 00812000
RCPSEC   EQU   RCPBITAN                                                 00813000
RCPSESSC EQU   RCPSESSM                                                 00814000
RCPSESPR EQU   RCPSESSM                                                 00815000
RCPSSCFM EQU   ISTRCPRE+114                                             00816000
RCPSTCAP EQU   RCPCYSET                                                 00817000
RCPSTRQD EQU   RCPCYSET                                                 00818000
RCPMDCAP EQU   RCPCYMOD                                                 00819000
RCPMDRQD EQU   RCPCYMOD                                                 00820000
RCPPRIM  EQU   RCPPMODE                                                 00821000
RCPCROSS EQU   RCPPMODE                                                 00822000
RCPRRECD EQU   RCPPMODE                                                 00823000
RCPRBASC EQU   RCPPMODE                                                 00824000
RCPBFLIM EQU   ISTRCPRE+112                                             00825000
RCPNCPPM EQU   RCPNCPPC+1                                               00826000
RCPNCPPN EQU   RCPNCPPC                                                 00827000
RCPPACEM EQU   RCPPACE+1                                                00828000
RCPPACEN EQU   RCPPACE                                                  00829000
RCPBHSI2 EQU   ISTRCPRE+107                                             00830000
RCPBHSI1 EQU   ISTRCPRE+106                                             00831000
RCPSESLM EQU   ISTRCPRE+104                                             00832000
RCPSESCT EQU   ISTRCPRE+102                                             00833000
RCPINTTI EQU   ISTRCPRE+100                                             00834000
RCPUSSTI EQU   ISTRCPRE+98                                              00835000
RCPMODTI EQU   ISTRCPRE+96                                              00836000
RCPLNAPA EQU   ISTRCPRE+92                                              00837000
RCPSIBS  EQU   RCPSARRY+4                                               00838000
RCPSIBP  EQU   RCPSARRY                                                 00839000
RCPPRE   EQU   ISTRCPRE                                                 00840000
RPREND   EQU   ISTRPRE+84                                               00841000
RPRDEVCH EQU   ISTRPRE+76                                               00842000
RPRCONID EQU   ISTRPRE+67                                               00843000
@NM00057 EQU   RPRFLAGS                                                 00844000
RPRDYNAM EQU   RPRFLAGS                                                 00845000
RPRNOACT EQU   RPRFLAGS                                                 00846000
RPRDAFAD EQU   RPRBITAN+4                                               00847000
RPRENTVA EQU   RPRBITAN+4                                               00848000
RPRDUMMY EQU   RPRBITAN+4                                               00849000
RPRIMPCH EQU   RPRBITAN+4                                               00850000
RPRIMPAC EQU   RPRBITAN+4                                               00851000
RPRNEO   EQU   RPRBITAN+4                                               00852000
RPRRNAA  EQU   RPRBITAN+4                                               00853000
RPRDRADD EQU   RPRBITAN+4                                               00854000
RPRFADD  EQU   RPRBITAN+3                                               00855000
RPRINTST EQU   RPRBITAN+3                                               00856000
RPRCLVPD EQU   RPRBITAN+3                                               00857000
RPRSHAD  EQU   RPRBITAN+3                                               00858000
RPRGIST  EQU   RPRBITAN+3                                               00859000
RPRRBISA EQU   RPRBITAN+3                                               00860000
RPRENTVT EQU   RPRBITAN+3                                               00861000
RPRDINOP EQU   RPRBITAN+3                                               00862000
RPRDINUS EQU   RPRBITAN+2                                               00863000
RPRCRCPT EQU   RPRBITAN+2                                               00864000
RPRNOSRT EQU   RPRBITAN+2                                               00865000
RPRDOM   EQU   RPRBITAN+2                                               00866000
RPRNOUSE EQU   RPRBITAN+2                                               00867000
RPRNOSNA EQU   RPRBITAN+2                                               00868000
RPRCLNUP EQU   RPRBITAN+2                                               00869000
RPRCONLD EQU   RPRBITAN+2                                               00870000
RPRCONP  EQU   RPRBITAN+1                                               00871000
RPRACTP  EQU   RPRBITAN+1                                               00872000
RPRINTIO EQU   RPRBITAN+1                                               00873000
RPRCONCT EQU   RPRBITAN+1                                               00874000
RPRHLVPD EQU   RPRBITAN+1                                               00875000
RPRHLACT EQU   RPRBITAN+1                                               00876000
RPRONLIN EQU   RPRBITAN+1                                               00877000
RPRRINOP EQU   RPRBITAN+1                                               00878000
RPRAOPN  EQU   RPRBITAN                                                 00879000
RPRENTVH EQU   RPRBITAN                                                 00880000
RPRLIVE  EQU   RPRBITAN                                                 00881000
RPRENTED EQU   RPRBITAN                                                 00882000
RPRLTASN EQU   RPRBITAN                                                 00883000
RPRENTIO EQU   RPRBITAN                                                 00884000
RPRENTBF EQU   RPRBITAN                                                 00885000
RPRINV   EQU   RPRBITAN                                                 00886000
RPRDEFLV EQU   RPRSTATE+4                                               00887000
RPRDESS1 EQU   RPRDESST                                                 00888000
RPRCURS1 EQU   RPRCURST                                                 00889000
RPRCMDWE EQU   ISTRPRE+52                                               00890000
RPRTNTQP EQU   ISTRPRE+48                                               00891000
RPRNSNEA EQU   ISTRPRE+44                                               00892000
RPRNCBA  EQU   ISTRPRE+40                                               00893000
RPRPELEN EQU   ISTRPRE+36                                               00894000
RPRELEN  EQU   ISTRPRE+32                                               00895000
RPRALPAD EQU   ISTRPRE+28                                               00896000
RPRENTAD EQU   ISTRPRE+24                                               00897000
RPRREQCT EQU   ISTRPRE+22                                               00898000
RPRINDEX EQU   ISTRPRE+20                                               00899000
RPRDAF   EQU   RPRDAFID+2                                               00900000
@NM00056 EQU   RPRDAFID                                                 00901000
@NM00055 EQU   ISTRPRE+15                                               00902000
RPRHDTYP EQU   ISTRPRE+14                                               00903000
RPRENTRY EQU   ISTRPRE+13                                               00904000
RPRNAME  EQU   RPRSRTHD                                                 00905000
DEVRSV01 EQU   ISTDEVCH+7                                               00906000
DEVAUXTP EQU   ISTDEVCH+6                                               00907000
DEVADVFE EQU   DEVMODE                                                  00908000
@NM00054 EQU   DEVMODE                                                  00909000
DEVBASIC EQU   DEVMODE                                                  00910000
DEVREC   EQU   DEVMODE                                                  00911000
DEVPHYSA EQU   ISTDEVCH+4                                               00912000
DEVCSLPN EQU   DEVCHAR3                                                 00913000
DEVCSTCL EQU   DEVCHAR3                                                 00914000
DEVCCHEK EQU   DEVCHAR3                                                 00915000
DEVCATTN EQU   DEVCHAR3                                                 00916000
DEVCSWL  EQU   DEVFCCTL                                                 00917000
DEVCRVB  EQU   DEVFCCTL                                                 00918000
DEVCSSL  EQU   DEVFCCTL                                                 00919000
DEVCBSC  EQU   DEVFCCTL                                                 00920000
DEVMCODE EQU   ISTDEVCH+2                                               00921000
DEVCHAR2 EQU   DEVTCODE                                                 00922000
DEVSPOLL EQU   DEVCHAR                                                  00923000
DEVCCTL  EQU   DEVCHAR                                                  00924000
DEVNNSPT EQU   DEVCHAR                                                  00925000
DEVSPS   EQU   DEVCHAR                                                  00926000
DEVSUBND EQU   DEVCHAR                                                  00927000
DEVCONVR EQU   DEVCHAR                                                  00928000
DEVOTPUT EQU   DEVCHAR                                                  00929000
DEVINPUT EQU   DEVCHAR                                                  00930000
SRTTYPE  EQU   ISTSRT+12                                                00931000
SRTSPECE EQU   SRTSRTE                                                  00932000
SRTSYMNM EQU   ISTSRT                                                   00933000
ATCAOS   EQU   ISTATCVT+2184                                            00934000
@NM00053 EQU   ISTATCVT+1928                                            00935000
ATCITECB EQU   ISTATCVT+1924                                            00936000
ATCINCTV EQU   ISTATCVT+1920                                            00937000
@NM00052 EQU   ISTATCVT+1918                                            00938000
ATCSAF   EQU   ISTATCVT+1916                                            00939000
ATCAPCSX EQU   ISTATCVT+1912                                            00940000
ATCTSC3I EQU   ISTATCVT+1908                                            00941000
ATCHWCSA EQU   ISTATCVT+1904                                            00942000
ATCAPCRM EQU   ISTATCVT+1900                                            00943000
ATCAPCFR EQU   ISTATCVT+1896                                            00944000
ATCCACSA EQU   ISTATCVT+1892                                            00945000
ATCMXCSA EQU   ISTATCVT+1888                                            00946000
ATCTPMPB EQU   ISTATCVT+1856                                            00947000
ATCRPLAC EQU   ATCRPLCN+2                                               00948000
ATCRPLRC EQU   ATCRPLCN                                                 00949000
ATCCRPLQ EQU   ATCCRPL                                                  00950000
ATCCRAAC EQU   ATCCRACN+2                                               00951000
ATCCRARC EQU   ATCCRACN                                                 00952000
ATCCRAQ  EQU   ATCCRA                                                   00953000
ATCITSAV EQU   ISTATCVT+1836                                            00954000
ATCVIOPM EQU   ISTATCVT+1832                                            00955000
ATCTPMMI EQU   ISTATCVT+1828                                            00956000
ATCPXSRB EQU   ISTATCVT+1824                                            00957000
ATCRPLCT EQU   ISTATCVT+1822                                            00958000
ATCCRACT EQU   ISTATCVT+1820                                            00959000
ATCSRBCT EQU   ISTATCVT+1818                                            00960000
ATCSTNSM EQU   ISTATCVT+1817                                            00961000
@NM00051 EQU   @NM00050                                                 00962000
ATCNOSTR EQU   @NM00050                                                 00963000
ATCVTMAB EQU   @NM00050                                                 00964000
ATCTPCP1 EQU   ISTATCVT+1812                                            00965000
ATCTPCP0 EQU   ISTATCVT+1808                                            00966000
ATCZR01  EQU   ISTATCVT+1804                                            00967000
ATCASCB  EQU   ISTATCVT+1800                                            00968000
ATCMPSTQ EQU   ISTATCVT+1796                                            00969000
ATCOCCSM EQU   ISTATCVT+1792                                            00970000
ATCPSTA  EQU   ISTATCVT+1788                                            00971000
@NM00049 EQU   ATCVTFLG                                                 00972000
ATCVTACT EQU   ATCVTFLG                                                 00973000
@NM00048 EQU   ISTATCVT+1732                                            00974000
ATCTRMWA EQU   ISTATCVT+1728                                            00975000
ATCCSCBG EQU   ATCCSCB                                                  00976000
@NM00047 EQU   ISTATCVT+1723                                            00977000
ATCSNUF  EQU   ATCENFLG                                                 00978000
ATCOPKL  EQU   ATCENFLG                                                 00979000
ATCABEN  EQU   ATCENFLG                                                 00980000
ATCSRDN  EQU   ATCENFLG                                                 00981000
ATCDLDN  EQU   ATCENFLG                                                 00982000
ATCACTRM EQU   ISTATCVT+1720                                            00983000
ATCSMABF EQU   ISTATCVT+1716                                            00984000
ATCSMAPR EQU   ISTATCVT+1712                                            00985000
ATCSMAID EQU   ISTATCVT+1708                                            00986000
ATCSMARA EQU   ISTATCVT+1704                                            00987000
ATCCACXA EQU   ISTATCVT+1700                                            00988000
ATCATA10 EQU   ISTATCVT+1696                                            00989000
ATCHLTCB EQU   ISTATCVT+1692                                            00990000
ATCCCOOC EQU   ISTATCVT+1688                                            00991000
ATCAIWT  EQU   ISTATCVT+1684                                            00992000
ATCOROBT EQU   ISTATCVT+1680                                            00993000
ATCPXCRA EQU   ISTATCVT+1676                                            00994000
ATCGSRBF EQU   ATCGSRBG                                                 00995000
ATCTSCPC EQU   ISTATCVT+1668                                            00996000
ATCCDTCB EQU   ISTATCVT+1664                                            00997000
ATCORFRL EQU   ISTATCVT+1660                                            00998000
ATCORFPX EQU   ISTATCVT+1656                                            00999000
ATCORFMG EQU   ISTATCVT+1652                                            01000000
ATCSMBQ  EQU   ISTATCVT+1648                                            01001000
ATCINFDD EQU   ISTATCVT+1644                                            01002000
@NM00046 EQU   ATCDAPVT+22                                              01003000
ATCDAPDG EQU   ATCDAPVT+20                                              01004000
ATCDXCEA EQU   ATCDAPVT+16                                              01005000
ATCDCEA  EQU   ATCDAPVT+12                                              01006000
ATCDPCIA EQU   ATCDAPVT+8                                               01007000
ATCDSIOA EQU   ATCDAPVT+4                                               01008000
ATCDEOEA EQU   ATCDAPVT                                                 01009000
ATCZLAEA EQU   ATCLDAPP+16                                              01010000
ATCZLCEA EQU   ATCLDAPP+12                                              01011000
ATCZLPCI EQU   ATCLDAPP+8                                               01012000
ATCSMFRR EQU   ATCLDAPP+4                                               01013000
ATCCDTID EQU   ATCLDAPP                                                 01014000
ATCTRMPB EQU   ISTATCVT+1568                                            01015000
ATCORQG  EQU   ATCORSRB                                                 01016000
ATCORTBF EQU   ATCSQAFR                                                 01017000
@NM00045 EQU   ISTATCVT+1560                                            01018000
@NM00044 EQU   ISTATCVT+1556                                            01019000
ATCTSCLR EQU   ISTATCVT+1552                                            01020000
ATCTSCX5 EQU   ATCXCNCB+4                                               01021000
ATCTSCXT EQU   ATCXCNCB                                                 01022000
ATCTSCXB EQU   ISTATCVT+1540                                            01023000
ATCTSCXS EQU   ISTATCVT+1536                                            01024000
ATCTSCPD EQU   ISTATCVT+1532                                            01025000
ATCCDCNE EQU   ISTATCVT+1528                                            01026000
@NM00043 EQU   ISTATCVT+1526                                            01027000
ATCHASHN EQU   ISTATCVT+1524                                            01028000
ATCNOST  EQU   ISTATCVT+1520                                            01029000
ATCSMMWA EQU   ISTATCVT+1516                                            01030000
ATCSDCFR EQU   ISTATCVT+1512                                            01031000
ATCTSCRA EQU   ISTATCVT+1508                                            01032000
ATCSOCNT EQU   ISTATCVT+1504                                            01033000
ATCSOTHR EQU   ISTATCVT+1502                                            01034000
ATCSOPR2 EQU   ISTATCVT+1501                                            01035000
ATCSOPR1 EQU   ISTATCVT+1500                                            01036000
ATCAPCAT EQU   ISTATCVT+1496                                            01037000
ATCTSCWU EQU   ISTATCVT+1492                                            01038000
ATCMWRDT EQU   ISTATCVT+1488                                            01039000
ATCSTCK  EQU   ISTATCVT+1480                                            01040000
ATCWUPAB EQU   ATCWUDYP+16                                              01041000
@NM00042 EQU   ATCWUDYP                                                 01042000
ATCLKCNT EQU   ATCLKSWP+4                                               01043000
ATCCLOCK EQU   ATCLKSWP                                                 01044000
ATCNCBQ  EQU   ISTATCVT+1436                                            01045000
ATCPUCWC EQU   ISTATCVT+1432                                            01046000
ATCTSCQV EQU   ISTATCVT+1428                                            01047000
ATCTSCQU EQU   ISTATCVT+1424                                            01048000
ATCTSCQM EQU   ISTATCVT+1420                                            01049000
ATCTSCQF EQU   ISTATCVT+1416                                            01050000
ATCAPCVR EQU   ISTATCVT+1412                                            01051000
ATCHSQLK EQU   ISTATCVT+1408                                            01052000
ATCICIDM EQU   ISTATCVT+1406                                            01053000
ATCYRANG EQU   ISTATCVT+1405                                            01054000
ATCDRNUM EQU   ISTATCVT+1404                                            01055000
ATCSACNT EQU   ISTATCVT+1400                                            01056000
ATCTSCFA EQU   ISTATCVT+1396                                            01057000
ATCCDCVR EQU   ISTATCVT+1392                                            01058000
ATCCDCRI EQU   ISTATCVT+1388                                            01059000
ATCCDCRT EQU   ISTATCVT+1384                                            01060000
ATCVRNDX EQU   ISTATCVT+1380                                            01061000
@NM00041 EQU   ISTATCVT+1376                                            01062000
ATCPSTLK EQU   ISTATCVT+1372                                            01063000
ATCOCAOA EQU   ISTATCVT+1368                                            01064000
ATCPUCEF EQU   ISTATCVT+1364                                            01065000
ATCPUCBM EQU   ISTATCVT+1360                                            01066000
ATCAPCES EQU   ISTATCVT+1356                                            01067000
ATCAPCPC EQU   ISTATCVT+1352                                            01068000
ATCAPCTE EQU   ISTATCVT+1348                                            01069000
ATCAPCIN EQU   ISTATCVT+1344                                            01070000
ATCAPCPD EQU   ISTATCVT+1340                                            01071000
ATCAPCAD EQU   ISTATCVT+1336                                            01072000
ATCAPCSD EQU   ISTATCVT+1332                                            01073000
ATCAPCIE EQU   ISTATCVT+1328                                            01074000
ATCAPCUE EQU   ISTATCVT+1324                                            01075000
ATCAPCRP EQU   ISTATCVT+1320                                            01076000
ATCAPCRS EQU   ISTATCVT+1316                                            01077000
ATCAPCTP EQU   ISTATCVT+1312                                            01078000
ATCAPCTW EQU   ISTATCVT+1308                                            01079000
ATCAPCPS EQU   ISTATCVT+1304                                            01080000
ATCAPCTS EQU   ISTATCVT+1300                                            01081000
ATCAPCTQ EQU   ISTATCVT+1296                                            01082000
ATCAPCTX EQU   ISTATCVT+1292                                            01083000
ATCSDCOS EQU   ISTATCVT+1288                                            01084000
ATCEXCVR EQU   ISTATCVT+1284                                            01085000
ATCCPCSV EQU   ISTATCVT+1280                                            01086000
ATCVRECB EQU   ATCVRTIL+12                                              01087000
ATCVRLCK EQU   ATCVRTIL+8                                               01088000
ATCVRWEL EQU   ATCVRTIL+4                                               01089000
ATCVRWEQ EQU   ATCVRTIL                                                 01090000
ATCMGPAB EQU   ISTATCVT+1248                                            01091000
ATCTSCMS EQU   ISTATCVT+1244                                            01092000
ATCVRATB EQU   ISTATCVT+1240                                            01093000
ATCVRWAP EQU   ISTATCVT+1236                                            01094000
ATCPVRAQ EQU   ISTATCVT+1232                                            01095000
ATCTOWA  EQU   ISTATCVT+1228                                            01096000
ATCTOD2  EQU   ATCTOD+4                                                 01097000
ATCTOD1  EQU   ATCTOD                                                   01098000
ATCERTP  EQU   ISTATCVT+1216                                            01099000
ATCBINDQ EQU   ISTATCVT+1212                                            01100000
ATCTIMER EQU   ISTATCVT+1208                                            01101000
ATCTSCDN EQU   ISTATCVT+1204                                            01102000
ATCTSCCN EQU   ISTATCVT+1200                                            01103000
ATCTSCL0 EQU   ISTATCVT+1196                                            01104000
ATCTSCP2 EQU   ISTATCVT+1192                                            01105000
ATCTSC3S EQU   ISTATCVT+1188                                            01106000
ATCTSC3R EQU   ISTATCVT+1184                                            01107000
ATCTSC3O EQU   ISTATCVT+1180                                            01108000
ATCIOPRG EQU   ATCIOINT                                                 01109000
ATCTSCMI EQU   ISTATCVT+1172                                            01110000
ATCTSCMO EQU   ISTATCVT+1168                                            01111000
ATCTSCP4 EQU   ISTATCVT+1164                                            01112000
ATCPUSCT EQU   ISTATCVT+1160                                            01113000
ATCTKINT EQU   ATCTKFLD+2                                               01114000
ATCTKCNT EQU   ATCTKFLD                                                 01115000
ATCTIMCK EQU   ISTATCVT+1152                                            01116000
@NM00040 EQU   ATCRID+2                                                 01117000
ATCCDRMA EQU   ATCRID                                                   01118000
ATCCPCGD EQU   ISTATCVT+1140                                            01119000
@NM00039 EQU   ATCSMSDQ+8                                               01120000
@NM00038 EQU   ATCSMSDQ+4                                               01121000
@NM00037 EQU   ATCSMSDQ                                                 01122000
ATCSEQNO EQU   ISTATCVT+1124                                            01123000
ATCSMPMD EQU   ISTATCVT+1120                                            01124000
ATCPAREA EQU   ISTATCVT+1116                                            01125000
ATCCPCSM EQU   ISTATCVT+1112                                            01126000
ATCSQCDS EQU   ISTATCVT+1108                                            01127000
ATCUSSVT EQU   ISTATCVT+1104                                            01128000
ATCNOSQ  EQU   ISTATCVT+1100                                            01129000
ATCINCIP EQU   ATCCPDVT+4                                               01130000
ATCTSCNI EQU   ATCCPDVT                                                 01131000
ATCMGCRT EQU   ISTATCVT+1088                                            01132000
ATCMACRT EQU   ISTATCVT+1084                                            01133000
ATCCSMT  EQU   ISTATCVT+1080                                            01134000
ATCINCNO EQU   ISTATCVT+1076                                            01135000
ATCRACON EQU   ISTATCVT+1072                                            01136000
ATCCFCDR EQU   ISTATCVT+1068                                            01137000
ATCONFIG EQU   ISTATCVT+1060                                            01138000
ATCNODEL EQU   ISTATCVT+1052                                            01139000
ATCCDTIM EQU   ISTATCVT+1050                                            01140000
ATCNMCTR EQU   ISTATCVT+1048                                            01141000
ATCPOIA  EQU   ATCRNO+1                                                 01142000
@NM00036 EQU   ATCRNO                                                   01143000
ATCHBSIZ EQU   ATCHPGM+2                                                01144000
ATCHBFNO EQU   ATCHPGM                                                  01145000
ATCMROUT EQU   ISTATCVT+1031                                            01146000
ATCXRANG EQU   ISTATCVT+1030                                            01147000
ATCMAXID EQU   ISTATCVT+1029                                            01148000
ATCMSGSP EQU   ISTATCVT+1028                                            01149000
ATCECTLP EQU   ISTATCVT+1024                                            01150000
ATCECSES EQU   ISTATCVT+1020                                            01151000
ATCECDSP EQU   ISTATCVT+1016                                            01152000
ATCECVRY EQU   ISTATCVT+1012                                            01153000
ATCECHLT EQU   ISTATCVT+1008                                            01154000
ATCECMOD EQU   ISTATCVT+1004                                            01155000
ATCRDTLK EQU   ISTATCVT+1000                                            01156000
ATCVOCLK EQU   ISTATCVT+996                                             01157000
ATCCIDM  EQU   ISTATCVT+994                                             01158000
ATCITLIM EQU   ISTATCVT+992                                             01159000
ATCTMINV EQU   ISTATCVT+990                                             01160000
ATCHOSTA EQU   ISTATCVT+988                                             01161000
ATCPUNSA EQU   ISTATCVT+986                                             01162000
ATCVTMID EQU   ATCSSCPA                                                 01163000
ATCHCNID EQU   ATCONID+2                                                01164000
ATCSCNID EQU   ATCONID                                                  01165000
@NM00035 EQU   ATCBITAN+3                                               01166000
@NM00034 EQU   ATCBITAN+2                                               01167000
@NM00033 EQU   ATCFLAG2                                                 01168000
ATCMSGID EQU   ATCFLAG2                                                 01169000
ATCINACT EQU   ATCFLAG2                                                 01170000
ATCCRYPF EQU   ATCFLAG2                                                 01171000
ATCTUNCL EQU   ATCFLAG2                                                 01172000
ATCTUNRQ EQU   ATCFLAG2                                                 01173000
ATCTUNAC EQU   ATCFLAG2                                                 01174000
ATCCDLRA EQU   ATCFLAG2                                                 01175000
@NM00032 EQU   ATCBITAN                                                 01176000
@NM00031 EQU   ATCSTAT4                                                 01177000
@NM00030 EQU   ATCSTAT4                                                 01178000
@NM00029 EQU   ATCSTAT4                                                 01179000
@NM00028 EQU   ATCSTAT4                                                 01180000
@NM00027 EQU   ATCSTAT4                                                 01181000
@NM00026 EQU   ATCSTAT4                                                 01182000
ATCNCSD  EQU   ATCSTAT4                                                 01183000
ATCMTST  EQU   ATCSTAT4                                                 01184000
@NM00025 EQU   ATCPOFLG                                                 01185000
@NM00024 EQU   ATCPOFLG                                                 01186000
@NM00023 EQU   ATCPOFLG                                                 01187000
@NM00022 EQU   ATCPOFLG                                                 01188000
@NM00021 EQU   ATCPOFLG                                                 01189000
@NM00020 EQU   ATCPOFLG                                                 01190000
@NM00019 EQU   ATCPOFLG                                                 01191000
ATCPOUNS EQU   ATCPOFLG                                                 01192000
ATCITEXT EQU   @NM00018                                                 01193000
ATCHIP   EQU   ATCSTAT1                                                 01194000
ATCMDHLT EQU   ATCSTAT1                                                 01195000
ATCINHLT EQU   ATCSTAT1                                                 01196000
ATCNETSL EQU   ATCSTAT1                                                 01197000
ATCQKHLT EQU   ATCSTAT1                                                 01198000
ATCSNHLT EQU   ATCSTAT1                                                 01199000
ATCACTIV EQU   ATCSTAT1                                                 01200000
ATCSTART EQU   ATCSTAT1                                                 01201000
ATCNOP00 EQU   ISTATCVT+968                                             01202000
ATCTSBUF EQU   ISTATCVT+964                                             01203000
ATCSSOQH EQU   ISTATCVT+960                                             01204000
ATCSSIQH EQU   ISTATCVT+956                                             01205000
ATCTSCMB EQU   ATCMBDVT                                                 01206000
ATCSOPAC EQU   ISTATCVT+950                                             01207000
ATCSOTIM EQU   ISTATCVT+948                                             01208000
ATCTSCON EQU   ATCSODVT                                                 01209000
ATCTSCSC EQU   ATCSSDVT                                                 01210000
ATCTSCRO EQU   ISTATCVT+936                                             01211000
ATCTSCRI EQU   ISTATCVT+932                                             01212000
ATCFEPT  EQU   ISTATCVT+928                                             01213000
ATCFDVT  EQU   ISTATCVT+924                                             01214000
ATCSIBQ  EQU   ISTATCVT+916                                             01215000
ATCDSPLQ EQU   ISTATCVT+912                                             01216000
ATCVARYQ EQU   ISTATCVT+908                                             01217000
ATCHALTQ EQU   ISTATCVT+904                                             01218000
ATCMODQ  EQU   ISTATCVT+900                                             01219000
ATCSRT   EQU   ISTATCVT+896                                             01220000
ATCRDT   EQU   ISTATCVT+892                                             01221000
ATCSDVT  EQU   ISTATCVT+888                                             01222000
ATCDLRPT EQU   ISTATCVT+884                                             01223000
ATCBPDA  EQU   ISTATCVT+880                                             01224000
ATCACDA  EQU   ISTATCVT+876                                             01225000
ATCMNT   EQU   ISTATCVT+872                                             01226000
ATCNODDS EQU   ISTATCVT+868                                             01227000
ATCITRT  EQU   ISTATCVT+864                                             01228000
ATCTODVT EQU   ISTATCVT+860                                             01229000
ATCTRCPT EQU   ISTATCVT+856                                             01230000
ATCMODTB EQU   ISTATCVT+852                                             01231000
ATCUSSPT EQU   ISTATCVT+848                                             01232000
ATCTUBUF EQU   ISTATCVT+844                                             01233000
ATCTACB  EQU   ISTATCVT+840                                             01234000
ATCDWA   EQU   ISTATCVT+836                                             01235000
ATCCFCR2 EQU   ATCPODVT                                                 01236000
ATCPULQB EQU   @NM00017+16                                              01237000
ATCMCQAB EQU   @NM00017+12                                              01238000
ATCLUSMQ EQU   @NM00017+8                                               01239000
ATCLUIOQ EQU   @NM00017+4                                               01240000
ATCIOLQB EQU   @NM00017                                                 01241000
ATCTSCAP EQU   ATCANYDT                                                 01242000
ATCTSCCO EQU   ATCLUDVT+4                                               01243000
ATCTSCSR EQU   ATCLUDVT                                                 01244000
ATCVTLOD EQU   ISTATCVT+796                                             01245000
ATCTSCLF EQU   @NM00016                                                 01246000
ATCTSCLE EQU   ISTATCVT+788                                             01247000
ATCTSCLB EQU   ISTATCVT+784                                             01248000
ATCTSCLS EQU   ISTATCVT+780                                             01249000
ATCTSCCF EQU   ATCTSCUF                                                 01250000
ATCTSCFV EQU   ISTATCVT+772                                             01251000
ATCTSCCE EQU   ISTATCVT+768                                             01252000
ATCTSCCB EQU   ISTATCVT+764                                             01253000
ATCTSCWS EQU   ISTATCVT+760                                             01254000
ATCTSCEM EQU   ISTATCVT+756                                             01255000
ATCTSCNS EQU   ISTATCVT+752                                             01256000
ATCTSCER EQU   ISTATCVT+748                                             01257000
ATCTSCPR EQU   ISTATCVT+744                                             01258000
ATCTSCGR EQU   ISTATCVT+740                                             01259000
ATCTSCCI EQU   ATCTSCIO                                                 01260000
ATCTSVT  EQU   ISTATCVT+732                                             01261000
ATCDVLOD EQU   ISTATCVT+728                                             01262000
ATCCDCNR EQU   ISTATCVT+724                                             01263000
ATCCDCNF EQU   ISTATCVT+720                                             01264000
ATCCDCND EQU   ISTATCVT+716                                             01265000
ATCCDCNA EQU   ISTATCVT+712                                             01266000
ATCCDCCP EQU   ISTATCVT+708                                             01267000
ATCCDFDN EQU   ISTATCVT+704                                             01268000
ATCCDFIN EQU   ISTATCVT+700                                             01269000
ATCCDFND EQU   ISTATCVT+696                                             01270000
ATCCDDEL EQU   ISTATCVT+692                                             01271000
ATCCDADD EQU   ISTATCVT+688                                             01272000
ATCTCLIM EQU   ISTATCVT+684                                             01273000
ATCRACTR EQU   ISTATCVT+680                                             01274000
ATCRACTI EQU   ISTATCVT+676                                             01275000
ATCREMOV EQU   ISTATCVT+672                                             01276000
ATCRACIO EQU   ISTATCVT+668                                             01277000
ATCADD   EQU   ISTATCVT+664                                             01278000
ATCPUCRT EQU   ISTATCVT+660                                             01279000
ATCSMRS  EQU   ISTATCVT+656                                             01280000
ATCSMRQ  EQU   ISTATCVT+652                                             01281000
ATCORCAF EQU   ISTATCVT+648                                             01282000
ATCFRSTR EQU   ATCGTSTR                                                 01283000
ATCSTMA  EQU   ISTATCVT+640                                             01284000
ATCSRTAD EQU   ISTATCVT+636                                             01285000
ATCOCCFS EQU   ISTATCVT+632                                             01286000
ATCOCCFP EQU   ISTATCVT+628                                             01287000
ATCSRTDF EQU   ISTATCVT+624                                             01288000
ATCLUCRT EQU   ISTATCVT+620                                             01289000
ATCINCY5 EQU   ISTATCVT+616                                             01290000
ATCINCW3 EQU   ISTATCVT+612                                             01291000
ATCINCU6 EQU   ISTATCVT+608                                             01292000
ATCINCTQ EQU   ISTATCVT+604                                             01293000
ATCINCS1 EQU   ISTATCVT+600                                             01294000
ATCSRTAB EQU   ISTATCVT+596                                             01295000
ATCINCRD EQU   ISTATCVT+592                                             01296000
ATCINCPH EQU   ISTATCVT+588                                             01297000
ATCINCLQ EQU   ISTATCVT+584                                             01298000
ATCNOCRT EQU   ISTATCVT+580                                             01299000
ATCINCF1 EQU   ISTATCVT+576                                             01300000
ATCINCCI EQU   ISTATCVT+572                                             01301000
ATCINCCO EQU   ISTATCVT+568                                             01302000
ATCBLDLA EQU   ISTATCVT+564                                             01303000
ATCALOAD EQU   ISTATCVT+560                                             01304000
ATCADEL  EQU   ISTATCVT+556                                             01305000
ATCRACEP EQU   ISTATCVT+552                                             01306000
ATCESC01 EQU   ISTATCVT+548                                             01307000
ATCDEC01 EQU   ISTATCVT+544                                             01308000
ATCDEC00 EQU   ISTATCVT+540                                             01309000
ATCCPCRT EQU   ISTATCVT+536                                             01310000
ATCAP35  EQU   ISTATCVT+532                                             01311000
ATCCPCFR EQU   ISTATCVT+528                                             01312000
ATCCPCGR EQU   ISTATCVT+524                                             01313000
ATCCPCPP EQU   ISTATCVT+520                                             01314000
ATCCPCNT EQU   ISTATCVT+516                                             01315000
ATCAUTHA EQU   ISTATCVT+512                                             01316000
ATCACCTA EQU   ISTATCVT+508                                             01317000
ATCMSGP  EQU   ISTATCVT+504                                             01318000
ATCAP39  EQU   ISTATCVT+500                                             01319000
ATCAP36  EQU   ISTATCVT+496                                             01320000
ATCMSGM  EQU   ISTATCVT+492                                             01321000
ATCAP33  EQU   ISTATCVT+488                                             01322000
ATCAICPT EQU   ISTATCVT+484                                             01323000
ATCAPI   EQU   ISTATCVT+480                                             01324000
ATCACC01 EQU   ISTATCVT+476                                             01325000
ATCACC00 EQU   ISTATCVT+472                                             01326000
ATCMBPAB EQU   ISTATCVT+456                                             01327000
ATCSOPAB EQU   ISTATCVT+440                                             01328000
ATCSSPAB EQU   ISTATCVT+424                                             01329000
ATCLDECB EQU   ATCLDTIL+12                                              01330000
ATCLDLCK EQU   ATCLDTIL+8                                               01331000
ATCLDLST EQU   ATCLDTIL+4                                               01332000
ATCLDNCS EQU   ATCLDTIL                                                 01333000
ATCNOSPB EQU   ISTATCVT+376                                             01334000
ATCNSPAB EQU   ISTATCVT+344                                             01335000
ATCLUSRT EQU   ISTATCVT+312                                             01336000
ATCPUIOP EQU   ISTATCVT+280                                             01337000
ATCPUPAB EQU   ISTATCVT+248                                             01338000
ATCPXPAB EQU   ISTATCVT+216                                             01339000
ATCPOPAB EQU   ISTATCVT+184                                             01340000
ATCVDPAB EQU   ISTATCVT+152                                             01341000
ATCTCIPB EQU   ISTATCVT+120                                             01342000
ATCCSPAB EQU   ATCSMPAB+16                                              01343000
@NM00015 EQU   ATCSMPAB                                                 01344000
ATCTMRPB EQU   ISTATCVT+56                                              01345000
ATCITPAB EQU   ISTATCVT+24                                              01346000
@NM00014 EQU   ATCITRA1+1                                               01347000
ATCITCIO EQU   ATCITRA1                                                 01348000
ATCITSCP EQU   ATCITRA1                                                 01349000
ATCITMSG EQU   ATCITRA1                                                 01350000
ATCITPIU EQU   ATCITRA1                                                 01351000
ATCITSMS EQU   ATCITRA1                                                 01352000
ATCITPSS EQU   ATCITRA1                                                 01353000
ATCITLCK EQU   ATCITRA1                                                 01354000
ATCITAPI EQU   ATCITRA1                                                 01355000
ATCITCNT EQU   ATCITFLG                                                 01356000
ATCITRPH EQU   ATCITCDS                                                 01357000
ATCITTBL EQU   ATCITFLD+4                                               01358000
ATCITMAX EQU   ATCITPRM                                                 01359000
ATCPTCHA EQU   ATCRPTCH+4                                               01360000
ATCVTLVL EQU   ATCRPTCH                                                 01361000
RPHUPSTA EQU   ISTRPH+100                                               01362000
RPHSAV16 EQU   RPHWORK+60                                               01363000
RPHSAV15 EQU   RPHWORK+56                                               01364000
RPHSAV14 EQU   RPHWORK+52                                               01365000
RPHSAV13 EQU   RPHWORK+48                                               01366000
RPHSAV12 EQU   RPHWORK+44                                               01367000
RPHSAV11 EQU   RPHWORK+40                                               01368000
RPHSAV10 EQU   RPHWORK+36                                               01369000
RPHSAVE9 EQU   RPHWORK+32                                               01370000
RPHSAVE8 EQU   RPHWORK+28                                               01371000
RPHSAVE7 EQU   RPHWORK+24                                               01372000
RPHSAVE6 EQU   RPHWORK+20                                               01373000
RPHSAVE5 EQU   RPHWORK+16                                               01374000
RPHSAVE4 EQU   RPHWORK+12                                               01375000
RPHSAVE3 EQU   RPHWORK+8                                                01376000
RPHSAVE2 EQU   RPHWORK+4                                                01377000
RPHSHALF EQU   RPHSAVE1+2                                               01378000
RPHSBIT8 EQU   RPHSBITS                                                 01379000
RPHSBIT7 EQU   RPHSBITS                                                 01380000
RPHSBIT6 EQU   RPHSBITS                                                 01381000
RPHSBIT5 EQU   RPHSBITS                                                 01382000
RPHSBIT4 EQU   RPHSBITS                                                 01383000
RPHSBIT3 EQU   RPHSBITS                                                 01384000
RPHSBIT2 EQU   RPHSBITS                                                 01385000
RPHSBIT1 EQU   RPHSBITS                                                 01386000
RPHSBYTE EQU   RPHSAVE1                                                 01387000
RPHCRR   EQU   ISTRPH+32                                                01388000
RPHSRP34 EQU   RPHSRPRM+2                                               01389000
RPHSRP12 EQU   RPHSRPRM                                                 01390000
RPHWEGT  EQU   RPHWEA                                                   01391000
RPHMAJCB EQU   ISTRPH+21                                                01392000
RPHPABOF EQU   ISTRPH+20                                                01393000
RPHRESUM EQU   RPHRESMA+1                                               01394000
@NM00013 EQU   RPHWPFLG                                                 01395000
RPHPURGE EQU   RPHWPFLG                                                 01396000
RPHPT    EQU   RPHWPFLG                                                 01397000
RPHWT    EQU   RPHWPFLG                                                 01398000
RPHRSKEY EQU   RPHWPFLG                                                 01399000
RPHDVTA  EQU   ISTRPH+12                                                01400000
RPHTIK   EQU   RPHTSKID+3                                               01401000
@NM00012 EQU   RPHTSKID                                                 01402000
RPHRPHAP EQU   RPHRPHA+1                                                01403000
@NM00011 EQU   RPHRPHA                                                  01404000
RPHGATE  EQU   RPHRPHA                                                  01405000
@NM00010 EQU   RPHFLGB                                                  01406000
RPHABEND EQU   RPHFLGB                                                  01407000
RPHUWAIT EQU   RPHFLGB                                                  01408000
RPHRLCRA EQU   RPHFLGB                                                  01409000
RPHSYNCH EQU   RPHFLGB                                                  01410000
RPHPGCMP EQU   RPHFLGB                                                  01411000
RPHLOCK  EQU   RPHFLGB                                                  01412000
@NM00009 EQU   RPHFLAGS                                                 01413000
RPHSMCLR EQU   RPHFLAGS                                                 01414000
RPHSMTYP EQU   RPHFLAGS                                                 01415000
RPHSMQ   EQU   RPHFLAGS                                                 01416000
RPHLNGTH EQU   RPHCNTL+1                                                01417000
RPHTYPE  EQU   RPHCNTL                                                  01418000
DYPPAB   EQU   ISTDYPAB+16                                              01419000
DYPOCRPH EQU   DYPPACMD                                                 01420000
DYPTSKID EQU   ISTDYPAB+8                                               01421000
DYPPACTB EQU   DYPCHAIN                                                 01422000
DYPFLGS  EQU   ISTDYPAB+2                                               01423000
DYPLNGTH EQU   ISTDYPAB+1                                               01424000
DYPTYPE  EQU   ISTDYPAB                                                 01425000
PABRPHA  EQU   PABRPHFG+1                                               01426000
@NM00007 EQU   PABFLAGS                                                 01427000
PABKPRPH EQU   PABFLAGS                                                 01428000
PABNODQ  EQU   PABFLAGS                                                 01429000
PABXTND  EQU   PABFLAGS                                                 01430000
PABSYNCH EQU   PABFLAGS                                                 01431000
PABCDP   EQU   PABFLAGS                                                 01432000
PABUNCON EQU   PABFLAGS                                                 01433000
PABDVTA  EQU   ISTPAB+9                                                 01434000
PABOFFST EQU   ISTPAB+8                                                 01435000
PABCHNGP EQU   PABCHAIN+1                                               01436000
@NM00006 EQU   PABCHAIN                                                 01437000
PABCHNG  EQU   PABCHAIN                                                 01438000
PABWEQP  EQU   PABWEQA+1                                                01439000
@NM00005 EQU   PABWEQA                                                  01440000
PABWEQG  EQU   PABWEQA                                                  01441000
LOKXCL   EQU   @NM00003                                                 01442000
LOKPRY   EQU   @NM00003                                                 01443000
@NM00004 EQU   @NM00003                                                 01444000
@NM00002 EQU   LOKCHNG                                                  01445000
LOKCT    EQU   ISTLOK                                                   01446000
@NM00001 EQU   CITSAVE                                                  01447000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01448000
@RF00198 EQU   CITTREL                                                  01449000
@RF00202 EQU   CITTREL                                                  01450000
@RF00206 EQU   CITTREL                                                  01451000
@ENDDATA EQU   *                                                        01452000
         END   ISTINCIT,(C'PLS2246',0702,80241)                         01453000
