         TITLE 'ISTSDCC4-EBCHEX'                                        00001000
ISTSDCC4 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTSDCC4  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         PRINT OFF                                                      00013000
         PRINT ON                                                       00014000
         USING @DATD,DATREG                                             00015000
*   DATREG=ADDR(RNCDAT3);           /* RNCDAT3 TEMPORARY MUST BE   0225 00016000
*                                      CHANGED BEFORE RELEASE        */ 00017000
         LA    DATREG,RNCDAT3(,RNCAREG)                            0225 00018000
*   WORKBUF=BLANK;                  /* BLANK THE WORKBUF             */ 00019000
         MVI   WORKBUF+1,C' '                                      0226 00020000
         MVC   WORKBUF+2(39),WORKBUF+1                             0226 00021000
         MVI   WORKBUF,C' '                                        0226 00022000
*   IF R0>0&R0<41 THEN              /* IS STRING LENGTH >0 & <41     */ 00023000
         LTR   R0,R0                                               0227 00024000
         BNP   @RF00227                                            0227 00025000
         CH    R0,@CH01350                                         0227 00026000
         BNL   @RF00227                                            0227 00027000
*     DO;                                                          0228 00028000
*       RLENGTH=R0;                 /* YES PUT LENGTH IN RLENGTH     */ 00029000
         LR    RLENGTH,R0                                          0229 00030000
*       TOPTR=ADDR(WORKBUF)+40-RLENGTH;/* SET TO PTR FOR MOVE        */ 00031000
         LA    TOPTR,WORKBUF                                       0230 00032000
         AH    TOPTR,@CH00283                                      0230 00033000
         SLR   TOPTR,RLENGTH                                       0230 00034000
*       WRKCHR(1:RLENGTH)=STRING(1:RLENGTH);/* MOVE STRING TO WRKBF  */ 00035000
         LR    @14,RLENGTH                                         0231 00036000
         BCTR  @14,0                                               0231 00037000
         EX    @14,@SM01395                                        0231 00038000
*       PARMSAVE=PARMR;             /* SAVE REG 1 OVER TRT           */ 00039000
         LR    PARMSAVE,PARMR                                      0232 00040000
*       PARMR=0;                    /* ZERO OUT REG 1                */ 00041000
         SLR   PARMR,PARMR                                         0233 00042000
*       TRT(WORKBUF,TTABLE);        /* CHECK VALIDITY                */ 00043000
         TRT   WORKBUF(41),TTABLE                                  0234 00044000
*       IF PARMR=0 THEN             /* TRT WENT O.K.?                */ 00045000
         LTR   PARMR,PARMR                                         0235 00046000
         BNZ   @RF00235                                            0235 00047000
*         DO;                       /* YES, GO ON                    */ 00048000
*           TR(WORKBUF,TTABLE2);    /* TRANSLATE CHARACTERS          */ 00049000
         TR    WORKBUF(41),TTABLE2                                 0237 00050000
*           PACK(WRK3,STR3);        /* PACK STRING                   */ 00051000
         PACK  WRK3(8),STR3(15)                                    0238 00052000
*           PACK(WRK2,STR2);                                       0239 00053000
         PACK  WRK2(8),STR2(15)                                    0239 00054000
*           PACK(WRK1,STR1);                                       0240 00055000
         PACK  WRK1(7),STR1(13)                                    0240 00056000
*           SLIDE2=WRK2(1:7);       /* MOVE PACKED STRING TOGETHER   */ 00057000
         MVC   SLIDE2(7),WRK2                                      0241 00058000
*           SLIDE1=WRK1(1:6);                                      0242 00059000
         MVC   SLIDE1(6),WRK1                                      0242 00060000
*           RLENGTH=(RLENGTH+1)/2;  /* GET LENGTH OF PACKED STRING   */ 00061000
         LA    @02,1                                               0243 00062000
         ALR   @02,RLENGTH                                         0243 00063000
         SRDA  @02,32                                              0243 00064000
         D     @02,@CF00228                                        0243 00065000
         LR    RLENGTH,@03                                         0243 00066000
*           FROMPTR=ADDR(WORKBUF)+40-RLENGTH;/* SET PTR FOR MOVE     */ 00067000
         LA    FROMPTR,WORKBUF                                     0244 00068000
         AH    FROMPTR,@CH00283                                    0244 00069000
         SLR   FROMPTR,RLENGTH                                     0244 00070000
*           PARMR=PARMSAVE;         /* RESTORE REG 1                 */ 00071000
         LR    PARMR,PARMSAVE                                      0245 00072000
*           STRING(1:RLENGTH)=HEXSTRNG(1:RLENGTH);/* MOVE IN STRG    */ 00073000
         LR    @14,RLENGTH                                         0246 00074000
         BCTR  @14,0                                               0246 00075000
         EX    @14,@SM01397                                        0246 00076000
*           R0=RLENGTH;             /* SET R0 FOR RETURN             */ 00077000
         LR    R0,RLENGTH                                          0247 00078000
*           RC=0;                   /* SET RETURN CODE               */ 00079000
         SLR   RC,RC                                               0248 00080000
*         END;                                                     0249 00081000
*       ELSE                        /* PARMR NOT = 0                 */ 00082000
*         DO;                                                      0250 00083000
         B     @RC00235                                            0250 00084000
@RF00235 DS    0H                                                  0251 00085000
*           RC=4;                   /* NOTE ERROR CONDITION          */ 00086000
         LA    RC,4                                                0251 00087000
*         END;                                                     0252 00088000
*     END;                                                         0253 00089000
*   ELSE                            /* STRNG LENGTH 0 OR > 41        */ 00090000
*     DO;                                                          0254 00091000
         B     @RC00227                                            0254 00092000
@RF00227 DS    0H                                                  0255 00093000
*       RC=4;                       /* ERROR CONDITION               */ 00094000
         LA    RC,4                                                0255 00095000
*     END;                                                         0256 00096000
*   SVR0=R0;                        /* PUT R0 IN CALLERS SAVEAREA    */ 00097000
@RC00227 ST    R0,SVR0(,SAVREG)                                    0257 00098000
*   SVR15=RC;                       /* PUT RC IN CALLERS SAVEAREA    */ 00099000
         ST    RC,SVR15(,SAVREG)                                   0258 00100000
*   RETURN;                                                        0259 00101000
@EL00001 DS    0H                                                  0259 00102000
@EF00001 DS    0H                                                  0259 00103000
@ER00001 LM    @14,@12,12(@13)                                     0259 00104000
         BR    @14                                                 0259 00105000
*   DO;                             /* TPEPILOG                      */ 00106000
*     GEN(PRINT OFF);                                              0261 00107000
         PRINT OFF                                                      00108000
*     GEN(PRINT ON);                                               0262 00109000
         PRINT ON                                                       00110000
*   END;                            /* TPEPILOG                      */ 00111000
*   END ISTSDCC4;                                                  0264 00112000
         B     @EL00001                                            0264 00113000
@DATA    DS    0H                                                       00114000
@CH00283 DC    H'40'                                                    00115000
@CH01350 DC    H'41'                                                    00116000
@SM01395 MVC   WRKCHR(0,TOPTR),STRING(PARMR)                            00117000
@SM01397 MVC   STRING(0,PARMR),HEXSTRNG(FROMPTR)                        00118000
@DATD    DSECT                                                          00119000
         DS    0F                                                       00120000
ISTSDCC4 CSECT                                                          00121000
         DS    0F                                                       00122000
@CF00228 DC    F'2'                                                     00123000
@DATD    DSECT                                                          00124000
         DS    0D                                                       00125000
TWOSAVE  DS    F                                                        00126000
I        DS    H                                                        00127000
WORKBUF  DS    CL41                                                     00128000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00129000
@ENDDATD EQU   *                                                        00130000
ISTSDCC4 CSECT                                                          00131000
         DS    0F                                                       00132000
@SIZDATD DC    AL1(0)                                                   00133000
         DC    AL3(@ENDDATD-@DATD)                                      00134000
         DS    0D                                                       00135000
TTABLE   DS    CL256                                                    00136000
         ORG   TTABLE                                                   00137000
TAB      DC    64CL1'X'                                                 00138000
         DC    X'00'                                                    00139000
         DC    128CL1'X'                                                00140000
         DC    6X'00'                                                   00141000
         DC    41CL1'X'                                                 00142000
         DC    10X'00'                                                  00143000
         DC    6CL1'X'                                                  00144000
         ORG   TTABLE+256                                               00145000
TTABLE2  DS    CL256                                                    00146000
         ORG   TTABLE2                                                  00147000
TAB2     DC    64CL1'X'                                                 00148000
         DC    X'40'                                                    00149000
         DC    128CL1'X'                                                00150000
         DC    X'0A'                                                    00151000
         DC    X'0B'                                                    00152000
         DC    X'0C'                                                    00153000
         DC    X'0D'                                                    00154000
         DC    X'0E'                                                    00155000
         DC    X'0F'                                                    00156000
         DC    41CL1'X'                                                 00157000
         DC    X'F0'                                                    00158000
         DC    X'F1'                                                    00159000
         DC    X'F2'                                                    00160000
         DC    X'F3'                                                    00161000
         DC    X'F4'                                                    00162000
         DC    X'F5'                                                    00163000
         DC    X'F6'                                                    00164000
         DC    X'F7'                                                    00165000
         DC    X'F8'                                                    00166000
         DC    X'F9'                                                    00167000
         DC    6CL1'X'                                                  00168000
         ORG   TTABLE2+256                                              00169000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00170000
@01      EQU   01                                                       00171000
@02      EQU   02                                                       00172000
@03      EQU   03                                                       00173000
@04      EQU   04                                                       00174000
@05      EQU   05                                                       00175000
@06      EQU   06                                                       00176000
@07      EQU   07                                                       00177000
@08      EQU   08                                                       00178000
@09      EQU   09                                                       00179000
@10      EQU   10                                                       00180000
@11      EQU   11                                                       00181000
@12      EQU   12                                                       00182000
@13      EQU   13                                                       00183000
@14      EQU   14                                                       00184000
@15      EQU   15                                                       00185000
RLENGTH  EQU   @08                                                      00186000
PARMSAVE EQU   @09                                                      00187000
SAVREG   EQU   @13                                                      00188000
DATREG   EQU   @11                                                      00189000
RC       EQU   @15                                                      00190000
RNCAREG  EQU   @06                                                      00191000
R0       EQU   @00                                                      00192000
TOPTR    EQU   @04                                                      00193000
FROMPTR  EQU   @05                                                      00194000
PARMR    EQU   @01                                                      00195000
ISTDEVCH EQU   0                                                        00196000
DEVSHCH  EQU   ISTDEVCH                                                 00197000
DEVCHAR  EQU   DEVSHCH                                                  00198000
DEVTCODE EQU   ISTDEVCH+1                                               00199000
DEVFLAGS EQU   ISTDEVCH+3                                               00200000
DEVFCCTL EQU   DEVFLAGS                                                 00201000
DEVCHAR3 EQU   DEVFLAGS                                                 00202000
DEVMODE  EQU   ISTDEVCH+5                                               00203000
ISTSRT   EQU   0                                                        00204000
SRTSRTE  EQU   ISTSRT+8                                                 00205000
SRTXTNBS EQU   ISTSRT+13                                                00206000
ISTLOK   EQU   0                                                        00207000
LOKCHN   EQU   ISTLOK+1                                                 00208000
LOKCHNG  EQU   LOKCHN                                                   00209000
@NM00003 EQU   LOKCHNG+2                                                00210000
ISTRPRE  EQU   0                                                        00211000
RPRSRTHD EQU   ISTRPRE                                                  00212000
RPRDAFID EQU   ISTRPRE+16                                               00213000
RPRSTATE EQU   ISTRPRE+56                                               00214000
RPRCURST EQU   RPRSTATE                                                 00215000
RPRDESST EQU   RPRSTATE+2                                               00216000
RPRBITAN EQU   ISTRPRE+61                                               00217000
RPRFLAGS EQU   ISTRPRE+66                                               00218000
ISTRCPRE EQU   0                                                        00219000
RCPSARRY EQU   ISTRCPRE+84                                              00220000
RCPPACE  EQU   ISTRCPRE+108                                             00221000
RCPNCPPC EQU   ISTRCPRE+110                                             00222000
RCPPMODE EQU   ISTRCPRE+113                                             00223000
RCPCYMOD EQU   RCPPMODE                                                 00224000
RCPCYSET EQU   RCPPMODE                                                 00225000
RCPSESSM EQU   ISTRCPRE+115                                             00226000
RCPBITAN EQU   ISTRCPRE+116                                             00227000
ISTRAP   EQU   0                                                        00228000
RAPBITAN EQU   ISTRAP+165                                               00229000
ISTRDT   EQU   0                                                        00230000
RDTPLEN  EQU   ISTRDT+84                                                00231000
RDTPRIOR EQU   RDTPLEN                                                  00232000
RDTBITAN EQU   ISTRDT+113                                               00233000
RDTCRIA  EQU   ISTRDT+116                                               00234000
ISTRLN   EQU   0                                                        00235000
RLNADR   EQU   ISTRLN+84                                                00236000
RLNFLAG  EQU   RLNADR                                                   00237000
RLNUCBAD EQU   RLNADR+1                                                 00238000
RLNCSLRC EQU   ISTRLN+104                                               00239000
RLNBITAN EQU   ISTRLN+112                                               00240000
RLNRACNT EQU   RLNBITAN                                                 00241000
RLNCONCT EQU   RLNBITAN+2                                               00242000
RLNLSCMD EQU   RLNBITAN+3                                               00243000
RLNINBFR EQU   ISTRLN+132                                               00244000
ISTRPU   EQU   0                                                        00245000
RPUSTAID EQU   ISTRPU+92                                                00246000
RPUID48  EQU   RPUSTAID+2                                               00247000
ISTRAPRE EQU   0                                                        00248000
ISTRTR   EQU   0                                                        00249000
RTRADR   EQU   ISTRTR+144                                               00250000
RTRFLAG  EQU   RTRADR                                                   00251000
RTRBITAN EQU   ISTRTR+164                                               00252000
RTRRAALL EQU   RTRBITAN                                                 00253000
RTRBSCID EQU   ISTRTR+171                                               00254000
ISTRSW   EQU   0                                                        00255000
ISTRRN   EQU   0                                                        00256000
RRNADR   EQU   ISTRRN+136                                               00257000
RRNFLAG  EQU   RRNADR                                                   00258000
RRNUCBAD EQU   RRNADR+1                                                 00259000
RRNHPRE  EQU   ISTRRN+196                                               00260000
RRNBITAN EQU   ISTRRN+201                                               00261000
RRNLVL   EQU   ISTRRN+204                                               00262000
RRNNMDPD EQU   ISTRRN+232                                               00263000
RRNLDFSM EQU   ISTRRN+298                                               00264000
ISTRPX   EQU   0                                                        00265000
ISTRPT   EQU   0                                                        00266000
RPTXTCID EQU   ISTRPT+136                                               00267000
RPTLNCID EQU   RPTXTCID                                                 00268000
RPTDITT  EQU   ISTRPT+144                                               00269000
RPTBITAN EQU   ISTRPT+166                                               00270000
ISTRLX   EQU   0                                                        00271000
RLXBITAN EQU   ISTRLX+92                                                00272000
ISTRLU   EQU   0                                                        00273000
RLUBITAN EQU   ISTRLU+146                                               00274000
ISTRLS   EQU   0                                                        00275000
ISTRLC   EQU   0                                                        00276000
RLCADR   EQU   ISTRLC+84                                                00277000
RLCFLAG  EQU   RLCADR                                                   00278000
ISTRIN   EQU   0                                                        00279000
RINDAFID EQU   ISTRIN+124                                               00280000
RINBITAN EQU   ISTRIN+130                                               00281000
RINFLAGS EQU   ISTRIN+149                                               00282000
ISTRGP   EQU   0                                                        00283000
RGPBITAN EQU   ISTRGP+94                                                00284000
ISTRDS   EQU   0                                                        00285000
ISTRDA   EQU   0                                                        00286000
ISTRCL   EQU   0                                                        00287000
RCLADR   EQU   ISTRCL+84                                                00288000
RCLFLAG  EQU   RCLADR                                                   00289000
ISTRCDRS EQU   0                                                        00290000
@NM00109 EQU   ISTRCDRS+166                                             00291000
ISTRCDRM EQU   0                                                        00292000
RCDRMPDN EQU   ISTRCDRM+188                                             00293000
RCDRMRPQ EQU   ISTRCDRM+196                                             00294000
RCDRMFGS EQU   ISTRCDRM+208                                             00295000
ISTRCC   EQU   0                                                        00296000
RCCBITAN EQU   ISTRCC+105                                               00297000
ISTPAT   EQU   0                                                        00298000
PATFLAGA EQU   ISTPAT+7                                                 00299000
ISTGNT   EQU   0                                                        00300000
ISTDOT   EQU   0                                                        00301000
ISTDNT   EQU   0                                                        00302000
DNTTELNO EQU   ISTDNT+1                                                 00303000
ISTRNCA  EQU   0                                                        00304000
RNCLPNM  EQU   ISTRNCA+116                                              00305000
@NM00137 EQU   RNCLPNM+4                                                00306000
RNCDAT3  EQU   ISTRNCA+468                                              00307000
RNCWORK1 EQU   ISTRNCA+524                                              00308000
RNCPHR1  EQU   RNCWORK1                                                 00309000
RNCWORK2 EQU   ISTRNCA+2572                                             00310000
RNCPHR2  EQU   RNCWORK2                                                 00311000
RNCWORK3 EQU   ISTRNCA+4620                                             00312000
RNCRNMDL EQU   ISTRNCA+7564                                             00313000
RNCTRMDL EQU   RNCRNMDL                                                 00314000
RNCLNMDL EQU   RNCTRMDL                                                 00315000
RNCSWMDL EQU   RNCLNMDL                                                 00316000
RNCLSMDL EQU   RNCSWMDL                                                 00317000
RNCDAMDL EQU   RNCLSMDL                                                 00318000
RNCCLMDL EQU   RNCDAMDL                                                 00319000
RNCCMMDL EQU   ISTRNCA+7896                                             00320000
RNCLUMDL EQU   RNCCMMDL                                                 00321000
RNCINMDL EQU   RNCLUMDL                                                 00322000
RNCCCMDL EQU   RNCINMDL                                                 00323000
RNCGPMDL EQU   RNCCCMDL                                                 00324000
RNCPXMDL EQU   RNCGPMDL                                                 00325000
ISTLCST  EQU   0                                                        00326000
LCSTTYPE EQU   ISTLCST+12                                               00327000
LCSTACR  EQU   ISTLCST+18                                               00328000
ISTDITHD EQU   0                                                        00329000
ISTDHDVI EQU   0                                                        00330000
DHDDIVTH EQU   ISTDHDVI+12                                              00331000
ISTDDTVI EQU   0                                                        00332000
ISTRNCDT EQU   0                                                        00333000
ISTRNCGT EQU   0                                                        00334000
ISTRNCPT EQU   0                                                        00335000
SVAREA   EQU   0                                                        00336000
SVR15    EQU   SVAREA+16                                                00337000
SVR0     EQU   SVAREA+20                                                00338000
WRKCHR   EQU   0                                                        00339000
STRING   EQU   0                                                        00340000
HEXSTRNG EQU   0                                                        00341000
SRTXTNSN EQU   SRTXTNBS                                                 00342000
STR1     EQU   WORKBUF                                                  00343000
STR2     EQU   WORKBUF+12                                               00344000
STR3     EQU   WORKBUF+26                                               00345000
WRK1     EQU   WORKBUF+6                                                00346000
WRK2     EQU   WORKBUF+19                                               00347000
WRK3     EQU   WORKBUF+33                                               00348000
SLIDE1   EQU   WORKBUF+20                                               00349000
SLIDE2   EQU   WORKBUF+26                                               00350000
RCPSIBQ  EQU   RCPSARRY                                                 00351000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00352000
SRTDATA  EQU   SRTXTNSN+3                                               00353000
SRTUSELN EQU   SRTXTNSN+1                                               00354000
SRTFLAGS EQU   SRTXTNSN                                                 00355000
SVR12    EQU   SVAREA+68                                                00356000
SVR11    EQU   SVAREA+64                                                00357000
SVR10    EQU   SVAREA+60                                                00358000
SVR9     EQU   SVAREA+56                                                00359000
SVR8     EQU   SVAREA+52                                                00360000
SVR7     EQU   SVAREA+48                                                00361000
SVR6     EQU   SVAREA+44                                                00362000
SVR5     EQU   SVAREA+40                                                00363000
SVR4     EQU   SVAREA+36                                                00364000
SVR3     EQU   SVAREA+32                                                00365000
SVR2     EQU   SVAREA+28                                                00366000
SVR1     EQU   SVAREA+24                                                00367000
SVR14    EQU   SVAREA+12                                                00368000
SVLSA    EQU   SVAREA+8                                                 00369000
SVHSA    EQU   SVAREA+4                                                 00370000
SVRSVD   EQU   SVAREA                                                   00371000
RNCPT    EQU   ISTRNCPT+4                                               00372000
RNCPTLN  EQU   ISTRNCPT                                                 00373000
RNCGT    EQU   ISTRNCGT+4                                               00374000
RNCGTLN  EQU   ISTRNCGT                                                 00375000
RNCDT    EQU   ISTRNCDT+4                                               00376000
RNCDTLN  EQU   ISTRNCDT                                                 00377000
DDTASSOC EQU   ISTDDTVI+40                                              00378000
DDTRDTPT EQU   ISTDDTVI+36                                              00379000
DDTTRNM  EQU   ISTDDTVI+28                                              00380000
DDTBSCLN EQU   ISTDDTVI+27                                              00381000
DDTBSCID EQU   ISTDDTVI+4                                               00382000
DDTFWPTR EQU   ISTDDTVI                                                 00383000
DHDGPPTR EQU   ISTDHDVI+32                                              00384000
DHDDVOFF EQU   ISTDHDVI+28                                              00385000
DHDDTPTR EQU   ISTDHDVI+24                                              00386000
DHDDHPTR EQU   ISTDHDVI+20                                              00387000
DHDRSVD  EQU   DHDDIVTH+6                                               00388000
DHDIDLEN EQU   DHDDIVTH+4                                               00389000
DHDNUMFE EQU   DHDDIVTH+2                                               00390000
DHDNUME  EQU   DHDDIVTH                                                 00391000
DHDHNAME EQU   ISTDHDVI+4                                               00392000
DHDFWPTR EQU   ISTDHDVI                                                 00393000
DITDITT  EQU   ISTDITHD+16                                              00394000
DITLEN   EQU   ISTDITHD+15                                              00395000
DITUNUSD EQU   ISTDITHD+12                                              00396000
DITLSTNM EQU   ISTDITHD+4                                               00397000
DITFWDPT EQU   ISTDITHD                                                 00398000
LCSTRESV EQU   ISTLCST+19                                               00399000
LCSTACR3 EQU   LCSTACR                                                  00400000
LCSTACR2 EQU   LCSTACR                                                  00401000
LCSTACR1 EQU   LCSTACR                                                  00402000
LCSTACR0 EQU   LCSTACR                                                  00403000
LCSTLCCD EQU   LCSTTYPE+5                                               00404000
LCSTLCTP EQU   LCSTTYPE                                                 00405000
LCSTNAME EQU   ISTLCST+4                                                00406000
LCSTFWDP EQU   ISTLCST                                                  00407000
RNCEND   EQU   ISTRNCA+8104                                             00408000
RNCLXMDL EQU   RNCPXMDL                                                 00409000
RNCDSMDL EQU   RNCCLMDL                                                 00410000
RNCLNEO  EQU   ISTRNCA+7560                                             00411000
RNCRRT   EQU   ISTRNCA+7556                                             00412000
RNCRRTNM EQU   ISTRNCA+7552                                             00413000
RNCPTRAL EQU   ISTRNCA+7548                                             00414000
RNCPTRAF EQU   ISTRNCA+7544                                             00415000
RNCCCLU  EQU   ISTRNCA+7392                                             00416000
RNCCLTR  EQU   ISTRNCA+7184                                             00417000
RNCLNLU  EQU   ISTRNCA+7032                                             00418000
RNCLNTR  EQU   ISTRNCA+6824                                             00419000
RNCLNPX  EQU   ISTRNCA+6728                                             00420000
RNCLNCC  EQU   ISTRNCA+6596                                             00421000
RNCLNCL  EQU   ISTRNCA+6496                                             00422000
RNCGPLU  EQU   ISTRNCA+6344                                             00423000
RNCGPTR  EQU   ISTRNCA+6136                                             00424000
RNCGPPX  EQU   ISTRNCA+6040                                             00425000
RNCGPCC  EQU   ISTRNCA+5908                                             00426000
RNCGPCL  EQU   ISTRNCA+5808                                             00427000
RNCGPLN  EQU   ISTRNCA+5632                                             00428000
RNCLUDEF EQU   ISTRNCA+5480                                             00429000
RNCTRDEF EQU   ISTRNCA+5272                                             00430000
RNCPXDEF EQU   ISTRNCA+5176                                             00431000
RNCCCDEF EQU   ISTRNCA+5044                                             00432000
RNCCLDEF EQU   ISTRNCA+4944                                             00433000
RNCLNDEF EQU   ISTRNCA+4768                                             00434000
RNCOWSIF EQU   ISTRNCA+4760                                             00435000
RNCOWNER EQU   ISTRNCA+4752                                             00436000
RNCDRPCT EQU   ISTRNCA+4750                                             00437000
RNCDRLCT EQU   ISTRNCA+4748                                             00438000
RNCWORK4 EQU   ISTRNCA+4684                                             00439000
RNCLDPRM EQU   RNCWORK3                                                 00440000
RNCOCPRM EQU   RNCPHR2                                                  00441000
RNCLMDCB EQU   RNCPHR1                                                  00442000
RNCSAV3  EQU   ISTRNCA+396                                              00443000
RNCDAT2  EQU   ISTRNCA+340                                              00444000
RNCSAV2  EQU   ISTRNCA+268                                              00445000
RNCDAT1  EQU   ISTRNCA+212                                              00446000
RNCSAV1  EQU   ISTRNCA+140                                              00447000
@NM00141 EQU   ISTRNCA+136                                              00448000
@NM00140 EQU   ISTRNCA+132                                              00449000
RNCPFLG  EQU   ISTRNCA+132                                              00450000
RNCREPTO EQU   ISTRNCA+132                                              00451000
RNCACTIV EQU   ISTRNCA+132                                              00452000
RNCGICA  EQU   ISTRNCA+131                                              00453000
RNCNOBSC EQU   ISTRNCA+131                                              00454000
RNCGSYSC EQU   ISTRNCA+131                                              00455000
RNCCAMBH EQU   ISTRNCA+131                                              00456000
RNCENCR  EQU   ISTRNCA+131                                              00457000
RNCBKUP  EQU   ISTRNCA+131                                              00458000
RNCTBFR  EQU   ISTRNCA+131                                              00459000
RNCGPUIN EQU   ISTRNCA+131                                              00460000
RNCGVB   EQU   ISTRNCA+130                                              00461000
RNCGLSBD EQU   ISTRNCA+130                                              00462000
RNCGSWBD EQU   ISTRNCA+130                                              00463000
RNCGRNBD EQU   ISTRNCA+130                                              00464000
RNCGCLPU EQU   ISTRNCA+130                                              00465000
RNCGANS  EQU   ISTRNCA+130                                              00466000
RNCGINOD EQU   ISTRNCA+130                                              00467000
RNCGCUA  EQU   ISTRNCA+130                                              00468000
RNCGRNAM EQU   ISTRNCA+129                                              00469000
RNCGDLLN EQU   ISTRNCA+129                                              00470000
RNCGRGAP EQU   ISTRNCA+129                                              00471000
RNCLNID  EQU   ISTRNCA+129                                              00472000
RNCGPID  EQU   ISTRNCA+129                                              00473000
RNCLNOW  EQU   ISTRNCA+129                                              00474000
RNCGNOW  EQU   ISTRNCA+129                                              00475000
RNCLQUE  EQU   ISTRNCA+129                                              00476000
RNCDTYPE EQU   ISTRNCA+128                                              00477000
RNCGQUE  EQU   ISTRNCA+127                                              00478000
RNCGVSEQ EQU   ISTRNCA+127                                              00479000
RNCGTWX  EQU   ISTRNCA+127                                              00480000
RNCGCTRM EQU   ISTRNCA+127                                              00481000
RNCGSTBH EQU   ISTRNCA+127                                              00482000
RNCGCOMP EQU   ISTRNCA+127                                              00483000
RNCGLU   EQU   ISTRNCA+127                                              00484000
RNCGTERM EQU   ISTRNCA+127                                              00485000
RNCGPA   EQU   ISTRNCA+126                                              00486000
RNCGPU   EQU   ISTRNCA+126                                              00487000
RNCGCLUS EQU   ISTRNCA+126                                              00488000
RNCGLINE EQU   ISTRNCA+126                                              00489000
RNCGGRP  EQU   ISTRNCA+126                                              00490000
RNCGHOST EQU   ISTRNCA+126                                              00491000
RNCGBLD  EQU   ISTRNCA+126                                              00492000
RNCGPCCU EQU   ISTRNCA+126                                              00493000
RNCLPCT  EQU   ISTRNCA+124                                              00494000
RNCNODCT EQU   RNCLPNM+6                                                00495000
@NM00139 EQU   @NM00137+1                                               00496000
@NM00138 EQU   @NM00137+1                                               00497000
RNCGPOLL EQU   @NM00137+1                                               00498000
RNCGRRT  EQU   @NM00137+1                                               00499000
RNCINHIB EQU   @NM00137+1                                               00500000
RNCPULU  EQU   @NM00137+1                                               00501000
RNCCLNS  EQU   @NM00137+1                                               00502000
RNCLNNS  EQU   @NM00137+1                                               00503000
RNCGPNS  EQU   @NM00137                                                 00504000
RNCGBLDR EQU   @NM00137                                                 00505000
RNCPCOWN EQU   @NM00137                                                 00506000
RNCPCSUB EQU   @NM00137                                                 00507000
RNCPCFTP EQU   @NM00137                                                 00508000
RNCSUBAR EQU   @NM00137                                                 00509000
RNCLR    EQU   @NM00137                                                 00510000
RNCSKIP  EQU   @NM00137                                                 00511000
RNCLPNMP EQU   RNCLPNM                                                  00512000
RNCDIVT  EQU   ISTRNCA+112                                              00513000
RNCDITT  EQU   ISTRNCA+108                                              00514000
RNCLCST  EQU   ISTRNCA+104                                              00515000
RNCLWS   EQU   ISTRNCA+100                                              00516000
RNCFWS   EQU   ISTRNCA+96                                               00517000
RNCOFFS2 EQU   ISTRNCA+92                                               00518000
RNCOFFST EQU   ISTRNCA+88                                               00519000
RNCLTBLS EQU   ISTRNCA+84                                               00520000
RNCFTBLS EQU   ISTRNCA+80                                               00521000
RNCLENT  EQU   ISTRNCA+76                                               00522000
RNCFENT  EQU   ISTRNCA+72                                               00523000
RNCLRNLL EQU   ISTRNCA+68                                               00524000
RNCFRNLL EQU   ISTRNCA+64                                               00525000
RNCPX    EQU   ISTRNCA+60                                               00526000
RNCDA    EQU   ISTRNCA+56                                               00527000
RNCLLN   EQU   ISTRNCA+52                                               00528000
RNCCM    EQU   ISTRNCA+48                                               00529000
RNCIN    EQU   ISTRNCA+44                                               00530000
RNCLU    EQU   ISTRNCA+40                                               00531000
RNCTR    EQU   ISTRNCA+36                                               00532000
RNCCC    EQU   ISTRNCA+32                                               00533000
RNCCL    EQU   ISTRNCA+28                                               00534000
RNCLN    EQU   ISTRNCA+24                                               00535000
RNCGP    EQU   ISTRNCA+20                                               00536000
RNCDS    EQU   ISTRNCA+16                                               00537000
RNCSWLS  EQU   ISTRNCA+12                                               00538000
RNCRN    EQU   ISTRNCA+8                                                00539000
RNCTABNM EQU   ISTRNCA+4                                                00540000
RNCSFXCT EQU   ISTRNCA+2                                                00541000
@NM00136 EQU   ISTRNCA+1                                                00542000
RNCID    EQU   ISTRNCA                                                  00543000
DNTNAME  EQU   DNTTELNO                                                 00544000
DNTCTDIG EQU   ISTDNT                                                   00545000
DOTADTRM EQU   ISTDOT                                                   00546000
GNTGRPNM EQU   ISTGNT                                                   00547000
@NM00135 EQU   PATFLAGA                                                 00548000
@NM00134 EQU   PATFLAGA                                                 00549000
@NM00133 EQU   PATFLAGA                                                 00550000
@NM00132 EQU   PATFLAGA                                                 00551000
@NM00131 EQU   PATFLAGA                                                 00552000
@NM00130 EQU   PATFLAGA                                                 00553000
PATDCALL EQU   PATFLAGA                                                 00554000
PATUSEFG EQU   PATFLAGA                                                 00555000
PATRDCNT EQU   ISTPAT+6                                                 00556000
PATGRPID EQU   ISTPAT+5                                                 00557000
PATPTHID EQU   ISTPAT+4                                                 00558000
PATDINDX EQU   ISTPAT+2                                                 00559000
PATGINDX EQU   ISTPAT                                                   00560000
RCCEND   EQU   ISTRCC+132                                               00561000
@NM00129 EQU   ISTRCC+130                                               00562000
RCCSESCT EQU   ISTRCC+129                                               00563000
RCCCNCNT EQU   ISTRCC+128                                               00564000
RCCPUXPT EQU   ISTRCC+124                                               00565000
@NM00128 EQU   ISTRCC+122                                               00566000
RCCINDEX EQU   ISTRCC+120                                               00567000
RCCPATHZ EQU   ISTRCC+118                                               00568000
RCCCTELU EQU   ISTRCC+116                                               00569000
RCCTIMER EQU   ISTRCC+112                                               00570000
RCCPATHT EQU   ISTRCC+108                                               00571000
@NM00127 EQU   ISTRCC+107                                               00572000
@NM00126 EQU   RCCBITAN+1                                               00573000
@NM00125 EQU   RCCBITAN+1                                               00574000
@NM00124 EQU   RCCBITAN+1                                               00575000
@NM00123 EQU   RCCBITAN+1                                               00576000
@NM00122 EQU   RCCBITAN+1                                               00577000
@NM00121 EQU   RCCBITAN+1                                               00578000
RCCANS   EQU   RCCBITAN+1                                               00579000
RCCBNNSP EQU   RCCBITAN+1                                               00580000
RCCIRETR EQU   RCCBITAN                                                 00581000
RCCDSNPR EQU   RCCBITAN                                                 00582000
RCCACTPU EQU   RCCBITAN                                                 00583000
RCCBRKCN EQU   RCCBITAN                                                 00584000
RCCFINAL EQU   RCCBITAN                                                 00585000
RCCDIALP EQU   RCCBITAN                                                 00586000
RCCBRKF  EQU   RCCBITAN                                                 00587000
RCCCTPGD EQU   RCCBITAN                                                 00588000
RCCCDFLG EQU   ISTRCC+104                                               00589000
RCCPRE   EQU   ISTRCC                                                   00590000
RCDRMEND EQU   ISTRCDRM+220                                             00591000
@NM00120 EQU   ISTRCDRM+218                                             00592000
RCDRMSEQ EQU   ISTRCDRM+216                                             00593000
@NM00119 EQU   ISTRCDRM+213                                             00594000
RCDRMSC  EQU   ISTRCDRM+212                                             00595000
@NM00118 EQU   RCDRMFGS+3                                               00596000
@NM00117 EQU   RCDRMFGS+3                                               00597000
@NM00116 EQU   RCDRMFGS+3                                               00598000
@NM00115 EQU   RCDRMFGS+3                                               00599000
@NM00114 EQU   RCDRMFGS+3                                               00600000
@NM00113 EQU   RCDRMFGS+3                                               00601000
@NM00112 EQU   RCDRMFGS+3                                               00602000
RCDRMCD2 EQU   RCDRMFGS+3                                               00603000
RCDRCDRS EQU   RCDRMFGS+2                                               00604000
RCDRMDYN EQU   RCDRMFGS+2                                               00605000
RCDRMRID EQU   RCDRMFGS+2                                               00606000
RCDRMLOQ EQU   RCDRMFGS+2                                               00607000
RCDRMNMP EQU   RCDRMFGS+2                                               00608000
RCDRMPS  EQU   RCDRMFGS+2                                               00609000
RCDRMURC EQU   RCDRMFGS+2                                               00610000
RCDRMNAP EQU   RCDRMFGS+2                                               00611000
RCDRMVL  EQU   RCDRMFGS+1                                               00612000
RCDRMSPC EQU   RCDRMFGS+1                                               00613000
RCDRMINC EQU   RCDRMFGS+1                                               00614000
RCDRMLPS EQU   RCDRMFGS+1                                               00615000
RCDRMTCR EQU   RCDRMFGS+1                                               00616000
RCDRMDTC EQU   RCDRMFGS+1                                               00617000
RCDRMDT  EQU   RCDRMFGS+1                                               00618000
RCDRMCLR EQU   RCDRMFGS+1                                               00619000
RCDRMCLC EQU   RCDRMFGS                                                 00620000
RCDRMDCD EQU   RCDRMFGS                                                 00621000
RCDRMOVR EQU   RCDRMFGS                                                 00622000
RCDRMSDT EQU   RCDRMFGS                                                 00623000
RCDRMACT EQU   RCDRMFGS                                                 00624000
RCDRMSCA EQU   RCDRMFGS                                                 00625000
RCDRMPRI EQU   RCDRMFGS                                                 00626000
RCDRMHST EQU   RCDRMFGS                                                 00627000
RCDRMRP  EQU   ISTRCDRM+204                                             00628000
RCDRMLRP EQU   RCDRMRPQ+4                                               00629000
RCDRMFRP EQU   RCDRMRPQ                                                 00630000
RCDRMARP EQU   ISTRCDRM+192                                             00631000
RCDRMPDT EQU   RCDRMPDN                                                 00632000
RCDRMPR  EQU   ISTRCDRM                                                 00633000
RCDRSEND EQU   ISTRCDRS+168                                             00634000
@NM00111 EQU   ISTRCDRS+167                                             00635000
@NM00110 EQU   @NM00109                                                 00636000
RCDRDYN  EQU   @NM00109                                                 00637000
RCDTKCNT EQU   ISTRCDRS+164                                             00638000
RCDCDRMN EQU   ISTRCDRS+156                                             00639000
RCDRCDRM EQU   ISTRCDRS+148                                             00640000
RCDRSARP EQU   ISTRCDRS+144                                             00641000
RCDRSPR  EQU   ISTRCDRS                                                 00642000
RCLEND   EQU   ISTRCL+100                                               00643000
@NM00108 EQU   ISTRCL+98                                                00644000
RCLCTNGP EQU   ISTRCL+96                                                00645000
RCLCTECM EQU   ISTRCL+94                                                00646000
RCLCTETR EQU   ISTRCL+92                                                00647000
RCLGPOLA EQU   ISTRCL+88                                                00648000
RCLGPADR EQU   RCLADR+1                                                 00649000
@NM00107 EQU   RCLFLAG                                                  00650000
@NM00106 EQU   RCLFLAG                                                  00651000
@NM00105 EQU   RCLFLAG                                                  00652000
@NM00104 EQU   RCLFLAG                                                  00653000
@NM00103 EQU   RCLFLAG                                                  00654000
@NM00102 EQU   RCLFLAG                                                  00655000
@NM00101 EQU   RCLFLAG                                                  00656000
RCLBATCH EQU   RCLFLAG                                                  00657000
RCLPRE   EQU   ISTRCL                                                   00658000
RDAEND   EQU   ISTRDA+136                                               00659000
RDAPRE   EQU   ISTRDA                                                   00660000
RDSEND   EQU   ISTRDS+92                                                00661000
RDSCTATR EQU   ISTRDS+90                                                00662000
RDSCTTRM EQU   ISTRDS+88                                                00663000
RDSADDOT EQU   ISTRDS+84                                                00664000
RDSPRE   EQU   ISTRDS                                                   00665000
RGPEND   EQU   ISTRGP+96                                                00666000
@NM00100 EQU   ISTRGP+95                                                00667000
@NM00099 EQU   RGPBITAN                                                 00668000
@NM00098 EQU   RGPBITAN                                                 00669000
@NM00097 EQU   RGPBITAN                                                 00670000
RGPX21SW EQU   RGPBITAN                                                 00671000
RGPASDLC EQU   RGPBITAN                                                 00672000
RGPABSC  EQU   RGPBITAN                                                 00673000
RGPASS   EQU   RGPBITAN                                                 00674000
RGPADIL  EQU   RGPBITAN                                                 00675000
@NM00096 EQU   ISTRGP+92                                                00676000
@NM00095 EQU   ISTRGP+90                                                00677000
@NM00094 EQU   ISTRGP+88                                                00678000
@NM00093 EQU   ISTRGP+86                                                00679000
@NM00092 EQU   ISTRGP+84                                                00680000
RGPPRE   EQU   ISTRGP                                                   00681000
RINEND   EQU   ISTRIN+152                                               00682000
@NM00091 EQU   ISTRIN+150                                               00683000
@NM00090 EQU   RINFLAGS                                                 00684000
RINCHCON EQU   RINFLAGS                                                 00685000
RINTG    EQU   ISTRIN+148                                               00686000
RINXTRIN EQU   ISTRIN+144                                               00687000
RINNCPPT EQU   ISTRIN+140                                               00688000
RINREAL  EQU   ISTRIN+132                                               00689000
RINDEFTG EQU   ISTRIN+131                                               00690000
RINBCKUP EQU   RINBITAN                                                 00691000
RINCHAN  EQU   RINBITAN                                                 00692000
RINPRSWD EQU   RINBITAN                                                 00693000
RINLOCAL EQU   RINBITAN                                                 00694000
RINPEER  EQU   RINBITAN                                                 00695000
RINLDISC EQU   RINBITAN                                                 00696000
RINNODEF EQU   RINBITAN                                                 00697000
RINREMPO EQU   RINBITAN                                                 00698000
RINCNCNT EQU   ISTRIN+129                                               00699000
RINNODID EQU   ISTRIN+128                                               00700000
RINRLDAF EQU   RINDAFID+2                                               00701000
@NM00089 EQU   RINDAFID                                                 00702000
RINLOCRN EQU   ISTRIN+120                                               00703000
RINCPLVL EQU   ISTRIN+116                                               00704000
RINCTDRU EQU   ISTRIN+112                                               00705000
RINREMOT EQU   ISTRIN+108                                               00706000
RINTRENT EQU   ISTRIN+104                                               00707000
RINCRPRE EQU   ISTRIN                                                   00708000
RLCEND   EQU   ISTRLC+92                                                00709000
@NM00088 EQU   ISTRLC+91                                                00710000
RLCLCCUA EQU   ISTRLC+88                                                00711000
RLCUCBAD EQU   RLCADR+1                                                 00712000
@NM00087 EQU   RLCFLAG                                                  00713000
@NM00086 EQU   RLCFLAG                                                  00714000
@NM00085 EQU   RLCFLAG                                                  00715000
@NM00084 EQU   RLCFLAG                                                  00716000
@NM00083 EQU   RLCFLAG                                                  00717000
@NM00082 EQU   RLCFLAG                                                  00718000
RLCACNT  EQU   RLCFLAG                                                  00719000
RLCALLOC EQU   RLCFLAG                                                  00720000
RLCPRE   EQU   ISTRLC                                                   00721000
RLSEND   EQU   ISTRLS+140                                               00722000
@NM00081 EQU   ISTRLS+138                                               00723000
RLSCTELU EQU   ISTRLS+136                                               00724000
RLSPRE   EQU   ISTRLS                                                   00725000
RLUEND   EQU   ISTRLU+152                                               00726000
RLUSEQNO EQU   ISTRLU+148                                               00727000
@NM00080 EQU   RLUBITAN+1                                               00728000
@NM00079 EQU   RLUBITAN+1                                               00729000
@NM00078 EQU   RLUBITAN+1                                               00730000
@NM00077 EQU   RLUBITAN+1                                               00731000
@NM00076 EQU   RLUBITAN+1                                               00732000
@NM00075 EQU   RLUBITAN+1                                               00733000
@NM00074 EQU   RLUBITAN+1                                               00734000
@NM00073 EQU   RLUBITAN                                                 00735000
@NM00072 EQU   RLUBITAN                                                 00736000
RLULOCSE EQU   RLUBITAN                                                 00737000
RLUCLNUP EQU   RLUBITAN                                                 00738000
RLUACTLU EQU   RLUBITAN                                                 00739000
RLUCDCTL EQU   RLUBITAN                                                 00740000
RLUNDSES EQU   RLUBITAN                                                 00741000
RLUBATCH EQU   RLUBITAN                                                 00742000
RLULOCAD EQU   ISTRLU+145                                               00743000
RLUTYPE  EQU   ISTRLU+144                                               00744000
RLUCRPR  EQU   ISTRLU                                                   00745000
RLXEND   EQU   ISTRLX+96                                                00746000
@NM00071 EQU   ISTRLX+93                                                00747000
@NM00070 EQU   RLXBITAN                                                 00748000
@NM00069 EQU   RLXBITAN                                                 00749000
@NM00068 EQU   RLXBITAN                                                 00750000
@NM00067 EQU   RLXBITAN                                                 00751000
@NM00066 EQU   RLXBITAN                                                 00752000
@NM00065 EQU   RLXBITAN                                                 00753000
@NM00064 EQU   RLXBITAN                                                 00754000
RLXINUSE EQU   RLXBITAN                                                 00755000
RLXLUPTR EQU   ISTRLX+88                                                00756000
RLXNLUX  EQU   ISTRLX+84                                                00757000
RLXPRE   EQU   ISTRLX                                                   00758000
RPTEND   EQU   ISTRPT+176                                               00759000
RPTCTNM  EQU   ISTRPT+168                                               00760000
@NM00063 EQU   RPTBITAN+1                                               00761000
@NM00062 EQU   RPTBITAN+1                                               00762000
@NM00061 EQU   RPTBITAN+1                                               00763000
@NM00060 EQU   RPTBITAN+1                                               00764000
@NM00059 EQU   RPTBITAN+1                                               00765000
@NM00058 EQU   RPTBITAN+1                                               00766000
@NM00057 EQU   RPTBITAN+1                                               00767000
@NM00056 EQU   RPTBITAN+1                                               00768000
RPTISTAT EQU   RPTBITAN                                                 00769000
RPTDYNAM EQU   RPTBITAN                                                 00770000
RPTVYIMM EQU   RPTBITAN                                                 00771000
RPTVIODN EQU   RPTBITAN                                                 00772000
RPTONLIN EQU   RPTBITAN                                                 00773000
RPTHLVPD EQU   RPTBITAN                                                 00774000
RPTVRYPD EQU   RPTBITAN                                                 00775000
RPTASLEP EQU   RPTBITAN                                                 00776000
RPTDAFSV EQU   ISTRPT+164                                               00777000
RPTPTHCT EQU   ISTRPT+162                                               00778000
RPTPEPCT EQU   ISTRPT+160                                               00779000
RPTNSNSV EQU   ISTRPT+156                                               00780000
RPTUTERM EQU   ISTRPT+152                                               00781000
RPTATERM EQU   ISTRPT+148                                               00782000
RPTDIVT  EQU   RPTDITT                                                  00783000
@NM00055 EQU   RPTXTCID+4                                               00784000
RPTLNDAF EQU   RPTLNCID+2                                               00785000
RPTLNSAF EQU   RPTLNCID                                                 00786000
RPTLN    EQU   ISTRPT                                                   00787000
RPXEND   EQU   ISTRPX+96                                                00788000
@NM00054 EQU   ISTRPX+93                                                00789000
RPXMAXLU EQU   ISTRPX+92                                                00790000
RPXPUPTR EQU   ISTRPX+88                                                00791000
RPXFLUX  EQU   ISTRPX+84                                                00792000
RPXPRE   EQU   ISTRPX                                                   00793000
RRNEND   EQU   ISTRRN+332                                               00794000
RRNLDRID EQU   ISTRRN+324                                               00795000
RRNCLDST EQU   ISTRRN+316                                               00796000
RRNGDSTA EQU   ISTRRN+308                                               00797000
RRNGLSTA EQU   ISTRRN+300                                               00798000
RRNLDCAT EQU   RRNLDFSM                                                 00799000
RRNVRID  EQU   ISTRRN+296                                               00800000
RRNPUXTN EQU   ISTRRN+292                                               00801000
RRNLUCT  EQU   ISTRRN+290                                               00802000
RRNPUCT  EQU   ISTRRN+288                                               00803000
RRNLPPTR EQU   ISTRRN+284                                               00804000
RRNTPPTR EQU   ISTRRN+280                                               00805000
RRNFNAEQ EQU   ISTRRN+276                                               00806000
@NM00053 EQU   ISTRRN+264                                               00807000
@NM00052 EQU   ISTRRN+260                                               00808000
RRNNMNCP EQU   ISTRRN+252                                               00809000
@NM00051 EQU   ISTRRN+249                                               00810000
RRNAMNUM EQU   ISTRRN+248                                               00811000
RRNAMLST EQU   ISTRRN+244                                               00812000
RRNCDPWE EQU   ISTRRN+240                                               00813000
RRNPUBI  EQU   RRNNMDPD+6                                               00814000
RRNDPLUB EQU   RRNNMDPD                                                 00815000
RRNINBFR EQU   ISTRRN+231                                               00816000
RRNDEFLV EQU   ISTRRN+230                                               00817000
RRNRNCUA EQU   ISTRRN+227                                               00818000
RRNRDCUA EQU   ISTRRN+224                                               00819000
RRNNCPNM EQU   ISTRRN+217                                               00820000
RRNCTPCC EQU   ISTRRN+216                                               00821000
RRNCPLUB EQU   ISTRRN+210                                               00822000
RRNDELAY EQU   ISTRRN+208                                               00823000
RRNMODL  EQU   RRNLVL+2                                                 00824000
RRNRELL  EQU   RRNLVL                                                   00825000
@NM00050 EQU   RRNBITAN+2                                               00826000
@NM00049 EQU   RRNBITAN+2                                               00827000
RRNAMLDA EQU   RRNBITAN+2                                               00828000
RRNLODNO EQU   RRNBITAN+2                                               00829000
RRNLODYS EQU   RRNBITAN+2                                               00830000
RRNRBMDL EQU   RRNBITAN+2                                               00831000
RRNALLOC EQU   RRNBITAN+2                                               00832000
RRNACQRD EQU   RRNBITAN+2                                               00833000
RRNREMPO EQU   RRNBITAN+1                                               00834000
RRNRBBUP EQU   RRNBITAN+1                                               00835000
RRNRBCT2 EQU   RRNBITAN+1                                               00836000
RRNRBCT1 EQU   RRNBITAN+1                                               00837000
RRNRBSEC EQU   RRNBITAN+1                                               00838000
RRNRBCCT EQU   RRNBITAN+1                                               00839000
RRNRBCCL EQU   RRNBITAN+1                                               00840000
RRNRBREM EQU   RRNBITAN+1                                               00841000
RRNRSYN  EQU   RRNBITAN                                                 00842000
RRNRAPEP EQU   RRNBITAN                                                 00843000
RRNRANCP EQU   RRNBITAN                                                 00844000
RRNRAOLT EQU   RRNBITAN                                                 00845000
RRNRASYN EQU   RRNBITAN                                                 00846000
RRNRADMP EQU   RRNBITAN                                                 00847000
RRNRAIPL EQU   RRNBITAN                                                 00848000
RRNRASHT EQU   RRNBITAN                                                 00849000
RRNHSTID EQU   ISTRRN+200                                               00850000
RRNHBUFS EQU   ISTRRN+198                                               00851000
RRNHLENT EQU   RRNHPRE+1                                                00852000
RRNHLENH EQU   RRNHPRE                                                  00853000
RRNNODCT EQU   ISTRRN+194                                               00854000
RRNEPADR EQU   ISTRRN+192                                               00855000
RRNCTENT EQU   ISTRRN+190                                               00856000
RRNCTECM EQU   ISTRRN+188                                               00857000
RRNCTEIN EQU   ISTRRN+186                                               00858000
RRNCTETR EQU   ISTRRN+184                                               00859000
RRNCTECL EQU   ISTRRN+182                                               00860000
RRNCTELI EQU   ISTRRN+180                                               00861000
RRNCTEGP EQU   ISTRRN+178                                               00862000
RRNCTBHS EQU   ISTRRN+176                                               00863000
RRNTABCT EQU   ISTRRN+172                                               00864000
RRNLASTE EQU   ISTRRN+168                                               00865000
RRNNCSPL EQU   ISTRRN+164                                               00866000
RRNRPLPT EQU   ISTRRN+160                                               00867000
RRNMSIZE EQU   ISTRRN+156                                               00868000
RRNFLUX  EQU   ISTRRN+152                                               00869000
RRNBHSET EQU   ISTRRN+148                                               00870000
RRNRINQP EQU   ISTRRN+144                                               00871000
RRNGRPA  EQU   ISTRRN+140                                               00872000
RRNLUBA  EQU   RRNUCBAD+1                                               00873000
RRNCHQI  EQU   RRNUCBAD                                                 00874000
@NM00048 EQU   RRNFLAG                                                  00875000
RRNACBAQ EQU   RRNFLAG                                                  00876000
RRNCHCON EQU   RRNFLAG                                                  00877000
RRNVFYLM EQU   RRNFLAG                                                  00878000
RRNLDET  EQU   RRNFLAG                                                  00879000
RRNRIMIP EQU   RRNFLAG                                                  00880000
RRNLCDIE EQU   RRNFLAG                                                  00881000
RRNLCSIP EQU   RRNFLAG                                                  00882000
RRNPRE   EQU   ISTRRN                                                   00883000
RSWEND   EQU   ISTRSW+152                                               00884000
@NM00047 EQU   ISTRSW+150                                               00885000
RSWCTELU EQU   ISTRSW+148                                               00886000
RSWGRUPZ EQU   ISTRSW+146                                               00887000
RSWDIALZ EQU   ISTRSW+144                                               00888000
RSWGRUPT EQU   ISTRSW+140                                               00889000
RSWDIALT EQU   ISTRSW+136                                               00890000
RSWPRE   EQU   ISTRSW                                                   00891000
RTREND   EQU   ISTRTR+208                                               00892000
RTRCADDR EQU   ISTRTR+200                                               00893000
RTRBHSN1 EQU   ISTRTR+192                                               00894000
RTRIDCAS EQU   RTRBSCID+1                                               00895000
RTRIDLEN EQU   RTRBSCID                                                 00896000
RTRLCTI  EQU   ISTRTR+170                                               00897000
RTRTRMAX EQU   ISTRTR+169                                               00898000
@NM00046 EQU   RTRBITAN+4                                               00899000
@NM00045 EQU   RTRBITAN+4                                               00900000
@NM00044 EQU   RTRBITAN+4                                               00901000
@NM00043 EQU   RTRBITAN+4                                               00902000
@NM00042 EQU   RTRBITAN+4                                               00903000
@NM00041 EQU   RTRBITAN+4                                               00904000
@NM00040 EQU   RTRBITAN+4                                               00905000
@NM00039 EQU   RTRBITAN+4                                               00906000
@NM00038 EQU   RTRBITAN+3                                               00907000
RTRDTRLM EQU   RTRBITAN+3                                               00908000
RTRRAATN EQU   RTRBITAN+3                                               00909000
RTRLSCMD EQU   RTRBITAN+3                                               00910000
RTRRFDEK EQU   RTRBITAN+3                                               00911000
RTRRFANK EQU   RTRBITAN+3                                               00912000
RTRRFPFK EQU   RTRBITAN+3                                               00913000
RTRRFPEN EQU   RTRBITAN+3                                               00914000
RTRRFXCT EQU   RTRBITAN+2                                               00915000
RTRRESCT EQU   RTRBITAN+2                                               00916000
RTRRESUP EQU   RTRBITAN+2                                               00917000
RTRREATT EQU   RTRBITAN+2                                               00918000
RTRRECHK EQU   RTRBITAN+2                                               00919000
RTRREACR EQU   RTRBITAN+2                                               00920000
@NM00037 EQU   RTRBITAN+2                                               00921000
RTRREBRK EQU   RTRBITAN+2                                               00922000
RTRRDBHI EQU   RTRBITAN+1                                               00923000
RTRRDBHD EQU   RTRBITAN+1                                               00924000
RTRRDBHN EQU   RTRBITAN+1                                               00925000
RTRRCXMS EQU   RTRBITAN+1                                               00926000
RTRRCMSG EQU   RTRBITAN+1                                               00927000
RTRRCBLK EQU   RTRBITAN+1                                               00928000
RTRRCPT3 EQU   RTRBITAN+1                                               00929000
RTRRCIT2 EQU   RTRBITAN+1                                               00930000
RTRRCIT1 EQU   RTRBITAN                                                 00931000
RTRRBEND EQU   RTRBITAN                                                 00932000
RTRRBECT EQU   RTRBITAN                                                 00933000
RTRRACTR EQU   RTRBITAN                                                 00934000
RTRRACDT EQU   RTRBITAN                                                 00935000
RTRRAPT3 EQU   RTRRAALL                                                 00936000
RTRRAPT2 EQU   RTRRAALL                                                 00937000
RTRRAPT1 EQU   RTRRAALL                                                 00938000
RTRCTADR EQU   ISTRTR+162                                               00939000
RTRCTPOL EQU   ISTRTR+160                                               00940000
RTRCTDIA EQU   ISTRTR+158                                               00941000
RTRCTECM EQU   ISTRTR+156                                               00942000
RTRDIAA  EQU   ISTRTR+152                                               00943000
RTRPOLA  EQU   ISTRTR+148                                               00944000
RTRADRPT EQU   RTRADR+1                                                 00945000
@NM00036 EQU   RTRFLAG                                                  00946000
@NM00035 EQU   RTRFLAG                                                  00947000
@NM00034 EQU   RTRFLAG                                                  00948000
@NM00033 EQU   RTRFLAG                                                  00949000
@NM00032 EQU   RTRFLAG                                                  00950000
@NM00031 EQU   RTRFLAG                                                  00951000
@NM00030 EQU   RTRFLAG                                                  00952000
RTRVTERM EQU   RTRFLAG                                                  00953000
RTRCRPR  EQU   ISTRTR                                                   00954000
RAPREND  EQU   ISTRAPRE+144                                             00955000
RAPHPRE  EQU   ISTRAPRE                                                 00956000
RPUEND   EQU   ISTRPU+104                                               00957000
RPUENTAD EQU   ISTRPU+100                                               00958000
RPUIDNUM EQU   RPUID48+3                                                00959000
RPUIDBLK EQU   RPUID48+2                                                00960000
RPUIDPA2 EQU   RPUID48+1                                                00961000
RPUIDPUT EQU   RPUID48                                                  00962000
RPUIDPA1 EQU   RPUSTAID                                                 00963000
RPUPASSL EQU   ISTRPU+91                                                00964000
RPUMXOUT EQU   ISTRPU+90                                                00965000
RPUMXDAT EQU   ISTRPU+88                                                00966000
RPURSV01 EQU   ISTRPU+87                                                00967000
RPURETYM EQU   ISTRPU+86                                                00968000
RPUADDR  EQU   ISTRPU+85                                                00969000
RPUTYPE  EQU   ISTRPU+84                                                00970000
RPUPRE   EQU   ISTRPU                                                   00971000
RLNEND   EQU   ISTRLN+136                                               00972000
RLNTGCS  EQU   ISTRLN+135                                               00973000
RLNCURTR EQU   ISTRLN+134                                               00974000
RLNINBMX EQU   RLNINBFR+1                                               00975000
RLNINBN  EQU   RLNINBFR                                                 00976000
RLNRTYM  EQU   ISTRLN+131                                               00977000
RLNSERVL EQU   ISTRLN+130                                               00978000
RLNREPTO EQU   ISTRLN+129                                               00979000
RLNACTTO EQU   ISTRLN+128                                               00980000
RLNCTPCC EQU   ISTRLN+127                                               00981000
RLNPUBI  EQU   ISTRLN+126                                               00982000
RLNDCUA  EQU   ISTRLN+123                                               00983000
RLNCUA   EQU   ISTRLN+120                                               00984000
RLNPAUSE EQU   ISTRLN+119                                               00985000
RLNPOLMT EQU   ISTRLN+118                                               00986000
RLNCTSES EQU   ISTRLN+117                                               00987000
@NM00029 EQU   ISTRLN+116                                               00988000
@NM00028 EQU   RLNBITAN+3                                               00989000
@NM00027 EQU   RLNBITAN+3                                               00990000
RLNSWEP  EQU   RLNBITAN+3                                               00991000
RLNSVSKP EQU   RLNLSCMD                                                 00992000
RLNSESLM EQU   RLNLSCMD                                                 00993000
RLNNPRLM EQU   RLNLSCMD                                                 00994000
RLNSWNCP EQU   RLNBITAN+3                                               00995000
RLNACTLN EQU   RLNBITAN+2                                               00996000
@NM00026 EQU   RLNBITAN+2                                               00997000
@NM00025 EQU   RLNBITAN+2                                               00998000
@NM00024 EQU   RLNBITAN+2                                               00999000
@NM00023 EQU   RLNBITAN+2                                               01000000
RLNDCALL EQU   RLNCONCT                                                 01001000
RLNAUTO  EQU   RLNCONCT                                                 01002000
RLNMANUL EQU   RLNCONCT                                                 01003000
@NM00022 EQU   RLNBITAN+1                                               01004000
RLNWANSW EQU   RLNBITAN+1                                               01005000
RLNINUSE EQU   RLNBITAN+1                                               01006000
RLNMULTP EQU   RLNBITAN+1                                               01007000
RLNIDV   EQU   RLNBITAN+1                                               01008000
RLNTTV   EQU   RLNBITAN+1                                               01009000
@NM00021 EQU   RLNBITAN+1                                               01010000
RLNRBUSE EQU   RLNBITAN+1                                               01011000
RLNRAPEP EQU   RLNBITAN                                                 01012000
RLNRANCP EQU   RLNBITAN                                                 01013000
RLNRAEP  EQU   RLNBITAN                                                 01014000
RLNRAPOL EQU   RLNBITAN                                                 01015000
RLNRATRN EQU   RLNBITAN                                                 01016000
RLNGANSW EQU   RLNBITAN                                                 01017000
RLNRACAN EQU   RLNRACNT                                                 01018000
RLNRACAT EQU   RLNRACNT                                                 01019000
@NM00020 EQU   ISTRLN+111                                               01020000
RLNMAXLA EQU   ISTRLN+110                                               01021000
RLNDESAM EQU   ISTRLN+109                                               01022000
RLNCURAM EQU   ISTRLN+108                                               01023000
RLNACTSN EQU   RLNCSLRC+2                                               01024000
RLNACTRM EQU   RLNCSLRC+1                                               01025000
RLNLRC   EQU   RLNCSLRC                                                 01026000
RLNAUTOA EQU   ISTRLN+102                                               01027000
RLNACTCT EQU   ISTRLN+100                                               01028000
RLNCTECM EQU   ISTRLN+98                                                01029000
RLNCTEIN EQU   ISTRLN+96                                                01030000
RLNCTETR EQU   ISTRLN+94                                                01031000
RLNCTECL EQU   ISTRLN+92                                                01032000
RLNENTAD EQU   ISTRLN+88                                                01033000
RLNLUBA  EQU   RLNUCBAD+1                                               01034000
RLNCHQI  EQU   RLNUCBAD                                                 01035000
@NM00019 EQU   RLNFLAG                                                  01036000
@NM00018 EQU   RLNFLAG                                                  01037000
RLNIDACT EQU   RLNFLAG                                                  01038000
RLNCHAN  EQU   RLNFLAG                                                  01039000
RLNACLNK EQU   RLNFLAG                                                  01040000
RLNBKDUP EQU   RLNFLAG                                                  01041000
RLNBCKUP EQU   RLNFLAG                                                  01042000
RLNCDLNK EQU   RLNFLAG                                                  01043000
RLNPRE   EQU   ISTRLN                                                   01044000
RDTEND   EQU   ISTRDT+136                                               01045000
RDTVSRPL EQU   RDTCRIA+16                                               01046000
RDTCRSPW EQU   RDTCRIA+8                                                01047000
RDTCRSDS EQU   RDTCRIA                                                  01048000
@NM00017 EQU   ISTRDT+114                                               01049000
@NM00016 EQU   RDTBITAN                                                 01050000
@NM00015 EQU   RDTBITAN                                                 01051000
@NM00014 EQU   RDTBITAN                                                 01052000
RDTSSFLG EQU   RDTBITAN                                                 01053000
RDTHCDRM EQU   RDTBITAN                                                 01054000
RDTBHSET EQU   RDTBITAN                                                 01055000
RDTCDCTL EQU   RDTBITAN                                                 01056000
RDTCTPGD EQU   RDTBITAN                                                 01057000
RDTLGCT  EQU   ISTRDT+112                                               01058000
RDTNODID EQU   ISTRDT+111                                               01059000
RDTMAXID EQU   ISTRDT+110                                               01060000
@NM00013 EQU   ISTRDT+108                                               01061000
RDTVYRPH EQU   ISTRDT+104                                               01062000
RDTBACK  EQU   ISTRDT+100                                               01063000
RDTFORW  EQU   ISTRDT+96                                                01064000
RDTNAMTB EQU   ISTRDT+92                                                01065000
RDTENTAD EQU   ISTRDT+88                                                01066000
RDTLEN   EQU   RDTPLEN+1                                                01067000
RDTPRICA EQU   RDTPRIOR                                                 01068000
RDTPRILS EQU   RDTPRIOR                                                 01069000
RDTPRISW EQU   RDTPRIOR                                                 01070000
RDTPRIRN EQU   RDTPRIOR                                                 01071000
RDTPRILC EQU   RDTPRIOR                                                 01072000
RDTPRIAP EQU   RDTPRIOR                                                 01073000
RDTCDRSC EQU   RDTPRIOR                                                 01074000
RDTCDRM  EQU   RDTPRIOR                                                 01075000
RDTPRE   EQU   ISTRDT                                                   01076000
RAPEND   EQU   ISTRAP+188                                               01077000
RAPMAXPV EQU   ISTRAP+184                                               01078000
RAPAPPWD EQU   ISTRAP+176                                               01079000
RAPACBN  EQU   ISTRAP+168                                               01080000
@NM00012 EQU   RAPBITAN+2                                               01081000
@NM00011 EQU   RAPBITAN+2                                               01082000
RAPSRTLN EQU   RAPBITAN+2                                               01083000
RAPSONSC EQU   RAPBITAN+2                                               01084000
RAPVFRR  EQU   RAPBITAN+2                                               01085000
RAPSRBX  EQU   RAPBITAN+2                                               01086000
@NM00010 EQU   RAPBITAN+2                                               01087000
RAPCSMA  EQU   RAPBITAN+2                                               01088000
RAPTSO   EQU   RAPBITAN+1                                               01089000
RAPAUTHE EQU   RAPBITAN+1                                               01090000
RAPANVPC EQU   RAPBITAN+1                                               01091000
RAPASPO  EQU   RAPBITAN+1                                               01092000
RAPAPPO  EQU   RAPBITAN+1                                               01093000
RAPAACQ  EQU   RAPBITAN+1                                               01094000
RAPAPRMT EQU   RAPBITAN+1                                               01095000
RAPAPASS EQU   RAPBITAN+1                                               01096000
RAPABLCK EQU   RAPBITAN                                                 01097000
RAPALLF  EQU   RAPBITAN                                                 01098000
RAPPARS  EQU   RAPBITAN                                                 01099000
RAPLSIZ  EQU   RAPBITAN                                                 01100000
RAPATLGN EQU   RAPBITAN                                                 01101000
RAPASLGI EQU   RAPBITAN                                                 01102000
RAPAQUI  EQU   RAPBITAN                                                 01103000
RAPABLGN EQU   RAPBITAN                                                 01104000
RAPBFACT EQU   ISTRAP+164                                               01105000
RAPBNA   EQU   ISTRAP+162                                               01106000
RAPEAS   EQU   ISTRAP+160                                               01107000
RAPACDEB EQU   ISTRAP+156                                               01108000
RAPACBA  EQU   ISTRAP+152                                               01109000
RAPENTAD EQU   ISTRAP+148                                               01110000
@NM00009 EQU   ISTRAP+146                                               01111000
RAPTRPRE EQU   ISTRAP+144                                               01112000
RAPPRE   EQU   ISTRAP                                                   01113000
RCPEND   EQU   ISTRCPRE+144                                             01114000
RCPLGMOD EQU   ISTRCPRE+136                                             01115000
RCPDLGMD EQU   ISTRCPRE+128                                             01116000
RCPLGNAP EQU   ISTRCPRE+120                                             01117000
RCPQCNT  EQU   ISTRCPRE+118                                             01118000
@NM00008 EQU   ISTRCPRE+117                                             01119000
RCPOSAIP EQU   RCPBITAN                                                 01120000
RCPVLMSG EQU   RCPBITAN                                                 01121000
RCPCSM   EQU   RCPBITAN                                                 01122000
RCPALLOC EQU   RCPBITAN                                                 01123000
RCPSEC   EQU   RCPBITAN                                                 01124000
RCPSESSC EQU   RCPSESSM                                                 01125000
RCPSESPR EQU   RCPSESSM                                                 01126000
RCPSSCFM EQU   ISTRCPRE+114                                             01127000
RCPSTCAP EQU   RCPCYSET                                                 01128000
RCPSTRQD EQU   RCPCYSET                                                 01129000
RCPMDCAP EQU   RCPCYMOD                                                 01130000
RCPMDRQD EQU   RCPCYMOD                                                 01131000
RCPPRIM  EQU   RCPPMODE                                                 01132000
RCPCROSS EQU   RCPPMODE                                                 01133000
RCPRRECD EQU   RCPPMODE                                                 01134000
RCPRBASC EQU   RCPPMODE                                                 01135000
RCPBFLIM EQU   ISTRCPRE+112                                             01136000
RCPNCPPM EQU   RCPNCPPC+1                                               01137000
RCPNCPPN EQU   RCPNCPPC                                                 01138000
RCPPACEM EQU   RCPPACE+1                                                01139000
RCPPACEN EQU   RCPPACE                                                  01140000
RCPBHSI2 EQU   ISTRCPRE+107                                             01141000
RCPBHSI1 EQU   ISTRCPRE+106                                             01142000
RCPSESLM EQU   ISTRCPRE+104                                             01143000
RCPSESCT EQU   ISTRCPRE+102                                             01144000
RCPINTTI EQU   ISTRCPRE+100                                             01145000
RCPUSSTI EQU   ISTRCPRE+98                                              01146000
RCPMODTI EQU   ISTRCPRE+96                                              01147000
RCPLNAPA EQU   ISTRCPRE+92                                              01148000
RCPSIBS  EQU   RCPSARRY+4                                               01149000
RCPSIBP  EQU   RCPSARRY                                                 01150000
RCPPRE   EQU   ISTRCPRE                                                 01151000
RPREND   EQU   ISTRPRE+84                                               01152000
RPRDEVCH EQU   ISTRPRE+76                                               01153000
RPRCONID EQU   ISTRPRE+67                                               01154000
@NM00007 EQU   RPRFLAGS                                                 01155000
RPRDYNAM EQU   RPRFLAGS                                                 01156000
RPRNOACT EQU   RPRFLAGS                                                 01157000
RPRDAFAD EQU   RPRBITAN+4                                               01158000
RPRENTVA EQU   RPRBITAN+4                                               01159000
RPRDUMMY EQU   RPRBITAN+4                                               01160000
RPRIMPCH EQU   RPRBITAN+4                                               01161000
RPRIMPAC EQU   RPRBITAN+4                                               01162000
RPRNEO   EQU   RPRBITAN+4                                               01163000
RPRRNAA  EQU   RPRBITAN+4                                               01164000
RPRDRADD EQU   RPRBITAN+4                                               01165000
RPRFADD  EQU   RPRBITAN+3                                               01166000
RPRINTST EQU   RPRBITAN+3                                               01167000
RPRCLVPD EQU   RPRBITAN+3                                               01168000
RPRSHAD  EQU   RPRBITAN+3                                               01169000
RPRGIST  EQU   RPRBITAN+3                                               01170000
RPRRBISA EQU   RPRBITAN+3                                               01171000
RPRENTVT EQU   RPRBITAN+3                                               01172000
RPRDINOP EQU   RPRBITAN+3                                               01173000
RPRDINUS EQU   RPRBITAN+2                                               01174000
RPRCRCPT EQU   RPRBITAN+2                                               01175000
RPRNOSRT EQU   RPRBITAN+2                                               01176000
RPRDOM   EQU   RPRBITAN+2                                               01177000
RPRNOUSE EQU   RPRBITAN+2                                               01178000
RPRNOSNA EQU   RPRBITAN+2                                               01179000
RPRCLNUP EQU   RPRBITAN+2                                               01180000
RPRCONLD EQU   RPRBITAN+2                                               01181000
RPRCONP  EQU   RPRBITAN+1                                               01182000
RPRACTP  EQU   RPRBITAN+1                                               01183000
RPRINTIO EQU   RPRBITAN+1                                               01184000
RPRCONCT EQU   RPRBITAN+1                                               01185000
RPRHLVPD EQU   RPRBITAN+1                                               01186000
RPRHLACT EQU   RPRBITAN+1                                               01187000
RPRONLIN EQU   RPRBITAN+1                                               01188000
RPRRINOP EQU   RPRBITAN+1                                               01189000
RPRAOPN  EQU   RPRBITAN                                                 01190000
RPRENTVH EQU   RPRBITAN                                                 01191000
RPRLIVE  EQU   RPRBITAN                                                 01192000
RPRENTED EQU   RPRBITAN                                                 01193000
RPRLTASN EQU   RPRBITAN                                                 01194000
RPRENTIO EQU   RPRBITAN                                                 01195000
RPRENTBF EQU   RPRBITAN                                                 01196000
RPRINV   EQU   RPRBITAN                                                 01197000
RPRDEFLV EQU   RPRSTATE+4                                               01198000
RPRDESS1 EQU   RPRDESST                                                 01199000
RPRCURS1 EQU   RPRCURST                                                 01200000
RPRCMDWE EQU   ISTRPRE+52                                               01201000
RPRTNTQP EQU   ISTRPRE+48                                               01202000
RPRNSNEA EQU   ISTRPRE+44                                               01203000
RPRNCBA  EQU   ISTRPRE+40                                               01204000
RPRPELEN EQU   ISTRPRE+36                                               01205000
RPRELEN  EQU   ISTRPRE+32                                               01206000
RPRALPAD EQU   ISTRPRE+28                                               01207000
RPRENTAD EQU   ISTRPRE+24                                               01208000
RPRREQCT EQU   ISTRPRE+22                                               01209000
RPRINDEX EQU   ISTRPRE+20                                               01210000
RPRDAF   EQU   RPRDAFID+2                                               01211000
@NM00006 EQU   RPRDAFID                                                 01212000
@NM00005 EQU   ISTRPRE+15                                               01213000
RPRHDTYP EQU   ISTRPRE+14                                               01214000
RPRENTRY EQU   ISTRPRE+13                                               01215000
RPRNAME  EQU   RPRSRTHD                                                 01216000
LOKXCL   EQU   @NM00003                                                 01217000
LOKPRY   EQU   @NM00003                                                 01218000
@NM00004 EQU   @NM00003                                                 01219000
@NM00002 EQU   LOKCHNG                                                  01220000
LOKCT    EQU   ISTLOK                                                   01221000
SRTTYPE  EQU   ISTSRT+12                                                01222000
SRTSPECE EQU   SRTSRTE                                                  01223000
SRTSYMNM EQU   ISTSRT                                                   01224000
DEVRSV01 EQU   ISTDEVCH+7                                               01225000
DEVAUXTP EQU   ISTDEVCH+6                                               01226000
DEVADVFE EQU   DEVMODE                                                  01227000
@NM00001 EQU   DEVMODE                                                  01228000
DEVBASIC EQU   DEVMODE                                                  01229000
DEVREC   EQU   DEVMODE                                                  01230000
DEVPHYSA EQU   ISTDEVCH+4                                               01231000
DEVCSLPN EQU   DEVCHAR3                                                 01232000
DEVCSTCL EQU   DEVCHAR3                                                 01233000
DEVCCHEK EQU   DEVCHAR3                                                 01234000
DEVCATTN EQU   DEVCHAR3                                                 01235000
DEVCSWL  EQU   DEVFCCTL                                                 01236000
DEVCRVB  EQU   DEVFCCTL                                                 01237000
DEVCSSL  EQU   DEVFCCTL                                                 01238000
DEVCBSC  EQU   DEVFCCTL                                                 01239000
DEVMCODE EQU   ISTDEVCH+2                                               01240000
DEVCHAR2 EQU   DEVTCODE                                                 01241000
DEVSPOLL EQU   DEVCHAR                                                  01242000
DEVCCTL  EQU   DEVCHAR                                                  01243000
DEVNNSPT EQU   DEVCHAR                                                  01244000
DEVSPS   EQU   DEVCHAR                                                  01245000
DEVSUBND EQU   DEVCHAR                                                  01246000
DEVCONVR EQU   DEVCHAR                                                  01247000
DEVOTPUT EQU   DEVCHAR                                                  01248000
DEVINPUT EQU   DEVCHAR                                                  01249000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01250000
@RC00235 EQU   @RC00227                                                 01251000
@ENDDATA EQU   *                                                        01252000
         END   ISTSDCC4,(C'PLS2157',0702,80232)                         01253000
