         TITLE 'ISTSDCOD  DEVICE TYPE CHAR STRING TABLE'                00001000
ISTSDCOD CSECT                                                          00002000
@DATA    DS    0H                                                       00003000
         DS    0F                                                       00004000
         DS    0F                                                       00005000
         DS    0D                                                       00006000
@NM00001 DC    F'129'                                                   00007000
@NM00002 DC    CL4'2740'                                                00008000
         DC    CL4'2741'                                                00009000
         DC    CL4'1050'                                                00010000
         DC    CL4'TWX '                                                00011000
         DC    CL4'WTTY'                                                00012000
         DC    CL4'115A'                                                00013000
         DC    CL4'83B3'                                                00014000
         DC    CL4'2715'                                                00015000
         DC    CL4'2770'                                                00016000
         DC    CL4'2780'                                                00017000
         DC    CL4'3735'                                                00018000
         DC    CL4'3780'                                                00019000
         DC    CL4'1130'                                                00020000
         DC    CL4'1800'                                                00021000
         DC    CL4'2020'                                                00022000
         DC    CL4'2025'                                                00023000
         DC    CL4'3125'                                                00024000
         DC    CL4'3135'                                                00025000
         DC    CL4'SYS3'                                                00026000
         DC    CL4'2701'                                                00027000
         DC    CL4'2703'                                                00028000
         DC    CL4'3704'                                                00029000
         DC    CL4'3705'                                                00030000
         DC    CL4'2980'                                                00031000
         DC    CL4'3277'                                                00032000
         DC    CL4'3284'                                                00033000
         DC    CL4'3286'                                                00034000
         DC    CL4'3275'                                                00035000
         DC    CL4'3741'                                                00036000
         DC    CL4'3747'                                                00037000
         DC    9X'00000000'                                             00038000
         DC    CL4'MTA '                                                00039000
         DC    10X'00000000'                                            00040000
         DC    CL4'2972'                                                00041000
         DC    CL4'3271'                                                00042000
         DC    CL4'CC01'                                                00043000
         DC    CL4'3272'                                                00044000
         DC    45X'00000000'                                            00045000
         DC    CL4'1052'                                                00046000
         DC    CL4'1053'                                                00047000
         DC    CL4'1054'                                                00048000
         DC    CL4'1055'                                                00049000
         DC    CL4'1056'                                                00050000
         DC    CL4'1057'                                                00051000
         DC    CL4'1058'                                                00052000
         DC    CL4'1092'                                                00053000
         DC    CL4'1093'                                                00054000
         DC    CL4'LU01'                                                00055000
         DC    10X'00000000'                                            00056000
         DC    CL4'545 '                                                00057000
         DC    CL4'1017'                                                00058000
         DC    CL4'1018'                                                00059000
         DC    CL4'2203'                                                00060000
         DC    CL4'2213'                                                00061000
         DC    CL4'2265'                                                00062000
         DC    CL4'2502'                                                00063000
         DC    CL4'50  '                                                00064000
         DC    CL4'1255'                                                00065000
         DC    CL4'5496'                                                00066000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00067000
@01      EQU   01                                                       00068000
@02      EQU   02                                                       00069000
@03      EQU   03                                                       00070000
@04      EQU   04                                                       00071000
@05      EQU   05                                                       00072000
@06      EQU   06                                                       00073000
@07      EQU   07                                                       00074000
@08      EQU   08                                                       00075000
@09      EQU   09                                                       00076000
@10      EQU   10                                                       00077000
@11      EQU   11                                                       00078000
@12      EQU   12                                                       00079000
@13      EQU   13                                                       00080000
@14      EQU   14                                                       00081000
@15      EQU   15                                                       00082000
@ENDDATA EQU   *                                                        00083000
         END   ISTSDCOD,(C'PLS2159',0702,80232)                         00084000
