         TITLE 'ISTSC024-DPRINT'                                        00001000
ISTSC024 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTSC024  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  ST    @14,12(,@13)                                        0001 00009000
         STM   @00,@12,20(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
*   R14=R13;                        /* HOLD CALLER'S SVAREA PTR      */ 00014000
         LR    R14,R13                                             0077 00015000
*   R13=ADDR(SVESC024);             /* POINT TO MY SAVE AREA         */ 00016000
         LA    R13,SVESC024(,WAPTR)                                0078 00017000
*   BACKSAVE(3)=R13;                /* PUT MY SVAREA PTR IN CALLR    */ 00018000
         STCM  R13,15,BACKSAVE+8(R14)                              0079 00019000
*   SVESC024(2)=R14;                /* PUT CALLER'S SVAREA PTR IN MY    00020000
*                                      SAVE AREA                     */ 00021000
         ST    R14,SVESC024+4(,WAPTR)                              0080 00022000
*   $24SAV13=$R13PTR;               /* SAVE PTR TO DPR CALLER        */ 00023000
         L     @14,$R13PTR(,WAPTR)                                 0081 00024000
         ST    @14,$24SAV13(,WAPTR)                                0081 00025000
*   $R13PTR=R13;                    /* MAKE RCM RET TO ME            */ 00026000
         ST    R13,$R13PTR(,WAPTR)                                 0082 00027000
*   $NOTRRCH=ON;                    /* NO RC HDLG & TRACE YET        */ 00028000
         OI    $NOTRRCH(WAPTR),B'00000010'                         0083 00029000
*   $24FLGS=0;                      /* RESET DPR FLAGS               */ 00030000
         MVI   $24FLGS(WAPTR),X'00'                                0084 00031000
*   $24RETCD=0;                     /* RESET DPR RET CODE            */ 00032000
         MVI   $24RETCD(WAPTR),X'00'                               0085 00033000
*   $PRTONLY=ON;                    /* PRINT ON AP ONLY              */ 00034000
         OI    $PRTONLY(WAPTR),B'00001000'                         0086 00035000
*   DPRPTR=R1;                      /* GET DPR LIST PTR VIA R1       */ 00036000
         LR    DPRPTR,R1                                           0087 00037000
*   PRTPTR=$PRTCTLW;                /* SET UP PTR TO CTL WORD        */ 00038000
         L     PRTPTR,$PRTCTLW(,DPRPTR)                            0088 00039000
*   TECBPTR=$PRTTECB;               /* SET UP TECB BASE REG          */ 00040000
         L     TECBPTR,$PRTTECB(,DPRPTR)                           0089 00041000
*   IF $ERRORDP=ON                  /* IF AN ERROR DPRINT,           */ 00042000
*     THEN                          /* TURN ON ERROR BITS            */ 00043000
         TM    $ERRORDP(PRTPTR),B'00000010'                        0090 00044000
         BNO   @RF00090                                            0090 00045000
*     DO;                           /* IN SCT                        */ 00046000
*       $TESTERR=ON;                                               0092 00047000
*       $ASTERIK=ON;                                               0093 00048000
         OI    $TESTERR(WAPTR),B'11000000'                         0093 00049000
*     END;                                                         0094 00050000
*   IF($LOOPTST=ON|$LOOPERR=ON)     /* IF TL OR EL OPTIONS AND       */ 00051000
*       &$NOPRT=OFF                 /* NPR OPTIONSS IN EFFECT        */ 00052000
*     THEN                          /* THEN                          */ 00053000
@RF00090 TM    $LOOPTST(WAPTR),B'00000011'                         0095 00054000
         BZ    @RF00095                                            0095 00055000
         TM    $NOPRT(WAPTR),B'00000100'                           0095 00056000
         BNZ   @RF00095                                            0095 00057000
*     DO;                           /* TURN OFF $CATERR IN SCT       */ 00058000
*       $CATERR=OFF;                /* AND                           */ 00059000
         NI    $CATERR(WAPTR),B'11011111'                          0097 00060000
*       GOTO S24C9990;              /* RETURN TO OLT                 */ 00061000
         B     S24C9990                                            0098 00062000
*     END;                                                         0099 00063000
*                                                                  0099 00064000
*/********************************************************************/ 00065000
*/* AN ERROR DPRINT CAN BE EXECUTED WHEN NO-ERROR-PRINT OPTION IS IN */ 00066000
*/* EFFECT ONLY WHEN THERE IS A CATASTROPHIC OR A FIRST ERROR        */ 00067000
*/* MESSAGE TO BE PRINTED                                            */ 00068000
*/********************************************************************/ 00069000
*                                                                  0100 00070000
*   IF $ERRORDP=ON&$NERRPRT=ON      /* IF ERROR                      */ 00071000
*     THEN                          /* DPRINT &                      */ 00072000
@RF00095 TM    $ERRORDP(PRTPTR),B'00000010'                        0100 00073000
         BNO   @RF00100                                            0100 00074000
         TM    $NERRPRT(WAPTR),B'00000100'                         0100 00075000
         BNO   @RF00100                                            0100 00076000
*     DO;                           /* NEP, AND                      */ 00077000
*       IF($CATERR=ON               /* IF CAT ERR                    */ 00078000
*           &$FSTCAT=OFF)|          /* & MSG NOT                     */ 00079000
*           ($FSTCOMM=ON            /* PRNTD OR FE                   */ 00080000
*           &$FSTFE=OFF)            /* & MSG NOT                     */ 00081000
*         THEN                                                     0102 00082000
         TM    $CATERR(WAPTR),B'00100000'                          0102 00083000
         BNO   @GL00003                                            0102 00084000
         TM    $FSTCAT(WAPTR),B'01000000'                          0102 00085000
         BZ    @RT00102                                            0102 00086000
@GL00003 TM    $FSTCOMM(WAPTR),B'00000001'                         0102 00087000
         BNO   @RF00102                                            0102 00088000
         TM    $FSTFE(WAPTR),B'10000000'                           0102 00089000
         BZ    @RT00102                                            0102 00090000
*         GOTO S24C0100;            /* PRTD GO ON                    */ 00091000
*       ELSE                                                       0104 00092000
*         GOTO S24C9990;            /* ELSE RC=0                     */ 00093000
         B     S24C9990                                            0104 00094000
*     END;                                                         0105 00095000
*S24C0100:                                                         0106 00096000
*   CVD($RTN#,DPRWORK2);            /* CONV BIN RTN# TO DECIMAL      */ 00097000
@RF00100 DS    0H                                                  0106 00098000
S24C0100 L     @14,$LOWADDR(,WAPTR)                                0106 00099000
         LH    @11,RTNDISP(,@14)                                   0106 00100000
         ALR   @11,@14                                             0106 00101000
         SLR   @14,@14                                             0106 00102000
         IC    @14,$RTN#(,@11)                                     0106 00103000
         CVD   @14,@TS00001                                        0106 00104000
         MVC   DPRWORK2(2,WAPTR),@TS00001+6                        0106 00105000
*   DPRWORK2=DPRWORK2/16;           /* GET RID OF SIGN BITS CONVERT     00106000
*                                      RTN# TO EBCDIC                */ 00107000
*                                                                  0107 00108000
         LH    @14,DPRWORK2(,WAPTR)                                0107 00109000
         N     @14,@CF01082                                        0107 00110000
         SRL   @14,4                                               0107 00111000
         STH   @14,DPRWORK2(,WAPTR)                                0107 00112000
*   /*****************************************************************/ 00113000
*   /*                                                               */ 00114000
*   /* ITACONV FROM(DPRWORK2)TO($ESECTID(8))COUNT(2)TYPE(HE) INVOKED */ 00115000
*   /*                                                               */ 00116000
*   /*****************************************************************/ 00117000
*                                                                  0108 00118000
*   DCL                                                            0108 00119000
*     1 ITATCPRM BDY(WORD),         /* CONVERT PARAMETER LIST        */ 00120000
*      2 * CHAR(4) INIT('0102F4F1'X),                              0108 00121000
*      2 ITATCFR PTR,               /* ADDRESS OF FROM FIELD         */ 00122000
*      2 ITATCTO PTR,               /* ADDRESS OF TO FIELD           */ 00123000
*      2 * BIT(8) INIT(0),          /* FLAGS FOR CONVERT MODULE      */ 00124000
*       3 ITATCTP BIT(1),           /* TYPE OF CONVERT REQUIRED      */ 00125000
*      2 ITATCNT FIXED(8);          /* NUMBER OF BYTES TO CONVERT    */ 00126000
*   ITATCFR=ADDR(DPRWORK2);         /* SET THE FROM ADDRESS          */ 00127000
         LA    @14,DPRWORK2(,WAPTR)                                0109 00128000
         ST    @14,ITATCFR                                         0109 00129000
*   ITATCTO=ADDR($ESECTID(8));      /* SET THE TO ADDRESS            */ 00130000
         LA    @14,$ESECTID+7(,WAPTR)                              0110 00131000
         ST    @14,ITATCTO                                         0110 00132000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00133000
         OI    ITATCTP,B'10000000'                                 0111 00134000
*   ITATCNT=2;                      /* GIVE THE CONVERT BYTE COUNT   */ 00135000
         MVI   ITATCNT,X'02'                                       0112 00136000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00137000
         LA    R1,ITATCPRM                                         0113 00138000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00139000
         L     @15,@CV00877                                        0114 00140000
         BALR  @14,@15                                             0114 00141000
*   $ESECTID=SECTID;                /* SAVE FOR FE & CATERR MSGS     */ 00142000
         L     @14,$LOWADDR(,WAPTR)                                0115 00143000
         MVC   $ESECTID(8,WAPTR),SECTID(@14)                       0115 00144000
*/********************************************************************/ 00145000
*/* SEARCH FOR DEVICE ADDRESS                                        */ 00146000
*/********************************************************************/ 00147000
*                                                                  0116 00148000
*   $24CATMG=' ';                   /* BLANK OUT DEVADR & SYMNME     */ 00149000
         MVI   $24CATMG+1(WAPTR),C' '                              0116 00150000
         MVC   $24CATMG+2(10,WAPTR),$24CATMG+1(WAPTR)              0116 00151000
         MVI   $24CATMG(WAPTR),C' '                                0116 00152000
*   IF $PTDEVAD^=0                  /* IF DEV ADDR WAS SPECIFIED IN     00153000
*                                      DPRINT PARM LIST              */ 00154000
*     THEN                                                         0117 00155000
         ICM   @14,3,$PTDEVAD(PRTPTR)                              0117 00156000
         BZ    @RF00117                                            0117 00157000
*     DO;                                                          0118 00158000
*       $24UNADR(3:4)=$PTDEVAD;     /* USE IT                        */ 00159000
         MVC   $24UNADR+2(2,WAPTR),$PTDEVAD(PRTPTR)                0119 00160000
*       GOTO S24C0120;              /* AND CONVERT IT                */ 00161000
         B     S24C0120                                            0120 00162000
*     END;                                                         0121 00163000
*   IF $PRTTECB=0|TECBEVOC=0        /* IF TECB PTR NOT SPECIFIED     */ 00164000
*     THEN                          /* OR NO POSTED EVENT IN TECB    */ 00165000
@RF00117 L     @14,$PRTTECB(,DPRPTR)                               0122 00166000
         LTR   @14,@14                                             0122 00167000
         BZ    @RT00122                                            0122 00168000
         CLI   TECBEVOC(TECBPTR),0                                 0122 00169000
         BNE   @RF00122                                            0122 00170000
@RT00122 DS    0H                                                  0123 00171000
*     DO;                                                          0123 00172000
*       IF $NDR=ON                  /* IF THERE IS NO PRIM DEV       */ 00173000
*         THEN                                                     0124 00174000
         TM    $NDR(WAPTR),B'00100000'                             0124 00175000
         BNO   @RF00124                                            0124 00176000
*         DO;                                                      0125 00177000
*           $24DEVAD='NONE';        /* DEV ADDR IS 'NONE'            */ 00178000
         MVC   $24DEVAD(4,WAPTR),@CC00880                          0126 00179000
*           GOTO S24C0150;          /* BYPASS CONVERT OF UNIT ADR    */ 00180000
         B     S24C0150                                            0127 00181000
*         END;                                                     0128 00182000
*       ELSE                                                       0129 00183000
*         DO;                                                      0129 00184000
@RF00124 DS    0H                                                  0130 00185000
*           $24UNADR=$PDEVADR;      /* ELSE USE PRIMARY DEVICE       */ 00186000
         L     @14,$PDEVADR(,WAPTR)                                0130 00187000
         ST    @14,$24UNADR(,WAPTR)                                0130 00188000
*           IF $SYMNAME=ON          /* IF THERE IS A SYMB            */ 00189000
*             THEN                                                 0131 00190000
         TM    $SYMNAME(WAPTR),B'00001000'                         0131 00191000
         BNO   @RF00131                                            0131 00192000
*             $24SYMNE=$SYNAME;     /* NAME, USE IT                  */ 00193000
         MVC   $24SYMNE(8,WAPTR),$SYNAME(WAPTR)                    0132 00194000
*         END;                                                     0133 00195000
@RF00131 DS    0H                                                  0134 00196000
*     END;                                                         0134 00197000
*   ELSE                                                           0135 00198000
*     DO;                           /* OTHERWISE                     */ 00199000
         B     @RC00122                                            0135 00200000
@RF00122 DS    0H                                                  0136 00201000
*       $24UNADR(2:4)=              /* USE ADDR FROM FIRST           */ 00202000
*           TECBEVT1(2:4);          /* EVENT FIELD OF TECB           */ 00203000
         MVC   $24UNADR+1(3,WAPTR),TECBEVT1+1(TECBPTR)             0136 00204000
*     END;                                                         0137 00205000
*S24C0120:                          /* CONV UNITADDR TO SAVE AREA    */ 00206000
*                                                                  0138 00207000
*   /*****************************************************************/ 00208000
*   /*                                                               */ 00209000
*   /* ITACONV FROM($24UNADR(3))TO($24DEVAD)COUNT(2)TYPE(HE) INVOKED */ 00210000
*   /*                                                               */ 00211000
*   /*****************************************************************/ 00212000
*                                                                  0138 00213000
*   ITATCFR=ADDR($24UNADR(3));      /* SET THE FROM ADDRESS          */ 00214000
@RC00122 DS    0H                                                  0138 00215000
S24C0120 LA    @14,$24UNADR+2(,WAPTR)                              0138 00216000
         ST    @14,ITATCFR                                         0138 00217000
*   ITATCTO=ADDR($24DEVAD);         /* SET THE TO ADDRESS            */ 00218000
         LA    @14,$24DEVAD(,WAPTR)                                0139 00219000
         ST    @14,ITATCTO                                         0139 00220000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00221000
         OI    ITATCTP,B'10000000'                                 0140 00222000
*   ITATCNT=2;                      /* GIVE THE CONVERT BYTE COUNT   */ 00223000
         MVI   ITATCNT,X'02'                                       0141 00224000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00225000
         LA    R1,ITATCPRM                                         0142 00226000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00227000
         L     @15,@CV00877                                        0143 00228000
         BALR  @14,@15                                             0143 00229000
*/********************************************************************/ 00230000
*/*      HEADER                                                      */ 00231000
*/********************************************************************/ 00232000
*                                                                  0144 00233000
*S24C0150:                                                         0144 00234000
*   CALL S24C2600;                  /* CLEAR PRINT BUFFER            */ 00235000
S24C0150 BAL   @14,S24C2600                                        0144 00236000
*   IF $DPHEADR=OFF                 /* IF HEADER FLAG OFF,           */ 00237000
*     THEN                                                         0145 00238000
         TM    $DPHEADR(PRTPTR),B'00010000'                        0145 00239000
         BZ    @RT00145                                            0145 00240000
*     GOTO S24C0200;                /* BYPASS, HEADER SET UP         */ 00241000
*   IF $ALTPRNT=ON                  /* IF PP IS IN EFFECT,           */ 00242000
*     THEN                                                         0147 00243000
         TM    $ALTPRNT(WAPTR),B'00010000'                         0147 00244000
         BNO   @RF00147                                            0147 00245000
*     $PRTONLY=OFF;                 /* TURN OFF PRINTR ONLY FLAG     */ 00246000
         NI    $PRTONLY(WAPTR),B'11110111'                         0148 00247000
*   HDRPTR=ADDR($BUFFER);           /* POINT HDR STRUC TO BUFR       */ 00248000
@RF00147 LA    HDRPTR,$BUFFER(,WAPTR)                              0149 00249000
*   IF $ERRORDP=ON                  /* IF THIS IS AN ERROR DPRINT    */ 00250000
*     THEN                                                         0150 00251000
         TM    $ERRORDP(PRTPTR),B'00000010'                        0150 00252000
         BNO   @RF00150                                            0150 00253000
*     HDRERROR='*';                 /* PREFIX LINE WITH AN *         */ 00254000
         MVI   HDRERROR(HDRPTR),C'*'                               0151 00255000
*   HDRTSTID=SECTID;                /* GET SECTION ID IN PRT BFR     */ 00256000
@RF00150 L     @14,$LOWADDR(,WAPTR)                                0152 00257000
         MVC   HDRTSTID(8,HDRPTR),SECTID(@14)                      0152 00258000
*   HDRHYPHN='-';                   /* HYPHEN                        */ 00259000
         MVI   HDRHYPHN(HDRPTR),C'-'                               0153 00260000
*   HDRLEVEL=LEVEL;                 /* SECTION LEVEL IN PRT BFR      */ 00261000
         MVC   HDRLEVEL(2,HDRPTR),LEVEL(@14)                       0154 00262000
*   HDRRTN='RTN';                   /* PUT CHARACTERS 'RTN' IN       */ 00263000
         MVC   HDRRTN(3,HDRPTR),@CC00888                           0155 00264000
*   HDROUTN#=$24RTN#;               /* GET ROUTINE #                 */ 00265000
         MVC   HDROUTN#(3,HDRPTR),$24RTN#(WAPTR)                   0156 00266000
*   HDRDEVLN='DEV/LN';              /* SET UP DEV ADDR               */ 00267000
         MVI   HDRDEVLN+6(HDRPTR),C' '                             0157 00268000
         MVC   HDRDEVLN(6,HDRPTR),@CC00889                         0157 00269000
*   HDRUNADR=$24DEVAD;              /* PUT UNIT ADR IN HDR           */ 00270000
         MVC   HDRUNADR(4,HDRPTR),$24DEVAD(WAPTR)                  0158 00271000
*   IF $24SYMNE^='        '         /* IF THERE IS A SYM NME,        */ 00272000
*     THEN                                                         0159 00273000
         CLC   $24SYMNE(8,WAPTR),@CC00890                          0159 00274000
         BE    @RF00159                                            0159 00275000
*     HDRSYMNM=$24SYMNE;            /* THEN USE IT                   */ 00276000
         MVC   HDRSYMNM(8,HDRPTR),$24SYMNE(WAPTR)                  0160 00277000
*   ELSE                                                           0161 00278000
*     HDRPTR=HDRPTR-LENGTH(HDRSYMNM);/* IF NOT UP PTR IN BUFR        */ 00279000
         B     @RC00159                                            0161 00280000
@RF00159 SL    HDRPTR,@CF00039                                     0161 00281000
*   HDRECA='ECA';                   /* PUT 'ECA' IN BUFFER           */ 00282000
@RC00159 MVC   HDRECA(3,HDRPTR),@CC00892                           0162 00283000
*   HDRECA#=$ECA;                   /* GET ECA# FROM SECT PREF       */ 00284000
         L     @14,$LOWADDR(,WAPTR)                                0163 00285000
         LH    @09,RTNDISP(,@14)                                   0163 00286000
         ALR   @09,@14                                             0163 00287000
         MVC   HDRECA#(3,HDRPTR),$ECA(@09)                         0163 00288000
*   IF $DPREFNM=ON                  /* IF REFNUM TO BE               */ 00289000
*     THEN                          /* PRINTED,                      */ 00290000
         TM    $DPREFNM(PRTPTR),B'00000001'                        0164 00291000
         BNO   @RF00164                                            0164 00292000
*     DO;                           /*                               */ 00293000
*       HDREFNUM='REFNUM';          /* 'REFNUM' IN BUFR              */ 00294000
         MVC   HDREFNUM(6,HDRPTR),@CC00893                         0166 00295000
*       DPRWORK2=$PTRENUM;          /* PT 2 FROM PARM LIST           */ 00296000
         MVC   DPRWORK2(2,WAPTR),$PTRENUM(PRTPTR)                  0167 00297000
*       MVO(DPRWORK(4:5),$REFNUM);  /* CONV REFNUM TO OUT BUFR       */ 00298000
*                                                                  0168 00299000
         MVO   DPRWORK+3(2,WAPTR),$REFNUM(1,@09)                   0168 00300000
*       /*************************************************************/ 00301000
*       /*                                                           */ 00302000
*       /* ITACONV FROM(DPRWORK1)TO(HDREF#)COUNT(3)TYPE(HE) INVOKED  */ 00303000
*       /*                                                           */ 00304000
*       /*************************************************************/ 00305000
*                                                                  0169 00306000
*       ITATCFR=ADDR(DPRWORK1);     /* SET THE FROM ADDRESS          */ 00307000
         LA    @14,DPRWORK1(,WAPTR)                                0169 00308000
         ST    @14,ITATCFR                                         0169 00309000
*       ITATCTO=ADDR(HDREF#);       /* SET THE TO ADDRESS            */ 00310000
         LA    @14,HDREF#(,HDRPTR)                                 0170 00311000
         ST    @14,ITATCTO                                         0170 00312000
*       ITATCTP='1'B;               /* SET THE TYPE OF CONVERT BIT   */ 00313000
         OI    ITATCTP,B'10000000'                                 0171 00314000
*       ITATCNT=3;                  /* GIVE THE CONVERT BYTE COUNT   */ 00315000
         MVI   ITATCNT,X'03'                                       0172 00316000
*       R1=ADDR(ITATCPRM);          /* POINT TO CONVERT PARM LIST    */ 00317000
         LA    R1,ITATCPRM                                         0173 00318000
*       CALL ISTSC021;              /* CALL CONVERT DIRECTLY         */ 00319000
         L     @15,@CV00877                                        0174 00320000
         BALR  @14,@15                                             0174 00321000
*       HDREF#(1:1)=' ';            /* BLANK 1ST CHAR                */ 00322000
         MVI   HDREF#(HDRPTR),C' '                                 0175 00323000
*     END;                                                         0176 00324000
*   CALL S24C2500;                  /* PUT OUT THE HEADER            */ 00325000
@RF00164 BAL   @14,S24C2500                                        0177 00326000
*/********************************************************************/ 00327000
*/*      TEST DESCRIPTION                                            */ 00328000
*/********************************************************************/ 00329000
*                                                                  0178 00330000
*S24C0200:                                                         0178 00331000
*   IF $DESCRIP=OFF                 /* IF NOT TO PRINT DESCP LINE    */ 00332000
*     THEN                                                         0178 00333000
S24C0200 TM    $DESCRIP(PRTPTR),B'10000000'                        0178 00334000
         BZ    @RT00178                                            0178 00335000
*     GOTO S24C0250;                /* BYPASS THIS SECTION           */ 00336000
*   $DDRPTR=ADDR($PTDESCA);         /* PTR TO DESC LINE ADDR LIST    */ 00337000
         LA    @14,$PTDESCA(,DPRPTR)                               0180 00338000
         ST    @14,$DDRPTR(,WAPTR)                                 0180 00339000
*   $OUNTPTR=ADDR($PTDESCC);        /* PTR TO DESC BYTE CNT LIST     */ 00340000
         LA    @14,$PTDESCC(,PRTPTR)                               0181 00341000
         ST    @14,$OUNTPTR(,WAPTR)                                0181 00342000
*   $UMXX=$PTDESCL;                 /* INDEX = # OF DESC LINES       */ 00343000
         IC    @14,$PTDESCL(,PRTPTR)                               0182 00344000
         STC   @14,$UMXX(,WAPTR)                                   0182 00345000
*   CALL S24C1000;                  /* CHK PP LEV 1&3 & PRT LINE     */ 00346000
         BAL   @14,S24C1000                                        0183 00347000
*/********************************************************************/ 00348000
*/*      CAW CCW LINE                                                */ 00349000
*/********************************************************************/ 00350000
*                                                                  0184 00351000
*S24C0250:                                                         0184 00352000
*   IF $DPCCW=OFF                   /* IF CCW'S NOT TO BE PRINTD     */ 00353000
*     THEN                                                         0184 00354000
S24C0250 TM    $DPCCW(PRTPTR),B'01000000'                          0184 00355000
         BZ    @RT00184                                            0184 00356000
*     GOTO S24C0300;                /* GO ON TO CC'S                 */ 00357000
*   IF $PTCCWA=0                    /* IF CCW POINTER = 0            */ 00358000
*     THEN                          /* THEN SET                      */ 00359000
         L     @14,$PTCCWA(,DPRPTR)                                0186 00360000
         LTR   @14,@14                                             0186 00361000
         BNZ   @RF00186                                            0186 00362000
*S24C0252:                                                         0187 00363000
*     DO;                           /* RC = 0C                       */ 00364000
S24C0252 DS    0H                                                  0188 00365000
*       $24RETCD='0C'X;             /* GO TO CHK FOR CC'S            */ 00366000
         MVI   $24RETCD(WAPTR),X'0C'                               0188 00367000
*       GOTO S24C0300;                                             0189 00368000
         B     S24C0300                                            0189 00369000
*     END;                                                         0190 00370000
*   IF $PTNCCWS=0                   /* IF CCW COUNT =0               */ 00371000
*     THEN                                                         0191 00372000
@RF00186 CLI   $PTNCCWS(PRTPTR),0                                  0191 00373000
         BE    @RT00191                                            0191 00374000
*     GOTO S24C0252;                /* SET RC=0C AND CHK FOR CC      */ 00375000
*   DPRCAW='CAW';                   /* MOVE 'CAW' INTO OUT BUFR CONV    00376000
*                                      CAW TO OUT BUFR               */ 00377000
*                                                                  0193 00378000
         LA    @14,1976                                            0193 00379000
         ALR   @14,WAPTR                                           0193 00380000
         MVC   DPRCAW(3,@14),@CC00904                              0193 00381000
*   /*****************************************************************/ 00382000
*   /*                                                               */ 00383000
*   /* ITACONV FROM($PTCCWA)TO(DPRCAWAD)COUNT(4)TYPE(HE) INVOKED     */ 00384000
*   /*                                                               */ 00385000
*   /*****************************************************************/ 00386000
*                                                                  0194 00387000
*   ITATCFR=ADDR($PTCCWA);          /* SET THE FROM ADDRESS          */ 00388000
         LA    @00,$PTCCWA(,DPRPTR)                                0194 00389000
         ST    @00,ITATCFR                                         0194 00390000
*   ITATCTO=ADDR(DPRCAWAD);         /* SET THE TO ADDRESS            */ 00391000
         LA    @14,DPRCAWAD(,@14)                                  0195 00392000
         ST    @14,ITATCTO                                         0195 00393000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 00394000
         OI    ITATCTP,B'10000000'                                 0196 00395000
*   ITATCNT=4;                      /* GIVE THE CONVERT BYTE COUNT   */ 00396000
         MVI   ITATCNT,X'04'                                       0197 00397000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 00398000
         LA    R1,ITATCPRM                                         0198 00399000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 00400000
         L     @15,@CV00877                                        0199 00401000
         BALR  @14,@15                                             0199 00402000
*   DO $CTR=1 TO $PTNCCWS;          /* LOOP THRU CCW LIST            */ 00403000
         LA    @14,1                                               0200 00404000
         B     @DE00200                                            0200 00405000
@DL00200 DS    0H                                                  0201 00406000
*     DPRCCW='CCW';                 /* PUT 'CCW' IN BUFFER           */ 00407000
         LA    @14,1976                                            0201 00408000
         ALR   @14,WAPTR                                           0201 00409000
         MVC   DPRCCW(3,@14),@CC00905                              0201 00410000
*     CVD($CTR,DPRWORK2);           /* CONVERT CCW # TO DECIMAL      */ 00411000
         LH    @00,$CTR(,WAPTR)                                    0202 00412000
         CVD   @00,@TS00001                                        0202 00413000
         MVC   DPRWORK2(2,WAPTR),@TS00001+6                        0202 00414000
*     DPRWORK2=DPRWORK2/16;         /* GET RID OF SIGN BITS CONV CCW    00415000
*                                      # TO OUT BUFR                 */ 00416000
*                                                                  0203 00417000
         LH    @00,DPRWORK2(,WAPTR)                                0203 00418000
         N     @00,@CF01082                                        0203 00419000
         SRL   @00,4                                               0203 00420000
         STH   @00,DPRWORK2(,WAPTR)                                0203 00421000
*     /***************************************************************/ 00422000
*     /*                                                             */ 00423000
*     /* ITACONV FROM(DPRWORK2(2))TO(DPRCCW#)COUNT(1)TYPE(HE) INVOKED*/ 00424000
*     /*                                                             */ 00425000
*     /***************************************************************/ 00426000
*                                                                  0204 00427000
*     ITATCFR=ADDR(DPRWORK2(2));    /* SET THE FROM ADDRESS          */ 00428000
         LA    @00,DPRWORK2+1(,WAPTR)                              0204 00429000
         ST    @00,ITATCFR                                         0204 00430000
*     ITATCTO=ADDR(DPRCCW#);        /* SET THE TO ADDRESS            */ 00431000
         LA    @14,DPRCCW#(,@14)                                   0205 00432000
         ST    @14,ITATCTO                                         0205 00433000
*     ITATCTP='1'B;                 /* SET THE TYPE OF CONVERT BIT   */ 00434000
         OI    ITATCTP,B'10000000'                                 0206 00435000
*     ITATCNT=1;                    /* GIVE THE CONVERT BYTE COUNT   */ 00436000
         MVI   ITATCNT,X'01'                                       0207 00437000
*     R1=ADDR(ITATCPRM);            /* POINT TO CONVERT PARM LIST    */ 00438000
         LA    R1,ITATCPRM                                         0208 00439000
*     CALL ISTSC021;                /* CALL CONVERT DIRECTLY CONVERT    00440000
*                                      CCW TO WORK AREA              */ 00441000
*                                                                  0209 00442000
         L     @15,@CV00877                                        0209 00443000
         BALR  @14,@15                                             0209 00444000
*     /***************************************************************/ 00445000
*     /*                                                             */ 00446000
*     /* ITACONV FROM(S24CCWA($CTR))TO(DPRWORK)COUNT(8)TYPE(HE)      */ 00447000
*     /* INVOKED                                                     */ 00448000
*     /*                                                             */ 00449000
*     /***************************************************************/ 00450000
*                                                                  0210 00451000
*     ITATCFR=ADDR(S24CCWA($CTR));  /* SET THE FROM ADDRESS          */ 00452000
         LH    @14,$CTR(,WAPTR)                                    0210 00453000
         SLA   @14,3                                               0210 00454000
         L     @11,$PTCCWA(,DPRPTR)                                0210 00455000
         AL    @11,@CF01084                                        0210 00456000
         LA    @14,S24CCWA(@14,@11)                                0210 00457000
         ST    @14,ITATCFR                                         0210 00458000
*     ITATCTO=ADDR(DPRWORK);        /* SET THE TO ADDRESS            */ 00459000
         LA    @14,DPRWORK(,WAPTR)                                 0211 00460000
         ST    @14,ITATCTO                                         0211 00461000
*     ITATCTP='1'B;                 /* SET THE TYPE OF CONVERT BIT   */ 00462000
         OI    ITATCTP,B'10000000'                                 0212 00463000
*     ITATCNT=8;                    /* GIVE THE CONVERT BYTE COUNT   */ 00464000
         MVI   ITATCNT,X'08'                                       0213 00465000
*     R1=ADDR(ITATCPRM);            /* POINT TO CONVERT PARM LIST    */ 00466000
         LA    R1,ITATCPRM                                         0214 00467000
*     CALL ISTSC021;                /* CALL CONVERT DIRECTLY         */ 00468000
         L     @15,@CV00877                                        0215 00469000
         BALR  @14,@15                                             0215 00470000
*     DPRCMDCD=S24CCWCD;            /* MOVE CMND CODE TO BUFR        */ 00471000
         LA    @14,1976                                            0216 00472000
         ALR   @14,WAPTR                                           0216 00473000
         LA    @11,2376                                            0216 00474000
         ALR   @11,WAPTR                                           0216 00475000
         MVC   DPRCMDCD(2,@14),S24CCWCD(@11)                       0216 00476000
*     DPRDATA=S24CCWDA;             /* MOVE ADDR TO BUFR             */ 00477000
         MVC   DPRDATA(6,@14),S24CCWDA(@11)                        0217 00478000
*     DPRSPARE=S24CCWEX;            /* MOVE IN UNUSED BYTES          */ 00479000
         MVC   DPRSPARE(2,@14),S24CCWEX(@11)                       0218 00480000
*     DPRFLAGS=S24CCWFL;            /* MOVE FLAGS TO BUFR            */ 00481000
         MVC   DPRFLAGS(2,@14),S24CCWFL(@11)                       0219 00482000
*     DPRCOUNT=S24CCWCT;            /* MOVE COUNT TO BUFR            */ 00483000
         MVC   DPRCOUNT(4,@14),S24CCWCT(@11)                       0220 00484000
*     IF $CTR=$PTFCCWS&             /* IF THIS IS THE FAILING CCW    */ 00485000
*         $CCWERR=ON                /* AND IT REALLY WAS AN ERROR    */ 00486000
*       THEN                                                       0221 00487000
         LH    @00,$CTR(,WAPTR)                                    0221 00488000
         SLR   @11,@11                                             0221 00489000
         IC    @11,$PTFCCWS(,PRTPTR)                               0221 00490000
         CR    @00,@11                                             0221 00491000
         BNE   @RF00221                                            0221 00492000
         TM    $CCWERR(PRTPTR),B'01000000'                         0221 00493000
         BNO   @RF00221                                            0221 00494000
*       DPRCCWER='*';               /* PUT AN '*' IN THE PRT BFR     */ 00495000
         MVI   DPRCCWER(@14),C'*'                                  0222 00496000
*     CALL S24C2000;                /* CHECK FOR PP LEVELS 2 & 3 AND    00497000
*                                      PUT OUT LINE                  */ 00498000
@RF00221 BAL   @14,S24C2000                                        0223 00499000
*   END;                                                           0224 00500000
*                                                                  0224 00501000
         LA    @14,1                                               0224 00502000
         AH    @14,$CTR(,WAPTR)                                    0224 00503000
@DE00200 STH   @14,$CTR(,WAPTR)                                    0224 00504000
         SLR   @00,@00                                             0224 00505000
         IC    @00,$PTNCCWS(,PRTPTR)                               0224 00506000
         CR    @14,@00                                             0224 00507000
         BNH   @DL00200                                            0224 00508000
*/********************************************************************/ 00509000
*/*      EXPECTED/RECEIVED CONDITION CODE LINE                       */ 00510000
*/********************************************************************/ 00511000
*                                                                  0225 00512000
*S24C0300:                                                         0225 00513000
*   IF $CONCODE=OFF                 /* IF NOT TO PRINT CC LINE       */ 00514000
*     THEN                                                         0225 00515000
S24C0300 TM    $CONCODE(PRTPTR),B'00000100'                        0225 00516000
         BZ    @RT00225                                            0225 00517000
*     GOTO S24C0350;                /* GO CHECK FOR CSW LINE         */ 00518000
*   IF $PTECC=0                     /* IF NO EXPECTED CC IS GIVEN    */ 00519000
*     THEN                          /*                               */ 00520000
         CLI   $PTECC(PRTPTR),0                                    0227 00521000
         BNE   @RF00227                                            0227 00522000
*S24C0310:                                                         0228 00523000
*     DO;                           /* THEN                          */ 00524000
S24C0310 DS    0H                                                  0229 00525000
*       CALL S24C2600;              /* BLANK OUT BUFFER              */ 00526000
         BAL   @14,S24C2600                                        0229 00527000
*       $24RETCD='0C'X;             /* SET RC = 0C &                 */ 00528000
         MVI   $24RETCD(WAPTR),X'0C'                               0230 00529000
*       GOTO S24C0350;              /* GO CHK FOR XPTD CSW           */ 00530000
         B     S24C0350                                            0231 00531000
*     END;                                                         0232 00532000
*   CCXPTDCD=$PTECC;                /* PUT XPTD CC IN PRT BFR        */ 00533000
@RF00227 LA    @14,1976                                            0233 00534000
         ALR   @14,WAPTR                                           0233 00535000
         MVC   CCXPTDCD(1,@14),$PTECC(PRTPTR)                      0233 00536000
*   IF $PRTACCC^=0                  /* IF ACTUAL CC ADDR GIVEN       */ 00537000
*     THEN                                                         0234 00538000
         L     @11,$PRTACCC(,DPRPTR)                               0234 00539000
         LTR   @11,@11                                             0234 00540000
         BZ    @RF00234                                            0234 00541000
*     CCCONDCD=S24CC;               /* PUT CC IN PRT BUFR            */ 00542000
         IC    @00,S24CC(,@11)                                     0235 00543000
         STC   @00,CCCONDCD(,@14)                                  0235 00544000
*   ELSE                                                           0236 00545000
*     DO;                           /* IF CC ADDRESS NOT GIVEN       */ 00546000
         B     @RC00234                                            0236 00547000
@RF00234 DS    0H                                                  0237 00548000
*       S24CCREQ=ON;                /* SEARCH TECB                   */ 00549000
         OI    S24CCREQ+2680(WAPTR),B'10000000'                    0237 00550000
*       CALL S24C3000;                                             0238 00551000
         BAL   @14,S24C3000                                        0238 00552000
*       S24CCREQ=OFF;               /* TURN OFF CC SRCH FLG          */ 00553000
         LA    @14,2680                                            0239 00554000
         ALR   @14,WAPTR                                           0239 00555000
         NI    S24CCREQ(@14),B'01111111'                           0239 00556000
*       IF S24TCBER=ON              /* IF NO TECB ADDR GIVEN         */ 00557000
*         THEN                                                     0240 00558000
         TM    S24TCBER(@14),B'00010000'                           0240 00559000
         BO    @RT00240                                            0240 00560000
*         GOTO S24C0310;            /* (RC=0C) CHK XPTD CSW          */ 00561000
*       IF S24SCHFL=ON THEN         /* IF SEARCH FAILED              */ 00562000
         TM    S24SCHFL(@14),B'00001000'                           0242 00563000
         BNO   @RF00242                                            0242 00564000
*         DO;                       /* AND                           */ 00565000
*           IF TCBQUEUE=ON          /* IF I/O QUEUED                 */ 00566000
*             THEN                  /* PUT 'QUEUED' IN BFR           */ 00567000
         TM    TCBQUEUE(TECBPTR),B'10000000'                       0244 00568000
         BNO   @RF00244                                            0244 00569000
*             DO;                                                  0245 00570000
*               CCQUEUED='QUEUED';  /* IF NOT QUEUED, PUT 0          */ 00571000
         MVC   CCQUEUED+1976(6,WAPTR),@CC00912                     0246 00572000
*               GOTO S24C0320;                                     0247 00573000
         B     S24C0320                                            0247 00574000
*             END;                                                 0248 00575000
*           ELSE                    /* IN BFR- SIO ISSUED            */ 00576000
*             CCCONDCD='0';         /* NO INTERRUPTS                 */ 00577000
@RF00244 MVI   CCCONDCD+1976(WAPTR),C'0'                           0249 00578000
*         END;                      /* IF SEARCH SUCCESS PUT         */ 00579000
*     END;                                                         0251 00580000
@RF00242 DS    0H                                                  0252 00581000
*   IF CCCONDCD='FF'X               /* IF CONDITION CODE IS FF       */ 00582000
*     THEN                                                         0252 00583000
@RC00234 LA    @14,1976                                            0252 00584000
         ALR   @14,WAPTR                                           0252 00585000
         CLI   CCCONDCD(@14),X'FF'                                 0252 00586000
         BNE   @RF00252                                            0252 00587000
*     CCCONDCD='0';                 /* (FROM OLD EXIO) CHANG TO 0    */ 00588000
         MVI   CCCONDCD(@14),C'0'                                  0253 00589000
*   IF CCCONDCD(1:4)^='1111'B THEN  /* IF IT IS NOT A PRINTABLE #    */ 00590000
@RF00252 TM    CCCONDCD+1976(WAPTR),B'11110000'                    0254 00591000
         BNO   @RT00254                                            0254 00592000
*     GOTO S24C0310;                /* RC=0C, GO CHK FOR XPTD CSW    */ 00593000
*S24C0320:                                                         0256 00594000
*   CCXPTDCC='XPTD CC';             /* PUT 'XPTD CC' IN PRT BUFR     */ 00595000
S24C0320 LA    @14,1976                                            0256 00596000
         ALR   @14,WAPTR                                           0256 00597000
         MVC   CCXPTDCC(7,@14),@CC00917                            0256 00598000
*   CCRCVDCC='RCVD CC';             /* PUT 'RCVD CC' IN PRT BUFR     */ 00599000
         MVC   CCRCVDCC(7,@14),@CC00919                            0257 00600000
*   IF $CCERROR=ON                  /* IF CC WAS IN ERROR            */ 00601000
*     THEN                                                         0258 00602000
         TM    $CCERROR(PRTPTR),B'00000010'                        0258 00603000
         BNO   @RF00258                                            0258 00604000
*     CCERROR='*';                  /* PUT '*' IN PRINT LINE         */ 00605000
         MVI   CCERROR(@14),C'*'                                   0259 00606000
*   CALL S24C2000;                  /* CHK FOR PP LEVELS 2 & 3 OUTPUT   00607000
*                                      LINE                          */ 00608000
@RF00258 BAL   @14,S24C2000                                        0260 00609000
*/********************************************************************/ 00610000
*/*      EXPECTED CSW/PSW LINE                                       */ 00611000
*/********************************************************************/ 00612000
*                                                                  0261 00613000
*S24C0350:                                                         0261 00614000
*   CSWXPTRC='XPTD CSW1';           /* PUT 'XPTD CSW1' IN PRT BFR    */ 00615000
S24C0350 LA    @14,1976                                            0261 00616000
         ALR   @14,WAPTR                                           0261 00617000
         MVC   CSWXPTRC(9,@14),@CC00920                            0261 00618000
*   IF $PSWCSW=ON                   /* IF THIS IS A PSW LINE         */ 00619000
*     THEN                                                         0262 00620000
         TM    $PSWCSW(PRTPTR),B'00000001'                         0262 00621000
         BNO   @RF00262                                            0262 00622000
*     CSWPSW1='P';                  /* CHANGE CSW TO PSW IN BFR      */ 00623000
         MVI   CSWPSW1(@14),C'P'                                   0263 00624000
*   BFRPTR=ADDR(CSW1KEY);           /* LOC IN BUFR FOR CSW/PSW       */ 00625000
@RF00262 LA    BFRPTR,CSW1KEY+1976(,WAPTR)                         0264 00626000
*   MASK=$PTXCSWM;                  /* SET UP CSW1 MASK              */ 00627000
         MVC   MASK(1),$PTXCSWM(PRTPTR)                            0265 00628000
*   IF $XPDCSW1=OFF THEN            /* IF NOT TO PRT XPTD CSW1       */ 00629000
         TM    $XPDCSW1(PRTPTR),B'00100000'                        0266 00630000
         BNZ   @RF00266                                            0266 00631000
*S24C0353:                                                         0267 00632000
*     DO;                                                          0267 00633000
S24C0353 DS    0H                                                  0268 00634000
*       IF $XPDCSW2=OFF             /* AND NO CSW2 EITHER            */ 00635000
*         THEN                                                     0268 00636000
         TM    $XPDCSW2(PRTPTR),B'00001000'                        0268 00637000
         BZ    @RT00268                                            0268 00638000
*         GOTO S24C0400;            /* CHK FOR RECEIVED CSW          */ 00639000
*       CSW#='2';                   /* ELSE CHNG CSW/PSW1 TO 2       */ 00640000
         MVI   CSW#+1976(WAPTR),C'2'                               0270 00641000
*       GOTO S24C0355;              /* GO CHK ON CSW/PSW2            */ 00642000
         B     S24C0355                                            0271 00643000
*     END;                                                         0272 00644000
*   IF $PTXCSW1=0                   /* IF CSW1 ADDR = 0              */ 00645000
*     THEN                          /*                               */ 00646000
@RF00266 L     @14,$PTXCSW1(,DPRPTR)                               0273 00647000
         LTR   @14,@14                                             0273 00648000
         BNZ   @RF00273                                            0273 00649000
*     DO;                           /*                               */ 00650000
*       $24RETCD='0C'X;             /* SET RC = 0C                   */ 00651000
         MVI   $24RETCD(WAPTR),X'0C'                               0275 00652000
*       GOTO S24C0353;              /* CHK FOR CSW2 PRINT            */ 00653000
         B     S24C0353                                            0276 00654000
*     END;                                                         0277 00655000
*   CSWPSWPT=$PTXCSW1;              /* PT TO PSW1/CSW1 TO XLATE      */ 00656000
@RF00273 L     @14,$PTXCSW1(,DPRPTR)                               0278 00657000
         ST    @14,CSWPSWPT                                        0278 00658000
*   CALL S24C5000;                  /* XLATE & PUT CSW/PSW IN BUF    */ 00659000
         BAL   @14,S24C5000                                        0279 00660000
*   IF $XPDCSW2=OFF                 /* IF NOT TO PRINT CSW2          */ 00661000
*     THEN                                                         0280 00662000
         TM    $XPDCSW2(PRTPTR),B'00001000'                        0280 00663000
         BZ    @RT00280                                            0280 00664000
*     GOTO S24C0360;                /* THEN OUTPUT LINE              */ 00665000
*   CSW2CSW2='CSW2';                /* ELSE PUT 'CSW2' IN BFR        */ 00666000
         LA    @14,1976                                            0282 00667000
         ALR   @14,WAPTR                                           0282 00668000
         MVC   CSW2CSW2(4,@14),@CC00931                            0282 00669000
*   IF $PSWCSW=ON                   /* IF PSW PRINT,                 */ 00670000
*     THEN                                                         0283 00671000
         TM    $PSWCSW(PRTPTR),B'00000001'                         0283 00672000
         BNO   @RF00283                                            0283 00673000
*     CSWPSW2='P';                  /* CHANGE CSW2 TO PSW2           */ 00674000
         MVI   CSWPSW2(@14),C'P'                                   0284 00675000
*   BFRPTR=ADDR(CSW2KEY);           /* LOC IN BFR FOR CSW2/PSW2      */ 00676000
@RF00283 LA    BFRPTR,CSW2KEY+1976(,WAPTR)                         0285 00677000
*S24C0355:                                                         0286 00678000
*   MASK=MASK*16;                   /* SHIFT CSW2 MSK TO POSITION    */ 00679000
S24C0355 SLR   @14,@14                                             0286 00680000
         IC    @14,MASK                                            0286 00681000
         SLA   @14,4                                               0286 00682000
         STC   @14,MASK                                            0286 00683000
*   IF $PTXCSW2=0                   /* IF CSW2 ADDR = 0              */ 00684000
*     THEN                          /*                               */ 00685000
         L     @14,$PTXCSW2(,DPRPTR)                               0287 00686000
         LTR   @14,@14                                             0287 00687000
         BNZ   @RF00287                                            0287 00688000
*     DO;                           /*                               */ 00689000
*       $24RETCD='0C'X;             /* SET RC = 0C                   */ 00690000
         MVI   $24RETCD(WAPTR),X'0C'                               0289 00691000
*       GOTO S24C0400;              /* CHK FOR RCVD CSW              */ 00692000
         B     S24C0400                                            0290 00693000
*     END;                                                         0291 00694000
*   CSWPSWPT=$PTXCSW2;              /* PT TO PSW2/CSW2 TO XLATE      */ 00695000
@RF00287 L     @14,$PTXCSW2(,DPRPTR)                               0292 00696000
         ST    @14,CSWPSWPT                                        0292 00697000
*   CALL S24C5000;                  /* XLATE & PUT CSW/PSW IN BFR    */ 00698000
         BAL   @14,S24C5000                                        0293 00699000
*S24C0360:                                                         0294 00700000
*   CALL S24C2000;                  /* CHK PP LEVL 2&3, PRT LINE     */ 00701000
S24C0360 BAL   @14,S24C2000                                        0294 00702000
*/********************************************************************/ 00703000
*/*      RECEIVED CSW/PSW LINE                                       */ 00704000
*/********************************************************************/ 00705000
*                                                                  0295 00706000
*S24C0400:                                                         0295 00707000
*   CSWXPTRC='RCVD CSW1';           /* PUT'RCVD CSW1' IN BUFR        */ 00708000
S24C0400 LA    @14,1976                                            0295 00709000
         ALR   @14,WAPTR                                           0295 00710000
         MVC   CSWXPTRC(9,@14),@CC00934                            0295 00711000
*   CSW1NONE='NONE';                /* ASSUME CSW1 NONE              */ 00712000
         MVC   CSW1NONE(4,@14),@CC00880                            0296 00713000
*   IF $PSWCSW=ON                   /* IF TO PRINT PSW               */ 00714000
*     THEN                                                         0297 00715000
         TM    $PSWCSW(PRTPTR),B'00000001'                         0297 00716000
         BNO   @RF00297                                            0297 00717000
*     CSWPSW1='P';                  /* CHANGE CSW1 TO PSW1           */ 00718000
         MVI   CSWPSW1(@14),C'P'                                   0298 00719000
*   IF $CSW1ERR=ON                  /* IF ERROR PSW/CSW 1/2          */ 00720000
*     THEN                                                         0299 00721000
@RF00297 TM    $CSW1ERR(PRTPTR),B'00100000'                        0299 00722000
         BNO   @RF00299                                            0299 00723000
*     CSWPSWER='*';                 /* PREFIX LINE WITH *            */ 00724000
         MVI   CSWPSWER+1976(WAPTR),C'*'                           0300 00725000
*   BFRPTR=ADDR(CSW1KEY);           /* POINT TO FLD IN BFR           */ 00726000
@RF00299 LA    BFRPTR,CSW1KEY+1976(,WAPTR)                         0301 00727000
*   MASK='1111'B;                   /* SET MASK TO PRT ALL FLDS      */ 00728000
         MVI   MASK,B'11110000'                                    0302 00729000
*   IF $RCVCSW1=OFF                 /* IF NOT TO PRT RCVD CSW/       */ 00730000
*     THEN                          /*                               */ 00731000
         TM    $RCVCSW1(PRTPTR),B'00010000'                        0303 00732000
         BNZ   @RF00303                                            0303 00733000
*     DO;                           /* AND                           */ 00734000
*       IF $RCVCSW2=OFF             /* NOT PRT CSW2 EITHER           */ 00735000
*         THEN                      /*                               */ 00736000
         TM    $RCVCSW2(PRTPTR),B'00000100'                        0305 00737000
         BNZ   @RF00305                                            0305 00738000
*S24C0402:                                                         0306 00739000
*         DO;                       /*                               */ 00740000
S24C0402 DS    0H                                                  0307 00741000
*           CALL S24C2600;          /* BLANK OUT BUFFER              */ 00742000
         BAL   @14,S24C2600                                        0307 00743000
*           GOTO S24C0450;          /* CHK ON XPTD SENSE             */ 00744000
         B     S24C0450                                            0308 00745000
*         END;                                                     0309 00746000
*       ELSE                                                       0310 00747000
*         DO;                       /* ELSE                          */ 00748000
@RF00305 DS    0H                                                  0311 00749000
*S24C0405:                                                         0311 00750000
*           CSW#='2';               /* CHNG CSW1 TO 2                */ 00751000
S24C0405 MVI   CSW#+1976(WAPTR),C'2'                               0311 00752000
*           GOTO S24C0440;          /* GO PICK UP RCVD CSW2          */ 00753000
         B     S24C0440                                            0312 00754000
*         END;                                                     0313 00755000
*     END;                                                         0314 00756000
*   IF $PTRCSW1=0                   /* IF CSW1 ADDR = 0              */ 00757000
*     THEN                          /* THEN                          */ 00758000
@RF00303 L     @14,$PTRCSW1(,DPRPTR)                               0315 00759000
         LTR   @14,@14                                             0315 00760000
         BNZ   @RF00315                                            0315 00761000
*     DO;                           /* SEARCH TECB                   */ 00762000
*       CALL S24C3000;                                             0317 00763000
         BAL   @14,S24C3000                                        0317 00764000
*       IF S24TCBER=ON              /* IF TECB ADDR = 0              */ 00765000
*         THEN                      /* (RC = 0C SET IN SRCH RTN)     */ 00766000
         LA    @14,2680                                            0318 00767000
         ALR   @14,WAPTR                                           0318 00768000
         TM    S24TCBER(@14),B'00010000'                           0318 00769000
         BO    @RT00318                                            0318 00770000
*         GOTO S24C0405;            /* CHK ON CSW2                   */ 00771000
*       IF S24SCHFL=ON              /* IF TECB SEARCH FAILED,        */ 00772000
*         THEN                                                     0320 00773000
         TM    S24SCHFL(@14),B'00001000'                           0320 00774000
         BO    @RT00320                                            0320 00775000
*         GOTO S24C0430;            /* GO CHK FOR CSW/PSW2           */ 00776000
*     END;                                                         0322 00777000
*   ELSE                                                           0323 00778000
*     CSWPSWPT=$PTRCSW1;            /* USE CSWTPR GIVEN              */ 00779000
         B     @RC00315                                            0323 00780000
@RF00315 L     @14,$PTRCSW1(,DPRPTR)                               0323 00781000
         ST    @14,CSWPSWPT                                        0323 00782000
*   CALL S24C5000;                  /* XLATE & PUT CSW/PSW IN BFR    */ 00783000
@RC00315 BAL   @14,S24C5000                                        0324 00784000
*S24C0430:                                                         0325 00785000
*   IF $RCVCSW2=OFF                 /* IF NO CSW2 TO PRINT           */ 00786000
*     THEN                                                         0325 00787000
S24C0430 TM    $RCVCSW2(PRTPTR),B'00000100'                        0325 00788000
         BZ    @RT00325                                            0325 00789000
*     GOTO S24C0445;                /* OUTPUT LINE                   */ 00790000
*   CSW2CSW2='CSW2';                /* PUT 'CSW2' IN BUFR            */ 00791000
         LA    @14,1976                                            0327 00792000
         ALR   @14,WAPTR                                           0327 00793000
         MVC   CSW2CSW2(4,@14),@CC00931                            0327 00794000
*   CSW2NONE='NONE';                /* ASSUME NONE FOR CSW2          */ 00795000
         MVC   CSW2NONE(4,@14),@CC00880                            0328 00796000
*   IF $PSWCSW=ON                   /* IF A PSW TO PRINT             */ 00797000
*     THEN                                                         0329 00798000
         TM    $PSWCSW(PRTPTR),B'00000001'                         0329 00799000
         BNO   @RF00329                                            0329 00800000
*     CSWPSW2='P';                  /* CHANGE CSW2 TO PSW2           */ 00801000
         MVI   CSWPSW2(@14),C'P'                                   0330 00802000
*   BFRPTR=ADDR(CSW2KEY);           /* LOC IN PRT BFR FOR RCVDCSW    */ 00803000
@RF00329 LA    BFRPTR,CSW2KEY+1976(,WAPTR)                         0331 00804000
*S24C0440:                                                         0332 00805000
*   IF $PTRCSW2=0                   /* IF NO RCVD CSW2 ADDR GIVEN    */ 00806000
*     THEN                          /* SEARCH TECB	                  */ 00807000
S24C0440 L     @14,$PTRCSW2(,DPRPTR)                               0332 00808000
         LTR   @14,@14                                             0332 00809000
         BNZ   @RF00332                                            0332 00810000
*     DO;                                                          0333 00811000
*       S24CSW2R=ON;                /* LOOK FOR 2ND CSW              */ 00812000
         OI    S24CSW2R+2680(WAPTR),B'01000000'                    0334 00813000
*       CALL S24C3000;              /*                               */ 00814000
         BAL   @14,S24C3000                                        0335 00815000
*       S24CSW2R=OFF;               /* RESET 2ND CSW SRCH FLG        */ 00816000
         LA    @14,2680                                            0336 00817000
         ALR   @14,WAPTR                                           0336 00818000
         NI    S24CSW2R(@14),B'10111111'                           0336 00819000
*       IF S24TCBER=ON              /* IF TECB ADDR = 0              */ 00820000
*         THEN                      /* (RC=0C SET IN SRCH RTN)       */ 00821000
         TM    S24TCBER(@14),B'00010000'                           0337 00822000
         BO    @RT00337                                            0337 00823000
*         GOTO S24C0450;            /* GO CHK ON XPTD SENSE          */ 00824000
*       IF S24SCHFL=ON THEN         /* IF SEARCH FAILED, PRNT        */ 00825000
         TM    S24SCHFL(@14),B'00001000'                           0339 00826000
         BO    @RT00339                                            0339 00827000
*         GOTO S24C0445;            /* BYPASS LINE SETUP             */ 00828000
*     END;                                                         0341 00829000
*   ELSE                                                           0342 00830000
*     CSWPSWPT=$PTRCSW2;            /* USE CSW2 PTR GIVNE            */ 00831000
         B     @RC00332                                            0342 00832000
@RF00332 L     @14,$PTRCSW2(,DPRPTR)                               0342 00833000
         ST    @14,CSWPSWPT                                        0342 00834000
*   CALL S24C5000;                  /* XLATE & PUT CSW/PSW IN BFR    */ 00835000
@RC00332 BAL   @14,S24C5000                                        0343 00836000
*S24C0445:                                                         0344 00837000
*   CALL S24C2000;                  /* CHK PP LEV 2/3,OUTPUT LINE    */ 00838000
S24C0445 BAL   @14,S24C2000                                        0344 00839000
*/********************************************************************/ 00840000
*/*      EXPECTED SENSE LINES                                        */ 00841000
*/********************************************************************/ 00842000
*                                                                  0345 00843000
*S24C0450:                                                         0345 00844000
*   IF $XPTDSNS=OFF                 /* IF NOT TO PRT XPTD SENSE      */ 00845000
*     THEN                                                         0345 00846000
S24C0450 TM    $XPTDSNS(PRTPTR),B'00000010'                        0345 00847000
         BZ    @RT00345                                            0345 00848000
*     GOTO S24C0500;                /* GO CHK FOR RCVD SNS           */ 00849000
*   IF $PTXSNSA=0|$PTXSNSC=0        /* IF XPTD SNS ADDR OR COUNT     */ 00850000
*     THEN                          /* = 0                           */ 00851000
         L     @14,$PTXSNSA(,DPRPTR)                               0347 00852000
         LTR   @14,@14                                             0347 00853000
         BZ    @RT00347                                            0347 00854000
         CLI   $PTXSNSC(PRTPTR),0                                  0347 00855000
         BNE   @RF00347                                            0347 00856000
@RT00347 DS    0H                                                  0348 00857000
*     DO;                           /* THEN                          */ 00858000
*       $24RETCD='0C'X;             /* RC = 0C                       */ 00859000
         MVI   $24RETCD(WAPTR),X'0C'                               0349 00860000
*       GOTO S24C0500;              /* GO CHK FOR RCVD SNS           */ 00861000
         B     S24C0500                                            0350 00862000
*     END;                                                         0351 00863000
*   $NSXX=$PTXSNSC;                 /* COUNT OF SENSE DATA           */ 00864000
@RF00347 SLR   @14,@14                                             0352 00865000
         IC    @14,$PTXSNSC(,PRTPTR)                               0352 00866000
         STH   @14,$NSXX(,WAPTR)                                   0352 00867000
*   $NSPTR=$PTXSNSA;                /* PTR TO SENSE DATA             */ 00868000
         L     @14,$PTXSNSA(,DPRPTR)                               0353 00869000
         ST    @14,$NSPTR(,WAPTR)                                  0353 00870000
*   SNSXPRCV='XPTD SNS';            /* PUT'XPTD SNS' IN BUFR         */ 00871000
         MVC   SNSXPRCV+1976(8,WAPTR),@CC00950                     0354 00872000
*   CALL S24C6000;                  /* STRUCTURE & PRINT SNS LNES    */ 00873000
         BAL   @14,S24C6000                                        0355 00874000
*/********************************************************************/ 00875000
*/*      RECEIVED SENSE LINES                                        */ 00876000
*/********************************************************************/ 00877000
*                                                                  0356 00878000
*S24C0500:                                                         0356 00879000
*   IF $RCVDSNS=OFF                 /* IF NOT TO PRT RCVD SNS        */ 00880000
*     THEN                                                         0356 00881000
S24C0500 TM    $RCVDSNS(PRTPTR),B'00000001'                        0356 00882000
         BZ    @RT00356                                            0356 00883000
*     GOTO S24C0550;                /* GO CHK OUT XPTD DATA          */ 00884000
*   IF $PTRSNSC=0                   /* IF SENSE COUNT IS 0           */ 00885000
*     THEN                          /*                               */ 00886000
         CLI   $PTRSNSC(PRTPTR),0                                  0358 00887000
         BNE   @RF00358                                            0358 00888000
*     DO;                           /*                               */ 00889000
*S24C0510:                                                         0360 00890000
*       CALL S24C2600;              /* BLANK BUFFER                  */ 00891000
S24C0510 BAL   @14,S24C2600                                        0360 00892000
*       $24RETCD='0C'X;             /* SET RC=0C                     */ 00893000
         MVI   $24RETCD(WAPTR),X'0C'                               0361 00894000
*       GOTO S24C0550;              /* AND GO CHK XPTD DATA          */ 00895000
         B     S24C0550                                            0362 00896000
*     END;                                                         0363 00897000
*   SNSXPRCV='RCVD SNS';            /* PUT 'RCVD SNS' IN BUFR        */ 00898000
@RF00358 LA    @14,1976                                            0364 00899000
         ALR   @14,WAPTR                                           0364 00900000
         MVC   SNSXPRCV(8,@14),@CC00956                            0364 00901000
*   IF $SENSERR=ON                  /* IF SNS AN ERROR               */ 00902000
*     THEN                                                         0365 00903000
         TM    $SENSERR(PRTPTR),B'00000010'                        0365 00904000
         BNO   @RF00365                                            0365 00905000
*     SNSASTRK='*';                 /* PRECEDE LINE WITH *           */ 00906000
         MVI   SNSASTRK(@14),C'*'                                  0366 00907000
*   IF $PTRSNSA^=0                  /* IF ADDR OF RCVD SNS GIVEN     */ 00908000
*     THEN                                                         0367 00909000
@RF00365 L     @14,$PTRSNSA(,DPRPTR)                               0367 00910000
         LTR   @14,@14                                             0367 00911000
         BZ    @RF00367                                            0367 00912000
*     $NSPTR=$PTRSNSA;              /* USE IT TO PRINT OUT LINES     */ 00913000
         ST    @14,$NSPTR(,WAPTR)                                  0368 00914000
*   ELSE                            /*                               */ 00915000
*     DO;                           /* IF ADDR NOT GIVEN             */ 00916000
         B     @RC00367                                            0369 00917000
@RF00367 DS    0H                                                  0370 00918000
*       S24SNSRQ=ON;                /* SEARCH TECB FOR SNS FLD       */ 00919000
         OI    S24SNSRQ+2680(WAPTR),B'00100000'                    0370 00920000
*       CALL S24C3000;                                             0371 00921000
         BAL   @14,S24C3000                                        0371 00922000
*       S24SNSRQ=OFF;                                              0372 00923000
         LA    @14,2680                                            0372 00924000
         ALR   @14,WAPTR                                           0372 00925000
         NI    S24SNSRQ(@14),B'11011111'                           0372 00926000
*       IF S24TCBER=ON              /* IF TECB ADDR = 0              */ 00927000
*         THEN                                                     0373 00928000
         TM    S24TCBER(@14),B'00010000'                           0373 00929000
         BO    @RT00373                                            0373 00930000
*         GOTO S24C0510;            /* RC=0C GO CHK ON XPTD DATA     */ 00931000
*       IF S24SCHFL=ON              /* IF SEARCH FAILED              */ 00932000
*         THEN                      /* PUT 'NONE' IN PRT BUFR        */ 00933000
         TM    S24SCHFL(@14),B'00001000'                           0375 00934000
         BNO   @RF00375                                            0375 00935000
*         DO;                                                      0376 00936000
*           SNSNONE='NONE';                                        0377 00937000
         MVC   SNSNONE+1976(4,WAPTR),@CC00880                      0377 00938000
*           CALL S24C2000;          /* CHK PP 2&3 AND PRT LINE       */ 00939000
         BAL   @14,S24C2000                                        0378 00940000
*           GOTO S24C0550;          /* THAT'S IT, CHK XPTD DATA      */ 00941000
         B     S24C0550                                            0379 00942000
*         END;                                                     0380 00943000
*     END;                                                         0381 00944000
@RF00375 DS    0H                                                  0382 00945000
*   $NSXX=$PTRSNSC;                 /* # OF SNS BYTES TO PRINT       */ 00946000
@RC00367 SLR   @14,@14                                             0382 00947000
         IC    @14,$PTRSNSC(,PRTPTR)                               0382 00948000
         STH   @14,$NSXX(,WAPTR)                                   0382 00949000
*   CALL S24C6000;                  /* GO SET UP & OUTPUT LINE(S)    */ 00950000
         BAL   @14,S24C6000                                        0383 00951000
*/********************************************************************/ 00952000
*/*      EXPECTED DATA LINE(S)                                       */ 00953000
*/********************************************************************/ 00954000
*                                                                  0384 00955000
*S24C0550:                                                         0384 00956000
*   IF $XPTDATA=OFF                 /* IF NOT TO PRINT XPTD DATA     */ 00957000
*     THEN                                                         0384 00958000
S24C0550 TM    $XPTDATA(PRTPTR),B'10000000'                        0384 00959000
         BZ    @RT00384                                            0384 00960000
*     GOTO S24C0600;                /* GO CHK RCVD DATA              */ 00961000
*   $ATAPTR=$PTXDATA;               /* PT TO XPTD DATA               */ 00962000
         L     @14,$PTXDATA(,DPRPTR)                               0386 00963000
         ST    @14,$ATAPTR(,WAPTR)                                 0386 00964000
*   $ATACNT=$PTXDATC;               /* XPTD DATA COUNT               */ 00965000
         MVC   $ATACNT(2,WAPTR),$PTXDATC(PRTPTR)                   0387 00966000
*   DATAXPRC='XPTD DATA';           /* PUT 'XPTD DATA IN BFR         */ 00967000
         MVC   DATAXPRC+1976(9,WAPTR),@CC00959                     0388 00968000
*   CALL S24C7000;                  /* SET UP & OUTPUT LINES         */ 00969000
         BAL   @14,S24C7000                                        0389 00970000
*/********************************************************************/ 00971000
*/*      RECEIVED DATA LINE(S)                                       */ 00972000
*/********************************************************************/ 00973000
*                                                                  0390 00974000
*S24C0600:                                                         0390 00975000
*   IF $RCVDATA=OFF                 /* IF NOT TO PRT RCVD DATA       */ 00976000
*     THEN                                                         0390 00977000
S24C0600 TM    $RCVDATA(PRTPTR),B'01000000'                        0390 00978000
         BZ    @RT00390                                            0390 00979000
*     GOTO S24C0650;                /* GO CHK ON WRITTEN DATA        */ 00980000
*   $ATAPTR=$PTRDATA;               /* PT TO RCVD DATA               */ 00981000
         L     @14,$PTRDATA(,DPRPTR)                               0392 00982000
         ST    @14,$ATAPTR(,WAPTR)                                 0392 00983000
*   $ATACNT=$PTRDATC;               /* COUNT OF RCVD DATA            */ 00984000
         MVC   $ATACNT(2,WAPTR),$PTRDATC(PRTPTR)                   0393 00985000
*   DATAXPRC='RCVD DATA';           /* PUT 'RCVD DATA' IN PRT BFR    */ 00986000
         LA    @14,1976                                            0394 00987000
         ALR   @14,WAPTR                                           0394 00988000
         MVC   DATAXPRC(9,@14),@CC00964                            0394 00989000
*   IF $DATAERR=ON                  /* IF ERROR IN DATA              */ 00990000
*     THEN                                                         0395 00991000
         TM    $DATAERR(PRTPTR),B'00001000'                        0395 00992000
         BNO   @RF00395                                            0395 00993000
*     DATAERR='*';                  /* MARK WITH AN *                */ 00994000
         MVI   DATAERR(@14),C'*'                                   0396 00995000
*   CALL S24C7000;                  /* SET UP & OUTPUT LINE          */ 00996000
@RF00395 BAL   @14,S24C7000                                        0397 00997000
*/********************************************************************/ 00998000
*/*      WRITTEN DATA LINE(S)                                        */ 00999000
*/********************************************************************/ 01000000
*                                                                  0398 01001000
*S24C0650:                                                         0398 01002000
*   IF $WRTDATA=OFF                 /* IF NO WRT DATA TO PRINT       */ 01003000
*     THEN                                                         0398 01004000
S24C0650 TM    $WRTDATA(PRTPTR),B'00100000'                        0398 01005000
         BZ    @RT00398                                            0398 01006000
*     GOTO S24C0700;                /* CHK ON MSG LINES              */ 01007000
*   $ATAPTR=$PTWDATA;               /* PT TO WRITTEN DATA            */ 01008000
         L     @14,$PTWDATA(,DPRPTR)                               0400 01009000
         ST    @14,$ATAPTR(,WAPTR)                                 0400 01010000
*   $ATACNT=$PTWDATC;               /* COUNT OF WRT DATA             */ 01011000
         MVC   $ATACNT(2,WAPTR),$PTWDATC(PRTPTR)                   0401 01012000
*   DATAWRT='WRTN DATA';            /* PUT 'WRTN DATA' IN BUFR       */ 01013000
         MVC   DATAWRT+1976(9,WAPTR),@CC00968                      0402 01014000
*   CALL S24C7000;                  /* SET UP & OUTPUT LINES         */ 01015000
         BAL   @14,S24C7000                                        0403 01016000
*/********************************************************************/ 01017000
*/*      MESSAGE (COMMENT) LINES                                     */ 01018000
*/********************************************************************/ 01019000
*                                                                  0404 01020000
*S24C0700:                                                         0404 01021000
*   IF $MESSAGE=OFF                 /* IF NO MESSAGE LINES           */ 01022000
*     THEN                                                         0404 01023000
S24C0700 TM    $MESSAGE(PRTPTR),B'00000001'                        0404 01024000
         BZ    @RT00404                                            0404 01025000
*     GOTO S24C0750;                /* DO SOMETHING WITH FORMSCTL    */ 01026000
*   $DDRPTR=$PRTMSGL;               /* PT TO ARRAY OF MSG PTRS       */ 01027000
         L     @14,$PRTMSGL(,DPRPTR)                               0406 01028000
         ST    @14,$DDRPTR(,WAPTR)                                 0406 01029000
*   $OUNTPTR=$PTMSGOF+$PRTCTLW;     /* PT TO ARRAY OF MSG COUNTS     */ 01030000
         SLR   @14,@14                                             0407 01031000
         IC    @14,$PTMSGOF(,PRTPTR)                               0407 01032000
         AL    @14,$PRTCTLW(,DPRPTR)                               0407 01033000
         ST    @14,$OUNTPTR(,WAPTR)                                0407 01034000
*   $UMXX=$PTMSGLC;                 /* NUMBER OF MSG LINES           */ 01035000
         IC    @14,$PTMSGLC(,PRTPTR)                               0408 01036000
         STC   @14,$UMXX(,WAPTR)                                   0408 01037000
*   CALL S24C1000;                  /* SET UP & PRT MSG LINES        */ 01038000
         BAL   @14,S24C1000                                        0409 01039000
*/********************************************************************/ 01040000
*/*     FORMS CONTROL                                                */ 01041000
*/********************************************************************/ 01042000
*                                                                  0410 01043000
*S24C0750:                                                         0410 01044000
*   $PRTFORM=$PTCNTWD(1:1);         /* SET UP PRINT FORMS            */ 01045000
S24C0750 MVC   $PRTFORM(1,WAPTR),$PTCNTWD(PRTPTR)                  0410 01046000
*   $PRTFORM=$PRTFORM/32;           /* MOVE TO LOWER 3 BITS          */ 01047000
         SLR   @14,@14                                             0411 01048000
         IC    @14,$PRTFORM(,WAPTR)                                0411 01049000
         SRL   @14,5                                               0411 01050000
         STC   @14,$PRTFORM(,WAPTR)                                0411 01051000
*   IF $PRTFORM^=2&                 /* IF NOT TO SPACE 2 LINES       */ 01052000
*       $PRTFORM^=3                 /* AND NOT 3 LINES               */ 01053000
*     THEN                                                         0412 01054000
         CLI   $PRTFORM(WAPTR),2                                   0412 01055000
         BE    @RF00412                                            0412 01056000
         CLI   $PRTFORM(WAPTR),3                                   0412 01057000
         BNE   @RT00412                                            0412 01058000
*     GOTO S24C0755;                /* DON'T GO TO MSG I/0           */ 01059000
*   ELSE                                                           0414 01060000
*     DO $CTR=1 TO $PRTFORM-1;      /* DO BLANK LINES                */ 01061000
@RF00412 LA    @14,1                                               0414 01062000
         B     @DE00414                                            0414 01063000
@DL00414 DS    0H                                                  0415 01064000
*       CALL S24C2500;              /* GO TO MSG I/O                 */ 01065000
         BAL   @14,S24C2500                                        0415 01066000
*     END;                                                         0416 01067000
         LA    @14,1                                               0416 01068000
         AH    @14,$CTR(,WAPTR)                                    0416 01069000
@DE00414 STH   @14,$CTR(,WAPTR)                                    0416 01070000
         SLR   @00,@00                                             0416 01071000
         IC    @00,$PRTFORM(,WAPTR)                                0416 01072000
         BCTR  @00,0                                               0416 01073000
         CR    @14,@00                                             0416 01074000
         BNH   @DL00414                                            0416 01075000
*S24C0755:                                                         0417 01076000
*   IF $PRTFORM=4                   /* IF FOR PRT &RESTORE           */ 01077000
*       |$PRTFORM=5                 /* OR FOR RESTORE                */ 01078000
*     THEN                                                         0417 01079000
S24C0755 CLI   $PRTFORM(WAPTR),4                                   0417 01080000
         BE    @RT00417                                            0417 01081000
         CLI   $PRTFORM(WAPTR),5                                   0417 01082000
         BNE   @RF00417                                            0417 01083000
@RT00417 DS    0H                                                  0418 01084000
*     CALL S24C2500;                /* THEN GOTO MSG I/O             */ 01085000
         BAL   @14,S24C2500                                        0418 01086000
*   $PRTONLY=OFF;                   /* RESET PRINTER ONLY            */ 01087000
@RF00417 NI    $PRTONLY(WAPTR),B'11110111'                         0419 01088000
*   R15=$24RETCD;                   /* PICK UP DPRINT RETURN CODE    */ 01089000
         SLR   R15,R15                                             0420 01090000
         IC    R15,$24RETCD(,WAPTR)                                0420 01091000
*   $NOTRRCH=OFF;                   /* DO RC HDLG & TRACE NOW        */ 01092000
         NI    $NOTRRCH(WAPTR),B'11111101'                         0421 01093000
*   $R13PTR=$24SAV13;               /* PT RCM TO MY CALLER'S SAVE  0422 01094000
*                                      AREA                          */ 01095000
         L     @14,$24SAV13(,WAPTR)                                0422 01096000
         ST    @14,$R13PTR(,WAPTR)                                 0422 01097000
*   IF $ERRORDP=ON&(($FSTCOMM=ON&   /* IF THERE IS A FE MSG          */ 01098000
*       $FSTFE=OFF)|($CATERR=ON     /* OR CATERR MSG TO SEND         */ 01099000
*       &$FSTCAT=OFF))              /*                               */ 01100000
*     THEN                          /*                               */ 01101000
         TM    $ERRORDP(PRTPTR),B'00000010'                        0423 01102000
         BNO   @RF00423                                            0423 01103000
         TM    $FSTCOMM(WAPTR),B'00000001'                         0423 01104000
         BNO   @GL00012                                            0423 01105000
         TM    $FSTFE(WAPTR),B'10000000'                           0423 01106000
         BZ    @RT00423                                            0423 01107000
@GL00012 TM    $CATERR(WAPTR),B'00100000'                          0423 01108000
         BNO   @RF00423                                            0423 01109000
         TM    $FSTCAT(WAPTR),B'01000000'                          0423 01110000
         BNZ   @RF00423                                            0423 01111000
@RT00423 DS    0H                                                  0424 01112000
*     DO;                                                          0424 01113000
*       IF $DPCHAIN=OFF             /* AND IF DPRINT NOT CHAINED     */ 01114000
*         THEN                                                     0425 01115000
         TM    $DPCHAIN(PRTPTR),B'00001000'                        0425 01116000
         BZ    @RT00425                                            0425 01117000
*         GOTO S24C0850;            /* GO CHK ON 1ST ERR             */ 01118000
*     END;                                                         0427 01119000
*   ELSE                            /* ELSE                          */ 01120000
*     GOTO S24C9999;                /* RETURN TO RCM                 */ 01121000
*/********************************************************************/ 01122000
*/*      FIRST ERROR MESSAGE                                         */ 01123000
*/********************************************************************/ 01124000
*                                                                  0429 01125000
*S24C0850:                                                         0429 01126000
*   IF $ERRORDP=ON&$FSTCOMM=ON&     /* IF THIS IS AN ERROR DP,FE     */ 01127000
*       $FSTFE=OFF                  /* OPTN ON AND FE MSG HASN'T BEEN   01128000
*                                      ISSUED	                       */ 01129000
*     THEN                                                         0429 01130000
S24C0850 TM    $ERRORDP(PRTPTR),B'00000010'                        0429 01131000
         BNO   @RF00429                                            0429 01132000
         TM    $FSTCOMM(WAPTR),B'00000001'                         0429 01133000
         BNO   @RF00429                                            0429 01134000
         TM    $FSTFE(WAPTR),B'10000000'                           0429 01135000
         BNZ   @RF00429                                            0429 01136000
*     DO;                                                          0430 01137000
*       $FSTFE=ON;                  /* FE MSG HAS BEEN ISSUED        */ 01138000
         OI    $FSTFE(WAPTR),B'10000000'                           0431 01139000
*       $INBUFR(1:23)=              /* GATHER UP FE VARIABLES        */ 01140000
*           $24FEMSG;               /* GO TO CECOM WITH THEN         */ 01141000
*                                                                  0432 01142000
         MVC   $INBUFR(23,WAPTR),$24FEMSG(WAPTR)                   0432 01143000
*       /*************************************************************/ 01144000
*       /*                                                           */ 01145000
*       /* TCEC MSGN(129)SUB(YES) INVOKED                            */ 01146000
*       /*                                                           */ 01147000
*       /*************************************************************/ 01148000
*                                                                  0433 01149000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 01150000
         OI    $TCECM(WAPTR),B'00000001'                           0433 01151000
*       R1=ADDR($TCA15);            /* SET UP PARM LIST $TR          */ 01152000
         LA    R1,$TCA15                                           0434 01153000
*       CALL #EXIT;                 /* CALL CECOM                    */ 01154000
         L     @15,#EXITA(,WAPTR)                                  0435 01155000
         BALR  @14,@15                                             0435 01156000
*       DCL                                                        0436 01157000
*         1 $TCA15,                 /* TCEC PARM LIST                */ 01158000
*          2 $TCB15 FIXED(32) INIT(129),/* MSG NUMBER                */ 01159000
*          2 $TCC15 FIXED(32) INIT(0),/* INCT LEN                    */ 01160000
*          2 $TCD15 BIT(8) INIT('10000000'B),/* FLAG                 */ 01161000
*          2 $TCE15 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK         */ 01162000
*     END;                                                         0437 01163000
*                                                                  0437 01164000
*/********************************************************************/ 01165000
*/*      CATASTROPHIC ERROR MESSAGE                                  */ 01166000
*/********************************************************************/ 01167000
*                                                                  0438 01168000
*   IF $CATERR=ON&$FSTCAT=OFF THEN                                 0438 01169000
@RF00429 TM    $CATERR(WAPTR),B'00100000'                          0438 01170000
         BNO   @RF00438                                            0438 01171000
         TM    $FSTCAT(WAPTR),B'01000000'                          0438 01172000
         BNZ   @RF00438                                            0438 01173000
*     DO;                                                          0439 01174000
*       $FSTCAT=ON;                 /* CATERR MSG HAS BEEN ISSUED    */ 01175000
         OI    $FSTCAT(WAPTR),B'01000000'                          0440 01176000
*       $CATMSG=ON;                 /* CATERR MSG CAUSED COMM INT    */ 01177000
         OI    $CATMSG(WAPTR),B'00000100'                          0441 01178000
*       $INBUFR(1:12)=              /* SET UP CAT ERR MSGS           */ 01179000
*           $24CATMG;               /* LINK TO CECOM                 */ 01180000
*                                                                  0442 01181000
         MVC   $INBUFR(12,WAPTR),$24CATMG(WAPTR)                   0442 01182000
*       /*************************************************************/ 01183000
*       /*                                                           */ 01184000
*       /* TCEC MSGN(157)SUB(YES) INVOKED                            */ 01185000
*       /*                                                           */ 01186000
*       /*************************************************************/ 01187000
*                                                                  0443 01188000
*       $TCECM='1'B;                /* SET TCEC SW IN RCA            */ 01189000
         OI    $TCECM(WAPTR),B'00000001'                           0443 01190000
*       R1=ADDR($TCA16);            /* SET UP PARM LIST $TR          */ 01191000
         LA    R1,$TCA16                                           0444 01192000
*       CALL #EXIT;                 /* CALL CECOM                    */ 01193000
         L     @15,#EXITA(,WAPTR)                                  0445 01194000
         BALR  @14,@15                                             0445 01195000
*       DCL                                                        0446 01196000
*         1 $TCA16,                 /* TCEC PARM LIST                */ 01197000
*          2 $TCB16 FIXED(32) INIT(157),/* MSG NUMBER                */ 01198000
*          2 $TCC16 FIXED(32) INIT(0),/* INCT LEN                    */ 01199000
*          2 $TCD16 BIT(8) INIT('10000000'B),/* FLAG                 */ 01200000
*          2 $TCE16 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK         */ 01201000
*     END;                                                         0447 01202000
*   IF $TESTMDE(1)=ON               /* IF CT IN TESTMODE             */ 01203000
*     THEN                                                         0448 01204000
@RF00438 TM    $TESTMDE(WAPTR),B'00000010'                         0448 01205000
         BO    @RT00448                                            0448 01206000
*     GO TO S24C0875;               /* ISSUE MESSAGE 240             */ 01207000
*                                                                  0449 01208000
*   /*****************************************************************/ 01209000
*   /*                                                               */ 01210000
*   /* CHECK IF CT LINE ISIN TEST MODE                               */ 01211000
*   /*                                                               */ 01212000
*   /*****************************************************************/ 01213000
*                                                                  0450 01214000
*   IF $SYSMN(1)^='SYS CON ' THEN   /* CHECK FOR DEVICE IN TEST AND     01215000
*                                      CT ON SAME LINE ONLY IF NOT 0450 01216000
*                                      SYSTEM CONSOLE        @DM44278*/ 01217000
         CLC   $SYSMN(8,WAPTR),@CC00994                            0450 01218000
         BE    @RF00450                                            0450 01219000
*     DO J=3 TO $DEVCNTS;           /* CHECK ALL TEST DEVICES        */ 01220000
         LA    J,3                                                 0451 01221000
         B     @DE00451                                            0451 01222000
@DL00451 DS    0H                                                  0452 01223000
*       IF $TESTMDE(J)=ON&          /* IF DEVICE IN TEST             */ 01224000
*           $LINENME(1)=$LINENME(J) /* AND IF ON THE CT LINE         */ 01225000
*         THEN                                                     0452 01226000
         LR    @14,J                                               0452 01227000
         MH    @14,@CH00326                                        0452 01228000
         ST    @14,@TF00001                                        0452 01229000
         ALR   @14,WAPTR                                           0452 01230000
         TM    $TESTMDE-68(@14),B'00000010'                        0452 01231000
         BNO   @RF00452                                            0452 01232000
         LR    @14,WAPTR                                           0452 01233000
         AL    @14,@TF00001                                        0452 01234000
         CLC   $LINENME(8,WAPTR),$LINENME-68(@14)                  0452 01235000
         BE    @RT00452                                            0452 01236000
*         GO TO S24C0875;           /* SKIP COMMUNICATION INTERVAL   */ 01237000
*     END;                          /* END OF BUSY CT LINE CHECK     */ 01238000
@RF00452 AL    J,@CF00043                                          0454 01239000
@DE00451 CH    J,$DEVCNTS(,WAPTR)                                  0454 01240000
         BNH   @DL00451                                            0454 01241000
*   CALL ISTIC002;                  /* CALL COMM INTERVAL            */ 01242000
@RF00450 L     @15,@CV00995                                        0455 01243000
         BALR  @14,@15                                             0455 01244000
*S24C0900:                                                         0456 01245000
*   R15=$24RETCD;                   /* RESET COND CODE               */ 01246000
S24C0900 SLR   R15,R15                                             0456 01247000
         IC    R15,$24RETCD(,WAPTR)                                0456 01248000
*   GOTO S24C9999;                  /* RETURN                        */ 01249000
         B     S24C9999                                            0457 01250000
*S24C0875:                                                         0458 01251000
*                                                                  0458 01252000
*   /*****************************************************************/ 01253000
*   /*                                                               */ 01254000
*   /* TCEC MSGN(240) INVOKED                                        */ 01255000
*   /*                                                               */ 01256000
*   /*****************************************************************/ 01257000
*                                                                  0458 01258000
*   $TCECM='1'B;                    /* SET TCEC SW IN RCA            */ 01259000
S24C0875 OI    $TCECM(WAPTR),B'00000001'                           0458 01260000
*   R1=ADDR($TCA17);                /* SET UP PARM LIST $TR          */ 01261000
         LA    R1,$TCA17                                           0459 01262000
*   CALL #EXIT;                     /* CALL CECOM                    */ 01263000
         L     @15,#EXITA(,WAPTR)                                  0460 01264000
         BALR  @14,@15                                             0460 01265000
*   DCL                                                            0461 01266000
*     1 $TCA17,                     /* TCEC PARM LIST                */ 01267000
*      2 $TCB17 FIXED(32) INIT(240),/* MSG NUMBER                    */ 01268000
*      2 $TCC17 FIXED(32) INIT(0),  /* INCT LEN                      */ 01269000
*      2 $TCD17 BIT(8) INIT('00000000'B),/* FLAG                     */ 01270000
*      2 $TCE17 CHAR(4) INIT('FFFFFFFF'X);/* MSSAGE MASK             */ 01271000
*   $CATERR=OFF;                    /* RESET CATASTROPHIC ERROR BIT  */ 01272000
         NI    $CATERR(WAPTR),B'11011111'                          0462 01273000
*   GO TO S24C0900;                 /* LEAVE                         */ 01274000
         B     S24C0900                                            0463 01275000
*/********************************************************************/ 01276000
*/*  ROUTINE TO PICK UP AND OUTPUT DESCRIPTION AND MESSAGE LINES     */ 01277000
*/*      INPUT:                                                      */ 01278000
*/*            $DDRPTR -  POINTER TO ARRAY OF ADDRESSES OF LINES TO  */ 01279000
*/*                       BE OUTPUT                                  */ 01280000
*/*            $OUNTPTR-  POINTER TO ARRAY OF LENGTHS OF LINES       */ 01281000
*/*            $UMXX -    TOTAL NUMBER OF LINES TO BE OUTPUT         */ 01282000
*/********************************************************************/ 01283000
*                                                                  0464 01284000
*S24C1000:                                                         0464 01285000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0464 01286000
S24C1000 DS    0H                                                  0465 01287000
*   $24SAVE1=R14;                   /* SAVE RETURN ADDRESS           */ 01288000
         ST    R14,$24SAVE1(,WAPTR)                                0465 01289000
*   IF $ALTPRNT=ON&                 /* IF PP IS IN EFFECT            */ 01290000
*       ($PRNTLVL='1'|              /* AND PRINT LEVEL IS 1          */ 01291000
*       $PRNTLVL='3')               /* OR 3                          */ 01292000
*     THEN                                                         0466 01293000
         TM    $ALTPRNT(WAPTR),B'00010000'                         0466 01294000
         BNO   @RF00466                                            0466 01295000
         CLI   $PRNTLVL(WAPTR),C'1'                                0466 01296000
         BE    @RT00466                                            0466 01297000
         CLI   $PRNTLVL(WAPTR),C'3'                                0466 01298000
         BNE   @RF00466                                            0466 01299000
@RT00466 DS    0H                                                  0467 01300000
*     $PRTONLY=OFF;                 /* PRINT ON CT ALSO              */ 01301000
         NI    $PRTONLY(WAPTR),B'11110111'                         0467 01302000
*   IF $UMXX=0 THEN                 /* IF NO. OF LINES IS ZERO       */ 01303000
@RF00466 CLI   $UMXX(WAPTR),0                                      0468 01304000
         BNE   @RF00468                                            0468 01305000
*     DO;                                                          0469 01306000
*       $24RETCD='0C'X;             /* RETURN TO CALLER, RC=0C       */ 01307000
         MVI   $24RETCD(WAPTR),X'0C'                               0470 01308000
*       GOTO S24C1020;                                             0471 01309000
         B     S24C1020                                            0471 01310000
*     END;                                                         0472 01311000
*   DO $CTR=1 TO $UMXX;             /* LOOP THRU ARRAY OF LINES      */ 01312000
@RF00468 LA    @14,1                                               0473 01313000
         B     @DE00473                                            0473 01314000
@DL00473 DS    0H                                                  0474 01315000
*     IF S24BYTEA($CTR)=0           /* IF A BYTE COUNT OF A LINE     */ 01316000
*       THEN                        /* IS 0                          */ 01317000
         LH    @14,$CTR(,WAPTR)                                    0474 01318000
         L     @11,$OUNTPTR(,WAPTR)                                0474 01319000
         BCTR  @11,0                                               0474 01320000
         SLR   @00,@00                                             0474 01321000
         IC    @00,S24BYTEA(@14,@11)                               0474 01322000
         C     @00,@CF00864                                        0474 01323000
         BNE   @RF00474                                            0474 01324000
*       DO;                         /*                               */ 01325000
*         $24RETCD='0C'X;           /* SET RETURN CODE = 0C          */ 01326000
         MVI   $24RETCD(WAPTR),X'0C'                               0476 01327000
*         GOTO S24C1010;            /* TRY NEXT ENTRY                */ 01328000
         B     S24C1010                                            0477 01329000
*       END;                        /*                               */ 01330000
*     IF S24BYTEA($CTR)>120         /* IF LENGTH OF LINE > MAX       */ 01331000
*       THEN                                                       0479 01332000
@RF00474 LH    @14,$CTR(,WAPTR)                                    0479 01333000
         L     @11,$OUNTPTR(,WAPTR)                                0479 01334000
         BCTR  @11,0                                               0479 01335000
         SLR   @00,@00                                             0479 01336000
         IC    @00,S24BYTEA(@14,@11)                               0479 01337000
         C     @00,@CF00435                                        0479 01338000
         BNH   @RF00479                                            0479 01339000
*       $ENXX=120;                  /* SET IT TO MAX                 */ 01340000
         MVI   $ENXX(WAPTR),X'78'                                  0480 01341000
*     ELSE                                                         0481 01342000
*       $ENXX=S24BYTEA($CTR);       /* OTHERWISE USE LGTH AS IS      */ 01343000
         B     @RC00479                                            0481 01344000
@RF00479 LH    @14,$CTR(,WAPTR)                                    0481 01345000
         L     @11,$OUNTPTR(,WAPTR)                                0481 01346000
         BCTR  @11,0                                               0481 01347000
         SLR   @00,@00                                             0481 01348000
         IC    @00,S24BYTEA(@14,@11)                               0481 01349000
         STC   @00,$ENXX(,WAPTR)                                   0481 01350000
*     $BUFFER(1:$ENXX)=             /* PUT LINE IN BUFR              */ 01351000
*         S24LINE(1:$ENXX);                                        0482 01352000
@RC00479 SLR   @14,@14                                             0482 01353000
         IC    @14,$ENXX(,WAPTR)                                   0482 01354000
         BCTR  @14,0                                               0482 01355000
         LH    @11,$CTR(,WAPTR)                                    0482 01356000
         SLA   @11,2                                               0482 01357000
         L     @10,$DDRPTR(,WAPTR)                                 0482 01358000
         AL    @10,@CF01092                                        0482 01359000
         L     @11,S24ADDRA(@11,@10)                               0482 01360000
         EX    @14,@SM01093                                        0482 01361000
*     CALL S24C2500;                /* PRINT THE LINE                */ 01362000
         BAL   @14,S24C2500                                        0483 01363000
*S24C1010:                                                         0484 01364000
*     $UMXX=$UMXX;                  /* KEEP PLS HONEST               */ 01365000
S24C1010 SLR   @14,@14                                             0484 01366000
         IC    @14,$UMXX(,WAPTR)                                   0484 01367000
         STC   @14,$UMXX(,WAPTR)                                   0484 01368000
*   END;                                                           0485 01369000
         LA    @14,1                                               0485 01370000
         AH    @14,$CTR(,WAPTR)                                    0485 01371000
@DE00473 STH   @14,$CTR(,WAPTR)                                    0485 01372000
         SLR   @00,@00                                             0485 01373000
         IC    @00,$UMXX(,WAPTR)                                   0485 01374000
         CR    @14,@00                                             0485 01375000
         BNH   @DL00473                                            0485 01376000
*S24C1020:                                                         0486 01377000
*   R14=$24SAVE1;                   /* RESTORE RETURN ADDR           */ 01378000
S24C1020 L     R14,$24SAVE1(,WAPTR)                                0486 01379000
*   END S24C1000;                                                  0487 01380000
*                                                                  0487 01381000
@EL00002 DS    0H                                                  0487 01382000
@EF00002 DS    0H                                                  0487 01383000
@ER00002 BR    @14                                                 0487 01384000
*/********************************************************************/ 01385000
*/*      ROUTINE TO OUTPUT A DPRINT LINE                             */ 01386000
*/*      ENTRY POINTS:                                               */ 01387000
*/*            S24C2000:  CHK FOR PP LEVELS 2 & 3 AND OUTPUT LINE    */ 01388000
*/*            S24C2500:  OUTPUT LINE WITH NO PP LEVEL CHK           */ 01389000
*/*            S24C2550:  BLANK OUT BUFFER                           */ 01390000
*/********************************************************************/ 01391000
*                                                                  0488 01392000
*                                   /* ENTRY FOR PP LEVELS 2&3       */ 01393000
*S24C2000:                                                         0488 01394000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0488 01395000
S24C2000 DS    0H                                                  0489 01396000
*   IF $ALTPRNT=ON&($PRNTLVL='2'|$PRNTLVL='3')/* IF PRINT LVL IS 2 OR   01397000
*                                      3                             */ 01398000
*     THEN                                                         0489 01399000
         TM    $ALTPRNT(WAPTR),B'00010000'                         0489 01400000
         BNO   @RF00489                                            0489 01401000
         CLI   $PRNTLVL(WAPTR),C'2'                                0489 01402000
         BE    @RT00489                                            0489 01403000
         CLI   $PRNTLVL(WAPTR),C'3'                                0489 01404000
         BNE   @RF00489                                            0489 01405000
@RT00489 DS    0H                                                  0490 01406000
*     $PRTONLY=OFF;                 /* THEN PRINT ON CT ALSO         */ 01407000
         NI    $PRTONLY(WAPTR),B'11110111'                         0490 01408000
*S24C2500:                                                         0491 01409000
*   ENTRY;                                                         0491 01410000
         B     @EC00491                                            0491 01411000
S24C2500 DS    0H                                                  0491 01412000
@EC00491 DS    0H                                                  0492 01413000
*   $24SAVE2=R14;                   /* SAVE RETURN ADDRESS           */ 01414000
         ST    R14,$24SAVE2(,WAPTR)                                0492 01415000
*   $COUTAD=ADDR($BUFFER);          /* POINT TO OUT BUFR             */ 01416000
         LA    @14,$BUFFER(,WAPTR)                                 0493 01417000
         ST    @14,$COUTAD(,WAPTR)                                 0493 01418000
*   $COUTCT=120;                    /* LENGTH OF OUT BUFR            */ 01419000
         MVC   $COUTCT(4,WAPTR),@CF00435                           0494 01420000
*   $CINADR=0;                      /* ZERO IN ADR FOR 1-WAY MSG     */ 01421000
         SLR   @14,@14                                             0495 01422000
         ST    @14,$CINADR(,WAPTR)                                 0495 01423000
*   CALL ISTCC011;                  /* GO TO MSG I/O                 */ 01424000
         L     @15,@CV01021                                        0496 01425000
         BALR  @14,@15                                             0496 01426000
*   SVESC024(4)=ADDR(S24C2550);     /* SET UP R14 FOR RCM            */ 01427000
         LA    @14,S24C2550                                        0497 01428000
         ST    @14,SVESC024+12(,WAPTR)                             0497 01429000
*   BC(15,S24C9999);                /* RETURN TO RCM WHEN RCM      0498 01430000
*                                      BRANCHES ON R14.. CONTROL   0498 01431000
*                                      RETURNS HERE.....             */ 01432000
         BC    15,S24C9999                                         0498 01433000
*S24C2550:                                                         0499 01434000
*   R14=$24SAVE2;                   /* RESTORE RETURN ADDRESS        */ 01435000
S24C2550 L     R14,$24SAVE2(,WAPTR)                                0499 01436000
*S24C2600:                                                         0500 01437000
*   ENTRY;                                                         0500 01438000
         B     @EC00500                                            0500 01439000
S24C2600 DS    0H                                                  0500 01440000
@EC00500 DS    0H                                                  0501 01441000
*   $BUFFER=' ';                    /* BLANK OUT BUFFER              */ 01442000
         MVI   $BUFFER+1(WAPTR),C' '                               0501 01443000
         MVC   $BUFFER+2(126,WAPTR),$BUFFER+1(WAPTR)               0501 01444000
         MVI   $BUFFER(WAPTR),C' '                                 0501 01445000
*   $PRTONLY=ON;                    /* TURN ON PRINTER ONLY FLAG     */ 01446000
         OI    $PRTONLY(WAPTR),B'00001000'                         0502 01447000
*S24C2650:                                                         0503 01448000
*   ;                                                              0503 01449000
*   END S24C2000;                                                  0504 01450000
*                                                                  0504 01451000
@EL00003 DS    0H                                                  0504 01452000
@EF00003 DS    0H                                                  0504 01453000
@ER00003 BR    @14                                                 0504 01454000
*/********************************************************************/ 01455000
*/*      ROUTINE TO SEARCH TECB                                      */ 01456000
*/*      INPUT:                                                      */ 01457000
*/*            FLAGS                                                 */ 01458000
*/*                 S24CCREQ - SEARCH FOR CONDITION CODE             */ 01459000
*/*                 S24CSW2R - SEARCH FOR SECOND CSW2/PSW2           */ 01460000
*/*                 S24SNSRQ - SEARCH FOR SENSE FIELD                */ 01461000
*/*                                                                  */ 01462000
*/*      OUTPUT:                                                     */ 01463000
*/*            FLAGS                                                 */ 01464000
*/*                 S24TCBER - TECB ADDR = 0 (RC SET TO 0C)          */ 01465000
*/*                 S24SCHFL - SEARCH FAILED                         */ 01466000
*/********************************************************************/ 01467000
*                                                                  0505 01468000
*S24C3000:                                                         0505 01469000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0505 01470000
S24C3000 DS    0H                                                  0506 01471000
*   $24SAVE1=R14;                   /* SAVE RETURN ADDRESS TURN OFF     01472000
*                                      ERROR FLAGS:                  */ 01473000
         ST    R14,$24SAVE1(,WAPTR)                                0506 01474000
*   S24TCBER=OFF;                   /* TECB NOT FOUND                */ 01475000
*   S24SCHFL=OFF;                   /* SEARCH ERROR                  */ 01476000
         LA    @14,2680                                            0508 01477000
         ALR   @14,WAPTR                                           0508 01478000
         NI    S24TCBER(@14),B'11100111'                           0508 01479000
*   IF $PRTTECB=0                   /* IF NO PTR TO TECB GIVEN       */ 01480000
*     THEN                          /*                               */ 01481000
         L     @08,$PRTTECB(,DPRPTR)                               0509 01482000
         LTR   @08,@08                                             0509 01483000
         BNZ   @RF00509                                            0509 01484000
*     DO;                           /*                               */ 01485000
*       S24TCBER=ON;                /* SET NO TECB ERROR FLAG        */ 01486000
         OI    S24TCBER(@14),B'00010000'                           0511 01487000
*       GOTO S24C3020;              /* SET RC = 0C & RETURN          */ 01488000
         B     S24C3020                                            0512 01489000
*     END;                                                         0513 01490000
*   IF S24SNSRQ=ON                  /* IF REQ FOR A SNS FLD SCH      */ 01491000
*     THEN                                                         0514 01492000
@RF00509 TM    S24SNSRQ+2680(WAPTR),B'00100000'                    0514 01493000
         BO    @RT00514                                            0514 01494000
*     GOTO S24C3012;                /* GO SEARCH SENSE ENTRIES       */ 01495000
*   IF TECBEVOC=0                   /* IF NO EVENTS HAVE BEEN        */ 01496000
*     THEN                          /* POSTED,                       */ 01497000
         CLI   TECBEVOC(TECBPTR),0                                 0516 01498000
         BNE   @RF00516                                            0516 01499000
*     DO;                           /*                               */ 01500000
*S24C3003:                                                         0518 01501000
*       S24SCHFL=ON;                /* SET NO EVENTS ERROR FLAG      */ 01502000
S24C3003 OI    S24SCHFL+2680(WAPTR),B'00001000'                    0518 01503000
*       GOTO S24C3025;              /* AND RETURN                    */ 01504000
         B     S24C3025                                            0519 01505000
*     END;                                                         0520 01506000
*   IF TECBFDCT>TECBEVOC            /* IF TOTAL # OF EVENT FIELDS    */ 01507000
*     THEN                                                         0521 01508000
@RF00516 CLC   TECBFDCT(1,TECBPTR),TECBEVOC(TECBPTR)               0521 01509000
         BNH   @RF00521                                            0521 01510000
*     SEARCHCT=TECBEVOC;            /* GREATER THAN THOSE FILLED     */ 01511000
         SLR   SEARCHCT,SEARCHCT                                   0522 01512000
         IC    SEARCHCT,TECBEVOC(,TECBPTR)                         0522 01513000
*   ELSE                                                           0523 01514000
*     SEARCHCT=TECBFDCT;            /* IN, SEARCH ONLY THOSE USED    */ 01515000
         B     @RC00521                                            0523 01516000
@RF00521 SLR   SEARCHCT,SEARCHCT                                   0523 01517000
         IC    SEARCHCT,TECBFDCT(,TECBPTR)                         0523 01518000
*   RFY                                                            0524 01519000
*     TECBFD01 BASED(ADDR(TECBEVT1)+$CTR*TECBFDLN);/*        @DY04695*/ 01520000
@RC00521 DS    0H                                                  0525 01521000
*   RFY                                                            0525 01522000
*     TECBSNS1 BASED(ADDR(TECBEVT1)+TECBFDLN*TECBFDCT+$CTR*TECBSNLN);   01523000
*                                   /*                       @DM15067*/ 01524000
*   DO $CTR=0 TO SEARCHCT-1;        /* SEARCH THRU THE TECB          */ 01525000
         SLR   @14,@14                                             0526 01526000
         B     @DE00526                                            0526 01527000
@DL00526 DS    0H                                                  0527 01528000
*     IF TCBEVDEV^=$24UNADR(2:4)    /* IF THE DEVADDR IN TECB        */ 01529000
*       THEN                                                       0527 01530000
         LA    @14,TECBEVT1(,TECBPTR)                              0527 01531000
         SLR   @11,@11                                             0527 01532000
         IC    @11,TECBFDLN(,TECBPTR)                              0527 01533000
         MH    @11,$CTR(,WAPTR)                                    0527 01534000
         ALR   @14,@11                                             0527 01535000
         CLC   TCBEVDEV(3,@14),$24UNADR+1(WAPTR)                   0527 01536000
         BNE   @RT00527                                            0527 01537000
*       GOTO S24C3010;              /* NOT SAME AS DPR PARMLST DEV,     01538000
*                                      GO GET NEXT ENTRY             */ 01539000
*     IF S24CCREQ=ON THEN           /* IF LOOKING FOR CC &           */ 01540000
         TM    S24CCREQ+2680(WAPTR),B'10000000'                    0529 01541000
         BNO   @RF00529                                            0529 01542000
*       DO;                         /* THIS IS AN EBCDIC #           */ 01543000
*         IF TCBEVTYP(1:4)='1111'B  /* (CONDITION CODE)              */ 01544000
*           THEN                                                   0531 01545000
         TM    TCBEVTYP(@14),B'11110000'                           0531 01546000
         BNO   @RF00531                                            0531 01547000
*           DO;                                                    0532 01548000
*             CCCONDCD=TCBEVTYP;    /* PUT CC IN PRT LINE            */ 01549000
         MVC   CCCONDCD+1976(1,WAPTR),TCBEVTYP(@14)                0533 01550000
*             GOTO S24C3025;        /* RETURN                        */ 01551000
         B     S24C3025                                            0534 01552000
*           END;                                                   0535 01553000
*         ELSE                                                     0536 01554000
*           GOTO S24C3010;          /* ELSE GET NEXT ENTRY           */ 01555000
*       END;                                                       0537 01556000
*     IF $PSWCSW=ON                 /* IF LOOKING FOR PSW            */ 01557000
*       THEN                        /* AND                           */ 01558000
@RF00529 TM    $PSWCSW(PRTPTR),B'00000001'                         0538 01559000
         BNO   @RF00538                                            0538 01560000
*       DO;                         /* IF THIS IS A PSW NTRY         */ 01561000
*         IF TCBEVTYP(1:4)^='1111'B THEN                           0540 01562000
         LA    @14,TECBEVT1(,TECBPTR)                              0540 01563000
         SLR   @11,@11                                             0540 01564000
         IC    @11,TECBFDLN(,TECBPTR)                              0540 01565000
         MH    @11,$CTR(,WAPTR)                                    0540 01566000
         ALR   @14,@11                                             0540 01567000
         TM    TCBEVTYP(@14),B'11110000'                           0540 01568000
         BNO   @RT00540                                            0540 01569000
*           GOTO S24C3005;          /* THEN CHK FOR PSW1/2           */ 01570000
*         ELSE                                                     0542 01571000
*           GOTO S24C3010;          /* ELSE CHK NEXT ENTRY           */ 01572000
         B     S24C3010                                            0542 01573000
*       END;                                                       0543 01574000
*     IF TCBEVTYP='0'               /* IF CC = 0 FOR THIS ENTRY      */ 01575000
*       THEN                                                       0544 01576000
@RF00538 LA    @14,TECBEVT1(,TECBPTR)                              0544 01577000
         SLR   @11,@11                                             0544 01578000
         IC    @11,TECBFDLN(,TECBPTR)                              0544 01579000
         MH    @11,$CTR(,WAPTR)                                    0544 01580000
         ALR   @14,@11                                             0544 01581000
         CLI   TCBEVTYP(@14),C'0'                                  0544 01582000
         BE    @RT00544                                            0544 01583000
*       GOTO S24C3010;              /* THEN THERE IS NO CSW          */ 01584000
*     IF TCBEVTYP(1:4)^='1111'B     /* IF EVENT TYPE NOT EBCDIC #    */ 01585000
*       THEN                                                       0546 01586000
         TM    TCBEVTYP(@14),B'11110000'                           0546 01587000
         BNO   @RT00546                                            0546 01588000
*       GOTO S24C3010;              /* THEN THIS NOT A CSW ENTRY     */ 01589000
*S24C3005:                                                         0548 01590000
*     IF S24CSW2R=OFF               /* IF NOT REQ FOR 2ND CSW/PSW    */ 01591000
*       THEN                                                       0548 01592000
S24C3005 TM    S24CSW2R+2680(WAPTR),B'01000000'                    0548 01593000
         BNZ   @RF00548                                            0548 01594000
*       DO;                                                        0549 01595000
*         CSWPSWPT=ADDR(TCBEVCSW);  /* PT TO CSW                     */ 01596000
         LA    @14,TECBEVT1(,TECBPTR)                              0550 01597000
         SLR   @08,@08                                             0550 01598000
         IC    @08,TECBFDLN(,TECBPTR)                              0550 01599000
         MH    @08,$CTR(,WAPTR)                                    0550 01600000
         ALR   @14,@08                                             0550 01601000
         LA    @14,TCBEVCSW(,@14)                                  0550 01602000
         ST    @14,CSWPSWPT                                        0550 01603000
*         GOTO S24C3025;            /* AND RETURN                    */ 01604000
         B     S24C3025                                            0551 01605000
*       END;                                                       0552 01606000
*     ELSE                          /* ELSE WE WANT NEXT CSW/PSW     */ 01607000
*       DO;                         /* KEEP LOOKING THRU TECB        */ 01608000
@RF00548 DS    0H                                                  0554 01609000
*         S24CSW2R=OFF;                                            0554 01610000
         NI    S24CSW2R+2680(WAPTR),B'10111111'                    0554 01611000
*         GOTO S24C3010;                                           0555 01612000
         B     S24C3010                                            0555 01613000
*       END;                                                       0556 01614000
*S24C3010:                                                         0557 01615000
*   END;                            /* END OF DO LOOP                */ 01616000
S24C3010 LA    @14,1                                               0557 01617000
         AH    @14,$CTR(,WAPTR)                                    0557 01618000
@DE00526 STH   @14,$CTR(,WAPTR)                                    0557 01619000
         LR    @00,SEARCHCT                                        0557 01620000
         BCTR  @00,0                                               0557 01621000
         CR    @14,@00                                             0557 01622000
         BNH   @DL00526                                            0557 01623000
*   GOTO S24C3003;                  /* SET SEARCH ERROR FLG & RET    */ 01624000
         B     S24C3003                                            0558 01625000
*S24C3012:                                                         0559 01626000
*   IF TECBSNOC=0                   /* IF NO SENSE FIELDS USED       */ 01627000
*     THEN                                                         0559 01628000
S24C3012 CLI   TECBSNOC(TECBPTR),0                                 0559 01629000
         BE    @RT00559                                            0559 01630000
*     GOTO S24C3003;                /* SET SRCH FAIL FLG & RETURN    */ 01631000
*   IF TECBSNCT>TECBSNOC            /* IF TOTAL # OF SNS FIELDS      */ 01632000
*     THEN                                                         0561 01633000
         CLC   TECBSNCT(1,TECBPTR),TECBSNOC(TECBPTR)               0561 01634000
         BNH   @RF00561                                            0561 01635000
*     SEARCHCT=TECBSNOC;            /* GREATER THAN THOSE FILLED     */ 01636000
         SLR   SEARCHCT,SEARCHCT                                   0562 01637000
         IC    SEARCHCT,TECBSNOC(,TECBPTR)                         0562 01638000
*   ELSE                                                           0563 01639000
*     SEARCHCT=TECBSNCT;            /* IN, SEARCH ONLY THOSE USED    */ 01640000
         B     @RC00561                                            0563 01641000
@RF00561 SLR   SEARCHCT,SEARCHCT                                   0563 01642000
         IC    SEARCHCT,TECBSNCT(,TECBPTR)                         0563 01643000
*   DO $CTR=0 TO SEARCHCT-1;                                       0564 01644000
@RC00561 SLR   @14,@14                                             0564 01645000
         B     @DE00564                                            0564 01646000
@DL00564 DS    0H                                                  0565 01647000
*     IF TCBSNDEV=$24UNADR(2:4)     /* IF DEV ADDR IN SNS ENTRY      */ 01648000
*       THEN                        /* SAME AS IN DPR PARM LIST      */ 01649000
         LA    @14,TECBEVT1(,TECBPTR)                              0565 01650000
         SLR   @07,@07                                             0565 01651000
         IC    @07,TECBFDCT(,TECBPTR)                              0565 01652000
         SLR   @11,@11                                             0565 01653000
         IC    @11,TECBFDLN(,TECBPTR)                              0565 01654000
         MR    @06,@11                                             0565 01655000
         ALR   @14,@07                                             0565 01656000
         LH    @11,$CTR(,WAPTR)                                    0565 01657000
         MH    @11,TECBSNLN(,TECBPTR)                              0565 01658000
         ALR   @14,@11                                             0565 01659000
         CLC   TCBSNDEV(3,@14),$24UNADR+1(WAPTR)                   0565 01660000
         BNE   @RF00565                                            0565 01661000
*       DO;                                                        0566 01662000
*         $NSPTR=ADDR(TCBSENSE);    /* SET UP PTR TO SENSE           */ 01663000
         LA    @14,TCBSENSE(,@14)                                  0567 01664000
         ST    @14,$NSPTR(,WAPTR)                                  0567 01665000
*         GOTO S24C3025;            /* RETURN                        */ 01666000
         B     S24C3025                                            0568 01667000
*       END;                        /* RETURN                        */ 01668000
*   END;                                                           0570 01669000
@RF00565 LA    @14,1                                               0570 01670000
         AH    @14,$CTR(,WAPTR)                                    0570 01671000
@DE00564 STH   @14,$CTR(,WAPTR)                                    0570 01672000
         LR    @00,SEARCHCT                                        0570 01673000
         BCTR  @00,0                                               0570 01674000
         CR    @14,@00                                             0570 01675000
         BNH   @DL00564                                            0570 01676000
*S24C3020:                                                         0571 01677000
*   $24RETCD='0C'X;                 /* SET RC = 0C                   */ 01678000
S24C3020 MVI   $24RETCD(WAPTR),X'0C'                               0571 01679000
*S24C3025:                                                         0572 01680000
*   R14=$24SAVE1;                   /* RESTORE RETURN ADDRESS        */ 01681000
S24C3025 L     R14,$24SAVE1(,WAPTR)                                0572 01682000
*   END S24C3000;                                                  0573 01683000
*                                                                  0573 01684000
@EL00004 DS    0H                                                  0573 01685000
@EF00004 DS    0H                                                  0573 01686000
@ER00004 BR    @14                                                 0573 01687000
*/********************************************************************/ 01688000
*/*      ROUTINE TO CONVERT AND MOVE CSW/PSW INTO PRINT BUFFER       */ 01689000
*/********************************************************************/ 01690000
*                                                                  0574 01691000
*S24C5000:                                                         0574 01692000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0574 01693000
S24C5000 DS    0H                                                  0575 01694000
*   $24SAVE1=R14;                   /* SAVE RETURN ADDRESS CONVERT 0575 01695000
*                                      CSW/PSW TO EBCDIC             */ 01696000
*                                                                  0575 01697000
         ST    R14,$24SAVE1(,WAPTR)                                0575 01698000
*   /*****************************************************************/ 01699000
*   /*                                                               */ 01700000
*   /* ITACONV FROM(FROMFLD)TO(DPRWORK)COUNT(8)TYPE(HE) INVOKED      */ 01701000
*   /*                                                               */ 01702000
*   /*****************************************************************/ 01703000
*                                                                  0576 01704000
*   ITATCFR=ADDR(FROMFLD);          /* SET THE FROM ADDRESS          */ 01705000
         L     @14,CSWPSWPT                                        0576 01706000
         ST    @14,ITATCFR                                         0576 01707000
*   ITATCTO=ADDR(DPRWORK);          /* SET THE TO ADDRESS            */ 01708000
         LA    @14,DPRWORK(,WAPTR)                                 0577 01709000
         ST    @14,ITATCTO                                         0577 01710000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 01711000
         OI    ITATCTP,B'10000000'                                 0578 01712000
*   ITATCNT=8;                      /* GIVE THE CONVERT BYTE COUNT   */ 01713000
         MVI   ITATCNT,X'08'                                       0579 01714000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 01715000
         LA    R1,ITATCPRM                                         0580 01716000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 01717000
         L     @15,@CV00877                                        0581 01718000
         BALR  @14,@15                                             0581 01719000
*   IF $PSWCSW=ON                   /* IF THIS IS A PSW,             */ 01720000
*     THEN                          /*                               */ 01721000
         TM    $PSWCSW(PRTPTR),B'00000001'                         0582 01722000
         BNO   @RF00582                                            0582 01723000
*     DO;                           /*                               */ 01724000
*       PSWFLD=DPRWORK(1:16);       /* MOVE WHOLE FIELD INTO BFR     */ 01725000
         MVC   PSWFLD(16,BFRPTR),DPRWORK(WAPTR)                    0584 01726000
*       GOTO S24C5010;              /* RETURN                        */ 01727000
         B     S24C5010                                            0585 01728000
*     END;                                                         0586 01729000
*   WORKPTR=ADDR(DPRWORK);          /* SET UP FROM PTR               */ 01730000
@RF00582 LA    WORKPTR,DPRWORK(,WAPTR)                             0587 01731000
*   IF MASK(1:1)=ON                 /* IF CSW KEY THERE              */ 01732000
*     THEN                          /* PUT IT IN PRINT BUFR          */ 01733000
         TM    MASK,B'10000000'                                    0588 01734000
         BNO   @RF00588                                            0588 01735000
*     DO;                                                          0589 01736000
*       CSWKEY=WORKCSW(1:LENGTH(CSWKEY));                          0590 01737000
         MVC   CSWKEY(2,BFRPTR),WORKCSW(WORKPTR)                   0590 01738000
*       WORKPTR=WORKPTR+LENGTH(CSWKEY);                            0591 01739000
         AL    WORKPTR,@CF00086                                    0591 01740000
*     END;                                                         0592 01741000
*   ELSE                                                           0593 01742000
*     CSWKEY=                       /* IF NOT, SET TO X'S            */ 01743000
*         CSWXXXXX(1:LENGTH(CSWKEY));                              0593 01744000
         B     @RC00588                                            0593 01745000
@RF00588 MVC   CSWKEY(2,BFRPTR),CSWXXXXX                           0593 01746000
*   CSWBLANK=' ';                   /* BLANK OUT N OF 'NONE'         */ 01747000
@RC00588 MVI   CSWBLANK(BFRPTR),C' '                               0594 01748000
*   IF MASK(2:2)=ON                 /* IF CSW ADDR TO BE USED,       */ 01749000
*     THEN                          /* PUT IT IN PRINT BUFR          */ 01750000
         TM    MASK,B'01000000'                                    0595 01751000
         BNO   @RF00595                                            0595 01752000
*     DO;                                                          0596 01753000
*       CSWADDR=WORKCSW(1:LENGTH(CSWADDR));                        0597 01754000
         MVC   CSWADDR(6,BFRPTR),WORKCSW(WORKPTR)                  0597 01755000
*       WORKPTR=WORKPTR+LENGTH(CSWADDR);                           0598 01756000
         AL    WORKPTR,@CF00399                                    0598 01757000
*     END;                                                         0599 01758000
*   ELSE                                                           0600 01759000
*     CSWADDR=                      /* IF NOT, SET IT TO X'S         */ 01760000
*         CSWXXXXX(1:LENGTH(CSWADDR));                             0600 01761000
         B     @RC00595                                            0600 01762000
@RF00595 MVC   CSWADDR(6,BFRPTR),CSWXXXXX                          0600 01763000
*   IF MASK(3:3)=ON                 /* IF STATUS TO BE PRINTED,      */ 01764000
*     THEN                          /* PUT IT IN PRT BUFR            */ 01765000
@RC00595 TM    MASK,B'00100000'                                    0601 01766000
         BNO   @RF00601                                            0601 01767000
*     DO;                                                          0602 01768000
*       CSWSTAT=WORKCSW(1:LENGTH(CSWSTAT));                        0603 01769000
         MVC   CSWSTAT(4,BFRPTR),WORKCSW(WORKPTR)                  0603 01770000
*       WORKPTR=WORKPTR+LENGTH(CSWSTAT);                           0604 01771000
         AL    WORKPTR,@CF00041                                    0604 01772000
*     END;                                                         0605 01773000
*   ELSE                                                           0606 01774000
*     CSWSTAT=                      /* IF NOT USE X'S                */ 01775000
*         CSWXXXXX(1:LENGTH(CSWSTAT));                             0606 01776000
         B     @RC00601                                            0606 01777000
@RF00601 MVC   CSWSTAT(4,BFRPTR),CSWXXXXX                          0606 01778000
*   IF MASK(4:4)=ON                 /* IF RESIDUAL CNT TO BE PRTD    */ 01779000
*     THEN                          /* PUT IT IN BUFR                */ 01780000
@RC00601 TM    MASK,B'00010000'                                    0607 01781000
         BNO   @RF00607                                            0607 01782000
*     DO;                                                          0608 01783000
*       CSWCOUNT=WORKCSW(1:LENGTH(CSWCOUNT));                      0609 01784000
         MVC   CSWCOUNT(4,BFRPTR),WORKCSW(WORKPTR)                 0609 01785000
*       WORKPTR=WORKPTR+LENGTH(CSWCOUNT);                          0610 01786000
         AL    WORKPTR,@CF00041                                    0610 01787000
*     END;                                                         0611 01788000
*   ELSE                                                           0612 01789000
*     CSWCOUNT=                     /* IF NOT, PUT IN X'S            */ 01790000
*         CSWXXXXX(1:LENGTH(CSWCOUNT));                            0612 01791000
         B     @RC00607                                            0612 01792000
@RF00607 MVC   CSWCOUNT(4,BFRPTR),CSWXXXXX                         0612 01793000
*S24C5010:                                                         0613 01794000
*   R14=$24SAVE1;                   /* RESTORE RETURN ADDRESS        */ 01795000
@RC00607 DS    0H                                                  0613 01796000
S24C5010 L     R14,$24SAVE1(,WAPTR)                                0613 01797000
*   END S24C5000;                                                  0614 01798000
*                                                                  0614 01799000
@EL00005 DS    0H                                                  0614 01800000
@EF00005 DS    0H                                                  0614 01801000
@ER00005 BR    @14                                                 0614 01802000
*/********************************************************************/ 01803000
*/*      ROUTINE TO STURCTURE & PRINT SENSE LINES                    */ 01804000
*/*      INPUT:                                                      */ 01805000
*/*            $NSPTR - POINTER TO HEX SENSE DATA                    */ 01806000
*/*            COUNT - TOTAL COUNT OF SENSE DATA PROVIDED            */ 01807000
*/********************************************************************/ 01808000
*                                                                  0615 01809000
*S24C6000:                                                         0615 01810000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0615 01811000
S24C6000 DS    0H                                                  0616 01812000
*   $24SAVE1=R14;                   /* SAVE RETURN ADDRESS           */ 01813000
         ST    R14,$24SAVE1(,WAPTR)                                0616 01814000
*   $INDEX=1;                       /* FROM ARRAY INDEX              */ 01815000
         MVI   $INDEX(WAPTR),X'01'                                 0617 01816000
*S24C6010:                                                         0618 01817000
*   IF $NSXX<=MAXSNS                /* IF LESS THAN OR = 17 BYTES    */ 01818000
*     THEN                                                         0618 01819000
S24C6010 LH    @14,$NSXX(,WAPTR)                                   0618 01820000
         C     @14,@CF00452                                        0618 01821000
         BH    @RF00618                                            0618 01822000
*     $NSCNT=$NSXX;                 /* ALL WILL FIT ON 1 LINE        */ 01823000
         STH   @14,$NSCNT(,WAPTR)                                  0619 01824000
*   ELSE                                                           0620 01825000
*     $NSCNT=MAXSNS;                /* ELSE PRINT 1 LINE OF MAX CONV    01826000
*                                      SENSE TO WORK AREA            */ 01827000
*                                                                  0620 01828000
         B     @RC00618                                            0620 01829000
@RF00618 MVC   $NSCNT(2,WAPTR),@CH00452                            0620 01830000
*   /*****************************************************************/ 01831000
*   /*                                                               */ 01832000
*   /* ITACONV FROM(FROMSNS($INDEX))TO(TOSENSE)COUNT($NSCNT)TYPE(HE) */ 01833000
*   /* INVOKED                                                       */ 01834000
*   /*                                                               */ 01835000
*   /*****************************************************************/ 01836000
*                                                                  0621 01837000
*   ITATCFR=ADDR(FROMSNS($INDEX));  /* SET THE FROM ADDRESS          */ 01838000
@RC00618 SLR   @14,@14                                             0621 01839000
         IC    @14,$INDEX(,WAPTR)                                  0621 01840000
         MH    @14,@CH00452                                        0621 01841000
         L     @11,$NSPTR(,WAPTR)                                  0621 01842000
         AL    @11,@CF01096                                        0621 01843000
         LA    @14,FROMSNS(@14,@11)                                0621 01844000
         ST    @14,ITATCFR                                         0621 01845000
*   ITATCTO=ADDR(TOSENSE);          /* SET THE TO ADDRESS            */ 01846000
         LA    @14,2376                                            0622 01847000
         ALR   @14,WAPTR                                           0622 01848000
         ST    @14,ITATCTO                                         0622 01849000
*   ITATCTP='1'B;                   /* SET THE TYPE OF CONVERT BIT   */ 01850000
         OI    ITATCTP,B'10000000'                                 0623 01851000
*   ITATCNT=$NSCNT;                 /* GIVE THE CONVERT BYTE COUNT   */ 01852000
         LH    @14,$NSCNT(,WAPTR)                                  0624 01853000
         STC   @14,ITATCNT                                         0624 01854000
*   R1=ADDR(ITATCPRM);              /* POINT TO CONVERT PARM LIST    */ 01855000
         LA    R1,ITATCPRM                                         0625 01856000
*   CALL ISTSC021;                  /* CALL CONVERT DIRECTLY         */ 01857000
         L     @15,@CV00877                                        0626 01858000
         BALR  @14,@15                                             0626 01859000
*   DO $CTR=1 TO $NSCNT;            /* MOVE CONVERTED SENSE          */ 01860000
         LA    @14,1                                               0627 01861000
         B     @DE00627                                            0627 01862000
@DL00627 DS    0H                                                  0628 01863000
*     SNSDATA($CTR)=TOSENSE($CTR);  /* BYTES INTO BUFFER             */ 01864000
         LH    @14,$CTR(,WAPTR)                                    0628 01865000
         LR    @11,@14                                             0628 01866000
         MH    @11,@CH00180                                        0628 01867000
         ALR   @11,WAPTR                                           0628 01868000
         ALR   @14,@14                                             0628 01869000
         ALR   @14,WAPTR                                           0628 01870000
         MVC   SNSDATA+1983(2,@11),TOSENSE+2374(@14)               0628 01871000
*   END;                                                           0629 01872000
         LA    @14,1                                               0629 01873000
         AH    @14,$CTR(,WAPTR)                                    0629 01874000
@DE00627 STH   @14,$CTR(,WAPTR)                                    0629 01875000
         CH    @14,$NSCNT(,WAPTR)                                  0629 01876000
         BNH   @DL00627                                            0629 01877000
*   CALL S24C2000;                  /* CHK PP LVLS 2&3 OUTPUT LIN    */ 01878000
         BAL   @14,S24C2000                                        0630 01879000
*   $NSXX=$NSXX-MAXSNS;             /* SUBTRACT BYTES JUST PRNTD     */ 01880000
         LH    @14,$NSXX(,WAPTR)                                   0631 01881000
         SL    @14,@CF00452                                        0631 01882000
         STH   @14,$NSXX(,WAPTR)                                   0631 01883000
*   $INDEX=$INDEX+1;                /* INCREMENT INDEX               */ 01884000
         LA    @11,1                                               0632 01885000
         SLR   @00,@00                                             0632 01886000
         IC    @00,$INDEX(,WAPTR)                                  0632 01887000
         ALR   @00,@11                                             0632 01888000
         STC   @00,$INDEX(,WAPTR)                                  0632 01889000
*   IF $NSXX<1                      /* IF THAT WAS IT, RETURN        */ 01890000
*     THEN                                                         0633 01891000
         CR    @14,@11                                             0633 01892000
         BL    @RT00633                                            0633 01893000
*     GOTO S24C6020;                                               0634 01894000
*   ELSE                                                           0635 01895000
*     GOTO S24C6010;                /* OR GO TO TOP AND GET NEXT   0635 01896000
*                                      SERIES OF SNS BYTES           */ 01897000
         B     S24C6010                                            0635 01898000
*S24C6020:                                                         0636 01899000
*   R14=$24SAVE1;                   /* RESTORE RET ADDR              */ 01900000
S24C6020 L     R14,$24SAVE1(,WAPTR)                                0636 01901000
*   END S24C6000;                                                  0637 01902000
*                                                                  0637 01903000
@EL00006 DS    0H                                                  0637 01904000
@EF00006 DS    0H                                                  0637 01905000
@ER00006 BR    @14                                                 0637 01906000
*/********************************************************************/ 01907000
*/* ROUTINE TO SET UP AND PRINT EXPECTED, RECEIVED, & WRITTEN DATA   */ 01908000
*/*                                                                  */ 01909000
*/*      INPUT:                                                      */ 01910000
*/*            $ATAPTR - POINTER TO DATA                             */ 01911000
*/*            $ATACNT - COUNT OF TOTAL DATA BYTES                   */ 01912000
*/********************************************************************/ 01913000
*                                                                  0638 01914000
*S24C7000:                                                         0638 01915000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0638 01916000
S24C7000 DS    0H                                                  0639 01917000
*   $24SAVE1=R14;                   /* SAVE RETURN ADDRESS           */ 01918000
         ST    R14,$24SAVE1(,WAPTR)                                0639 01919000
*   $DDRPTR=$ATAPTR;                /* PT TO DATA                    */ 01920000
         L     @14,$ATAPTR(,WAPTR)                                 0640 01921000
         ST    @14,$DDRPTR(,WAPTR)                                 0640 01922000
*   IF $ATAPTR=0|$ATACNT<=0         /* IF NO ADDR GIVEN FOR DATA     */ 01923000
*     THEN                          /* OR COUNT NOT POSITIVE         */ 01924000
         SLR   @11,@11                                             0641 01925000
         CR    @14,@11                                             0641 01926000
         BE    @RT00641                                            0641 01927000
         CH    @11,$ATACNT(,WAPTR)                                 0641 01928000
         BL    @RF00641                                            0641 01929000
@RT00641 DS    0H                                                  0642 01930000
*     DO;                           /*                               */ 01931000
*       $24RETCD='0C'X;             /* SET RC=0C                     */ 01932000
         MVI   $24RETCD(WAPTR),X'0C'                               0643 01933000
*       GOTO S24C7020;              /* RETURN                        */ 01934000
         B     S24C7020                                            0644 01935000
*     END;                                                         0645 01936000
*S24C7010:                                                         0646 01937000
*   IF $DONTCVT=OFF                 /* IF DON'T CONVERT DATA FLAG    */ 01938000
*     THEN                          /* IS OFF                        */ 01939000
@RF00641 DS    0H                                                  0646 01940000
S24C7010 TM    $DONTCVT(PRTPTR),B'00001000'                        0646 01941000
         BNZ   @RF00646                                            0646 01942000
*     DO;                           /* THEN DATA WILL BE CONVERTD    */ 01943000
*       IF $ATACNT<=25              /* IF COUNT < = MAX FOR LINE     */ 01944000
*         THEN                                                     0648 01945000
         LH    @14,$ATACNT(,WAPTR)                                 0648 01946000
         C     @14,@CF00851                                        0648 01947000
         BH    @RF00648                                            0648 01948000
*         $IMITX=                   /* DO WHOLE THING                */ 01949000
*             $ATACNT;              /*                               */ 01950000
         STC   @14,$IMITX(,WAPTR)                                  0649 01951000
*       ELSE                                                       0650 01952000
*         $IMITX=25;                /* ELSE CONVERT JUST 1 LINE    0650 01953000
*                                      CONVERT DATA TO WORK AREA     */ 01954000
*                                                                  0650 01955000
         B     @RC00648                                            0650 01956000
@RF00648 MVI   $IMITX(WAPTR),X'19'                                 0650 01957000
*       /*************************************************************/ 01958000
*       /*                                                           */ 01959000
*       /* ITACONV FROM(CNVDATA)TO(DPRWORK)COUNT($IMITX)TYPE(HE)     */ 01960000
*       /* INVOKED                                                   */ 01961000
*       /*                                                           */ 01962000
*       /*************************************************************/ 01963000
*                                                                  0651 01964000
*       ITATCFR=ADDR(CNVDATA);      /* SET THE FROM ADDRESS          */ 01965000
@RC00648 L     @14,$DDRPTR(,WAPTR)                                 0651 01966000
         ST    @14,ITATCFR                                         0651 01967000
*       ITATCTO=ADDR(DPRWORK);      /* SET THE TO ADDRESS            */ 01968000
         LA    @14,DPRWORK(,WAPTR)                                 0652 01969000
         ST    @14,ITATCTO                                         0652 01970000
*       ITATCTP='1'B;               /* SET THE TYPE OF CONVERT BIT   */ 01971000
         OI    ITATCTP,B'10000000'                                 0653 01972000
*       ITATCNT=$IMITX;             /* GIVE THE CONVERT BYTE COUNT   */ 01973000
         IC    @14,$IMITX(,WAPTR)                                  0654 01974000
         STC   @14,ITATCNT                                         0654 01975000
*       R1=ADDR(ITATCPRM);          /* POINT TO CONVERT PARM LIST    */ 01976000
         LA    R1,ITATCPRM                                         0655 01977000
*       CALL ISTSC021;              /* CALL CONVERT DIRECTLY         */ 01978000
         L     @15,@CV00877                                        0656 01979000
         BALR  @14,@15                                             0656 01980000
*       $ATACNT=$ATACNT-            /* SUBTRACT LINE PRINTED         */ 01981000
*           $IMITX;                                                0657 01982000
         SLR   @14,@14                                             0657 01983000
         IC    @14,$IMITX(,WAPTR)                                  0657 01984000
         LH    @00,$ATACNT(,WAPTR)                                 0657 01985000
         SLR   @00,@14                                             0657 01986000
         STH   @00,$ATACNT(,WAPTR)                                 0657 01987000
*       $IMITX=2*$IMITX;            /* CONVERTED DATA COUNT          */ 01988000
         ALR   @14,@14                                             0658 01989000
         STC   @14,$IMITX(,WAPTR)                                  0658 01990000
*       $ATAPTR=ADDR(DPRWORK);      /* DATA TO PRINT                 */ 01991000
         LA    @14,DPRWORK(,WAPTR)                                 0659 01992000
         ST    @14,$ATAPTR(,WAPTR)                                 0659 01993000
*     END;                                                         0660 01994000
*   ELSE                                                           0661 01995000
*     DO;                                                          0661 01996000
         B     @RC00646                                            0661 01997000
@RF00646 DS    0H                                                  0662 01998000
*       IF $ATACNT<=50              /* IF DATA COUNT IS              */ 01999000
*         THEN                                                     0662 02000000
         LH    @14,$ATACNT(,WAPTR)                                 0662 02001000
         C     @14,@CF00719                                        0662 02002000
         BH    @RF00662                                            0662 02003000
*         $IMITX=                   /* < = LINE LIMIT                */ 02004000
*             $ATACNT;              /* PRINT ALL OF IT               */ 02005000
         STC   @14,$IMITX(,WAPTR)                                  0663 02006000
*       ELSE                                                       0664 02007000
*         $IMITX=50;                /* ELSE PRINT 1 LINE OF IT       */ 02008000
         B     @RC00662                                            0664 02009000
@RF00662 MVI   $IMITX(WAPTR),X'32'                                 0664 02010000
*       $ATACNT=$ATACNT-            /* SUBTRACT LINE PRINTED         */ 02011000
*           $IMITX;                                                0665 02012000
@RC00662 LH    @14,$ATACNT(,WAPTR)                                 0665 02013000
         SLR   @00,@00                                             0665 02014000
         IC    @00,$IMITX(,WAPTR)                                  0665 02015000
         SLR   @14,@00                                             0665 02016000
         STH   @14,$ATACNT(,WAPTR)                                 0665 02017000
*     END;                                                         0666 02018000
*   DATAFLD(1:$IMITX)=              /* MOVE DATA INTO PRINT LINE     */ 02019000
*       DATARRAY(1:$IMITX);                                        0667 02020000
@RC00646 SLR   @14,@14                                             0667 02021000
         IC    @14,$IMITX(,WAPTR)                                  0667 02022000
         BCTR  @14,0                                               0667 02023000
         L     @11,$ATAPTR(,WAPTR)                                 0667 02024000
         EX    @14,@SM01097                                        0667 02025000
*   CALL S24C2000;                  /* CHK PP 2&3 OUTPUT LINE        */ 02026000
         BAL   @14,S24C2000                                        0668 02027000
*   IF $DONTCVT=OFF                 /* IF DATA TO BE CONVERTED       */ 02028000
*     THEN                          /* THEN                          */ 02029000
         TM    $DONTCVT(PRTPTR),B'00001000'                        0669 02030000
         BNZ   @RF00669                                            0669 02031000
*     $DDRPTR=$DDRPTR+($IMITX/2);   /* POINT TO NEXT DATA TO CONVERT */ 02032000
         SLR   @14,@14                                             0670 02033000
         IC    @14,$IMITX(,WAPTR)                                  0670 02034000
         SRL   @14,1                                               0670 02035000
         AL    @14,$DDRPTR(,WAPTR)                                 0670 02036000
         ST    @14,$DDRPTR(,WAPTR)                                 0670 02037000
*   ELSE                            /* ESLE                          */ 02038000
*     $ATAPTR=$ATAPTR+$IMITX;       /* POINT TO NEXT PART            */ 02039000
         B     @RC00669                                            0671 02040000
@RF00669 SLR   @14,@14                                             0671 02041000
         IC    @14,$IMITX(,WAPTR)                                  0671 02042000
         AL    @14,$ATAPTR(,WAPTR)                                 0671 02043000
         ST    @14,$ATAPTR(,WAPTR)                                 0671 02044000
*   IF $ATACNT>0                    /* IF MORE TO PRINT              */ 02045000
*     THEN                                                         0672 02046000
@RC00669 LH    @14,$ATACNT(,WAPTR)                                 0672 02047000
         LTR   @14,@14                                             0672 02048000
         BP    @RT00672                                            0672 02049000
*     GOTO S24C7010;                /* KEEP PROCESSING               */ 02050000
*S24C7020:                                                         0674 02051000
*   R14=$24SAVE1;                   /* RESTORE RET ADDR              */ 02052000
S24C7020 L     R14,$24SAVE1(,WAPTR)                                0674 02053000
*   END S24C7000;                                                  0675 02054000
@EL00007 DS    0H                                                  0675 02055000
@EF00007 DS    0H                                                  0675 02056000
@ER00007 BR    @14                                                 0675 02057000
*S24C9990:                                                         0676 02058000
*   R15=0;                          /* SET RC = 0                    */ 02059000
S24C9990 SLR   R15,R15                                             0676 02060000
*   $R13PTR=$24SAV13;               /* PT RCM TO MY CALLER           */ 02061000
         L     @14,$24SAV13(,WAPTR)                                0677 02062000
         ST    @14,$R13PTR(,WAPTR)                                 0677 02063000
*   $NOTRRCH=OFF;                   /* DO RC HDLG & TRACE NOW        */ 02064000
         NI    $NOTRRCH(WAPTR),B'11111101'                         0678 02065000
*S24C9999:                                                         0679 02066000
*   R13=SVESC024(2);                /* PTR TO CALLER'S SVAREA        */ 02067000
S24C9999 L     R13,SVESC024+4(,WAPTR)                              0679 02068000
*   DO;                             /* ATDSPLY                       */ 02069000
*   END;                            /* ATDSPLY                       */ 02070000
*   END ISTSC024;                                                  0682 02071000
@EL00001 DS    0H                                                  0682 02072000
@EF00001 DS    0H                                                  0682 02073000
@ER00001 L     @14,12(,@13)                                        0682 02074000
         LM    @00,@12,20(@13)                                     0682 02075000
         BR    @14                                                 0682 02076000
@DATA    DS    0H                                                       02077000
@CH00180 DC    H'3'                                                     02078000
@CH00326 DC    H'68'                                                    02079000
@SM01093 MVC   $BUFFER(0,WAPTR),S24LINE(@11)                            02080000
@SM01097 MVC   DATAFLD+1976(0,WAPTR),DATARRAY(@11)                      02081000
         DS    0F                                                       02082000
@TF00001 DS    F                                                        02083000
         DS    0F                                                       02084000
@CF00864 DC    F'0'                                                     02085000
@CF00043 DC    F'1'                                                     02086000
@CF00086 DC    F'2'                                                     02087000
@CF00041 DC    F'4'                                                     02088000
@CF00399 DC    F'6'                                                     02089000
@CF00039 DC    F'8'                                                     02090000
@CF00452 DC    F'17'                                                    02091000
@CH00452 EQU   @CF00452+2                                               02092000
@CF00851 DC    F'25'                                                    02093000
@CF00719 DC    F'50'                                                    02094000
@CF00435 DC    F'120'                                                   02095000
@CF01096 DC    F'-17'                                                   02096000
@CF01084 DC    F'-8'                                                    02097000
@CF01092 DC    F'-4'                                                    02098000
@CF01082 DC    XL4'0000FFFF'                                            02099000
@CV00877 DC    V(ISTSC021)                                              02100000
@CV00995 DC    V(ISTIC002)                                              02101000
@CV01021 DC    V(ISTCC011)                                              02102000
         DS    0D                                                       02103000
CSWPSWPT DS    A                                                        02104000
         DS    0D                                                       02105000
@TS00001 DS    CL8                                                      02106000
@CC00920 DC    C'XPTD CSW1'                                             02107000
@CC00934 DC    C'RCVD CSW1'                                             02108000
@CC00959 DC    C'XPTD DATA'                                             02109000
@CC00964 DC    C'RCVD DATA'                                             02110000
@CC00968 DC    C'WRTN DATA'                                             02111000
@CC00890 DC    C'        '                                              02112000
@CC00950 DC    C'XPTD SNS'                                              02113000
@CC00956 DC    C'RCVD SNS'                                              02114000
@CC00994 DC    C'SYS CON '                                              02115000
@CC00917 DC    C'XPTD CC'                                               02116000
@CC00919 DC    C'RCVD CC'                                               02117000
@CC00889 DC    C'DEV/LN'                                                02118000
@CC00893 DC    C'REFNUM'                                                02119000
@CC00912 DC    C'QUEUED'                                                02120000
@CC00880 DC    C'NONE'                                                  02121000
@CC00931 DC    C'CSW2'                                                  02122000
@CC00888 DC    C'RTN'                                                   02123000
@CC00892 DC    C'ECA'                                                   02124000
@CC00904 DC    C'CAW'                                                   02125000
@CC00905 DC    C'CCW'                                                   02126000
MASK     DS    BL1                                                      02127000
CSWXXXXX DC    CL6'XXXXXX'                                              02128000
ITATCPRM DS    CL14                                                     02129000
         ORG   ITATCPRM                                                 02130000
@NM00100 DC    X'0102F4F1'                                              02131000
ITATCFR  DS    AL4                                                      02132000
ITATCTO  DS    AL4                                                      02133000
@NM00101 DC    AL1(0)                                                   02134000
         ORG   @NM00101                                                 02135000
ITATCTP  DS    BL1                                                      02136000
         ORG   ITATCPRM+13                                              02137000
ITATCNT  DS    FL1                                                      02138000
         ORG   ITATCPRM+14                                              02139000
         DS    CL2                                                      02140000
$TCA15   DS    CL13                                                     02141000
         ORG   $TCA15                                                   02142000
$TCB15   DC    A(129)                                                   02143000
$TCC15   DC    A(0)                                                     02144000
$TCD15   DC    B'10000000'                                              02145000
$TCE15   DC    X'FFFFFFFF'                                              02146000
         ORG   $TCA15+13                                                02147000
         DS    CL3                                                      02148000
$TCA16   DS    CL13                                                     02149000
         ORG   $TCA16                                                   02150000
$TCB16   DC    A(157)                                                   02151000
$TCC16   DC    A(0)                                                     02152000
$TCD16   DC    B'10000000'                                              02153000
$TCE16   DC    X'FFFFFFFF'                                              02154000
         ORG   $TCA16+13                                                02155000
         DS    CL3                                                      02156000
$TCA17   DS    CL13                                                     02157000
         ORG   $TCA17                                                   02158000
$TCB17   DC    A(240)                                                   02159000
$TCC17   DC    A(0)                                                     02160000
$TCD17   DC    B'00000000'                                              02161000
$TCE17   DC    X'FFFFFFFF'                                              02162000
         ORG   $TCA17+13                                                02163000
         DS    CL3                                                      02164000
S24REP   DS    10F                                                      02165000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02166000
@01      EQU   01                                                       02167000
@02      EQU   02                                                       02168000
@03      EQU   03                                                       02169000
@04      EQU   04                                                       02170000
@05      EQU   05                                                       02171000
@06      EQU   06                                                       02172000
@07      EQU   07                                                       02173000
@08      EQU   08                                                       02174000
@09      EQU   09                                                       02175000
@10      EQU   10                                                       02176000
@11      EQU   11                                                       02177000
@12      EQU   12                                                       02178000
@13      EQU   13                                                       02179000
@14      EQU   14                                                       02180000
@15      EQU   15                                                       02181000
SEARCHCT EQU   @08                                                      02182000
J        EQU   @08                                                      02183000
BFRPTR   EQU   @09                                                      02184000
WORKPTR  EQU   @08                                                      02185000
HDRPTR   EQU   @08                                                      02186000
WAPTR    EQU   @02                                                      02187000
DPRPTR   EQU   @03                                                      02188000
PRTPTR   EQU   @04                                                      02189000
R1       EQU   @01                                                      02190000
R13      EQU   @13                                                      02191000
R15      EQU   @15                                                      02192000
R14      EQU   @14                                                      02193000
TECBPTR  EQU   @05                                                      02194000
TOLTEPWA EQU   0                                                        02195000
$SCTTBLE EQU   TOLTEPWA                                                 02196000
$TESTOPT EQU   $SCTTBLE+2                                               02197000
$NOPRT   EQU   $TESTOPT                                                 02198000
$FSTCOMM EQU   $TESTOPT                                                 02199000
$ERROPT  EQU   $SCTTBLE+3                                               02200000
$TESTERR EQU   $ERROPT                                                  02201000
$ASTERIK EQU   $ERROPT                                                  02202000
$CATERR  EQU   $ERROPT                                                  02203000
$ALTPRNT EQU   $ERROPT                                                  02204000
$NERRPRT EQU   $ERROPT                                                  02205000
$LOOPERR EQU   $ERROPT                                                  02206000
$LOOPTST EQU   $ERROPT                                                  02207000
$PDEVFLG EQU   $SCTTBLE+10                                              02208000
$CDSFLGS EQU   $SCTTBLE+11                                              02209000
$SYMNAME EQU   $CDSFLGS                                                 02210000
$PDEVADR EQU   $SCTTBLE+12                                              02211000
$CDS8T19 EQU   $SCTTBLE+20                                              02212000
$SYNAME  EQU   $CDS8T19+4                                               02213000
$EXECFLG EQU   $SCTTBLE+33                                              02214000
$OLTFLGS EQU   $SCTTBLE+36                                              02215000
$OLTFLG2 EQU   $SCTTBLE+37                                              02216000
$TOTFLG1 EQU   $SCTTBLE+38                                              02217000
$ROUTMSK EQU   $SCTTBLE+40                                              02218000
$CDA     EQU   TOLTEPWA+100                                             02219000
$RCA     EQU   $CDA+44                                                  02220000
$OLTPTR  EQU   $CDA+52                                                  02221000
$LOWADDR EQU   $OLTPTR                                                  02222000
$HIMOREC EQU   $CDA+60                                                  02223000
$R13PTR  EQU   $CDA+80                                                  02224000
$PRNTLVL EQU   $CDA+104                                                 02225000
$PRTFORM EQU   $CDA+116                                                 02226000
$COMMFLG EQU   TOLTEPWA+224                                             02227000
$FLAG1   EQU   $COMMFLG                                                 02228000
$FLAG2   EQU   $COMMFLG+1                                               02229000
$NDR     EQU   $FLAG2                                                   02230000
$FLAG3   EQU   $COMMFLG+2                                               02231000
$PRTONLY EQU   $FLAG3                                                   02232000
$FLAG4   EQU   $COMMFLG+3                                               02233000
$FLAG5   EQU   $COMMFLG+4                                               02234000
$FSTFE   EQU   $FLAG5                                                   02235000
$FSTCAT  EQU   $FLAG5                                                   02236000
$EOJ     EQU   $FLAG5                                                   02237000
$CANCEL  EQU   $EOJ                                                     02238000
$FLAG6   EQU   $COMMFLG+5                                               02239000
$ABNDBIT EQU   $FLAG6                                                   02240000
$FLAG7   EQU   $COMMFLG+6                                               02241000
$FLAG8   EQU   $COMMFLG+7                                               02242000
$TCECM   EQU   $FLAG8                                                   02243000
$FLAG9   EQU   $COMMFLG+8                                               02244000
$NOTRRCH EQU   $FLAG9                                                   02245000
$FLAG10  EQU   $COMMFLG+9                                               02246000
$FLAG11  EQU   $COMMFLG+10                                              02247000
$FLAG12  EQU   $COMMFLG+11                                              02248000
$FLAG13  EQU   $COMMFLG+12                                              02249000
$CATMSG  EQU   $FLAG13                                                  02250000
$DEVTBLE EQU   TOLTEPWA+240                                             02251000
$DEVCDS  EQU   $DEVTBLE                                                 02252000
$DEVUNAD EQU   $DEVCDS                                                  02253000
@NM00035 EQU   $DEVUNAD+2                                               02254000
$DEVFEAT EQU   $DEVCDS+4                                                02255000
$DEVCDSF EQU   $DEVCDS+9                                                02256000
$DEVSDCF EQU   $DEVCDS+10                                               02257000
$$SYMNME EQU   $DEVCDS+12                                               02258000
$DEVFLG1 EQU   $DEVTBLE+20                                              02259000
$EVNCPLT EQU   $DEVFLG1                                                 02260000
$ATTNEXP EQU   $DEVFLG1                                                 02261000
$INTOCC  EQU   $DEVFLG1                                                 02262000
$DEVFLG2 EQU   $DEVTBLE+21                                              02263000
$TESTMDE EQU   $DEVFLG2                                                 02264000
$DEVTECB EQU   $DEVTBLE+22                                              02265000
$OPIS    EQU   $DEVTECB                                                 02266000
$OPND    EQU   $DEVTECB+2                                               02267000
$DEVFLG3 EQU   $DEVTBLE+27                                              02268000
$SIOFLG  EQU   $DEVFLG3                                                 02269000
$SYSMN   EQU   $DEVTBLE+28                                              02270000
$IFTOUT  EQU   $DEVTBLE+36                                              02271000
$DEVSESP EQU   $IFTOUT                                                  02272000
$SSCPDAF EQU   $IFTOUT+6                                                02273000
$LDNCBPT EQU   $DEVTBLE+48                                              02274000
$RNINFO  EQU   $DEVTBLE+56                                              02275000
$LINENME EQU   $RNINFO                                                  02276000
$DEVFLG5 EQU   $RNINFO+8                                                02277000
$DEVFLG4 EQU   $DEVTBLE+65                                              02278000
$DEVCNTS EQU   TOLTEPWA+1464                                            02279000
$BUFFER  EQU   TOLTEPWA+1976                                            02280000
$INBUFR  EQU   TOLTEPWA+2104                                            02281000
$WORK    EQU   TOLTEPWA+2376                                            02282000
#EXITA   EQU   TOLTEPWA+2632                                            02283000
$CCOMDAT EQU   TOLTEPWA+2644                                            02284000
$COUTAD  EQU   $CCOMDAT                                                 02285000
$COUTCT  EQU   $CCOMDAT+4                                               02286000
$CINADR  EQU   $CCOMDAT+8                                               02287000
$CFLGS   EQU   $CCOMDAT+16                                              02288000
$24RETCD EQU   TOLTEPWA+2663                                            02289000
$24SAV13 EQU   TOLTEPWA+2664                                            02290000
$24UNADR EQU   TOLTEPWA+2668                                            02291000
$24SAVE1 EQU   TOLTEPWA+2672                                            02292000
$24SAVE2 EQU   TOLTEPWA+2676                                            02293000
$24FLGS  EQU   TOLTEPWA+2680                                            02294000
$24FEMSG EQU   TOLTEPWA+2681                                            02295000
$ESECTID EQU   $24FEMSG                                                 02296000
$24RTN#  EQU   $24FEMSG+8                                               02297000
$24CATMG EQU   $24FEMSG+11                                              02298000
$24DEVAD EQU   $24CATMG                                                 02299000
$24SYMNE EQU   $24CATMG+4                                               02300000
@NM00043 EQU   TOLTEPWA+2776                                            02301000
$DDRPTR  EQU   @NM00043                                                 02302000
$OUNTPTR EQU   @NM00043+4                                               02303000
$NSPTR   EQU   $OUNTPTR                                                 02304000
$ATAPTR  EQU   $NSPTR                                                   02305000
$CTR     EQU   @NM00043+8                                               02306000
$NSCNT   EQU   @NM00043+10                                              02307000
$ATACNT  EQU   $NSCNT                                                   02308000
$NSXX    EQU   @NM00043+12                                              02309000
$UMXX    EQU   @NM00043+14                                              02310000
$ENXX    EQU   @NM00043+15                                              02311000
$IMITX   EQU   $ENXX                                                    02312000
$INDEX   EQU   $IMITX                                                   02313000
SVESC033 EQU   TOLTEPWA+3160                                            02314000
SVECC013 EQU   TOLTEPWA+3232                                            02315000
SVEIC003 EQU   TOLTEPWA+3592                                            02316000
SVESC022 EQU   TOLTEPWA+3736                                            02317000
SVECC011 EQU   TOLTEPWA+4024                                            02318000
#EXIT    EQU   0                                                        02319000
@NM00046 EQU   0                                                        02320000
SECTID   EQU   @NM00046                                                 02321000
LEVEL    EQU   @NM00046+8                                               02322000
RTNDISP  EQU   @NM00046+10                                              02323000
INST     EQU   @NM00046+12                                              02324000
$NEWSPRF EQU   0                                                        02325000
$RTN#    EQU   $NEWSPRF                                                 02326000
#FLAGS   EQU   $NEWSPRF+16                                              02327000
$REFNUM  EQU   $NEWSPRF+17                                              02328000
$ECA     EQU   $NEWSPRF+32                                              02329000
DPRNTMAP EQU   0                                                        02330000
$PRTCTLW EQU   DPRNTMAP+4                                               02331000
$PRTMSGL EQU   DPRNTMAP+8                                               02332000
$PRTTECB EQU   DPRNTMAP+12                                              02333000
$PRTACCC EQU   DPRNTMAP+16                                              02334000
$PTCCWA  EQU   DPRNTMAP+20                                              02335000
$PTXCSW1 EQU   DPRNTMAP+24                                              02336000
$PTRCSW1 EQU   DPRNTMAP+28                                              02337000
$PTXCSW2 EQU   DPRNTMAP+32                                              02338000
$PTRCSW2 EQU   DPRNTMAP+36                                              02339000
$PTXSNSA EQU   DPRNTMAP+40                                              02340000
$PTRSNSA EQU   DPRNTMAP+44                                              02341000
$PTXDATA EQU   DPRNTMAP+48                                              02342000
$PTRDATA EQU   DPRNTMAP+52                                              02343000
$PTWDATA EQU   DPRNTMAP+56                                              02344000
$PTDESCA EQU   DPRNTMAP+60                                              02345000
PRNTMAPA EQU   0                                                        02346000
$PTCNTWD EQU   PRNTMAPA                                                 02347000
$DPHEADR EQU   $PTCNTWD                                                 02348000
$DPCHAIN EQU   $PTCNTWD                                                 02349000
$ERRORDP EQU   $PTCNTWD                                                 02350000
$DPREFNM EQU   $PTCNTWD                                                 02351000
$CCWERR  EQU   $PTCNTWD+1                                               02352000
$CSW1ERR EQU   $PTCNTWD+1                                               02353000
$DONTCVT EQU   $PTCNTWD+1                                               02354000
$SENSERR EQU   $PTCNTWD+1                                               02355000
$MESSAGE EQU   $PTCNTWD+1                                               02356000
$DESCRIP EQU   $PTCNTWD+2                                               02357000
$DPCCW   EQU   $PTCNTWD+2                                               02358000
$XPDCSW1 EQU   $PTCNTWD+2                                               02359000
$RCVCSW1 EQU   $PTCNTWD+2                                               02360000
$XPDCSW2 EQU   $PTCNTWD+2                                               02361000
$RCVCSW2 EQU   $PTCNTWD+2                                               02362000
$XPTDSNS EQU   $PTCNTWD+2                                               02363000
$RCVDSNS EQU   $PTCNTWD+2                                               02364000
$XPTDATA EQU   $PTCNTWD+3                                               02365000
$RCVDATA EQU   $PTCNTWD+3                                               02366000
$WRTDATA EQU   $PTCNTWD+3                                               02367000
$DATAERR EQU   $PTCNTWD+3                                               02368000
$CONCODE EQU   $PTCNTWD+3                                               02369000
$CCERROR EQU   $PTCNTWD+3                                               02370000
$PSWCSW  EQU   $PTCNTWD+3                                               02371000
$PTMSGLC EQU   PRNTMAPA+4                                               02372000
$PTMSGOF EQU   PRNTMAPA+5                                               02373000
$PTECC   EQU   PRNTMAPA+6                                               02374000
$PTRENUM EQU   PRNTMAPA+7                                               02375000
$PTDEVAD EQU   PRNTMAPA+9                                               02376000
$PTNCCWS EQU   PRNTMAPA+11                                              02377000
$PTFCCWS EQU   PRNTMAPA+12                                              02378000
$PTXCSWM EQU   PRNTMAPA+13                                              02379000
$PTXSNSC EQU   PRNTMAPA+14                                              02380000
$PTRSNSC EQU   PRNTMAPA+15                                              02381000
$PTDESCL EQU   PRNTMAPA+16                                              02382000
$PTXDATC EQU   PRNTMAPA+17                                              02383000
$PTRDATC EQU   PRNTMAPA+19                                              02384000
$PTWDATC EQU   PRNTMAPA+21                                              02385000
$PTDESCC EQU   PRNTMAPA+23                                              02386000
TECBMAPS EQU   0                                                        02387000
TECBFDCT EQU   TECBMAPS                                                 02388000
TECBFDLN EQU   TECBMAPS+1                                               02389000
TECBSNLN EQU   TECBMAPS+2                                               02390000
TECBFLGS EQU   TECBMAPS+4                                               02391000
TCBQUEUE EQU   TECBFLGS                                                 02392000
TECBSNCT EQU   TECBMAPS+5                                               02393000
TECBSNOC EQU   TECBMAPS+6                                               02394000
TECBEVOC EQU   TECBMAPS+7                                               02395000
TECBEVT1 EQU   TECBMAPS+8                                               02396000
TECBFD01 EQU   0                                                        02397000
TCBEVTYP EQU   TECBFD01                                                 02398000
TCBEVDEV EQU   TECBFD01+1                                               02399000
@NM00055 EQU   TECBFD01+4                                               02400000
TCBEVCSW EQU   @NM00055                                                 02401000
TECBSNS1 EQU   0                                                        02402000
TCBSNDEV EQU   TECBSNS1                                                 02403000
TCBSENSE EQU   TECBSNS1+3                                               02404000
TECBSEND EQU   0                                                        02405000
TCBRESP  EQU   TECBSEND+4                                               02406000
TCBRTYPE EQU   TECBSEND+7                                               02407000
TCBRKCHG EQU   TECBSEND+8                                               02408000
S24ADDRA EQU   0                                                        02409000
S24LINE  EQU   0                                                        02410000
S24BYTEA EQU   0                                                        02411000
S24FLAG1 EQU   0                                                        02412000
S24CCREQ EQU   S24FLAG1                                                 02413000
S24CSW2R EQU   S24FLAG1                                                 02414000
S24SNSRQ EQU   S24FLAG1                                                 02415000
S24TCBER EQU   S24FLAG1                                                 02416000
S24SCHFL EQU   S24FLAG1                                                 02417000
@NM00062 EQU   0                                                        02418000
HDRERROR EQU   @NM00062                                                 02419000
HDRTSTID EQU   @NM00062+1                                               02420000
HDRHYPHN EQU   @NM00062+9                                               02421000
HDRLEVEL EQU   @NM00062+10                                              02422000
HDRRTN   EQU   @NM00062+14                                              02423000
HDRRTN#  EQU   @NM00062+17                                              02424000
HDROUTN# EQU   HDRRTN#+1                                                02425000
HDRDEVLN EQU   @NM00062+24                                              02426000
HDRUNADR EQU   @NM00062+31                                              02427000
HDRSYMNM EQU   @NM00062+36                                              02428000
HDRECA   EQU   @NM00062+46                                              02429000
HDRECA#  EQU   @NM00062+50                                              02430000
HDREFNUM EQU   @NM00062+55                                              02431000
HDREF#   EQU   @NM00062+61                                              02432000
@NM00069 EQU   0                                                        02433000
DPRCCWER EQU   @NM00069                                                 02434000
DPRCCW   EQU   @NM00069+1                                               02435000
DPRCCW#  EQU   @NM00069+4                                               02436000
DPRCMDCD EQU   @NM00069+7                                               02437000
DPRDATA  EQU   @NM00069+10                                              02438000
DPRSPARE EQU   @NM00069+17                                              02439000
DPRFLAGS EQU   @NM00069+20                                              02440000
DPRCOUNT EQU   @NM00069+23                                              02441000
DPRCAW   EQU   @NM00069+32                                              02442000
DPRCAWAD EQU   @NM00069+36                                              02443000
S24CCWA  EQU   0                                                        02444000
@NM00077 EQU   0                                                        02445000
S24CCWCD EQU   @NM00077                                                 02446000
S24CCWDA EQU   @NM00077+2                                               02447000
S24CCWEX EQU   @NM00077+8                                               02448000
S24CCWFL EQU   @NM00077+10                                              02449000
S24CCWCT EQU   @NM00077+12                                              02450000
@NM00078 EQU   0                                                        02451000
CCERROR  EQU   @NM00078                                                 02452000
CCXPTDCC EQU   @NM00078+1                                               02453000
CCXPTDCD EQU   @NM00078+9                                               02454000
CCRCVDCC EQU   @NM00078+14                                              02455000
CCQUEUED EQU   @NM00078+22                                              02456000
CCCONDCD EQU   CCQUEUED                                                 02457000
S24CC    EQU   0                                                        02458000
@NM00083 EQU   0                                                        02459000
CSWPSWER EQU   @NM00083                                                 02460000
CSWXPTRC EQU   @NM00083+1                                               02461000
CSWPSW1  EQU   CSWXPTRC+5                                               02462000
CSW#     EQU   CSWXPTRC+8                                               02463000
CSW1KEY  EQU   @NM00083+11                                              02464000
CSW1NONE EQU   CSW1KEY                                                  02465000
CSW2CSW2 EQU   @NM00083+32                                              02466000
CSWPSW2  EQU   CSW2CSW2                                                 02467000
CSW2KEY  EQU   @NM00083+37                                              02468000
CSW2NONE EQU   CSW2KEY                                                  02469000
WORKCSW  EQU   0                                                        02470000
PSWFLD   EQU   0                                                        02471000
@NM00092 EQU   0                                                        02472000
CSWKEY   EQU   @NM00092                                                 02473000
CSWBLANK EQU   @NM00092+2                                               02474000
CSWADDR  EQU   @NM00092+3                                               02475000
CSWSTAT  EQU   @NM00092+10                                              02476000
CSWCOUNT EQU   @NM00092+15                                              02477000
FROMFLD  EQU   0                                                        02478000
@NM00095 EQU   0                                                        02479000
SNSASTRK EQU   @NM00095                                                 02480000
SNSXPRCV EQU   @NM00095+1                                               02481000
SNSNONE  EQU   @NM00095+10                                              02482000
SNSFLDS  EQU   0                                                        02483000
SNSDATA  EQU   SNSFLDS                                                  02484000
FROMSNS  EQU   0                                                        02485000
TOSENSE  EQU   0                                                        02486000
@NM00098 EQU   0                                                        02487000
DATAERR  EQU   @NM00098                                                 02488000
DATAXPRC EQU   @NM00098+1                                               02489000
DATAWRT  EQU   DATAXPRC                                                 02490000
DATAFLD  EQU   @NM00098+11                                              02491000
DATARRAY EQU   0                                                        02492000
CNVDATA  EQU   0                                                        02493000
BACKSAVE EQU   0                                                        02494000
$PTMSGCA EQU   0                                                        02495000
$PTMSGCC EQU   0                                                        02496000
OLTENTRY EQU   0                                                        02497000
SVESC024 EQU   SVESC022                                                 02498000
DPRWORK  EQU   $WORK                                                    02499000
DPRWORK1 EQU   DPRWORK+3                                                02500000
DPRWORK2 EQU   DPRWORK+4                                                02501000
I        EQU   $CTR                                                     02502000
SVECC012 EQU   SVESC022                                                 02503000
SVEIC00A EQU   SVEIC003                                                 02504000
SVEIC004 EQU   SVEIC003                                                 02505000
SVEIC005 EQU   SVEIC003                                                 02506000
SVESC02A EQU   SVESC022                                                 02507000
SVESC02B EQU   SVESC022                                                 02508000
SVESC02D EQU   SVESC022                                                 02509000
SVESC02E EQU   SVESC022                                                 02510000
SVESC02F EQU   SVECC013                                                 02511000
SVESC027 EQU   SVESC022                                                 02512000
SVESC029 EQU   SVESC033                                                 02513000
SVESC031 EQU   SVECC013                                                 02514000
SVESC032 EQU   SVECC011                                                 02515000
SVETC037 EQU   SVEIC003                                                 02516000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02517000
@NM00060 EQU   DPRWORK                                                  02518000
@NM00099 EQU   @NM00098+10                                              02519000
@NM00097 EQU   SNSFLDS+2                                                02520000
@NM00096 EQU   @NM00095+9                                               02521000
@NM00094 EQU   @NM00092+14                                              02522000
@NM00093 EQU   @NM00092+9                                               02523000
@NM00091 EQU   CSW2KEY+4                                                02524000
@NM00090 EQU   @NM00083+36                                              02525000
@NM00089 EQU   CSW2CSW2+1                                               02526000
@NM00088 EQU   @NM00083+27                                              02527000
@NM00087 EQU   CSW1KEY+4                                                02528000
@NM00086 EQU   @NM00083+10                                              02529000
@NM00085 EQU   CSWXPTRC+6                                               02530000
@NM00084 EQU   CSWXPTRC                                                 02531000
@NM00082 EQU   CCQUEUED+1                                               02532000
@NM00081 EQU   @NM00078+21                                              02533000
@NM00080 EQU   @NM00078+10                                              02534000
@NM00079 EQU   @NM00078+8                                               02535000
@NM00076 EQU   @NM00069+35                                              02536000
@NM00075 EQU   @NM00069+27                                              02537000
@NM00074 EQU   @NM00069+22                                              02538000
@NM00073 EQU   @NM00069+19                                              02539000
@NM00072 EQU   @NM00069+16                                              02540000
@NM00071 EQU   @NM00069+9                                               02541000
@NM00070 EQU   @NM00069+6                                               02542000
@NM00068 EQU   @NM00062+53                                              02543000
@NM00067 EQU   @NM00062+49                                              02544000
@NM00066 EQU   @NM00062+44                                              02545000
@NM00065 EQU   @NM00062+35                                              02546000
@NM00064 EQU   @NM00062+21                                              02547000
HDRBLANK EQU   HDRRTN#                                                  02548000
@NM00063 EQU   @NM00062+12                                              02549000
@NM00061 EQU   S24FLAG1                                                 02550000
TCBOBSQL EQU   TECBSEND+23                                              02551000
TCBOBSQ  EQU   TECBSEND+22                                              02552000
TCBIBSQL EQU   TECBSEND+20                                              02553000
TCBIBSQ  EQU   TECBSEND+19                                              02554000
TCBSIGDA EQU   TECBSEND+15                                              02555000
TCBSEQNO EQU   TECBSEND+13                                              02556000
TCBCNTRL EQU   TECBSEND+10                                              02557000
TCBCHAIN EQU   TECBSEND+9                                               02558000
@NM00059 EQU   TCBRKCHG                                                 02559000
TCBALT   EQU   TCBRKCHG                                                 02560000
TCBREQ   EQU   TCBRKCHG                                                 02561000
TCBCMD   EQU   TCBRKCHG                                                 02562000
TCBEB    EQU   TCBRKCHG                                                 02563000
TCBBB    EQU   TCBRKCHG                                                 02564000
@NM00058 EQU   TCBRTYPE                                                 02565000
TCBDFAS  EQU   TCBRTYPE                                                 02566000
TCBNDFS  EQU   TCBRTYPE                                                 02567000
TCBRSP   EQU   TCBRTYPE                                                 02568000
@NM00057 EQU   TCBRTYPE                                                 02569000
TCBRECLN EQU   TECBSEND+5                                               02570000
TCBRRN   EQU   TCBRESP                                                  02571000
TCBNFME  EQU   TCBRESP                                                  02572000
TCBEX    EQU   TCBRESP                                                  02573000
@NM00056 EQU   TCBRESP                                                  02574000
TCBUSEN  EQU   TECBSEND+2                                               02575000
TCBSSENM EQU   TECBSEND+1                                               02576000
TCBSSEN  EQU   TECBSEND                                                 02577000
@NM00054 EQU   TECBFLGS                                                 02578000
@NM00053 EQU   $PTCNTWD+3                                               02579000
@NM00052 EQU   $PTCNTWD+1                                               02580000
$CSW2ERR EQU   $PTCNTWD+1                                               02581000
@NM00051 EQU   $PTCNTWD+1                                               02582000
@NM00050 EQU   $PTCNTWD                                                 02583000
$DPFORMS EQU   $PTCNTWD                                                 02584000
$DPRIDNT EQU   DPRNTMAP+2                                               02585000
$DPRLEVL EQU   DPRNTMAP+1                                               02586000
$DPRTRMG EQU   DPRNTMAP                                                 02587000
$RME     EQU   $NEWSPRF+36                                              02588000
@NM00049 EQU   $NEWSPRF+35                                              02589000
$DCHB    EQU   $NEWSPRF+28                                              02590000
$MOSIZE  EQU   $NEWSPRF+24                                              02591000
$RTSIZE  EQU   $NEWSPRF+20                                              02592000
$COUNT   EQU   $NEWSPRF+18                                              02593000
@NM00048 EQU   #FLAGS                                                   02594000
#MSGIDRQ EQU   #FLAGS                                                   02595000
#PLKMCOR EQU   #FLAGS                                                   02596000
@NM00047 EQU   #FLAGS                                                   02597000
$VIRTUAL EQU   #FLAGS                                                   02598000
$PLINK$  EQU   $NEWSPRF+12                                              02599000
$SCTREQ  EQU   $NEWSPRF+11                                              02600000
$RM      EQU   $NEWSPRF+9                                               02601000
$CTYPE   EQU   $NEWSPRF+8                                               02602000
$CCLASS  EQU   $NEWSPRF+7                                               02603000
$CFEAT   EQU   $NEWSPRF+6                                               02604000
$CMODEL  EQU   $NEWSPRF+5                                               02605000
$TYPE    EQU   $NEWSPRF+4                                               02606000
$CLASS   EQU   $NEWSPRF+3                                               02607000
$FEAT    EQU   $NEWSPRF+2                                               02608000
$MODEL   EQU   $NEWSPRF+1                                               02609000
#MSGID   EQU   @NM00046+16                                              02610000
SVECC010 EQU   TOLTEPWA+3952                                            02611000
SVETC035 EQU   TOLTEPWA+3880                                            02612000
SVESC030 EQU   TOLTEPWA+3808                                            02613000
SVESC020 EQU   TOLTEPWA+3664                                            02614000
SVEIC002 EQU   TOLTEPWA+3520                                            02615000
SVECC014 EQU   TOLTEPWA+3376                                            02616000
SVESC120 EQU   TOLTEPWA+3304                                            02617000
SVESC025 EQU   TOLTEPWA+3088                                            02618000
@NM00045 EQU   TOLTEPWA+2980                                            02619000
$RPLERR  EQU   TOLTEPWA+2977                                            02620000
@NM00044 EQU   TOLTEPWA+2976                                            02621000
$R13PR3  EQU   TOLTEPWA+2972                                            02622000
$CEINT2  EQU   TOLTEPWA+2968                                            02623000
$CEINT1  EQU   TOLTEPWA+2964                                            02624000
$MSGGET  EQU   TOLTEPWA+2960                                            02625000
$ACQLIST EQU   TOLTEPWA+2956                                            02626000
$R4SAVE1 EQU   TOLTEPWA+2952                                            02627000
$CLSISS  EQU   TOLTEPWA+2950                                            02628000
$CLSCNT  EQU   TOLTEPWA+2948                                            02629000
$CUTABLE EQU   TOLTEPWA+2868                                            02630000
$BUFSZ2  EQU   TOLTEPWA+2864                                            02631000
$RESID2  EQU   TOLTEPWA+2860                                            02632000
$OLTCCW2 EQU   TOLTEPWA+2856                                            02633000
$ENDBFR2 EQU   TOLTEPWA+2852                                            02634000
$1STBFR2 EQU   TOLTEPWA+2848                                            02635000
$TECB2   EQU   TOLTEPWA+2844                                            02636000
$BUFSZ1  EQU   TOLTEPWA+2840                                            02637000
$RESID1  EQU   TOLTEPWA+2836                                            02638000
$OLTCCW1 EQU   TOLTEPWA+2832                                            02639000
$ENDBFR1 EQU   TOLTEPWA+2828                                            02640000
$1STBFR1 EQU   TOLTEPWA+2824                                            02641000
$TECB1   EQU   TOLTEPWA+2820                                            02642000
$WAITIME EQU   TOLTEPWA+2816                                            02643000
$TRTN#   EQU   TOLTEPWA+2815                                            02644000
$WIODEV  EQU   TOLTEPWA+2814                                            02645000
$RQSTSZE EQU   TOLTEPWA+2812                                            02646000
$RQSTPTR EQU   TOLTEPWA+2808                                            02647000
$R4SAVE  EQU   TOLTEPWA+2804                                            02648000
$PARTADR EQU   TOLTEPWA+2800                                            02649000
$TBSDATA EQU   TOLTEPWA+2796                                            02650000
$CTWIDTH EQU   TOLTEPWA+2795                                            02651000
$CTLINE  EQU   TOLTEPWA+2794                                            02652000
$APWIDTH EQU   TOLTEPWA+2793                                            02653000
$APLINE  EQU   TOLTEPWA+2792                                            02654000
$DTORESP EQU   TOLTEPWA+2712                                            02655000
$APNAME  EQU   TOLTEPWA+2704                                            02656000
$MACID   EQU   TOLTEPWA+2661                                            02657000
$CSPARE  EQU   $CFLGS                                                   02658000
$C2WAY   EQU   $CFLGS                                                   02659000
$CINCT   EQU   $CCOMDAT+12                                              02660000
ROOTLOC  EQU   TOLTEPWA+2640                                            02661000
$RETREG  EQU   TOLTEPWA+2636                                            02662000
$EXTA    EQU   TOLTEPWA+2320                                            02663000
$PASSONA EQU   TOLTEPWA+2264                                            02664000
$TRMINPT EQU   TOLTEPWA+2184                                            02665000
$TLTRPL3 EQU   TOLTEPWA+1856                                            02666000
$TLTRPL2 EQU   TOLTEPWA+1736                                            02667000
$TLTRPL1 EQU   TOLTEPWA+1616                                            02668000
$SLTBL   EQU   TOLTEPWA+1468                                            02669000
$CDEVPT  EQU   TOLTEPWA+1466                                            02670000
$FEEDBCK EQU   $DEVTBLE+66                                              02671000
$WTISUED EQU   $DEVFLG4                                                 02672000
$EXIOISD EQU   $DEVFLG4                                                 02673000
$REMWRIT EQU   $DEVFLG4                                                 02674000
$REMDONE EQU   $DEVFLG4                                                 02675000
$2NDUSED EQU   $DEVFLG4                                                 02676000
$1STUSED EQU   $DEVFLG4                                                 02677000
$IGLXIFB EQU   $DEVFLG4                                                 02678000
$EXIOLV3 EQU   $DEVFLG4                                                 02679000
@NM00042 EQU   $DEVFLG5                                                 02680000
$DVBASIC EQU   $DEVFLG5                                                 02681000
$ASCII   EQU   $DEVFLG5                                                 02682000
$DEVLU   EQU   $DEVFLG5                                                 02683000
$OPNDFAL EQU   $DEVFLG5                                                 02684000
$ACQNCB  EQU   $DEVFLG5                                                 02685000
$REMOTE  EQU   $DEVFLG5                                                 02686000
$ENDNODE EQU   $DEVFLG5                                                 02687000
$CID     EQU   $DEVTBLE+52                                              02688000
$DVCOL   EQU   $LDNCBPT+2                                               02689000
$DVROW   EQU   $LDNCBPT                                                 02690000
$NCSPLP  EQU   $DEVTBLE+44                                              02691000
$DVLN    EQU   $SSCPDAF                                                 02692000
$DAF     EQU   $DEVSESP+4                                               02693000
$VARYPAB EQU   $DEVSESP                                                 02694000
@NM00041 EQU   $DEVFLG3                                                 02695000
$CLRSNT  EQU   $DEVFLG3                                                 02696000
$OLTERR  EQU   $DEVFLG3                                                 02697000
$SRTEST  EQU   $DEVFLG3                                                 02698000
$DVSNDOK EQU   $SIOFLG                                                  02699000
$POLLREQ EQU   $DEVFLG3                                                 02700000
$ACQRED  EQU   $DEVFLG3                                                 02701000
$NOTDEV  EQU   $DEVFLG3                                                 02702000
$DVINCT  EQU   $DEVTBLE+26                                              02703000
$DVBRKST EQU   $OPND+1                                                  02704000
$DVBRKSN EQU   $OPND                                                    02705000
$DVSEQNO EQU   $OPIS                                                    02706000
$CEINTRP EQU   $DEVFLG2                                                 02707000
$DEVALOC EQU   $DEVFLG2                                                 02708000
$ALLDATA EQU   $DEVFLG2                                                 02709000
$ENDCNTL EQU   $DEVFLG2                                                 02710000
$CTLDEV  EQU   $DEVFLG2                                                 02711000
$NOCDS   EQU   $DEVFLG2                                                 02712000
$DATAIN  EQU   $DEVFLG2                                                 02713000
$PRIMARY EQU   $DEVFLG1                                                 02714000
$DVCTBYT EQU   $INTOCC                                                  02715000
$DEVACT  EQU   $DEVFLG1                                                 02716000
$DVLGMDE EQU   $ATTNEXP                                                 02717000
$DVSPRM  EQU   $EVNCPLT                                                 02718000
$GRABBED EQU   $DEVFLG1                                                 02719000
$CATASTR EQU   $DEVFLG1                                                 02720000
$LETGO   EQU   $DEVFLG1                                                 02721000
$CURELEM EQU   $$SYMNME+4                                               02722000
$MSGOTSD EQU   $$SYMNME                                                 02723000
$EXTDEV  EQU   $DEVCDS+11                                               02724000
@NM00040 EQU   $DEVSDCF                                                 02725000
$NOTPRIM EQU   $DEVSDCF                                                 02726000
@NM00039 EQU   $DEVCDSF                                                 02727000
@NM00038 EQU   $DEVCDSF                                                 02728000
@NM00037 EQU   $DEVCDSF                                                 02729000
$CDSNAME EQU   $DEVCDSF                                                 02730000
$EXTRN   EQU   $DEVCDSF                                                 02731000
$CEVOLUM EQU   $DEVCDSF                                                 02732000
$SHARD   EQU   $DEVCDSF                                                 02733000
$DEVFPM  EQU   $DEVCDSF                                                 02734000
$DEVCNT  EQU   $DEVCDS+8                                                02735000
$DEVTYPE EQU   $DEVFEAT+3                                               02736000
$DEVCLAS EQU   $DEVFEAT+2                                               02737000
$DEVFRRS EQU   $DEVFEAT+1                                               02738000
$DEVMOD  EQU   $DEVFEAT                                                 02739000
$DEVRDGT EQU   @NM00035+1                                               02740000
$DEVCTLU EQU   @NM00035+1                                               02741000
$DEVCHAN EQU   @NM00035                                                 02742000
@NM00036 EQU   @NM00035                                                 02743000
$CTINDX  EQU   $DEVUNAD                                                 02744000
$FLAG16  EQU   $COMMFLG+15                                              02745000
$FLAG15  EQU   $COMMFLG+14                                              02746000
$FLAG14  EQU   $COMMFLG+13                                              02747000
$TEP2ND  EQU   $FLAG13                                                  02748000
$TEP1ST  EQU   $FLAG13                                                  02749000
$PRMPTSW EQU   $FLAG13                                                  02750000
$DEVENT  EQU   $FLAG13                                                  02751000
$OLTMACC EQU   $FLAG13                                                  02752000
$LGON    EQU   $FLAG13                                                  02753000
$CTLOGON EQU   $FLAG13                                                  02754000
@NM00034 EQU   $FLAG12                                                  02755000
$VARYINP EQU   $FLAG12                                                  02756000
$ENDTEST EQU   $FLAG12                                                  02757000
$VRYHRD  EQU   $FLAG12                                                  02758000
$VRYSFT  EQU   $FLAG12                                                  02759000
$POSTFLG EQU   $FLAG12                                                  02760000
$OPTMSG  EQU   $FLAG12                                                  02761000
$FEORCAT EQU   $FLAG11                                                  02762000
@NM00033 EQU   $FLAG11                                                  02763000
@NM00032 EQU   $FLAG10                                                  02764000
$INBND   EQU   $FLAG10                                                  02765000
$WAITFLG EQU   $FLAG10                                                  02766000
$DPRINT  EQU   $FLAG10                                                  02767000
$HOLD    EQU   $FLAG9                                                   02768000
@NM00031 EQU   $FLAG9                                                   02769000
$COPY    EQU   $FLAG9                                                   02770000
$LSTLNSW EQU   $FLAG9                                                   02771000
$MULLNSW EQU   $FLAG9                                                   02772000
$REMSW   EQU   $FLAG9                                                   02773000
$IGRES   EQU   $FLAG9                                                   02774000
$VS2     EQU   $FLAG8                                                   02775000
$VS1     EQU   $FLAG8                                                   02776000
$EDOS    EQU   $FLAG8                                                   02777000
@NM00030 EQU   $FLAG8                                                   02778000
$TWOWAY  EQU   $FLAG8                                                   02779000
@NM00029 EQU   $FLAG8                                                   02780000
$RCVMSG  EQU   $FLAG7                                                   02781000
$RCVRFLG EQU   $FLAG7                                                   02782000
$SNDRFLG EQU   $FLAG7                                                   02783000
$LDOIS   EQU   $FLAG7                                                   02784000
$DCONTCT EQU   $FLAG7                                                   02785000
$EXIOWAT EQU   $FLAG7                                                   02786000
$2NDDATA EQU   $FLAG7                                                   02787000
$1STDATA EQU   $FLAG7                                                   02788000
$CIREQ   EQU   $FLAG6                                                   02789000
$ABTERM  EQU   $ABNDBIT                                                 02790000
$FSTMCIS EQU   $FLAG6                                                   02791000
$DISCREQ EQU   $FLAG6                                                   02792000
$DISCISS EQU   $FLAG6                                                   02793000
$CHANGE  EQU   $FLAG6                                                   02794000
$CTERROR EQU   $FLAG6                                                   02795000
$RECAL11 EQU   $FLAG6                                                   02796000
@NM00028 EQU   $FLAG5                                                   02797000
$PROGCK  EQU   $CANCEL                                                  02798000
$PRINTAP EQU   $FLAG5                                                   02799000
@NM00027 EQU   $FLAG5                                                   02800000
$MSG922  EQU   $FLAG5                                                   02801000
$CT924   EQU   $FLAG5                                                   02802000
$ACTOPND EQU   $FLAG4                                                   02803000
$ACQCUTT EQU   $FLAG4                                                   02804000
$CLSSACT EQU   $FLAG4                                                   02805000
$BACKINT EQU   $FLAG4                                                   02806000
$DMSGSW  EQU   $FLAG4                                                   02807000
$TSTDEVP EQU   $FLAG4                                                   02808000
$APRQPER EQU   $FLAG4                                                   02809000
$OPCOM   EQU   $FLAG4                                                   02810000
$NEWAP   EQU   $FLAG3                                                   02811000
$ALTPRTR EQU   $FLAG3                                                   02812000
$OPTERR  EQU   $FLAG3                                                   02813000
$REQSTOR EQU   $FLAG3                                                   02814000
$LOGOFFE EQU   $FLAG3                                                   02815000
$TSTERR  EQU   $FLAG3                                                   02816000
$DEVERR  EQU   $FLAG3                                                   02817000
$PARTIAL EQU   $FLAG2                                                   02818000
$NRMTERM EQU   $FLAG2                                                   02819000
$VALDTST EQU   $FLAG2                                                   02820000
$VALDDEV EQU   $FLAG2                                                   02821000
$DBLSLSH EQU   $FLAG2                                                   02822000
@NM00026 EQU   $FLAG2                                                   02823000
$FTTHR   EQU   $FLAG2                                                   02824000
$OLTACT  EQU   $FLAG1                                                   02825000
$NORELDV EQU   $FLAG1                                                   02826000
@NM00025 EQU   $FLAG1                                                   02827000
$OPTCHNG EQU   $FLAG1                                                   02828000
$DEVCHNG EQU   $FLAG1                                                   02829000
$TESTCNG EQU   $FLAG1                                                   02830000
$CNSLFG  EQU   $FLAG1                                                   02831000
$TEP3RD  EQU   $FLAG1                                                   02832000
@NM00024 EQU   $CDA+120                                                 02833000
$CUCNT   EQU   $CDA+118                                                 02834000
@NM00023 EQU   $CDA+117                                                 02835000
$OPISCNT EQU   $CDA+114                                                 02836000
$OPNDCNT EQU   $CDA+112                                                 02837000
$GETMSZE EQU   $CDA+110                                                 02838000
$GRCNTS  EQU   $CDA+108                                                 02839000
$CTLCNT  EQU   $CDA+106                                                 02840000
$ACTLVL  EQU   $CDA+105                                                 02841000
$ERRCNTA EQU   $CDA+102                                                 02842000
$TLCNT   EQU   $CDA+100                                                 02843000
$TIMEALW EQU   $CDA+96                                                  02844000
$PTRAREA EQU   $CDA+92                                                  02845000
$GETMPTR EQU   $CDA+88                                                  02846000
$R13PTRT EQU   $CDA+84                                                  02847000
$TEPEND  EQU   $CDA+76                                                  02848000
$PLINKDL EQU   $CDA+72                                                  02849000
$TEPBEGN EQU   $CDA+68                                                  02850000
$FRELPTR EQU   $CDA+64                                                  02851000
$HIGHADR EQU   $HIMOREC                                                 02852000
$LOMOREC EQU   $CDA+56                                                  02853000
$ENDCOMM EQU   $CDA+48                                                  02854000
$COMMON  EQU   $RCA                                                     02855000
$SLASHAD EQU   $CDA+32                                                  02856000
$PASSON  EQU   $CDA+28                                                  02857000
$TOLBRTB EQU   $CDA+24                                                  02858000
$SCTPTR8 EQU   $CDA+20                                                  02859000
$SCTPTR  EQU   $CDA+16                                                  02860000
$TBWDPTR EQU   $CDA+12                                                  02861000
$TFWDPTR EQU   $CDA+8                                                   02862000
@NM00022 EQU   $CDA                                                     02863000
@NM00021 EQU   $SCTTBLE+98                                              02864000
$SCTLWTC EQU   $SCTTBLE+96                                              02865000
$SCTLWTA EQU   $SCTTBLE+92                                              02866000
#EXT     EQU   $SCTTBLE+88                                              02867000
#PASS    EQU   $SCTTBLE+84                                              02868000
#TABLE   EQU   $SCTTBLE+80                                              02869000
#MSGIDAC EQU   $SCTTBLE+78                                              02870000
@NM00020 EQU   $SCTTBLE+71                                              02871000
$RETMASK EQU   $SCTTBLE+70                                              02872000
$R249255 EQU   $ROUTMSK+29                                              02873000
$R241248 EQU   $ROUTMSK+28                                              02874000
$R233240 EQU   $ROUTMSK+27                                              02875000
$R225232 EQU   $ROUTMSK+26                                              02876000
$R217224 EQU   $ROUTMSK+25                                              02877000
$R209216 EQU   $ROUTMSK+24                                              02878000
$R201208 EQU   $ROUTMSK+23                                              02879000
$R193200 EQU   $ROUTMSK+22                                              02880000
$R185192 EQU   $ROUTMSK+21                                              02881000
$R177184 EQU   $ROUTMSK+20                                              02882000
$R169176 EQU   $ROUTMSK+19                                              02883000
$R161168 EQU   $ROUTMSK+18                                              02884000
$R153160 EQU   $ROUTMSK+17                                              02885000
$R145152 EQU   $ROUTMSK+16                                              02886000
$R137144 EQU   $ROUTMSK+15                                              02887000
$R129136 EQU   $ROUTMSK+14                                              02888000
$R121128 EQU   $ROUTMSK+13                                              02889000
$R113120 EQU   $ROUTMSK+12                                              02890000
$R105112 EQU   $ROUTMSK+11                                              02891000
$R097104 EQU   $ROUTMSK+10                                              02892000
$R089096 EQU   $ROUTMSK+9                                               02893000
$R081088 EQU   $ROUTMSK+8                                               02894000
$R073080 EQU   $ROUTMSK+7                                               02895000
$R065072 EQU   $ROUTMSK+6                                               02896000
$R057064 EQU   $ROUTMSK+5                                               02897000
$R049056 EQU   $ROUTMSK+4                                               02898000
$R041048 EQU   $ROUTMSK+3                                               02899000
$R033040 EQU   $ROUTMSK+2                                               02900000
$R025032 EQU   $ROUTMSK+1                                               02901000
$R017024 EQU   $ROUTMSK                                                 02902000
$TOTFLG2 EQU   $SCTTBLE+39                                              02903000
@NM00019 EQU   $TOTFLG1                                                 02904000
@NM00018 EQU   $TOTFLG1                                                 02905000
@NM00017 EQU   $TOTFLG1                                                 02906000
$CURELOD EQU   $TOTFLG1                                                 02907000
$CTEQTT  EQU   $TOTFLG1                                                 02908000
@NM00016 EQU   $TOTFLG1                                                 02909000
@NM00015 EQU   $TOTFLG1                                                 02910000
$LINESHR EQU   $TOTFLG1                                                 02911000
@NM00014 EQU   $OLTFLG2                                                 02912000
@NM00013 EQU   $OLTFLG2                                                 02913000
@NM00012 EQU   $OLTFLG2                                                 02914000
@NM00011 EQU   $OLTFLG2                                                 02915000
@NM00010 EQU   $OLTFLG2                                                 02916000
@NM00009 EQU   $OLTFLG2                                                 02917000
@NM00008 EQU   $OLTFLG2                                                 02918000
$TALK    EQU   $OLTFLG2                                                 02919000
$DYCOM   EQU   $OLTFLGS                                                 02920000
@NM00007 EQU   $OLTFLGS                                                 02921000
$TRACE   EQU   $OLTFLGS                                                 02922000
$RETCODE EQU   $OLTFLGS                                                 02923000
$CONTCB  EQU   $OLTFLGS                                                 02924000
$RETAIN  EQU   $OLTFLGS                                                 02925000
$CLEANRT EQU   $OLTFLGS                                                 02926000
$MANINTV EQU   $OLTFLGS                                                 02927000
$OLTSIZE EQU   $SCTTBLE+34                                              02928000
$QSCTMOD EQU   $EXECFLG                                                 02929000
$CTRLMOD EQU   $EXECFLG                                                 02930000
$CLEANUP EQU   $EXECFLG                                                 02931000
$LSTPDEV EQU   $EXECFLG                                                 02932000
$ERRCNT  EQU   $EXECFLG                                                 02933000
$RTNSLCT EQU   $EXECFLG                                                 02934000
$MULTDEV EQU   $EXECFLG                                                 02935000
@NM00006 EQU   $EXECFLG                                                 02936000
$RMSKCNT EQU   $SCTTBLE+32                                              02937000
$EXTSIG  EQU   $CDS8T19+3                                               02938000
$CDFLGS  EQU   $CDS8T19+1                                               02939000
$CDSCNT  EQU   $CDS8T19                                                 02940000
$PDEVDSC EQU   $SCTTBLE+16                                              02941000
$COMMCN  EQU   $CDSFLGS                                                 02942000
$CUSTSYM EQU   $CDSFLGS                                                 02943000
$TWOCHSW EQU   $CDSFLGS                                                 02944000
$EXTINTC EQU   $CDSFLGS                                                 02945000
$CEVOL   EQU   $CDSFLGS                                                 02946000
$SHARED  EQU   $CDSFLGS                                                 02947000
$FPM     EQU   $CDSFLGS                                                 02948000
$LASTSUB EQU   $PDEVFLG                                                 02949000
@NM00005 EQU   $PDEVFLG                                                 02950000
@NM00004 EQU   $PDEVFLG                                                 02951000
@NM00003 EQU   $PDEVFLG                                                 02952000
$LASTDEV EQU   $PDEVFLG                                                 02953000
@NM00002 EQU   $PDEVFLG                                                 02954000
$EXFILPT EQU   $PDEVFLG                                                 02955000
$FPMOLD  EQU   $PDEVFLG                                                 02956000
$TSSSYM  EQU   $SCTTBLE+8                                               02957000
$SCTLEVL EQU   $SCTTBLE+7                                               02958000
$DRIVER  EQU   $SCTTBLE+6                                               02959000
$RT0916  EQU   $SCTTBLE+5                                               02960000
$RT0108  EQU   $SCTTBLE+4                                               02961000
$NOCNTRL EQU   $ERROPT                                                  02962000
$INDEFLP EQU   $TESTOPT                                                 02963000
$PARAPRT EQU   $TESTOPT                                                 02964000
@NM00001 EQU   $TESTOPT                                                 02965000
$ERRLPCT EQU   $SCTTBLE                                                 02966000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02967000
@RT00102 EQU   S24C0100                                                 02968000
@RF00102 EQU   S24C9990                                                 02969000
@RT00145 EQU   S24C0200                                                 02970000
@RT00178 EQU   S24C0250                                                 02971000
@RT00184 EQU   S24C0300                                                 02972000
@RT00191 EQU   S24C0252                                                 02973000
@RT00225 EQU   S24C0350                                                 02974000
@RT00240 EQU   S24C0310                                                 02975000
@RT00254 EQU   S24C0310                                                 02976000
@RT00268 EQU   S24C0400                                                 02977000
@RT00280 EQU   S24C0360                                                 02978000
@RT00318 EQU   S24C0405                                                 02979000
@RT00320 EQU   S24C0430                                                 02980000
@RT00325 EQU   S24C0445                                                 02981000
@RT00337 EQU   S24C0450                                                 02982000
@RT00339 EQU   S24C0445                                                 02983000
@RT00345 EQU   S24C0500                                                 02984000
@RT00356 EQU   S24C0550                                                 02985000
@RT00373 EQU   S24C0510                                                 02986000
@RT00384 EQU   S24C0600                                                 02987000
@RT00390 EQU   S24C0650                                                 02988000
@RT00398 EQU   S24C0700                                                 02989000
@RT00404 EQU   S24C0750                                                 02990000
@RT00412 EQU   S24C0755                                                 02991000
@RT00425 EQU   S24C0850                                                 02992000
@RF00423 EQU   S24C9999                                                 02993000
@RT00448 EQU   S24C0875                                                 02994000
@RT00452 EQU   S24C0875                                                 02995000
@RF00489 EQU   @EC00491                                                 02996000
S24C2650 EQU   @EL00003                                                 02997000
@RT00514 EQU   S24C3012                                                 02998000
@RT00527 EQU   S24C3010                                                 02999000
@RF00531 EQU   S24C3010                                                 03000000
@RT00540 EQU   S24C3005                                                 03001000
@RF00540 EQU   S24C3010                                                 03002000
@RT00544 EQU   S24C3010                                                 03003000
@RT00546 EQU   S24C3010                                                 03004000
@RT00559 EQU   S24C3003                                                 03005000
@RT00633 EQU   S24C6020                                                 03006000
@RF00633 EQU   S24C6010                                                 03007000
@RT00672 EQU   S24C7010                                                 03008000
@ENDDATA EQU   *                                                        03009000
         END   ISTSC024,(C'PLS2140',0702,80232)                         03010000
