         TITLE 'ISTSC026,DTIME. OBTAINS CURRENT TIME OF DAY'            00001000
* IBM DISK OPERATING SYSTEM                                             00002000
* TOLTEP - 5745-SC-TLT                                                  00003000
          ISEQ  73,80                                                   00004000
ISTSC026 CSECT ,                                                   0002 00005000
@MAINENT DS    0H                                                  0002 00006000
         USING *,@15                                               0002 00007000
         B     @PROLOG                                             0002 00008000
         DC    AL1(16)                                             0002 00009000
         DC    C'ISTSC026  80.232'                                 0002 00010000
         DROP  @15                                                      00011000
@PROLOG  ST    @14,12(,@13)                                        0002 00012000
         ST    @00,20(,@13)                                        0002 00013000
         STM   @02,@12,28(@13)                                     0002 00014000
         BALR  @04,0                                               0002 00015000
@PSTART  DS    0H                                                  0002 00016000
         USING @PSTART,@04                                         0002 00017000
          TIME  DEC                     GET PACKED DEC TIME             00018000
          LR    R1,R0                   PUT TIME IN R1                  00019000
          SRL   R1,8                                                    00020000
          SLL   R1,8                                                    00021000
*   R15=0;                          /* SET GOOD RETURN CODE          */ 00022000
         SLR   R15,R15                                             0023 00023000
*   RETURN;                                                        0024 00024000
@EL00001 DS    0H                                                  0024 00025000
@EF00001 DS    0H                                                  0024 00026000
@ER00001 L     @14,12(,@13)                                        0024 00027000
         L     @00,20(,@13)                                        0024 00028000
         LM    @02,@12,28(@13)                                     0024 00029000
         BR    @14                                                 0024 00030000
*   DO;                             /* ATDSPLY                       */ 00031000
*   END;                            /* ATDSPLY                       */ 00032000
*   END;                                                           0027 00033000
@DATA    DS    0H                                                       00034000
         DS    0F                                                       00035000
         DS    0F                                                       00036000
         DS    0D                                                       00037000
PATCH    DC    5F'0'                                                    00038000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00039000
@01      EQU   01                                                       00040000
@02      EQU   02                                                       00041000
@03      EQU   03                                                       00042000
@04      EQU   04                                                       00043000
@05      EQU   05                                                       00044000
@06      EQU   06                                                       00045000
@07      EQU   07                                                       00046000
@08      EQU   08                                                       00047000
@09      EQU   09                                                       00048000
@10      EQU   10                                                       00049000
@11      EQU   11                                                       00050000
@12      EQU   12                                                       00051000
@13      EQU   13                                                       00052000
@14      EQU   14                                                       00053000
@15      EQU   15                                                       00054000
WAPTR    EQU   @02                                                      00055000
R15      EQU   @15                                                      00056000
R0       EQU   @00                                                      00057000
R1       EQU   @01                                                      00058000
R10      EQU   @10                                                      00059000
R11      EQU   @11                                                      00060000
R12      EQU   @12                                                      00061000
R13      EQU   @13                                                      00062000
R14      EQU   @14                                                      00063000
R2       EQU   @02                                                      00064000
R3       EQU   @03                                                      00065000
R4       EQU   @04                                                      00066000
R5       EQU   @05                                                      00067000
R6       EQU   @06                                                      00068000
R7       EQU   @07                                                      00069000
R8       EQU   @08                                                      00070000
R9       EQU   @09                                                      00071000
TOLTEPWA EQU   0                                                        00072000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00073000
$WORKARA EQU   TOLTEPWA+1616                                            00074000
$SLTBL   EQU   TOLTEPWA+1468                                            00075000
@NM00001 EQU   TOLTEPWA+1464                                            00076000
$DEVTBLE EQU   TOLTEPWA+240                                             00077000
$COMMFLG EQU   TOLTEPWA+224                                             00078000
$CDA     EQU   TOLTEPWA+100                                             00079000
$SCTTBLE EQU   TOLTEPWA                                                 00080000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00081000
@ENDDATA EQU   *                                                        00082000
         END   ISTSC026,(C'PLS2144',0702,80232)                         00083000
