./  ADD  SSI=80270308,NAME=IEFJESDM
         TITLE 'JOB ENTRY SUBSYSTEM CONTROL TABLE                      *00001000
                        '                                               00002000
IEFJESCT CSECT ,                                                   0001 00003000
@PROLOG  DS    0H                                                  0002 00004000
          IEFJESCT TYPE=DC                                              00005000
*        END   IEFJESCT ;                                          0003 00006000
@EL00001 DS    0H                                                  0003 00007000
@EF00001 DS    0H                                                  0003 00008000
@ER00001 BR    @14                                                 0003 00009000
@DATA    DS    0H                                                       00010000
         DS    0F                                                       00011000
         DS    0F                                                       00012000
         DS    0D                                                       00013000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00014000
@01      EQU   01                                                       00015000
@02      EQU   02                                                       00016000
@03      EQU   03                                                       00017000
@04      EQU   04                                                       00018000
@05      EQU   05                                                       00019000
@06      EQU   06                                                       00020000
@07      EQU   07                                                       00021000
@08      EQU   08                                                       00022000
@09      EQU   09                                                       00023000
@10      EQU   10                                                       00024000
@11      EQU   11                                                       00025000
@12      EQU   12                                                       00026000
@13      EQU   13                                                       00027000
@14      EQU   14                                                       00028000
@15      EQU   15                                                       00029000
@ENDDATA EQU   *                                                        00030000
         END   IEFJESCT,(C'PLS1940',0701,78027)                         00031000
./  ADD  SSI=80590381,NAME=IEFQB550
         TITLE 'IEFQB550-SWA MANAGER-MOVE MODE                         *00001000
                        '                                               00002000
IEFQB550 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IEFQB550  78.059'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
         MODESET EXTKEY=SCHED,SAVEKEY=(2)                               00014000
*                                  /*                                   00015000
*        BECAUSE OF PROLOGUE CODE GENERATED BY PLS,             Y02669  00016000
*        R2 NOW CONTAINS THE CALLER'S KEY, AND CANNOT BE USED   Y02669  00017000
*        UNTIL IT IS SAVED IN CALLRKEY.                         Y02669  00018000
         L     R3,PSATOLD          POINT TO CURRENT TCB         Y02669  00019000
         L     @11,TCBSWASA(R3)    POINT TO WORK AREA PREFIX    Y02669  00020000
*                                  (OR 0)                       Y02669  00021000
         LTR   @11,@11             CHECK FOR A WORK AREA        Y02669  00022000
         BNZ   CHECKUSE            CHECK WHETHER WORK AREA IS  YM08504  00023000
*                                  IN USE                      YM08504  00024000
*        GET STORAGE FOR A WORK AREA FOR THIS TCB.             YM08504  00025000
*        CHECK WHETHER THIS MODULE'S WORK AREA WOULD BE LARGE  YM08504  00026000
*        ENOUGH FOR EITHER IEFQB550 OR IEFQB555.               YM08504  00027000
         L     R4,@SIZDATD         GET SIZE REQUIRED FOR THIS   Y02669  00028000
*                                  MODULE'S WORK AREA           Y02669  00029000
         LA    R4,0(,R4)           CLEAR SUBPOOL FROM HIGH      Y02669  00030000
*                                  ORDER BYTE                   Y02669  00031000
         L     R1,SPSZ55N          PT. TO ADCON IN QB555       YM08504  00032000
         L     R1,0(,R1)           PT. TO VALUE IN QB555       YM08504  00033000
         L     R1,0(,R1)           GET VALUE IN QB555          YM08504  00034000
         LA    R1,0(,R1)           CLEAR HIGH ORDER BYTE       YM08504  00035000
         CR    R4,R1                                           YM08504  00036000
         BM    GETOTHER            GO GET SIZE REQUIRED FOR    YM08504  00037000
*                                  OTHER MODULE                YM08504  00038000
*        IN EITHER CASE, RESTORE R4 TO GET THE SUBPOOL.        YM08504  00039000
         L     R4,@SIZDATD         USE THIS MODULE'S SIZE      YM08504  00040000
         B     GETPERM             SKIP ELSE CLAUSE            YM08504  00041000
GETOTHER EQU   *                                               YM08504  00042000
         L     R1,SPSZ55N          PT. TO ADCON IN QB555       YM08504  00043000
         L     R1,0(,R1)           PT. TO VALUE IN QB555       YM08504  00044000
         L     R4,0(,R1)           GET VALUE IN QB555          YM08504  00045000
GETPERM  EQU   *                                               YM08504  00046000
         LA    R1,WKPFEX                                        Y02669  00047000
         ALR   R4,R1               ADD SIZE OF PREFIX TO AMOUNT Y02669  00048000
*                                  OF STORAGE REQUIRED BY PLS   Y02669  00049000
*                                  TO GET THE SIZE REQUIRED FOR Y02669  00050000
*                                  THE WORKAREA. (THE SUBPOOL   Y02669  00051000
*                                  IN THE HIGH ORDER BYTE IS    Y02669  00052000
*                                  PRESERVED.)                  Y02669  00053000
         GETMAIN R,LV=(R4)         GET WORK AREA                Y02669  00054000
         ST    R4,SPSIZE(,R1)      PUT SIZE AND SUBPOOL OF      Y02669  00055000
*                                  WORK AREA IN PREFIX          Y02669  00056000
         MVI   FLAGS(R1),ZERO      CLEAR FLAGE                 YM08504  00057000
         MODESET EXTKEY=ZERO       GET IN KEY ZERO TO STORE           **00058000
                                   IN TCB                       Y02669  00059000
         ST    R1,TCBSWASA(,R3)    SAVE PTR. TO WORKAREA PREFIX Y02669  00060000
         LR    @11,R1              POINT TO WORK AREA PREFIX    Y02669  00061000
*                                  (EXPECTED BY THE FOLLOWING   Y02669  00062000
*                                  PIECE OF CODE)               Y02669  00063000
         MODESET EXTKEY=SCHED      GET IN KEY FOR GETMAIN      YM08504  00064000
CHECKUSE EQU   *                                               YM08504  00065000
         TM    FLAGS(@11),INUSE    CHECK WHETHER WORK AREA     YM08504  00066000
*                                  IS IN USE                   YM08504  00067000
         BNO   PROLOG              NOT IN USE, USE IT          YM08504  00068000
*        WORK AREA IS IN USE (BY AN INTERRUPTED RB ALSO UNDER  YM08504  00069000
*        THIS TCB). GET A WORK AREA TO BE USED JUST FOR THIS   YM08504  00070000
*        INVOCATION OF THIS MODULE.                            YM08504  00071000
         L     R4,@SIZDATD                                     YM08504  00072000
         LA    R1,WKPFEX                                       YM08504  00073000
         ALR   R4,R1                                           YM08504  00074000
         GETMAIN R,LV=(R4)                                     YM08504  00075000
         LR    @11,R1              SAVE PTR. TO WORK AREA      YM08504  00076000
         ST    R4,SPSIZE(,@11)     SAVE FOR FREEMAIN           YM08504  00077000
         MVI   FLAGS(@11),MUSTFREE INDICATE MUST BE FREED ON   YM08504  00078000
*                                  EXIT                        YM08504  00079000
PROLOG   EQU   *                                                Y02669  00080000
         OI    FLAGS(@11),INUSE    SET IN USE                  YM08504  00081000
         LA    @11,WKPFEX(,@11)    POINT TO ACTUAL WORK AREA    Y02669  00082000
*                                  (SKIP THE PREFIX)            Y02669  00083000
         USING @DATD,@11           PROVIDE ADDRESSABILITY       Y02669  00084000
         ST    @13,@SA00001+SLOTBACK  BACKWARD CHAIN SAVE AREAS Y02669  00085000
         STC   @02,CALLRKEY        SAVE CALLER'S KEY            Y02669  00086000
*        NOTE THAT THE MODESET MACRO DOES NOT SUPPORT SYMBOLIC  Y02669  00087000
*        REGISTER NAMES.                                        Y02669  00088000
         MODESET KEYADDR=(2)       GET IN CALLER'S KEY TO             **00089000
                                   STORE IN CALLER'S SAVE AREA  Y02669  00090000
         LM    @00,@04,SLOTR0(@13) RESTORE INPUT REGISTERS      Y02669  00091000
         ST    @11,SLOTFORE(,@13)  FOREWARD CHAIN SAVE AREAS    Y02669  00092000
         LR    @13,@11             POINT TO CURRENT SAVE AREA   Y02669  00093000
         MODESET EXTKEY=SCHED      RETURN TO SCHEDULER KEY FOR        **00094000
                                   NORMAL PROCESSING            Y02669  00095000
*   QMPAPTR=R1;                     /* SET QMPA BASE POINTER         */ 00096000
         LR    QMPAPTR,R1                                          0078 00097000
*   RFY                                                            0079 00098000
*    (R0,                                                          0079 00099000
*     R1,                                                          0079 00100000
*     R2,                                                          0079 00101000
*     R3,                                                          0079 00102000
*     R4) UNRSTD;                   /*                         Y02669*/ 00103000
*   RETNCODE=ZERO;                  /* INITIALIZE RETURN CODE TO 0   */ 00104000
         SLR   @10,@10                                             0080 00105000
         ST    @10,RETNCODE                                        0080 00106000
*   IF QMPOP=ASGNST|QMPOP=ASSIGN THEN/* ASSIGN OR ASSIGN/START       */ 00107000
         CLI   QMPOP(QMPAPTR),X'00'                                0081 00108000
         BE    @RT00081                                            0081 00109000
         CLI   QMPOP(QMPAPTR),X'01'                                0081 00110000
         BNE   @RF00081                                            0081 00111000
@RT00081 DS    0H                                                  0082 00112000
*     CALL QB550AST;                /* CALL INTERNAL PROCEDURE       */ 00113000
         BAL   @14,QB550AST                                        0082 00114000
*   ELSE                                                           0083 00115000
*     IF QMPOP=WRITE THEN           /* IS THIS A WRITE REQUEST       */ 00116000
         B     @RC00081                                            0083 00117000
@RF00081 CLI   QMPOP(QMPAPTR),X'03'                                0083 00118000
         BNE   @RF00083                                            0083 00119000
*       CALL QB550WRT;              /* YES, CALL INTERNAL PROCEDURE  */ 00120000
         BAL   @14,QB550WRT                                        0084 00121000
*     ELSE                                                         0085 00122000
*       IF QMPOP=READ THEN          /* IS THIS A READ REQUEST        */ 00123000
         B     @RC00083                                            0085 00124000
@RF00083 CLI   QMPOP(QMPAPTR),X'04'                                0085 00125000
         BNE   @RF00085                                            0085 00126000
*         CALL QB550RD;             /* YES, CALL INTERNAL PROCEDURE  */ 00127000
         BAL   @14,QB550RD                                         0086 00128000
*       ELSE                                                       0087 00129000
*         IF QMPOP=DELETE THEN      /* IS THIS A DELETE REQUEST      */ 00130000
         B     @RC00085                                            0087 00131000
@RF00085 CLI   QMPOP(QMPAPTR),X'08'                                0087 00132000
         BNE   @RF00087                                            0087 00133000
*           CALL QB550DEL;          /* YES, CALL INTERNAL PROCEDURE  */ 00134000
         BAL   @14,QB550DEL                                        0088 00135000
*         ELSE                                                     0089 00136000
*           IF QMPOP=WRTASGN THEN   /* IS THIS A WRITE/ASSIGN REQ.   */ 00137000
         B     @RC00087                                            0089 00138000
@RF00087 CLI   QMPOP(QMPAPTR),X'02'                                0089 00139000
         BNE   @RF00089                                            0089 00140000
*             IF QMPNC¬='0000'B|QMPCM¬='0000'B THEN/* YES, IS EITHER    00141000
*                                      NON 0                         */ 00142000
         TM    QMPNC(QMPAPTR),B'00001111'                          0090 00143000
         BNZ   @RT00090                                            0090 00144000
         TM    QMPCM(QMPAPTR),B'11110000'                          0090 00145000
         BZ    @RF00090                                            0090 00146000
@RT00090 DS    0H                                                  0091 00147000
*               DO;                                                0091 00148000
*                 IF QMPNC¬='0000'B THEN/* YES, IS WRITE NON 0       */ 00149000
         TM    QMPNC(QMPAPTR),B'00001111'                          0092 00150000
         BZ    @RF00092                                            0092 00151000
*                   CALL QB550WRT;  /* YES, CALL INT. PROC.          */ 00152000
         BAL   @14,QB550WRT                                        0093 00153000
*                 IF RETNCODE=ZERO& /* IF NO ERROR YET AND           */ 00154000
*                     QMPCM¬='0000'B THEN/* ASSIGN COUNT NOT = 0     */ 00155000
@RF00092 L     @10,RETNCODE                                        0094 00156000
         LTR   @10,@10                                             0094 00157000
         BNZ   @RF00094                                            0094 00158000
         TM    QMPCM(QMPAPTR),B'11110000'                          0094 00159000
         BZ    @RF00094                                            0094 00160000
*                   CALL QB550AST;  /* CALL INTERNAL PROC.           */ 00161000
         BAL   @14,QB550AST                                        0095 00162000
*               END;                                               0096 00163000
*             ELSE                  /* IF BOTH WRITE AND ASSIGN COUNT   00164000
*                                      ARE 0                         */ 00165000
*               RETNCODE=INVCOUNT;  /* THAT IS AN ERROR              */ 00166000
         B     @RC00090                                            0097 00167000
@RF00090 LA    @10,20                                              0097 00168000
         ST    @10,RETNCODE                                        0097 00169000
*           ELSE                                                   0098 00170000
*             RETNCODE=INVFUNCT;    /* INVALID FUNCTION REQUEST      */ 00171000
         B     @RC00089                                            0098 00172000
@RF00089 LA    @10,4                                               0098 00173000
         ST    @10,RETNCODE                                        0098 00174000
*   IF RETNCODE¬=ZERO THEN          /* ANY ERROR                     */ 00175000
@RC00089 DS    0H                                                  0099 00176000
@RC00087 DS    0H                                                  0099 00177000
@RC00085 DS    0H                                                  0099 00178000
@RC00083 DS    0H                                                  0099 00179000
@RC00081 L     @10,RETNCODE                                        0099 00180000
         LTR   @10,@10                                             0099 00181000
         BZ    @RF00099                                            0099 00182000
*     DO;                           /* YES, DO THE FOLLOWING         */ 00183000
*       RESPECIFY                                                  0101 00184000
*        (R1,                                                      0101 00185000
*         R15) RESTRICTED;                                         0101 00186000
*       R15=RETNCODE;               /* LOAD ERROR INDICATION         */ 00187000
         L     R15,RETNCODE                                        0102 00188000
*       R1=ZEROBZER;                /* LOAD ABEND CODE               */ 00189000
         LA    R1,176                                              0103 00190000
*       GEN(ABEND (1),,,SYSTEM);    /* ISSUE 0B0 ABEND               */ 00191000
         ABEND (1),,,SYSTEM                                             00192000
*       RESPECIFY                                                  0105 00193000
*        (R1,                                                      0105 00194000
*         R15) UNRESTRICTED;                                       0105 00195000
*     END;                                                         0106 00196000
*   GEN REFS(CALLRKEY,RETNCODE);                                   0107 00197000
@RF00099 DS    0H                                                  0107 00198000
*                                     /*                                00199000
*        THE EPILOG CODE MUST BE CODED IN ASSEMBLER BECAUSE    YM08504  00200000
*        EITHER THE 'IN USE' FLAG MUST BE TURNED OFF OR THE    YM08504  00201000
*        WORK AREA WAS A TEMPORARY ONE AND MUST BE FREED.      YM08504  00202000
         L     R4,RETNCODE         SAVE RETURN CODE            YM08504  00203000
         IC    @02,CALLRKEY        SAVE CALLER'S PROTECT KEY   YM08504  00204000
         L     @13,SLOTBACK(,@13)  SAVE PTR. TO THE CALLER'S   YM08504  00205000
*                                  SAVE AREA                   YM08504  00206000
         LA    @01,WKPFEX                                      YM08504  00207000
         SR    @11,@01             SUBTRACT SIZE OF PREFIX TO  YM08504  00208000
*                                  POINT TO ACTUAL BEGINNING   YM08504  00209000
*                                  OF WORK AREA                YM08504  00210000
         TM    FLAGS(@11),MUSTFREE CHECK WHETHER AREA IS TO BE YM08504  00211000
*                                  FREED                       YM08504  00212000
         BO    GOFREE              YES, GO FREE                YM08504  00213000
         NI    FLAGS(@11),X'FF'-INUSE DO NOT FREE, TURN OFF IN YM08504  00214000
*                                  USE FLAG                    YM08504  00215000
         B     EPILOG              SKIP ELSE CLAUSE            YM08504  00216000
GOFREE   EQU   *                                               YM08504  00217000
         L     @00,SPSIZE(,@11)                                YM08504  00218000
         FREEMAIN R,LV=(0),A=(@11)                             YM08504  00219000
EPILOG   EQU   *                                               YM08504  00220000
         MODESET KEYADDR=(2)       SET CALLER'S KEY            YM08504  00221000
         LR    @15,R4              SET RETURN CODE             YM08504  00222000
         L     @14,SLOTR14(,@13)   RESTORE REGISTERS           YM08504  00223000
         LM    @00,@12,SLOTR0(@13)                             YM08504  00224000
         BR    @14                 RETURN                      YM08504  00225000
*                                                                  0108 00226000
*/********************************************************************/ 00227000
*/* THIS IS THE INTERNAL PROCEDURE THAT DOES THE ASSIGNS AND ASSIGN/ */ 00228000
*/* STARTS.  IT GETS THE ASSIGN COUNT FROM THE QMPA.  IF IT IS AN    */ 00229000
*/* ASSIGN/START IT SETS THE RELATIVE BLOCK NUMBER IN THE QMPA TO 0. */ 00230000
*/* THIS FIELD IS INCREMENTED BEFORE EACH ASSIGN SO THAT THE FIRST   */ 00231000
*/* BLOCK IS ASSIGNED AN RBN OF 1.  THERE IS A 4 BYTE EPA ENTRY      */ 00232000
*/* FOR EACH BLOCK TO BE ASSIGNED. IT WILL RECEIVE THE SVA FOR THAT  */ 00233000
*/* BLOCK. FOR EACH BLOCK TO BE                                      */ 00234000
*/* ASSIGNED, A 192 BYTE GETMAIN IS ISSUED FOR THE SUBPOOL AS        */ 00235000
*/* INDICATED BY THE QMPA. INFO IS PUT IN THE SWA PREFIX AND IN THE  */ 00236000
*/* CALLERS EPA. THE BLOCK SPACE IN SWA IS NOT CLEARED. THE ONLY     */ 00237000
*/* ERROR CONDITION IS A 0 COUNT FOR AN ASSIGN REQUEST. IN THAT      */ 00238000
*/* CASE RETNCODE IS SET TO AN ERROR VALUE FOR PROCESSING BY THE     */ 00239000
*/* EXTERNAL PROCEDURE.                                              */ 00240000
*/********************************************************************/ 00241000
*                                                                  0108 00242000
*QB550AST:                                                         0108 00243000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* ASSIGN PROCEDURE        Y02669*/ 00244000
QB550AST DS    0H                                                  0109 00245000
*   RFY                                                            0109 00246000
*    (R14) RSTD;                    /*                        YM08414*/ 00247000
*   EPAPTR=QMPACL;                  /* SET EPA BASE POINTER          */ 00248000
         L     EPAPTR,QMPACL-1(,QMPAPTR)                           0110 00249000
         LA    EPAPTR,0(,EPAPTR)                                   0110 00250000
*   ASGNCNT=(QMPCMNC&FOXZERO)/SIXTEEN;/* GET # OF BLOCKS             */ 00251000
         LA    @00,240                                             0111 00252000
         SLR   ASGNCNT,ASGNCNT                                     0111 00253000
         IC    ASGNCNT,QMPCMNC(,QMPAPTR)                           0111 00254000
         NR    @00,ASGNCNT                                         0111 00255000
         SRL   @00,4                                               0111 00256000
         LR    ASGNCNT,@00                                         0111 00257000
*   GEN(MODESET EXTKEY=SUPR);       /* SWITCH TO SUPERVISOR KEY      */ 00258000
         MODESET EXTKEY=SUPR                                            00259000
*   IF QMPOP=ASGNST THEN            /* IF ASSIGN/START               */ 00260000
         CLI   QMPOP(QMPAPTR),X'00'                                0113 00261000
         BNE   @RF00113                                            0113 00262000
*     QMRBN=ZERO;                   /* SET RBN TO INDICATE START OF A   00263000
*                                      JOB                           */ 00264000
         SLR   @15,@15                                             0114 00265000
         ST    @15,QMRBN(,QMPAPTR)                                 0114 00266000
*   GEN(MODESET EXTKEY=SCHED);      /* SWITCH BACK TO SCHEDULER KEY  */ 00267000
@RF00113 DS    0H                                                  0115 00268000
         MODESET EXTKEY=SCHED                                           00269000
*   IF QMPOP=ASSIGN&                /* IF ASSIGN REQUEST             */ 00270000
*       ASGNCNT=ZERO THEN           /* AND ASSIGN COUNT = 0          */ 00271000
         CLI   QMPOP(QMPAPTR),X'01'                                0116 00272000
         BNE   @RF00116                                            0116 00273000
         LTR   ASGNCNT,ASGNCNT                                     0116 00274000
         BNZ   @RF00116                                            0116 00275000
*     RETNCODE=INVCOUNT;            /* THIS IS AN ERROR CONDITION    */ 00276000
         LA    @15,20                                              0117 00277000
         ST    @15,RETNCODE                                        0117 00278000
*   DO WHILE ASGNCNT¬=ZERO;         /* LOOP CONTROL                  */ 00279000
@RF00116 B     @DE00118                                            0118 00280000
@DL00118 DS    0H                                                  0119 00281000
*     LNGTH=BLKLNGTH+SWPRELNG;      /* BLOCK LENGTH + SWA PREFIX   0119 00282000
*                                      LENGTH                        */ 00283000
         MVC   LNGTH(3),@CF00949+1                                 0119 00284000
*     SPNUM=QMSWSP;                 /* GET SUBPOOL NUMBER FROM QMPA  */ 00285000
         MVC   SPNUM(1),QMSWSP(QMPAPTR)                            0120 00286000
*     RESPECIFY                                                    0121 00287000
*      (R0,                                                        0121 00288000
*       R1) RESTRICTED;             /* RESTRICT FOR GETMAIN          */ 00289000
*     R0=GETFREES;                  /* LOAD INTO REGISTER 0          */ 00290000
         L     R0,GETFREES                                         0122 00291000
*     GEN(GETMAIN R,LV=(0));        /* GET SPACE FOR 1 BLOCK AND   0123 00292000
*                                      BLOCK PREFIX                  */ 00293000
         GETMAIN R,LV=(0)                                               00294000
*     SPFXPTR=R1;                   /* INTIALIZE SWA PREFIX PTR.     */ 00295000
         LR    SPFXPTR,R1                                          0124 00296000
*     GOTSPACE=R1;                  /* SAVE FOR USE AS 3 BYTE SVA    */ 00297000
         ST    R1,GOTSPACE                                         0125 00298000
*     GEN(MODESET KEYADDR=CALLRKEY,WORKREG=1);/* SWITCH TO CALLERS 0126 00299000
*                                      KEY TO STORE IN HIS EPA       */ 00300000
         MODESET KEYADDR=CALLRKEY,WORKREG=1                             00301000
*     RESPECIFY                                                    0127 00302000
*      (R0,                                                        0127 00303000
*       R1) UNRESTRICTED;                                          0127 00304000
*     SWASNVA=SWPREADR;             /* PUT SVA IN CALLERS EPA        */ 00305000
         MVC   SWASNVA(3,EPAPTR),SWPREADR                          0128 00306000
*     SWASNZO=ZERO;                 /* ZERO OUT LOW ORDER BYTE       */ 00307000
         MVI   SWASNZO(EPAPTR),X'00'                               0129 00308000
*     GEN(MODESET EXTKEY=SUPR);     /* SWITCH TO KEY 0 TO STORE INTO    00309000
*                                      THE QMPA                      */ 00310000
         MODESET EXTKEY=SUPR                                            00311000
*     TEMPSAV1=QMRBN;               /* PICK UP CURRENT RBN FROM QMPA */ 00312000
         L     TEMPSAV1,QMRBN(,QMPAPTR)                            0131 00313000
*LOOP:                                                             0132 00314000
*     TEMPSAV2=TEMPSAV1+ONE;        /* INCREMENT IT BY ONE           */ 00315000
LOOP     LA    TEMPSAV2,1                                          0132 00316000
         ALR   TEMPSAV2,TEMPSAV1                                   0132 00317000
*     CS(TEMPSAV1,TEMPSAV2,QMRBN);  /* REPLACE RBN FIELD OF QMPA IF     00318000
*                                      IT HASN'T BEEN UPDATED SINCE     00319000
*                                      IT WAS LOADED INTO TEMPSAV1   */ 00320000
         CS    TEMPSAV1,@02,QMRBN(QMPAPTR)                         0133 00321000
*     BC(4,LOOP);                   /* IF THE SWAP WASN'T MADE GO  0134 00322000
*                                      BACK AND TRY AGAIN            */ 00323000
         BC    4,LOOP                                              0134 00324000
*     GEN(MODESET EXTKEY=SCHED);    /* SWITCH BACK TO KEY 1          */ 00325000
         MODESET EXTKEY=SCHED                                           00326000
*     SWAPFX=(SWAPFX&&SWAPFX);      /* CLEAR SWA PREFIX              */ 00327000
         XC    SWAPFX(16,SPFXPTR),SWAPFX(SPFXPTR)                  0136 00328000
*     SWPRBN=TEMPSAV2;              /* PUT RBN IN SWA PREFIX         */ 00329000
         ST    TEMPSAV2,SWPRBN(,SPFXPTR)                           0137 00330000
*     SWPVA=SWPREADR;               /* PUT SELF SVA IN SWA PREFIX    */ 00331000
         MVC   SWPVA(3,SPFXPTR),SWPREADR                           0138 00332000
*     SWPLNGTH=BLKLNGTH;            /* PUT LENGTH IN SWA PREFIX      */ 00333000
         MVC   SWPLNGTH(3,SPFXPTR),@CF00854+1                      0139 00334000
*     EPAPTR=EPAPTR+FOUR;           /* UP EPA POINTER TO NEXT ENTRY  */ 00335000
         AL    EPAPTR,@CF00058                                     0140 00336000
*     ASGNCNT=ASGNCNT-ONE;          /* DECREMENT ASSIGN COUNT        */ 00337000
         BCTR  ASGNCNT,0                                           0141 00338000
*   END;                                                           0142 00339000
@DE00118 LTR   ASGNCNT,ASGNCNT                                     0142 00340000
         BNZ   @DL00118                                            0142 00341000
*   RFY                                                            0143 00342000
*    (R14) UNRSTD;                  /*                        YM08414*/ 00343000
*   END QB550AST;                   /* END OF ASSIGN PROCEDURE       */ 00344000
@EL00002 DS    0H                                                  0144 00345000
@EF00002 DS    0H                                                  0144 00346000
@ER00002 BR    @14                                                 0144 00347000
*                                                                  0145 00348000
*/********************************************************************/ 00349000
*/* THIS IS THE INTERNAL PROCEDURE THAT DOES THE WRITES (MOVES INTO  */ 00350000
*/* SWA). THE WRITE COUNT IS PICKED UP FROM THE QMPA. THE EPA        */ 00351000
*/* ADDRESS IS ALSO PICKED UP FROM THE QMPA. THERE MUST BE ONE       */ 00352000
*/* EIGHT BYTE ENTRY IN THE EPA FOR EACH BLOCK TO BE WRITTEN.  IT    */ 00353000
*/* CONTAINS THE ADDRESS OF THE BLOCK TO BE MOVED, THE SVA THAT WAS  */ 00354000
*/* GIVEN AT ASSIGN TIME AND THE ID OF THE BLOCK, IF THIS IS THE     */ 00355000
*/* FIRST TIME THAT THIS BLOCK WAS WRITTEN.  HOWEVER, IF THE BLOCK   */ 00356000
*/* HAS AN EMBEDDED ID THIS FIELD MAY BE 0.  WHEN ALL THE BLOCKS     */ 00357000
*/* HAVE BEEN WRITTEN, THE JOURNAL ROUTINE IS CALLED. IF ANY ERROR   */ 00358000
*/* CONDITION IS DETECTED, RETNCODE WILL BE SET TO THE APPROPRIATE   */ 00359000
*/* VALUE FOR PROCESSING BY THE EXTERNAL PROCEDURE. THE OPERATION    */ 00360000
*/* WILL BE TERMINATED AT THAT POINT.                                */ 00361000
*/********************************************************************/ 00362000
*                                                                  0145 00363000
*QB550WRT:                                                         0145 00364000
*   PROC;                           /* WRITE PROCEDURE               */ 00365000
QB550WRT STM   @14,@12,@SA00003                                    0145 00366000
*   RDWRTCNT=(QMPCMNC&ZEROFOX);     /* GET WRITE COUNT               */ 00367000
         LA    RDWRTCNT,15                                         0146 00368000
         SLR   @10,@10                                             0146 00369000
         IC    @10,QMPCMNC(,QMPAPTR)                               0146 00370000
         NR    RDWRTCNT,@10                                        0146 00371000
*   EPAPTR=QMPACL;                  /* SET EPA BASE POINTER          */ 00372000
         L     EPAPTR,QMPACL-1(,QMPAPTR)                           0147 00373000
         LA    EPAPTR,0(,EPAPTR)                                   0147 00374000
*   IF RDWRTCNT=ZERO THEN                                          0148 00375000
         LTR   RDWRTCNT,RDWRTCNT                                   0148 00376000
         BNZ   @RF00148                                            0148 00377000
*     RETNCODE=INVCOUNT;            /* WRITE 0 BLOCKS IS INVALID     */ 00378000
         LA    @10,20                                              0149 00379000
         ST    @10,RETNCODE                                        0149 00380000
*   ELSE                                                           0150 00381000
*     DO WHILE(RDWRTCNT¬=ZERO&      /* SET UP LOOP CONTROL           */ 00382000
*           RETNCODE=ZERO);         /* ESCAPE HATCH FOR ERROR        */ 00383000
         B     @RC00148                                            0150 00384000
@RF00148 B     @DE00150                                            0150 00385000
@DL00150 DS    0H                                                  0151 00386000
*       SPFXPTR=SWROWVA;            /* SET UP SWA PREFIX POINTER     */ 00387000
         SLR   @10,@10                                             0151 00388000
         ICM   @10,7,SWROWVA(EPAPTR)                               0151 00389000
         LR    SPFXPTR,@10                                         0151 00390000
*       IF SWROWVA¬=SWPVA THEN      /* IS SVA INVALID                */ 00391000
         L     @06,SWPVA-1(,SPFXPTR)                               0152 00392000
         LA    @06,0(,@06)                                         0152 00393000
         CR    @10,@06                                             0152 00394000
         BE    @RF00152                                            0152 00395000
*         RETNCODE=INVSVA;          /* YES, SET ERROR CODE           */ 00396000
         LA    @10,8                                               0153 00397000
         ST    @10,RETNCODE                                        0153 00398000
*       ELSE                                                       0154 00399000
*         DO;                                                      0154 00400000
         B     @RC00152                                            0154 00401000
@RF00152 DS    0H                                                  0155 00402000
*           IF SWPLNGTH¬=BLKLNGTH THEN/* LENGTH O.K.                 */ 00403000
         CLC   SWPLNGTH(3,SPFXPTR),@CF00854+1                      0155 00404000
         BE    @RF00155                                            0155 00405000
*             RETNCODE=INVLNGTH;    /* NO, SET ERROR CODE            */ 00406000
         LA    @10,16                                              0156 00407000
         ST    @10,RETNCODE                                        0156 00408000
*           ELSE                                                   0157 00409000
*             DO;                                                  0157 00410000
         B     @RC00155                                            0157 00411000
@RF00155 DS    0H                                                  0158 00412000
*               IF SWPWRT='0'B THEN /* HAS BLOCK BEEN WRITTEN        */ 00413000
         TM    SWPWRT(SPFXPTR),B'10000000'                         0158 00414000
         BNZ   @RF00158                                            0158 00415000
*                 DO;               /* NO                            */ 00416000
*                   IF SWWRTID=CHARZERO THEN/* IS ID BEING PASSED    */ 00417000
         CLI   SWWRTID(EPAPTR),X'00'                               0160 00418000
         BNE   @RF00160                                            0160 00419000
*                     TEMPID=EMBBLKID;/* NO - GET IT FROM BLOCK      */ 00420000
         L     @10,SWBUFPTR(,EPAPTR)                               0161 00421000
         MVC   TEMPID(1),EMBBLKID(@10)                             0161 00422000
*                   ELSE                                           0162 00423000
*                     TEMPID=SWWRTID;/* YES - TAKE IT FROM EPA       */ 00424000
         B     @RC00160                                            0162 00425000
@RF00160 MVC   TEMPID(1),SWWRTID(EPAPTR)                           0162 00426000
*                   FOUND=ZERO;     /* INITIALIZE TO NOT FOUND       */ 00427000
@RC00160 SLR   FOUND,FOUND                                         0163 00428000
*                   DO I=1 TO TBLSIZE WHILE(FOUND=ZERO);/* SEARCH  0164 00429000
*                                      TABLE FOR ID                  */ 00430000
         LA    I,1                                                 0164 00431000
@DL00164 C     FOUND,@CF00111                                      0164 00432000
         BNE   @DC00164                                            0164 00433000
*                     IF TEMPID=BLOCKID(I) THEN/* FOR A MATCH        */ 00434000
         LA    @10,BLOCKID-1(I)                                    0165 00435000
         CLC   TEMPID(1),0(@10)                                    0165 00436000
         BNE   @RF00165                                            0165 00437000
*                       DO;                                        0166 00438000
*                         FOUND=ONE;/* INDICATE FOUND                */ 00439000
         LA    FOUND,1                                             0167 00440000
*                         SWPID=TEMPID;/* PUT ID IN SWA PREFIX       */ 00441000
         MVC   SWPID(1,SPFXPTR),TEMPID                             0168 00442000
*                         SWPACRO=TABLE(I);/* PUT ACRONYM IN PREFIX  */ 00443000
         LR    @10,I                                               0169 00444000
         SLA   @10,2                                               0169 00445000
         LA    @01,TABLE-4(@10)                                    0169 00446000
         MVC   SWPACRO(4,SPFXPTR),0(@01)                           0169 00447000
*                         SWPWRT='1'B;/* INDICATE WRITTEN            */ 00448000
         OI    SWPWRT(SPFXPTR),B'10000000'                         0170 00449000
*                       END;                                       0171 00450000
*                   END;                                           0172 00451000
@RF00165 AL    I,@CF00045                                          0172 00452000
         C     I,@CF00887                                          0172 00453000
         BNH   @DL00164                                            0172 00454000
@DC00164 DS    0H                                                  0173 00455000
*                   IF FOUND=ZERO THEN/* DID WE FIND A MATCHING ID   */ 00456000
         C     FOUND,@CF00111                                      0173 00457000
         BNE   @RF00173                                            0173 00458000
*                     RETNCODE=INVID;/* NO - IT MUST BE INVALID      */ 00459000
         LA    @10,28                                              0174 00460000
         ST    @10,RETNCODE                                        0174 00461000
*                 END;                                             0175 00462000
@RF00173 DS    0H                                                  0176 00463000
*               IF RETNCODE=ZERO THEN/* IF NO ERROR DETECTED YET     */ 00464000
@RF00158 L     @10,RETNCODE                                        0176 00465000
         LTR   @10,@10                                             0176 00466000
         BNZ   @RF00176                                            0176 00467000
*                 DO;                                              0177 00468000
*                   SWABLOCK=USERBUF;/* MOVE BLOCK TO SWA            */ 00469000
         L     @10,SWBUFPTR(,EPAPTR)                               0178 00470000
         MVC   SWABLOCK+16(176,SPFXPTR),USERBUF(@10)               0178 00471000
*                   RDWRTCNT=RDWRTCNT-ONE;/* DECREMENT WRITE COUNT   */ 00472000
         BCTR  RDWRTCNT,0                                          0179 00473000
*                   EPAPTR=EPAPTR+EIGHT;/* MOVE TO NEXT EPA ENTRY    */ 00474000
         AL    EPAPTR,@CF00042                                     0180 00475000
*                 END;                                             0181 00476000
*             END;                                                 0182 00477000
@RF00176 DS    0H                                                  0183 00478000
*         END;                                                     0183 00479000
@RC00155 DS    0H                                                  0184 00480000
*     END;                                                         0184 00481000
@RC00152 DS    0H                                                  0184 00482000
@DE00150 SLR   @10,@10                                             0184 00483000
         CR    RDWRTCNT,@10                                        0184 00484000
         BE    @DC00150                                            0184 00485000
         C     @10,RETNCODE                                        0184 00486000
         BE    @DL00150                                            0184 00487000
@DC00150 DS    0H                                                  0185 00488000
*   IF RETNCODE=ZERO THEN           /* WERE ANY PARAMETERS INVALID   */ 00489000
@RC00148 L     @10,RETNCODE                                        0185 00490000
         LTR   @10,@10                                             0185 00491000
         BNZ   @RF00185                                            0185 00492000
*     DO;                           /* NO                            */ 00493000
*       JNLPTR=ADDR(PARMLST);       /* SET BASE FOR JNLPARM          */ 00494000
         LA    JNLPTR,PARMLST                                      0187 00495000
*       JNLPARM=(JNLPARM&&JNLPARM); /* CLEAR PARM LIST               */ 00496000
         XC    JNLPARM(16,JNLPTR),JNLPARM(JNLPTR)                  0188 00497000
*       JNLSWAMI='1'B;              /* INDICATE SWA MOVE MODE        */ 00498000
         OI    JNLSWAMI(JNLPTR),B'10000000'                        0189 00499000
*       JNLPPTRX=QMPAPTR;           /* SET UP JOURNAL PARAMETER      */ 00500000
         ST    QMPAPTR,JNLPPTRX(,JNLPTR)                           0190 00501000
*       CALL IEFXB500(PARMLST);     /* CALL JOURNAL WRITE            */ 00502000
         LA    @10,PARMLST                                         0191 00503000
         ST    @10,@AL00001                                        0191 00504000
         L     @15,@CV00809                                        0191 00505000
         LA    @01,@AL00001                                        0191 00506000
         BALR  @14,@15                                             0191 00507000
*     END;                                                         0192 00508000
*   END QB550WRT;                   /* END OF WRITE PROCEDURE        */ 00509000
@EL00003 DS    0H                                                  0193 00510000
@EF00003 DS    0H                                                  0193 00511000
@ER00003 LM    @14,@12,@SA00003                                    0193 00512000
         BR    @14                                                 0193 00513000
*                                                                  0194 00514000
*/********************************************************************/ 00515000
*/* THIS IS THE INTERNAL PROCEDURE THAT DOES THE READS (MOVES BLOCKS */ 00516000
*/* FROM SWA TO THE CALLERS BUFFERS). THE READ COUNT AND THE EPA     */ 00517000
*/* ADDRESS ARE PICKED UP FROM THE QMPA. THERE MUST BE ONE 8 BYTE    */ 00518000
*/* EPA ENTRY FOR EACH BLOCK TO BE READ. IT CONTAINS THE ADDRESS     */ 00519000
*/* OF THE BUFFER, TO WHICH THE BLOCK WILL BE MOVED, AND THE SVA     */ 00520000
*/* OF THE BLOCK. THE BLOCK WILL BE MOVED INTO THE SPECIFIED BUFFER. */ 00521000
*/* THE BLOCK ID WILL BE PLACED IN THE EPA. IF ANY ERROR IS DETECTED */ 00522000
*/* RETNCODE WILL BE SET TO AN APPROPRIATE VALUE FOR PROCESSING BY   */ 00523000
*/* THE EXTERNAL PROCEDURE. THE OPERATION WILL BE TERMINATED AT THAT */ 00524000
*/* POINT.                                                           */ 00525000
*/********************************************************************/ 00526000
*                                                                  0194 00527000
*QB550RD:                                                          0194 00528000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* READ PROCEDURE          Y02669*/ 00529000
QB550RD  DS    0H                                                  0195 00530000
*   RFY                                                            0195 00531000
*    (R14) RSTD;                    /*                        YM08414*/ 00532000
*   RDWRTCNT=(QMPCMNC&ZEROFOX);     /* GET READ COUNT                */ 00533000
         LA    RDWRTCNT,15                                         0196 00534000
         SLR   @15,@15                                             0196 00535000
         IC    @15,QMPCMNC(,QMPAPTR)                               0196 00536000
         NR    RDWRTCNT,@15                                        0196 00537000
*   EPAPTR=QMPACL;                  /* SET EPA BASE POINTER          */ 00538000
         L     EPAPTR,QMPACL-1(,QMPAPTR)                           0197 00539000
         LA    EPAPTR,0(,EPAPTR)                                   0197 00540000
*   IF RDWRTCNT=ZERO THEN                                          0198 00541000
         LTR   RDWRTCNT,RDWRTCNT                                   0198 00542000
         BNZ   @RF00198                                            0198 00543000
*     RETNCODE=INVCOUNT;            /* READ 0 BLOCKS IS INVALID      */ 00544000
         LA    @15,20                                              0199 00545000
         ST    @15,RETNCODE                                        0199 00546000
*   ELSE                                                           0200 00547000
*     DO WHILE(RDWRTCNT¬=ZERO&      /* SET UP LOOP CONTROL           */ 00548000
*           RETNCODE=ZERO);         /* ESCAPE HATCH FOR ERROR        */ 00549000
         B     @RC00198                                            0200 00550000
@RF00198 B     @DE00200                                            0200 00551000
@DL00200 DS    0H                                                  0201 00552000
*       SPFXPTR=SWROWVA;            /* SET UP SWA PREFIX POINTER     */ 00553000
         SLR   @15,@15                                             0201 00554000
         ICM   @15,7,SWROWVA(EPAPTR)                               0201 00555000
         LR    SPFXPTR,@15                                         0201 00556000
*       IF SWROWVA¬=SWPVA THEN      /* IS SVA INVALID                */ 00557000
         L     @10,SWPVA-1(,SPFXPTR)                               0202 00558000
         LA    @10,0(,@10)                                         0202 00559000
         CR    @15,@10                                             0202 00560000
         BE    @RF00202                                            0202 00561000
*         RETNCODE=INVSVA;          /* YES, SET ERROR CODE           */ 00562000
         LA    @15,8                                               0203 00563000
         ST    @15,RETNCODE                                        0203 00564000
*       ELSE                                                       0204 00565000
*         IF SWPWRT='0'B THEN       /* HAS BLOCK BEEN WRITTEN        */ 00566000
         B     @RC00202                                            0204 00567000
@RF00202 TM    SWPWRT(SPFXPTR),B'10000000'                         0204 00568000
         BNZ   @RF00204                                            0204 00569000
*           RETNCODE=INVREAD;       /* NO, SET ERROR CODE            */ 00570000
         LA    @15,12                                              0205 00571000
         ST    @15,RETNCODE                                        0205 00572000
*         ELSE                                                     0206 00573000
*           IF SWPLNGTH¬=BLKLNGTH THEN/* IS LENGTH OTHER THAN 176    */ 00574000
         B     @RC00204                                            0206 00575000
@RF00204 CLC   SWPLNGTH(3,SPFXPTR),@CF00854+1                      0206 00576000
         BE    @RF00206                                            0206 00577000
*             RETNCODE=INVLNGTH;    /* YES, SET ERROR CODE           */ 00578000
         LA    @15,16                                              0207 00579000
         ST    @15,RETNCODE                                        0207 00580000
*           ELSE                                                   0208 00581000
*             DO;                   /* EVERYTHING IS VALID           */ 00582000
         B     @RC00206                                            0208 00583000
@RF00206 DS    0H                                                  0209 00584000
*               RESPECIFY                                          0209 00585000
*                (R2) RESTRICTED;   /* RESTRICT FOR MODESET USAGE    */ 00586000
*               GEN(MODESET KEYADDR=CALLRKEY,WORKREG=2);/* SWITCH TO    00587000
*                                      CALLERS KEY TO MOVE BLOCK AND    00588000
*                                      PUT ID IN EPA                 */ 00589000
         MODESET KEYADDR=CALLRKEY,WORKREG=2                             00590000
*               RESPECIFY                                          0211 00591000
*                (R2) UNRESTRICTED; /* RELEASE FOR PLS USE           */ 00592000
*               SWWRTID=SWPID;      /* INSERT BLOCK ID IN EPA        */ 00593000
         MVC   SWWRTID(1,EPAPTR),SWPID(SPFXPTR)                    0212 00594000
*               USERBUF=SWABLOCK;   /* MOVE BLOCK TO USERS BUFFER    */ 00595000
         L     @15,SWBUFPTR(,EPAPTR)                               0213 00596000
         MVC   USERBUF(176,@15),SWABLOCK+16(SPFXPTR)               0213 00597000
*               GEN(MODESET EXTKEY=SCHED);/* SWITCH BACK TO KEY 1    */ 00598000
         MODESET EXTKEY=SCHED                                           00599000
*               RDWRTCNT=RDWRTCNT-ONE;/* DECREMENT READ COUNT        */ 00600000
         BCTR  RDWRTCNT,0                                          0215 00601000
*               EPAPTR=EPAPTR+EIGHT;/* MOVE TO NEXT EPA ENTRY        */ 00602000
         AL    EPAPTR,@CF00042                                     0216 00603000
*             END;                                                 0217 00604000
*     END;                                                         0218 00605000
@RC00206 DS    0H                                                  0218 00606000
@RC00204 DS    0H                                                  0218 00607000
@RC00202 DS    0H                                                  0218 00608000
@DE00200 SLR   @15,@15                                             0218 00609000
         CR    RDWRTCNT,@15                                        0218 00610000
         BE    @DC00200                                            0218 00611000
         C     @15,RETNCODE                                        0218 00612000
         BE    @DL00200                                            0218 00613000
@DC00200 DS    0H                                                  0219 00614000
*   RFY                                                            0219 00615000
*    (R14) UNRSTD;                  /*                        YM08414*/ 00616000
*   END QB550RD;                    /* END OF READ PROCEDURE         */ 00617000
@EL00004 DS    0H                                                  0220 00618000
@EF00004 DS    0H                                                  0220 00619000
@ER00004 BR    @14                                                 0220 00620000
*                                                                  0221 00621000
*/********************************************************************/ 00622000
*/* THIS IS THE INTERNAL PROCEDURE THAT DOES A DELETE. THE SUBPOOL   */ 00623000
*/* NUMBER IS GOTTEN FROM THE QMPA AND A FREE SUBPOOL IS ISSUED.     */ 00624000
*/* THERE ARE NO ERROR CONDITIONS TESTED. THE FREEMAIN IS            */ 00625000
*/* UNCONDITIONAL.                                                   */ 00626000
*/********************************************************************/ 00627000
*                                                                  0221 00628000
*QB550DEL:                                                         0221 00629000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* DELETE PROCEDURE        Y02669*/ 00630000
QB550DEL DS    0H                                                  0222 00631000
*   RFY                                                            0222 00632000
*    (R14) RSTD;                    /*                        YM08414*/ 00633000
*   LNGTH=ZERO;                     /* MUST BE 0 FOR FREE SUBPOOL    */ 00634000
         SLR   @15,@15                                             0223 00635000
         STCM  @15,7,LNGTH                                         0223 00636000
*   SPNUM=QMSWSP;                   /* GET SUBPOOL # FROM QMPA       */ 00637000
         MVC   SPNUM(1),QMSWSP(QMPAPTR)                            0224 00638000
*   RESPECIFY                                                      0225 00639000
*    (R0) RESTRICTED;               /* RESTRICT REGISTER 0           */ 00640000
*   R0=GETFREES;                    /* LOAD REGISTER 0 FOR FREEMAIN  */ 00641000
         L     R0,GETFREES                                         0226 00642000
*   GEN(FREEMAIN R,SP=(0));         /* FREE SUBPOOL                  */ 00643000
         FREEMAIN R,SP=(0)                                              00644000
*   RESPECIFY                                                      0228 00645000
*    (R0) UNRESTRICTED;             /* FREE REGISTER 0               */ 00646000
*   RFY                                                            0229 00647000
*    (R14) UNRSTD;                  /*                        YM08414*/ 00648000
*   END QB550DEL;                   /* END OF DELETE PROCEDURE       */ 00649000
@EL00005 DS    0H                                                  0230 00650000
@EF00005 DS    0H                                                  0230 00651000
@ER00005 BR    @14                                                 0230 00652000
@PB00005 DS    0H                                                  0230 00653000
*   END IEFQB550                    /* END OF EXTERNAL PROCEDURE     */ 00654000
*                                                                  0231 00655000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00656000
*/*%INCLUDE SYSLIB  (IEFZB506)                                       */ 00657000
*/*%INCLUDE SYSLIB  (IEFZB502)                                       */ 00658000
*/*%INCLUDE SYSLIB  (IEFQMNGR)                                       */ 00659000
*/*%INCLUDE SYSLIB  (IEFZB507)                                       */ 00660000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00661000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00662000
*/*%INCLUDE SYSLIB  (IEFZB504)                                       */ 00663000
*                                                                  0231 00664000
*       ;                                                          0231 00665000
@DATA    DS    0H                                                       00666000
@DATD    DSECT                                                          00667000
         DS    0F                                                       00668000
@SA00001 DS    18F                                                      00669000
@SA00003 DS    0F                                                       00670000
         DS    15F                                                      00671000
@AL00001 DS    1A                                                       00672000
IEFQB550 CSECT                                                          00673000
         DS    0F                                                       00674000
@CF00111 DC    F'0'                                                     00675000
@CF00045 DC    F'1'                                                     00676000
@CF00058 DC    F'4'                                                     00677000
@CF00042 DC    F'8'                                                     00678000
@CF00887 DC    F'22'                                                    00679000
@CF00854 DC    F'176'                                                   00680000
@CF00949 DC    F'192'                                                   00681000
@DATD    DSECT                                                          00682000
         DS    0D                                                       00683000
RETNCODE DS    F                                                        00684000
GETFREES DS    FL4                                                      00685000
         ORG   GETFREES                                                 00686000
SPNUM    DS    CL1                                                      00687000
LNGTH    DS    AL3                                                      00688000
         ORG   GETFREES+4                                               00689000
GOTSPACE DS    FL4                                                      00690000
         ORG   GOTSPACE                                                 00691000
@NM00038 DS    CL1                                                      00692000
SWPREADR DS    CL3                                                      00693000
         ORG   GOTSPACE+4                                               00694000
CALLRKEY DS    FL1                                                      00695000
TEMPID   DS    CL1                                                      00696000
         DS    CL2                                                      00697000
PARMLST  DS    CL16                                                     00698000
IEFQB550 CSECT                                                          00699000
         DS    0F                                                       00700000
@SIZDATD DC    AL1(230)                                                 00701000
         DC    AL3(@ENDDATD-@DATD)                                      00702000
@CV00809 DC    V(IEFXB500)                                              00703000
         DS    0D                                                       00704000
BLOCKID  DC    X'00'                                                    00705000
         DC    X'01'                                                    00706000
         DC    X'02'                                                    00707000
         DC    X'03'                                                    00708000
         DC    X'07'                                                    00709000
         DC    X'0A'                                                    00710000
         DC    X'0C'                                                    00711000
         DC    X'0F'                                                    00712000
         DC    X'1B'                                                    00713000
         DC    X'1C'                                                    00714000
         DC    X'1D'                                                    00715000
         DC    X'20'                                                    00716000
         DC    X'21'                                                    00717000
         DC    X'22'                                                    00718000
         DC    X'23'                                                    00719000
         DC    X'25'                                                    00720000
         DC    X'26'                                                    00721000
         DC    X'27'                                                    00722000
         DC    X'28'                                                    00723000
         DC    X'29'                                                    00724000
         DC    X'30'                                                    00725000
         DC    X'31'                                                    00726000
TABLE    DC    CL4'JCT '                                                00727000
         DC    CL4'ACT '                                                00728000
         DC    CL4'SCT '                                                00729000
         DC    CL4'SIOT'                                                00730000
         DC    CL4'DSNT'                                                00731000
         DC    CL4'POT '                                                00732000
         DC    CL4'SCTX'                                                00733000
         DC    CL4'DSEN'                                                00734000
         DC    CL4'JMR '                                                00735000
         DC    CL4'JFCB'                                                00736000
         DC    CL4'JFCX'                                                00737000
         DC    CL4'PDID'                                                00738000
         DC    CL4'PDIB'                                                00739000
         DC    CL4'PDIQ'                                                00740000
         DC    CL4'GDGN'                                                00741000
         DC    CL4'IWAB'                                                00742000
         DC    CL4'VUT '                                                00743000
         DC    CL4'DDNT'                                                00744000
         DC    CL4'AMPX'                                                00745000
         DC    CL4'JFCE'                                                00746000
         DC    CL4'JCTX'                                                00747000
         DC    CL4'SSWA'                                                00748000
IEFQB550 CSECT                                                          00749000
*                                     /*                                00750000
WKPFEX   EQU   8                   LENGTH OF WORK AREA'S PREFIX Y02669  00751000
SPSIZE   EQU   0                   DISPLACEMENT IN PREFIX OF   YM08504  00752000
*                                  SP AND SIZE OF THIS WORK    YM08504  00753000
*                                  AREA                        YM08504  00754000
FLAGS    EQU   4                   DISP. OF FLAGS              YM08504  00755000
ZERO     EQU   0                   TO CLEAR FLAGS              YM08504  00756000
INUSE    EQU   X'80'               WORK AREA IS IN USE         YM08504  00757000
MUSTFREE EQU   X'40'               FREE THIS AREA ON EXIT      YM08504  00758000
SLOTBACK EQU   4                   SLOT IN REG SAVE AREA TO     Y02669  00759000
*                                  BACKWARD CHAIN SAVE AREAS    Y02669  00760000
SLOTFORE EQU   8                   SLOT IN REG SAVE AREA TO     Y02669  00761000
*                                  FOREWARD CHAIN SAVE AREAS    Y02669  00762000
SLOTR14  EQU   12                  SLOT IN REG SAVE AREA FOR    Y02669  00763000
*                                  R14                          Y02669  00764000
SLOTR0   EQU   20                  SLOT IN REG SAVE AREA FOR R0 Y02669  00765000
SLOTR1   EQU   24                  SLOT IN REG SAVE AREA FOR R1 Y02669  00766000
SPSZ50L  DC    A(@SIZDATD)         POINTER TO SIZE OF THIS     YM08504  00767000
*                                  MODULE'S WORK AREA, TO BE   YM08504  00768000
*                                  USED BY IEFQB555            YM08504  00769000
         ENTRY SPSZ50L                                         YM08504  00770000
SPSZ55N  DC    A(SPSZ55L)          PTR. TO WORD WITHIN         YM08504  00771000
*                                  IEFQB555 WHICH POINTS TO    YM08504  00772000
*                                  SIZE IT REQUIRES            YM08504  00773000
         EXTRN SPSZ55L                                         YM08504  00774000
IEFQB550 CSECT                                                          00775000
         DS   0H                                                        00776000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   00777000
@DATD    DSECT                                                          00778000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00779000
@ENDDATD EQU   *                                                        00780000
IEFQB550 CSECT                                                          00781000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00782000
@01      EQU   01                                                       00783000
@02      EQU   02                                                       00784000
@03      EQU   03                                                       00785000
@04      EQU   04                                                       00786000
@05      EQU   05                                                       00787000
@06      EQU   06                                                       00788000
@07      EQU   07                                                       00789000
@08      EQU   08                                                       00790000
@09      EQU   09                                                       00791000
@10      EQU   10                                                       00792000
@11      EQU   11                                                       00793000
@12      EQU   12                                                       00794000
@13      EQU   13                                                       00795000
@14      EQU   14                                                       00796000
@15      EQU   15                                                       00797000
TEMPSAV2 EQU   @02                                                      00798000
TEMPSAV1 EQU   @09                                                      00799000
RDWRTCNT EQU   @03                                                      00800000
ASGNCNT  EQU   @08                                                      00801000
I        EQU   @06                                                      00802000
FOUND    EQU   @02                                                      00803000
JNLPTR   EQU   @02                                                      00804000
QMPAPTR  EQU   @07                                                      00805000
SPFXPTR  EQU   @04                                                      00806000
EPAPTR   EQU   @05                                                      00807000
R0       EQU   @00                                                      00808000
R1       EQU   @01                                                      00809000
R2       EQU   @02                                                      00810000
R3       EQU   @03                                                      00811000
R4       EQU   @04                                                      00812000
R11      EQU   @11                                                      00813000
R14      EQU   @14                                                      00814000
R15      EQU   @15                                                      00815000
         ENTRY TABLE                                                    00816000
         ENTRY BLOCKID                                                  00817000
PSA      EQU   0                                                        00818000
FLCRNPSW EQU   PSA                                                      00819000
FLCROPSW EQU   PSA+8                                                    00820000
FLCICCW2 EQU   PSA+16                                                   00821000
PSAEEPSW EQU   PSA+132                                                  00822000
PSAESPSW EQU   PSA+136                                                  00823000
FLCSVILC EQU   PSAESPSW+1                                               00824000
PSAEPPSW EQU   PSA+140                                                  00825000
FLCPIILC EQU   PSAEPPSW+1                                               00826000
FLCPICOD EQU   PSAEPPSW+2                                               00827000
PSAPICOD EQU   FLCPICOD+1                                               00828000
FLCTEA   EQU   PSAEPPSW+4                                               00829000
FLCPER   EQU   PSA+152                                                  00830000
FLCMCLA  EQU   PSA+168                                                  00831000
FLCIOEL  EQU   FLCMCLA+4                                                00832000
FLCIOA   EQU   FLCMCLA+16                                               00833000
FLCFSA   EQU   FLCMCLA+80                                               00834000
PSATOLD  EQU   PSA+540                                                  00835000
PSASUPER EQU   PSA+552                                                  00836000
PSASUP1  EQU   PSASUPER                                                 00837000
PSASUP2  EQU   PSASUPER+1                                               00838000
PSASUP3  EQU   PSASUPER+2                                               00839000
PSASUP4  EQU   PSASUPER+3                                               00840000
PSACLHT  EQU   PSA+640                                                  00841000
PSALKSA  EQU   PSA+696                                                  00842000
PSAHLHI  EQU   PSA+760                                                  00843000
PSADSSFL EQU   PSA+836                                                  00844000
PSADSSF1 EQU   PSADSSFL                                                 00845000
PSADSSF3 EQU   PSADSSFL+2                                               00846000
PSADSSF4 EQU   PSADSSFL+3                                               00847000
PSARSVT  EQU   PSA+896                                                  00848000
SWAMMEPA EQU   0                                                        00849000
SWBUFPTR EQU   SWAMMEPA                                                 00850000
SWASNVA  EQU   SWBUFPTR                                                 00851000
SWASNZO  EQU   SWBUFPTR+3                                               00852000
SWROWVA  EQU   SWAMMEPA+4                                               00853000
SWWRTID  EQU   SWAMMEPA+7                                               00854000
SWAPFX   EQU   0                                                        00855000
SWPRBN   EQU   SWAPFX                                                   00856000
SWPSTA   EQU   SWAPFX+4                                                 00857000
SWPWRT   EQU   SWPSTA                                                   00858000
SWPVA    EQU   SWAPFX+5                                                 00859000
SWPID    EQU   SWAPFX+8                                                 00860000
SWPLNGTH EQU   SWAPFX+9                                                 00861000
SWPACRO  EQU   SWAPFX+12                                                00862000
QMPA     EQU   0                                                        00863000
QMNAM    EQU   QMPA                                                     00864000
QMPOP    EQU   QMPA+8                                                   00865000
QMSTA    EQU   QMPA+16                                                  00866000
QMPCL    EQU   QMPA+32                                                  00867000
QMPCMNC  EQU   QMPCL                                                    00868000
QMPCM    EQU   QMPCMNC                                                  00869000
QMPNC    EQU   QMPCMNC                                                  00870000
QMPACL   EQU   QMPCL+1                                                  00871000
SWAQMPA  EQU   0                                                        00872000
QMSWSP   EQU   SWAQMPA                                                  00873000
QMRBN    EQU   SWAQMPA+12                                               00874000
JNLPARM  EQU   0                                                        00875000
JNLPCALL EQU   JNLPARM                                                  00876000
JNLSWAMI EQU   JNLPCALL                                                 00877000
JNLPRTCD EQU   JNLPARM+1                                                00878000
JNLPPTRX EQU   JNLPARM+4                                                00879000
TCBFIX   EQU   0                                                        00880000
TCBFRS   EQU   TCBFIX                                                   00881000
TCB      EQU   0                                                        00882000
TCBPIE   EQU   TCB+4                                                    00883000
TCBPMASK EQU   TCBPIE                                                   00884000
TCBCMP   EQU   TCB+16                                                   00885000
TCBCMPF  EQU   TCBCMP                                                   00886000
TCBCPP   EQU   TCBCMPF                                                  00887000
TCBSTCC  EQU   TCBCMPF                                                  00888000
TCBCDBL  EQU   TCBCMPF                                                  00889000
TCBCWTO  EQU   TCBCMPF                                                  00890000
TCBCIND  EQU   TCBCMPF                                                  00891000
TCBCMSG  EQU   TCBCMPF                                                  00892000
TCBTRN   EQU   TCB+20                                                   00893000
TCBABF   EQU   TCBTRN                                                   00894000
TCBMSS   EQU   TCB+24                                                   00895000
TCBPKF   EQU   TCB+28                                                   00896000
TCBFLGS  EQU   TCB+29                                                   00897000
TCBFLGS1 EQU   TCBFLGS                                                  00898000
TCBFLGS2 EQU   TCBFLGS+1                                                00899000
TCBFLGS3 EQU   TCBFLGS+2                                                00900000
TCBFLGS4 EQU   TCBFLGS+3                                                00901000
TCBFLGS5 EQU   TCBFLGS+4                                                00902000
TCBABWF  EQU   TCBFLGS5                                                 00903000
TCBJPQ   EQU   TCB+44                                                   00904000
TCBPURGE EQU   TCBJPQ                                                   00905000
TCBGRS   EQU   TCB+48                                                   00906000
TCBFSA   EQU   TCB+112                                                  00907000
TCBTME   EQU   TCB+120                                                  00908000
TCBJSTCB EQU   TCB+124                                                  00909000
TCBTSFLG EQU   TCB+148                                                  00910000
TCBTSTSK EQU   TCBTSFLG                                                 00911000
TCBSTAB  EQU   TCB+160                                                  00912000
TCBNSTAE EQU   TCBSTAB                                                  00913000
TCBTCT   EQU   TCB+164                                                  00914000
TCBTCTGF EQU   TCBTCT                                                   00915000
TCBSCNDY EQU   TCB+172                                                  00916000
TCBNDSP  EQU   TCBSCNDY                                                 00917000
TCBNDSP1 EQU   TCBNDSP+1                                                00918000
TCBNDSP2 EQU   TCBNDSP+2                                                00919000
TCBNDSP3 EQU   TCBNDSP+3                                                00920000
TCBJSCB  EQU   TCB+180                                                  00921000
TCBRECDE EQU   TCBJSCB                                                  00922000
TCBEXT1  EQU   TCB+196                                                  00923000
TCBBITS  EQU   TCB+200                                                  00924000
TCBNDSP4 EQU   TCBBITS                                                  00925000
TCBNDSP5 EQU   TCBBITS+1                                                00926000
TCBFLGS6 EQU   TCBBITS+2                                                00927000
TCBFLGS7 EQU   TCBBITS+3                                                00928000
TCBDAR   EQU   TCB+204                                                  00929000
TCBDARC  EQU   TCBDAR                                                   00930000
TCBEXT2  EQU   TCB+208                                                  00931000
TCBFOE   EQU   TCB+244                                                  00932000
TCBESTAE EQU   TCB+264                                                  00933000
TCBESTRM EQU   TCBESTAE+1                                               00934000
TCBFBYT1 EQU   TCB+276                                                  00935000
TCBFBYT2 EQU   TCB+277                                                  00936000
TCBRV124 EQU   TCB+278                                                  00937000
TCBRV133 EQU   TCB+279                                                  00938000
TCBSWASA EQU   TCB+288                                                  00939000
TCBXTNT2 EQU   0                                                        00940000
TCBGTF   EQU   TCBXTNT2                                                 00941000
TCBTFLG  EQU   TCBGTF                                                   00942000
TCBRV146 EQU   TCBXTNT2+28                                              00943000
TCBRV155 EQU   TCBXTNT2+29                                              00944000
TCBRV164 EQU   TCBXTNT2+30                                              00945000
TCBRV173 EQU   TCBXTNT2+31                                              00946000
USERBUF  EQU   0                                                        00947000
EMBBLKID EQU   USERBUF+3                                                00948000
SWABLOCK EQU   0                                                        00949000
PSARSVTE EQU   PSARSVT                                                  00950000
FLC      EQU   PSA                                                      00951000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00952000
PSARSAV  EQU   PSARSVTE+60                                              00953000
PSARSTK  EQU   PSARSVTE+56                                              00954000
PSAESAV3 EQU   PSARSVTE+52                                              00955000
PSAESTK3 EQU   PSARSVTE+48                                              00956000
PSAESAV2 EQU   PSARSVTE+44                                              00957000
PSAESTK2 EQU   PSARSVTE+40                                              00958000
PSAESAV1 EQU   PSARSVTE+36                                              00959000
PSAESTK1 EQU   PSARSVTE+32                                              00960000
PSAPSAV  EQU   PSARSVTE+28                                              00961000
PSAPSTK  EQU   PSARSVTE+24                                              00962000
PSAMSAV  EQU   PSARSVTE+20                                              00963000
PSAMSTK  EQU   PSARSVTE+16                                              00964000
PSASSAV  EQU   PSARSVTE+12                                              00965000
PSASSTK  EQU   PSARSVTE+8                                               00966000
PSANSTK  EQU   PSARSVTE+4                                               00967000
PSACSTK  EQU   PSARSVTE                                                 00968000
@NM00037 EQU   USERBUF+4                                                00969000
@NM00036 EQU   USERBUF                                                  00970000
@NM00035 EQU   TCBXTNT2+32                                              00971000
TCBRV181 EQU   TCBRV173                                                 00972000
TCBRV180 EQU   TCBRV173                                                 00973000
TCBRV179 EQU   TCBRV173                                                 00974000
TCBRV178 EQU   TCBRV173                                                 00975000
TCBRV177 EQU   TCBRV173                                                 00976000
TCBRV176 EQU   TCBRV173                                                 00977000
TCBRV175 EQU   TCBRV173                                                 00978000
TCBRV174 EQU   TCBRV173                                                 00979000
TCBRV172 EQU   TCBRV164                                                 00980000
TCBRV171 EQU   TCBRV164                                                 00981000
TCBRV170 EQU   TCBRV164                                                 00982000
TCBRV169 EQU   TCBRV164                                                 00983000
TCBRV168 EQU   TCBRV164                                                 00984000
TCBRV167 EQU   TCBRV164                                                 00985000
TCBRV166 EQU   TCBRV164                                                 00986000
TCBRV165 EQU   TCBRV164                                                 00987000
TCBRV163 EQU   TCBRV155                                                 00988000
TCBRV162 EQU   TCBRV155                                                 00989000
TCBRV161 EQU   TCBRV155                                                 00990000
TCBRV160 EQU   TCBRV155                                                 00991000
TCBRV159 EQU   TCBRV155                                                 00992000
TCBRV158 EQU   TCBRV155                                                 00993000
TCBRV157 EQU   TCBRV155                                                 00994000
TCBRV156 EQU   TCBRV155                                                 00995000
TCBRV154 EQU   TCBRV146                                                 00996000
TCBRV153 EQU   TCBRV146                                                 00997000
TCBRV152 EQU   TCBRV146                                                 00998000
TCBRV151 EQU   TCBRV146                                                 00999000
TCBRV150 EQU   TCBRV146                                                 01000000
TCBRV149 EQU   TCBRV146                                                 01001000
TCBRV148 EQU   TCBRV146                                                 01002000
TCBRV147 EQU   TCBRV146                                                 01003000
TCBRV145 EQU   TCBXTNT2+26                                              01004000
TCBRV144 EQU   TCBXTNT2+24                                              01005000
TCBCAUF  EQU   TCBXTNT2+20                                              01006000
TCBRV142 EQU   TCBXTNT2+16                                              01007000
TCBRSV49 EQU   TCBXTNT2+12                                              01008000
TCBEVENT EQU   TCBXTNT2+8                                               01009000
TCBRCMP  EQU   TCBXTNT2+5                                               01010000
TCBRSVAB EQU   TCBXTNT2+4                                               01011000
TCBGTFA  EQU   TCBGTF+1                                                 01012000
TCBRSV47 EQU   TCBTFLG                                                  01013000
TCBRSV46 EQU   TCBTFLG                                                  01014000
TCBRSV45 EQU   TCBTFLG                                                  01015000
TCBRSV44 EQU   TCBTFLG                                                  01016000
TCBRSV43 EQU   TCBTFLG                                                  01017000
TCBDSPIT EQU   TCBTFLG                                                  01018000
TCBERRTN EQU   TCBTFLG                                                  01019000
TCBASYNC EQU   TCBTFLG                                                  01020000
@NM00034 EQU   TCB+296                                                  01021000
TCBSVCA2 EQU   TCB+292                                                  01022000
TCBDBTB  EQU   TCB+284                                                  01023000
TCBRPT   EQU   TCB+280                                                  01024000
TCBRV141 EQU   TCBRV133                                                 01025000
TCBRV140 EQU   TCBRV133                                                 01026000
TCBRV139 EQU   TCBRV133                                                 01027000
TCBRV138 EQU   TCBRV133                                                 01028000
TCBRV137 EQU   TCBRV133                                                 01029000
TCBRV136 EQU   TCBRV133                                                 01030000
TCBRV135 EQU   TCBRV133                                                 01031000
TCBRV134 EQU   TCBRV133                                                 01032000
TCBRV132 EQU   TCBRV124                                                 01033000
TCBRV131 EQU   TCBRV124                                                 01034000
TCBRV130 EQU   TCBRV124                                                 01035000
TCBRV129 EQU   TCBRV124                                                 01036000
TCBRV128 EQU   TCBRV124                                                 01037000
TCBRV127 EQU   TCBRV124                                                 01038000
TCBRV126 EQU   TCBRV124                                                 01039000
TCBRV125 EQU   TCBRV124                                                 01040000
TCBRV123 EQU   TCBFBYT2                                                 01041000
TCBRV122 EQU   TCBFBYT2                                                 01042000
TCBECBNV EQU   TCBFBYT2                                                 01043000
TCBSSSYN EQU   TCBFBYT2                                                 01044000
TCBFPRAP EQU   TCBFBYT2                                                 01045000
TCBFDW   EQU   TCBFBYT2                                                 01046000
TCBFMW   EQU   TCBFBYT2                                                 01047000
TCBCNCB  EQU   TCBFBYT2                                                 01048000
TCBLLH   EQU   TCBFBYT1                                                 01049000
TCBRV113 EQU   TCBFBYT1                                                 01050000
TCBEOT   EQU   TCBFBYT1                                                 01051000
TCBRTM2  EQU   TCBFBYT1                                                 01052000
TCBPGNLY EQU   TCBFBYT1                                                 01053000
TCBNDIOS EQU   TCBFBYT1                                                 01054000
TCBACTIV EQU   TCBFBYT1                                                 01055000
TCBEOTFM EQU   TCBFBYT1                                                 01056000
TCBAFFN  EQU   TCB+274                                                  01057000
TCBCCPVI EQU   TCB+272                                                  01058000
TCBUKYSP EQU   TCB+268                                                  01059000
TCBMODE  EQU   TCBESTAE+3                                               01060000
TCBERTYP EQU   TCBESTAE+2                                               01061000
TCBRV314 EQU   TCBESTRM                                                 01062000
TCBRV313 EQU   TCBESTRM                                                 01063000
TCBRV312 EQU   TCBESTRM                                                 01064000
TCBRV311 EQU   TCBESTRM                                                 01065000
TCBRV310 EQU   TCBESTRM                                                 01066000
TCBRV309 EQU   TCBESTRM                                                 01067000
TCBRV308 EQU   TCBESTRM                                                 01068000
TCBETERM EQU   TCBESTRM                                                 01069000
TCBSCBKY EQU   TCBESTAE                                                 01070000
TCBRTM12 EQU   TCB+260                                                  01071000
TCBTCBID EQU   TCB+256                                                  01072000
TCBRSV96 EQU   TCB+252                                                  01073000
TCBSWA   EQU   TCB+248                                                  01074000
TCBFOEA  EQU   TCBFOE+1                                                 01075000
TCBRSV42 EQU   TCBFOE                                                   01076000
TCBRV306 EQU   TCB+240                                                  01077000
TCBRSV41 EQU   TCB+239                                                  01078000
TCBTID   EQU   TCB+238                                                  01079000
TCBRSVAA EQU   TCB+237                                                  01080000
TCBABCUR EQU   TCB+236                                                  01081000
TCBTMSAV EQU   TCB+232                                                  01082000
TCBIOTIM EQU   TCB+228                                                  01083000
TCBRTWA  EQU   TCB+224                                                  01084000
TCBBACK  EQU   TCB+220                                                  01085000
TCBTIRB  EQU   TCB+216                                                  01086000
TCBAECB  EQU   TCB+212                                                  01087000
TCBEXT2A EQU   TCBEXT2+1                                                01088000
TCBRSV39 EQU   TCBEXT2                                                  01089000
TCBSTMCT EQU   TCB+207                                                  01090000
TCBSYSCT EQU   TCB+206                                                  01091000
TCBRSV37 EQU   TCB+205                                                  01092000
TCBEXSVC EQU   TCBDAR                                                   01093000
TCBDARMS EQU   TCBDAR                                                   01094000
TCBDARWT EQU   TCBDAR                                                   01095000
TCBDARO  EQU   TCBDAR                                                   01096000
TCBDARMC EQU   TCBDARC                                                  01097000
TCBDARD  EQU   TCBDAR                                                   01098000
TCBDARS  EQU   TCBDAR                                                   01099000
TCBDARP  EQU   TCBDAR                                                   01100000
TCBGTOFM EQU   TCBFLGS7                                                 01101000
TCBADMP  EQU   TCBFLGS7                                                 01102000
TCBRSTSK EQU   TCBFLGS7                                                 01103000
TCBSVCS  EQU   TCBFLGS7                                                 01104000
TCBSTACK EQU   TCBFLGS7                                                 01105000
TCBRSV34 EQU   TCBFLGS7                                                 01106000
TCBRSV33 EQU   TCBFLGS7                                                 01107000
TCBGPECB EQU   TCBFLGS7                                                 01108000
TCBNTJS  EQU   TCBFLGS6                                                 01109000
TCBAPG   EQU   TCBFLGS6                                                 01110000
TCBMIGR  EQU   TCBFLGS6                                                 01111000
TCBRV303 EQU   TCBFLGS6                                                 01112000
TCBSPVLK EQU   TCBFLGS6                                                 01113000
TCBCPU   EQU   TCBFLGS6                                                 01114000
TCBPIE17 EQU   TCBFLGS6                                                 01115000
TCBRV    EQU   TCBFLGS6                                                 01116000
TCBRSV79 EQU   TCBNDSP5                                                 01117000
TCBRSV78 EQU   TCBNDSP5                                                 01118000
TCBRSV77 EQU   TCBNDSP5                                                 01119000
TCBRSV76 EQU   TCBNDSP5                                                 01120000
TCBRSV75 EQU   TCBNDSP5                                                 01121000
TCBRSV74 EQU   TCBNDSP5                                                 01122000
TCBRSV95 EQU   TCBNDSP5                                                 01123000
TCBRSV94 EQU   TCBNDSP5                                                 01124000
TCBRSV93 EQU   TCBNDSP4                                                 01125000
TCBRSV92 EQU   TCBNDSP4                                                 01126000
TCBRSV91 EQU   TCBNDSP4                                                 01127000
TCBRSV90 EQU   TCBNDSP4                                                 01128000
TCBRSV89 EQU   TCBNDSP4                                                 01129000
TCBRSV88 EQU   TCBNDSP4                                                 01130000
TCBRSV87 EQU   TCBNDSP4                                                 01131000
TCBRSV86 EQU   TCBNDSP4                                                 01132000
TCBEXT1A EQU   TCBEXT1+1                                                01133000
TCBRSV32 EQU   TCBEXT1                                                  01134000
TCBEXCPD EQU   TCB+192                                                  01135000
TCBIOBRC EQU   TCB+188                                                  01136000
TCBDDWTC EQU   TCB+186                                                  01137000
TCBDDEXC EQU   TCB+184                                                  01138000
TCBJSCBB EQU   TCBJSCB+1                                                01139000
@NM00033 EQU   TCBRECDE                                                 01140000
TCBREC   EQU   TCBRECDE                                                 01141000
TCBMDIDS EQU   TCB+176                                                  01142000
TCBNDINT EQU   TCBNDSP3                                                 01143000
TCBRSV27 EQU   TCBNDSP3                                                 01144000
TCBRSV26 EQU   TCBNDSP3                                                 01145000
TCBRSV25 EQU   TCBNDSP3                                                 01146000
TCBRSV24 EQU   TCBNDSP3                                                 01147000
TCBSRBND EQU   TCBNDSP3                                                 01148000
TCBRV302 EQU   TCBNDSP3                                                 01149000
TCBLJSND EQU   TCBNDSP3                                                 01150000
TCBABE   EQU   TCBNDSP2                                                 01151000
TCBDSS   EQU   TCBNDSP2                                                 01152000
TCBOWAIT EQU   TCBNDSP2                                                 01153000
TCBIWAIT EQU   TCBNDSP2                                                 01154000
TCBNDTS  EQU   TCBNDSP2                                                 01155000
TCBNDSVC EQU   TCBNDSP2                                                 01156000
TCBSTPP  EQU   TCBNDSP2                                                 01157000
TCBABD   EQU   TCBNDSP2                                                 01158000
TCBRSV22 EQU   TCBNDSP1                                                 01159000
TCBPIEND EQU   TCBNDSP1                                                 01160000
TCBTPSP  EQU   TCBNDSP1                                                 01161000
TCBDDRND EQU   TCBNDSP1                                                 01162000
TCBRSPND EQU   TCBNDSP1                                                 01163000
TCBRSTND EQU   TCBNDSP1                                                 01164000
TCBDARPN EQU   TCBNDSP1                                                 01165000
TCBDARTN EQU   TCBNDSP1                                                 01166000
TCBNDSP0 EQU   TCBNDSP                                                  01167000
TCBUSER  EQU   TCB+168                                                  01168000
TCBTCTB  EQU   TCBTCT+1                                                 01169000
TCBRSV9C EQU   TCBTCTGF                                                 01170000
TCBRSV9B EQU   TCBTCTGF                                                 01171000
TCBRSV9A EQU   TCBTCTGF                                                 01172000
TCBRSV99 EQU   TCBTCTGF                                                 01173000
TCBRSV98 EQU   TCBTCTGF                                                 01174000
TCBRSV97 EQU   TCBTCTGF                                                 01175000
TCBRSV20 EQU   TCBTCTGF                                                 01176000
TCBSMFGF EQU   TCBTCTGF                                                 01177000
TCBSTABB EQU   TCBSTAB+1                                                01178000
TCBSTCUR EQU   TCBNSTAE                                                 01179000
TCBRV301 EQU   TCBNSTAE                                                 01180000
TCBSYNCH EQU   TCBNSTAE                                                 01181000
TCBHALT  EQU   TCBNSTAE                                                 01182000
TCBPPSUP EQU   TCBNSTAE                                                 01183000
TCB33E   EQU   TCBNSTAE                                                 01184000
TCBQUIES EQU   TCBNSTAE                                                 01185000
TCBSTABE EQU   TCBNSTAE                                                 01186000
TCBAQE   EQU   TCB+156                                                  01187000
TCBPQE   EQU   TCB+152                                                  01188000
TCBTSDP  EQU   TCB+151                                                  01189000
TCBTSLP  EQU   TCB+150                                                  01190000
TCBSTPCT EQU   TCB+149                                                  01191000
TCBCPUBN EQU   TCBTSFLG                                                 01192000
TCBDYDSP EQU   TCBTSFLG                                                 01193000
TCBRSV18 EQU   TCBTSFLG                                                 01194000
TCBRSV17 EQU   TCBTSFLG                                                 01195000
TCBTIOTG EQU   TCBTSFLG                                                 01196000
TCBATT   EQU   TCBTSFLG                                                 01197000
TCBSTPPR EQU   TCBTSFLG                                                 01198000
TCBRV300 EQU   TCBTSTSK                                                 01199000
TCBECB   EQU   TCB+144                                                  01200000
TCBIQE   EQU   TCB+140                                                  01201000
TCBLTC   EQU   TCB+136                                                  01202000
TCBOTC   EQU   TCB+132                                                  01203000
TCBNTC   EQU   TCB+128                                                  01204000
TCBJSTCA EQU   TCBJSTCB+1                                               01205000
TCBRSV16 EQU   TCBJSTCB                                                 01206000
TCBTQET  EQU   TCBTME                                                   01207000
TCBTCB   EQU   TCB+116                                                  01208000
TCBFSAB  EQU   TCBFSA+1                                                 01209000
TCBQEL   EQU   TCBFSA                                                   01210000
TCBGRS15 EQU   TCBGRS+60                                                01211000
TCBGRS14 EQU   TCBGRS+56                                                01212000
TCBGRS13 EQU   TCBGRS+52                                                01213000
TCBGRS12 EQU   TCBGRS+48                                                01214000
TCBGRS11 EQU   TCBGRS+44                                                01215000
TCBGRS10 EQU   TCBGRS+40                                                01216000
TCBGRS9  EQU   TCBGRS+36                                                01217000
TCBGRS8  EQU   TCBGRS+32                                                01218000
TCBGRS7  EQU   TCBGRS+28                                                01219000
TCBGRS6  EQU   TCBGRS+24                                                01220000
TCBGRS5  EQU   TCBGRS+20                                                01221000
TCBGRS4  EQU   TCBGRS+16                                                01222000
TCBGRS3  EQU   TCBGRS+12                                                01223000
TCBGRS2  EQU   TCBGRS+8                                                 01224000
TCBGRS1  EQU   TCBGRS+4                                                 01225000
TCBGRS0  EQU   TCBGRS                                                   01226000
TCBJPQB  EQU   TCBJPQ+1                                                 01227000
TCBRSV15 EQU   TCBPURGE                                                 01228000
TCBRSV14 EQU   TCBPURGE                                                 01229000
TCBRSV13 EQU   TCBPURGE                                                 01230000
TCBRSV12 EQU   TCBPURGE                                                 01231000
TCBRSV11 EQU   TCBPURGE                                                 01232000
TCBRSV10 EQU   TCBPURGE                                                 01233000
TCBRSV09 EQU   TCBPURGE                                                 01234000
TCBJPQF  EQU   TCBPURGE                                                 01235000
TCBJLB   EQU   TCB+40                                                   01236000
TCBLLS   EQU   TCB+36                                                   01237000
TCBDSP   EQU   TCB+35                                                   01238000
TCBLMP   EQU   TCB+34                                                   01239000
TCBPNDSP EQU   TCBFLGS5                                                 01240000
TCBFCD1  EQU   TCBFLGS5                                                 01241000
TCBSTP   EQU   TCBFLGS5                                                 01242000
TCBSYS   EQU   TCBFLGS5                                                 01243000
TCBANDSP EQU   TCBFLGS5                                                 01244000
TCBPAGE  EQU   TCBFLGS5                                                 01245000
TCBUXNDF EQU   TCBABWF                                                  01246000
TCBFC    EQU   TCBFLGS5                                                 01247000
TCBONDSP EQU   TCBFLGS4                                                 01248000
TCBMPCND EQU   TCBFLGS4                                                 01249000
TCBMPCVQ EQU   TCBFLGS4                                                 01250000
TCBUXNDV EQU   TCBFLGS4                                                 01251000
TCBHNDSP EQU   TCBFLGS4                                                 01252000
TCBRQENA EQU   TCBFLGS4                                                 01253000
TCBSER   EQU   TCBFLGS4                                                 01254000
TCBNDUMP EQU   TCBFLGS4                                                 01255000
TCBDWSTA EQU   TCBFLGS3                                                 01256000
TCBRSV08 EQU   TCBFLGS3                                                 01257000
TCBRSV07 EQU   TCBFLGS3                                                 01258000
TCBRSV06 EQU   TCBFLGS3                                                 01259000
TCBABGM  EQU   TCBFLGS3                                                 01260000
TCBABTRM EQU   TCBFLGS3                                                 01261000
TCBADINP EQU   TCBFLGS3                                                 01262000
TCBFSM   EQU   TCBFLGS3                                                 01263000
TCBFTS   EQU   TCBFLGS2                                                 01264000
TCBFETXR EQU   TCBFLGS2                                                 01265000
TCBFDSOP EQU   TCBFLGS2                                                 01266000
TCBFJMC  EQU   TCBFLGS2                                                 01267000
TCBFSMC  EQU   TCBFLGS2                                                 01268000
TCBFABOP EQU   TCBFLGS2                                                 01269000
TCBFSTI  EQU   TCBFLGS2                                                 01270000
TCBFOINP EQU   TCBFLGS2                                                 01271000
TCBFX    EQU   TCBFLGS1                                                 01272000
TCBFS    EQU   TCBFLGS1                                                 01273000
TCBFT    EQU   TCBFLGS1                                                 01274000
TCBPDUMP EQU   TCBFLGS1                                                 01275000
TCBNONPR EQU   TCBFLGS1                                                 01276000
TCBFERA  EQU   TCBFLGS1                                                 01277000
TCBFE    EQU   TCBFLGS1                                                 01278000
TCBFA    EQU   TCBFLGS1                                                 01279000
TCBZERO  EQU   TCBPKF                                                   01280000
TCBFLAG  EQU   TCBPKF                                                   01281000
TCBMSSB  EQU   TCBMSS+1                                                 01282000
TCBRSV03 EQU   TCBMSS                                                   01283000
TCBTRNB  EQU   TCBTRN+1                                                 01284000
TCBRSV02 EQU   TCBABF                                                   01285000
TCBOLTEP EQU   TCBABF                                                   01286000
TCBTCP   EQU   TCBABF                                                   01287000
TCBTCPP  EQU   TCBABF                                                   01288000
TCBRSV01 EQU   TCBABF                                                   01289000
TCBGRPH  EQU   TCBABF                                                   01290000
TCBNOCHK EQU   TCBABF                                                   01291000
TCBMOD91 EQU   TCBABF                                                   01292000
TCBCMPC  EQU   TCBCMP+1                                                 01293000
TCBRV318 EQU   TCBCMSG                                                  01294000
TCBRV317 EQU   TCBCIND                                                  01295000
TCBRV316 EQU   TCBCWTO                                                  01296000
TCBCASID EQU   TCBCDBL                                                  01297000
TCBNOCC  EQU   TCBSTCC                                                  01298000
TCBDMPO  EQU   TCBCPP                                                   01299000
TCBCSTEP EQU   TCBCMPF                                                  01300000
TCBCREQ  EQU   TCBCMPF                                                  01301000
TCBTIO   EQU   TCB+12                                                   01302000
TCBDEB   EQU   TCB+8                                                    01303000
TCBPIEA  EQU   TCBPIE+1                                                 01304000
TCBPM    EQU   TCBPMASK                                                 01305000
@NM00032 EQU   TCBPMASK                                                 01306000
TCBRBP   EQU   TCB                                                      01307000
TCBFRS6  EQU   TCBFRS+24                                                01308000
TCBFRS4  EQU   TCBFRS+16                                                01309000
TCBFRS2  EQU   TCBFRS+8                                                 01310000
TCBFRS0  EQU   TCBFRS                                                   01311000
JNLRBN   EQU   JNLPARM+12                                               01312000
JNLPRLNG EQU   JNLPARM+9                                                01313000
JNLPID   EQU   JNLPARM+8                                                01314000
@NM00007 EQU   JNLPARM+2                                                01315000
@NM00006 EQU   JNLPRTCD                                                 01316000
JNLABSNT EQU   JNLPRTCD                                                 01317000
JNLERR   EQU   JNLPRTCD                                                 01318000
@NM00005 EQU   JNLPCALL                                                 01319000
JNLDRCT  EQU   JNLPCALL                                                 01320000
JNLINIT  EQU   JNLPCALL                                                 01321000
JNLSWALI EQU   JNLPCALL                                                 01322000
@NM00004 EQU   SWAQMPA+1                                                01323000
QMEIA    EQU   QMPA+28                                                  01324000
QMWTQ    EQU   QMPA+24                                                  01325000
QMRSD1   EQU   QMPA+22                                                  01326000
QMTID    EQU   QMPA+20                                                  01327000
QMLNK    EQU   QMPA+18                                                  01328000
QMPRI    EQU   QMPA+17                                                  01329000
@NM00003 EQU   QMSTA                                                    01330000
QMSJNL   EQU   QMSTA                                                    01331000
@NM00002 EQU   QMSTA                                                    01332000
QMTPY    EQU   QMPA+15                                                  01333000
QMNOT    EQU   QMPA+14                                                  01334000
QMTLN    EQU   QMPA+12                                                  01335000
QMTST    EQU   QMPA+11                                                  01336000
QMFLT    EQU   QMPA+9                                                   01337000
QMPEB    EQU   QMNAM+4                                                  01338000
QMCAN    EQU   QMNAM                                                    01339000
@NM00001 EQU   SWPSTA                                                   01340000
@NM00031 EQU   PSA+3668                                                 01341000
PSASTAK  EQU   PSA+3072                                                 01342000
@NM00030 EQU   PSA+1048                                                 01343000
PSAUSEND EQU   PSA+1048                                                 01344000
PSARV062 EQU   PSA+1044                                                 01345000
PSACDAL  EQU   PSA+1040                                                 01346000
PSAWTCOD EQU   PSA+1036                                                 01347000
PSAATCVT EQU   PSA+1032                                                 01348000
PSAPCPSW EQU   PSA+1024                                                 01349000
PSAPIR2  EQU   PSA+1020                                                 01350000
PSARV059 EQU   PSA+1018                                                 01351000
PSASVC13 EQU   PSA+1016                                                 01352000
PSALSFCC EQU   PSA+1012                                                 01353000
PSASFACC EQU   PSA+1008                                                 01354000
PSASTOP  EQU   PSA+992                                                  01355000
PSASTART EQU   PSA+976                                                  01356000
PSARSPSW EQU   PSA+968                                                  01357000
PSASRPSW EQU   PSA+960                                                  01358000
PSARV045 EQU   PSA+892                                                  01359000
PSARV044 EQU   PSA+888                                                  01360000
PSARV043 EQU   PSA+884                                                  01361000
PSARV042 EQU   PSA+880                                                  01362000
PSARV041 EQU   PSA+876                                                  01363000
PSARV040 EQU   PSA+872                                                  01364000
PSARV025 EQU   PSA+868                                                  01365000
PSADSSED EQU   PSA+868                                                  01366000
PSADSSPR EQU   PSA+864                                                  01367000
PSADSSFW EQU   PSA+860                                                  01368000
PSADSS14 EQU   PSA+856                                                  01369000
PSADSSPP EQU   PSA+848                                                  01370000
PSADSSRP EQU   PSA+840                                                  01371000
PSADSS05 EQU   PSADSSF4                                                 01372000
PSADSS10 EQU   PSADSSF4                                                 01373000
PSADSSVE EQU   PSADSSF4                                                 01374000
PSADSSDE EQU   PSADSSF4                                                 01375000
PSADSSC0 EQU   PSADSSF4                                                 01376000
PSADSSIE EQU   PSADSSF4                                                 01377000
PSADSS12 EQU   PSADSSF4                                                 01378000
PSADSSRC EQU   PSADSSF4                                                 01379000
PSARV057 EQU   PSADSSF3                                                 01380000
PSARV056 EQU   PSADSSF3                                                 01381000
PSARV055 EQU   PSADSSF3                                                 01382000
PSADSSMC EQU   PSADSSF3                                                 01383000
PSADSSRW EQU   PSADSSF3                                                 01384000
PSADSSNM EQU   PSADSSF3                                                 01385000
PSADSSES EQU   PSADSSF3                                                 01386000
PSADSSGP EQU   PSADSSF3                                                 01387000
PSADSSF2 EQU   PSADSSFL+1                                               01388000
PSADSSPI EQU   PSADSSF1                                                 01389000
PSADSSOI EQU   PSADSSF1                                                 01390000
PSADSSSP EQU   PSADSSF1                                                 01391000
PSADSSTP EQU   PSADSSF1                                                 01392000
PSADSSDW EQU   PSADSSF1                                                 01393000
PSADSSDD EQU   PSADSSF1                                                 01394000
PSADSSDM EQU   PSADSSF1                                                 01395000
PSADSSMV EQU   PSADSSF1                                                 01396000
PSADSSTS EQU   PSA+816                                                  01397000
PSADSSWK EQU   PSA+812                                                  01398000
PSADSSR3 EQU   PSA+808                                                  01399000
PSADSSR2 EQU   PSA+804                                                  01400000
PSADSSRS EQU   PSA+800                                                  01401000
PSASTOR  EQU   PSA+796                                                  01402000
PSACPUSA EQU   PSA+794                                                  01403000
PSAVSTAP EQU   PSA+792                                                  01404000
PSAWKVAP EQU   PSA+788                                                  01405000
PSAWKRAP EQU   PSA+784                                                  01406000
PSAMCHIC EQU   PSA+783                                                  01407000
PSARV061 EQU   PSA+782                                                  01408000
PSASYMSK EQU   PSA+781                                                  01409000
PSAMCHFL EQU   PSA+780                                                  01410000
PSACR0   EQU   PSA+776                                                  01411000
PSAPSWSV EQU   PSA+768                                                  01412000
PSALITA  EQU   PSA+764                                                  01413000
PSACLHS  EQU   PSAHLHI                                                  01414000
PSALKR15 EQU   PSALKSA+60                                               01415000
PSALKR14 EQU   PSALKSA+56                                               01416000
PSALKR13 EQU   PSALKSA+52                                               01417000
PSALKR12 EQU   PSALKSA+48                                               01418000
PSALKR11 EQU   PSALKSA+44                                               01419000
PSALKR10 EQU   PSALKSA+40                                               01420000
PSALKR9  EQU   PSALKSA+36                                               01421000
PSALKR8  EQU   PSALKSA+32                                               01422000
PSALKR7  EQU   PSALKSA+28                                               01423000
PSALKR6  EQU   PSALKSA+24                                               01424000
PSALKR5  EQU   PSALKSA+20                                               01425000
PSALKR4  EQU   PSALKSA+16                                               01426000
PSALKR3  EQU   PSALKSA+12                                               01427000
PSALKR2  EQU   PSALKSA+8                                                01428000
PSALKR1  EQU   PSALKSA+4                                                01429000
PSALKR0  EQU   PSALKSA                                                  01430000
PSARV023 EQU   PSACLHT+52                                               01431000
PSALOCAL EQU   PSACLHT+48                                               01432000
PSACMSL  EQU   PSACLHT+44                                               01433000
PSAOPTL  EQU   PSACLHT+40                                               01434000
PSATPACL EQU   PSACLHT+36                                               01435000
PSATPDNL EQU   PSACLHT+32                                               01436000
PSATPNCL EQU   PSACLHT+28                                               01437000
PSAIOSLL EQU   PSACLHT+24                                               01438000
PSAIOSUL EQU   PSACLHT+20                                               01439000
PSAIOSCL EQU   PSACLHT+16                                               01440000
PSAIOSSL EQU   PSACLHT+12                                               01441000
PSASALCL EQU   PSACLHT+8                                                01442000
PSAASML  EQU   PSACLHT+4                                                01443000
PSADISPL EQU   PSACLHT                                                  01444000
PSASRSA  EQU   PSA+636                                                  01445000
PSARV050 EQU   PSA+634                                                  01446000
PSADSSGO EQU   PSA+633                                                  01447000
PSARECUR EQU   PSA+632                                                  01448000
PSAHLHIS EQU   PSA+628                                                  01449000
PSAIPCSA EQU   PSA+624                                                  01450000
@NM00029 EQU   PSA+621                                                  01451000
PSAIPCDM EQU   PSA+620                                                  01452000
PSAIPCD  EQU   PSA+616                                                  01453000
@NM00028 EQU   PSA+613                                                  01454000
PSAIPCRM EQU   PSA+612                                                  01455000
PSAIPCR  EQU   PSA+608                                                  01456000
PSAMCHEX EQU   PSA+600                                                  01457000
PSAMPSW  EQU   PSA+592                                                  01458000
PSAEXPS2 EQU   PSA+584                                                  01459000
PSAEXPS1 EQU   PSA+576                                                  01460000
PSAPIREG EQU   PSA+572                                                  01461000
PSARSREG EQU   PSA+568                                                  01462000
PSAGPREG EQU   PSA+556                                                  01463000
PSARV022 EQU   PSASUP4                                                  01464000
PSARV021 EQU   PSASUP4                                                  01465000
PSARV020 EQU   PSASUP4                                                  01466000
PSARV019 EQU   PSASUP4                                                  01467000
PSARV018 EQU   PSASUP4                                                  01468000
PSARV017 EQU   PSASUP4                                                  01469000
PSARV016 EQU   PSASUP4                                                  01470000
PSARV015 EQU   PSASUP4                                                  01471000
PSARV014 EQU   PSASUP3                                                  01472000
PSAULCMS EQU   PSASUP3                                                  01473000
PSARV012 EQU   PSASUP3                                                  01474000
PSAESTA  EQU   PSASUP3                                                  01475000
PSASPR   EQU   PSASUP3                                                  01476000
PSAPSREG EQU   PSASUP3                                                  01477000
PSAPI2   EQU   PSASUP3                                                  01478000
PSAIOSUP EQU   PSASUP3                                                  01479000
PSALCR   EQU   PSASUP2                                                  01480000
PSARTM   EQU   PSASUP2                                                  01481000
PSAACR   EQU   PSASUP2                                                  01482000
PSAIPCE2 EQU   PSASUP2                                                  01483000
PSAIPCES EQU   PSASUP2                                                  01484000
PSAIPCEC EQU   PSASUP2                                                  01485000
PSAGTF   EQU   PSASUP2                                                  01486000
PSAIPCRI EQU   PSASUP2                                                  01487000
PSATYPE6 EQU   PSASUP1                                                  01488000
PSATCTL  EQU   PSASUP1                                                  01489000
PSADISP  EQU   PSASUP1                                                  01490000
PSALOCK  EQU   PSASUP1                                                  01491000
PSAPI    EQU   PSASUP1                                                  01492000
PSAEXT   EQU   PSASUP1                                                  01493000
PSASVC   EQU   PSASUP1                                                  01494000
PSAIO    EQU   PSASUP1                                                  01495000
PSAAOLD  EQU   PSA+548                                                  01496000
PSAANEW  EQU   PSA+544                                                  01497000
PSATNEW  EQU   PSA+536                                                  01498000
PSALCCAR EQU   PSA+532                                                  01499000
PSALCCAV EQU   PSA+528                                                  01500000
PSAPCCAR EQU   PSA+524                                                  01501000
PSAPCCAV EQU   PSA+520                                                  01502000
PSACPULA EQU   PSA+518                                                  01503000
PSACPUPA EQU   PSA+516                                                  01504000
PSAPSA   EQU   PSA+512                                                  01505000
FLCHDEND EQU   PSA+512                                                  01506000
FLCCRSAV EQU   FLCMCLA+280                                              01507000
FLCGRSAV EQU   FLCMCLA+216                                              01508000
FLCFPSAV EQU   FLCMCLA+184                                              01509000
FLCFLA   EQU   FLCMCLA+88                                               01510000
FLCRGNCD EQU   FLCMCLA+84                                               01511000
FLCFSAA  EQU   FLCFSA+1                                                 01512000
@NM00027 EQU   FLCFSA                                                   01513000
@NM00026 EQU   FLCMCLA+72                                               01514000
FLCMCIC  EQU   FLCMCLA+64                                               01515000
@NM00025 EQU   FLCMCLA+20                                               01516000
FLCIOAA  EQU   FLCIOA+1                                                 01517000
@NM00024 EQU   FLCIOA                                                   01518000
@NM00023 EQU   FLCMCLA+15                                               01519000
@NM00022 EQU   FLCMCLA+14                                               01520000
@NM00021 EQU   FLCMCLA+12                                               01521000
FLCLCL   EQU   FLCMCLA+8                                                01522000
FLCIOELA EQU   FLCIOEL+1                                                01523000
@NM00020 EQU   FLCIOEL                                                  01524000
FLCCHNID EQU   FLCMCLA                                                  01525000
@NM00019 EQU   PSA+160                                                  01526000
FLCMTRCD EQU   PSA+157                                                  01527000
@NM00018 EQU   PSA+156                                                  01528000
FLCPERA  EQU   FLCPER+1                                                 01529000
@NM00017 EQU   FLCPER                                                   01530000
@NM00016 EQU   PSA+151                                                  01531000
FLCPERCD EQU   PSA+150                                                  01532000
FLCMCNUM EQU   PSA+149                                                  01533000
@NM00015 EQU   PSA+148                                                  01534000
FLCTEAA  EQU   FLCTEA+1                                                 01535000
@NM00014 EQU   FLCTEA                                                   01536000
PSAPIPC  EQU   PSAPICOD                                                 01537000
PSAPIMC  EQU   PSAPICOD                                                 01538000
PSAPIPER EQU   PSAPICOD                                                 01539000
PSARV049 EQU   FLCPICOD                                                 01540000
FLCPILCB EQU   FLCPIILC                                                 01541000
@NM00013 EQU   FLCPIILC                                                 01542000
@NM00012 EQU   PSAEPPSW                                                 01543000
FLCSVCN  EQU   PSAESPSW+2                                               01544000
FLCSILCB EQU   FLCSVILC                                                 01545000
@NM00011 EQU   FLCSVILC                                                 01546000
@NM00010 EQU   PSAESPSW                                                 01547000
FLCEICOD EQU   PSAEEPSW+2                                               01548000
PSASPAD  EQU   PSAEEPSW                                                 01549000
@NM00009 EQU   PSA+128                                                  01550000
FLCINPSW EQU   PSA+120                                                  01551000
FLCMNPSW EQU   PSA+112                                                  01552000
FLCPNPSW EQU   PSA+104                                                  01553000
FLCSNPSW EQU   PSA+96                                                   01554000
FLCENPSW EQU   PSA+88                                                   01555000
FLCTRACE EQU   PSA+84                                                   01556000
FLCTIMER EQU   PSA+80                                                   01557000
FLCCVT2  EQU   PSA+76                                                   01558000
FLCCAW   EQU   PSA+72                                                   01559000
FLCCSW   EQU   PSA+64                                                   01560000
FLCIOPSW EQU   PSA+56                                                   01561000
FLCMOPSW EQU   PSA+48                                                   01562000
FLCPOPSW EQU   PSA+40                                                   01563000
FLCSOPSW EQU   PSA+32                                                   01564000
FLCEOPSW EQU   PSA+24                                                   01565000
@NM00008 EQU   FLCICCW2+4                                               01566000
FLCCVT   EQU   FLCICCW2                                                 01567000
FLCICCW1 EQU   FLCROPSW                                                 01568000
FLCIPPSW EQU   FLCRNPSW                                                 01569000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01570000
@RC00090 EQU   @RC00089                                                 01571000
@RF00185 EQU   @EL00003                                                 01572000
@RC00198 EQU   @EL00004                                                 01573000
@PB00004 EQU   @PB00005                                                 01574000
@RF00094 EQU   @RC00090                                                 01575000
@PB00003 EQU   @PB00004                                                 01576000
@PB00002 EQU   @PB00003                                                 01577000
@ENDDATA EQU   *                                                        01578000
         END   IEFQB550,(C'PLS1759',0701,78059)                         01579000
./  ADD  SSI=80590383,NAME=IEFQB555
         TITLE 'IEFQB555-SWA MGR-LOCATE MODE                           *00001000
                        '                                               00002000
IEFQB555 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IEFQB555  78.059'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
         MODESET EXTKEY=SCHED,SAVEKEY=(2)                               00014000
JSCBDISP EQU 188                                                        00015000
JSCBAOS1 EQU  72                                                        00016000
JSCBAOS2 EQU 192                                                        00017000
*                                  /*                                   00018000
*        BECAUSE OF PROLOGUE CODE GENERATED BY PLS,             Y02669  00019000
*        R2 NOW CONTAINS THE CALLER'S KEY, AND CANNOT BE USED   Y02669  00020000
*        UNTIL IT IS SAVED IN CALLRKEY.                         Y02669  00021000
         L     R3,PSATOLD          POINT TO CURRENT TCB         Y02669  00022000
         L     @11,TCBSWASA(R3)    POINT TO WORK AREA PREFIX    Y02669  00023000
*                                  (OR 0)                       Y02669  00024000
         LTR   @11,@11             CHECK FOR A WORK AREA        Y02669  00025000
         BNZ   CHECKUSE            CHECK WHETHER WORK AREA IS  YM08504  00026000
*                                  IN USE                      YM08504  00027000
*        GET STORAGE FOR A WORK AREA FOR THIS TCB.             YM08504  00028000
*        CHECK WHETHER THIS MODULE'S WORK AREA WOULD BE LARGE  YM08504  00029000
*        ENOUGH FOR EITHER IEFQB550 OR IEFQB555.               YM08504  00030000
         L     R4,@SIZDATD         GET SIZE REQUIRED FOR THIS   Y02669  00031000
*                                  MODULE'S WORK AREA           Y02669  00032000
         LA    R4,0(,R4)           CLEAR SUBPOOL FROM HIGH      Y02669  00033000
*                                  ORDER BYTE                   Y02669  00034000
         L     R1,SPSZ50N          PT. TO ADCON IN QB550       YM08504  00035000
         L     R1,0(,R1)           PT. TO VALUE IN QB550       YM08504  00036000
         L     R1,0(,R1)           GET VALUE IN QB550          YM08504  00037000
         LA    R1,0(,R1)           CLEAR HIGH ORDER BYTE       YM08504  00038000
         CR    R4,R1                                           YM08504  00039000
         BM    GETOTHER            GO GET SIZE REQUIRED FOR    YM08504  00040000
*                                  OTHER MODULE                YM08504  00041000
*        IN EITHER CASE, RESTORE R4 TO GET THE SUBPOOL.        YM08504  00042000
         L     R4,@SIZDATD         USE THIS MODULE'S SIZE      YM08504  00043000
         B     GETPERM             SKIP ELSE CLAUSE            YM08504  00044000
GETOTHER EQU   *                                               YM08504  00045000
         L     R1,SPSZ50N          PT. TO ADCON IN QB555       YM08504  00046000
         L     R1,0(,R1)           PT. TO VALUE IN QB555       YM08504  00047000
         L     R4,0(,R1)           GET VALUE IN QB555          YM08504  00048000
GETPERM  EQU   *                                               YM08504  00049000
         LA    R1,WKPFEX                                        Y02669  00050000
         ALR   R4,R1               ADD SIZE OF PREFIX TO AMOUNT Y02669  00051000
*                                  OF STORAGE REQUIRED BY PLS   Y02669  00052000
*                                  TO GET THE SIZE REQUIRED FOR Y02669  00053000
*                                  THE WORK AREA. (THE SUBPOOL  Y02669  00054000
*                                  NUMBER IN THE HIGH ORDER     Y02669  00055000
*                                  BYTE IS PRESERVED.)          Y02669  00056000
         GETMAIN R,LV=(R4)         GET WORK AREA                Y02669  00057000
         ST    R4,SPSIZE(,R1)      PUT SIZE AND SUBPOOL OF     YM08504  00058000
*                                  WORK AREA IN PREFIX          Y02669  00059000
         MVI   FLAGS(R1),ZERO      CLEAR FLAGS                 YM08504  00060000
         MODESET EXTKEY=ZERO       GET IN KEY ZERO TO STORE           **00061000
                                   IN TCB                       Y02669  00062000
         ST    R1,TCBSWASA(,R3)    SAVE PTR. TO WORKAREA PREFIX Y02669  00063000
         LR    @11,R1              POINT TO WORK AREA PREFIX    Y02669  00064000
*                                  (EXPECTED BY THE FOLLOWING   Y02669  00065000
*                                  PIECE OF CODE)               Y02669  00066000
         MODESET EXTKEY=SCHED      GET IN KEY FOR GETMAIN      YM08504  00067000
CHECKUSE EQU   *                                               YM08504  00068000
         TM    FLAGS(@11),INUSE    CHECK WHETHER WORK AREA     YM08504  00069000
*                                  IS IN USE                   YM08504  00070000
         BNO   PROLOG              NOT IN USE, USE IT          YM08504  00071000
*        WORK AREA IS IN USE (BY AN INTERRUPTED RB ALSO UNDER  YM08504  00072000
*        THIS TCB). GET A WORK AREA TO BE USED JUST FOR THIS   YM08504  00073000
*        INVOCATION OF THIS MODULE.                            YM08504  00074000
         L     R4,@SIZDATD                                     YM08504  00075000
         LA    R1,WKPFEX                                       YM08504  00076000
         ALR   R4,R1                                           YM08504  00077000
         GETMAIN R,LV=(R4)                                     YM08504  00078000
         LR    @11,R1              SAVE PTR. TO WORK AREA      YM08504  00079000
         ST    R4,SPSIZE(,@11)     SAVE FOR FREEMAIN           YM08504  00080000
         MVI   FLAGS(@11),MUSTFREE INDICATE MUST BE FREED ON   YM08504  00081000
*                                  EXIT                        YM08504  00082000
PROLOG   EQU   *                                                Y02669  00083000
         OI    FLAGS(@11),INUSE    SET IN USE                  YM08504  00084000
         LA    @11,WKPFEX(,@11)    POINT TO ACTUAL WORK AREA    Y02669  00085000
*                                  (SKIP THE PREFIX)            Y02669  00086000
         USING @DATD,@11           PROVIDE ADDRESSABILITY       Y02669  00087000
         ST    @13,@SA00001+SLOTBACK  BACKWARD CHAIN SAVE AREAS Y02669  00088000
         STC   @02,CALLRKEY        SAVE CALLER'S KEY            Y02669  00089000
*        NOTE THAT THE MODESET MACRO DOES NOT SUPPORT SYMBOLIC  Y02669  00090000
*        REGISTER NAMES.                                        Y02669  00091000
         MODESET KEYADDR=(2)       GET IN CALLER'S KEY TO             **00092000
                                   STORE IN CALLER'S SAVE AREA  Y02669  00093000
         LM    @00,@04,SLOTR0(@13) RESTORE INPUT REGISTERS      Y02669  00094000
         ST    @11,SLOTFORE(,@13)  FOREWARD CHAIN SAVE AREAS    Y02669  00095000
         LR    @13,@11             POINT TO CURRENT SAVE AREA   Y02669  00096000
*        GET IN KEY 0, IN CASE THE PARAMETER LIST IS IN STORAGE Y02669  00097000
*        WHICH IS FETCH PROTECTED BUT NOT KEY 1.                Y02669  00098000
         MODESET EXTKEY=ZERO                                    Y02669  00099000
         MVC   @PC00001(PARMLEN),0(@01) COPY PARAMETER LIST TO  Y02669  00100000
*                                  WORK AREA                    Y02669  00101000
         MODESET EXTKEY=SCHED      RETURN TO SCHEDULER KEY FOR        **00102000
                                   NORMAL PROCESSING            Y02669  00103000
*   SWEPAPTR=EPAPTR;                /* INITIALIZE EPA BASE POINTER   */ 00104000
         L     @10,@PC00001                                        0083 00105000
         L     SWEPAPTR,EPAPTR(,@10)                               0083 00106000
*   RETNCODE=ZERO;                  /* INITIALIZE RETURN CODE TO 0   */ 00107000
         SLR   @10,@10                                             0084 00108000
         ST    @10,RETNCODE                                        0084 00109000
*   IF FCODE=ASGNLOC THEN           /* IF THIS IS AN ASSIGN LOCATE   */ 00110000
         L     @10,@PC00001+4                                      0085 00111000
         CLC   FCODE(2,@10),@CC00962                               0085 00112000
         BNE   @RF00085                                            0085 00113000
*     CALL QB555ASN;                /* CALL THAT INTERNAL PROCEDURE  */ 00114000
         BAL   @14,QB555ASN                                        0086 00115000
*   ELSE                                                           0087 00116000
*     IF FCODE=WRTLOC THEN          /* IF THIS IS A WRITE LOCATE     */ 00117000
         B     @RC00085                                            0087 00118000
@RF00085 L     @10,@PC00001+4                                      0087 00119000
         CLC   FCODE(2,@10),@CC00964                               0087 00120000
         BNE   @RF00087                                            0087 00121000
*       CALL QB555WRT;              /* CALL THAT INTERNAL PROCEDURE  */ 00122000
         BAL   @14,QB555WRT                                        0088 00123000
*     ELSE                                                         0089 00124000
*       IF FCODE=READLOC THEN       /* IF THIS IS A READ LOCATE      */ 00125000
         B     @RC00087                                            0089 00126000
@RF00087 L     @10,@PC00001+4                                      0089 00127000
         CLC   FCODE(2,@10),@CC00966                               0089 00128000
         BNE   @RF00089                                            0089 00129000
*         CALL QB555RD;             /* CALL THAT INTERNAL PROCEDURE  */ 00130000
         BAL   @14,QB555RD                                         0090 00131000
*       ELSE                                                       0091 00132000
*         IF FCODE=DELBLOCK THEN    /* IF THIS IS A DELETE BLOCK     */ 00133000
         B     @RC00089                                            0091 00134000
@RF00089 L     @10,@PC00001+4                                      0091 00135000
         CLC   FCODE(2,@10),@CC00968                               0091 00136000
         BNE   @RF00091                                            0091 00137000
*           CALL QB555DEL;          /* CALL THAT INTERNAL PROCEDURE  */ 00138000
         BAL   @14,QB555DEL                                        0092 00139000
*         ELSE                                                     0093 00140000
*           RETNCODE=INVFUNCT;      /* THEN IT'S AN INVALID REQUEST  */ 00141000
         B     @RC00091                                            0093 00142000
@RF00091 LA    @10,4                                               0093 00143000
         ST    @10,RETNCODE                                        0093 00144000
*   IF RETNCODE¬=ZERO THEN          /* IF ANY ERRORS                 */ 00145000
@RC00091 DS    0H                                                  0094 00146000
@RC00089 DS    0H                                                  0094 00147000
@RC00087 DS    0H                                                  0094 00148000
@RC00085 L     @10,RETNCODE                                        0094 00149000
         LTR   @10,@10                                             0094 00150000
         BZ    @RF00094                                            0094 00151000
*     DO;                                                          0095 00152000
*       RESPECIFY                                                  0096 00153000
*        (R1,                                                      0096 00154000
*         R15) RESTRICTED;                                         0096 00155000
*       R15=RETNCODE;               /* LOAD ERROR INDICATION         */ 00156000
         L     R15,RETNCODE                                        0097 00157000
*       R1=ZEROBZER;                /* LOAD ABEND CODE OF 0B0 SYSTEM */ 00158000
         ICM   R1,15,ZEROBZER                                      0098 00159000
*       GEN(ABEND (1),,,SYSTEM);    /* ISSUE ABEND                   */ 00160000
         ABEND (1),,,SYSTEM                                             00161000
*       RESPECIFY                                                  0100 00162000
*        (R1,                                                      0100 00163000
*         R15) UNRESTRICTED;        /* RELEASE FOR PLS USE           */ 00164000
*     END;                                                         0101 00165000
*   GEN REFS(CALLRKEY,RETNCODE);                                   0102 00166000
@RF00094 DS    0H                                                  0102 00167000
*                                     /*                                00168000
*        THE EPILOG CODE MUST BE CODED IN ASSEMBLER BECAUSE    YM08504  00169000
*        EITHER THE 'IN USE' FLAG MUST BE TURNED OFF OR THE    YM08504  00170000
*        WORK AREA WAS A TEMPORARY ONE AND MUST BE FREED.      YM08504  00171000
         L     R4,RETNCODE         SAVE RETURN CODE            YM08504  00172000
         IC    @02,CALLRKEY        SAVE CALLER'S PROTECT KEY   YM08504  00173000
         L     @13,SLOTBACK(,@13)  SAVE PTR. TO THE CALLER'S   YM08504  00174000
*                                  SAVE AREA                   YM08504  00175000
         LA    @01,WKPFEX                                      YM08504  00176000
         SR    @11,@01             SUBTRACT SIZE OF PREFIX TO  YM08504  00177000
*                                  POINT TO ACTUAL BEGINNING   YM08504  00178000
*                                  OF WORK AREA                YM08504  00179000
         TM    FLAGS(@11),MUSTFREE CHECK WHETHER AREA IS TO BE YM08504  00180000
*                                  FREED                       YM08504  00181000
         BO    GOFREE              YES, GO FREE                YM08504  00182000
         NI    FLAGS(@11),X'FF'-INUSE DO NOT FREE, TURN OFF IN YM08504  00183000
*                                  USE FLAG                    YM08504  00184000
         B     EPILOG              SKIP ELSE CLAUSE            YM08504  00185000
GOFREE   EQU   *                                               YM08504  00186000
         L     @00,SPSIZE(,@11)                                YM08504  00187000
         FREEMAIN R,LV=(0),A=(@11)                             YM08504  00188000
EPILOG   EQU   *                                               YM08504  00189000
         MODESET KEYADDR=(2)       SET CALLER'S KEY            YM08504  00190000
         LR    @15,R4              SET RETURN CODE             YM08504  00191000
         L     @14,SLOTR14(,@13)   RESTORE REGISTERS           YM08504  00192000
         LM    @00,@12,SLOTR0(@13)                             YM08504  00193000
         BR    @14                 RETURN                      YM08504  00194000
*                                                                  0103 00195000
*/********************************************************************/ 00196000
*/* THIS IS THE INTERNAL PROCEDURE WHICH DOES THE ASSIGNS. THERE IS  */ 00197000
*/* A 16 BYTE EPA FOR EACH BLOCK TO BE ASSIGNED. THEY ARE CHAINED    */ 00198000
*/* TOGETHER WITH THE END OF THE CHAIN INDICATED BY A ZERO CHAIN     */ 00199000
*/* POINTER. THERE IS NO LIMIT ON THE NUMBER OF BLOCKS TO BE         */ 00200000
*/* ASSIGNED. EACH EPA CONTAINS THE LENGTH OF THAT BLOCK TO BE       */ 00201000
*/* ASSIGNED. THE SUBPOOL NUMBER FOR THE BLOCK IS OBTAINED FROM THE  */ 00202000
*/* QMPA. THE QMPA IS LOCATED VIA THE 'ACTIVE JSCB'. THIS JSCB       */ 00203000
*/* IS POINTED TO BY THE JSCBACT FIELD OF THE JSCB WHICH IS LOCATED  */ 00204000
*/* VIA THE CURRENT TCB. AFTER EACH GETMAIN IS ACCOMPLISHED THE      */ 00205000
*/* ASSOCIATED SWA PREFIX IS PARTIALLY INITIALIZED AND INFO IS       */ 00206000
*/* RETURNED IN THE EPA. A MODESET IS ISSUED TO PUT US IN THE        */ 00207000
*/* CALLERS KEY BEFORE PUTTING INFO IN THE EPA. ANOTHER MODESET PUTS */ 00208000
*/* US IN SUPERVISOR KEY BEFORE UPDATING THE RBN FIELD OF THE QMPA.  */ 00209000
*/* THE ONLY ERROR CONDITION DETECTED IS A ZERO OR NEGATIVE LENGTH   */ 00210000
*/* VALUE BEING PASSED. THE GETMAINS ARE UNCONDITIONAL. UPON         */ 00211000
*/* COMPLETION, CONTROL IS RETURNED TO THE EXTERNAL PROCEDURE.       */ 00212000
*/********************************************************************/ 00213000
*                                                                  0103 00214000
*QB555ASN:                                                         0103 00215000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* ASSIGN PROCEDURE        Y02669*/ 00216000
QB555ASN DS    0H                                                  0104 00217000
*   RFY                                                            0104 00218000
*    (R14) RSTD;                    /*                        YM08414*/ 00219000
*   RESPECIFY                                                      0105 00220000
*     IEZJSCB BASED(JSCBPTR);       /* BASE ON POINTER INTERNAL TO 0105 00221000
*                                      THIS MODULE                   */ 00222000
*   JSCBPTR=TCBJSCB;                /* GET CURRENT JSCB POINTER      */ 00223000
         L     @15,PSATOLD                                         0106 00224000
         L     JSCBPTR,TCBJSCB(,@15)                               0106 00225000
*   JSCBPTR=JSCBACT;                /* SET POINTER TO JSCB TO BE USED   00226000
*                                      FOR THIS ASSIGN               */ 00227000
         L     JSCBPTR,JSCBACT(,JSCBPTR)                           0107 00228000
*   QMPAPTR=JSCBQMPI;               /* SET QMPA BASE POINTER         */ 00229000
         L     QMPAPTR,JSCBQMPI(,JSCBPTR)                          0108 00230000
*   DO WHILE(SWEPAPTR¬=ZERO&RETNCODE=ZERO);/* LOOP UNTIL DONE OR   0109 00231000
*                                      UNTIL ERROR                   */ 00232000
         B     @DE00109                                            0109 00233000
@DL00109 DS    0H                                                  0110 00234000
*     IF SWLNGTH>ZERO THEN          /* IS LENGTH A POSITIVE VALUE    */ 00235000
         L     @15,SWLNGTH(,SWEPAPTR)                              0110 00236000
         LTR   @15,@15                                             0110 00237000
         BNP   @RF00110                                            0110 00238000
*       DO;                                                        0111 00239000
*         LNGTH=SWLNGTH+SWPRELNG;   /* GET LENGTH FROM EPA AND ADD 0112 00240000
*                                      SWA PREFIX LENGTH             */ 00241000
         LA    @15,16(,@15)                                        0112 00242000
         STCM  @15,7,LNGTH                                         0112 00243000
*         SPNUM=QMSWSP;             /* GET SUBPOOL # FROM QMPA       */ 00244000
         MVC   SPNUM(1),QMSWSP(QMPAPTR)                            0113 00245000
*         RESPECIFY                                                0114 00246000
*          (R0,                                                    0114 00247000
*           R1) RESTRICTED;         /* RESTRICT FOR GETMAIN          */ 00248000
*         R0=GETFRSPC;              /* LOAD INTO REGISTER 0          */ 00249000
         L     R0,GETFRSPC                                         0115 00250000
*         GEN(GETMAIN R,LV=(0));    /* GET SPACE FOR 1 BLOCK AND   0116 00251000
*                                      BLOCK PREFIX                  */ 00252000
         GETMAIN R,LV=(0)                                               00253000
*         SPFXPTR=R1;               /* INITIALIZE SWA PREFIX PTR     */ 00254000
         LR    SPFXPTR,R1                                          0117 00255000
*         GOTSPACE=R1;              /* SAVE FOR USE AS 3 BYTE SVA    */ 00256000
         ST    R1,GOTSPACE                                         0118 00257000
*         GEN(MODESET KEYADDR=CALLRKEY,WORKREG=1);/* SWITCH TO CALLER   00258000
*                                      KEY                           */ 00259000
         MODESET KEYADDR=CALLRKEY,WORKREG=1                             00260000
*         RESPECIFY                                                0120 00261000
*          (R0,                                                    0120 00262000
*           R1) UNRESTRICTED;       /* RELEASE FOR PL/S USE          */ 00263000
*         SWVA=SWPREADR;            /* PUT SVA IN CALLERS EPA        */ 00264000
         L     @15,SWPREADR-1                                      0121 00265000
         LA    @15,0(,@15)                                         0121 00266000
         STCM  @15,7,SWVA(SWEPAPTR)                                0121 00267000
*         SWBLKPTR=SWPREADR+SWPRELNG;/* SWA BLOCK ADDRESS = PREFIX 0122 00268000
*                                      ADDRESS + PREFIX LENGTH       */ 00269000
         AL    @15,@CF00183                                        0122 00270000
         ST    @15,SWBLKPTR(,SWEPAPTR)                             0122 00271000
*         GEN(MODESET EXTKEY=SUPR); /* SWITCH TO KEY 0               */ 00272000
         MODESET EXTKEY=SUPR                                            00273000
*         TEMPSAV1=QMRBN;           /* GET RBN FROM QMPA             */ 00274000
         L     TEMPSAV1,QMRBN(,QMPAPTR)                            0124 00275000
*LOOP:                                                             0125 00276000
*         TEMPSAV2=TEMPSAV1+ONE;    /* INCREMENT RBN BY 1            */ 00277000
LOOP     LA    TEMPSAV2,1                                          0125 00278000
         ALR   TEMPSAV2,TEMPSAV1                                   0125 00279000
*         CS(TEMPSAV1,TEMPSAV2,QMRBN);/* COMPARE AND SWAP IF QMRBN 0126 00280000
*                                      HAS NOT CHANGED               */ 00281000
         CS    TEMPSAV1,@09,QMRBN(QMPAPTR)                         0126 00282000
*         BC(4,LOOP);               /* TRY AGAIN IF QMRBN HAS CHANGED*/ 00283000
         BC    4,LOOP                                              0127 00284000
*         GEN(MODESET EXTKEY=SCHED);/* SWITCH BACK TO SCHEDULER KEY  */ 00285000
         MODESET EXTKEY=SCHED                                           00286000
*         CLEARPTR=SPFXPTR;         /* SET BASE FOR SWASPACE         */ 00287000
         LR    CLEARPTR,SPFXPTR                                    0129 00288000
*         IF LNGTH>TWOFIFSX THEN    /* WAS GETMAIN > 256             */ 00289000
         L     @15,LNGTH-1                                         0130 00290000
         LA    @15,0(,@15)                                         0130 00291000
         C     @15,@CF00959                                        0130 00292000
         BNH   @RF00130                                            0130 00293000
*           DO;                                                    0131 00294000
*             QUOTIENT=LNGTH/TWOFIFSX;/* 256 BYTE MULTIPLES          */ 00295000
         LR    QUOTIENT,@15                                        0132 00296000
         SRL   QUOTIENT,8                                          0132 00297000
*             REMAINDR=LNGTH//TWOFIFSX;/* REMAINDER                  */ 00298000
         LR    @00,@15                                             0133 00299000
         SRDA  @00,32                                              0133 00300000
         D     @00,@CF00959                                        0133 00301000
         LR    REMAINDR,@00                                        0133 00302000
*             DO I=1 TO QUOTIENT;   /* ONCE PER 256 BYTE AREA        */ 00303000
         LA    I,1                                                 0134 00304000
         B     @DE00134                                            0134 00305000
@DL00134 DS    0H                                                  0135 00306000
*               SWASPACE=SWASPACE&&SWASPACE;/* CLEAR 256 BYTES       */ 00307000
         XC    SWASPACE(256,CLEARPTR),SWASPACE(CLEARPTR)           0135 00308000
*               CLEARPTR=CLEARPTR+TWOFIFSX;/* UP BASE POINTER        */ 00309000
         AL    CLEARPTR,@CF00959                                   0136 00310000
*             END;                                                 0137 00311000
         AL    I,@CF00046                                          0137 00312000
@DE00134 CR    I,QUOTIENT                                          0137 00313000
         BNH   @DL00134                                            0137 00314000
*           END;                                                   0138 00315000
*         ELSE                                                     0139 00316000
*           REMAINDR=LNGTH;         /* PICK UP LENGTH IF 256 OR LESS */ 00317000
         B     @RC00130                                            0139 00318000
@RF00130 L     REMAINDR,LNGTH-1                                    0139 00319000
         LA    REMAINDR,0(,REMAINDR)                               0139 00320000
*         IF REMAINDR¬=ZERO THEN    /* WAS THERE ANY REMAINDR        */ 00321000
@RC00130 LTR   REMAINDR,REMAINDR                                   0140 00322000
         BZ    @RF00140                                            0140 00323000
*           SWASPACE(1:REMAINDR)=SWASPACE(1:REMAINDR)&&SWASPACE(1: 0141 00324000
*               REMAINDR);          /* CLEAR THE REMAINDER           */ 00325000
         LR    @15,REMAINDR                                        0141 00326000
         BCTR  @15,0                                               0141 00327000
         EX    @15,@SX01044                                        0141 00328000
*         SWPRBN=TEMPSAV2;          /* PUT RBN IN SWA PREFIX         */ 00329000
@RF00140 ST    TEMPSAV2,SWPRBN(,SPFXPTR)                           0142 00330000
*         SWPVA=SWPREADR;           /* PUT SELF SVA IN SWA PREFIX    */ 00331000
         MVC   SWPVA(3,SPFXPTR),SWPREADR                           0143 00332000
*         SWPLNGTH=SWLNGTH;         /* PUT LENGTH IN SWA PREFIX      */ 00333000
         MVC   SWPLNGTH(3,SPFXPTR),SWLNGTH+1(SWEPAPTR)             0144 00334000
*         SWEPAPTR=SWCHNPTR;        /* UPDATE BASE TO NEXT EPA       */ 00335000
         L     SWEPAPTR,SWCHNPTR(,SWEPAPTR)                        0145 00336000
*       END;                        /* END OF DO LOOP                */ 00337000
*     ELSE                                                         0147 00338000
*       RETNCODE=INVLNGTH;          /* INVALID LENGTH ERROR          */ 00339000
         B     @RC00110                                            0147 00340000
@RF00110 LA    @15,16                                              0147 00341000
         ST    @15,RETNCODE                                        0147 00342000
*   END;                                                           0148 00343000
@RC00110 DS    0H                                                  0148 00344000
@DE00109 SLR   @15,@15                                             0148 00345000
         CR    SWEPAPTR,@15                                        0148 00346000
         BE    @DC00109                                            0148 00347000
         C     @15,RETNCODE                                        0148 00348000
         BE    @DL00109                                            0148 00349000
@DC00109 DS    0H                                                  0149 00350000
*   RFY                                                            0149 00351000
*    (R14) UNRSTD;                  /*                        YM08414*/ 00352000
*   END QB555ASN;                   /* END OF ASSIGN INT. PROCEDURE  */ 00353000
@EL00002 DS    0H                                                  0150 00354000
@EF00002 DS    0H                                                  0150 00355000
@ER00002 BR    @14                                                 0150 00356000
*                                                                  0151 00357000
*/********************************************************************/ 00358000
*/* THIS IS THE INTERNAL PROCEDURE THAT DOES THE WRITES. AS WITH     */ 00359000
*/* OTHER LOCATE MODE FUNCTIONS THERE IS A 16 BYTE EPA FOR EACH      */ 00360000
*/* BLOCK. THEY ARE CHAINED TOGETHER WITH THE END OF CHAIN INDICATED */ 00361000
*/* BY A ZERO CHAIN POINTER. THERE IS NO LIMIT ON THE NUMBER OF      */ 00362000
*/* EPAS. EACH EPA IS CHECKED FOR A VALID SVA AND BLOCK POINTER.     */ 00363000
*/* IF EITHER ERROR CONDITION EXISTS THE APPROPRIATE ERROR CODE IS   */ 00364000
*/* SET AND RETURN IS MADE TO THE EXTERNAL PROCEDURE WITHOUT FURTHER */ 00365000
*/* PROCESSING. IF NO ERROR IS DETECTED THE SWA PREFIX IS TESTED TO  */ 00366000
*/* SEE IF THIS BLOCK HAS BEEN PREVIOUSLY WRITTEN. IF NOT, THE SWA   */ 00367000
*/* PREFIX INITIALIZATION IS COMPLETED. IN THE PROCESS OF DOING THIS */ 00368000
*/* A CHECK IS MADE FOR A VALID ID. WHEN ALL EPAS HAVE BEEN          */ 00369000
*/* PROCESSED WITHOUT ERROR THE JOURNAL WRITE ROUTINE IS CALLED      */ 00370000
*/* BEFORE RETURNING TO THE EXTERNAL PROCEDURE.                      */ 00371000
*/********************************************************************/ 00372000
*                                                                  0151 00373000
*QB555WRT:                                                         0151 00374000
*   PROC;                           /* WRITE PROCEDURE               */ 00375000
QB555WRT STM   @14,@12,@SA00003                                    0151 00376000
*   DO WHILE(SWEPAPTR¬=ZERO&RETNCODE=ZERO);/* SET UP LOOP            */ 00377000
         B     @DE00152                                            0152 00378000
@DL00152 DS    0H                                                  0153 00379000
*     SPFXPTR=SWVA;                 /* INITIALIZE SWA PREFIX PTR.    */ 00380000
         SLR   @10,@10                                             0153 00381000
         ICM   @10,7,SWVA(SWEPAPTR)                                0153 00382000
         LR    SPFXPTR,@10                                         0153 00383000
*     IF SWBLKPTR¬=SWVA+SWPRELNG THEN/* IS BLOCK PTR INVALID         */ 00384000
         AL    @10,@CF00183                                        0154 00385000
         C     @10,SWBLKPTR(,SWEPAPTR)                             0154 00386000
         BE    @RF00154                                            0154 00387000
*       RETNCODE=INVBKPTR;          /* YES, SET ERROR CODE           */ 00388000
         LA    @10,32                                              0155 00389000
         ST    @10,RETNCODE                                        0155 00390000
*     ELSE                          /* IF BOTH ARE VALID             */ 00391000
*       IF SWVA¬=SWPVA THEN         /* IS SVA INVALID                */ 00392000
         B     @RC00154                                            0156 00393000
@RF00154 CLC   SWVA(3,SWEPAPTR),SWPVA(SPFXPTR)                     0156 00394000
         BE    @RF00156                                            0156 00395000
*         RETNCODE=INVSVA;          /* YES, SET ERROR CODE           */ 00396000
         LA    @10,8                                               0157 00397000
         ST    @10,RETNCODE                                        0157 00398000
*       ELSE                        /* SVA WAS O.K.                  */ 00399000
*         DO;                                                      0158 00400000
         B     @RC00156                                            0158 00401000
@RF00156 DS    0H                                                  0159 00402000
*           IF SWPWRT='0'B THEN     /* HAS THIS BLOCK BEEN WRITTEN   */ 00403000
         TM    SWPWRT(SPFXPTR),B'10000000'                         0159 00404000
         BNZ   @RF00159                                            0159 00405000
*             DO;                                                  0160 00406000
*               IF SWBLKID=HEXZERO THEN/* NO, IS ID BEING PASSED     */ 00407000
         CLI   SWBLKID(SWEPAPTR),X'00'                             0161 00408000
         BNE   @RF00161                                            0161 00409000
*                 TEMPID=EMBBLKID;  /* NO, GET IT FROM BLOCK         */ 00410000
         L     @10,SWBLKPTR(,SWEPAPTR)                             0162 00411000
         MVC   TEMPID(1),EMBBLKID(@10)                             0162 00412000
*               ELSE                                               0163 00413000
*                 TEMPID=SWBLKID;   /* YES, TAKE IT FROM EPA         */ 00414000
         B     @RC00161                                            0163 00415000
@RF00161 MVC   TEMPID(1),SWBLKID(SWEPAPTR)                         0163 00416000
*               DO I=1 TO TBLSIZE WHILE/* SEARCH UNITIL FOUND OR     */ 00417000
*                     (SWPACRO=ZERO);/* TABLE EXHAUSTED              */ 00418000
@RC00161 LA    I,1                                                 0164 00419000
@DL00164 L     @10,SWPACRO(,SPFXPTR)                               0164 00420000
         LTR   @10,@10                                             0164 00421000
         BNZ   @DC00164                                            0164 00422000
*                 IF TEMPID=BLOCKID(I) THEN/* IS IT THIS ID          */ 00423000
         L     @10,@CA01019                                        0165 00424000
         ALR   @10,I                                               0165 00425000
         BCTR  @10,0                                               0165 00426000
         CLC   TEMPID(1),BLOCKID-BLOCKID(@10)                      0165 00427000
         BNE   @RF00165                                            0165 00428000
*                   DO;                                            0166 00429000
*                     SWPID=TEMPID; /* PUT IN SWA PREFIX             */ 00430000
         MVC   SWPID(1,SPFXPTR),TEMPID                             0167 00431000
*                     SWPACRO=TABLE(I);/* PUT ACRONYM IN PREFIX      */ 00432000
         LR    @10,I                                               0168 00433000
         SLA   @10,2                                               0168 00434000
         L     @06,@CA01020                                        0168 00435000
         ALR   @06,@10                                             0168 00436000
         AL    @06,@CF01046                                        0168 00437000
         MVC   SWPACRO(4,SPFXPTR),TABLE-TABLE(@06)                 0168 00438000
*                     SWPWRT='1'B;  /* SET WRITTEN BIT               */ 00439000
         OI    SWPWRT(SPFXPTR),B'10000000'                         0169 00440000
*                   END;                                           0170 00441000
*               END;                                               0171 00442000
@RF00165 AL    I,@CF00046                                          0171 00443000
         C     I,@CF01018                                          0171 00444000
         BNH   @DL00164                                            0171 00445000
@DC00164 DS    0H                                                  0172 00446000
*               IF SWPACRO=ZERO THEN/* DID WE FIND MATCHING ID       */ 00447000
         L     @10,SWPACRO(,SPFXPTR)                               0172 00448000
         LTR   @10,@10                                             0172 00449000
         BNZ   @RF00172                                            0172 00450000
*                 RETNCODE=INVID;   /* NO, SET ERROR CODE            */ 00451000
         LA    @10,28                                              0173 00452000
         ST    @10,RETNCODE                                        0173 00453000
*             END;                                                 0174 00454000
@RF00172 DS    0H                                                  0175 00455000
*           IF RETNCODE=ZERO THEN                                  0175 00456000
@RF00159 L     @10,RETNCODE                                        0175 00457000
         LTR   @10,@10                                             0175 00458000
         BNZ   @RF00175                                            0175 00459000
*             SWEPAPTR=SWCHNPTR;    /* IF THERE WAS AN ERROR LEAVE 0176 00460000
*                                      THE POINTER AT THE EPA      0176 00461000
*                                      ASSOCIATED WITH THE ERROR     */ 00462000
         L     SWEPAPTR,SWCHNPTR(,SWEPAPTR)                        0176 00463000
*         END;                                                     0177 00464000
@RF00175 DS    0H                                                  0178 00465000
*   END;                                                           0178 00466000
@RC00156 DS    0H                                                  0178 00467000
@RC00154 DS    0H                                                  0178 00468000
@DE00152 SLR   @10,@10                                             0178 00469000
         CR    SWEPAPTR,@10                                        0178 00470000
         BE    @DC00152                                            0178 00471000
         C     @10,RETNCODE                                        0178 00472000
         BE    @DL00152                                            0178 00473000
@DC00152 DS    0H                                                  0179 00474000
*   IF RETNCODE=ZERO THEN           /* DID WE ENCOUNTER ANY ERROR    */ 00475000
         L     @10,RETNCODE                                        0179 00476000
         LTR   @10,@10                                             0179 00477000
         BNZ   @RF00179                                            0179 00478000
*     DO;                           /* NO, SET UP PARAMETER LIST     */ 00479000
*       JNLPTR=ADDR(PARMLST);       /* SET BASE FOR JNLPARM          */ 00480000
         LA    JNLPTR,PARMLST                                      0181 00481000
*       JNLPARM=(JNLPARM&&JNLPARM); /* CLEAR PARAMETER LIST          */ 00482000
         XC    JNLPARM(16,JNLPTR),JNLPARM(JNLPTR)                  0182 00483000
*       JNLSWALI='1'B;              /* INDICATE SWA LOCATE MODE      */ 00484000
         OI    JNLSWALI(JNLPTR),B'01000000'                        0183 00485000
*       JNLPPTRX=EPAPTR;            /* SET EPA POINTER               */ 00486000
         L     @10,@PC00001                                        0184 00487000
         L     @10,EPAPTR(,@10)                                    0184 00488000
         ST    @10,JNLPPTRX(,JNLPTR)                               0184 00489000
*       CALL IEFXB500(PARMLST);     /* CALL JOURNAL WRITE            */ 00490000
         LA    @10,PARMLST                                         0185 00491000
         ST    @10,@AL00001                                        0185 00492000
         L     @15,@CV00951                                        0185 00493000
         LA    @01,@AL00001                                        0185 00494000
         BALR  @14,@15                                             0185 00495000
*     END;                                                         0186 00496000
*   END QB555WRT;                   /* END OF INTERNAL PROC          */ 00497000
@EL00003 DS    0H                                                  0187 00498000
@EF00003 DS    0H                                                  0187 00499000
@ER00003 LM    @14,@12,@SA00003                                    0187 00500000
         BR    @14                                                 0187 00501000
*                                                                  0188 00502000
*/********************************************************************/ 00503000
*/* THIS IS THE INTERNAL PROCEDURE THAT DOES THE READS. AS WITH      */ 00504000
*/* OTHER LOCATE MODE FUNCTIONS THERE IS A 16 BYTE EPA FOR EACH      */ 00505000
*/* BLOCK. THEY ARE CHAINED TOGETHER WITH THE END OF THE CHAIN       */ 00506000
*/* INDICATED BY A ZERO CHAIN POINTER. THERE IS NO LIMIT ON THE      */ 00507000
*/* NUMBER OF EPAS. EACH EPA IS CHECKED FOR A VALID SVA AND THE      */ 00508000
*/* ASSOCIATED SWA PREFIX IS TESTED TO SEE IF THIS BLOCK HAS BEEN    */ 00509000
*/* PREVIOUSLY WRITTEN. IF EITHER ERROR CONDITION EXISTS, AN ERROR   */ 00510000
*/* CODE IS SET AND RETURN IS MADE WITHOUT FURTHER PROCESSING.       */ 00511000
*/* MODESET IS USED TO PUT US IN THE CALLERS KEY BEFORE PUTTING THE  */ 00512000
*/* BLOCK POINTER, BLOCK ID AND BLOCK LENGTH IN THE CALLERS EPA.     */ 00513000
*/* WHEN THE ENTIRE OPERATION IS COMPLETED SUCCESSFULLY A RETURN     */ 00514000
*/* IS MADE TO THE EXTERNAL PROCEDURE WITH RETNCODE UNCHANGED.       */ 00515000
*/********************************************************************/ 00516000
*                                                                  0188 00517000
*QB555RD:                                                          0188 00518000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* READ PROCEDURE          Y02669*/ 00519000
QB555RD  DS    0H                                                  0189 00520000
*   RFY                                                            0189 00521000
*    (R14) RSTD;                    /*                        YM08414*/ 00522000
*   DO WHILE(SWEPAPTR¬=ZERO&RETNCODE=ZERO);/* SET UP LOOP            */ 00523000
         B     @DE00190                                            0190 00524000
@DL00190 DS    0H                                                  0191 00525000
*     SPFXPTR=SWVA;                 /* INITIALIZE SWA PREFIX PTR.    */ 00526000
         SLR   @15,@15                                             0191 00527000
         ICM   @15,7,SWVA(SWEPAPTR)                                0191 00528000
         LR    SPFXPTR,@15                                         0191 00529000
*     IF SWVA¬=SWPVA THEN           /* IS SVA INVALID                */ 00530000
         L     @10,SWPVA-1(,SPFXPTR)                               0192 00531000
         LA    @10,0(,@10)                                         0192 00532000
         CR    @15,@10                                             0192 00533000
         BE    @RF00192                                            0192 00534000
*       RETNCODE=INVSVA;            /* SET ERROR CODE                */ 00535000
         LA    @15,8                                               0193 00536000
         ST    @15,RETNCODE                                        0193 00537000
*     ELSE                                                         0194 00538000
*       IF SWPWRT¬='1'B THEN        /* HAS BLOCK BEEN WRITTEN        */ 00539000
         B     @RC00192                                            0194 00540000
@RF00192 TM    SWPWRT(SPFXPTR),B'10000000'                         0194 00541000
         BO    @RF00194                                            0194 00542000
*         RETNCODE=INVREAD;         /* SET ERROR CODE                */ 00543000
         LA    @15,12                                              0195 00544000
         ST    @15,RETNCODE                                        0195 00545000
*       ELSE                        /* IF NO ERROR                   */ 00546000
*         DO;                                                      0196 00547000
         B     @RC00194                                            0196 00548000
@RF00194 DS    0H                                                  0197 00549000
*           RESPECIFY                                              0197 00550000
*            (R2) RESTRICTED;       /* FOR USE BY MODESET MACRO      */ 00551000
*           GEN(MODESET KEYADDR=CALLRKEY,WORKREG=2);/* SWITCH TO   0198 00552000
*                                      CALLER KEY                    */ 00553000
         MODESET KEYADDR=CALLRKEY,WORKREG=2                             00554000
*           RESPECIFY                                              0199 00555000
*            (R2) UNRESTRICTED;     /* RELEASE FOR PLS USE           */ 00556000
*           SWBLKPTR=SWPVA+SWPRELNG;/* PUT BLOCK POINTER IN EPA      */ 00557000
         LA    @15,16                                              0200 00558000
         L     @10,SWPVA-1(,SPFXPTR)                               0200 00559000
         LA    @10,0(,@10)                                         0200 00560000
         ALR   @15,@10                                             0200 00561000
         ST    @15,SWBLKPTR(,SWEPAPTR)                             0200 00562000
*           SWBLKID=SWPID;          /* PUT BLOCK ID IN EPA           */ 00563000
         MVC   SWBLKID(1,SWEPAPTR),SWPID(SPFXPTR)                  0201 00564000
*           SWLNGTH=SWPLNGTH;       /* PUT BLOCK LENGTH IN EPA       */ 00565000
         L     @15,SWPLNGTH-1(,SPFXPTR)                            0202 00566000
         LA    @15,0(,@15)                                         0202 00567000
         ST    @15,SWLNGTH(,SWEPAPTR)                              0202 00568000
*           GEN(MODESET EXTKEY=SCHED);/* SWITCH BACK TO SCHEDULER KEY*/ 00569000
         MODESET EXTKEY=SCHED                                           00570000
*         END;                                                     0204 00571000
*     IF RETNCODE=ZERO THEN                                        0205 00572000
@RC00194 DS    0H                                                  0205 00573000
@RC00192 L     @15,RETNCODE                                        0205 00574000
         LTR   @15,@15                                             0205 00575000
         BNZ   @RF00205                                            0205 00576000
*       SWEPAPTR=SWCHNPTR;          /* SET BASE TO NEXT EPA ONLY IF     00577000
*                                      THERE HAS NOT BEEN AN ERROR   */ 00578000
         L     SWEPAPTR,SWCHNPTR(,SWEPAPTR)                        0206 00579000
*   END;                            /* END FOR DO WHILE              */ 00580000
@RF00205 DS    0H                                                  0207 00581000
@DE00190 SLR   @15,@15                                             0207 00582000
         CR    SWEPAPTR,@15                                        0207 00583000
         BE    @DC00190                                            0207 00584000
         C     @15,RETNCODE                                        0207 00585000
         BE    @DL00190                                            0207 00586000
@DC00190 DS    0H                                                  0208 00587000
*   RFY                                                            0208 00588000
*    (R14) UNRSTD;                  /*                        YM08414*/ 00589000
*   END QB555RD;                    /* END OF INTERNAL PROC.         */ 00590000
@EL00004 DS    0H                                                  0209 00591000
@EF00004 DS    0H                                                  0209 00592000
@ER00004 BR    @14                                                 0209 00593000
*                                                                  0210 00594000
*/********************************************************************/ 00595000
*/* THIS IS THE INTERNAL PROCEDURE THAT FREES INDIVIDUAL BLOCKS.     */ 00596000
*/* AS WITH THE OTHER LOCATE MODE FUNCTIONS THERE IS A 16 BYTE EPA   */ 00597000
*/* FOR EACH BLOCK. THEY ARE CHAINED TOGETHER WITH THE END OF THE    */ 00598000
*/* CHAIN INDICATED BY A ZERO CHAIN POINTER. THERE IS NO LIMIT ON    */ 00599000
*/* THE NUMBER OF EPAS. EACH EPA IS CHECKED FOR A VALID SVA. IF IT   */ 00600000
*/* IS INVALID AN APPROPRIATE ERROR CODE IS SET AND RETURN IS MADE   */ 00601000
*/* WITHOUT FURTHER PROCESSING. IF IT IS VALID, THE SUBPOOL NUMBER   */ 00602000
*/* IS OBTAINED FROM THE QMPA IN THE SAME MANNER AS FOR THE ASSIGN   */ 00603000
*/* FUNCTION. THE BLOCK LENGTH IS GOTTEN FROM THE SWA PREFIX. THE    */ 00604000
*/* PREFIX LENGTH IS ADDED TO IT AND IT IS FREED. THE FREEMAINS ARE  */ 00605000
*/* UNCONDITIONAL. WHEN THE ENTIRE OPERATION IS COMPLETED            */ 00606000
*/* SUCCESSFULLY A RETURN IS MADE TO THE EXTERNAL PROCEDURE WITH     */ 00607000
*/* RETNCODE UNCHANGED.                                              */ 00608000
*/********************************************************************/ 00609000
*                                                                  0210 00610000
*QB555DEL:                                                         0210 00611000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/* DELETE PROCEDURE        Y02669*/ 00612000
QB555DEL DS    0H                                                  0211 00613000
*   RFY                                                            0211 00614000
*    (R14) RSTD;                    /*                        YM08414*/ 00615000
*   RESPECIFY                                                      0212 00616000
*     IEZJSCB BASED(JSCBPTR);       /* USE INTERNAL BASE POINTER     */ 00617000
*   JSCBPTR=TCBJSCB;                /* GET POINTER TO CURRENT JSCB   */ 00618000
         L     @15,PSATOLD                                         0213 00619000
         L     JSCBPTR,TCBJSCB(,@15)                               0213 00620000
*   JSCBPTR=JSCBACT;                /* GET POINTER TO JSCB TO BE USED   00621000
*                                      FOR THIS DELETE BLOCK       0214 00622000
*                                      OPERATION                     */ 00623000
         L     JSCBPTR,JSCBACT(,JSCBPTR)                           0214 00624000
*   QMPAPTR=JSCBQMPI;               /* GET POINTER TO QMPA           */ 00625000
         L     QMPAPTR,JSCBQMPI(,JSCBPTR)                          0215 00626000
*   DO WHILE(SWEPAPTR¬=ZERO&RETNCODE=ZERO);/* SET UP LOOP            */ 00627000
         B     @DE00216                                            0216 00628000
@DL00216 DS    0H                                                  0217 00629000
*     SPFXPTR=SWVA;                 /* SET SWA PREFIX BASE POINTER   */ 00630000
         SLR   @15,@15                                             0217 00631000
         ICM   @15,7,SWVA(SWEPAPTR)                                0217 00632000
         LR    SPFXPTR,@15                                         0217 00633000
*     IF SWVA=SWPVA THEN            /* IS THIS A VALID SVA           */ 00634000
         L     @10,SWPVA-1(,SPFXPTR)                               0218 00635000
         LA    @10,0(,@10)                                         0218 00636000
         CR    @15,@10                                             0218 00637000
         BNE   @RF00218                                            0218 00638000
*       DO;                         /* YES, PREPARE TO FREE BLOCK    */ 00639000
*         LNGTH=SWPLNGTH+SWPRELNG;  /* FREEMAIN LENGTH IS LENGTH OF     00640000
*                                      BLOCK + LENGTH OF SWA PREFIX  */ 00641000
         L     @10,SWPLNGTH-1(,SPFXPTR)                            0220 00642000
         LA    @10,16(,@10)                                        0220 00643000
         STCM  @10,7,LNGTH                                         0220 00644000
*         SPNUM=QMSWSP;             /* GET SUBPOOL # FROM QMPA       */ 00645000
         MVC   SPNUM(1),QMSWSP(QMPAPTR)                            0221 00646000
*         RESPECIFY                                                0222 00647000
*          (R0,                                                    0222 00648000
*           R1) RESTRICTED;         /* RESTRICT FOR FREEMAIN         */ 00649000
*         R0=GETFRSPC;              /* LOAD WITH SUBPOOL NUMBER AND     00650000
*                                      LENGTH                        */ 00651000
         L     R0,GETFRSPC                                         0223 00652000
*         GOTSPACE=(GOTSPACE&&GOTSPACE);/* CLEAR AREA                */ 00653000
         L     @10,GOTSPACE                                        0224 00654000
         LR    @09,@10                                             0224 00655000
         XR    @09,@10                                             0224 00656000
         ST    @09,GOTSPACE                                        0224 00657000
*         SWPREADR=SWVA;            /* PUT IN BLOCK ADDRESS          */ 00658000
         STCM  @15,7,SWPREADR                                      0225 00659000
*         R1=GOTSPACE;              /* LOAD BLOCK ADDRESS IN R1      */ 00660000
         L     R1,GOTSPACE                                         0226 00661000
*         GEN(FREEMAIN R,LV=(0),A=(1));/* FREE BLOCK                 */ 00662000
         FREEMAIN R,LV=(0),A=(1)                                        00663000
*         RESPECIFY                                                0228 00664000
*          (R0,                                                    0228 00665000
*           R1) UNRESTRICTED;       /* RELEASE REGISTERS TO PLS      */ 00666000
*         SWEPAPTR=SWCHNPTR;        /* UP POINTER TO NEXT EPA        */ 00667000
         L     SWEPAPTR,SWCHNPTR(,SWEPAPTR)                        0229 00668000
*       END;                                                       0230 00669000
*     ELSE                                                         0231 00670000
*       RETNCODE=INVSVA;            /* SET PROPER ERROR CODE         */ 00671000
         B     @RC00218                                            0231 00672000
@RF00218 LA    @15,8                                               0231 00673000
         ST    @15,RETNCODE                                        0231 00674000
*   END;                                                           0232 00675000
@RC00218 DS    0H                                                  0232 00676000
@DE00216 SLR   @15,@15                                             0232 00677000
         CR    SWEPAPTR,@15                                        0232 00678000
         BE    @DC00216                                            0232 00679000
         C     @15,RETNCODE                                        0232 00680000
         BE    @DL00216                                            0232 00681000
@DC00216 DS    0H                                                  0233 00682000
*   RFY                                                            0233 00683000
*    (R14) UNRSTD;                  /*                        YM08414*/ 00684000
*   END QB555DEL;                   /* END OF INTERNAL PROCEDURE     */ 00685000
@EL00005 DS    0H                                                  0234 00686000
@EF00005 DS    0H                                                  0234 00687000
@ER00005 BR    @14                                                 0234 00688000
@PB00005 DS    0H                                                  0234 00689000
*   END IEFQB555                    /* END OF EXTERNAL PROCEDURE     */ 00690000
*                                                                  0235 00691000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00692000
*/*%INCLUDE SYSLIB  (IEFZB502)                                       */ 00693000
*/*%INCLUDE SYSLIB  (IEFZB505)                                       */ 00694000
*/*%INCLUDE SYSLIB  (IEFQMNGR)                                       */ 00695000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00696000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00697000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                       */ 00698000
*/*%INCLUDE SYSLIB  (IEFZB507)                                       */ 00699000
*/*%INCLUDE SYSLIB  (IEFZB504)                                       */ 00700000
*                                                                  0235 00701000
*       ;                                                          0235 00702000
@DATA    DS    0H                                                       00703000
@SX01044 XC    SWASPACE(0,CLEARPTR),SWASPACE(CLEARPTR)                  00704000
@DATD    DSECT                                                          00705000
         DS    0F                                                       00706000
@SA00001 DS    18F                                                      00707000
@PC00001 DS    2F                                                       00708000
@SA00003 DS    0F                                                       00709000
         DS    15F                                                      00710000
@AL00001 DS    1A                                                       00711000
IEFQB555 CSECT                                                          00712000
         DS    0F                                                       00713000
@CF00046 DC    F'1'                                                     00714000
@CF00183 DC    F'16'                                                    00715000
@CF01018 DC    F'22'                                                    00716000
@CF00959 DC    F'256'                                                   00717000
@CF01046 DC    F'-4'                                                    00718000
@DATD    DSECT                                                          00719000
         DS    0D                                                       00720000
RETNCODE DS    F                                                        00721000
GETFRSPC DS    FL4                                                      00722000
         ORG   GETFRSPC                                                 00723000
SPNUM    DS    CL1                                                      00724000
LNGTH    DS    AL3                                                      00725000
         ORG   GETFRSPC+4                                               00726000
GOTSPACE DS    FL4                                                      00727000
         ORG   GOTSPACE                                                 00728000
@NM00040 DS    CL1                                                      00729000
SWPREADR DS    CL3                                                      00730000
         ORG   GOTSPACE+4                                               00731000
CALLRKEY DS    FL1                                                      00732000
TEMPID   DS    CL1                                                      00733000
         DS    CL2                                                      00734000
PARMLST  DS    CL16                                                     00735000
IEFQB555 CSECT                                                          00736000
         DS    0F                                                       00737000
@SIZDATD DC    AL1(230)                                                 00738000
         DC    AL3(@ENDDATD-@DATD)                                      00739000
@CV00951 DC    V(IEFXB500)                                              00740000
@CA01019 DC    A(BLOCKID)                                               00741000
@CA01020 DC    A(TABLE)                                                 00742000
         DS    0D                                                       00743000
@CC00962 DC    C'AL'                                                    00744000
@CC00964 DC    C'WL'                                                    00745000
@CC00966 DC    C'RL'                                                    00746000
@CC00968 DC    C'DB'                                                    00747000
ZEROBZER DC    X'000000B0'                                              00748000
IEFQB555 CSECT                                                          00749000
*                                     /*                                00750000
WKPFEX   EQU   8                   LENGTH OF WORK AREA'S PREFIX Y02669  00751000
SPSIZE   EQU   0                   DISPLACEMENT IN PREFIX OF   YM08504  00752000
*                                  SP AND SIZE OF THIS WORK    YM08504  00753000
*                                  AREA                        YM08504  00754000
FLAGS    EQU   4                   DISP. OF FLAGS              YM08504  00755000
ZERO     EQU   0                   TO CLEAR FLAGS              YM08504  00756000
INUSE    EQU   X'80'               WORK AREA IS IN USE         YM08504  00757000
MUSTFREE EQU   X'40'               FREE THIS AREA ON EXIT      YM08504  00758000
SLOTBACK EQU   4                   SLOT IN REG SAVE AREA TO     Y02669  00759000
*                                  BACKWARD CHAIN SAVE AREAS    Y02669  00760000
SLOTFORE EQU   8                   SLOT IN REG SAVE AREA TO     Y02669  00761000
*                                  FOREWARD CHAIN SAVE AREAS    Y02669  00762000
SLOTR14  EQU   12                  SLOT IN REG SAVE AREA FOR    Y02669  00763000
*                                  R14                          Y02669  00764000
SLOTR0   EQU   20                  SLOT IN REG SAVE AREA FOR R0 Y02669  00765000
SLOTR1   EQU   24                  SLOT IN REG SAVE AREA FOR R1 Y02669  00766000
PARMLEN  EQU   8                   LENGTH OF PARM LIST          Y02669  00767000
SPSZ55L  DC    A(@SIZDATD)         POINTER TO SIZE OF THIS     YM08504  00768000
*                                  MODULE'S WORK AREA, TO BE   YM08504  00769000
*                                  USED BY IEFQB550            YM08504  00770000
         ENTRY SPSZ55L                                         YM08504  00771000
SPSZ50N  DC    A(SPSZ50L)          PTR. TO WORD WITHIN         YM08504  00772000
*                                  IEFQB550 WHICH POINTS TO    YM08504  00773000
*                                  SIZE IT REQUIRES            YM08504  00774000
         EXTRN SPSZ50L                                         YM08504  00775000
IEFQB555 CSECT                                                          00776000
         DS   0H                                                        00777000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   00778000
@DATD    DSECT                                                          00779000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00780000
@ENDDATD EQU   *                                                        00781000
IEFQB555 CSECT                                                          00782000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00783000
@01      EQU   01                                                       00784000
@02      EQU   02                                                       00785000
@03      EQU   03                                                       00786000
@04      EQU   04                                                       00787000
@05      EQU   05                                                       00788000
@06      EQU   06                                                       00789000
@07      EQU   07                                                       00790000
@08      EQU   08                                                       00791000
@09      EQU   09                                                       00792000
@10      EQU   10                                                       00793000
@11      EQU   11                                                       00794000
@12      EQU   12                                                       00795000
@13      EQU   13                                                       00796000
@14      EQU   14                                                       00797000
@15      EQU   15                                                       00798000
REMAINDR EQU   @05                                                      00799000
QUOTIENT EQU   @10                                                      00800000
TEMPSAV2 EQU   @09                                                      00801000
TEMPSAV1 EQU   @05                                                      00802000
CLEARPTR EQU   @02                                                      00803000
JSCBPTR  EQU   @02                                                      00804000
I        EQU   @03                                                      00805000
JNLPTR   EQU   @02                                                      00806000
QMPAPTR  EQU   @08                                                      00807000
SWEPAPTR EQU   @07                                                      00808000
SPFXPTR  EQU   @04                                                      00809000
R0       EQU   @00                                                      00810000
R1       EQU   @01                                                      00811000
R2       EQU   @02                                                      00812000
R3       EQU   @03                                                      00813000
R4       EQU   @04                                                      00814000
R11      EQU   @11                                                      00815000
R14      EQU   @14                                                      00816000
R15      EQU   @15                                                      00817000
         EXTRN BLOCKID                                                  00818000
         EXTRN TABLE                                                    00819000
PSA      EQU   0                                                        00820000
FLCRNPSW EQU   PSA                                                      00821000
FLCROPSW EQU   PSA+8                                                    00822000
FLCICCW2 EQU   PSA+16                                                   00823000
PSAEEPSW EQU   PSA+132                                                  00824000
PSAESPSW EQU   PSA+136                                                  00825000
FLCSVILC EQU   PSAESPSW+1                                               00826000
PSAEPPSW EQU   PSA+140                                                  00827000
FLCPIILC EQU   PSAEPPSW+1                                               00828000
FLCPICOD EQU   PSAEPPSW+2                                               00829000
PSAPICOD EQU   FLCPICOD+1                                               00830000
FLCTEA   EQU   PSAEPPSW+4                                               00831000
FLCPER   EQU   PSA+152                                                  00832000
FLCMCLA  EQU   PSA+168                                                  00833000
FLCIOEL  EQU   FLCMCLA+4                                                00834000
FLCIOA   EQU   FLCMCLA+16                                               00835000
FLCFSA   EQU   FLCMCLA+80                                               00836000
PSATOLD  EQU   PSA+540                                                  00837000
PSASUPER EQU   PSA+552                                                  00838000
PSASUP1  EQU   PSASUPER                                                 00839000
PSASUP2  EQU   PSASUPER+1                                               00840000
PSASUP3  EQU   PSASUPER+2                                               00841000
PSASUP4  EQU   PSASUPER+3                                               00842000
PSACLHT  EQU   PSA+640                                                  00843000
PSALKSA  EQU   PSA+696                                                  00844000
PSAHLHI  EQU   PSA+760                                                  00845000
PSADSSFL EQU   PSA+836                                                  00846000
PSADSSF1 EQU   PSADSSFL                                                 00847000
PSADSSF3 EQU   PSADSSFL+2                                               00848000
PSADSSF4 EQU   PSADSSFL+3                                               00849000
PSARSVT  EQU   PSA+896                                                  00850000
SWAPFX   EQU   0                                                        00851000
SWPRBN   EQU   SWAPFX                                                   00852000
SWPSTA   EQU   SWAPFX+4                                                 00853000
SWPWRT   EQU   SWPSTA                                                   00854000
SWPVA    EQU   SWAPFX+5                                                 00855000
SWPID    EQU   SWAPFX+8                                                 00856000
SWPLNGTH EQU   SWAPFX+9                                                 00857000
SWPACRO  EQU   SWAPFX+12                                                00858000
SWAEPA   EQU   0                                                        00859000
SWBLKPTR EQU   SWAEPA                                                   00860000
SWVAFW   EQU   SWAEPA+4                                                 00861000
SWVA     EQU   SWVAFW                                                   00862000
SWBLKID  EQU   SWVAFW+3                                                 00863000
SWLNGTH  EQU   SWAEPA+8                                                 00864000
SWCHNPTR EQU   SWAEPA+12                                                00865000
QMPA     EQU   0                                                        00866000
QMNAM    EQU   QMPA                                                     00867000
QMSTA    EQU   QMPA+16                                                  00868000
QMPCL    EQU   QMPA+32                                                  00869000
QMPCMNC  EQU   QMPCL                                                    00870000
SWAQMPA  EQU   0                                                        00871000
QMSWSP   EQU   SWAQMPA                                                  00872000
QMRBN    EQU   SWAQMPA+12                                               00873000
TCBFIX   EQU   0                                                        00874000
TCBFRS   EQU   TCBFIX                                                   00875000
TCB      EQU   0                                                        00876000
TCBPIE   EQU   TCB+4                                                    00877000
TCBPMASK EQU   TCBPIE                                                   00878000
TCBCMP   EQU   TCB+16                                                   00879000
TCBCMPF  EQU   TCBCMP                                                   00880000
TCBCPP   EQU   TCBCMPF                                                  00881000
TCBSTCC  EQU   TCBCMPF                                                  00882000
TCBCDBL  EQU   TCBCMPF                                                  00883000
TCBCWTO  EQU   TCBCMPF                                                  00884000
TCBCIND  EQU   TCBCMPF                                                  00885000
TCBCMSG  EQU   TCBCMPF                                                  00886000
TCBTRN   EQU   TCB+20                                                   00887000
TCBABF   EQU   TCBTRN                                                   00888000
TCBMSS   EQU   TCB+24                                                   00889000
TCBPKF   EQU   TCB+28                                                   00890000
TCBFLGS  EQU   TCB+29                                                   00891000
TCBFLGS1 EQU   TCBFLGS                                                  00892000
TCBFLGS2 EQU   TCBFLGS+1                                                00893000
TCBFLGS3 EQU   TCBFLGS+2                                                00894000
TCBFLGS4 EQU   TCBFLGS+3                                                00895000
TCBFLGS5 EQU   TCBFLGS+4                                                00896000
TCBABWF  EQU   TCBFLGS5                                                 00897000
TCBJPQ   EQU   TCB+44                                                   00898000
TCBPURGE EQU   TCBJPQ                                                   00899000
TCBGRS   EQU   TCB+48                                                   00900000
TCBFSA   EQU   TCB+112                                                  00901000
TCBTME   EQU   TCB+120                                                  00902000
TCBJSTCB EQU   TCB+124                                                  00903000
TCBTSFLG EQU   TCB+148                                                  00904000
TCBTSTSK EQU   TCBTSFLG                                                 00905000
TCBSTAB  EQU   TCB+160                                                  00906000
TCBNSTAE EQU   TCBSTAB                                                  00907000
TCBTCT   EQU   TCB+164                                                  00908000
TCBTCTGF EQU   TCBTCT                                                   00909000
TCBSCNDY EQU   TCB+172                                                  00910000
TCBNDSP  EQU   TCBSCNDY                                                 00911000
TCBNDSP1 EQU   TCBNDSP+1                                                00912000
TCBNDSP2 EQU   TCBNDSP+2                                                00913000
TCBNDSP3 EQU   TCBNDSP+3                                                00914000
TCBJSCB  EQU   TCB+180                                                  00915000
TCBRECDE EQU   TCBJSCB                                                  00916000
TCBEXT1  EQU   TCB+196                                                  00917000
TCBBITS  EQU   TCB+200                                                  00918000
TCBNDSP4 EQU   TCBBITS                                                  00919000
TCBNDSP5 EQU   TCBBITS+1                                                00920000
TCBFLGS6 EQU   TCBBITS+2                                                00921000
TCBFLGS7 EQU   TCBBITS+3                                                00922000
TCBDAR   EQU   TCB+204                                                  00923000
TCBDARC  EQU   TCBDAR                                                   00924000
TCBEXT2  EQU   TCB+208                                                  00925000
TCBFOE   EQU   TCB+244                                                  00926000
TCBESTAE EQU   TCB+264                                                  00927000
TCBESTRM EQU   TCBESTAE+1                                               00928000
TCBFBYT1 EQU   TCB+276                                                  00929000
TCBFBYT2 EQU   TCB+277                                                  00930000
TCBRV124 EQU   TCB+278                                                  00931000
TCBRV133 EQU   TCB+279                                                  00932000
TCBSWASA EQU   TCB+288                                                  00933000
TCBXTNT2 EQU   0                                                        00934000
TCBGTF   EQU   TCBXTNT2                                                 00935000
TCBTFLG  EQU   TCBGTF                                                   00936000
TCBRV146 EQU   TCBXTNT2+28                                              00937000
TCBRV155 EQU   TCBXTNT2+29                                              00938000
TCBRV164 EQU   TCBXTNT2+30                                              00939000
TCBRV173 EQU   TCBXTNT2+31                                              00940000
IEZJSCB  EQU   0                                                        00941000
JSCBSEC1 EQU   IEZJSCB+188                                              00942000
JSCHPCE  EQU   JSCBSEC1+4                                               00943000
JSCBDCB  EQU   JSCBSEC1+36                                              00944000
JSCBOPTS EQU   JSCBSEC1+48                                              00945000
JSCBSWT1 EQU   JSCBSEC1+55                                              00946000
JSCBQMPI EQU   JSCBSEC1+56                                              00947000
JSCBWTP  EQU   JSCBSEC1+64                                              00948000
JSCBWTFG EQU   JSCBWTP                                                  00949000
JSCBEND1 EQU   IEZJSCB+260                                              00950000
JNLPARM  EQU   0                                                        00951000
JNLPCALL EQU   JNLPARM                                                  00952000
JNLSWALI EQU   JNLPCALL                                                 00953000
JNLPRTCD EQU   JNLPARM+1                                                00954000
JNLPPTRX EQU   JNLPARM+4                                                00955000
SWASPACE EQU   0                                                        00956000
USERBLK  EQU   0                                                        00957000
EMBBLKID EQU   USERBLK+3                                                00958000
CVTPTR   EQU   0                                                        00959000
EPAPTR   EQU   0                                                        00960000
FCODE    EQU   0                                                        00961000
PSARSVTE EQU   PSARSVT                                                  00962000
JSCBSEC2 EQU   JSCBEND1                                                 00963000
JSCBSEC3 EQU   JSCBEND1                                                 00964000
JSCBJCT  EQU   JSCBSEC3                                                 00965000
JSCBJCTA EQU   JSCBJCT+1                                                00966000
JSCBASID EQU   JSCBSEC3+8                                               00967000
JSCBFBYT EQU   JSCBSEC3+10                                              00968000
JSCBJNL  EQU   JSCBSEC3+28                                              00969000
JSCBJJSB EQU   JSCBJNL                                                  00970000
JSCBSUB  EQU   JSCBSEC3+40                                              00971000
JSCSCT   EQU   JSCBSEC3+68                                              00972000
JSCBACT  EQU   JSCBSEC3+88                                              00973000
JSCRSV45 EQU   JSCBSEC3+112                                             00974000
JSCRSV46 EQU   JSCRSV45                                                 00975000
JSCRSV47 EQU   JSCRSV45+2                                               00976000
FLC      EQU   PSA                                                      00977000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00978000
JSCBEND3 EQU   JSCBSEC3+120                                             00979000
JSCRSV52 EQU   JSCBSEC3+116                                             00980000
JSCRSV51 EQU   JSCRSV47+1                                               00981000
JSCRSV50 EQU   JSCRSV47                                                 00982000
JSCRSV49 EQU   JSCRSV46+1                                               00983000
JSCRSV48 EQU   JSCRSV46                                                 00984000
JSCRSV44 EQU   JSCBSEC3+108                                             00985000
JSCRSV43 EQU   JSCBSEC3+104                                             00986000
JSCRSV42 EQU   JSCBSEC3+100                                             00987000
JSCBASWA EQU   JSCBSEC3+96                                              00988000
JSCBUFPT EQU   JSCBSEC3+92                                              00989000
JSCBSWSP EQU   JSCBSEC3+87                                              00990000
JSCRSV33 EQU   JSCBSEC3+86                                              00991000
JSCDDNUM EQU   JSCBSEC3+84                                              00992000
JSCRSV53 EQU   JSCBSEC3+82                                              00993000
JSCDDNNO EQU   JSCBSEC3+80                                              00994000
JSCBVATA EQU   JSCBSEC3+76                                              00995000
JSCTMCOR EQU   JSCBSEC3+72                                              00996000
JSCSCTP  EQU   JSCSCT+1                                                 00997000
JSCRSV55 EQU   JSCSCT                                                   00998000
JSCRSV54 EQU   JSCBSEC3+64                                              00999000
JSCDSABQ EQU   JSCBSEC3+60                                              01000000
JSCBSSIB EQU   JSCBSEC3+56                                              01001000
JSCBFRBA EQU   JSCBSEC3+48                                              01002000
JSCRSV28 EQU   JSCBSEC3+46                                              01003000
JSCBSONO EQU   JSCBSEC3+44                                              01004000
JSCBSUBA EQU   JSCBSUB+1                                                01005000
JSCRSV31 EQU   JSCBSUB                                                  01006000
JSCBSMLR EQU   JSCBSEC3+36                                              01007000
JSCBJNLR EQU   JSCBSEC3+32                                              01008000
JSCBJNLA EQU   JSCBJNL+1                                                01009000
JSCBJSBT EQU   JSCBJJSB                                                 01010000
JSCBJSBX EQU   JSCBJJSB                                                 01011000
JSCBJSBA EQU   JSCBJJSB                                                 01012000
JSCBJSBI EQU   JSCBJJSB                                                 01013000
@NM00036 EQU   JSCBJJSB                                                 01014000
JSCBJNLE EQU   JSCBJJSB                                                 01015000
JSCBJNLF EQU   JSCBJJSB                                                 01016000
JSCBJNLN EQU   JSCBJJSB                                                 01017000
@NM00035 EQU   JSCBSEC3+24                                              01018000
JSCBJRBA EQU   JSCBSEC3+16                                              01019000
JSCBIECB EQU   JSCBSEC3+12                                              01020000
JSCBRV08 EQU   JSCBSEC3+11                                              01021000
JSCBRV07 EQU   JSCBFBYT                                                 01022000
JSCBRV06 EQU   JSCBFBYT                                                 01023000
JSCBRV05 EQU   JSCBFBYT                                                 01024000
JSCBRV04 EQU   JSCBFBYT                                                 01025000
JSCBRV03 EQU   JSCBFBYT                                                 01026000
JSCBRV02 EQU   JSCBFBYT                                                 01027000
JSCBADSP EQU   JSCBFBYT                                                 01028000
JSCBRV01 EQU   JSCBFBYT                                                 01029000
JSCBTJID EQU   JSCBASID                                                 01030000
JSCBPSCB EQU   JSCBSEC3+4                                               01031000
JSCJCTP  EQU   JSCBJCTA                                                 01032000
JSCRSV24 EQU   JSCBJCT                                                  01033000
JSCBEND2 EQU   JSCBSEC2                                                 01034000
PSARSAV  EQU   PSARSVTE+60                                              01035000
PSARSTK  EQU   PSARSVTE+56                                              01036000
PSAESAV3 EQU   PSARSVTE+52                                              01037000
PSAESTK3 EQU   PSARSVTE+48                                              01038000
PSAESAV2 EQU   PSARSVTE+44                                              01039000
PSAESTK2 EQU   PSARSVTE+40                                              01040000
PSAESAV1 EQU   PSARSVTE+36                                              01041000
PSAESTK1 EQU   PSARSVTE+32                                              01042000
PSAPSAV  EQU   PSARSVTE+28                                              01043000
PSAPSTK  EQU   PSARSVTE+24                                              01044000
PSAMSAV  EQU   PSARSVTE+20                                              01045000
PSAMSTK  EQU   PSARSVTE+16                                              01046000
PSASSAV  EQU   PSARSVTE+12                                              01047000
PSASSTK  EQU   PSARSVTE+8                                               01048000
PSANSTK  EQU   PSARSVTE+4                                               01049000
PSACSTK  EQU   PSARSVTE                                                 01050000
@NM00041 EQU   USERBLK                                                  01051000
JNLRBN   EQU   JNLPARM+12                                               01052000
JNLPRLNG EQU   JNLPARM+9                                                01053000
JNLPID   EQU   JNLPARM+8                                                01054000
@NM00039 EQU   JNLPARM+2                                                01055000
@NM00038 EQU   JNLPRTCD                                                 01056000
JNLABSNT EQU   JNLPRTCD                                                 01057000
JNLERR   EQU   JNLPRTCD                                                 01058000
@NM00037 EQU   JNLPCALL                                                 01059000
JNLDRCT  EQU   JNLPCALL                                                 01060000
JNLINIT  EQU   JNLPCALL                                                 01061000
JNLSWAMI EQU   JNLPCALL                                                 01062000
JSCBCSCB EQU   JSCBSEC1+68                                              01063000
JSCBPMG  EQU   JSCBWTP+2                                                01064000
JSCBWTSP EQU   JSCBWTP+1                                                01065000
JSCRSV23 EQU   JSCBWTFG                                                 01066000
JSCRSV22 EQU   JSCBWTFG                                                 01067000
JSCRSV21 EQU   JSCBWTFG                                                 01068000
JSCRSV20 EQU   JSCBWTFG                                                 01069000
JSCRSV19 EQU   JSCBWTFG                                                 01070000
JSCRSV18 EQU   JSCBWTFG                                                 01071000
JSCBRET  EQU   JSCBWTFG                                                 01072000
JSCBIOFG EQU   JSCBWTFG                                                 01073000
@NM00034 EQU   JSCBSEC1+60                                              01074000
JSCBPMSG EQU   JSCBSWT1                                                 01075000
JSCRSV16 EQU   JSCBSWT1                                                 01076000
JSCRSV15 EQU   JSCBSWT1                                                 01077000
JSCRSV14 EQU   JSCBSWT1                                                 01078000
JSCRSV13 EQU   JSCBSWT1                                                 01079000
JSCRSV12 EQU   JSCBSWT1                                                 01080000
JSCRSV11 EQU   JSCBSWT1                                                 01081000
JSCBPASS EQU   JSCBSWT1                                                 01082000
JSCBTTTR EQU   JSCBSEC1+52                                              01083000
JSCRSV10 EQU   JSCBSEC1+49                                              01084000
JSCBAUTH EQU   JSCBOPTS                                                 01085000
JSCSIOTS EQU   JSCBOPTS                                                 01086000
JSCRSV08 EQU   JSCBOPTS                                                 01087000
JSCRSV07 EQU   JSCBOPTS                                                 01088000
JSCRSV06 EQU   JSCBOPTS                                                 01089000
JSCBLONG EQU   JSCBOPTS                                                 01090000
JSCRSV05 EQU   JSCBOPTS                                                 01091000
JSCRSV04 EQU   JSCBOPTS                                                 01092000
JSCBSECB EQU   JSCBSEC1+44                                              01093000
JSCRSV03 EQU   JSCBSEC1+41                                              01094000
JSCBSTEP EQU   JSCBSEC1+40                                              01095000
JSCBDCBA EQU   JSCBDCB+1                                                01096000
JSCRSV02 EQU   JSCBDCB                                                  01097000
JSCBID   EQU   JSCBSEC1+32                                              01098000
JSCBDBTB EQU   JSCBSEC1+28                                              01099000
JSCBIJSC EQU   JSCBSEC1+24                                              01100000
JSCBTCBP EQU   JSCBSEC1+20                                              01101000
JSCBPCC  EQU   JSCBSEC1+16                                              01102000
JSCBTCP  EQU   JSCBSEC1+12                                              01103000
JSCBSHR  EQU   JSCBSEC1+8                                               01104000
JSCHPCEA EQU   JSCHPCE+1                                                01105000
JSCRSV32 EQU   JSCHPCE                                                  01106000
JSCRSV01 EQU   JSCBSEC1                                                 01107000
@NM00033 EQU   IEZJSCB                                                  01108000
@NM00032 EQU   TCBXTNT2+32                                              01109000
TCBRV181 EQU   TCBRV173                                                 01110000
TCBRV180 EQU   TCBRV173                                                 01111000
TCBRV179 EQU   TCBRV173                                                 01112000
TCBRV178 EQU   TCBRV173                                                 01113000
TCBRV177 EQU   TCBRV173                                                 01114000
TCBRV176 EQU   TCBRV173                                                 01115000
TCBRV175 EQU   TCBRV173                                                 01116000
TCBRV174 EQU   TCBRV173                                                 01117000
TCBRV172 EQU   TCBRV164                                                 01118000
TCBRV171 EQU   TCBRV164                                                 01119000
TCBRV170 EQU   TCBRV164                                                 01120000
TCBRV169 EQU   TCBRV164                                                 01121000
TCBRV168 EQU   TCBRV164                                                 01122000
TCBRV167 EQU   TCBRV164                                                 01123000
TCBRV166 EQU   TCBRV164                                                 01124000
TCBRV165 EQU   TCBRV164                                                 01125000
TCBRV163 EQU   TCBRV155                                                 01126000
TCBRV162 EQU   TCBRV155                                                 01127000
TCBRV161 EQU   TCBRV155                                                 01128000
TCBRV160 EQU   TCBRV155                                                 01129000
TCBRV159 EQU   TCBRV155                                                 01130000
TCBRV158 EQU   TCBRV155                                                 01131000
TCBRV157 EQU   TCBRV155                                                 01132000
TCBRV156 EQU   TCBRV155                                                 01133000
TCBRV154 EQU   TCBRV146                                                 01134000
TCBRV153 EQU   TCBRV146                                                 01135000
TCBRV152 EQU   TCBRV146                                                 01136000
TCBRV151 EQU   TCBRV146                                                 01137000
TCBRV150 EQU   TCBRV146                                                 01138000
TCBRV149 EQU   TCBRV146                                                 01139000
TCBRV148 EQU   TCBRV146                                                 01140000
TCBRV147 EQU   TCBRV146                                                 01141000
TCBRV145 EQU   TCBXTNT2+26                                              01142000
TCBRV144 EQU   TCBXTNT2+24                                              01143000
TCBCAUF  EQU   TCBXTNT2+20                                              01144000
TCBRV142 EQU   TCBXTNT2+16                                              01145000
TCBRSV49 EQU   TCBXTNT2+12                                              01146000
TCBEVENT EQU   TCBXTNT2+8                                               01147000
TCBRCMP  EQU   TCBXTNT2+5                                               01148000
TCBRSVAB EQU   TCBXTNT2+4                                               01149000
TCBGTFA  EQU   TCBGTF+1                                                 01150000
TCBRSV47 EQU   TCBTFLG                                                  01151000
TCBRSV46 EQU   TCBTFLG                                                  01152000
TCBRSV45 EQU   TCBTFLG                                                  01153000
TCBRSV44 EQU   TCBTFLG                                                  01154000
TCBRSV43 EQU   TCBTFLG                                                  01155000
TCBDSPIT EQU   TCBTFLG                                                  01156000
TCBERRTN EQU   TCBTFLG                                                  01157000
TCBASYNC EQU   TCBTFLG                                                  01158000
@NM00031 EQU   TCB+296                                                  01159000
TCBSVCA2 EQU   TCB+292                                                  01160000
TCBDBTB  EQU   TCB+284                                                  01161000
TCBRPT   EQU   TCB+280                                                  01162000
TCBRV141 EQU   TCBRV133                                                 01163000
TCBRV140 EQU   TCBRV133                                                 01164000
TCBRV139 EQU   TCBRV133                                                 01165000
TCBRV138 EQU   TCBRV133                                                 01166000
TCBRV137 EQU   TCBRV133                                                 01167000
TCBRV136 EQU   TCBRV133                                                 01168000
TCBRV135 EQU   TCBRV133                                                 01169000
TCBRV134 EQU   TCBRV133                                                 01170000
TCBRV132 EQU   TCBRV124                                                 01171000
TCBRV131 EQU   TCBRV124                                                 01172000
TCBRV130 EQU   TCBRV124                                                 01173000
TCBRV129 EQU   TCBRV124                                                 01174000
TCBRV128 EQU   TCBRV124                                                 01175000
TCBRV127 EQU   TCBRV124                                                 01176000
TCBRV126 EQU   TCBRV124                                                 01177000
TCBRV125 EQU   TCBRV124                                                 01178000
TCBRV123 EQU   TCBFBYT2                                                 01179000
TCBRV122 EQU   TCBFBYT2                                                 01180000
TCBECBNV EQU   TCBFBYT2                                                 01181000
TCBSSSYN EQU   TCBFBYT2                                                 01182000
TCBFPRAP EQU   TCBFBYT2                                                 01183000
TCBFDW   EQU   TCBFBYT2                                                 01184000
TCBFMW   EQU   TCBFBYT2                                                 01185000
TCBCNCB  EQU   TCBFBYT2                                                 01186000
TCBLLH   EQU   TCBFBYT1                                                 01187000
TCBRV113 EQU   TCBFBYT1                                                 01188000
TCBEOT   EQU   TCBFBYT1                                                 01189000
TCBRTM2  EQU   TCBFBYT1                                                 01190000
TCBPGNLY EQU   TCBFBYT1                                                 01191000
TCBNDIOS EQU   TCBFBYT1                                                 01192000
TCBACTIV EQU   TCBFBYT1                                                 01193000
TCBEOTFM EQU   TCBFBYT1                                                 01194000
TCBAFFN  EQU   TCB+274                                                  01195000
TCBCCPVI EQU   TCB+272                                                  01196000
TCBUKYSP EQU   TCB+268                                                  01197000
TCBMODE  EQU   TCBESTAE+3                                               01198000
TCBERTYP EQU   TCBESTAE+2                                               01199000
TCBRV314 EQU   TCBESTRM                                                 01200000
TCBRV313 EQU   TCBESTRM                                                 01201000
TCBRV312 EQU   TCBESTRM                                                 01202000
TCBRV311 EQU   TCBESTRM                                                 01203000
TCBRV310 EQU   TCBESTRM                                                 01204000
TCBRV309 EQU   TCBESTRM                                                 01205000
TCBRV308 EQU   TCBESTRM                                                 01206000
TCBETERM EQU   TCBESTRM                                                 01207000
TCBSCBKY EQU   TCBESTAE                                                 01208000
TCBRTM12 EQU   TCB+260                                                  01209000
TCBTCBID EQU   TCB+256                                                  01210000
TCBRSV96 EQU   TCB+252                                                  01211000
TCBSWA   EQU   TCB+248                                                  01212000
TCBFOEA  EQU   TCBFOE+1                                                 01213000
TCBRSV42 EQU   TCBFOE                                                   01214000
TCBRV306 EQU   TCB+240                                                  01215000
TCBRSV41 EQU   TCB+239                                                  01216000
TCBTID   EQU   TCB+238                                                  01217000
TCBRSVAA EQU   TCB+237                                                  01218000
TCBABCUR EQU   TCB+236                                                  01219000
TCBTMSAV EQU   TCB+232                                                  01220000
TCBIOTIM EQU   TCB+228                                                  01221000
TCBRTWA  EQU   TCB+224                                                  01222000
TCBBACK  EQU   TCB+220                                                  01223000
TCBTIRB  EQU   TCB+216                                                  01224000
TCBAECB  EQU   TCB+212                                                  01225000
TCBEXT2A EQU   TCBEXT2+1                                                01226000
TCBRSV39 EQU   TCBEXT2                                                  01227000
TCBSTMCT EQU   TCB+207                                                  01228000
TCBSYSCT EQU   TCB+206                                                  01229000
TCBRSV37 EQU   TCB+205                                                  01230000
TCBEXSVC EQU   TCBDAR                                                   01231000
TCBDARMS EQU   TCBDAR                                                   01232000
TCBDARWT EQU   TCBDAR                                                   01233000
TCBDARO  EQU   TCBDAR                                                   01234000
TCBDARMC EQU   TCBDARC                                                  01235000
TCBDARD  EQU   TCBDAR                                                   01236000
TCBDARS  EQU   TCBDAR                                                   01237000
TCBDARP  EQU   TCBDAR                                                   01238000
TCBGTOFM EQU   TCBFLGS7                                                 01239000
TCBADMP  EQU   TCBFLGS7                                                 01240000
TCBRSTSK EQU   TCBFLGS7                                                 01241000
TCBSVCS  EQU   TCBFLGS7                                                 01242000
TCBSTACK EQU   TCBFLGS7                                                 01243000
TCBRSV34 EQU   TCBFLGS7                                                 01244000
TCBRSV33 EQU   TCBFLGS7                                                 01245000
TCBGPECB EQU   TCBFLGS7                                                 01246000
TCBNTJS  EQU   TCBFLGS6                                                 01247000
TCBAPG   EQU   TCBFLGS6                                                 01248000
TCBMIGR  EQU   TCBFLGS6                                                 01249000
TCBRV303 EQU   TCBFLGS6                                                 01250000
TCBSPVLK EQU   TCBFLGS6                                                 01251000
TCBCPU   EQU   TCBFLGS6                                                 01252000
TCBPIE17 EQU   TCBFLGS6                                                 01253000
TCBRV    EQU   TCBFLGS6                                                 01254000
TCBRSV79 EQU   TCBNDSP5                                                 01255000
TCBRSV78 EQU   TCBNDSP5                                                 01256000
TCBRSV77 EQU   TCBNDSP5                                                 01257000
TCBRSV76 EQU   TCBNDSP5                                                 01258000
TCBRSV75 EQU   TCBNDSP5                                                 01259000
TCBRSV74 EQU   TCBNDSP5                                                 01260000
TCBRSV95 EQU   TCBNDSP5                                                 01261000
TCBRSV94 EQU   TCBNDSP5                                                 01262000
TCBRSV93 EQU   TCBNDSP4                                                 01263000
TCBRSV92 EQU   TCBNDSP4                                                 01264000
TCBRSV91 EQU   TCBNDSP4                                                 01265000
TCBRSV90 EQU   TCBNDSP4                                                 01266000
TCBRSV89 EQU   TCBNDSP4                                                 01267000
TCBRSV88 EQU   TCBNDSP4                                                 01268000
TCBRSV87 EQU   TCBNDSP4                                                 01269000
TCBRSV86 EQU   TCBNDSP4                                                 01270000
TCBEXT1A EQU   TCBEXT1+1                                                01271000
TCBRSV32 EQU   TCBEXT1                                                  01272000
TCBEXCPD EQU   TCB+192                                                  01273000
TCBIOBRC EQU   TCB+188                                                  01274000
TCBDDWTC EQU   TCB+186                                                  01275000
TCBDDEXC EQU   TCB+184                                                  01276000
TCBJSCBB EQU   TCBJSCB+1                                                01277000
@NM00030 EQU   TCBRECDE                                                 01278000
TCBREC   EQU   TCBRECDE                                                 01279000
TCBMDIDS EQU   TCB+176                                                  01280000
TCBNDINT EQU   TCBNDSP3                                                 01281000
TCBRSV27 EQU   TCBNDSP3                                                 01282000
TCBRSV26 EQU   TCBNDSP3                                                 01283000
TCBRSV25 EQU   TCBNDSP3                                                 01284000
TCBRSV24 EQU   TCBNDSP3                                                 01285000
TCBSRBND EQU   TCBNDSP3                                                 01286000
TCBRV302 EQU   TCBNDSP3                                                 01287000
TCBLJSND EQU   TCBNDSP3                                                 01288000
TCBABE   EQU   TCBNDSP2                                                 01289000
TCBDSS   EQU   TCBNDSP2                                                 01290000
TCBOWAIT EQU   TCBNDSP2                                                 01291000
TCBIWAIT EQU   TCBNDSP2                                                 01292000
TCBNDTS  EQU   TCBNDSP2                                                 01293000
TCBNDSVC EQU   TCBNDSP2                                                 01294000
TCBSTPP  EQU   TCBNDSP2                                                 01295000
TCBABD   EQU   TCBNDSP2                                                 01296000
TCBRSV22 EQU   TCBNDSP1                                                 01297000
TCBPIEND EQU   TCBNDSP1                                                 01298000
TCBTPSP  EQU   TCBNDSP1                                                 01299000
TCBDDRND EQU   TCBNDSP1                                                 01300000
TCBRSPND EQU   TCBNDSP1                                                 01301000
TCBRSTND EQU   TCBNDSP1                                                 01302000
TCBDARPN EQU   TCBNDSP1                                                 01303000
TCBDARTN EQU   TCBNDSP1                                                 01304000
TCBNDSP0 EQU   TCBNDSP                                                  01305000
TCBUSER  EQU   TCB+168                                                  01306000
TCBTCTB  EQU   TCBTCT+1                                                 01307000
TCBRSV9C EQU   TCBTCTGF                                                 01308000
TCBRSV9B EQU   TCBTCTGF                                                 01309000
TCBRSV9A EQU   TCBTCTGF                                                 01310000
TCBRSV99 EQU   TCBTCTGF                                                 01311000
TCBRSV98 EQU   TCBTCTGF                                                 01312000
TCBRSV97 EQU   TCBTCTGF                                                 01313000
TCBRSV20 EQU   TCBTCTGF                                                 01314000
TCBSMFGF EQU   TCBTCTGF                                                 01315000
TCBSTABB EQU   TCBSTAB+1                                                01316000
TCBSTCUR EQU   TCBNSTAE                                                 01317000
TCBRV301 EQU   TCBNSTAE                                                 01318000
TCBSYNCH EQU   TCBNSTAE                                                 01319000
TCBHALT  EQU   TCBNSTAE                                                 01320000
TCBPPSUP EQU   TCBNSTAE                                                 01321000
TCB33E   EQU   TCBNSTAE                                                 01322000
TCBQUIES EQU   TCBNSTAE                                                 01323000
TCBSTABE EQU   TCBNSTAE                                                 01324000
TCBAQE   EQU   TCB+156                                                  01325000
TCBPQE   EQU   TCB+152                                                  01326000
TCBTSDP  EQU   TCB+151                                                  01327000
TCBTSLP  EQU   TCB+150                                                  01328000
TCBSTPCT EQU   TCB+149                                                  01329000
TCBCPUBN EQU   TCBTSFLG                                                 01330000
TCBDYDSP EQU   TCBTSFLG                                                 01331000
TCBRSV18 EQU   TCBTSFLG                                                 01332000
TCBRSV17 EQU   TCBTSFLG                                                 01333000
TCBTIOTG EQU   TCBTSFLG                                                 01334000
TCBATT   EQU   TCBTSFLG                                                 01335000
TCBSTPPR EQU   TCBTSFLG                                                 01336000
TCBRV300 EQU   TCBTSTSK                                                 01337000
TCBECB   EQU   TCB+144                                                  01338000
TCBIQE   EQU   TCB+140                                                  01339000
TCBLTC   EQU   TCB+136                                                  01340000
TCBOTC   EQU   TCB+132                                                  01341000
TCBNTC   EQU   TCB+128                                                  01342000
TCBJSTCA EQU   TCBJSTCB+1                                               01343000
TCBRSV16 EQU   TCBJSTCB                                                 01344000
TCBTQET  EQU   TCBTME                                                   01345000
TCBTCB   EQU   TCB+116                                                  01346000
TCBFSAB  EQU   TCBFSA+1                                                 01347000
TCBQEL   EQU   TCBFSA                                                   01348000
TCBGRS15 EQU   TCBGRS+60                                                01349000
TCBGRS14 EQU   TCBGRS+56                                                01350000
TCBGRS13 EQU   TCBGRS+52                                                01351000
TCBGRS12 EQU   TCBGRS+48                                                01352000
TCBGRS11 EQU   TCBGRS+44                                                01353000
TCBGRS10 EQU   TCBGRS+40                                                01354000
TCBGRS9  EQU   TCBGRS+36                                                01355000
TCBGRS8  EQU   TCBGRS+32                                                01356000
TCBGRS7  EQU   TCBGRS+28                                                01357000
TCBGRS6  EQU   TCBGRS+24                                                01358000
TCBGRS5  EQU   TCBGRS+20                                                01359000
TCBGRS4  EQU   TCBGRS+16                                                01360000
TCBGRS3  EQU   TCBGRS+12                                                01361000
TCBGRS2  EQU   TCBGRS+8                                                 01362000
TCBGRS1  EQU   TCBGRS+4                                                 01363000
TCBGRS0  EQU   TCBGRS                                                   01364000
TCBJPQB  EQU   TCBJPQ+1                                                 01365000
TCBRSV15 EQU   TCBPURGE                                                 01366000
TCBRSV14 EQU   TCBPURGE                                                 01367000
TCBRSV13 EQU   TCBPURGE                                                 01368000
TCBRSV12 EQU   TCBPURGE                                                 01369000
TCBRSV11 EQU   TCBPURGE                                                 01370000
TCBRSV10 EQU   TCBPURGE                                                 01371000
TCBRSV09 EQU   TCBPURGE                                                 01372000
TCBJPQF  EQU   TCBPURGE                                                 01373000
TCBJLB   EQU   TCB+40                                                   01374000
TCBLLS   EQU   TCB+36                                                   01375000
TCBDSP   EQU   TCB+35                                                   01376000
TCBLMP   EQU   TCB+34                                                   01377000
TCBPNDSP EQU   TCBFLGS5                                                 01378000
TCBFCD1  EQU   TCBFLGS5                                                 01379000
TCBSTP   EQU   TCBFLGS5                                                 01380000
TCBSYS   EQU   TCBFLGS5                                                 01381000
TCBANDSP EQU   TCBFLGS5                                                 01382000
TCBPAGE  EQU   TCBFLGS5                                                 01383000
TCBUXNDF EQU   TCBABWF                                                  01384000
TCBFC    EQU   TCBFLGS5                                                 01385000
TCBONDSP EQU   TCBFLGS4                                                 01386000
TCBMPCND EQU   TCBFLGS4                                                 01387000
TCBMPCVQ EQU   TCBFLGS4                                                 01388000
TCBUXNDV EQU   TCBFLGS4                                                 01389000
TCBHNDSP EQU   TCBFLGS4                                                 01390000
TCBRQENA EQU   TCBFLGS4                                                 01391000
TCBSER   EQU   TCBFLGS4                                                 01392000
TCBNDUMP EQU   TCBFLGS4                                                 01393000
TCBDWSTA EQU   TCBFLGS3                                                 01394000
TCBRSV08 EQU   TCBFLGS3                                                 01395000
TCBRSV07 EQU   TCBFLGS3                                                 01396000
TCBRSV06 EQU   TCBFLGS3                                                 01397000
TCBABGM  EQU   TCBFLGS3                                                 01398000
TCBABTRM EQU   TCBFLGS3                                                 01399000
TCBADINP EQU   TCBFLGS3                                                 01400000
TCBFSM   EQU   TCBFLGS3                                                 01401000
TCBFTS   EQU   TCBFLGS2                                                 01402000
TCBFETXR EQU   TCBFLGS2                                                 01403000
TCBFDSOP EQU   TCBFLGS2                                                 01404000
TCBFJMC  EQU   TCBFLGS2                                                 01405000
TCBFSMC  EQU   TCBFLGS2                                                 01406000
TCBFABOP EQU   TCBFLGS2                                                 01407000
TCBFSTI  EQU   TCBFLGS2                                                 01408000
TCBFOINP EQU   TCBFLGS2                                                 01409000
TCBFX    EQU   TCBFLGS1                                                 01410000
TCBFS    EQU   TCBFLGS1                                                 01411000
TCBFT    EQU   TCBFLGS1                                                 01412000
TCBPDUMP EQU   TCBFLGS1                                                 01413000
TCBNONPR EQU   TCBFLGS1                                                 01414000
TCBFERA  EQU   TCBFLGS1                                                 01415000
TCBFE    EQU   TCBFLGS1                                                 01416000
TCBFA    EQU   TCBFLGS1                                                 01417000
TCBZERO  EQU   TCBPKF                                                   01418000
TCBFLAG  EQU   TCBPKF                                                   01419000
TCBMSSB  EQU   TCBMSS+1                                                 01420000
TCBRSV03 EQU   TCBMSS                                                   01421000
TCBTRNB  EQU   TCBTRN+1                                                 01422000
TCBRSV02 EQU   TCBABF                                                   01423000
TCBOLTEP EQU   TCBABF                                                   01424000
TCBTCP   EQU   TCBABF                                                   01425000
TCBTCPP  EQU   TCBABF                                                   01426000
TCBRSV01 EQU   TCBABF                                                   01427000
TCBGRPH  EQU   TCBABF                                                   01428000
TCBNOCHK EQU   TCBABF                                                   01429000
TCBMOD91 EQU   TCBABF                                                   01430000
TCBCMPC  EQU   TCBCMP+1                                                 01431000
TCBRV318 EQU   TCBCMSG                                                  01432000
TCBRV317 EQU   TCBCIND                                                  01433000
TCBRV316 EQU   TCBCWTO                                                  01434000
TCBCASID EQU   TCBCDBL                                                  01435000
TCBNOCC  EQU   TCBSTCC                                                  01436000
TCBDMPO  EQU   TCBCPP                                                   01437000
TCBCSTEP EQU   TCBCMPF                                                  01438000
TCBCREQ  EQU   TCBCMPF                                                  01439000
TCBTIO   EQU   TCB+12                                                   01440000
TCBDEB   EQU   TCB+8                                                    01441000
TCBPIEA  EQU   TCBPIE+1                                                 01442000
TCBPM    EQU   TCBPMASK                                                 01443000
@NM00029 EQU   TCBPMASK                                                 01444000
TCBRBP   EQU   TCB                                                      01445000
TCBFRS6  EQU   TCBFRS+24                                                01446000
TCBFRS4  EQU   TCBFRS+16                                                01447000
TCBFRS2  EQU   TCBFRS+8                                                 01448000
TCBFRS0  EQU   TCBFRS                                                   01449000
@NM00004 EQU   SWAQMPA+1                                                01450000
QMPACL   EQU   QMPCL+1                                                  01451000
QMPNC    EQU   QMPCMNC                                                  01452000
QMPCM    EQU   QMPCMNC                                                  01453000
QMEIA    EQU   QMPA+28                                                  01454000
QMWTQ    EQU   QMPA+24                                                  01455000
QMRSD1   EQU   QMPA+22                                                  01456000
QMTID    EQU   QMPA+20                                                  01457000
QMLNK    EQU   QMPA+18                                                  01458000
QMPRI    EQU   QMPA+17                                                  01459000
@NM00003 EQU   QMSTA                                                    01460000
QMSJNL   EQU   QMSTA                                                    01461000
@NM00002 EQU   QMSTA                                                    01462000
QMTPY    EQU   QMPA+15                                                  01463000
QMNOT    EQU   QMPA+14                                                  01464000
QMTLN    EQU   QMPA+12                                                  01465000
QMTST    EQU   QMPA+11                                                  01466000
QMFLT    EQU   QMPA+9                                                   01467000
QMPOP    EQU   QMPA+8                                                   01468000
QMPEB    EQU   QMNAM+4                                                  01469000
QMCAN    EQU   QMNAM                                                    01470000
@NM00001 EQU   SWPSTA                                                   01471000
@NM00028 EQU   PSA+3668                                                 01472000
PSASTAK  EQU   PSA+3072                                                 01473000
@NM00027 EQU   PSA+1048                                                 01474000
PSAUSEND EQU   PSA+1048                                                 01475000
PSARV062 EQU   PSA+1044                                                 01476000
PSACDAL  EQU   PSA+1040                                                 01477000
PSAWTCOD EQU   PSA+1036                                                 01478000
PSAATCVT EQU   PSA+1032                                                 01479000
PSAPCPSW EQU   PSA+1024                                                 01480000
PSAPIR2  EQU   PSA+1020                                                 01481000
PSARV059 EQU   PSA+1018                                                 01482000
PSASVC13 EQU   PSA+1016                                                 01483000
PSALSFCC EQU   PSA+1012                                                 01484000
PSASFACC EQU   PSA+1008                                                 01485000
PSASTOP  EQU   PSA+992                                                  01486000
PSASTART EQU   PSA+976                                                  01487000
PSARSPSW EQU   PSA+968                                                  01488000
PSASRPSW EQU   PSA+960                                                  01489000
PSARV045 EQU   PSA+892                                                  01490000
PSARV044 EQU   PSA+888                                                  01491000
PSARV043 EQU   PSA+884                                                  01492000
PSARV042 EQU   PSA+880                                                  01493000
PSARV041 EQU   PSA+876                                                  01494000
PSARV040 EQU   PSA+872                                                  01495000
PSARV025 EQU   PSA+868                                                  01496000
PSADSSED EQU   PSA+868                                                  01497000
PSADSSPR EQU   PSA+864                                                  01498000
PSADSSFW EQU   PSA+860                                                  01499000
PSADSS14 EQU   PSA+856                                                  01500000
PSADSSPP EQU   PSA+848                                                  01501000
PSADSSRP EQU   PSA+840                                                  01502000
PSADSS05 EQU   PSADSSF4                                                 01503000
PSADSS10 EQU   PSADSSF4                                                 01504000
PSADSSVE EQU   PSADSSF4                                                 01505000
PSADSSDE EQU   PSADSSF4                                                 01506000
PSADSSC0 EQU   PSADSSF4                                                 01507000
PSADSSIE EQU   PSADSSF4                                                 01508000
PSADSS12 EQU   PSADSSF4                                                 01509000
PSADSSRC EQU   PSADSSF4                                                 01510000
PSARV057 EQU   PSADSSF3                                                 01511000
PSARV056 EQU   PSADSSF3                                                 01512000
PSARV055 EQU   PSADSSF3                                                 01513000
PSADSSMC EQU   PSADSSF3                                                 01514000
PSADSSRW EQU   PSADSSF3                                                 01515000
PSADSSNM EQU   PSADSSF3                                                 01516000
PSADSSES EQU   PSADSSF3                                                 01517000
PSADSSGP EQU   PSADSSF3                                                 01518000
PSADSSF2 EQU   PSADSSFL+1                                               01519000
PSADSSPI EQU   PSADSSF1                                                 01520000
PSADSSOI EQU   PSADSSF1                                                 01521000
PSADSSSP EQU   PSADSSF1                                                 01522000
PSADSSTP EQU   PSADSSF1                                                 01523000
PSADSSDW EQU   PSADSSF1                                                 01524000
PSADSSDD EQU   PSADSSF1                                                 01525000
PSADSSDM EQU   PSADSSF1                                                 01526000
PSADSSMV EQU   PSADSSF1                                                 01527000
PSADSSTS EQU   PSA+816                                                  01528000
PSADSSWK EQU   PSA+812                                                  01529000
PSADSSR3 EQU   PSA+808                                                  01530000
PSADSSR2 EQU   PSA+804                                                  01531000
PSADSSRS EQU   PSA+800                                                  01532000
PSASTOR  EQU   PSA+796                                                  01533000
PSACPUSA EQU   PSA+794                                                  01534000
PSAVSTAP EQU   PSA+792                                                  01535000
PSAWKVAP EQU   PSA+788                                                  01536000
PSAWKRAP EQU   PSA+784                                                  01537000
PSAMCHIC EQU   PSA+783                                                  01538000
PSARV061 EQU   PSA+782                                                  01539000
PSASYMSK EQU   PSA+781                                                  01540000
PSAMCHFL EQU   PSA+780                                                  01541000
PSACR0   EQU   PSA+776                                                  01542000
PSAPSWSV EQU   PSA+768                                                  01543000
PSALITA  EQU   PSA+764                                                  01544000
PSACLHS  EQU   PSAHLHI                                                  01545000
PSALKR15 EQU   PSALKSA+60                                               01546000
PSALKR14 EQU   PSALKSA+56                                               01547000
PSALKR13 EQU   PSALKSA+52                                               01548000
PSALKR12 EQU   PSALKSA+48                                               01549000
PSALKR11 EQU   PSALKSA+44                                               01550000
PSALKR10 EQU   PSALKSA+40                                               01551000
PSALKR9  EQU   PSALKSA+36                                               01552000
PSALKR8  EQU   PSALKSA+32                                               01553000
PSALKR7  EQU   PSALKSA+28                                               01554000
PSALKR6  EQU   PSALKSA+24                                               01555000
PSALKR5  EQU   PSALKSA+20                                               01556000
PSALKR4  EQU   PSALKSA+16                                               01557000
PSALKR3  EQU   PSALKSA+12                                               01558000
PSALKR2  EQU   PSALKSA+8                                                01559000
PSALKR1  EQU   PSALKSA+4                                                01560000
PSALKR0  EQU   PSALKSA                                                  01561000
PSARV023 EQU   PSACLHT+52                                               01562000
PSALOCAL EQU   PSACLHT+48                                               01563000
PSACMSL  EQU   PSACLHT+44                                               01564000
PSAOPTL  EQU   PSACLHT+40                                               01565000
PSATPACL EQU   PSACLHT+36                                               01566000
PSATPDNL EQU   PSACLHT+32                                               01567000
PSATPNCL EQU   PSACLHT+28                                               01568000
PSAIOSLL EQU   PSACLHT+24                                               01569000
PSAIOSUL EQU   PSACLHT+20                                               01570000
PSAIOSCL EQU   PSACLHT+16                                               01571000
PSAIOSSL EQU   PSACLHT+12                                               01572000
PSASALCL EQU   PSACLHT+8                                                01573000
PSAASML  EQU   PSACLHT+4                                                01574000
PSADISPL EQU   PSACLHT                                                  01575000
PSASRSA  EQU   PSA+636                                                  01576000
PSARV050 EQU   PSA+634                                                  01577000
PSADSSGO EQU   PSA+633                                                  01578000
PSARECUR EQU   PSA+632                                                  01579000
PSAHLHIS EQU   PSA+628                                                  01580000
PSAIPCSA EQU   PSA+624                                                  01581000
@NM00026 EQU   PSA+621                                                  01582000
PSAIPCDM EQU   PSA+620                                                  01583000
PSAIPCD  EQU   PSA+616                                                  01584000
@NM00025 EQU   PSA+613                                                  01585000
PSAIPCRM EQU   PSA+612                                                  01586000
PSAIPCR  EQU   PSA+608                                                  01587000
PSAMCHEX EQU   PSA+600                                                  01588000
PSAMPSW  EQU   PSA+592                                                  01589000
PSAEXPS2 EQU   PSA+584                                                  01590000
PSAEXPS1 EQU   PSA+576                                                  01591000
PSAPIREG EQU   PSA+572                                                  01592000
PSARSREG EQU   PSA+568                                                  01593000
PSAGPREG EQU   PSA+556                                                  01594000
PSARV022 EQU   PSASUP4                                                  01595000
PSARV021 EQU   PSASUP4                                                  01596000
PSARV020 EQU   PSASUP4                                                  01597000
PSARV019 EQU   PSASUP4                                                  01598000
PSARV018 EQU   PSASUP4                                                  01599000
PSARV017 EQU   PSASUP4                                                  01600000
PSARV016 EQU   PSASUP4                                                  01601000
PSARV015 EQU   PSASUP4                                                  01602000
PSARV014 EQU   PSASUP3                                                  01603000
PSAULCMS EQU   PSASUP3                                                  01604000
PSARV012 EQU   PSASUP3                                                  01605000
PSAESTA  EQU   PSASUP3                                                  01606000
PSASPR   EQU   PSASUP3                                                  01607000
PSAPSREG EQU   PSASUP3                                                  01608000
PSAPI2   EQU   PSASUP3                                                  01609000
PSAIOSUP EQU   PSASUP3                                                  01610000
PSALCR   EQU   PSASUP2                                                  01611000
PSARTM   EQU   PSASUP2                                                  01612000
PSAACR   EQU   PSASUP2                                                  01613000
PSAIPCE2 EQU   PSASUP2                                                  01614000
PSAIPCES EQU   PSASUP2                                                  01615000
PSAIPCEC EQU   PSASUP2                                                  01616000
PSAGTF   EQU   PSASUP2                                                  01617000
PSAIPCRI EQU   PSASUP2                                                  01618000
PSATYPE6 EQU   PSASUP1                                                  01619000
PSATCTL  EQU   PSASUP1                                                  01620000
PSADISP  EQU   PSASUP1                                                  01621000
PSALOCK  EQU   PSASUP1                                                  01622000
PSAPI    EQU   PSASUP1                                                  01623000
PSAEXT   EQU   PSASUP1                                                  01624000
PSASVC   EQU   PSASUP1                                                  01625000
PSAIO    EQU   PSASUP1                                                  01626000
PSAAOLD  EQU   PSA+548                                                  01627000
PSAANEW  EQU   PSA+544                                                  01628000
PSATNEW  EQU   PSA+536                                                  01629000
PSALCCAR EQU   PSA+532                                                  01630000
PSALCCAV EQU   PSA+528                                                  01631000
PSAPCCAR EQU   PSA+524                                                  01632000
PSAPCCAV EQU   PSA+520                                                  01633000
PSACPULA EQU   PSA+518                                                  01634000
PSACPUPA EQU   PSA+516                                                  01635000
PSAPSA   EQU   PSA+512                                                  01636000
FLCHDEND EQU   PSA+512                                                  01637000
FLCCRSAV EQU   FLCMCLA+280                                              01638000
FLCGRSAV EQU   FLCMCLA+216                                              01639000
FLCFPSAV EQU   FLCMCLA+184                                              01640000
FLCFLA   EQU   FLCMCLA+88                                               01641000
FLCRGNCD EQU   FLCMCLA+84                                               01642000
FLCFSAA  EQU   FLCFSA+1                                                 01643000
@NM00024 EQU   FLCFSA                                                   01644000
@NM00023 EQU   FLCMCLA+72                                               01645000
FLCMCIC  EQU   FLCMCLA+64                                               01646000
@NM00022 EQU   FLCMCLA+20                                               01647000
FLCIOAA  EQU   FLCIOA+1                                                 01648000
@NM00021 EQU   FLCIOA                                                   01649000
@NM00020 EQU   FLCMCLA+15                                               01650000
@NM00019 EQU   FLCMCLA+14                                               01651000
@NM00018 EQU   FLCMCLA+12                                               01652000
FLCLCL   EQU   FLCMCLA+8                                                01653000
FLCIOELA EQU   FLCIOEL+1                                                01654000
@NM00017 EQU   FLCIOEL                                                  01655000
FLCCHNID EQU   FLCMCLA                                                  01656000
@NM00016 EQU   PSA+160                                                  01657000
FLCMTRCD EQU   PSA+157                                                  01658000
@NM00015 EQU   PSA+156                                                  01659000
FLCPERA  EQU   FLCPER+1                                                 01660000
@NM00014 EQU   FLCPER                                                   01661000
@NM00013 EQU   PSA+151                                                  01662000
FLCPERCD EQU   PSA+150                                                  01663000
FLCMCNUM EQU   PSA+149                                                  01664000
@NM00012 EQU   PSA+148                                                  01665000
FLCTEAA  EQU   FLCTEA+1                                                 01666000
@NM00011 EQU   FLCTEA                                                   01667000
PSAPIPC  EQU   PSAPICOD                                                 01668000
PSAPIMC  EQU   PSAPICOD                                                 01669000
PSAPIPER EQU   PSAPICOD                                                 01670000
PSARV049 EQU   FLCPICOD                                                 01671000
FLCPILCB EQU   FLCPIILC                                                 01672000
@NM00010 EQU   FLCPIILC                                                 01673000
@NM00009 EQU   PSAEPPSW                                                 01674000
FLCSVCN  EQU   PSAESPSW+2                                               01675000
FLCSILCB EQU   FLCSVILC                                                 01676000
@NM00008 EQU   FLCSVILC                                                 01677000
@NM00007 EQU   PSAESPSW                                                 01678000
FLCEICOD EQU   PSAEEPSW+2                                               01679000
PSASPAD  EQU   PSAEEPSW                                                 01680000
@NM00006 EQU   PSA+128                                                  01681000
FLCINPSW EQU   PSA+120                                                  01682000
FLCMNPSW EQU   PSA+112                                                  01683000
FLCPNPSW EQU   PSA+104                                                  01684000
FLCSNPSW EQU   PSA+96                                                   01685000
FLCENPSW EQU   PSA+88                                                   01686000
FLCTRACE EQU   PSA+84                                                   01687000
FLCTIMER EQU   PSA+80                                                   01688000
FLCCVT2  EQU   PSA+76                                                   01689000
FLCCAW   EQU   PSA+72                                                   01690000
FLCCSW   EQU   PSA+64                                                   01691000
FLCIOPSW EQU   PSA+56                                                   01692000
FLCMOPSW EQU   PSA+48                                                   01693000
FLCPOPSW EQU   PSA+40                                                   01694000
FLCSOPSW EQU   PSA+32                                                   01695000
FLCEOPSW EQU   PSA+24                                                   01696000
@NM00005 EQU   FLCICCW2+4                                               01697000
FLCCVT   EQU   FLCICCW2                                                 01698000
FLCICCW1 EQU   FLCROPSW                                                 01699000
FLCIPPSW EQU   FLCRNPSW                                                 01700000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01701000
@RF00179 EQU   @EL00003                                                 01702000
@PB00004 EQU   @PB00005                                                 01703000
@PB00003 EQU   @PB00004                                                 01704000
@PB00002 EQU   @PB00003                                                 01705000
@ENDDATA EQU   *                                                        01706000
         END   IEFQB555,(C'PLS1820',0701,78059)                         01707000
./  ADD  SSI=41070303,NAME=IEFQB580
         TITLE 'IEFQB580 - QMNGRIO INTERFACE TO SWA MANAGER            *00001000
                        '                                               00002000
IEFQB580 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IEFQB580  74.107'                                 0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@05,12(@13)                                     0001 00010000
         BALR  @05,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@05                                         0001 00013000
*   QMIOPPTR=R1;                    /* BASE FOR PARM LIST            */ 00014000
         LR    QMIOPPTR,R1                                         0031 00015000
*   QMPAPTR=QMIWRKAD;               /* QMPA IS AT START OF WORK AREA */ 00016000
         L     QMPAPTR,QMIWRKAD(,QMIOPPTR)                         0032 00017000
*   IF(QMIOREAD='1'B&QMIOWRTE='1'B)|/* ARE BOTH READ AND WRITE       */ 00018000
*       (QMIOREAD='0'B&QMIOWRTE='0'B) THEN/* BITS ON OR BOTH OFF     */ 00019000
         TM    QMIOREAD(QMIOPPTR),B'11000000'                      0033 00020000
         BO    @RT00033                                            0033 00021000
         TM    QMIOREAD(QMIOPPTR),B'11000000'                      0033 00022000
         BNZ   @RF00033                                            0033 00023000
@RT00033 DS    0H                                                  0034 00024000
*     DO;                           /* IF SO, IT'S AN ERROR          */ 00025000
*       RESPECIFY                                                  0035 00026000
*        (R4,                                                      0035 00027000
*         R15) RESTRICTED;                                         0035 00028000
*       R15=INVRDWRT;               /* PUT ERROR CODE IN REG 15      */ 00029000
         LA    R15,24                                              0036 00030000
*       R4=ZEROBZER;                /* PUT ABEND CODE IN REG 4       */ 00031000
         LA    R4,176                                              0037 00032000
*       GEN(ABEND (R4),,,SYSTEM);   /* ISSUE ABEND                   */ 00033000
         ABEND (R4),,,SYSTEM                                            00034000
*       RESPECIFY                                                  0039 00035000
*        (R4,                                                      0039 00036000
*         R15) UNRESTRICTED;        /* RELEASE FOR PLS USE           */ 00037000
*     END;                                                         0040 00038000
*   IF QMIOREAD='1'B THEN           /* IS THIS A READ REQUEST        */ 00039000
@RF00033 TM    QMIOREAD(QMIOPPTR),B'10000000'                      0041 00040000
         BNO   @RF00041                                            0041 00041000
*     QMPOP=READ;                   /* YES, SET FUNCTION CODE TO READ*/ 00042000
         MVI   QMPOP(QMPAPTR),X'04'                                0042 00043000
*   ELSE                                                           0043 00044000
*     QMPOP=WRITE;                  /* SET FUNCTION CODE TO WRITE    */ 00045000
         B     @RC00041                                            0043 00046000
@RF00041 MVI   QMPOP(QMPAPTR),X'03'                                0043 00047000
*   QMSTA=ZERO;                     /* CLEAR QMSJNL           YM06103*/ 00048000
@RC00041 MVI   QMSTA(QMPAPTR),X'00'                                0044 00049000
*   QMPCL=QMPAPTR+LENGTH(QMPA);     /* INSERT EPA POINTER IN QMPA    */ 00050000
         LA    @04,36                                              0045 00051000
         ALR   @04,QMPAPTR                                         0045 00052000
         ST    @04,QMPCL(,QMPAPTR)                                 0045 00053000
*   QMPNC='0001'B;                  /* SET COUNT TO 1                */ 00054000
         NI    QMPNC(QMPAPTR),B'11110001'                          0046 00055000
         OI    QMPNC(QMPAPTR),B'00000001'                          0046 00056000
*   SWBUFPTR=QMIRECAD;              /* INSERT BUFFER ADDRESS IN EPA  */ 00057000
         L     @04,QMPACL-1(,QMPAPTR)                              0047 00058000
         LA    @04,0(,@04)                                         0047 00059000
         MVC   SWBUFPTR(4,@04),QMIRECAD(QMIOPPTR)                  0047 00060000
*   SWSVAZRO=QMIDSKAD;              /* FOR OS/VS2 THIS IS A SVA0.  0048 00061000
*                                      MOVE IT FROM PARM LIST TO EPA */ 00062000
         MVC   SWSVAZRO(4,@04),QMIDSKAD(QMIOPPTR)                  0048 00063000
*/* MOVE REGISTER CONTENTS OF R14 THROUGH R5 FROM CALLERS SAVE AREA TO  00064000
*   WORK AREA                                                        */ 00065000
*                                                                  0049 00066000
*   EVAL(QMPAPTR+LENGTH(QMPA)+LENGTH(SWAMMEPA))->SAVEREGS=EVAL(R13+     00067000
*       R14DISP)->SAVEREGS;                                        0049 00068000
         LA    @04,44                                              0049 00069000
         ALR   @04,QMPAPTR                                         0049 00070000
         LA    @02,12                                              0049 00071000
         ALR   @02,R13                                             0049 00072000
         MVC   SAVEREGS(32,@04),SAVEREGS(@02)                      0049 00073000
*   CALL IEFQB550;                  /* THIS WILL CALL THE SWA MANAGER*/ 00074000
         L     @15,@CV00119                                        0050 00075000
         BALR  @14,@15                                             0050 00076000
*/* MOVE REGISTER CONTENTS OF R14 THROUGH R5 FROM WORK AREA BACK INTO   00077000
*   CALLERS SAVE AREA                                                */ 00078000
*                                                                  0051 00079000
*   EVAL(R13+R14DISP)->SAVEREGS=EVAL(QMPAPTR+LENGTH(QMPA)+LENGTH(  0051 00080000
*       SWAMMEPA))->SAVEREGS;                                      0051 00081000
         LA    @04,12                                              0051 00082000
         ALR   @04,R13                                             0051 00083000
         LA    @02,44                                              0051 00084000
         ALR   @02,QMPAPTR                                         0051 00085000
         MVC   SAVEREGS(32,@04),SAVEREGS(@02)                      0051 00086000
*   RETURN CODE(0);                 /* RETURN WITH RC=0              */ 00087000
         SLR   @15,@15                                             0052 00088000
         L     @14,12(,@13)                                        0052 00089000
         LM    @00,@05,20(@13)                                     0052 00090000
         BR    @14                                                 0052 00091000
*   END IEFQB580                    /* END OF PROCEDURE            0053 00092000
*                                                                    */ 00093000
*                                                                  0053 00094000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00095000
*/*%INCLUDE SYSLIB  (IEFQMIOP)                                       */ 00096000
*/*%INCLUDE SYSLIB  (IEFZB506)                                       */ 00097000
*/*%INCLUDE SYSLIB  (IEFQMNGR)                                       */ 00098000
*                                                                  0053 00099000
*       ;                                                          0053 00100000
@DATA    DS    0H                                                       00101000
@DATD    DSECT                                                          00102000
         DS    0F                                                       00103000
@ZTEMPS  DS    C                                                        00104000
@ZTEMPND EQU   *                                                        00105000
@ZLEN    EQU   @ZTEMPND-@ZTEMPS                                         00106000
IEFQB580 CSECT                                                          00107000
         DS    0F                                                       00108000
@DATD    DSECT                                                          00109000
         DS    0D                                                       00110000
EPAPTR   DS    A                                                        00111000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00112000
@ENDDATD EQU   *                                                        00113000
IEFQB580 CSECT                                                          00114000
         DS    0F                                                       00115000
@SIZDATD DC    AL1(0)                                                   00116000
         DC    AL3(@ENDDATD-@DATD)                                      00117000
@CV00119 DC    V(IEFQB550)                                              00118000
         DS    0D                                                       00119000
QB580PCH DS    CL40                                                     00120000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00121000
@01      EQU   01                                                       00122000
@02      EQU   02                                                       00123000
@03      EQU   03                                                       00124000
@04      EQU   04                                                       00125000
@05      EQU   05                                                       00126000
@06      EQU   06                                                       00127000
@07      EQU   07                                                       00128000
@08      EQU   08                                                       00129000
@09      EQU   09                                                       00130000
@10      EQU   10                                                       00131000
@11      EQU   11                                                       00132000
@12      EQU   12                                                       00133000
@13      EQU   13                                                       00134000
@14      EQU   14                                                       00135000
@15      EQU   15                                                       00136000
R6       EQU   @06                                                      00137000
R7       EQU   @07                                                      00138000
R8       EQU   @08                                                      00139000
R9       EQU   @09                                                      00140000
R10      EQU   @10                                                      00141000
R11      EQU   @11                                                      00142000
R12      EQU   @12                                                      00143000
QMIOPPTR EQU   @03                                                      00144000
QMPAPTR  EQU   @01                                                      00145000
R1       EQU   @01                                                      00146000
R4       EQU   @04                                                      00147000
R13      EQU   @13                                                      00148000
R15      EQU   @15                                                      00149000
QMIOP    EQU   0                                                        00150000
QMIRECAD EQU   QMIOP+4                                                  00151000
QMIWRKAD EQU   QMIOP+8                                                  00152000
QMIDSKAD EQU   QMIOP+12                                                 00153000
QMIFLAGS EQU   QMIOP+18                                                 00154000
QMIOREAD EQU   QMIFLAGS                                                 00155000
QMIOWRTE EQU   QMIFLAGS                                                 00156000
SWAMMEPA EQU   0                                                        00157000
SWBUFPTR EQU   SWAMMEPA                                                 00158000
QMPA     EQU   0                                                        00159000
QMNAM    EQU   QMPA                                                     00160000
QMPOP    EQU   QMPA+8                                                   00161000
QMSTA    EQU   QMPA+16                                                  00162000
QMPCL    EQU   QMPA+32                                                  00163000
QMPCMNC  EQU   QMPCL                                                    00164000
QMPNC    EQU   QMPCMNC                                                  00165000
QMPACL   EQU   QMPCL+1                                                  00166000
SWAQMPA  EQU   0                                                        00167000
SAVEREGS EQU   0                                                        00168000
SWSVAZRO EQU   SWAMMEPA+4                                               00169000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00170000
REGS     EQU   SAVEREGS                                                 00171000
QMRBN    EQU   SWAQMPA+12                                               00172000
@NM00010 EQU   SWAQMPA+1                                                00173000
QMSWSP   EQU   SWAQMPA                                                  00174000
QMPCM    EQU   QMPCMNC                                                  00175000
QMEIA    EQU   QMPA+28                                                  00176000
QMWTQ    EQU   QMPA+24                                                  00177000
QMRSD1   EQU   QMPA+22                                                  00178000
QMTID    EQU   QMPA+20                                                  00179000
QMLNK    EQU   QMPA+18                                                  00180000
QMPRI    EQU   QMPA+17                                                  00181000
@NM00009 EQU   QMSTA                                                    00182000
QMSJNL   EQU   QMSTA                                                    00183000
@NM00008 EQU   QMSTA                                                    00184000
QMTPY    EQU   QMPA+15                                                  00185000
QMNOT    EQU   QMPA+14                                                  00186000
QMTLN    EQU   QMPA+12                                                  00187000
QMTST    EQU   QMPA+11                                                  00188000
QMFLT    EQU   QMPA+9                                                   00189000
QMPEB    EQU   QMNAM+4                                                  00190000
QMCAN    EQU   QMNAM                                                    00191000
SWWRTID  EQU   SWAMMEPA+7                                               00192000
SWROWVA  EQU   SWAMMEPA+4                                               00193000
SWASNZO  EQU   SWBUFPTR+3                                               00194000
SWASNVA  EQU   SWBUFPTR                                                 00195000
@NM00007 EQU   QMIOP+19                                                 00196000
@NM00006 EQU   QMIFLAGS                                                 00197000
@NM00005 EQU   QMIFLAGS                                                 00198000
@NM00004 EQU   QMIFLAGS                                                 00199000
@NM00003 EQU   QMIFLAGS                                                 00200000
@NM00002 EQU   QMIFLAGS                                                 00201000
@NM00001 EQU   QMIFLAGS                                                 00202000
QMIRECL  EQU   QMIOP+16                                                 00203000
QMITCBAD EQU   QMIOP                                                    00204000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00205000
@ENDDATA EQU   *                                                        00206000
         END   IEFQB580                                                 00207000
./  ADD  SSI=23212210,NAME=IEFQB585
         TITLE 'IEFQB585 - SWA MANAGER INTERFACE MODULE              '  00001000
IEFQB585 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL2(@EP00001-@MAINENT)                                   00006000
         DC    AL1(16)                                             0001 00007000
         DC    C'IEFQB585  72.321'                                 0001 00008000
IEFQMLK1 DS    0H                                                  0001 00009000
         ENTRY IEFQMLK1                                                 00010000
IEFQMSSS DS    0H                                                  0001 00011000
         ENTRY IEFQMSSS                                                 00012000
IEFQMRAW DS    0H                                                  0001 00013000
         ENTRY IEFQMRAW                                                 00014000
IEFQBVMS DS    0H                                                  0001 00015000
         USING *,@15                                               0001 00016000
         B     @PROLOG                                             0001 00017000
         DC    AL2(@EP00027-IEFQBVMS)                                   00018000
         ENTRY IEFQBVMS                                                 00019000
IEFQAGST DS    0H                                                  0001 00020000
         USING *,@15                                               0001 00021000
         B     @PROLOG                                             0001 00022000
         DC    AL2(@EP00030-IEFQAGST)                                   00023000
         ENTRY IEFQAGST                                                 00024000
IEFQASGN DS    0H                                                  0001 00025000
         ENTRY IEFQASGN                                                 00026000
IEFQASGQ DS    0H                                                  0001 00027000
         USING *,@15                                               0001 00028000
         B     @PROLOG                                             0001 00029000
         DC    AL2(@EP00034-IEFQASGQ)                                   00030000
         ENTRY IEFQASGQ                                                 00031000
IEFQDELE DS    0H                                                  0001 00032000
         ENTRY IEFQDELE                                                 00033000
IEFQDELQ DS    0H                                                  0001 00034000
         USING *,@15                                               0001 00035000
         B     @PROLOG                                             0001 00036000
         DC    AL2(@EP00038-IEFQDELQ)                                   00037000
         ENTRY IEFQDELQ                                                 00038000
         DROP  @15                                                      00039000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00040000
         BALR  @12,0                                               0001 00041000
@PSTART  DS    0H                                                  0001 00042000
         USING @PSTART,@12                                         0001 00043000
         AH    @15,4(,@15)                                         0001 00044000
         BR    @15                                                 0001 00045000
@EP00001 DS    0H                                                  0002 00046000
*IEFQBVMS:                                                         0027 00047000
*IEFQMLK1:                                                         0027 00048000
*IEFQMSSS:                                                         0027 00049000
*IEFQMRAW:                                                         0027 00050000
*   ENTRY;                          /* LABELS FOR FIRST ENTRY POINT  */ 00051000
@EP00027 DS    0H                                                  0028 00052000
*   CALL QB585INT;                  /* GO TO INTERFACE - FUNCTION  0028 00053000
*                                      CODE HAS BEEN SET UP BY CALLER*/ 00054000
         BAL   @14,QB585INT                                        0028 00055000
*   RETURN;                         /* GO TO EXIT                    */ 00056000
         NOP   0                                                   0029 00057000
*IEFQAGST:                                                         0030 00058000
*   ENTRY;                          /* LABEL FOR SECOND ENTRY POINT  */ 00059000
@EP00030 DS    0H                                                  0031 00060000
*   QMPOP=ASGNST;                   /* FUNCTION CODE=ASSIGN/START    */ 00061000
         MVI   QMPOP(QMPAPTR),X'00'                                0031 00062000
*   CALL QB585INT;                  /* GO TO INTERFACE               */ 00063000
         BAL   @14,QB585INT                                        0032 00064000
*   RETURN;                         /* GO TO EXIT                    */ 00065000
         NOP   0                                                   0033 00066000
*IEFQASGQ:                                                         0034 00067000
*IEFQASGN:                                                         0034 00068000
*   ENTRY;                          /* LABELS FOR THIRD ENTRY POINT  */ 00069000
@EP00034 DS    0H                                                  0035 00070000
*   QMPOP=ASSIGN;                   /* FUNCTION CODE=ASSIGN          */ 00071000
         MVI   QMPOP(QMPAPTR),X'01'                                0035 00072000
*   CALL QB585INT;                  /* GO TO INTERFACE               */ 00073000
         BAL   @14,QB585INT                                        0036 00074000
*   RETURN;                         /* GO TO EXIT                    */ 00075000
         NOP   0                                                   0037 00076000
*IEFQDELQ:                                                         0038 00077000
*IEFQDELE:                                                         0038 00078000
*   ENTRY;                          /* LABELS FOR FOURTH ENTRY POINT */ 00079000
@EP00038 DS    0H                                                  0039 00080000
*   QMPOP=DELETE;                   /* FUNCTION CODE=DELETE          */ 00081000
         MVI   QMPOP(QMPAPTR),X'08'                                0039 00082000
*   CALL QB585INT;                  /* GO TO INTERFACE               */ 00083000
         BAL   @14,QB585INT                                        0040 00084000
*QB585INT:                                                         0041 00085000
*   PROC OPTIONS(NOSAVEAREA,NOSAVE);/* INTERNAL PROCEDURE            */ 00086000
*                                                                  0041 00087000
         B     @PB00002                                            0041 00088000
QB585INT DS    0H                                                  0042 00089000
*/********************************************************************/ 00090000
*/* RELOAD ALL REGISTERS EXCEPT 13 AND 15 FROM CALLERS SAVE AREA.    */ 00091000
*/* REGISTER 13 WILL STILL BE POINTING TO THE CALLERS SAVE AREA AND  */ 00092000
*/* REGISTER 15 WILL HAVE THE ADDRESS OF THE SWA MANAGER.  THE       */ 00093000
*/* RETURN FROM THE SWA MANAGER WILL BYPASS IEFQB585 AND GO DIRECTLY */ 00094000
*/* TO THE CALLER OF IEFQB585.                                       */ 00095000
*/********************************************************************/ 00096000
*                                                                  0042 00097000
*                                                                  0042 00098000
*   R15=JESQMGR;                    /* GET ADDRESS OF SWA MANAGER    */ 00099000
         LA    @14,16                                              0042 00100000
         L     @14,CVTPTR(,@14)                                    0042 00101000
         L     @14,CVTJESCT(,@14)                                  0042 00102000
         L     R15,JESQMGR(,@14)                                   0042 00103000
*   GEN;                                                           0043 00104000
     L   R14,12(R13)                 RELOAD 14 WITH RETURN ADDRESS      00105000
     LM  R0,R12,20(R13)              RELOAD OTHER REGISTERS ALSO        00106000
     BR  R15                         BYPASS QB585 ON RETURN             00107000
*   END QB585INT;                   /* END OF INTERNAL PROCEDURE     */ 00108000
@EL00002 DS    0H                                                  0044 00109000
@EF00002 DS    0H                                                  0044 00110000
@ER00002 BR    @14                                                 0044 00111000
@PB00002 DS    0H                                                  0044 00112000
*   END IEFQB585                    /* END OF EXTERNAL PROCEDURE     */ 00113000
*                                                                  0045 00114000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00115000
*/*%INCLUDE SYSLIB  (IEFQMNGR)                                       */ 00116000
*/*%INCLUDE SYSLIB  (IEFJESCT)                                       */ 00117000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00118000
*                                                                  0045 00119000
*       ;                                                          0045 00120000
@DATA    DS    0H                                                       00121000
@DATD    DSECT                                                          00122000
         DS    0F                                                       00123000
@SA00001 DS    18F                                                      00124000
@ZTEMPS  DS    C                                                        00125000
@ZTEMPND EQU   *                                                        00126000
@ZLEN    EQU   @ZTEMPND-@ZTEMPS                                         00127000
IEFQB585 CSECT                                                          00128000
         DS    0F                                                       00129000
@DATD    DSECT                                                          00130000
         DS    0D                                                       00131000
@ENDDATD EQU   *                                                        00132000
IEFQB585 CSECT                                                          00133000
         DS    0F                                                       00134000
@SIZDATD DC    AL1(0)                                                   00135000
         DC    AL3(@ENDDATD-@DATD)                                      00136000
         DS    0D                                                       00137000
QB585PCH DS    CL40                                                     00138000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00139000
@01      EQU   01                                                       00140000
@02      EQU   02                                                       00141000
@03      EQU   03                                                       00142000
@04      EQU   04                                                       00143000
@05      EQU   05                                                       00144000
@06      EQU   06                                                       00145000
@07      EQU   07                                                       00146000
@08      EQU   08                                                       00147000
@09      EQU   09                                                       00148000
@10      EQU   10                                                       00149000
@11      EQU   11                                                       00150000
@12      EQU   12                                                       00151000
@13      EQU   13                                                       00152000
@14      EQU   14                                                       00153000
@15      EQU   15                                                       00154000
QMPAPTR  EQU   @01                                                      00155000
R15      EQU   @15                                                      00156000
R0       EQU   @00                                                      00157000
R12      EQU   @12                                                      00158000
R13      EQU   @13                                                      00159000
R14      EQU   @14                                                      00160000
QMPA     EQU   0                                                        00161000
QMNAM    EQU   QMPA                                                     00162000
QMPOP    EQU   QMPA+8                                                   00163000
QMSTA    EQU   QMPA+16                                                  00164000
QMPCL    EQU   QMPA+32                                                  00165000
QMPCMNC  EQU   QMPCL                                                    00166000
SWAQMPA  EQU   0                                                        00167000
JESCT    EQU   0                                                        00168000
JESWAA   EQU   JESCT+8                                                  00169000
JESQMGR  EQU   JESCT+12                                                 00170000
JESSSREQ EQU   JESCT+20                                                 00171000
CVTMAP   EQU   0                                                        00172000
CVTDAR   EQU   CVTMAP+72                                                00173000
CVTFLGS1 EQU   CVTDAR                                                   00174000
CVTDCB   EQU   CVTMAP+116                                               00175000
CVTOPTA  EQU   CVTMAP+182                                               00176000
CVTOPTB  EQU   CVTMAP+183                                               00177000
CVTTSCVT EQU   CVTMAP+228                                               00178000
CVTTSFLG EQU   CVTTSCVT                                                 00179000
CVTGTF   EQU   CVTMAP+236                                               00180000
CVTGTFST EQU   CVTGTF                                                   00181000
CVTGTFS  EQU   CVTGTFST                                                 00182000
CVTSTATE EQU   CVTGTFST                                                 00183000
CVTTMODE EQU   CVTGTFST                                                 00184000
CVTFORM  EQU   CVTGTFST                                                 00185000
CVTUSR   EQU   CVTGTFST                                                 00186000
CVTGTFA  EQU   CVTGTF+1                                                 00187000
CVTAQAVT EQU   CVTMAP+240                                               00188000
CVTTCMFG EQU   CVTAQAVT                                                 00189000
CVTTATA  EQU   CVTMAP+244                                               00190000
CVTATER  EQU   CVTMAP+248                                               00191000
CVTEXT1  EQU   CVTMAP+252                                               00192000
CVTPURG  EQU   CVTMAP+260                                               00193000
CVTQMSG  EQU   CVTMAP+268                                               00194000
CVTDMSR  EQU   CVTMAP+272                                               00195000
CVTJESCT EQU   CVTMAP+296                                               00196000
CVTAPF   EQU   CVTMAP+324                                               00197000
CVTEXT2  EQU   CVTMAP+328                                               00198000
CVTHJES  EQU   CVTMAP+332                                               00199000
CVTPGSIA EQU   CVTMAP+348                                               00200000
CVTA1F1  EQU   CVTMAP+356                                               00201000
CVTSYSK  EQU   CVTMAP+357                                               00202000
CVTATMCT EQU   CVTMAP+388                                               00203000
CVTPTR   EQU   0                                                        00204000
CVTXTNT1 EQU   0                                                        00205000
CVTXTNT2 EQU   0                                                        00206000
CVTDSSV  EQU   CVTXTNT2                                                 00207000
CVTRSV90 EQU   CVTXTNT2+5                                               00208000
CVTQID   EQU   CVTXTNT2+24                                              00209000
CVTRV400 EQU   CVTXTNT2+52                                              00210000
CVTRV409 EQU   CVTXTNT2+53                                              00211000
CVTATCVT EQU   CVTXTNT2+64                                              00212000
CVTRV429 EQU   CVTXTNT2+84                                              00213000
CVTRV438 EQU   CVTXTNT2+85                                              00214000
CVTRV457 EQU   CVTXTNT2+112                                             00215000
CVTRV466 EQU   CVTXTNT2+113                                             00216000
CVTFIX   EQU   0                                                        00217000
CVTRELNO EQU   CVTFIX+252                                               00218000
SAVEAREA EQU   0                                                        00219000
SSREQ    EQU   0                                                        00220000
SWAMGR   EQU   0                                                        00221000
CVTS01   EQU   CVTPGSIA                                                 00222000
CVTLPDIA EQU   CVTS01+12                                                00223000
CVTDIRST EQU   CVTLPDIA                                                 00224000
CVTSLIDA EQU   CVTS01+24                                                00225000
CVTCTLFG EQU   CVTS01+50                                                00226000
CVTRV100 EQU   CVTS01+116                                               00227000
CVTRV109 EQU   CVTS01+117                                               00228000
CVTRV118 EQU   CVTS01+118                                               00229000
CVTRV127 EQU   CVTS01+119                                               00230000
CVTRV157 EQU   CVTS01+376                                               00231000
CVTRV166 EQU   CVTS01+377                                               00232000
CVTRV175 EQU   CVTS01+378                                               00233000
CVTRV184 EQU   CVTS01+379                                               00234000
CVTRV210 EQU   CVTS01+424                                               00235000
CVTRV219 EQU   CVTS01+425                                               00236000
CVTRV228 EQU   CVTS01+426                                               00237000
CVTRV237 EQU   CVTS01+427                                               00238000
CVTMFRTR EQU   CVTS01+452                                               00239000
CVTRV262 EQU   CVTS01+468                                               00240000
CVTRV271 EQU   CVTS01+469                                               00241000
CVTRV280 EQU   CVTS01+470                                               00242000
CVTRV289 EQU   CVTS01+471                                               00243000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00244000
CVTRV512 EQU   CVTS01+608                                               00245000
CVTRV511 EQU   CVTS01+604                                               00246000
CVTRV510 EQU   CVTS01+600                                               00247000
CVTRV509 EQU   CVTS01+596                                               00248000
CVTRV508 EQU   CVTS01+592                                               00249000
CVTRV507 EQU   CVTS01+588                                               00250000
CVTRV506 EQU   CVTS01+584                                               00251000
CVTRV505 EQU   CVTS01+580                                               00252000
CVTRV504 EQU   CVTS01+576                                               00253000
CVTRV503 EQU   CVTS01+572                                               00254000
CVTRV502 EQU   CVTS01+568                                               00255000
CVTRV501 EQU   CVTS01+564                                               00256000
CVTRV500 EQU   CVTS01+560                                               00257000
CVTRV499 EQU   CVTS01+556                                               00258000
CVTRV498 EQU   CVTS01+552                                               00259000
CVTRV497 EQU   CVTS01+548                                               00260000
CVTRV496 EQU   CVTS01+544                                               00261000
CVTRV495 EQU   CVTS01+540                                               00262000
CVTRV494 EQU   CVTS01+536                                               00263000
CVTRV493 EQU   CVTS01+532                                               00264000
CVTRV492 EQU   CVTS01+528                                               00265000
CVTRV491 EQU   CVTS01+524                                               00266000
CVTRV490 EQU   CVTS01+520                                               00267000
CVTRV489 EQU   CVTS01+516                                               00268000
CVTRV314 EQU   CVTS01+512                                               00269000
CVTRLSTG EQU   CVTS01+508                                               00270000
CVT0TC0A EQU   CVTS01+504                                               00271000
CVTGMBR  EQU   CVTS01+500                                               00272000
CVTLFRM  EQU   CVTS01+496                                               00273000
CVTRMBR  EQU   CVTS01+492                                               00274000
CVTVIOP  EQU   CVTS01+488                                               00275000
CVTRV307 EQU   CVTS01+486                                               00276000
CVTRV306 EQU   CVTS01+484                                               00277000
CVTRV305 EQU   CVTS01+482                                               00278000
CVTRV304 EQU   CVTS01+480                                               00279000
CVTRV303 EQU   CVTS01+478                                               00280000
CVTRV302 EQU   CVTS01+476                                               00281000
CVTRV301 EQU   CVTS01+475                                               00282000
CVTRV300 EQU   CVTS01+474                                               00283000
CVTRV299 EQU   CVTS01+473                                               00284000
CVTRV298 EQU   CVTS01+472                                               00285000
CVTRV297 EQU   CVTRV289                                                 00286000
CVTRV296 EQU   CVTRV289                                                 00287000
CVTRV295 EQU   CVTRV289                                                 00288000
CVTRV294 EQU   CVTRV289                                                 00289000
CVTRV293 EQU   CVTRV289                                                 00290000
CVTRV292 EQU   CVTRV289                                                 00291000
CVTRV291 EQU   CVTRV289                                                 00292000
CVTRV290 EQU   CVTRV289                                                 00293000
CVTRV288 EQU   CVTRV280                                                 00294000
CVTRV287 EQU   CVTRV280                                                 00295000
CVTRV286 EQU   CVTRV280                                                 00296000
CVTRV285 EQU   CVTRV280                                                 00297000
CVTRV284 EQU   CVTRV280                                                 00298000
CVTRV283 EQU   CVTRV280                                                 00299000
CVTRV282 EQU   CVTRV280                                                 00300000
CVTRV281 EQU   CVTRV280                                                 00301000
CVTRV279 EQU   CVTRV271                                                 00302000
CVTRV278 EQU   CVTRV271                                                 00303000
CVTRV277 EQU   CVTRV271                                                 00304000
CVTRV276 EQU   CVTRV271                                                 00305000
CVTRV275 EQU   CVTRV271                                                 00306000
CVTRV274 EQU   CVTRV271                                                 00307000
CVTRV273 EQU   CVTRV271                                                 00308000
CVTRV272 EQU   CVTRV271                                                 00309000
CVTRV270 EQU   CVTRV262                                                 00310000
CVTRV269 EQU   CVTRV262                                                 00311000
CVTRV268 EQU   CVTRV262                                                 00312000
CVTRV267 EQU   CVTRV262                                                 00313000
CVTRV266 EQU   CVTRV262                                                 00314000
CVTRV265 EQU   CVTRV262                                                 00315000
CVTRV264 EQU   CVTRV262                                                 00316000
CVTRV263 EQU   CVTRV262                                                 00317000
CVTVFP   EQU   CVTS01+464                                               00318000
CVTVSI   EQU   CVTS01+460                                               00319000
CVTVPSIB EQU   CVTS01+456                                               00320000
CVTMFACT EQU   CVTMFRTR                                                 00321000
CVTMFCTL EQU   CVTS01+448                                               00322000
CVTPVBP  EQU   CVTS01+444                                               00323000
CVTPWI   EQU   CVTS01+440                                               00324000
CVTRV254 EQU   CVTS01+438                                               00325000
CVTRV253 EQU   CVTS01+436                                               00326000
CVTRV252 EQU   CVTS01+434                                               00327000
CVTRV251 EQU   CVTS01+433                                               00328000
CVTRV250 EQU   CVTS01+432                                               00329000
CVTRV249 EQU   CVTS01+431                                               00330000
CVTRV248 EQU   CVTS01+430                                               00331000
CVTRV247 EQU   CVTS01+429                                               00332000
CVTRV246 EQU   CVTS01+428                                               00333000
CVTRV245 EQU   CVTRV237                                                 00334000
CVTRV244 EQU   CVTRV237                                                 00335000
CVTRV243 EQU   CVTRV237                                                 00336000
CVTRV242 EQU   CVTRV237                                                 00337000
CVTRV241 EQU   CVTRV237                                                 00338000
CVTRV240 EQU   CVTRV237                                                 00339000
CVTRV239 EQU   CVTRV237                                                 00340000
CVTRV238 EQU   CVTRV237                                                 00341000
CVTRV236 EQU   CVTRV228                                                 00342000
CVTRV235 EQU   CVTRV228                                                 00343000
CVTRV234 EQU   CVTRV228                                                 00344000
CVTRV233 EQU   CVTRV228                                                 00345000
CVTRV232 EQU   CVTRV228                                                 00346000
CVTRV231 EQU   CVTRV228                                                 00347000
CVTRV230 EQU   CVTRV228                                                 00348000
CVTRV229 EQU   CVTRV228                                                 00349000
CVTRV227 EQU   CVTRV219                                                 00350000
CVTRV226 EQU   CVTRV219                                                 00351000
CVTRV225 EQU   CVTRV219                                                 00352000
CVTRV224 EQU   CVTRV219                                                 00353000
CVTRV223 EQU   CVTRV219                                                 00354000
CVTRV222 EQU   CVTRV219                                                 00355000
CVTRV221 EQU   CVTRV219                                                 00356000
CVTRV220 EQU   CVTRV219                                                 00357000
CVTRV218 EQU   CVTRV210                                                 00358000
CVTRV217 EQU   CVTRV210                                                 00359000
CVTRV216 EQU   CVTRV210                                                 00360000
CVTRV215 EQU   CVTRV210                                                 00361000
CVTRV214 EQU   CVTRV210                                                 00362000
CVTRV213 EQU   CVTRV210                                                 00363000
CVTRV212 EQU   CVTRV210                                                 00364000
CVTRV211 EQU   CVTRV210                                                 00365000
CVTLCCAT EQU   CVTS01+420                                               00366000
CVTPCCAT EQU   CVTS01+416                                               00367000
CVTIPCRP EQU   CVTS01+412                                               00368000
CVTIPCRI EQU   CVTS01+408                                               00369000
CVTIPCDS EQU   CVTS01+404                                               00370000
CVTAIDVT EQU   CVTS01+400                                               00371000
CVTSSAP  EQU   CVTS01+396                                               00372000
CVTRV202 EQU   CVTS01+394                                               00373000
CVTRV201 EQU   CVTS01+392                                               00374000
CVTRV200 EQU   CVTS01+390                                               00375000
CVTRV199 EQU   CVTS01+388                                               00376000
CVTRV198 EQU   CVTS01+386                                               00377000
CVTRV197 EQU   CVTS01+384                                               00378000
CVTRV196 EQU   CVTS01+383                                               00379000
CVTRV195 EQU   CVTS01+382                                               00380000
CVTRV194 EQU   CVTS01+381                                               00381000
CVTRV193 EQU   CVTS01+380                                               00382000
CVTRV192 EQU   CVTRV184                                                 00383000
CVTRV191 EQU   CVTRV184                                                 00384000
CVTRV190 EQU   CVTRV184                                                 00385000
CVTRV189 EQU   CVTRV184                                                 00386000
CVTRV188 EQU   CVTRV184                                                 00387000
CVTRV187 EQU   CVTRV184                                                 00388000
CVTRV186 EQU   CVTRV184                                                 00389000
CVTRV185 EQU   CVTRV184                                                 00390000
CVTRV183 EQU   CVTRV175                                                 00391000
CVTRV182 EQU   CVTRV175                                                 00392000
CVTRV181 EQU   CVTRV175                                                 00393000
CVTRV180 EQU   CVTRV175                                                 00394000
CVTRV179 EQU   CVTRV175                                                 00395000
CVTRV178 EQU   CVTRV175                                                 00396000
CVTRV177 EQU   CVTRV175                                                 00397000
CVTRV176 EQU   CVTRV175                                                 00398000
CVTRV174 EQU   CVTRV166                                                 00399000
CVTRV173 EQU   CVTRV166                                                 00400000
CVTRV172 EQU   CVTRV166                                                 00401000
CVTRV171 EQU   CVTRV166                                                 00402000
CVTRV170 EQU   CVTRV166                                                 00403000
CVTRV169 EQU   CVTRV166                                                 00404000
CVTRV168 EQU   CVTRV166                                                 00405000
CVTRV167 EQU   CVTRV166                                                 00406000
CVTRV165 EQU   CVTRV157                                                 00407000
CVTRV164 EQU   CVTRV157                                                 00408000
CVTRV163 EQU   CVTRV157                                                 00409000
CVTRV162 EQU   CVTRV157                                                 00410000
CVTRV161 EQU   CVTRV157                                                 00411000
CVTRV160 EQU   CVTRV157                                                 00412000
CVTRV159 EQU   CVTRV157                                                 00413000
CVTRV158 EQU   CVTRV157                                                 00414000
CVTRV156 EQU   CVTS01+372                                               00415000
CVTRV155 EQU   CVTS01+368                                               00416000
CVTSPOST EQU   CVTS01+364                                               00417000
CVTIOBP  EQU   CVTS01+360                                               00418000
CVTAMVT  EQU   CVTS01+356                                               00419000
CVTRECRQ EQU   CVTS01+352                                               00420000
CVTWSAC  EQU   CVTS01+348                                               00421000
CVTWSAG  EQU   CVTS01+344                                               00422000
CVTWSAL  EQU   CVTS01+340                                               00423000
CVTSPSA  EQU   CVTS01+336                                               00424000
CVTGLMN  EQU   CVTS01+332                                               00425000
CVTVEAC0 EQU   CVTS01+328                                               00426000
CVT062R1 EQU   CVTS01+324                                               00427000
CVTRPOST EQU   CVTS01+320                                               00428000
CVTDQIQE EQU   CVTS01+316                                               00429000
CVTCSD   EQU   CVTS01+312                                               00430000
CVTLKRMA EQU   CVTS01+308                                               00431000
CVTRSPIE EQU   CVTS01+304                                               00432000
CVTRENQ  EQU   CVTS01+300                                               00433000
CVTLQCB  EQU   CVTS01+296                                               00434000
CVTFQCB  EQU   CVTS01+292                                               00435000
CVTQCS01 EQU   CVTS01+288                                               00436000
CVTAPFT  EQU   CVTS01+284                                               00437000
CVTPARRL EQU   CVTS01+280                                               00438000
CVTVWAIT EQU   CVTS01+276                                               00439000
CVTGSPL  EQU   CVTS01+272                                               00440000
CVTLSMQ  EQU   CVTS01+268                                               00441000
CVTGSMQ  EQU   CVTS01+264                                               00442000
CVTEXPRO EQU   CVTS01+260                                               00443000
CVTOPCTP EQU   CVTS01+256                                               00444000
CVTSIC   EQU   CVTS01+252                                               00445000
CVTTPIOS EQU   CVTS01+248                                               00446000
CVTRTMS  EQU   CVTS01+244                                               00447000
CVTSDBF  EQU   CVTS01+240                                               00448000
CVTSCBP  EQU   CVTS01+236                                               00449000
CVTSDMP  EQU   CVTS01+232                                               00450000
CVTSV60  EQU   CVTS01+228                                               00451000
CVTRTMCT EQU   CVTS01+224                                               00452000
CVTASCBL EQU   CVTS01+220                                               00453000
CVTASCBH EQU   CVTS01+216                                               00454000
CVTGDA   EQU   CVTS01+212                                               00455000
CVTASVT  EQU   CVTS01+208                                               00456000
CVTVVMDI EQU   CVTS01+204                                               00457000
CVTAQTOP EQU   CVTS01+200                                               00458000
CVTIOSCS EQU   CVTS01+196                                               00459000
CVTSDRM  EQU   CVTS01+192                                               00460000
CVTOPTE  EQU   CVTS01+188                                               00461000
CVTSTXU  EQU   CVTS01+184                                               00462000
CVTQUIS  EQU   CVTS01+180                                               00463000
CVTQREC  EQU   CVTS01+176                                               00464000
CVTS1EE  EQU   CVTS01+172                                               00465000
CVTFRAS  EQU   CVTS01+168                                               00466000
CVTQSAS  EQU   CVTS01+164                                               00467000
CVTCRAS  EQU   CVTS01+160                                               00468000
CVTCRMN  EQU   CVTS01+156                                               00469000
CVTDELCP EQU   CVTS01+152                                               00470000
CVTFRECL EQU   CVTS01+148                                               00471000
CVTGETCL EQU   CVTS01+144                                               00472000
CVTBLDCP EQU   CVTS01+140                                               00473000
CVTAUTHL EQU   CVTS01+136                                               00474000
CVTRV146 EQU   CVTS01+134                                               00475000
CVTRV145 EQU   CVTS01+132                                               00476000
CVTRV144 EQU   CVTS01+130                                               00477000
CVTRV143 EQU   CVTS01+128                                               00478000
CVTRV142 EQU   CVTS01+126                                               00479000
CVTRV141 EQU   CVTS01+125                                               00480000
CVTRV140 EQU   CVTS01+124                                               00481000
CVTRV139 EQU   CVTS01+123                                               00482000
CVTRV138 EQU   CVTS01+122                                               00483000
CVTMAXMP EQU   CVTS01+121                                               00484000
CVTIOSPL EQU   CVTS01+120                                               00485000
CVTRV135 EQU   CVTRV127                                                 00486000
CVTRV134 EQU   CVTRV127                                                 00487000
CVTRV133 EQU   CVTRV127                                                 00488000
CVTRV132 EQU   CVTRV127                                                 00489000
CVTRV131 EQU   CVTRV127                                                 00490000
CVTRV130 EQU   CVTRV127                                                 00491000
CVTRV129 EQU   CVTRV127                                                 00492000
CVTRV128 EQU   CVTRV127                                                 00493000
CVTRV126 EQU   CVTRV118                                                 00494000
CVTRV125 EQU   CVTRV118                                                 00495000
CVTRV124 EQU   CVTRV118                                                 00496000
CVTRV123 EQU   CVTRV118                                                 00497000
CVTRV122 EQU   CVTRV118                                                 00498000
CVTRV121 EQU   CVTRV118                                                 00499000
CVTRV120 EQU   CVTRV118                                                 00500000
CVTRV119 EQU   CVTRV118                                                 00501000
CVTRV117 EQU   CVTRV109                                                 00502000
CVTRV116 EQU   CVTRV109                                                 00503000
CVTRV115 EQU   CVTRV109                                                 00504000
CVTRV114 EQU   CVTRV109                                                 00505000
CVTRV113 EQU   CVTRV109                                                 00506000
CVTRV112 EQU   CVTRV109                                                 00507000
CVTRV111 EQU   CVTRV109                                                 00508000
CVTRV110 EQU   CVTRV109                                                 00509000
CVTRV108 EQU   CVTRV100                                                 00510000
CVTRV107 EQU   CVTRV100                                                 00511000
CVTRV106 EQU   CVTRV100                                                 00512000
CVTRV105 EQU   CVTRV100                                                 00513000
CVTRV104 EQU   CVTRV100                                                 00514000
CVTRV103 EQU   CVTRV100                                                 00515000
CVTRV102 EQU   CVTRV100                                                 00516000
CVTRV101 EQU   CVTRV100                                                 00517000
CVTCSPIE EQU   CVTS01+112                                               00518000
CVTSMFEX EQU   CVTS01+108                                               00519000
CVTOLT0A EQU   CVTS01+104                                               00520000
CVTSRBRT EQU   CVTS01+100                                               00521000
CVTRSV82 EQU   CVTS01+98                                                00522000
CVTRSV81 EQU   CVTS01+96                                                00523000
CVTSYSWT EQU   CVTS01+92                                                00524000
CVTRV327 EQU   CVTS01+88                                                00525000
CVTRV326 EQU   CVTS01+84                                                00526000
CVTRV325 EQU   CVTS01+80                                                00527000
CVTRV324 EQU   CVTS01+76                                                00528000
CVT0VL01 EQU   CVTS01+72                                                00529000
CVTSHRVM EQU   CVTS01+68                                                00530000
CVTRV332 EQU   CVTS01+64                                                00531000
CVTTAS   EQU   CVTS01+60                                                00532000
CVTRSCN  EQU   CVTS01+56                                                00533000
CVTTRAC2 EQU   CVTS01+54                                                00534000
CVTTRACE EQU   CVTS01+52                                                00535000
CVTAPG   EQU   CVTS01+51                                                00536000
CVTSDTRC EQU   CVTCTLFG                                                 00537000
CVTGTRCE EQU   CVTCTLFG                                                 00538000
CVTRSV80 EQU   CVTCTLFG                                                 00539000
CVTRSV79 EQU   CVTCTLFG                                                 00540000
CVTDSTAT EQU   CVTCTLFG                                                 00541000
CVTRSV78 EQU   CVTCTLFG                                                 00542000
CVTRV333 EQU   CVTCTLFG                                                 00543000
CVTRV323 EQU   CVTCTLFG                                                 00544000
CVTSPVLK EQU   CVTS01+49                                                00545000
CVTRSV77 EQU   CVTS01+48                                                00546000
CVTRV331 EQU   CVTS01+44                                                00547000
CVTRV330 EQU   CVTS01+40                                                00548000
CVTRV329 EQU   CVTS01+36                                                00549000
CVTRV328 EQU   CVTS01+32                                                00550000
CVTRV322 EQU   CVTS01+28                                                00551000
CVTSLID  EQU   CVTSLIDA+1                                               00552000
CVTSYLK  EQU   CVTSLIDA                                                 00553000
CVTRV321 EQU   CVTS01+20                                                00554000
CVTRV320 EQU   CVTS01+16                                                00555000
CVTLPDIR EQU   CVTLPDIA+1                                               00556000
CVTRSV69 EQU   CVTDIRST                                                 00557000
CVTRSV68 EQU   CVTDIRST                                                 00558000
CVTRSV67 EQU   CVTDIRST                                                 00559000
CVTRSV66 EQU   CVTDIRST                                                 00560000
CVTRSV65 EQU   CVTDIRST                                                 00561000
CVTRSV64 EQU   CVTDIRST                                                 00562000
CVTRSV63 EQU   CVTDIRST                                                 00563000
CVTDICOM EQU   CVTDIRST                                                 00564000
CVTPVTP  EQU   CVTS01+8                                                 00565000
CVTLPDSR EQU   CVTS01+4                                                 00566000
CVTRSVA2 EQU   CVTS01                                                   00567000
RETCODE  EQU   SAVEAREA+16                                              00568000
@NM00008 EQU   SAVEAREA+8                                               00569000
BACKCHN  EQU   SAVEAREA+4                                               00570000
@NM00007 EQU   SAVEAREA                                                 00571000
CVTLEVL  EQU   CVTRELNO+2                                               00572000
CVTNUMB  EQU   CVTRELNO                                                 00573000
CVTMDL   EQU   CVTFIX+250                                               00574000
@NM00006 EQU   CVTFIX+248                                               00575000
@NM00005 EQU   CVTFIX                                                   00576000
CVTRV482 EQU   CVTXTNT2+128                                             00577000
CVTRV481 EQU   CVTXTNT2+124                                             00578000
CVTRV480 EQU   CVTXTNT2+120                                             00579000
CVTRV479 EQU   CVTXTNT2+118                                             00580000
CVTRV478 EQU   CVTXTNT2+117                                             00581000
CVTRV477 EQU   CVTXTNT2+116                                             00582000
CVTRV476 EQU   CVTXTNT2+115                                             00583000
CVTRV475 EQU   CVTXTNT2+114                                             00584000
CVTRV474 EQU   CVTRV466                                                 00585000
CVTRV473 EQU   CVTRV466                                                 00586000
CVTRV472 EQU   CVTRV466                                                 00587000
CVTRV471 EQU   CVTRV466                                                 00588000
CVTRV470 EQU   CVTRV466                                                 00589000
CVTRV469 EQU   CVTRV466                                                 00590000
CVTRV468 EQU   CVTRV466                                                 00591000
CVTRV467 EQU   CVTRV466                                                 00592000
CVTRV465 EQU   CVTRV457                                                 00593000
CVTRV464 EQU   CVTRV457                                                 00594000
CVTRV463 EQU   CVTRV457                                                 00595000
CVTRV462 EQU   CVTRV457                                                 00596000
CVTRV461 EQU   CVTRV457                                                 00597000
CVTRV460 EQU   CVTRV457                                                 00598000
CVTRV459 EQU   CVTRV457                                                 00599000
CVTRV458 EQU   CVTRV457                                                 00600000
CVTRV456 EQU   CVTXTNT2+108                                             00601000
CVTRV455 EQU   CVTXTNT2+104                                             00602000
CVTRV454 EQU   CVTXTNT2+100                                             00603000
CVTRV453 EQU   CVTXTNT2+96                                              00604000
CVTRV452 EQU   CVTXTNT2+94                                              00605000
CVTRV451 EQU   CVTXTNT2+92                                              00606000
CVTRV450 EQU   CVTXTNT2+90                                              00607000
CVTRV449 EQU   CVTXTNT2+88                                              00608000
CVTRV448 EQU   CVTXTNT2+87                                              00609000
CVTRV447 EQU   CVTXTNT2+86                                              00610000
CVTRV446 EQU   CVTRV438                                                 00611000
CVTRV445 EQU   CVTRV438                                                 00612000
CVTRV444 EQU   CVTRV438                                                 00613000
CVTRV443 EQU   CVTRV438                                                 00614000
CVTRV442 EQU   CVTRV438                                                 00615000
CVTRV441 EQU   CVTRV438                                                 00616000
CVTRV440 EQU   CVTRV438                                                 00617000
CVTRV439 EQU   CVTRV438                                                 00618000
CVTRV437 EQU   CVTRV429                                                 00619000
CVTRV436 EQU   CVTRV429                                                 00620000
CVTRV435 EQU   CVTRV429                                                 00621000
CVTRV434 EQU   CVTRV429                                                 00622000
CVTRV433 EQU   CVTRV429                                                 00623000
CVTRV432 EQU   CVTRV429                                                 00624000
CVTRV431 EQU   CVTRV429                                                 00625000
CVTRV430 EQU   CVTRV429                                                 00626000
CVTRV428 EQU   CVTXTNT2+80                                              00627000
CVTRV427 EQU   CVTXTNT2+76                                              00628000
CVTRV426 EQU   CVTXTNT2+72                                              00629000
CVTRV425 EQU   CVTXTNT2+68                                              00630000
CVTATACT EQU   CVTATCVT                                                 00631000
CVTRV423 EQU   CVTXTNT2+62                                              00632000
CVTRV422 EQU   CVTXTNT2+60                                              00633000
CVTRV421 EQU   CVTXTNT2+58                                              00634000
CVTRV420 EQU   CVTXTNT2+56                                              00635000
CVTRV419 EQU   CVTXTNT2+55                                              00636000
CVTRV418 EQU   CVTXTNT2+54                                              00637000
CVTRV417 EQU   CVTRV409                                                 00638000
CVTRV416 EQU   CVTRV409                                                 00639000
CVTRV415 EQU   CVTRV409                                                 00640000
CVTRV414 EQU   CVTRV409                                                 00641000
CVTRV413 EQU   CVTRV409                                                 00642000
CVTRV412 EQU   CVTRV409                                                 00643000
CVTRV411 EQU   CVTRV409                                                 00644000
CVTRV410 EQU   CVTRV409                                                 00645000
CVTRV408 EQU   CVTRV400                                                 00646000
CVTRV407 EQU   CVTRV400                                                 00647000
CVTRV406 EQU   CVTRV400                                                 00648000
CVTRV405 EQU   CVTRV400                                                 00649000
CVTRV404 EQU   CVTRV400                                                 00650000
CVTRV403 EQU   CVTRV400                                                 00651000
CVTRV402 EQU   CVTRV400                                                 00652000
CVTRV401 EQU   CVTRV400                                                 00653000
CVTRSVA1 EQU   CVTXTNT2+48                                              00654000
CVTRSVA0 EQU   CVTXTNT2+44                                              00655000
CVTRSV99 EQU   CVTXTNT2+40                                              00656000
CVTRSV98 EQU   CVTXTNT2+36                                              00657000
CVTRSV97 EQU   CVTXTNT2+34                                              00658000
CVTRSV96 EQU   CVTXTNT2+32                                              00659000
CVTOLTEP EQU   CVTXTNT2+28                                              00660000
CVTQIDA  EQU   CVTQID+1                                                 00661000
CVTRSV95 EQU   CVTQID                                                   00662000
CVTRSV94 EQU   CVTXTNT2+20                                              00663000
CVTRSV93 EQU   CVTXTNT2+16                                              00664000
CVTRSV92 EQU   CVTXTNT2+12                                              00665000
CVTDEBVR EQU   CVTXTNT2+8                                               00666000
CVTRSV91 EQU   CVTXTNT2+6                                               00667000
CVTRSV9H EQU   CVTRSV90                                                 00668000
CVTRSV9G EQU   CVTRSV90                                                 00669000
CVTRSV9F EQU   CVTRSV90                                                 00670000
CVTRSV9E EQU   CVTRSV90                                                 00671000
CVTRSV9D EQU   CVTRSV90                                                 00672000
CVTRSV9C EQU   CVTRSV90                                                 00673000
CVTRSV9B EQU   CVTRSV90                                                 00674000
CVTRSV9A EQU   CVTRSV90                                                 00675000
CVTNUCLS EQU   CVTXTNT2+4                                               00676000
CVTDSSVA EQU   CVTDSSV+1                                                00677000
CVTRSV89 EQU   CVTDSSV                                                  00678000
CVTRSV88 EQU   CVTXTNT1+8                                               00679000
CVTRSV87 EQU   CVTXTNT1+4                                               00680000
CVTFACHN EQU   CVTXTNT1                                                 00681000
CVTRV488 EQU   CVTMAP+412                                               00682000
CVTRV487 EQU   CVTMAP+408                                               00683000
CVTRV486 EQU   CVTMAP+404                                               00684000
CVTRV485 EQU   CVTMAP+400                                               00685000
CVTRV484 EQU   CVTMAP+396                                               00686000
CVTRV483 EQU   CVTMAP+392                                               00687000
CVTATMCA EQU   CVTATMCT+1                                               00688000
CVTATMST EQU   CVTATMCT                                                 00689000
CVTRSV61 EQU   CVTMAP+384                                               00690000
CVTRSV60 EQU   CVTMAP+380                                               00691000
CVTSTOA  EQU   CVTMAP+376                                               00692000
CVTRSV58 EQU   CVTMAP+374                                               00693000
CVTRSV57 EQU   CVTMAP+372                                               00694000
CVTDDCE  EQU   CVTMAP+368                                               00695000
CVTPNWFR EQU   CVTMAP+364                                               00696000
CVTSMF   EQU   CVTMAP+360                                               00697000
CVTSULK  EQU   CVTMAP+358                                               00698000
CVTSLKO  EQU   CVTSYSK                                                  00699000
CVTSLKP  EQU   CVTSYSK                                                  00700000
CVTSLKQ  EQU   CVTSYSK                                                  00701000
CVTSLKR  EQU   CVTSYSK                                                  00702000
CVTRSV56 EQU   CVTSYSK                                                  00703000
CVTRSV55 EQU   CVTSYSK                                                  00704000
CVTRSV54 EQU   CVTSYSK                                                  00705000
CVTRSV53 EQU   CVTSYSK                                                  00706000
CVTRSV52 EQU   CVTA1F1                                                  00707000
CVTRSV51 EQU   CVTA1F1                                                  00708000
CVTRSV50 EQU   CVTA1F1                                                  00709000
CVTRSV49 EQU   CVTA1F1                                                  00710000
CVTRSV48 EQU   CVTA1F1                                                  00711000
CVTRSV47 EQU   CVTA1F1                                                  00712000
CVTSRSW  EQU   CVTA1F1                                                  00713000
CVTPFSW  EQU   CVTA1F1                                                  00714000
CVTPCVT  EQU   CVTMAP+352                                               00715000
CVTRSV46 EQU   CVTMAP+344                                               00716000
CVTRSV45 EQU   CVTMAP+340                                               00717000
CVTRSV44 EQU   CVTMAP+338                                               00718000
CVTRSV43 EQU   CVTMAP+336                                               00719000
CVTHJESA EQU   CVTHJES+1                                                00720000
CVTRSV42 EQU   CVTHJES                                                  00721000
CVTEXT2A EQU   CVTEXT2+1                                                00722000
CVTRSV41 EQU   CVTEXT2                                                  00723000
CVTAPFA  EQU   CVTAPF+1                                                 00724000
CVTRSV40 EQU   CVTAPF                                                   00725000
CVTINTLA EQU   CVTMAP+320                                               00726000
CVTERPV  EQU   CVTMAP+316                                               00727000
CVTEORM  EQU   CVTMAP+312                                               00728000
CVTMCHPR EQU   CVTMAP+308                                               00729000
CVTTZ    EQU   CVTMAP+304                                               00730000
CVTJEPS  EQU   CVTMAP+300                                               00731000
CVTMODE  EQU   CVTMAP+292                                               00732000
CVTPTRV  EQU   CVTMAP+288                                               00733000
CVTREAL  EQU   CVTMAP+284                                               00734000
CVTRSV39 EQU   CVTMAP+280                                               00735000
CVTRSV38 EQU   CVTMAP+276                                               00736000
CVTDMSRA EQU   CVTDMSR+1                                                00737000
CVTRSV37 EQU   CVTDMSR                                                  00738000
CVTQMSGA EQU   CVTQMSG+1                                                00739000
CVTRSV36 EQU   CVTQMSG                                                  00740000
CVTAMFF  EQU   CVTMAP+264                                               00741000
CVTPURGA EQU   CVTPURG+1                                                00742000
CVTRSV35 EQU   CVTPURG                                                  00743000
CVTCBSP  EQU   CVTMAP+256                                               00744000
CVTATERA EQU   CVTATER+1                                                00745000
CVTSYST  EQU   CVTATER                                                  00746000
CVTTAT   EQU   CVTTATA+1                                                00747000
CVTTSKS  EQU   CVTTATA                                                  00748000
CVTAQAVB EQU   CVTAQAVT+1                                               00749000
CVTRSV34 EQU   CVTTCMFG                                                 00750000
CVTRSV33 EQU   CVTTCMFG                                                 00751000
CVTRSV32 EQU   CVTTCMFG                                                 00752000
CVTRSV31 EQU   CVTTCMFG                                                 00753000
CVTRSV30 EQU   CVTTCMFG                                                 00754000
CVTRSV29 EQU   CVTTCMFG                                                 00755000
CVTRSV28 EQU   CVTTCMFG                                                 00756000
CVTTCRDY EQU   CVTTCMFG                                                 00757000
CVTMCQE  EQU   CVTGTFA                                                  00758000
CVTRSV27 EQU   CVTGTFST                                                 00759000
CVTRSV26 EQU   CVTGTFST                                                 00760000
CVTRV319 EQU   CVTUSR                                                   00761000
CVTRV318 EQU   CVTFORM                                                  00762000
CVTRV317 EQU   CVTTMODE                                                 00763000
CVTRV316 EQU   CVTSTATE                                                 00764000
CVTRV315 EQU   CVTGTFS                                                  00765000
CVTGTFAV EQU   CVTGTFS                                                  00766000
CVT0SCR1 EQU   CVTMAP+232                                               00767000
CVTTSCVB EQU   CVTTSCVT+1                                               00768000
CVTRSV25 EQU   CVTTSFLG                                                 00769000
CVTRSV24 EQU   CVTTSFLG                                                 00770000
CVTRSV23 EQU   CVTTSFLG                                                 00771000
CVTRSV22 EQU   CVTTSFLG                                                 00772000
CVTRSV21 EQU   CVTTSFLG                                                 00773000
CVTRSV20 EQU   CVTTSFLG                                                 00774000
CVTRSV19 EQU   CVTTSFLG                                                 00775000
CVTTSRDY EQU   CVTTSFLG                                                 00776000
CVTRMS   EQU   CVTMAP+224                                               00777000
CVTPATCH EQU   CVTMAP+220                                               00778000
CVTTSCE  EQU   CVTMAP+216                                               00779000
CVTLNKSC EQU   CVTMAP+214                                               00780000
CVTQABST EQU   CVTMAP+212                                               00781000
CVTMDLDS EQU   CVTMAP+208                                               00782000
CVTUSER  EQU   CVTMAP+204                                               00783000
CVTABEND EQU   CVTMAP+200                                               00784000
CVTSMCA  EQU   CVTMAP+196                                               00785000
CVTRSV18 EQU   CVTMAP+192                                               00786000
CVTQLPAQ EQU   CVTMAP+188                                               00787000
CVTQCDSR EQU   CVTMAP+184                                               00788000
CVTRSV17 EQU   CVTOPTB                                                  00789000
CVTRSV16 EQU   CVTOPTB                                                  00790000
CVTFP    EQU   CVTOPTB                                                  00791000
CVTAPTHR EQU   CVTOPTB                                                  00792000
CVTNLOG  EQU   CVTOPTB                                                  00793000
CVTTOD   EQU   CVTOPTB                                                  00794000
CVTCTIMS EQU   CVTOPTB                                                  00795000
CVTPROT  EQU   CVTOPTB                                                  00796000
CVTXPFP  EQU   CVTOPTA                                                  00797000
CVTASCII EQU   CVTOPTA                                                  00798000
CVTRSV13 EQU   CVTOPTA                                                  00799000
CVTRSV12 EQU   CVTOPTA                                                  00800000
CVTNIP   EQU   CVTOPTA                                                  00801000
CVTDDR   EQU   CVTOPTA                                                  00802000
CVTAPR   EQU   CVTOPTA                                                  00803000
CVTCCH   EQU   CVTOPTA                                                  00804000
CVTSNCTR EQU   CVTMAP+180                                               00805000
CVTQMWR  EQU   CVTMAP+176                                               00806000
CVTQOCR  EQU   CVTMAP+172                                               00807000
CVT1EF00 EQU   CVTMAP+168                                               00808000
CVTMZ00  EQU   CVTMAP+164                                               00809000
CVTHEAD  EQU   CVTMAP+160                                               00810000
CVTRSV11 EQU   CVTMAP+156                                               00811000
CVT0PT01 EQU   CVTMAP+152                                               00812000
CVTMSER  EQU   CVTMAP+148                                               00813000
CVTIERLC EQU   CVTMAP+144                                               00814000
CVTILCH  EQU   CVTMAP+140                                               00815000
CVT0DS   EQU   CVTMAP+136                                               00816000
CVTFBOSV EQU   CVTMAP+132                                               00817000
CVTNUCB  EQU   CVTMAP+128                                               00818000
CVTIXAVL EQU   CVTMAP+124                                               00819000
CVTIOQET EQU   CVTMAP+120                                               00820000
CVTDCBA  EQU   CVTMAP+117                                               00821000
CVTMVS2  EQU   CVTDCB                                                   00822000
CVT6DAT  EQU   CVTDCB                                                   00823000
CVT4MPS  EQU   CVTDCB                                                   00824000
CVTRSV09 EQU   CVTDCB                                                   00825000
CVT4MS1  EQU   CVTDCB                                                   00826000
CVT2SPS  EQU   CVTDCB                                                   00827000
CVT1SSS  EQU   CVTDCB                                                   00828000
CVTRSV08 EQU   CVTDCB                                                   00829000
CVTSTB   EQU   CVTMAP+112                                               00830000
CVTQTD00 EQU   CVTMAP+108                                               00831000
CVTQTE00 EQU   CVTMAP+104                                               00832000
CVTCUCB  EQU   CVTMAP+100                                               00833000
CVTSJQ   EQU   CVTMAP+96                                                00834000
CVTPBLDL EQU   CVTMAP+92                                                00835000
CVTTPC   EQU   CVTMAP+88                                                00836000
CVTSVDCB EQU   CVTMAP+84                                                00837000
CVTBRET  EQU   CVTMAP+82                                                00838000
CVTEXIT  EQU   CVTMAP+80                                                00839000
CVT0FN00 EQU   CVTMAP+76                                                00840000
CVTDARA  EQU   CVTDAR+1                                                 00841000
CVTRSV07 EQU   CVTFLGS1                                                 00842000
CVTRSV06 EQU   CVTFLGS1                                                 00843000
CVTRSV05 EQU   CVTFLGS1                                                 00844000
CVTRSV04 EQU   CVTFLGS1                                                 00845000
CVTRSV03 EQU   CVTFLGS1                                                 00846000
CVTRSV02 EQU   CVTFLGS1                                                 00847000
CVTRSV01 EQU   CVTFLGS1                                                 00848000
CVTDMPLK EQU   CVTFLGS1                                                 00849000
CVTXITP  EQU   CVTMAP+68                                                00850000
CVTZDTAB EQU   CVTMAP+64                                                00851000
CVTMSLT  EQU   CVTMAP+60                                                00852000
CVTDATE  EQU   CVTMAP+56                                                00853000
CVTBTERM EQU   CVTMAP+52                                                00854000
CVTSYSAD EQU   CVTMAP+48                                                00855000
CVTXTLER EQU   CVTMAP+44                                                00856000
CVTILK2  EQU   CVTMAP+40                                                00857000
CVTILK1  EQU   CVTMAP+36                                                00858000
CVTPRLTV EQU   CVTMAP+32                                                00859000
CVTPCNVT EQU   CVTMAP+28                                                00860000
CVT0VL00 EQU   CVTMAP+24                                                00861000
CVTXAPG  EQU   CVTMAP+20                                                00862000
CVTBUF   EQU   CVTMAP+16                                                00863000
CVTJOB   EQU   CVTMAP+12                                                00864000
CVTLINK  EQU   CVTMAP+8                                                 00865000
CVT0EF00 EQU   CVTMAP+4                                                 00866000
CVTTCBP  EQU   CVTMAP                                                   00867000
CVT      EQU   CVTMAP                                                   00868000
JESPJESN EQU   JESCT+28                                                 00869000
JESSSCT  EQU   JESCT+24                                                 00870000
JESRESQM EQU   JESCT+16                                                 00871000
JESUNITS EQU   JESCT+4                                                  00872000
@NM00004 EQU   JESCT                                                    00873000
QMRBN    EQU   SWAQMPA+12                                               00874000
@NM00003 EQU   SWAQMPA+1                                                00875000
QMSWSP   EQU   SWAQMPA                                                  00876000
QMPACL   EQU   QMPCL+1                                                  00877000
QMPNC    EQU   QMPCMNC                                                  00878000
QMPCM    EQU   QMPCMNC                                                  00879000
QMEIA    EQU   QMPA+28                                                  00880000
QMWTQ    EQU   QMPA+24                                                  00881000
QMRSD1   EQU   QMPA+22                                                  00882000
QMTID    EQU   QMPA+20                                                  00883000
QMLNK    EQU   QMPA+18                                                  00884000
QMPRI    EQU   QMPA+17                                                  00885000
@NM00002 EQU   QMSTA                                                    00886000
QMSJNL   EQU   QMSTA                                                    00887000
@NM00001 EQU   QMSTA                                                    00888000
QMTPY    EQU   QMPA+15                                                  00889000
QMNOT    EQU   QMPA+14                                                  00890000
QMTLN    EQU   QMPA+12                                                  00891000
QMTST    EQU   QMPA+11                                                  00892000
QMFLT    EQU   QMPA+9                                                   00893000
QMPEB    EQU   QMNAM+4                                                  00894000
QMCAN    EQU   QMNAM                                                    00895000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00896000
@ENDDATA EQU   *                                                        00897000
         END   IEFQB585                                                 00898000
