./  ADD  SSI=80890217,NAME=IEFDB470
         TITLE 'IEFDB470 - DYNAMIC INFORMATION RETRIEVAL               *00001000
                        '                                               00002000
IEFDB470 CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IEFDB470  78.089'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @12,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@12                                      01S0001 00013000
         L     @00,@SIZDATD                                     01S0001 00014000
         GSPACE   R,LV=(0)                                              00015000
         LR    @11,@01                                          01S0001 00016000
         USING @DATD,@11                                        01S0001 00017000
         ST    @13,@SA00001+4                                   01S0001 00018000
         LM    @00,@01,20(@13)                                  01S0001 00019000
         ST    @11,8(,@13)                                      01S0001 00020000
         LR    @13,@11                                          01S0001 00021000
         MVC   @PC00001(24),0(@01)                              01S0001 00022000
JSCBDISP EQU 188                                                        00023000
JSCBAOS1 EQU  72                                                        00024000
JSCBAOS2 EQU 192                                                        00025000
*/********************************************************************/ 00026000
*/*                                                                  */ 00027000
*/* SEGMENT NAME - DINSYNCK                                          */ 00028000
*/*                                                                  */ 00029000
*/* DESCRIPTIVE NAME - DYNAMIC INFORMATION RETRIEVAL SYNTAX CHECK    */ 00030000
*/*                                                                  */ 00031000
*/* FUNCTION - THIS ROUTINE DETERMINES IF THE TEXT ENTERED IS VALID  */ 00032000
*/*                                                                  */ 00033000
*/* OPERATION - IEFBD4FF IS INVOKED TO CHECK TEXT UNIT SYNTAX        */ 00034000
*/*                                                                  */ 00035000
*/* ENTRY - DINSYNCK (INCLUDED SEGMENT)                              */ 00036000
*/*                                                                  */ 00037000
*/* PURPOSE - SEE FUNCTION                                           */ 00038000
*/*                                                                  */ 00039000
*/* INPUT DATA - TEXT UNITS                                          */ 00040000
*/*                                                                  */ 00041000
*/* EXITS - ALL ARE TO NEXT SEQUENTIAL INSTRUCTION                   */ 00042000
*/*                                                                  */ 00043000
*/*  NORMAL - SYNTAX IS GOOD AND ERRCODE IS SET TO ZERO              */ 00044000
*/*                                                                  */ 00045000
*/*  ERROR  - ERRCODE IS ONE OF THE FOLLOWING                        */ 00046000
*/*           1. RCINVKEY - INVALID KEY SPECIFIED IN TEXT            */ 00047000
*/*           2. RCINNUMB - INVALID NUMBER OF KEY PARAMETERS         */ 00048000
*/*           3. RCDUPKEY - DUPLICATE KEYS SPECIFIED IN TEXT         */ 00049000
*/*           4. RCINKEYL - INVALID KEY PARAMETER LENGTH             */ 00050000
*/*           5. RCKEYREQ - REQUIRED KEY NOT SPECIFIED               */ 00051000
*/*                                                                  */ 00052000
*/* OUTPUT DATA - KEY TABLE FILLED IN WITH TEXT UNIT ADDRESSES       */ 00053000
*/*                                                                  */ 00054000
*/********************************************************************/ 00055000
*KEYTABLE = KEYTABLE && KEYTABLE;      /* ZERO KEYTABLE              */ 00056000
         XC    KEYTABLE(56),KEYTABLE                            02S0073 00057000
*MASKS = MASKS && MASKS;               /* ZERO MUTUAL & DUPE MASKS   */ 00058000
         XC    MASKS(4),MASKS                                   02S0074 00059000
*CALL IEFDB4FF                         /* CALL SYNTAX CHECKER        */ 00060000
*             (DINRTVTP,ADDR(KEYDICT),ADDR(DUPEMASK),ADDR(MUTEMASK),    00061000
*              ADDR(KEYTABLE),DINRTRN);                         02S0075 00062000
         L     @10,@PC00001                                     02S0075 00063000
         ST    @10,@AL00001                                     02S0075 00064000
         LA    @10,KEYDICT                                      02S0075 00065000
         ST    @10,@TF00001                                     02S0075 00066000
         LA    @10,@TF00001                                     02S0075 00067000
         ST    @10,@AL00001+4                                   02S0075 00068000
         LA    @10,DUPEMASK                                     02S0075 00069000
         ST    @10,@TF00002                                     02S0075 00070000
         LA    @10,@TF00002                                     02S0075 00071000
         ST    @10,@AL00001+8                                   02S0075 00072000
         LA    @10,MUTEMASK                                     02S0075 00073000
         ST    @10,@TF00003                                     02S0075 00074000
         LA    @10,@TF00003                                     02S0075 00075000
         ST    @10,@AL00001+12                                  02S0075 00076000
         LA    @10,KEYTABLE                                     02S0075 00077000
         ST    @10,@TF00004                                     02S0075 00078000
         LA    @10,@TF00004                                     02S0075 00079000
         ST    @10,@AL00001+16                                  02S0075 00080000
         L     @10,@PC00001+4                                   02S0075 00081000
         ST    @10,@AL00001+20                                  02S0075 00082000
         L     @15,@CV00126                                     02S0075 00083000
         LA    @01,@AL00001                                     02S0075 00084000
         BALR  @14,@15                                          02S0075 00085000
*IF ERRCODE = ZERO THEN                /* WAS SYNTAX OK ?            */ 00086000
         SLR   @10,@10                                          02S0076 00087000
         L     @15,@PC00001+4                                   02S0076 00088000
         SLR   @14,@14                                          02S0076 00089000
         ICM   @14,3,ERRCODE(@15)                               02S0076 00090000
         CR    @10,@14                                          02S0076 00091000
         BNE   @RF00076                                         02S0076 00092000
*  DO;                                 /* YES                        */ 00093000
*    IF DDNAMTUP = ZERO & DSNAMTUP = ZERO & RELNOTUP = ZERO THEN        00094000
         C     @10,DDNAMTUP                                     02S0078 00095000
         BNE   @RF00078                                         02S0078 00096000
         C     @10,DSNAMTUP                                     02S0078 00097000
         BNE   @RF00078                                         02S0078 00098000
         C     @10,RELNOTUP                                     02S0078 00099000
         BNE   @RF00078                                         02S0078 00100000
*      ERRCODE = RCKEYREQ;             /* SET ERRCODE IF REQUIRED KEY   00101000
*                                         NOT SPECIFIED              */ 00102000
         MVC   ERRCODE(2,@15),@CB01331                          02S0079 00103000
*  END;                                /* END TEST FOR REQUIRED KEY  */ 00104000
@RF00078 DS    0H                                               02S0081 00105000
*IF ERRCODE = ZERO THEN                /* IS ERRCODE ZERO ?          */ 00106000
@RF00076 SLR   @10,@10                                          01S0081 00107000
         L     @15,@PC00001+4                                   01S0081 00108000
         SLR   @14,@14                                          01S0081 00109000
         ICM   @14,3,ERRCODE(@15)                               01S0081 00110000
         CR    @10,@14                                          01S0081 00111000
         BNE   @RF00081                                         01S0081 00112000
*  DO;                                 /* YES, REQUIRED KEYS ARE        00113000
*                                         PRESENT AND SYNTAX IS GOOD */ 00114000
*    DSABPTR = DSQFRSTP;               /* GET FIRST DSAB ADDRESS     */ 00115000
         L     @15,@PC00001+8                                   01S0083 00116000
         L     @01,DINJSCBP(,@15)                               01S0083 00117000
         L     @01,JSCDSABQ(,@01)                               01S0083 00118000
         L     @15,DSQFRSTP(,@01)                               01S0083 00119000
         ST    @15,DSABPTR                                      01S0083 00120000
*/********************************************************************/ 00121000
*/*                                                                  */ 00122000
*/* SEGMENT NAME - DINRTSRC                                          */ 00123000
*/*                                                                  */ 00124000
*/* DESCRIPTIVE NAME - DYNAMIC INFORMATION RETRIEVAL SEARCH ROUTINE  */ 00125000
*/*                                                                  */ 00126000
*/* FUNCTION - THIS ROUTINE SEARCHES THE DSAB CHAIN BY DDNAME, DSNAME*/ 00127000
*/*            OR BY RELATIVE NUMBER, DEPENDING ON THE TEXT UNIT     */ 00128000
*/*            PRESENT, TO FIND A DSAB THAT CORRESPONDS TO           */ 00129000
*/*            THE REQUEST.                                          */ 00130000
*/*                                                                  */ 00131000
*/* OPERATION - THIS ROUTINE IS ENTERED ONLY IF THE SYNTAX IS VALID  */ 00132000
*/*            AND THERE ARE NO MUTUALLY EXCLUSIVE KEYS PRESENT.     */ 00133000
*/*            THEREFORE, THE SEARCH WILL BE DONE IN ONE OF THREE    */ 00134000
*/*            WAYS, DEPENDING ON THE TEXT UNIT POINTER PRESENT      */ 00135000
*/*            IN THE KEY TABLE.                                     */ 00136000
*/*                                                                  */ 00137000
*/*            1. IF THE DDNAME TEXT UNIT PTR IS NON-ZERO, THEN      */ 00138000
*/*               IEFDB4FC IS INVOKED TO SEARCH FOR THE SPECIFIED    */ 00139000
*/*               DDNAME.                                            */ 00140000
*/*            2. IF THE DSNAME TEXT UNIT PTR IS NON-ZERO, THEN      */ 00141000
*/*               IEFDB4FA IS INVOKED TO SEARCH THE SIOTS            */ 00142000
*/*               AND JFCB'S FOR THE SPECIFIED DSNAME.               */ 00143000
*/*            3. THE DSAB CHAIN IS SEARCHED, STARTING FROM THE      */ 00144000
*/*               FIRST DSAB, UNTIL THE RELATIVE ENTRY IS FOUND OR   */ 00145000
*/*               THE END OF THE DSAB CHAIN IS REACHED.              */ 00146000
*/*                                                                  */ 00147000
*/* ENTRY - DINRTSRC(INCLUDED SEGMENT)                               */ 00148000
*/*                                                                  */ 00149000
*/* PURPOSE - SEE FUNCTION                                           */ 00150000
*/*                                                                  */ 00151000
*/* INPUT DATA - DSABPTR,JSCBPTR,TEXT PTRS                           */ 00152000
*/*                                                                  */ 00153000
*/* EXITS - ALL ARE TO NEXT SEQUENTIAL INSTRUCTION                   */ 00154000
*/*                                                                  */ 00155000
*/*  NORMAL - DDNAME,DSNAME OR RELATIVE ENTRY FOUND                  */ 00156000
*/*                                                                  */ 00157000
*/*  ERROR - DDNAME,DSNAME OR RELATIVE ENTRY NOT FOUND               */ 00158000
*/*                                                                  */ 00159000
*/* OUTPUT - IF NO ERROR, THE DSABPTR HAS THE ADDRESS OF THE DSAB    */ 00160000
*/*          THAT CORRESPONDS TO THE SPECIFIED DDNAME, DSNAME OR     */ 00161000
*/*          RELATIVE ENTRY NUMBER.                                  */ 00162000
*/*                                                                  */ 00163000
*/*          IF THE SEARCH WAS DONE BY DSNAME, THEN FSTDSBSW IS ON   */ 00164000
*/*          INDICATING SIOTS AND JFCBS HAVE BEEN READ STARTING AT   */ 00165000
*/*          THE FIRST DSAB IN THE CHAIN.                            */ 00166000
*/*                                                                  */ 00167000
*/*          IF ERROR, ERRCODE IS SET TO:                            */ 00168000
*/*             1. RCDDNFND IF DDNAME NOT FOUND                      */ 00169000
*/*             2. RCDSNFND IF DSNAME NOT FOUND                      */ 00170000
*/*             3. RCRELNNF IF RELATIVE ENTRY NOT FOUND              */ 00171000
*/*                                                                  */ 00172000
*/********************************************************************/ 00173000
*    SWITCHES = ''B;                   /* CLEAR SWITCHES             */ 00174000
         MVI   SWITCHES,X'00'                                   02S0084 00175000
*    IF DDNAMTUP ¬= ZERO THEN          /* IS DDNAME TEXT UNIT PRESENT*/ 00176000
         L     @15,DDNAMTUP                                     02S0085 00177000
         CR    @15,@10                                          02S0085 00178000
         BE    @RF00085                                         02S0085 00179000
*      DO;                             /* YES, SEARCH DSABS BY DDNAME*/ 00180000
*        TEXTPTR = DDNAMTUP;           /* GET ADDRESS OF TEXT UNIT   */ 00181000
         LR    TEXTPTR,@15                                      02S0087 00182000
*        DDNAREA = '';                 /* BLANK DDNAME AREA          */ 00183000
         MVI   DDNAREA,C' '                                     02S0088 00184000
         MVC   DDNAREA+1(7),DDNAREA                             02S0088 00185000
*        DDNAREA(1:TEXTULNG) = TEXTUPAR(1:TEXTULNG); /* MOVE DDNAME  */ 00186000
         ICM   @03,12,TEXTULNG(TEXTPTR)                         02S0089 00187000
         SRA   @03,16                                           02S0089 00188000
         BCTR  @03,0                                            02S0089 00189000
         EX    @03,@SM01719                                     02S0089 00190000
*        DDNAMEP = ADDR(DDNAREA);      /* GET ADDR OF DDNAME AREA    */ 00191000
         LA    @15,DDNAREA                                      02S0090 00192000
         ST    @15,DDNAMEP                                      02S0090 00193000
*        RTNADDR = ZERO;               /* ZERO RETURN AREA ADDRESS   */ 00194000
         ST    @10,RTNADDR                                      02S0091 00195000
*        CALL IEFDB4FC                 /* CALL DDNAME SEARCH         */ 00196000
*                     (DSABPTR,DDNAMEP,ADDR(RTNADDR));          02S0092 00197000
         LA    @10,DSABPTR                                      02S0092 00198000
         ST    @10,@AL00001                                     02S0092 00199000
         LA    @10,DDNAMEP                                      02S0092 00200000
         ST    @10,@AL00001+4                                   02S0092 00201000
         LA    @10,RTNADDR                                      02S0092 00202000
         ST    @10,@TF00001                                     02S0092 00203000
         LA    @10,@TF00001                                     02S0092 00204000
         ST    @10,@AL00001+8                                   02S0092 00205000
         L     @15,@CV00124                                     02S0092 00206000
         LA    @01,@AL00001                                     02S0092 00207000
         BALR  @14,@15                                          02S0092 00208000
*        IF RTNADDR = ZERO THEN        /* WAS DDNAME FOUND IN DSABS ?*/ 00209000
         L     @10,RTNADDR                                      02S0093 00210000
         LTR   @10,@10                                          02S0093 00211000
         BNZ   @RF00093                                         02S0093 00212000
*          ERRCODE = RCDDNFND;         /* NO, SET DD NOT FND ERR CODE*/ 00213000
         L     @10,@PC00001+4                                   02S0094 00214000
         MVC   ERRCODE(2,@10),@CB01355                          02S0094 00215000
*        ELSE                          /* YES, DDNAME WAS FOUND      */ 00216000
*          DSABPTR = RTNADDR;          /* POINT TO PROPER DSAB       */ 00217000
         B     @RC00093                                         02S0095 00218000
@RF00093 L     @10,RTNADDR                                      02S0095 00219000
         ST    @10,DSABPTR                                      02S0095 00220000
*      END;                            /* END DDNAME SEARCH          */ 00221000
*    ELSE;                             /* FALL THROUGH-DDNAME NOT       00222000
*                                         SPECIFIED                  */ 00223000
@RF00085 DS    0H                                               02S0098 00224000
*    IF DSNAMTUP ¬= ZERO THEN          /* IS DSNAME TEXT UNIT PRESENT*/ 00225000
@RC00085 L     @10,DSNAMTUP                                     02S0098 00226000
         LTR   @10,@10                                          02S0098 00227000
         BZ    @RF00098                                         02S0098 00228000
*      DO;                             /* YES,SEARCH BY DSNAME       */ 00229000
*        RESPECIFY S99TUNIT BASED(DSNAMTUP);                    02S0100 00230000
*        IF S99TUPAR(1:2) = '&&' THEN  /* IS DSN OF FORM,&&NAME      */ 00231000
         CLC   S99TUPAR(2,@10),@CC01704                         02S0101 00232000
         BNE   @RF00101                                         02S0101 00233000
*          DO;                         /* YES, MAKE TU OF FORM,&NAME */ 00234000
*            DSNAMKEY = S99TUKEY;      /* MOVE IN DSNAME KEY         */ 00235000
         MVC   DSNAMKEY(2),S99TUKEY(@10)                        02S0103 00236000
*            DSNAMNUM = S99TUNUM;      /* MOVE IN NUMBER OF PARMS    */ 00237000
         MVC   DSNAMNUM(2),S99TUNUM(@10)                        02S0104 00238000
*            DSNAMLEN = S99TULNG - 1;  /* SET LENGTH FOR &NAME       */ 00239000
         ICM   @15,12,S99TULNG(@10)                             02S0105 00240000
         SRA   @15,16                                           02S0105 00241000
         LR    @14,@15                                          02S0105 00242000
         BCTR  @14,0                                            02S0105 00243000
         STH   @14,DSNAMLEN                                     02S0105 00244000
*            DSNAMPAR = S99TUPAR(2:S99TULNG); /* MOVE &NAME TO TU    */ 00245000
         MVI   DSNAMPAR+1,C' '                                  02S0106 00246000
         MVC   DSNAMPAR+2(42),DSNAMPAR+1                        02S0106 00247000
         BCTR  @15,0                                            02S0106 00248000
         BCTR  @15,0                                            02S0106 00249000
         EX    @15,@SM01721                                     02S0106 00250000
*            DSNAMTUP = ADDR(DSNAMTU); /* SET PTR TO NEW TEXT UNIT   */ 00251000
         LA    @10,DSNAMTU                                      02S0107 00252000
         ST    @10,DSNAMTUP                                     02S0107 00253000
*          END;                                                 02S0108 00254000
*        TEXTPTR = DSNAMTUP;           /* GET ADDRESS OF TEXT UNIT   */ 00255000
@RF00101 L     TEXTPTR,DSNAMTUP                                 02S0109 00256000
*        DSNPTR = ADDR(TEXTUENT);      /* GET ADDR OF DSNAME INFO    */ 00257000
         LA    @10,TEXTUENT(,TEXTPTR)                           02S0110 00258000
         ST    @10,DSNPTR                                       02S0110 00259000
*        FUNCTION = FUNCTION && FUNCTION; /* ZERO FUNCTION MAP       */ 00260000
         XC    FUNCTION(2),FUNCTION                             02S0111 00261000
*        JFCBALNM = ON;                /* INDICATE SEARCH JFCB AND      00262000
*                                         ALTERNATE NAME             */ 00263000
         OI    JFCBALNM,B'00100000'                             02S0112 00264000
*        RTNADDR = ZERO;               /* ZERO RETURN AREA           */ 00265000
         SLR   @10,@10                                          02S0113 00266000
         ST    @10,RTNADDR                                      02S0113 00267000
*        CALL IEFDB4FA                 /* CALL DSNAME SEARCH ROUTINE */ 00268000
*                     (DSABPTR,DSNPTR,RTNADDR,FUNCTION);        02S0114 00269000
         LA    @10,DSABPTR                                      02S0114 00270000
         ST    @10,@AL00001                                     02S0114 00271000
         LA    @10,DSNPTR                                       02S0114 00272000
         ST    @10,@AL00001+4                                   02S0114 00273000
         LA    @10,RTNADDR                                      02S0114 00274000
         ST    @10,@AL00001+8                                   02S0114 00275000
         LA    @10,FUNCTION                                     02S0114 00276000
         ST    @10,@AL00001+12                                  02S0114 00277000
         L     @15,@CV00123                                     02S0114 00278000
         LA    @01,@AL00001                                     02S0114 00279000
         BALR  @14,@15                                          02S0114 00280000
*        IF RTNADDR = ZERO THEN        /* WAS DSNAME FOUND ?         */ 00281000
         L     @10,RTNADDR                                      02S0115 00282000
         LTR   @10,@10                                          02S0115 00283000
         BNZ   @RF00115                                         02S0115 00284000
*          ERRCODE = RCDSNFND;         /* SET DSNAME NOT FOUND ERRCDE*/ 00285000
         L     @10,@PC00001+4                                   02S0116 00286000
         MVC   ERRCODE(2,@10),@CB01359                          02S0116 00287000
*        ELSE                          /* OTHERWISE, DSNAME FOUND    */ 00288000
*          DSABPTR = RTNADDR;          /* POINT TO PROPER DSAB       */ 00289000
         B     @RC00115                                         02S0117 00290000
@RF00115 L     @10,RTNADDR                                      02S0117 00291000
         ST    @10,DSABPTR                                      02S0117 00292000
*      END;                            /* END DSNAME TEXT UNIT PRESENT  00293000
*                                         PROCESSING                 */ 00294000
*    ELSE;                             /* FALL THROUGH - DSNAME NOT     00295000
*                                         SPECIFIED                  */ 00296000
@RF00098 DS    0H                                               02S0120 00297000
*    IF RELNOTUP ¬= ZERO THEN          /* IS RELATIVE # TEXT PRESENT */ 00298000
@RC00098 L     @10,RELNOTUP                                     02S0120 00299000
         SLR   @15,@15                                          02S0120 00300000
         CR    @10,@15                                          02S0120 00301000
         BE    @RF00120                                         02S0120 00302000
*      DO;                             /* YES, SEARCH BY RELATIVE #  */ 00303000
*        TEXTPTR = RELNOTUP;           /* GET ADDRESS OF TEXT UNIT   */ 00304000
         LR    TEXTPTR,@10                                      02S0122 00305000
*        IF TEXTUPAR(1:2) <= ZERO | DSABPTR = ZERO THEN /* IS RELATIVE  00306000
*                                       # <= 0 OR NO DSABS PRESENT ? */ 00307000
         SLR   @10,@10                                          02S0123 00308000
         ICM   @10,3,TEXTUPAR(TEXTPTR)                          02S0123 00309000
         CR    @15,@10                                          02S0123 00310000
         BNL   @RT00123                                         02S0123 00311000
         C     @15,DSABPTR                                      02S0123 00312000
         BNE   @RF00123                                         02S0123 00313000
@RT00123 DS    0H                                               02S0124 00314000
*          ERRCODE = RCRELNNF;         /* YES SET ERRCODE            */ 00315000
         L     @10,@PC00001+4                                   02S0124 00316000
         MVC   ERRCODE(2,@10),@CB01361                          02S0124 00317000
*        CONTINUE = ON;                /* INITIALIZE SWITCH          */ 00318000
@RF00123 OI    CONTINUE,B'10000000'                             02S0125 00319000
*        DSABNBR = 1;                  /* SET DSAB COUNT TO 1        */ 00320000
         LA    DSABNBR,1                                        02S0126 00321000
*        DO WHILE (ERRCODE = ZERO & CONTINUE = ON); /* LOOP CONTROL  */ 00322000
         B     @DE00127                                         02S0127 00323000
@DL00127 DS    0H                                               02S0128 00324000
*          IF DSABNBR = TEXTUPAR(1:2) THEN /*WAS RELATIVE DSAB FOUND?*/ 00325000
         SLR   @10,@10                                          02S0128 00326000
         ICM   @10,3,TEXTUPAR(TEXTPTR)                          02S0128 00327000
         CR    DSABNBR,@10                                      02S0128 00328000
         BNE   @RF00128                                         02S0128 00329000
*            CONTINUE = OFF;           /* YES, STOP PROCESSING       */ 00330000
         NI    CONTINUE,B'01111111'                             02S0129 00331000
*          ELSE                        /* OTHERWISE, CONTINUE SEARCH */ 00332000
*            DO;                       /* CONTINUE DSAB SEARCH       */ 00333000
         B     @RC00128                                         02S0130 00334000
@RF00128 DS    0H                                               02S0131 00335000
*              IF DSABFCHN ¬= ZERO THEN /* END OF DSAB CHAIN ?       */ 00336000
         L     @10,DSABPTR                                      02S0131 00337000
         L     @10,DSABFCHN(,@10)                               02S0131 00338000
         LTR   @10,@10                                          02S0131 00339000
         BZ    @RF00131                                         02S0131 00340000
*                DO;                   /* NO, UPDATE POINTER & COUNT */ 00341000
*                  DSABPTR = DSABFCHN; /* UPDATE DSABPTR             */ 00342000
         ST    @10,DSABPTR                                      02S0133 00343000
*                  DSABNBR = DSABNBR + 1; /* INCREMENT DSAB COUNT    */ 00344000
         AL    DSABNBR,@CF00084                                 02S0134 00345000
*                END;                  /* END OF PTR UPDATE          */ 00346000
*              ELSE                    /* OTHERWISE, END OF DSAB CHN */ 00347000
*                ERRCODE = RCRELNNF;   /* SET DSAB NOT FOUND ERRCODE */ 00348000
         B     @RC00131                                         02S0136 00349000
@RF00131 L     @10,@PC00001+4                                   02S0136 00350000
         MVC   ERRCODE(2,@10),@CB01361                          02S0136 00351000
*            END;                      /* END DSAB SEARCH            */ 00352000
@RC00131 DS    0H                                               02S0138 00353000
*        END;                          /* END OF LOOP CONTROL        */ 00354000
@RC00128 DS    0H                                               02S0138 00355000
@DE00127 L     @10,@PC00001+4                                   02S0138 00356000
         ICM   @15,3,ERRCODE(@10)                               02S0138 00357000
         BNZ   @DC00127                                         02S0138 00358000
         TM    CONTINUE,B'10000000'                             02S0138 00359000
         BO    @DL00127                                         02S0138 00360000
@DC00127 DS    0H                                               02S0139 00361000
*      END;                            /* END RELATIVE # PROCESSING  */ 00362000
*    ELSE;                             /* RELATIVE # NOT SPECIFIED   */ 00363000
@RF00120 DS    0H                                               02S0141 00364000
*  END;                                /* END SEARCH FOR PROPER DSAB */ 00365000
*IF ERRCODE = ZERO THEN                /* IF ERRCODE = 0, THEN PROPER   00366000
*                                         DSAB FOUND                 */ 00367000
@RF00081 SLR   @10,@10                                          01S0142 00368000
         L     @15,@PC00001+4                                   01S0142 00369000
         SLR   @14,@14                                          01S0142 00370000
         ICM   @14,3,ERRCODE(@15)                               01S0142 00371000
         CR    @10,@14                                          01S0142 00372000
         BNE   @RF00142                                         01S0142 00373000
*  DO;                                 /* 0 ERRCODE, RETRIEVE DATA   */ 00374000
*/********************************************************************/ 00375000
*/*                                                                  */ 00376000
*/* SEGMENT NAME - RETRIEVE                                          */ 00377000
*/*                                                                  */ 00378000
*/* DESCRIPTIVE NAME - RETRIEVE REQUESTED INFORMATION                */ 00379000
*/*                                                                  */ 00380000
*/* FUNCTION - THIS ROUTINE DETERMINES WHAT INFORMATION HAS BEEN     */ 00381000
*/*            REQUESTED AND EXAMINES CONTROL BLOCKS IN ORDER TO     */ 00382000
*/*            OBTAIN THE NECESSARY DATA. THE DATA IS STORED         */ 00383000
*/*            INTO THE TEXT UNIT PARM FIELDS.                       */ 00384000
*/*                                                                  */ 00385000
*/* OPERATION - THE KEY TABLE IS INTERROGATED TO DETERMINE WHICH KEYS*/ 00386000
*/*             HAVE BEEN SPECIFIED.  THE DATA IS THEN STORED INTO   */ 00387000
*/*             THE ASSOCIATED TEXT UNITS, AFTER RETRIEVING IT       */ 00388000
*/*             FROM THE APPROPRIATE CONTROL BLOCKS.                 */ 00389000
*/*                                                                  */ 00390000
*/*             IF RETURN DSORG (KEY DINRTORG) HAS BEEN SPECIFIED,   */ 00391000
*/*             IEFDB4FE IS INVOKED ONLY IF THE DSORG FIELD IN       */ 00392000
*/*             THE DSAB IS 0.                                       */ 00393000
*/*                                                                  */ 00394000
*/* ENTRY - RETRIEVE (INCLUDED SEGMENT)                              */ 00395000
*/*                                                                  */ 00396000
*/* PURPOSE - SEE FUNCTION                                           */ 00397000
*/*                                                                  */ 00398000
*/* INPUT DATA - TEXT UNITS,KEY TABLE                                */ 00399000
*/*                                                                  */ 00400000
*/* EXITS - ALL ARE TO NEXT SEQUENTIAL INSTRUCTION                   */ 00401000
*/*                                                                  */ 00402000
*/*  NORMAL - ERRCODE IS ZERO AND ALL REQUESTED DATA RETURNED        */ 00403000
*/*                                                                  */ 00404000
*/*  ERROR - NONE                                                    */ 00405000
*/*                                                                  */ 00406000
*/* OUTPUT DATA - TEXT UNITS CONTAIN DATA REQUESTED.                 */ 00407000
*/*                                                                  */ 00408000
*/********************************************************************/ 00409000
*    IF RTDDNTUP  ¬= ZERO THEN         /* RETURN DDNAME REQUESTED ?  */ 00410000
         L     @15,RTDDNTUP                                     02S0144 00411000
         CR    @15,@10                                          02S0144 00412000
         BE    @RF00144                                         02S0144 00413000
*      DO;                             /* YES                        */ 00414000
*        TEXTPTR = RTDDNTUP;           /* GET TEXT UNIT POINTER      */ 00415000
         LR    TEXTPTR,@15                                      02S0146 00416000
*        LIMIT = 8;                    /* SET MAX # OF CHAR TO SCAN  */ 00417000
         LA    LIMIT,8                                          02S0147 00418000
*        CHARPTR = ADDR(TIOEDDNM);     /* ADDR OF FIELD TO SCAN      */ 00419000
         L     @10,DSABPTR                                      02S0148 00420000
         L     CHARPTR,DSABTIOT(,@10)                           02S0148 00421000
         LA    CHARPTR,TIOEDDNM(,CHARPTR)                       02S0148 00422000
*        CALL BLNKSCAN;                /* CALL ROUTINE TO SCAN FOR      00423000
*                                         BLANKS AND MOVE FIELD      */ 00424000
         BAL   @14,BLNKSCAN                                     02S0149 00425000
*      END;                            /* END RETURN DDNAME REQUEST  */ 00426000
*                                                               02S0150 00427000
*    IF RTDSNTUP ¬= ZERO THEN          /* RETURN DSNAME REQUESTED?   */ 00428000
@RF00144 L     @10,RTDSNTUP                                     02S0151 00429000
         LTR   @10,@10                                          02S0151 00430000
         BZ    @RF00151                                         02S0151 00431000
*      DO;                             /* YES                        */ 00432000
*        TEXTPTR = RTDSNTUP;           /* GET TEXT UNIT POINTER      */ 00433000
         LR    TEXTPTR,@10                                      02S0153 00434000
*        LIMIT = 44;                   /* SET MAX # OF CHAR TO SCAN  */ 00435000
         LA    LIMIT,44                                         02S0154 00436000
*        CHARPTR = ADDR(JFCBDSNM);     /* GET ADDRESS OF DSNAME FIELD*/ 00437000
         L     @10,DSABPTR                                      02S0155 00438000
         L     @10,DSABSIOT(,@10)                               02S0155 00439000
         L     CHARPTR,SJFCBPTR(,@10)                           02S0155 00440000
*        CALL BLNKSCAN;                /* CALL ROUTINE TO SCAN FOR      00441000
*                                         BLANKS AND MOVE FIELD      */ 00442000
         BAL   @14,BLNKSCAN                                     02S0156 00443000
*      END;                            /* END RETURN DSNAME REQUEST  */ 00444000
*                                                               02S0157 00445000
*    IF RTMEMTUP ¬= ZERO THEN          /* RETURN MEMBERNAME REQUESTED*/ 00446000
@RF00151 L     @10,RTMEMTUP                                     02S0158 00447000
         LTR   @10,@10                                          02S0158 00448000
         BZ    @RF00158                                         02S0158 00449000
*      DO;                             /* YES                        */ 00450000
*        TEXTPTR = RTMEMTUP;           /* GET TEXT UNIT POINTER      */ 00451000
         LR    TEXTPTR,@10                                      02S0160 00452000
*        LIMIT = 8;                    /* SET MAX # OF CHAR TO SCAN  */ 00453000
         LA    LIMIT,8                                          02S0161 00454000
*        CHARPTR = ADDR(JFCBELNM);     /* ADDR OF FIELD TO SCAN      */ 00455000
         L     @10,DSABPTR                                      02S0162 00456000
         L     @10,DSABSIOT(,@10)                               02S0162 00457000
         L     CHARPTR,SJFCBPTR(,@10)                           02S0162 00458000
         LA    CHARPTR,JFCBELNM(,CHARPTR)                       02S0162 00459000
*        CALL BLNKSCAN;                /* CALL ROUTINE TO SCAN FOR      00460000
*                                         BLANKS AND MOVE FIELD      */ 00461000
         BAL   @14,BLNKSCAN                                     02S0163 00462000
*      END;                            /* END RETURN MBRNAME REQUEST */ 00463000
*                                                               02S0164 00464000
*    IF RTSTATUP ¬= ZERO THEN          /* RETURN STATUS REQUESTED ?  */ 00465000
@RF00158 L     @10,RTSTATUP                                     02S0165 00466000
         LTR   @10,@10                                          02S0165 00467000
         BZ    @RF00165                                         02S0165 00468000
*      DO;                             /* YES                        */ 00469000
*        TEXTPTR = RTSTATUP;           /* GET TEXT UNIT POINTER      */ 00470000
         LR    TEXTPTR,@10                                      02S0167 00471000
*        IF SCTSOLD = ON & JFCSHARE = ON THEN     /* IS STATUS SHR ? */ 00472000
         L     @10,DSABPTR                                      02S0168 00473000
         L     @10,DSABSIOT(,@10)                               02S0168 00474000
         TM    SCTSOLD(@10),B'00000001'                         02S0168 00475000
         BNO   @RF00168                                         02S0168 00476000
         L     @10,SJFCBPTR(,@10)                               02S0168 00477000
         TM    JFCSHARE(@10),B'00001000'                        02S0168 00478000
         BNO   @RF00168                                         02S0168 00479000
*          TEXTUPAR(1) = '08'X;        /* YES, SET TO SHR            */ 00480000
         MVI   TEXTUPAR(TEXTPTR),X'08'                          02S0169 00481000
*        ELSE                          /* OTHERWISE NOT SHR          */ 00482000
*          DO;                         /* SET STATUS                 */ 00483000
         B     @RC00168                                         02S0170 00484000
@RF00168 DS    0H                                               02S0171 00485000
*            IF JFCDISP = '10'B | JFCMODNW = ON THEN  /* STATUS MOD? */ 00486000
         L     @10,DSABPTR                                      02S0171 00487000
         L     @10,DSABSIOT(,@10)                               02S0171 00488000
         L     @10,SJFCBPTR(,@10)                               02S0171 00489000
         TM    JFCDISP(@10),B'10000000'                         02S0171 00490000
         BNO   @GL00006                                         02S0171 00491000
         TM    JFCDISP(@10),B'01000000'                         02S0171 00492000
         BZ    @RT00171                                         02S0171 00493000
@GL00006 L     @10,DSABPTR                                      02S0171 00494000
         L     @10,DSABSIOT(,@10)                               02S0171 00495000
         L     @10,SJFCBPTR(,@10)                               02S0171 00496000
         TM    JFCMODNW(@10),B'00010000'                        02S0171 00497000
         BNO   @RF00171                                         02S0171 00498000
@RT00171 DS    0H                                               02S0172 00499000
*              TEXTUPAR(1) = '02'X;    /* RETURN MOD STATUS          */ 00500000
         MVI   TEXTUPAR(TEXTPTR),X'02'                          02S0172 00501000
*            ELSE                      /* NOT MOD                    */ 00502000
*              DO;                     /* RETURN STATUS              */ 00503000
         B     @RC00171                                         02S0173 00504000
@RF00171 DS    0H                                               02S0174 00505000
*                TEXTUPAR(1) = SCTSBYT3; /* MOVE STATUS BYTE         */ 00506000
         L     @10,DSABPTR                                      02S0174 00507000
         L     @10,DSABSIOT(,@10)                               02S0174 00508000
         MVC   TEXTUPAR(1,TEXTPTR),SCTSBYT3(@10)                02S0174 00509000
*                TEXTUPAR(1) = TEXTUPAR(1) & '07'X; /* CLEAR BITS NOT   00510000
*                                                      NECESSARY     */ 00511000
         NI    TEXTUPAR(TEXTPTR),X'07'                          02S0175 00512000
*              END;                    /* END STATUS RETURN          */ 00513000
*          END;                        /* END STATUS BYTE MOVE       */ 00514000
@RC00171 DS    0H                                               02S0178 00515000
*      END;                            /* END RETURN STATUS REQUEST  */ 00516000
*                                                               02S0178 00517000
@RC00168 DS    0H                                               02S0179 00518000
*    IF RTNDPTUP ¬= ZERO THEN          /* RETURN NORMAL DISP REQUEST?*/ 00519000
@RF00165 L     @10,RTNDPTUP                                     02S0179 00520000
         LTR   @10,@10                                          02S0179 00521000
         BZ    @RF00179                                         02S0179 00522000
*      DO;                             /* YES                        */ 00523000
*        TEXTPTR = RTNDPTUP;           /* GET TEXT UNIT POINTER      */ 00524000
         LR    TEXTPTR,@10                                      02S0181 00525000
*        TEXTUPAR(1) = SCTSDISP;       /* MOVE DISP FIELD            */ 00526000
         L     @10,DSABPTR                                      02S0182 00527000
         L     @10,DSABSIOT(,@10)                               02S0182 00528000
         MVC   TEXTUPAR(1,TEXTPTR),SCTSDISP(@10)                02S0182 00529000
*        TEXTUPAR(1) = TEXTUPAR(1) & '1F'X;  /* CLEAR UNEEDED BITS   */ 00530000
         NI    TEXTUPAR(TEXTPTR),X'1F'                          02S0183 00531000
*      END;                            /* END RETURN NORMAL DISP REQ */ 00532000
*    IF RTCDPTUP ¬= ZERO THEN          /* RETURN CONDITION DISP REQ  */ 00533000
@RF00179 L     @10,RTCDPTUP                                     02S0185 00534000
         LTR   @10,@10                                          02S0185 00535000
         BZ    @RF00185                                         02S0185 00536000
*      DO;                             /* YES                        */ 00537000
*        TEXTPTR = RTCDPTUP;           /* GET TEXT UNIT POINTER      */ 00538000
         LR    TEXTPTR,@10                                      02S0187 00539000
*        TEXTUPAR(1) = SIOTALTD;       /* MOVE CONDITIONAL DISP FIELD*/ 00540000
         L     @10,DSABPTR                                      02S0188 00541000
         L     @10,DSABSIOT(,@10)                               02S0188 00542000
         MVC   TEXTUPAR(1,TEXTPTR),SIOTALTD(@10)                02S0188 00543000
*        TEXTUPAR(1) = TEXTUPAR(1) & '0F'X; /* CLEAR UNEEDED BITS    */ 00544000
         NI    TEXTUPAR(TEXTPTR),X'0F'                          02S0189 00545000
*      END;                            /* END RETURN COND DISP REQ   */ 00546000
*                                                               02S0190 00547000
*    IF RTORGTUP ¬= ZERO THEN          /* RETURN DSORG REQUEST ?     */ 00548000
@RF00185 SLR   @10,@10                                          02S0191 00549000
         C     @10,RTORGTUP                                     02S0191 00550000
         BE    @RF00191                                         02S0191 00551000
*      DO;                             /* YES                        */ 00552000
*        IF DSABORG = 0 THEN           /* IS DSORG FILLED IN IN DSAB */ 00553000
         L     @01,DSABPTR                                      02S0193 00554000
         LH    @15,DSABORG(,@01)                                02S0193 00555000
         N     @15,@CF01726                                     02S0193 00556000
         CR    @10,@15                                          02S0193 00557000
         BNE   @RF00193                                         02S0193 00558000
*          CALL IEFDB4FE (DSABPTR);    /* CALL RETURN DSORG ROUTINE  */ 00559000
         LA    @10,DSABPTR                                      02S0194 00560000
         ST    @10,@AL00001                                     02S0194 00561000
         L     @15,@CV00125                                     02S0194 00562000
         LA    @01,@AL00001                                     02S0194 00563000
         BALR  @14,@15                                          02S0194 00564000
*        ELSE;                         /* DSORG IS PRESENT           */ 00565000
@RF00193 DS    0H                                               02S0196 00566000
*        TEXTPTR = RTORGTUP;           /* GET TEXT UNIT POINTER      */ 00567000
         L     TEXTPTR,RTORGTUP                                 02S0196 00568000
*        TEXTUPAR(1:2) = DSABORG(1:2); /* MOVE DSORG FROM DSAB TO       00569000
*                                         TEXT UNIT PARM FIELD       */ 00570000
         L     @10,DSABPTR                                      02S0197 00571000
         MVC   TEXTUPAR(2,TEXTPTR),DSABORG(@10)                 02S0197 00572000
*      END;                            /* END RETURN DSORG REQUEST   */ 00573000
*    IF RTLIMTUP ¬= ZERO THEN          /* RETURN LIMIT REQUEST ?     */ 00574000
@RF00191 L     @10,RTLIMTUP                                     02S0199 00575000
         LTR   @10,@10                                          02S0199 00576000
         BZ    @RF00199                                         02S0199 00577000
*      DO;                             /* YES                        */ 00578000
*        TEXTPTR = RTLIMTUP;           /* GET TEXT UNIT ADDRESS      */ 00579000
         LR    TEXTPTR,@10                                      02S0201 00580000
*        LOOPPTR = DSQFRSTP;           /* GET FIRST DSAB ADDRESS     */ 00581000
         L     @10,@PC00001+8                                   02S0202 00582000
         L     @10,DINJSCBP(,@10)                               02S0202 00583000
         L     @10,JSCDSABQ(,@10)                               02S0202 00584000
         L     LOOPPTR,DSQFRSTP(,@10)                           02S0202 00585000
*        NUSECNT = ZERO;               /* ZERO NOT IN-USE COUNT      */ 00586000
         SLR   NUSECNT,NUSECNT                                  02S0203 00587000
*        DO WHILE (LOOPPTR ¬= ZERO);   /* COUNT NOT IN-USE PALC DSABS*/ 00588000
         B     @DE00204                                         02S0204 00589000
@DL00204 DS    0H                                               02S0205 00590000
*          IF LOOPPTR -> DSABNUSE = OFF /* NOT INUSE ?               */ 00591000
*          & LOOPPTR ->  DSABOPCT = 0  /* NOT OPEN ?                 */ 00592000
*          & LOOPPTR -> DSABPALC = ON  /* PERM ALLOC ?               */ 00593000
*          & LOOPPTR -> DSABSIOT -> SIOTGDGA = OFF THEN /* NOT SYSTEM   00594000
*                                         GENERATED REQUEST ?        */ 00595000
         TM    DSABNUSE(LOOPPTR),B'00000001'                    02S0205 00596000
         BNZ   @RF00205                                         02S0205 00597000
         LH    @10,DSABOPCT(,LOOPPTR)                           02S0205 00598000
         LTR   @10,@10                                          02S0205 00599000
         BNZ   @RF00205                                         02S0205 00600000
         TM    DSABPALC(LOOPPTR),B'01000000'                    02S0205 00601000
         BNO   @RF00205                                         02S0205 00602000
         L     @10,DSABSIOT(,LOOPPTR)                           02S0205 00603000
         TM    SIOTGDGA(@10),B'01000000'                        02S0205 00604000
         BNZ   @RF00205                                         02S0205 00605000
*            NUSECNT = NUSECNT + 1;    /* INCREMENT COUNT            */ 00606000
         AL    NUSECNT,@CF00084                                 02S0206 00607000
*          LOOPPTR =  LOOPPTR -> DSABFCHN; /* GET NEXT DSAB ADDR     */ 00608000
@RF00205 L     LOOPPTR,DSABFCHN(,LOOPPTR)                       02S0207 00609000
*        END;                          /* END NOT-IN-USE COUNT LOOP  */ 00610000
@DE00204 SLR   @10,@10                                          02S0208 00611000
         CR    LOOPPTR,@10                                      02S0208 00612000
         BNE   @DL00204                                         02S0208 00613000
*        TEXTUPAR(1:2) = (NUSECNT - SCTNIUSL); /* RETURN LIMIT       */ 00614000
         L     @05,@PC00001+8                                   02S0209 00615000
         L     @05,DINSCTP(,@05)                                02S0209 00616000
         LR    @03,NUSECNT                                      02S0209 00617000
         LH    @05,SCTNIUSL(,@05)                               02S0209 00618000
         N     @05,@CF01726                                     02S0209 00619000
         SLR   @03,@05                                          02S0209 00620000
         STCM  @03,3,TEXTUPAR(TEXTPTR)                          02S0209 00621000
*        IF (NUSECNT - SCTNIUSL) < ZERO THEN /* IS LIMIT NEGATIVE ?  */ 00622000
         CR    @03,@10                                          02S0210 00623000
         BNL   @RF00210                                         02S0210 00624000
*           TEXTUPAR(1:2) = 0;         /* SET IT TO ZERO             */ 00625000
         STCM  @10,3,TEXTUPAR(TEXTPTR)                          02S0211 00626000
*      END;                            /* END RETURN LIMIT REQUEST   */ 00627000
@RF00210 DS    0H                                               02S0213 00628000
*    IF RTATTTUP ¬= ZERO THEN          /* RETURN ATTRIBUTE REQUEST ? */ 00629000
@RF00199 L     @10,RTATTTUP                                     02S0213 00630000
         LTR   @10,@10                                          02S0213 00631000
         BZ    @RF00213                                         02S0213 00632000
*      DO;                             /* YES                        */ 00633000
*        TEXTPTR = RTATTTUP;           /* GET TEXT UNIT POINTER      */ 00634000
         LR    TEXTPTR,@10                                      02S0215 00635000
*        TEXTUPAR(1) = '00'X;          /* ZERO PARM FIELD            */ 00636000
         MVI   TEXTUPAR(TEXTPTR),X'00'                          02S0216 00637000
*        IF DSABPCAT = ON THEN         /* PERM CONCAT BIT ON ?       */ 00638000
         L     @10,DSABPTR                                      02S0217 00639000
         TM    DSABPCAT(@10),B'00000100'                        02S0217 00640000
         BNO   @RF00217                                         02S0217 00641000
*          TEXTUPAR(1) = TEXTUPAR(1) | '80'X; /* INDICATE PERM CONCAT*/ 00642000
         OI    TEXTUPAR(TEXTPTR),X'80'                          02S0218 00643000
*        IF DSABNUSE = ON | DSABOPCT > 0 THEN /* IS DSAB IN-USE ?    */ 00644000
@RF00217 L     @10,DSABPTR                                      02S0219 00645000
         TM    DSABNUSE(@10),B'00000001'                        02S0219 00646000
         BO    @RT00219                                         02S0219 00647000
         LH    @10,DSABOPCT(,@10)                               02S0219 00648000
         LTR   @10,@10                                          02S0219 00649000
         BNP   @RF00219                                         02S0219 00650000
@RT00219 DS    0H                                               02S0220 00651000
*          TEXTUPAR(1) = TEXTUPAR(1) | '40'X; /* INDICATE IN-USE     */ 00652000
         OI    TEXTUPAR(TEXTPTR),X'40'                          02S0220 00653000
*                                      /* CONTINUE                   */ 00654000
*        IF DSABPALC = ON THEN         /* IS DSAB MARKED PERM ALLOC ?*/ 00655000
@RF00219 L     @10,DSABPTR                                      02S0221 00656000
         TM    DSABPALC(@10),B'01000000'                        02S0221 00657000
         BNO   @RF00221                                         02S0221 00658000
*          TEXTUPAR(1) = TEXTUPAR(1) | '20'X; /* INDICATE PALOC      */ 00659000
         OI    TEXTUPAR(TEXTPTR),X'20'                          02S0222 00660000
*        IF DSABCONV = ON THEN         /* IS DSAB MARKED CONVERTIBLE?*/ 00661000
@RF00221 L     @10,DSABPTR                                      02S0223 00662000
         TM    DSABCONV(@10),B'00010000'                        02S0223 00663000
         BNO   @RF00223                                         02S0223 00664000
*          TEXTUPAR(1) = TEXTUPAR(1) | '10'X; /* INDICATE CONV       */ 00665000
         OI    TEXTUPAR(TEXTPTR),X'10'                          02S0224 00666000
*        IF DSABDALC=ON THEN           /* IF DSAB MARKED DYNAMICALLY    00667000
*                                         ALLOCATED THEN     @Z40NQPE*/ 00668000
@RF00223 L     @10,DSABPTR                                      02S0225 00669000
         TM    DSABDALC(@10),B'10000000'                        02S0225 00670000
         BNO   @RF00225                                         02S0225 00671000
*          TEXTUPAR(1)=TEXTUPAR(1) | '08'X; /*INDICATE DYNAMICALLY      00672000
*                                         ALLOCATED ATTRIBUTE IN TEXT   00673000
*                                         UNIT PARM FIELD.   @Z40NQPE*/ 00674000
         OI    TEXTUPAR(TEXTPTR),X'08'                          02S0226 00675000
*      END;                            /* END RETURN ATTRIBUTE       */ 00676000
@RF00225 DS    0H                                               02S0228 00677000
*    IF RTLSTTUP ¬= ZERO THEN          /* RETURN LAST DSAB INDICATOR?*/ 00678000
@RF00213 L     @10,RTLSTTUP                                     02S0228 00679000
         SLR   @15,@15                                          02S0228 00680000
         CR    @10,@15                                          02S0228 00681000
         BE    @RF00228                                         02S0228 00682000
*      DO;                             /* YES                        */ 00683000
*        TEXTPTR = RTLSTTUP;           /* GET TEXT UNIT POINTER      */ 00684000
         LR    TEXTPTR,@10                                      02S0230 00685000
*        IF DSABFCHN = ZERO THEN       /* LAST ENTRY ?               */ 00686000
         L     @10,DSABPTR                                      02S0231 00687000
         C     @15,DSABFCHN(,@10)                               02S0231 00688000
         BNE   @RF00231                                         02S0231 00689000
*          TEXTUPAR(1) = '80'X;        /* YES, INDICATE LAST ENTRY   */ 00690000
         MVI   TEXTUPAR(TEXTPTR),X'80'                          02S0232 00691000
*        ELSE                          /* OTHERWISE NOT LAST ENTRY   */ 00692000
*          TEXTUPAR(1) = '00'X;        /* INDICATE NOT LAST ENTRY    */ 00693000
         B     @RC00231                                         02S0233 00694000
@RF00231 MVI   TEXTUPAR(TEXTPTR),X'00'                          02S0233 00695000
*      END;                            /* END RETURN LAST DSAB CODE  */ 00696000
*                                                               02S0234 00697000
@RC00231 DS    0H                                               02S0235 00698000
*    IF RTTYPTUP ¬= ZERO THEN          /* RETURN DATASET TYPE REQ ?  */ 00699000
@RF00228 L     @10,RTTYPTUP                                     02S0235 00700000
         LTR   @10,@10                                          02S0235 00701000
         BZ    @RF00235                                         02S0235 00702000
*      DO;                             /* YES                        */ 00703000
*        TEXTPTR = RTTYPTUP;           /* GET TEXT UNIT POINTER      */ 00704000
         LR    TEXTPTR,@10                                      02S0237 00705000
*        IF TIOTTERM = ON THEN         /* TERMINAL DATASET ?         */ 00706000
         L     @10,DSABPTR                                      02S0238 00707000
         L     @10,DSABTIOT(,@10)                               02S0238 00708000
         TM    TIOTTERM(@10),B'00100000'                        02S0238 00709000
         BNO   @RF00238                                         02S0238 00710000
*          TEXTUPAR(1) = '40'X;        /* YES, SET TERMINAL INDICATOR*/ 00711000
         MVI   TEXTUPAR(TEXTPTR),X'40'                          02S0239 00712000
*        ELSE                          /* NOT A TERMINAL DATASET     */ 00713000
*          IF SCTDUMMY = ON & TIOEQNAM = OFF THEN /* IS THIS A DUMMY?*/ 00714000
         B     @RC00238                                         02S0240 00715000
@RF00238 L     @10,DSABPTR                                      02S0240 00716000
         L     @03,DSABSIOT(,@10)                               02S0240 00717000
         TM    SCTDUMMY(@03),B'10000000'                        02S0240 00718000
         BNO   @RF00240                                         02S0240 00719000
         L     @10,DSABTIOT(,@10)                               02S0240 00720000
         TM    TIOEQNAM(@10),B'00001000'                        02S0240 00721000
         BNZ   @RF00240                                         02S0240 00722000
*            TEXTUPAR(1) = '80'X;      /* YES, SET DUMMY INDICATOR   */ 00723000
         MVI   TEXTUPAR(TEXTPTR),X'80'                          02S0241 00724000
*          ELSE                        /* NON DUMMY                  */ 00725000
*            TEXTUPAR(1) = '00'X;      /* NON-DUMMY/NON-TERMINAL     */ 00726000
         B     @RC00240                                         02S0242 00727000
@RF00240 MVI   TEXTUPAR(TEXTPTR),X'00'                          02S0242 00728000
*      END;                            /* END RETURN DATASET TYPE    */ 00729000
@RC00240 DS    0H                                               02S0243 00730000
@RC00238 DS    0H                                               02S0244 00731000
*  END;                                /* END DSAB FOUND PROCESSING  */ 00732000
@RF00235 DS    0H                                               01S0245 00733000
*RETURN CODE(0);                       /* PASS RETURN CODE           */ 00734000
@RF00142 L     @13,4(,@13)                                      01S0245 00735000
         L     @00,@SIZDATD                                     01S0245 00736000
         LR    @01,@11                                          01S0245 00737000
         FSPACE   R,LV=(0),A=(1)                                        00738000
         SLR   @15,@15                                          01S0245 00739000
         L     @14,12(,@13)                                     01S0245 00740000
         LM    @00,@12,20(@13)                                  01S0245 00741000
         BR    @14                                              01S0245 00742000
*/********************************************************************/ 00743000
*/*                                                                  */ 00744000
*/* SEGMENT NAME - BLNKSCAN                                          */ 00745000
*                                      /*                    @ZA02706*/ 00746000
*/*                                                                  */ 00747000
*/* A 002843,004973-005013                                   @ZA02706*/ 00748000
*/* C 011923                                                 @ZA02706*/ 00749000
*/* DESCRIPTIVE NAME - BLANK SCAN ROUTINE                            */ 00750000
*/*                                                                  */ 00751000
*/* FUNCTION - THIS ROUTINE IS INVOKED WHEN IT IS NECESSARY TO RETURN*/ 00752000
*/*            THE DDNAME, DSNAME OR MEMBERNAME AND ITS LENGTH.      */ 00753000
*/*                                                                  */ 00754000
*/* OPERATION - TO DETERMINE THE LENGTH OF A NAME, THE FIELD IS      */ 00755000
*/*             SEARCHED FOR A BLANK, COUNTING THE NON-BLANK         */ 00756000
*/*             CHARACTERS UNTIL A BLANK IS FOUND OR THE MAXIMUM     */ 00757000
*/*             LENGTH OF THE FIELD HAS BEEN SCANNED. THE NAME AND   */ 00758000
*/*             LENGTH ARE STORED IN THE APPROPRIATE TEXT UNIT.      */ 00759000
*/*                                                                  */ 00760000
*/* ENTRY - BLNKSCAN (INTERNAL PROCEDURE)                            */ 00761000
*/*                                                                  */ 00762000
*/* PURPOSE - SEE FUNCTION                                           */ 00763000
*/*                                                                  */ 00764000
*/* INPUT DATA - LIMIT - THE MAXIMUM SIZE OF FIELD TO BE SCANNED     */ 00765000
*/*              CHARPTR - POINTER TO FIELD TO BE SCANNED            */ 00766000
*/*              TEXTPTR - POINTER TO TEXT UNIT TO STORE INTO        */ 00767000
*/*                                                                  */ 00768000
*/* EXITS - ALL ARE TO NEXT SEQUENTIAL INSTRUCTION                   */ 00769000
*/*                                                                  */ 00770000
*/*  NORMAL - RETURN VIA REG 14                                      */ 00771000
*/*                                                                  */ 00772000
*/*  ERROR - NONE                                                    */ 00773000
*/*                                                                  */ 00774000
*/* OUTPUT DATA - NAME AND LENGTH STORED INTO TEXT UNIT              */ 00775000
*/*                                                                  */ 00776000
*/********************************************************************/ 00777000
*BLNKSCAN: PROC;                                                02S0246 00778000
BLNKSCAN STM   @14,@12,12(@13)                                  02S0246 00779000
*CHARCNT = ZERO;                       /* INIT CHAR COUNT TO 0       */ 00780000
         SLR   CHARCNT,CHARCNT                                  02S0247 00781000
*DO WHILE (CHARCNT < LIMIT & DATA ¬= ' '); /* SCAN FIELD FOR A BLANK */ 00782000
         B     @DE00248                                         02S0248 00783000
@DL00248 DS    0H                                               02S0249 00784000
*  CHARCNT = CHARCNT + 1;              /* INCREMENT CHARACTER COUNT  */ 00785000
         LA    @10,1                                            02S0249 00786000
         ALR   CHARCNT,@10                                      02S0249 00787000
*  CHARPTR = CHARPTR + 1;              /* INCREMENT PTR TO NEXT CHAR */ 00788000
         ALR   CHARPTR,@10                                      02S0250 00789000
*END;                                  /* END CHARACTER SCAN         */ 00790000
@DE00248 CR    CHARCNT,LIMIT                                    02S0251 00791000
         BNL   @DC00248                                         02S0251 00792000
         CLI   DATA(CHARPTR),C' '                               02S0251 00793000
         BNE   @DL00248                                         02S0251 00794000
@DC00248 DS    0H                                               02S0252 00795000
*IF CHARCNT > 0 THEN                   /* WAS NON-BLANK FOUND        */ 00796000
         LTR   CHARCNT,CHARCNT                                  02S0252 00797000
         BNP   @RF00252                                         02S0252 00798000
*  TEXTUPAR(1:CHARCNT) = DATFIELD(1:CHARCNT);/*MOVE DATA TO TEXT UNIT*/ 00799000
         LR    @10,CHARCNT                                      02S0253 00800000
         BCTR  @10,0                                            02S0253 00801000
         LR    @05,CHARPTR                                      02S0253 00802000
         SLR   @05,CHARCNT                                      02S0253 00803000
         EX    @10,@SM01727                                     02S0253 00804000
*ELSE;                                 /* NOTHING TO MOVE            */ 00805000
@RF00252 DS    0H                                               02S0255 00806000
*TEXTULNG = CHARCNT;                   /* STORE LENGTH EVEN IF ZERO  */ 00807000
         STCM  CHARCNT,3,TEXTULNG(TEXTPTR)                      02S0255 00808000
*END BLNKSCAN;                                                  02S0256 00809000
@EL00002 DS    0H                                               02S0256 00810000
@EF00002 DS    0H                                               02S0256 00811000
@ER00002 LM    @14,@12,12(@13)                                  02S0256 00812000
         BR    @14                                              02S0256 00813000
*END IEFDB470                                                   01S0257 00814000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00815000
*/*%INCLUDE SYSLIB  (DINRTVSP)                                        * 00816000
*/*%INCLUDE SYSLIB  (DINRTVDT)                                        * 00817000
*/*%INCLUDE SYSLIB  (IEFASCTB)                                        * 00818000
*/*%INCLUDE SYSLIB  (IEFASIOT)                                        * 00819000
*/*%INCLUDE SYSLIB  (IEFJFCBN)                                        * 00820000
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                        * 00821000
*/*%INCLUDE SYSLIB  (IEFZB4D0)                                        * 00822000
*/*%INCLUDE SYSLIB  (IEFZB4D1)                                        * 00823000
*/*%INCLUDE SYSLIB  (IEFZB4D2)                                        * 00824000
*/*%INCLUDE SYSLIB  (IEFZB4D5)                                        * 00825000
*/*%INCLUDE SYSLIB  (IEFZB4D7)                                        * 00826000
*/*%INCLUDE SYSLIB  (IEFZB4D9)                                        * 00827000
*/*%INCLUDE SYSLIB  (IEFZB4DA)                                        * 00828000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                        * 00829000
*/*%INCLUDE SYSLIB  (IHADSAB )                                        * 00830000
*/*%INCLUDE SYSLIB  (IHAQDB  )                                        * 00831000
*/*%INCLUDE SYSLIB  (DINSYNCK)                                        * 00832000
*/*%INCLUDE SYSLIB  (DINSYNSP)                                        * 00833000
*/*%INCLUDE SYSLIB  (DINRTSRC)                                        * 00834000
*/*%INCLUDE SYSLIB  (DINRTSSP)                                        * 00835000
*/*%INCLUDE SYSLIB  (RETRIEVE)                                        * 00836000
*/*%INCLUDE SYSLIB  (RETRVESP)                                        * 00837000
*/*%INCLUDE SYSLIB  (BLNKSCAN)                                        * 00838000
*/*%INCLUDE SYSLIB  (SCANSPEC)                                        * 00839000
*;                                                              01S0257 00840000
@DATA    DS    0H                                                       00841000
@SM01719 MVC   DDNAREA(0),TEXTUPAR(TEXTPTR)                             00842000
@SM01721 MVC   DSNAMPAR(0),S99TUPAR+1(@10)                              00843000
@SM01727 MVC   TEXTUPAR(0,TEXTPTR),DATFIELD(@05)                        00844000
@DATD    DSECT                                                          00845000
         DS    0F                                                       00846000
@SA00001 DS    18F                                                      00847000
@PC00001 DS    6F                                                       00848000
@AL00001 DS    6A                                                       00849000
@TF00001 DS    F                                                        00850000
@TF00002 DS    F                                                        00851000
@TF00003 DS    F                                                        00852000
@TF00004 DS    F                                                        00853000
IEFDB470 CSECT                                                          00854000
         DS    0F                                                       00855000
@CF00084 DC    F'1'                                                     00856000
@CF01726 DC    XL4'0000FFFF'                                            00857000
@DATD    DSECT                                                          00858000
         DS    0D                                                       00859000
DDNAMEP  DS    A                                                        00860000
DSABPTR  DS    A                                                        00861000
DSNPTR   DS    A                                                        00862000
RTNADDR  DS    A                                                        00863000
SCTPTR   DS    A                                                        00864000
SIOTPTR  DS    A                                                        00865000
JFCBPTR  DS    A                                                        00866000
TIOTPTR  DS    A                                                        00867000
S99RBPTR DS    AL4                                                      00868000
         ORG   S99RBPTR                                                 00869000
S99RBPND DS    BL1                                                      00870000
         ORG   S99RBPTR+4                                               00871000
S99TUFP  DS    A                                                        00872000
TXTUFLDP DS    A                                                        00873000
TCBJSCB  DS    A                                                        00874000
QDBPTR   DS    A                                                        00875000
SVABSCT  DS    A                                                        00876000
SMFPARMS DS    CL8                                                      00877000
         ORG   SMFPARMS                                                 00878000
SMFBUF1P DS    AL4                                                      00879000
SMFUBFLP DS    AL4                                                      00880000
         ORG   SMFPARMS+8                                               00881000
MASKS    DS    CL4                                                      00882000
         ORG   MASKS                                                    00883000
DUPEMASK DS    BL2                                                      00884000
MUTEMASK DS    BL2                                                      00885000
         ORG   MASKS+4                                                  00886000
DDNAREA  DS    CL8                                                      00887000
SWITCHES DS    BL1                                                      00888000
         ORG   SWITCHES                                                 00889000
CONTINUE DS    BL1                                                      00890000
ERRORSW  EQU   SWITCHES+0                                               00891000
@NM00001 EQU   SWITCHES+0                                               00892000
         ORG   SWITCHES+1                                               00893000
FUNCTION DS    CL2                                                      00894000
         ORG   FUNCTION                                                 00895000
JFCSERCH DS    BL1                                                      00896000
ALNMSRCH EQU   FUNCTION+0                                               00897000
JFCBALNM EQU   FUNCTION+0                                               00898000
@NM00002 EQU   FUNCTION+0                                               00899000
         ORG   FUNCTION+2                                               00900000
         DS    CL1                                                      00901000
DSNAMTU  DS    CL50                                                     00902000
         ORG   DSNAMTU                                                  00903000
DSNAMKEY DS    CL2                                                      00904000
DSNAMNUM DS    FL2                                                      00905000
DSNAMLEN DS    FL2                                                      00906000
DSNAMPAR DS    CL44                                                     00907000
         ORG   DSNAMTU+50                                               00908000
         DS    CL2                                                      00909000
KEYTABLE DS    CL56                                                     00910000
         ORG   KEYTABLE                                                 00911000
DDNAMTUP DS    AL4                                                      00912000
DSNAMTUP DS    AL4                                                      00913000
RELNOTUP DS    AL4                                                      00914000
RTDDNTUP DS    AL4                                                      00915000
RTDSNTUP DS    AL4                                                      00916000
RTMEMTUP DS    AL4                                                      00917000
RTSTATUP DS    AL4                                                      00918000
RTNDPTUP DS    AL4                                                      00919000
RTCDPTUP DS    AL4                                                      00920000
RTORGTUP DS    AL4                                                      00921000
RTLIMTUP DS    AL4                                                      00922000
RTATTTUP DS    AL4                                                      00923000
RTLSTTUP DS    AL4                                                      00924000
RTTYPTUP DS    AL4                                                      00925000
         ORG   KEYTABLE+56                                              00926000
S99RB    DS    CL20                                                     00927000
         ORG   S99RB                                                    00928000
S99RBLN  DS    CL1                                                      00929000
S99VERB  DS    CL1                                                      00930000
S99FLAG1 DS    CL2                                                      00931000
         ORG   S99FLAG1                                                 00932000
S99FLG11 DS    CL1                                                      00933000
         ORG   S99FLG11                                                 00934000
S99ONCNV DS    BL1                                                      00935000
S99NOCNV EQU   S99FLG11+0                                               00936000
S99NOMNT EQU   S99FLG11+0                                               00937000
S99JBSYS EQU   S99FLG11+0                                               00938000
         ORG   S99FLAG1+1                                               00939000
S99FLG12 DS    CL1                                                      00940000
         ORG   S99RB+4                                                  00941000
S99RSC   DS    CL4                                                      00942000
         ORG   S99RSC                                                   00943000
S99ERROR DS    CL2                                                      00944000
S99INFO  DS    CL2                                                      00945000
         ORG   S99RB+8                                                  00946000
S99TXTPP DS    AL4                                                      00947000
S99RSV01 DS    FL4                                                      00948000
S99FLAG2 DS    CL4                                                      00949000
         ORG   S99FLAG2                                                 00950000
S99FLG21 DS    CL1                                                      00951000
         ORG   S99FLG21                                                 00952000
S99WTVOL DS    BL1                                                      00953000
S99WTDSN EQU   S99FLG21+0                                               00954000
S99NORES EQU   S99FLG21+0                                               00955000
S99WTUNT EQU   S99FLG21+0                                               00956000
S99OFFLN EQU   S99FLG21+0                                               00957000
S99TIONQ EQU   S99FLG21+0                                               00958000
S99CATLG EQU   S99FLG21+0                                               00959000
S99MOUNT EQU   S99FLG21+0                                               00960000
         ORG   S99FLAG2+1                                               00961000
S99FLG22 DS    CL1                                                      00962000
         ORG   S99FLG22                                                 00963000
S99UDEVT DS    BL1                                                      00964000
S99PCINT EQU   S99FLG22+0                                               00965000
         ORG   S99FLAG2+2                                               00966000
S99FLG23 DS    CL1                                                      00967000
S99FLG24 DS    CL1                                                      00968000
         ORG   S99RB+20                                                 00969000
IEFDB470 CSECT                                                          00970000
         DS    0F                                                       00971000
@SIZDATD DC    AL1(230)                                                 00972000
         DC    AL3(@ENDDATD-@DATD)                                      00973000
@CV00123 DC    V(IEFDB4FA)                                              00974000
@CV00124 DC    V(IEFDB4FC)                                              00975000
@CV00125 DC    V(IEFDB4FE)                                              00976000
@CV00126 DC    V(IEFDB4FF)                                              00977000
         DS    0D                                                       00978000
@CC01704 DC    C'&&&&'                                                  00979000
@CB01331 DC    X'0388'                                                  00980000
@CB01355 DC    X'0438'                                                  00981000
@CB01359 DC    X'0440'                                                  00982000
@CB01361 DC    X'0444'                                                  00983000
KEYDICT  DS    CL197                                                    00984000
         ORG   KEYDICT                                                  00985000
KYDDNAME DS    CL17                                                     00986000
         ORG   KYDDNAME                                                 00987000
DDNAMLEN DC    AL1(17)                                                  00988000
DDNAMHEX DC    X'0001'                                                  00989000
DDNAMMXL DC    X'0008'                                                  00990000
DDNAMMNL DC    X'0001'                                                  00991000
DDNAMMXN DC    X'0001'                                                  00992000
DDNAMMNN DC    X'0001'                                                  00993000
DDNAMKTB DC    X'0000'                                                  00994000
DDNAMMEX DS    CL4                                                      00995000
         ORG   DDNAMMEX                                                 00996000
DDNAMEX1 DC    X'0002'                                                  00997000
DDNAMEX2 DC    X'000F'                                                  00998000
         ORG   KEYDICT+17                                               00999000
KYDSNAME DS    CL17                                                     01000000
         ORG   KYDSNAME                                                 01001000
DSNKYLEN DC    AL1(17)                                                  01002000
DSNAMHEX DC    X'0002'                                                  01003000
DSNAMMXL DC    X'002C'                                                  01004000
DSNAMMNL DC    X'0001'                                                  01005000
DSNAMMXN DC    X'0001'                                                  01006000
DSNAMMNN DC    X'0001'                                                  01007000
DSNAMKTB DC    X'0004'                                                  01008000
DSNAMMEX DS    CL4                                                      01009000
         ORG   DSNAMMEX                                                 01010000
DSNAMEX1 DC    X'0001'                                                  01011000
DSNAMEX2 DC    X'000F'                                                  01012000
         ORG   KEYDICT+34                                               01013000
KYRELNO  DS    CL17                                                     01014000
         ORG   KYRELNO                                                  01015000
RELNOLEN DC    AL1(17)                                                  01016000
RELNOHEX DC    X'000F'                                                  01017000
RELNOMXL DC    X'0002'                                                  01018000
RELNOMNL DC    X'0002'                                                  01019000
RELNOMXN DC    X'0001'                                                  01020000
RELNOMNN DC    X'0001'                                                  01021000
RELNOKTB DC    X'0008'                                                  01022000
RELNOMEX DS    CL4                                                      01023000
         ORG   RELNOMEX                                                 01024000
RELNOMX1 DC    X'0001'                                                  01025000
RELNOMX2 DC    X'0002'                                                  01026000
         ORG   KEYDICT+51                                               01027000
KYRTDDN  DS    CL13                                                     01028000
         ORG   KYRTDDN                                                  01029000
RTDDNLEN DC    AL1(13)                                                  01030000
RTDDNHEX DC    X'0004'                                                  01031000
RTDDNMXL DC    X'0008'                                                  01032000
RTDDNMNL DC    X'0008'                                                  01033000
RTDDNMXN DC    X'0001'                                                  01034000
RTDDNMNN DC    X'0001'                                                  01035000
RTDDNKTB DC    X'000C'                                                  01036000
         ORG   KEYDICT+64                                               01037000
KYRTDSN  DS    CL13                                                     01038000
         ORG   KYRTDSN                                                  01039000
RTDSNLEN DC    AL1(13)                                                  01040000
RTDSNHEX DC    X'0005'                                                  01041000
RTDSNMXL DC    X'002C'                                                  01042000
RTDSNMNL DC    X'002C'                                                  01043000
RTDSNMXN DC    X'0001'                                                  01044000
RTDSNMNN DC    X'0001'                                                  01045000
RTDSNKTB DC    X'0010'                                                  01046000
         ORG   KEYDICT+77                                               01047000
KYRTMEM  DS    CL13                                                     01048000
         ORG   KYRTMEM                                                  01049000
RTMEMLEN DC    AL1(13)                                                  01050000
RTMEMHEX DC    X'0006'                                                  01051000
RTMEMMXL DC    X'0008'                                                  01052000
RTMEMMNL DC    X'0008'                                                  01053000
RTMEMMXN DC    X'0001'                                                  01054000
RTMEMMNN DC    X'0001'                                                  01055000
RTMEMKTB DC    X'0014'                                                  01056000
         ORG   KEYDICT+90                                               01057000
KYRTSTA  DS    CL13                                                     01058000
         ORG   KYRTSTA                                                  01059000
RTSTALEN DC    AL1(13)                                                  01060000
RTSTAHEX DC    X'0007'                                                  01061000
RTSTAMXL DC    X'0001'                                                  01062000
RTSTAMNL DC    X'0001'                                                  01063000
RTSTAMXN DC    X'0001'                                                  01064000
RTSTAMNN DC    X'0001'                                                  01065000
RTSTAKTB DC    X'0018'                                                  01066000
         ORG   KEYDICT+103                                              01067000
KYRTNDP  DS    CL13                                                     01068000
         ORG   KYRTNDP                                                  01069000
RTNDPLEN DC    AL1(13)                                                  01070000
RTNDPHEX DC    X'0008'                                                  01071000
RTNDPMXL DC    X'0001'                                                  01072000
RTNDPMNL DC    X'0001'                                                  01073000
RTNDPMXN DC    X'0001'                                                  01074000
RTNDPMNN DC    X'0001'                                                  01075000
RTNDPKTB DC    X'001C'                                                  01076000
         ORG   KEYDICT+116                                              01077000
KYRTCDP  DS    CL13                                                     01078000
         ORG   KYRTCDP                                                  01079000
RTCDPLEN DC    AL1(13)                                                  01080000
RTCDPHEX DC    X'0009'                                                  01081000
RTCDPMXL DC    X'0001'                                                  01082000
RTCDPMNL DC    X'0001'                                                  01083000
RTCDPMXN DC    X'0001'                                                  01084000
RTCDPMNN DC    X'0001'                                                  01085000
RTCDPKTB DC    X'0020'                                                  01086000
         ORG   KEYDICT+129                                              01087000
KYRTORG  DS    CL13                                                     01088000
         ORG   KYRTORG                                                  01089000
RTORGLEN DC    AL1(13)                                                  01090000
RTORGHEX DC    X'000A'                                                  01091000
RTORGMXL DC    X'0002'                                                  01092000
RTORGMNL DC    X'0002'                                                  01093000
RTORGMXN DC    X'0001'                                                  01094000
RTORGMNN DC    X'0001'                                                  01095000
RTORGKTB DC    X'0024'                                                  01096000
         ORG   KEYDICT+142                                              01097000
KYRTLIM  DS    CL13                                                     01098000
         ORG   KYRTLIM                                                  01099000
RTLIMLEN DC    AL1(13)                                                  01100000
RTLIMHEX DC    X'000B'                                                  01101000
RTLIMMXL DC    X'0002'                                                  01102000
RTLIMMNL DC    X'0002'                                                  01103000
RTLIMMXN DC    X'0001'                                                  01104000
RTLIMMNN DC    X'0001'                                                  01105000
RTLIMKTB DC    X'0028'                                                  01106000
         ORG   KEYDICT+155                                              01107000
KYRTATT  DS    CL13                                                     01108000
         ORG   KYRTATT                                                  01109000
RTATTLEN DC    AL1(13)                                                  01110000
RTATTHEX DC    X'000C'                                                  01111000
RTATTMXL DC    X'0001'                                                  01112000
RTATTMNL DC    X'0001'                                                  01113000
RTATTMXN DC    X'0001'                                                  01114000
RTATTMNN DC    X'0001'                                                  01115000
RTATTKTB DC    X'002C'                                                  01116000
         ORG   KEYDICT+168                                              01117000
KYRTLST  DS    CL13                                                     01118000
         ORG   KYRTLST                                                  01119000
RTLSTLEN DC    AL1(13)                                                  01120000
RTLSTHEX DC    X'000D'                                                  01121000
RTLSTMXL DC    X'0001'                                                  01122000
RTLSTMNL DC    X'0001'                                                  01123000
RTLSTMXN DC    X'0001'                                                  01124000
RTLSTMNN DC    X'0001'                                                  01125000
RTLSTKTB DC    X'0030'                                                  01126000
         ORG   KEYDICT+181                                              01127000
KYRTTYP  DS    CL13                                                     01128000
         ORG   KYRTTYP                                                  01129000
RTTYPLEN DC    AL1(13)                                                  01130000
RTTYPHEX DC    X'000E'                                                  01131000
RTTYPMXL DC    X'0001'                                                  01132000
RTTYPMNL DC    X'0001'                                                  01133000
RTTYPMXN DC    X'0001'                                                  01134000
RTTYPMNN DC    X'0001'                                                  01135000
RTTYPKTB DC    X'0034'                                                  01136000
         ORG   KEYDICT+194                                              01137000
KYENDDCT DS    CL3                                                      01138000
         ORG   KYENDDCT                                                 01139000
ENDDCLEN DC    AL1(3)                                                   01140000
ENDDCHEX DC    X'FFFF'                                                  01141000
         ORG   KEYDICT+197                                              01142000
IEFDB470 CSECT                                                          01143000
         DS   0H                                                        01144000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   01145000
@DATD    DSECT                                                          01146000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01147000
@ENDDATD EQU   *                                                        01148000
IEFDB470 CSECT                                                          01149000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01150000
@01      EQU   01                                                       01151000
@02      EQU   02                                                       01152000
@03      EQU   03                                                       01153000
@04      EQU   04                                                       01154000
@05      EQU   05                                                       01155000
@06      EQU   06                                                       01156000
@07      EQU   07                                                       01157000
@08      EQU   08                                                       01158000
@09      EQU   09                                                       01159000
@10      EQU   10                                                       01160000
@11      EQU   11                                                       01161000
@12      EQU   12                                                       01162000
@13      EQU   13                                                       01163000
@14      EQU   14                                                       01164000
@15      EQU   15                                                       01165000
NUSECNT  EQU   @04                                                      01166000
LIMIT    EQU   @05                                                      01167000
DSABNBR  EQU   @03                                                      01168000
CHARCNT  EQU   @03                                                      01169000
TEXTPTR  EQU   @02                                                      01170000
LOOPPTR  EQU   @03                                                      01171000
CHARPTR  EQU   @04                                                      01172000
R0       EQU   @00                                                      01173000
R1       EQU   @01                                                      01174000
R15      EQU   @15                                                      01175000
DATA     EQU   0                                                        01176000
DATFIELD EQU   0                                                        01177000
INSMSCT  EQU   0                                                        01178000
SCTSSTAT EQU   INSMSCT+4                                                01179000
SCTSTYPE EQU   INSMSCT+67                                               01180000
SCTNIUSL EQU   INSMSCT+92                                               01181000
SCTSDPTY EQU   INSMSCT+94                                               01182000
SCTSTAT2 EQU   INSMSCT+104                                              01183000
SCTBCT   EQU   SCTSTAT2                                                 01184000
SCTCDENT EQU   INSMSCT+118                                              01185000
SCTSTEND EQU   INSMSCT+172                                              01186000
@NM00024 EQU   0                                                        01187000
SCTABCND EQU   @NM00024                                                 01188000
INDMSIOT EQU   0                                                        01189000
SCTUSADD EQU   INDMSIOT+20                                              01190000
SIOTBYT1 EQU   INDMSIOT+43                                              01191000
SIOTBYT3 EQU   INDMSIOT+46                                              01192000
SIOTTSTC EQU   INDMSIOT+47                                              01193000
SIOTBYT0 EQU   INDMSIOT+52                                              01194000
SCTSDISP EQU   INDMSIOT+55                                              01195000
SCTSBYT1 EQU   INDMSIOT+56                                              01196000
SCTDUMMY EQU   SCTSBYT1                                                 01197000
SCTSBYT2 EQU   INDMSIOT+57                                              01198000
SCTSBYT3 EQU   INDMSIOT+58                                              01199000
SCTSOLD  EQU   SCTSBYT3                                                 01200000
SCTSBYT4 EQU   INDMSIOT+59                                              01201000
SIOTGDGA EQU   SCTSBYT4                                                 01202000
SCTUTYPE EQU   INDMSIOT+60                                              01203000
SIOTDEVT EQU   SCTUTYPE                                                 01204000
SIOUBYT3 EQU   SIOTDEVT+2                                               01205000
SIOTBYT4 EQU   INDMSIOT+81                                              01206000
SIOTALTD EQU   INDMSIOT+92                                              01207000
SIOTBYT2 EQU   INDMSIOT+103                                             01208000
SJFCBPTR EQU   INDMSIOT+156                                             01209000
INFMJFCB EQU   0                                                        01210000
JFCBDSNM EQU   INFMJFCB                                                 01211000
JFCBELNM EQU   INFMJFCB+44                                              01212000
JFCBTSDM EQU   INFMJFCB+52                                              01213000
JFCFCBID EQU   INFMJFCB+56                                              01214000
JFCBFRID EQU   JFCFCBID                                                 01215000
JFCBLTYP EQU   INFMJFCB+66                                              01216000
JFCBOTTR EQU   INFMJFCB+67                                              01217000
JFCBUFOF EQU   JFCBOTTR                                                 01218000
JFCBFLSQ EQU   JFCBOTTR+1                                               01219000
JFCFUNC  EQU   JFCBFLSQ                                                 01220000
JFCBMASK EQU   INFMJFCB+72                                              01221000
JFCBFLG1 EQU   JFCBMASK+5                                               01222000
JFCOPEN  EQU   JFCBFLG1                                                 01223000
JFCBFLG2 EQU   JFCBMASK+6                                               01224000
JFCDEFER EQU   JFCBFLG2                                                 01225000
JFCMODNW EQU   JFCBFLG2                                                 01226000
JFCBIND1 EQU   INFMJFCB+86                                              01227000
JFCBIND2 EQU   INFMJFCB+87                                              01228000
JFCDISP  EQU   JFCBIND2                                                 01229000
JFCSHARE EQU   JFCBIND2                                                 01230000
JFCAMPTR EQU   INFMJFCB+88                                              01231000
JFCBUFRQ EQU   JFCAMPTR                                                 01232000
JFCBUFNO EQU   JFCBUFRQ                                                 01233000
JFCBGNCP EQU   JFCAMPTR+1                                               01234000
JFCBHIAR EQU   JFCBGNCP                                                 01235000
JFCBFALN EQU   JFCBHIAR                                                 01236000
JFCBFTEK EQU   JFCBFALN                                                 01237000
JFCBBFTA EQU   JFCBFTEK                                                 01238000
JFCEROPT EQU   INFMJFCB+92                                              01239000
JFCTRTCH EQU   INFMJFCB+93                                              01240000
TIOT1    EQU   0                                                        01241000
TIOENTRY EQU   0                                                        01242000
TIOESTTA EQU   TIOENTRY+1                                               01243000
TIOERLOC EQU   TIOENTRY+2                                               01244000
TIOELINK EQU   TIOERLOC+1                                               01245000
TIOTTERM EQU   TIOELINK                                                 01246000
TIOEQNAM EQU   TIOELINK                                                 01247000
TIOESYOT EQU   TIOELINK                                                 01248000
TIOEDDNM EQU   TIOENTRY+4                                               01249000
TIOESTTC EQU   TIOENTRY+15                                              01250000
TIOESTTB EQU   TIOENTRY+16                                              01251000
POOLSTAR EQU   TIOENTRY+20                                              01252000
S99TUPL  EQU   0                                                        01253000
S99TUPTR EQU   S99TUPL                                                  01254000
S99TUP   EQU   0                                                        01255000
S99TUNIT EQU   0                                                        01256000
S99TUKEY EQU   S99TUNIT                                                 01257000
S99TUNUM EQU   S99TUNIT+2                                               01258000
S99TUENT EQU   S99TUNIT+4                                               01259000
S99TULNG EQU   S99TUENT                                                 01260000
S99TUPAR EQU   S99TUENT+2                                               01261000
S99TUFLD EQU   0                                                        01262000
TEXTUNIT EQU   0                                                        01263000
TEXTUENT EQU   TEXTUNIT+4                                               01264000
TEXTULNG EQU   TEXTUENT                                                 01265000
TEXTUPAR EQU   TEXTUENT+2                                               01266000
TXTUPLST EQU   0                                                        01267000
TXTUNITP EQU   TXTUPLST                                                 01268000
TXTUPELM EQU   0                                                        01269000
TXTPLENT EQU   TXTUPELM                                                 01270000
TEXTUFLD EQU   0                                                        01271000
QDB      EQU   0                                                        01272000
IEZJSCB  EQU   0                                                        01273000
JSCBSEC1 EQU   IEZJSCB+188                                              01274000
JSCHPCE  EQU   JSCBSEC1+4                                               01275000
JSCBDCB  EQU   JSCBSEC1+36                                              01276000
JSCBOPTS EQU   JSCBSEC1+48                                              01277000
JSCBSWT1 EQU   JSCBSEC1+55                                              01278000
JSCBWTP  EQU   JSCBSEC1+64                                              01279000
JSCBWTFG EQU   JSCBWTP                                                  01280000
JSCBEND1 EQU   IEZJSCB+260                                              01281000
DSAB     EQU   0                                                        01282000
DSABFCHN EQU   DSAB+4                                                   01283000
DSABOPCT EQU   DSAB+14                                                  01284000
DSABTIOT EQU   DSAB+16                                                  01285000
DSABGIDP EQU   DSAB+24                                                  01286000
DSABANMP EQU   DSAB+28                                                  01287000
DSABORG  EQU   DSAB+32                                                  01288000
DSABORG1 EQU   DSABORG                                                  01289000
DSABORG2 EQU   DSABORG+1                                                01290000
DSABFLG1 EQU   DSAB+34                                                  01291000
DSABDALC EQU   DSABFLG1                                                 01292000
DSABPALC EQU   DSABFLG1                                                 01293000
DSABCONV EQU   DSABFLG1                                                 01294000
DSABPCAT EQU   DSABFLG1                                                 01295000
DSABNUSE EQU   DSABFLG1                                                 01296000
DSABFLG2 EQU   DSAB+35                                                  01297000
DSABFLG3 EQU   DSAB+36                                                  01298000
DSABFLG4 EQU   DSAB+37                                                  01299000
DSABSIOT EQU   DSAB+64                                                  01300000
DSABANMI EQU   0                                                        01301000
DSABGIDL EQU   0                                                        01302000
INDMDSNT EQU   0                                                        01303000
DINRTVTP EQU   0                                                        01304000
DINRTRN  EQU   0                                                        01305000
ERRCODE  EQU   DINRTRN                                                  01306000
DINCTRLP EQU   0                                                        01307000
DINJSCBP EQU   DINCTRLP                                                 01308000
DINSCTP  EQU   DINCTRLP+16                                              01309000
ALFNCMAP EQU   0                                                        01310000
INPUTSW  EQU   ALFNCMAP                                                 01311000
PROCESSW EQU   ALFNCMAP+6                                               01312000
ERRPROSW EQU   PROCESSW                                                 01313000
DEPARMS  EQU   0                                                        01314000
DENQRETN EQU   DEPARMS+232                                              01315000
DEDMYEPA EQU   DEPARMS+240                                              01316000
DEDMYAS  EQU   DEPARMS+260                                              01317000
LASTEPAP EQU   0                                                        01318000
JFCKEYLE EQU   JFCTRTCH                                                 01319000
JFCCODE  EQU   JFCKEYLE                                                 01320000
JFCSTACK EQU   JFCTRTCH                                                 01321000
JFCMODE  EQU   JFCSTACK                                                 01322000
JFCSPPRT EQU   JFCTRTCH                                                 01323000
JFCBABFS EQU   JFCSPPRT+2                                               01324000
JFCLIMCT EQU   JFCBABFS                                                 01325000
JFCDSORG EQU   JFCSPPRT+5                                               01326000
JFCDSRG1 EQU   JFCDSORG                                                 01327000
JFCDSRG2 EQU   JFCDSORG+1                                               01328000
JFCRECFM EQU   JFCSPPRT+7                                               01329000
JFCRCFM  EQU   JFCRECFM                                                 01330000
JFCOPTCD EQU   JFCSPPRT+8                                               01331000
JFCWVCSP EQU   JFCOPTCD                                                 01332000
JFCWVCIS EQU   JFCWVCSP                                                 01333000
JFCWVCBD EQU   JFCWVCIS                                                 01334000
JFCALLOW EQU   JFCOPTCD                                                 01335000
JFCRSV17 EQU   JFCALLOW                                                 01336000
JFCOVER  EQU   JFCRSV17                                                 01337000
JFCPCIBT EQU   JFCOPTCD                                                 01338000
JFCMAST  EQU   JFCPCIBT                                                 01339000
JFCEXT   EQU   JFCMAST                                                  01340000
JFCBCKPT EQU   JFCOPTCD                                                 01341000
JFCIND   EQU   JFCBCKPT                                                 01342000
JFCRSV18 EQU   JFCOPTCD                                                 01343000
JFCCYL   EQU   JFCRSV18                                                 01344000
JFCACT   EQU   JFCCYL                                                   01345000
JFCREDUC EQU   JFCOPTCD                                                 01346000
JFCRSV19 EQU   JFCREDUC                                                 01347000
JFCRSV20 EQU   JFCRSV19                                                 01348000
JFCRSV21 EQU   JFCOPTCD                                                 01349000
JFCDEL   EQU   JFCRSV21                                                 01350000
JFCOPTJ  EQU   JFCOPTCD                                                 01351000
JFCREORG EQU   JFCOPTJ                                                  01352000
JFCBLKSI EQU   JFCSPPRT+9                                               01353000
JFCBUFSI EQU   JFCBLKSI                                                 01354000
JFCAMSYN EQU   JFCSPPRT+11                                              01355000
JFCNCP   EQU   JFCAMSYN+2                                               01356000
JFCNTM   EQU   JFCAMSYN+3                                               01357000
JFCBFSEQ EQU   JFCNTM                                                   01358000
JFCPCI   EQU   JFCBFSEQ                                                 01359000
JFCRESRV EQU   JFCAMSYN+4                                               01360000
JFCUCSEG EQU   JFCRESRV                                                 01361000
JFCUCSOP EQU   JFCUCSEG+4                                               01362000
JFCOUTLI EQU   JFCUCSEG+5                                               01363000
JFCTHRSH EQU   JFCOUTLI                                                 01364000
JFCCPRI  EQU   JFCTHRSH                                                 01365000
JFCBVOLS EQU   JFCUCSEG+10                                              01366000
JFCBS001 EQU   JFCBVOLS                                                 01367000
JFCBPQTY EQU   JFCBS001+34                                              01368000
JFCBCTRI EQU   JFCBS001+37                                              01369000
JFCBSQTY EQU   JFCBS001+38                                              01370000
JFCFLGS1 EQU   JFCBS001+41                                              01371000
JFCBSPNM EQU   JFCBS001+45                                              01372000
JFCBFLG3 EQU   JFCBSPNM                                                 01373000
TIOEDEVE EQU   TIOESTTB                                                 01374000
TIOSTTB  EQU   TIOEDEVE                                                 01375000
DSABQDB  EQU   QDB                                                      01376000
DSQFRSTP EQU   DSABQDB+12                                               01377000
DSQLASTP EQU   DSABQDB+16                                               01378000
JSCBSEC2 EQU   JSCBEND1                                                 01379000
JSCBSEC3 EQU   JSCBEND1                                                 01380000
JSCBJCT  EQU   JSCBSEC3                                                 01381000
JSCBJCTA EQU   JSCBJCT+1                                                01382000
JSCBASID EQU   JSCBSEC3+8                                               01383000
JSCBFBYT EQU   JSCBSEC3+10                                              01384000
JSCBJNL  EQU   JSCBSEC3+28                                              01385000
JSCBJJSB EQU   JSCBJNL                                                  01386000
JSCBSUB  EQU   JSCBSEC3+40                                              01387000
JSCDSABQ EQU   JSCBSEC3+60                                              01388000
JSCSCT   EQU   JSCBSEC3+68                                              01389000
JSCRSV45 EQU   JSCBSEC3+112                                             01390000
JSCRSV46 EQU   JSCRSV45                                                 01391000
JSCRSV47 EQU   JSCRSV45+2                                               01392000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01393000
JSCBEND3 EQU   JSCBSEC3+120                                             01394000
JSCRSV52 EQU   JSCBSEC3+116                                             01395000
JSCRSV51 EQU   JSCRSV47+1                                               01396000
JSCRSV50 EQU   JSCRSV47                                                 01397000
JSCRSV49 EQU   JSCRSV46+1                                               01398000
JSCRSV48 EQU   JSCRSV46                                                 01399000
JSCRSV44 EQU   JSCBSEC3+108                                             01400000
JSCRSV43 EQU   JSCBSEC3+104                                             01401000
JSCRSV42 EQU   JSCBSEC3+100                                             01402000
JSCBASWA EQU   JSCBSEC3+96                                              01403000
JSCBUFPT EQU   JSCBSEC3+92                                              01404000
JSCBACT  EQU   JSCBSEC3+88                                              01405000
JSCBSWSP EQU   JSCBSEC3+87                                              01406000
JSCRSV33 EQU   JSCBSEC3+86                                              01407000
JSCDDNUM EQU   JSCBSEC3+84                                              01408000
JSCRSV53 EQU   JSCBSEC3+82                                              01409000
JSCDDNNO EQU   JSCBSEC3+80                                              01410000
JSCBVATA EQU   JSCBSEC3+76                                              01411000
JSCTMCOR EQU   JSCBSEC3+72                                              01412000
JSCSCTP  EQU   JSCSCT+1                                                 01413000
JSCRSV55 EQU   JSCSCT                                                   01414000
JSCRSV54 EQU   JSCBSEC3+64                                              01415000
JSCBSSIB EQU   JSCBSEC3+56                                              01416000
JSCBFRBA EQU   JSCBSEC3+48                                              01417000
JSCRSV28 EQU   JSCBSEC3+46                                              01418000
JSCBSONO EQU   JSCBSEC3+44                                              01419000
JSCBSUBA EQU   JSCBSUB+1                                                01420000
JSCRSV31 EQU   JSCBSUB                                                  01421000
JSCBSMLR EQU   JSCBSEC3+36                                              01422000
JSCBJNLR EQU   JSCBSEC3+32                                              01423000
JSCBJNLA EQU   JSCBJNL+1                                                01424000
JSCBJSBT EQU   JSCBJJSB                                                 01425000
JSCBJSBX EQU   JSCBJJSB                                                 01426000
JSCBJSBA EQU   JSCBJJSB                                                 01427000
JSCBJSBI EQU   JSCBJJSB                                                 01428000
@NM00056 EQU   JSCBJJSB                                                 01429000
JSCBJNLE EQU   JSCBJJSB                                                 01430000
JSCBJNLF EQU   JSCBJJSB                                                 01431000
JSCBJNLN EQU   JSCBJJSB                                                 01432000
@NM00055 EQU   JSCBSEC3+24                                              01433000
JSCBJRBA EQU   JSCBSEC3+16                                              01434000
JSCBIECB EQU   JSCBSEC3+12                                              01435000
JSCBRV08 EQU   JSCBSEC3+11                                              01436000
JSCBRV07 EQU   JSCBFBYT                                                 01437000
JSCBRV06 EQU   JSCBFBYT                                                 01438000
JSCBRV05 EQU   JSCBFBYT                                                 01439000
JSCBRV04 EQU   JSCBFBYT                                                 01440000
JSCBRV03 EQU   JSCBFBYT                                                 01441000
JSCBRV02 EQU   JSCBFBYT                                                 01442000
JSCBADSP EQU   JSCBFBYT                                                 01443000
JSCBRV01 EQU   JSCBFBYT                                                 01444000
JSCBTJID EQU   JSCBASID                                                 01445000
JSCBPSCB EQU   JSCBSEC3+4                                               01446000
JSCJCTP  EQU   JSCBJCTA                                                 01447000
JSCRSV24 EQU   JSCBJCT                                                  01448000
JSCBEND2 EQU   JSCBSEC2                                                 01449000
@NM00046 EQU   DSABQDB+24                                               01450000
DSQBDSP  EQU   DSABQDB+22                                               01451000
DSQFDSP  EQU   DSABQDB+20                                               01452000
DSQBADFC EQU   DSQLASTP                                                 01453000
DSQBADBC EQU   DSQFRSTP                                                 01454000
DSQNELMS EQU   DSABQDB+8                                                01455000
DSQDBLN  EQU   DSABQDB+6                                                01456000
DSQATTRS EQU   DSABQDB+4                                                01457000
DSQDBID  EQU   DSABQDB                                                  01458000
TIOUCBP  EQU   TIOEDEVE+1                                               01459000
TIOVERF  EQU   TIOSTTB                                                  01460000
TIOUNLD  EQU   TIOSTTB                                                  01461000
TIOMNTD  EQU   TIOSTTB                                                  01462000
TIOSETU  EQU   TIOSTTB                                                  01463000
TIOVLSR  EQU   TIOSTTB                                                  01464000
TIOPVIO  EQU   TIOSTTB                                                  01465000
TIOREQD  EQU   TIOSTTB                                                  01466000
TIOUSED  EQU   TIOSTTB                                                  01467000
JFCBEND  EQU   JFCBS001+58                                              01468000
JFCBSPTN EQU   JFCBS001+57                                              01469000
JFCBVLCT EQU   JFCBS001+56                                              01470000
JFCBDRLH EQU   JFCBS001+53                                              01471000
JFCBSBNM EQU   JFCBS001+50                                              01472000
JFCBABST EQU   JFCBS001+48                                              01473000
JFCBRV08 EQU   JFCBSPNM+1                                               01474000
JFCBRV07 EQU   JFCBFLG3                                                 01475000
JFCBRV06 EQU   JFCBFLG3                                                 01476000
JFCBRV05 EQU   JFCBFLG3                                                 01477000
JFCBRV04 EQU   JFCBFLG3                                                 01478000
JFCBRV03 EQU   JFCBFLG3                                                 01479000
JFCBRV02 EQU   JFCBFLG3                                                 01480000
JFCBEXP  EQU   JFCBFLG3                                                 01481000
JFCDQDSP EQU   JFCBFLG3                                                 01482000
JFCBDQTY EQU   JFCBS001+42                                              01483000
JFCBUAFF EQU   JFCFLGS1                                                 01484000
JFCRSV45 EQU   JFCFLGS1                                                 01485000
JFCVRDS  EQU   JFCFLGS1                                                 01486000
JFCBCEOV EQU   JFCFLGS1                                                 01487000
JFCRSV42 EQU   JFCFLGS1                                                 01488000
JFCBADSP EQU   JFCFLGS1                                                 01489000
JFCTOPEN EQU   JFCFLGS1                                                 01490000
JFCBDLET EQU   JFCFLGS1                                                 01491000
JFCRQID  EQU   JFCBSQTY                                                 01492000
JFCROUND EQU   JFCBCTRI                                                 01493000
JFCALX   EQU   JFCBCTRI                                                 01494000
JFCMIXG  EQU   JFCBCTRI                                                 01495000
JFCONTIG EQU   JFCBCTRI                                                 01496000
JFCRSV29 EQU   JFCBCTRI                                                 01497000
JFCBMSGP EQU   JFCBCTRI                                                 01498000
JFCBSPAC EQU   JFCBCTRI                                                 01499000
JFCRUNIT EQU   JFCBPQTY                                                 01500000
JFCBEXAD EQU   JFCBS001+31                                              01501000
JFCBEXTL EQU   JFCBS001+30                                              01502000
JFCMSVGP EQU   JFCBS001+22                                              01503000
@NM00043 EQU   JFCBS001                                                 01504000
JFCAVOLS EQU   JFCBVOLS                                                 01505000
JFCBNVOL EQU   JFCUCSEG+9                                               01506000
JFCBNTCS EQU   JFCUCSEG+8                                               01507000
JFCSOWA  EQU   JFCOUTLI+1                                               01508000
JFCSEND  EQU   JFCCPRI                                                  01509000
JFCEQUAL EQU   JFCCPRI                                                  01510000
JFCRECV  EQU   JFCCPRI                                                  01511000
JFCRSV34 EQU   JFCCPRI                                                  01512000
JFCRSV33 EQU   JFCCPRI                                                  01513000
JFCRSV55 EQU   JFCCPRI                                                  01514000
JFCRSV54 EQU   JFCCPRI                                                  01515000
JFCRSV53 EQU   JFCCPRI                                                  01516000
JFCRSV27 EQU   JFCUCSOP                                                 01517000
JFCRSV26 EQU   JFCUCSOP                                                 01518000
JFCFCBVR EQU   JFCUCSOP                                                 01519000
JFCFCBAL EQU   JFCUCSOP                                                 01520000
JFCVER   EQU   JFCUCSOP                                                 01521000
JFCRSV25 EQU   JFCUCSOP                                                 01522000
JFCFOLD  EQU   JFCUCSOP                                                 01523000
JFCBEXTP EQU   JFCUCSOP                                                 01524000
JFCUCSID EQU   JFCUCSEG                                                 01525000
JFCINTVL EQU   JFCSPPRT+19                                              01526000
JFCDBUFN EQU   JFCRESRV+3                                               01527000
JFCCYLOF EQU   JFCRESRV+2                                               01528000
JFCRKP   EQU   JFCRESRV                                                 01529000
JFCPCIR2 EQU   JFCPCI                                                   01530000
JFCPCIR1 EQU   JFCPCI                                                   01531000
JFCPCIN2 EQU   JFCPCI                                                   01532000
JFCPCIN1 EQU   JFCPCI                                                   01533000
JFCPCIA2 EQU   JFCPCI                                                   01534000
JFCPCIA1 EQU   JFCPCI                                                   01535000
JFCPCIX2 EQU   JFCPCI                                                   01536000
JFCPCIX1 EQU   JFCPCI                                                   01537000
JFCBUFMX EQU   JFCNCP                                                   01538000
JFCLRECL EQU   JFCAMSYN                                                 01539000
JFCBAXBF EQU   JFCBUFSI                                                 01540000
JFCREL   EQU   JFCREORG                                                 01541000
JFCRSV22 EQU   JFCDEL                                                   01542000
JFCSRCHD EQU   JFCRSV20                                                 01543000
JFCOPTQ  EQU   JFCACT                                                   01544000
JFCFEED  EQU   JFCIND                                                   01545000
JFCCBWU  EQU   JFCEXT                                                   01546000
JFCWUMSG EQU   JFCOVER                                                  01547000
JFCSDNAM EQU   JFCWVCBD                                                 01548000
@NM00042 EQU   JFCRECFM                                                 01549000
JFCCHAR  EQU   JFCRECFM                                                 01550000
JFCRFS   EQU   JFCRECFM                                                 01551000
JFCRFB   EQU   JFCRECFM                                                 01552000
JFCRFO   EQU   JFCRCFM                                                  01553000
JFCFMREC EQU   JFCRCFM                                                  01554000
JFCRSV16 EQU   JFCDSRG2                                                 01555000
JFCRSV15 EQU   JFCDSRG2                                                 01556000
JFCORGTR EQU   JFCDSRG2                                                 01557000
JFCORGAM EQU   JFCDSRG2                                                 01558000
JFCRSV13 EQU   JFCDSRG2                                                 01559000
JFCORGTQ EQU   JFCDSRG2                                                 01560000
JFCORGTX EQU   JFCDSRG2                                                 01561000
JFCORGGS EQU   JFCDSRG2                                                 01562000
JFCORGU  EQU   JFCDSRG1                                                 01563000
JFCORGPO EQU   JFCDSRG1                                                 01564000
JFCORGMQ EQU   JFCDSRG1                                                 01565000
JFCORGCQ EQU   JFCDSRG1                                                 01566000
JFCORGCX EQU   JFCDSRG1                                                 01567000
JFCORGDA EQU   JFCDSRG1                                                 01568000
JFCORGPS EQU   JFCDSRG1                                                 01569000
JFCORGIS EQU   JFCDSRG1                                                 01570000
JFCTRKBL EQU   JFCLIMCT+1                                               01571000
@NM00041 EQU   JFCLIMCT                                                 01572000
JFCDEN   EQU   JFCSPPRT+1                                               01573000
JFCPRTSP EQU   JFCSPPRT                                                 01574000
JFCONE   EQU   JFCMODE                                                  01575000
JFCTWO   EQU   JFCMODE                                                  01576000
JFCRSV07 EQU   JFCMODE                                                  01577000
JFCRSV06 EQU   JFCMODE                                                  01578000
JFCMODER EQU   JFCMODE                                                  01579000
JFCMODEO EQU   JFCMODE                                                  01580000
JFCEBCD  EQU   JFCMODE                                                  01581000
JFCBIN   EQU   JFCMODE                                                  01582000
JFCRSV32 EQU   JFCCODE                                                  01583000
JFCTTY   EQU   JFCCODE                                                  01584000
JFCASCII EQU   JFCCODE                                                  01585000
JFCNCR   EQU   JFCCODE                                                  01586000
JFCBUR   EQU   JFCCODE                                                  01587000
JFCFRI   EQU   JFCCODE                                                  01588000
JFCBCD   EQU   JFCCODE                                                  01589000
JFCNOCON EQU   JFCCODE                                                  01590000
@NM00052 EQU   DEPARMS+304                                              01591000
DETCTIOL EQU   DEPARMS+300                                              01592000
DETCTIOP EQU   DEPARMS+296                                              01593000
DETDQLST EQU   DEPARMS+280                                              01594000
DEALASTP EQU   DEPARMS+276                                              01595000
DEASGNP  EQU   DEDMYAS+12                                               01596000
@NM00051 EQU   DEDMYAS                                                  01597000
DEWLASTP EQU   DEPARMS+256                                              01598000
DEWRITP  EQU   DEDMYEPA+12                                              01599000
@NM00050 EQU   DEDMYEPA                                                 01600000
DEDSNQRC EQU   DENQRETN+4                                               01601000
DEDSNQEN EQU   DENQRETN                                                 01602000
DECPYLEN EQU   DEPARMS+228                                              01603000
DECPYLOC EQU   DEPARMS+224                                              01604000
DEJSCB   EQU   DEPARMS+220                                              01605000
DESCT    EQU   DEPARMS+216                                              01606000
DEJCT    EQU   DEPARMS+212                                              01607000
DESIOT   EQU   DEPARMS+208                                              01608000
DETCB    EQU   DEPARMS+204                                              01609000
DEALFMAP EQU   DEPARMS+200                                              01610000
DECORE   EQU   DEPARMS                                                  01611000
@NM00049 EQU   PROCESSW+1                                               01612000
DYNMSSOK EQU   PROCESSW+1                                               01613000
HSKPDQSW EQU   PROCESSW+1                                               01614000
DISMSGSW EQU   PROCESSW+1                                               01615000
USERERSW EQU   PROCESSW+1                                               01616000
EPALSISW EQU   PROCESSW+1                                               01617000
EPASCTSW EQU   PROCESSW+1                                               01618000
EPAJCTSW EQU   PROCESSW                                                 01619000
FRRPERSW EQU   PROCESSW                                                 01620000
DCBSPCSW EQU   PROCESSW                                                 01621000
NQEXCLSW EQU   PROCESSW                                                 01622000
UNALOCSW EQU   ERRPROSW                                                 01623000
DEQDSNSW EQU   ERRPROSW                                                 01624000
COPYSW   EQU   PROCESSW                                                 01625000
DYNMSSTM EQU   PROCESSW                                                 01626000
@NM00048 EQU   INPUTSW+3                                                01627000
PCATINIT EQU   INPUTSW+3                                                01628000
UNITDEVT EQU   INPUTSW+3                                                01629000
MOUNTSW  EQU   INPUTSW+2                                                01630000
CATLOGSW EQU   INPUTSW+2                                                01631000
TIOTNQSW EQU   INPUTSW+2                                                01632000
OFFLINSW EQU   INPUTSW+2                                                01633000
WTUNTSW  EQU   INPUTSW+2                                                01634000
NORESSW  EQU   INPUTSW+2                                                01635000
WTDSNSW  EQU   INPUTSW+2                                                01636000
WTVOLSW  EQU   INPUTSW+2                                                01637000
@NM00047 EQU   INPUTSW                                                  01638000
JOBRLSYS EQU   INPUTSW                                                  01639000
NOMONTSW EQU   INPUTSW                                                  01640000
NOCNVTSW EQU   INPUTSW                                                  01641000
ONCNVTSW EQU   INPUTSW                                                  01642000
DINJCTP  EQU   DINCTRLP+12                                              01643000
DINTCBP  EQU   DINCTRLP+8                                               01644000
DINASCBP EQU   DINCTRLP+4                                               01645000
INFOCODE EQU   DINRTRN+2                                                01646000
DSABGRID EQU   DSABGIDL+4                                               01647000
DSABLLEN EQU   DSABGIDL                                                 01648000
DSABANAM EQU   DSABANMI+1                                               01649000
DSABANML EQU   DSABANMI                                                 01650000
DSABRS04 EQU   DSAB+68                                                  01651000
DSABRS03 EQU   DSAB+62                                                  01652000
DSABDCBM EQU   DSAB+56                                                  01653000
DSABSSCM EQU   DSAB+52                                                  01654000
DSABSSNM EQU   DSAB+48                                                  01655000
DSABPTTR EQU   DSAB+44                                                  01656000
DSABTCBP EQU   DSAB+40                                                  01657000
DSABRS02 EQU   DSAB+38                                                  01658000
@NM00061 EQU   DSABFLG4                                                 01659000
DSABCKSI EQU   DSABFLG4                                                 01660000
DSABCKVL EQU   DSABFLG4                                                 01661000
DSABCKDS EQU   DSABFLG4                                                 01662000
@NM00060 EQU   DSABFLG3                                                 01663000
DSABJSCT EQU   DSABFLG3                                                 01664000
DSABCATL EQU   DSABFLG3                                                 01665000
DSABVMSC EQU   DSABFLG3                                                 01666000
DSABVAM  EQU   DSABFLG3                                                 01667000
DSABPASS EQU   DSABFLG3                                                 01668000
DSABDEFR EQU   DSABFLG3                                                 01669000
@NM00059 EQU   DSABFLG2                                                 01670000
DSABUNAL EQU   DSABFLG2                                                 01671000
DSABIRM  EQU   DSABFLG2                                                 01672000
DSABOPEN EQU   DSABFLG2                                                 01673000
DSABCATM EQU   DSABFLG1                                                 01674000
DSABDCAT EQU   DSABFLG1                                                 01675000
DSABDCNV EQU   DSABFLG1                                                 01676000
@NM00058 EQU   DSABORG2                                                 01677000
DSABTR   EQU   DSABORG2                                                 01678000
DSABAM   EQU   DSABORG2                                                 01679000
@NM00057 EQU   DSABORG2                                                 01680000
DSABTQ   EQU   DSABORG2                                                 01681000
DSABTX   EQU   DSABORG2                                                 01682000
DSABGS   EQU   DSABORG2                                                 01683000
DSABU    EQU   DSABORG1                                                 01684000
DSABPO   EQU   DSABORG1                                                 01685000
DSABMQ   EQU   DSABORG1                                                 01686000
DSABCQ   EQU   DSABORG1                                                 01687000
DSABCX   EQU   DSABORG1                                                 01688000
DSABDA   EQU   DSABORG1                                                 01689000
DSABPS   EQU   DSABORG1                                                 01690000
DSABIS   EQU   DSABORG1                                                 01691000
DSABSSVA EQU   DSAB+21                                                  01692000
DSABRS01 EQU   DSAB+20                                                  01693000
DSABLNTH EQU   DSAB+12                                                  01694000
DSABBCHN EQU   DSAB+8                                                   01695000
DSABID   EQU   DSAB                                                     01696000
JSCBCSCB EQU   JSCBSEC1+68                                              01697000
JSCBPMG  EQU   JSCBWTP+2                                                01698000
JSCBWTSP EQU   JSCBWTP+1                                                01699000
JSCRSV23 EQU   JSCBWTFG                                                 01700000
JSCRSV22 EQU   JSCBWTFG                                                 01701000
JSCRSV21 EQU   JSCBWTFG                                                 01702000
JSCRSV20 EQU   JSCBWTFG                                                 01703000
JSCRSV19 EQU   JSCBWTFG                                                 01704000
JSCRSV18 EQU   JSCBWTFG                                                 01705000
JSCBRET  EQU   JSCBWTFG                                                 01706000
JSCBIOFG EQU   JSCBWTFG                                                 01707000
@NM00054 EQU   JSCBSEC1+60                                              01708000
JSCBQMPI EQU   JSCBSEC1+56                                              01709000
JSCBPMSG EQU   JSCBSWT1                                                 01710000
JSCRSV16 EQU   JSCBSWT1                                                 01711000
JSCRSV15 EQU   JSCBSWT1                                                 01712000
JSCRSV14 EQU   JSCBSWT1                                                 01713000
JSCRSV13 EQU   JSCBSWT1                                                 01714000
JSCRSV12 EQU   JSCBSWT1                                                 01715000
JSCRSV11 EQU   JSCBSWT1                                                 01716000
JSCBPASS EQU   JSCBSWT1                                                 01717000
JSCBTTTR EQU   JSCBSEC1+52                                              01718000
JSCRSV10 EQU   JSCBSEC1+49                                              01719000
JSCBAUTH EQU   JSCBOPTS                                                 01720000
JSCSIOTS EQU   JSCBOPTS                                                 01721000
JSCRSV08 EQU   JSCBOPTS                                                 01722000
JSCRSV07 EQU   JSCBOPTS                                                 01723000
JSCRSV06 EQU   JSCBOPTS                                                 01724000
JSCBLONG EQU   JSCBOPTS                                                 01725000
JSCRSV05 EQU   JSCBOPTS                                                 01726000
JSCRSV04 EQU   JSCBOPTS                                                 01727000
JSCBSECB EQU   JSCBSEC1+44                                              01728000
JSCRSV03 EQU   JSCBSEC1+41                                              01729000
JSCBSTEP EQU   JSCBSEC1+40                                              01730000
JSCBDCBA EQU   JSCBDCB+1                                                01731000
JSCRSV02 EQU   JSCBDCB                                                  01732000
JSCBID   EQU   JSCBSEC1+32                                              01733000
JSCBDBTB EQU   JSCBSEC1+28                                              01734000
JSCBIJSC EQU   JSCBSEC1+24                                              01735000
JSCBTCBP EQU   JSCBSEC1+20                                              01736000
JSCBPCC  EQU   JSCBSEC1+16                                              01737000
JSCBTCP  EQU   JSCBSEC1+12                                              01738000
JSCBSHR  EQU   JSCBSEC1+8                                               01739000
JSCHPCEA EQU   JSCHPCE+1                                                01740000
JSCRSV32 EQU   JSCHPCE                                                  01741000
JSCRSV01 EQU   JSCBSEC1                                                 01742000
@NM00053 EQU   IEZJSCB                                                  01743000
QDBRV002 EQU   QDB+28                                                   01744000
QDBPRDS  EQU   QDB+26                                                   01745000
QDBPRSZ  EQU   QDB+24                                                   01746000
QDBBPTDS EQU   QDB+22                                                   01747000
QDBFPTDS EQU   QDB+20                                                   01748000
QDBLELMP EQU   QDB+16                                                   01749000
QDBFELMP EQU   QDB+12                                                   01750000
QDBNELMS EQU   QDB+8                                                    01751000
QDBRV001 EQU   QDB+6                                                    01752000
QDBATTR  EQU   QDB+4                                                    01753000
QDBQDB   EQU   QDB                                                      01754000
TEXTUPRM EQU   TEXTUFLD+2                                               01755000
TEXTULEN EQU   TEXTUFLD                                                 01756000
TXTPLEND EQU   TXTPLENT                                                 01757000
TXTUPEND EQU   TXTUNITP                                                 01758000
TEXTUNUM EQU   TEXTUNIT+2                                               01759000
TEXTUKEY EQU   TEXTUNIT                                                 01760000
S99TUPRM EQU   S99TUFLD+2                                               01761000
S99TULEN EQU   S99TUFLD                                                 01762000
S99TUPND EQU   S99TUP                                                   01763000
S99TUPLN EQU   S99TUPTR                                                 01764000
TIOTFEND EQU   POOLSTAR+16                                              01765000
TIOPSLOT EQU   POOLSTAR+13                                              01766000
TIOPSTTB EQU   POOLSTAR+12                                              01767000
TIOPPOOL EQU   POOLSTAR+4                                               01768000
TIOPNSRT EQU   POOLSTAR+3                                               01769000
@NM00045 EQU   POOLSTAR+2                                               01770000
TIOPNSLT EQU   POOLSTAR+1                                               01771000
@NM00044 EQU   POOLSTAR                                                 01772000
TIOEFSRT EQU   TIOENTRY+17                                              01773000
TIOSVERF EQU   TIOESTTB                                                 01774000
TIOSUNLD EQU   TIOESTTB                                                 01775000
TIOSMNTD EQU   TIOESTTB                                                 01776000
TIOSSETU EQU   TIOESTTB                                                 01777000
TIOSVLSR EQU   TIOESTTB                                                 01778000
TIOSPVIO EQU   TIOESTTB                                                 01779000
TIOSREQD EQU   TIOESTTB                                                 01780000
TIOSUSED EQU   TIOESTTB                                                 01781000
TIOSBALS EQU   TIOESTTC                                                 01782000
TIOSBALP EQU   TIOESTTC                                                 01783000
TIOSVOLS EQU   TIOESTTC                                                 01784000
TIOSVOLP EQU   TIOESTTC                                                 01785000
TIOSAFFS EQU   TIOESTTC                                                 01786000
TIOSAFFP EQU   TIOESTTC                                                 01787000
TIOSDEFR EQU   TIOESTTC                                                 01788000
TIOSDKCR EQU   TIOESTTC                                                 01789000
TIOEJFCB EQU   TIOENTRY+12                                              01790000
TIOTREM  EQU   TIOELINK                                                 01791000
TIOESSDS EQU   TIOESYOT                                                 01792000
TIOESYIN EQU   TIOELINK                                                 01793000
TIOEDYNM EQU   TIOELINK                                                 01794000
TIOTRV01 EQU   TIOELINK                                                 01795000
TIOSYOUT EQU   TIOELINK                                                 01796000
TIOEWTCT EQU   TIOERLOC                                                 01797000
TIOSDSP2 EQU   TIOESTTA                                                 01798000
TIOSDSP1 EQU   TIOESTTA                                                 01799000
TIOSLABL EQU   TIOESTTA                                                 01800000
TIOSDADS EQU   TIOESTTA                                                 01801000
TIOSJBLB EQU   TIOESTTA                                                 01802000
TIOSPLTS EQU   TIOESTTA                                                 01803000
TIOSPLTP EQU   TIOESTTA                                                 01804000
TIOSLTYP EQU   TIOESTTA                                                 01805000
TIOELNGH EQU   TIOENTRY                                                 01806000
TIOCSTEP EQU   TIOT1+8                                                  01807000
TIOCNJOB EQU   TIOT1                                                    01808000
JFCRSV05 EQU   JFCEROPT                                                 01809000
JFCRSV04 EQU   JFCEROPT                                                 01810000
JFCRSV03 EQU   JFCEROPT                                                 01811000
JFCRSV02 EQU   JFCEROPT                                                 01812000
JFCTOPT  EQU   JFCEROPT                                                 01813000
JFCABN   EQU   JFCEROPT                                                 01814000
JFCSKP   EQU   JFCEROPT                                                 01815000
JFCACC   EQU   JFCEROPT                                                 01816000
JFCBUFL  EQU   JFCAMPTR+2                                               01817000
JFCFWORD EQU   JFCBFTEK                                                 01818000
JFCDWORD EQU   JFCBFTEK                                                 01819000
JFCHIER1 EQU   JFCBFTEK                                                 01820000
JFCDYN   EQU   JFCBFTEK                                                 01821000
JFCEXC   EQU   JFCBFTEK                                                 01822000
JFCBBFTR EQU   JFCBBFTA                                                 01823000
JFCSIM   EQU   JFCBBFTA                                                 01824000
JFCHIER  EQU   JFCBFTEK                                                 01825000
JFCBFOUT EQU   JFCBUFNO                                                 01826000
JFCBUFIN EQU   JFCBUFNO                                                 01827000
JFCTEMP  EQU   JFCBIND2                                                 01828000
JFCREQ   EQU   JFCBIND2                                                 01829000
JFCENT   EQU   JFCBIND2                                                 01830000
JFCSECUR EQU   JFCBIND2                                                 01831000
JFCPDS   EQU   JFCBIND1                                                 01832000
JFCGDG   EQU   JFCBIND1                                                 01833000
JFCADDED EQU   JFCBIND1                                                 01834000
JFCLOC   EQU   JFCBIND1                                                 01835000
JFCRLSE  EQU   JFCBIND1                                                 01836000
JFCBXPDT EQU   INFMJFCB+83                                              01837000
JFCBCRDT EQU   INFMJFCB+80                                              01838000
JFCBOPS2 EQU   JFCBMASK+7                                               01839000
JFCRCTLG EQU   JFCBFLG2                                                 01840000
JFCBBUFF EQU   JFCBFLG2                                                 01841000
JFCTRACE EQU   JFCBFLG2                                                 01842000
JFCSDRPS EQU   JFCBFLG2                                                 01843000
JFCNRPS  EQU   JFCDEFER                                                 01844000
JFCOUTOP EQU   JFCBFLG2                                                 01845000
JFCINOP  EQU   JFCBFLG2                                                 01846000
JFCBPWBP EQU   JFCOPEN                                                  01847000
@NM00040 EQU   JFCOPEN                                                  01848000
JFCDUAL  EQU   JFCBFLG1                                                 01849000
JFCSLDES EQU   JFCBFLG1                                                 01850000
JFCSLCRE EQU   JFCBFLG1                                                 01851000
JFCSTAND EQU   JFCBFLG1                                                 01852000
JFCBOPS1 EQU   JFCBMASK                                                 01853000
JFCBVLSQ EQU   INFMJFCB+70                                              01854000
JFCRSV31 EQU   JFCFUNC                                                  01855000
JFCFNCBT EQU   JFCFUNC                                                  01856000
JFCFNCBX EQU   JFCFUNC                                                  01857000
JFCFNCBD EQU   JFCFUNC                                                  01858000
JFCFNCBW EQU   JFCFUNC                                                  01859000
JFCFNCBP EQU   JFCFUNC                                                  01860000
JFCFNCBR EQU   JFCFUNC                                                  01861000
JFCFNCBI EQU   JFCFUNC                                                  01862000
JFCBFOFL EQU   JFCBUFOF                                                 01863000
JFCNL    EQU   JFCBLTYP                                                 01864000
JFCSL    EQU   JFCBLTYP                                                 01865000
JFCNSL   EQU   JFCBLTYP                                                 01866000
JFCSUL   EQU   JFCBLTYP                                                 01867000
JFCBLP   EQU   JFCBLTYP                                                 01868000
JFCBLTM  EQU   JFCBLTYP                                                 01869000
JFCBAL   EQU   JFCBLTYP                                                 01870000
JFCRSV38 EQU   JFCBLTYP                                                 01871000
JFCVINDX EQU   INFMJFCB+64                                              01872000
JFCNLREC EQU   INFMJFCB+62                                              01873000
JFCBADBF EQU   INFMJFCB+60                                              01874000
JFCAMSTR EQU   JFCBFRID+2                                               01875000
JFCAMCRO EQU   JFCBFRID                                                 01876000
JFCBDSCB EQU   INFMJFCB+53                                              01877000
JFCPAT   EQU   JFCBTSDM                                                 01878000
JFCNDCB  EQU   JFCBTSDM                                                 01879000
JFCNDSCB EQU   JFCBTSDM                                                 01880000
JFCNWRIT EQU   JFCBTSDM                                                 01881000
JFCTTR   EQU   JFCBTSDM                                                 01882000
JFCSDS   EQU   JFCBTSDM                                                 01883000
JFCVSL   EQU   JFCBTSDM                                                 01884000
JFCCAT   EQU   JFCBTSDM                                                 01885000
JFCIPLTX EQU   JFCBELNM                                                 01886000
JFCBQNAM EQU   JFCBDSNM                                                 01887000
SIODDSNL EQU   INDMSIOT+173                                             01888000
SIOVDSNL EQU   INDMSIOT+172                                             01889000
SIOVDSNT EQU   INDMSIOT+170                                             01890000
SVOLUNNO EQU   INDMSIOT+168                                             01891000
SIOTVMVP EQU   INDMSIOT+164                                             01892000
SIOTJFX  EQU   INDMSIOT+160                                             01893000
SIOTNPTR EQU   INDMSIOT+152                                             01894000
SIOTETIO EQU   INDMSIOT+148                                             01895000
SIOTATE  EQU   INDMSIOT+144                                             01896000
SVOLUNAD EQU   INDMSIOT+140                                             01897000
SIOTEDLP EQU   INDMSIOT+136                                             01898000
SIOTEDLS EQU   INDMSIOT+132                                             01899000
SIOTRSNC EQU   INDMSIOT+130                                             01900000
SCTANAME EQU   INDMSIOT+122                                             01901000
SIOTSSIC EQU   INDMSIOT+120                                             01902000
@NM00039 EQU   INDMSIOT+108                                             01903000
SIOTSSNM EQU   INDMSIOT+104                                             01904000
@NM00038 EQU   SIOTBYT2                                                 01905000
SIOTCVOL EQU   SIOTBYT2                                                 01906000
SIOTCNEW EQU   SIOTBYT2                                                 01907000
SIOTCALC EQU   SIOTBYT2                                                 01908000
SIOTGALL EQU   SIOTBYT2                                                 01909000
SIOTDSPD EQU   SIOTBYT2                                                 01910000
SIOTDMND EQU   SIOTBYT2                                                 01911000
SIOTOPUC EQU   INDMSIOT+99                                              01912000
SIOTOUTR EQU   INDMSIOT+97                                              01913000
SIOTOUTC EQU   INDMSIOT+96                                              01914000
SIOTSSWA EQU   INDMSIOT+93                                              01915000
SIOTAUNC EQU   SIOTALTD                                                 01916000
SIOTACAT EQU   SIOTALTD                                                 01917000
SIOTADEL EQU   SIOTALTD                                                 01918000
SIOTAKEP EQU   SIOTALTD                                                 01919000
SIOTNPRV EQU   SIOTALTD                                                 01920000
SIOJCATS EQU   SIOTALTD                                                 01921000
@NM00037 EQU   SIOTALTD                                                 01922000
@NM00036 EQU   SIOTALTD                                                 01923000
@NM00035 EQU   INDMSIOT+91                                              01924000
SIOTNDSB EQU   INDMSIOT+88                                              01925000
@NM00034 EQU   INDMSIOT+84                                              01926000
SIOTDPCD EQU   INDMSIOT+82                                              01927000
@NM00033 EQU   SIOTBYT4                                                 01928000
SIOTRACT EQU   SIOTBYT4                                                 01929000
SIOTRACD EQU   SIOTBYT4                                                 01930000
SIOTPROT EQU   SIOTBYT4                                                 01931000
SCTOUTPN EQU   INDMSIOT+80                                              01932000
SCTOUTNO EQU   INDMSIOT+76                                              01933000
SCTOUTNM EQU   INDMSIOT+68                                              01934000
SIOUCBAD EQU   SCTUTYPE+5                                               01935000
SIOUCNVT EQU   SCTUTYPE+4                                               01936000
SIOUBYT4 EQU   SIOTDEVT+3                                               01937000
@NM00032 EQU   SIOUBYT3                                                 01938000
SIO3UREC EQU   SIOUBYT3                                                 01939000
SIO3DISP EQU   SIOUBYT3                                                 01940000
SIO3DACC EQU   SIOUBYT3                                                 01941000
SIO3COMM EQU   SIOUBYT3                                                 01942000
SIO3TAPE EQU   SIOUBYT3                                                 01943000
SIOUBYT2 EQU   SIOTDEVT+1                                               01944000
SIOUBYT1 EQU   SIOTDEVT                                                 01945000
SIOTOMN  EQU   SCTSBYT4                                                 01946000
SIOTIPDI EQU   SCTSBYT4                                                 01947000
SIOTVAFF EQU   SCTSBYT4                                                 01948000
SIOTSTEP EQU   SCTSBYT4                                                 01949000
SIOTASCI EQU   SCTSBYT4                                                 01950000
@NM00031 EQU   SCTSBYT4                                                 01951000
SCTSGDGS EQU   SCTSBYT4                                                 01952000
SCTSMOD  EQU   SCTSBYT3                                                 01953000
SCTSNEW  EQU   SCTSBYT3                                                 01954000
SCTSYSOU EQU   SCTSBYT3                                                 01955000
SCTVREF  EQU   SCTSBYT3                                                 01956000
SCTALCHK EQU   SCTSBYT3                                                 01957000
SCTSYSNE EQU   SCTSBYT3                                                 01958000
SCTDSNRF EQU   SCTSBYT3                                                 01959000
SCTRECVD EQU   SCTSBYT2                                                 01960000
SCTDEFER EQU   SCTSBYT2                                                 01961000
SCTLABEL EQU   SCTSBYT2                                                 01962000
SCTUNLBD EQU   SCTSBYT2                                                 01963000
SCTJOBLB EQU   SCTSBYT2                                                 01964000
SCTVOLAF EQU   SCTSBYT2                                                 01965000
SIOTCATL EQU   SCTSBYT2                                                 01966000
SIOCLUNL EQU   SCTSBYT2                                                 01967000
SIOTJSCT EQU   SCTSBYT1                                                 01968000
SCTUNAFF EQU   SCTSBYT1                                                 01969000
SCTPARLM EQU   SCTSBYT1                                                 01970000
SIOTQDSN EQU   SCTSBYT1                                                 01971000
SIOTGDSN EQU   SCTSBYT1                                                 01972000
SIOTCCAT EQU   SCTSBYT1                                                 01973000
SCTSYSIN EQU   SCTSBYT1                                                 01974000
SIOTUNCT EQU   SCTSDISP                                                 01975000
SIOTCTLG EQU   SCTSDISP                                                 01976000
SIOTDLET EQU   SCTSDISP                                                 01977000
SIOTKEEP EQU   SCTSDISP                                                 01978000
SIOTPASS EQU   SCTSDISP                                                 01979000
SIOTPRIV EQU   SCTSDISP                                                 01980000
S3400DSP EQU   SCTSDISP                                                 01981000
SIOTRETN EQU   SCTSDISP                                                 01982000
SIOTVLCT EQU   INDMSIOT+54                                              01983000
SCTNMBUT EQU   INDMSIOT+53                                              01984000
SIOTRTRY EQU   SIOTBYT0                                                 01985000
SIOTPUPV EQU   SIOTBYT0                                                 01986000
SIOTNOPV EQU   SIOTBYT0                                                 01987000
SIOTGIGN EQU   SIOTBYT0                                                 01988000
SPVTAMSG EQU   SIOTBYT0                                                 01989000
SIOTFUDA EQU   SIOTBYT0                                                 01990000
SIOTDYAL EQU   SIOTBYT0                                                 01991000
SIOTSSDS EQU   SIOTBYT0                                                 01992000
SIOTGIID EQU   INDMSIOT+50                                              01993000
SCTVOLCT EQU   INDMSIOT+49                                              01994000
SCTSPOOL EQU   INDMSIOT+48                                              01995000
SIOTQNAM EQU   SIOTTSTC                                                 01996000
SIOTDSNM EQU   SIOTTSTC                                                 01997000
SIOTTRKM EQU   SIOTTSTC                                                 01998000
SIOTSSMG EQU   SIOTTSTC                                                 01999000
SIOTSSGP EQU   SIOTTSTC                                                 02000000
@NM00030 EQU   SIOTTSTC                                                 02001000
SIOTTERM EQU   SIOTTSTC                                                 02002000
SIOTINFC EQU   SIOTTSTC                                                 02003000
@NM00029 EQU   SIOTBYT3                                                 02004000
SIOTDSID EQU   SIOTBYT3                                                 02005000
S3400OFF EQU   SIOTBYT3                                                 02006000
SIOTJES3 EQU   SIOTBYT3                                                 02007000
SIOCDEVT EQU   SIOTBYT3                                                 02008000
SIOALIAS EQU   SIOTBYT3                                                 02009000
SCTDDINO EQU   INDMSIOT+44                                              02010000
SIOTDDNT EQU   SIOTBYT1                                                 02011000
SIOTALCD EQU   SIOTBYT1                                                 02012000
SIODADSM EQU   SIOTBYT1                                                 02013000
SIOTDADR EQU   SIOTBYT1                                                 02014000
SIODUNAL EQU   SIOTBYT1                                                 02015000
SIOVAMDS EQU   SIOTBYT1                                                 02016000
SIOTHOLD EQU   SIOTBYT1                                                 02017000
SIOTOCKP EQU   SIOTBYT1                                                 02018000
SIOPSCNT EQU   INDMSIOT+42                                              02019000
SIOTREFN EQU   INDMSIOT+40                                              02020000
SIOTOTUN EQU   INDMSIOT+39                                              02021000
SIOTVRSB EQU   INDMSIOT+36                                              02022000
@NM00028 EQU   INDMSIOT+35                                              02023000
SCTPJFCB EQU   INDMSIOT+32                                              02024000
@NM00027 EQU   INDMSIOT+31                                              02025000
SCTPSIOT EQU   INDMSIOT+28                                              02026000
SIOTAFID EQU   INDMSIOT+26                                              02027000
SIOTVLSP EQU   INDMSIOT+24                                              02028000
SIODSNTE EQU   INDMSIOT+22                                              02029000
SIOTUNAF EQU   SCTUSADD                                                 02030000
SIOTDEST EQU   INDMSIOT+12                                              02031000
SCTDDNAM EQU   INDMSIOT+4                                               02032000
SIOTTYPE EQU   INDMSIOT+3                                               02033000
SIOTDSKA EQU   INDMSIOT                                                 02034000
@NM00026 EQU   @NM00024+1                                               02035000
SCTONLY  EQU   SCTABCND                                                 02036000
SCTEVEN  EQU   SCTABCND                                                 02037000
SCTABEND EQU   SCTABCND                                                 02038000
SCTONLYC EQU   SCTABCND                                                 02039000
SCTABCAN EQU   SCTABCND                                                 02040000
@NM00025 EQU   SCTABCND                                                 02041000
@NM00023 EQU   INSMSCT+173                                              02042000
@NM00022 EQU   SCTSTEND                                                 02043000
SCTSYSCK EQU   SCTSTEND                                                 02044000
SCTSTPND EQU   SCTSTEND                                                 02045000
SCTSTSRT EQU   SCTSTEND                                                 02046000
@NM00021 EQU   INSMSCT+168                                              02047000
SCTCATCT EQU   INSMSCT+166                                              02048000
SCTSDPSA EQU   SCTCDENT+3                                               02049000
SCTSDPOP EQU   SCTCDENT+2                                               02050000
SCTSDPCD EQU   SCTCDENT                                                 02051000
@NM00020 EQU   INSMSCT+117                                              02052000
SCTPRFMF EQU   INSMSCT+116                                              02053000
SCTPGMNM EQU   INSMSCT+108                                              02054000
SCTTIOT  EQU   INSMSCT+105                                              02055000
@NM00019 EQU   SCTBCT                                                   02056000
SCTJBEND EQU   SCTBCT                                                   02057000
SCTSPSYS EQU   SCTBCT                                                   02058000
SCTSTPLB EQU   SCTBCT                                                   02059000
@NM00018 EQU   SCTBCT                                                   02060000
SCTMCVOL EQU   SCTBCT                                                   02061000
@NM00017 EQU   SCTBCT                                                   02062000
SCTGOTTR EQU   INSMSCT+100                                              02063000
SCTSMF   EQU   INSMSCT+96                                               02064000
@NM00016 EQU   SCTSDPTY+1                                               02065000
SCTSDP   EQU   SCTSDPTY                                                 02066000
SCTFSTEP EQU   SCTSDPTY                                                 02067000
@NM00015 EQU   SCTSDPTY                                                 02068000
@NM00014 EQU   SCTSDPTY                                                 02069000
@NM00013 EQU   INSMSCT+90                                               02070000
SCTMSSZE EQU   INSMSCT+88                                               02071000
SCTPCAT  EQU   INSMSCT+84                                               02072000
SCTLDSTB EQU   INSMSCT+80                                               02073000
SCTSRBT  EQU   INSMSCT+76                                               02074000
SCTMSADR EQU   INSMSCT+72                                               02075000
@NM00012 EQU   INSMSCT+71                                               02076000
SCTXBTTR EQU   INSMSCT+68                                               02077000
SCTJSCAT EQU   SCTSTYPE                                                 02078000
SCTINITB EQU   SCTSTYPE                                                 02079000
SCTSJFHK EQU   SCTSTYPE                                                 02080000
SCTOUTMC EQU   SCTSTYPE                                                 02081000
SCTINPUT EQU   SCTSTYPE                                                 02082000
SCTGOSTP EQU   SCTSTYPE                                                 02083000
@NM00011 EQU   INSMSCT+66                                               02084000
SCTNSMSG EQU   INSMSCT+65                                               02085000
SCTSNUMB EQU   INSMSCT+64                                               02086000
@NM00010 EQU   INSMSCT+62                                               02087000
SCTRPACT EQU   INSMSCT+60                                               02088000
SCTSNAME EQU   INSMSCT+52                                               02089000
SCTSCLPC EQU   INSMSCT+44                                               02090000
@NM00009 EQU   INSMSCT+43                                               02091000
SCTADSTB EQU   INSMSCT+40                                               02092000
@NM00008 EQU   INSMSCT+36                                               02093000
@NM00007 EQU   INSMSCT+35                                               02094000
SCTAFACT EQU   INSMSCT+32                                               02095000
SCTDDNT  EQU   INSMSCT+28                                               02096000
@NM00006 EQU   INSMSCT+27                                               02097000
SCTLSIOT EQU   INSMSCT+24                                               02098000
@NM00005 EQU   INSMSCT+23                                               02099000
SCTANSCT EQU   INSMSCT+20                                               02100000
@NM00004 EQU   INSMSCT+19                                               02101000
SCTAALOC EQU   INSMSCT+16                                               02102000
@NM00003 EQU   INSMSCT+15                                               02103000
SCTFSIOT EQU   INSMSCT+12                                               02104000
SCTLALOC EQU   INSMSCT+10                                               02105000
SCTSEXEC EQU   INSMSCT+8                                                02106000
SCTSTIME EQU   INSMSCT+5                                                02107000
INCMSSTS EQU   SCTSSTAT                                                 02108000
SCTGRPH  EQU   SCTSSTAT                                                 02109000
SCTKEY0  EQU   SCTSSTAT                                                 02110000
SCTDORST EQU   SCTSSTAT                                                 02111000
SCTNOCKP EQU   SCTSSTAT                                                 02112000
SCTNORST EQU   SCTSSTAT                                                 02113000
EACAUSER EQU   SCTSSTAT                                                 02114000
EAADDRBT EQU   SCTSSTAT                                                 02115000
SCTTBLID EQU   INSMSCT+3                                                02116000
SCTDISKA EQU   INSMSCT                                                  02117000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02118000
@RC00093 EQU   @RC00085                                                 02119000
@RC00115 EQU   @RC00098                                                 02120000
@ENDDATA EQU   *                                                        02121000
         END   IEFDB470,(C'PLS1752',0701,78089)                         02122000
./  ADD  SSI=50230620,NAME=IEFDB480
         TITLE 'IEFDB480 - REMOVE IN-USE CONTROL RTN                   *00001000
                        '                                               00002000
IEFDB480 CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IEFDB480  75.024'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @12,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@12                                      01S0001 00013000
         L     @00,@SIZDATD                                     01S0001 00014000
         GSPACE   R,LV=(0)                                              00015000
         LR    @11,@01                                          01S0001 00016000
         USING @DATD,@11                                        01S0001 00017000
         ST    @13,@SA00001+4                                   01S0001 00018000
         LM    @00,@01,20(@13)                                  01S0001 00019000
         ST    @11,8(,@13)                                      01S0001 00020000
         LR    @13,@11                                          01S0001 00021000
         MVC   @PC00001(28),0(@01)                              01S0001 00022000
JSCBDISP EQU 188                                                        00023000
JSCBAOS1 EQU  72                                                        00024000
JSCBAOS2 EQU 192                                                        00025000
*RSNCODE=0;                            /*INIT ERROR AND INFO CODES   */ 00026000
         L     @10,@PC00001+4                                   01S0059 00027000
         SLR   @15,@15                                          01S0059 00028000
         ST    @15,RSNCODE(,@10)                                01S0059 00029000
*RIUKYTAB=RIUKYTAB && RIUKYTAB;        /*ZERO OUT KEY TABLE          */ 00030000
         XC    RIUKYTAB(8),RIUKYTAB                             01S0060 00031000
*DUPMASK=DUPMASK && DUPMASK;           /*ZERO OUT DUP KEY MASK       */ 00032000
         XC    DUPMASK(1),DUPMASK                               01S0061 00033000
*MUTEXMSK=MUTEXMSK && MUTEXMSK;        /*ZERO OUT MUT EXCLU. KEY MASK*/ 00034000
         XC    MUTEXMSK(1),MUTEXMSK                             01S0062 00035000
*CALL IEFDB4FF(S99TXTPP,ADDR(RIUKYDIC),ADDR(DUPMASK),  /*CALL SYNTAX */ 00036000
*              ADDR(MUTEXMSK),ADDR(RIUKYTAB),RSNCODE); /*CHECKER     */ 00037000
         L     @15,@PC00001                                     01S0063 00038000
         ST    @15,@AL00001                                     01S0063 00039000
         LA    @15,RIUKYDIC                                     01S0063 00040000
         ST    @15,@TF00001                                     01S0063 00041000
         LA    @15,@TF00001                                     01S0063 00042000
         ST    @15,@AL00001+4                                   01S0063 00043000
         LA    @15,DUPMASK                                      01S0063 00044000
         ST    @15,@TF00002                                     01S0063 00045000
         LA    @15,@TF00002                                     01S0063 00046000
         ST    @15,@AL00001+8                                   01S0063 00047000
         LA    @15,MUTEXMSK                                     01S0063 00048000
         ST    @15,@TF00003                                     01S0063 00049000
         LA    @15,@TF00003                                     01S0063 00050000
         ST    @15,@AL00001+12                                  01S0063 00051000
         LA    @15,RIUKYTAB                                     01S0063 00052000
         ST    @15,@TF00004                                     01S0063 00053000
         LA    @15,@TF00004                                     01S0063 00054000
         ST    @15,@AL00001+16                                  01S0063 00055000
         ST    @10,@AL00001+20                                  01S0063 00056000
         L     @15,@CV00074                                     01S0063 00057000
         LA    @01,@AL00001                                     01S0063 00058000
         BALR  @14,@15                                          01S0063 00059000
*IF ERRCODE = 0 THEN                   /*ANY ERROR IN SYNTAX CHECK   */ 00060000
         SLR   @10,@10                                          01S0064 00061000
         L     @15,@PC00001+4                                   01S0064 00062000
         CH    @10,ERRCODE(,@15)                                01S0064 00063000
         BNE   @RF00064                                         01S0064 00064000
*  IF (TCBADTUP = 0   &                /*NO, WAS AT LEAST ONE OF THE */ 00065000
*      CUTSKTUP = 0) THEN              /*TWO VALID KEYS SPECIFIED    */ 00066000
         C     @10,TCBADTUP                                     01S0065 00067000
         BNE   @RF00065                                         01S0065 00068000
         C     @10,CUTSKTUP                                     01S0065 00069000
         BNE   @RF00065                                         01S0065 00070000
*    ERRCODE=RCKEYREQ;                 /*NO, THEN REQUIRED KEY ERROR */ 00071000
         MVC   ERRCODE(2,@15),@CH01178                          01S0066 00072000
*  ELSE                                /*YES, PROCESS REQUEST        */ 00073000
*    IF DSQFRSTP ¬= 0 THEN             /*ANY DSABS ON THE CHAIN?     */ 00074000
         B     @RC00065                                         01S0067 00075000
@RF00065 SLR   @10,@10                                          01S0067 00076000
         L     @15,@PC00001+8                                   01S0067 00077000
         L     @01,JSCBPTR(,@15)                                01S0067 00078000
         L     @01,JSCDSABQ(,@01)                               01S0067 00079000
         L     @15,DSQFRSTP(,@01)                               01S0067 00080000
         CR    @15,@10                                          01S0067 00081000
         BE    @RF00067                                         01S0067 00082000
*      DO;                             /*YES, CONTINUE PROCESSING    */ 00083000
*        DSABCNT=0;                    /*INIT CNTR OF DSABS FOR RIU  */ 00084000
         ST    @10,DSABCNT                                      01S0069 00085000
*        DSABLSTP=0;                   /*INIT PTR TO DSAB PTR LIST   */ 00086000
         ST    @10,DSABLSTP                                     01S0070 00087000
*        DSABPTR=DSQFRSTP;             /*POINT TO 1ST DSAB IN CHAIN  */ 00088000
         LR    DSABPTR,@15                                      01S0071 00089000
*        IF TCBADTUP ¬= 0 THEN         /*WAS TCB ADDR OPTION SPEC'D.?*/ 00090000
         C     @10,TCBADTUP                                     01S0072 00091000
         BE    @RF00072                                         01S0072 00092000
*          DO;                         /*YES,BUILD LIST OF DSABS     */ 00093000
*/********************************************************************/ 00094000
*/*                                                                  */ 00095000
*/* SEGMENT NAME - TCBADSCH                                          */ 00096000
*/*                                                                  */ 00097000
*/* DESCRIPTIVE NAME - TCB ADDRESS SEARCH                            */ 00098000
*/*                                                                  */ 00099000
*/* FUNCTION  - SEARCH DSAB CHAIN AND BUILD DSAB PTR LIST FOR THOSE  */ 00100000
*/*             DSABS ELIGIBLE FOR REMOVE IN-USE (I.E. IN-USE DSABS  */ 00101000
*/*             HAVING THE SPECIFIED TCB ADDRESS).                   */ 00102000
*/*                                                                  */ 00103000
*/* OPERATION - THIS SEGMENT SCANS THE DSAB CHAIN TWICE. ON ENTRY,   */ 00104000
*/*             DSABPTR IS POINTING TO THE FIRST DSAB ON THE         */ 00105000
*/*             CHAIN, AN EMPTY CHAIN ALREADY HAVING BEEN CHECKED    */ 00106000
*/*             FOR. IF A DSAB IS IN-USE, NOT A PRIVATE CATALOG, AND */ 00107000
*/*             WAS MARKED IN-USE UNDER THE SPECIFIED TCB, IT IS     */ 00108000
*/*             ELIGIBLE FOR REMOVE IN-USE. ONLY THE FIRST MEMBER    */ 00109000
*/*             OF A CONCATENATED GROUP WILL BE LOOKED AT IN EACH    */ 00110000
*/*             SCAN. IN THE FIRST SCAN, A COUNT OF THE NUMBER OF    */ 00111000
*/*             THESE DSABS ELIGIBLE FOR REMOVE IN-USE IS DETERMINED.*/ 00112000
*/*             IF THIS NUMBER IS GREATER THAN ZERO, A GETMAIN IS    */ 00113000
*/*             ISSUED TO GET CORE FOR A LIST OF PTRS TO THE DSABS.  */ 00114000
*/*             THEN DSABPTR IS RESET TO THE FIRST DSAB AND          */ 00115000
*/*             A SECOND SCAN OF THE CHAIN IS MADE, AGAIN DETERMINING*/ 00116000
*/*             ELIGIBLE DSABS, AND THIS TIME PLACING THEIR ADDRESS  */ 00117000
*/*             IN THE LIST.                                         */ 00118000
*/*                                                                  */ 00119000
*/* ENTRY -                                                          */ 00120000
*/*   INPUT - DSABPTR - POINTS TO FIRST DSAB ON CHAIN                */ 00121000
*/*           DSQFRSTP - POINTS TO FIRST DSAB ON CHAIN               */ 00122000
*/*           DSABCNT - ZERO ON ENTRY                                */ 00123000
*/*           DSABLSTP- ZERO ON ENTRY                                */ 00124000
*/*           TEXTUPAR - CONTAINS SPECIFIED TCB ADDRESS              */ 00125000
*/*                                                                  */ 00126000
*/* EXIT  -                                                          */ 00127000
*/*   OUTPUT - DSABCNT  - NO. OF DSABS FOR REMOVE IN-USE, IF ANY     */ 00128000
*/*            DSABLSTP - POINTS TO LIST OF DSAB PTRS IF THERE       */ 00129000
*/*                       ARE ANY FOR REMOVE IN-USE                  */ 00130000
*/*            DSABLIST - LIST OF DSABS,IF ANY                       */ 00131000
*/*                                                                  */ 00132000
*/********************************************************************/ 00133000
*RFY TEXTUNIT BASED(TCBADTUP);         /*RESET TEXT UNIT BASE PTR.   */ 00134000
*DO WHILE DSABPTR ¬= 0;                /*SCAN DSABS TO END OF CHAIN  */ 00135000
         B     @DE00075                                         02S0075 00136000
@DL00075 DS    0H                                               02S0076 00137000
*  IF (DSABTCBP=TEXTUPAR(1:4) &        /*DSAB HAVE SPECD TCB ADDR AND*/ 00138000
*      DSABNUSE='1'B   &               /*DSAB MARKED IN-USE AND      */ 00139000
*      DSABCATL='0'B) THEN             /*NOT FOR A CATALOG           */ 00140000
         L     @10,TCBADTUP                                     02S0076 00141000
         CLC   DSABTCBP(4,DSABPTR),TEXTUPAR(@10)                02S0076 00142000
         BNE   @RF00076                                         02S0076 00143000
         TM    DSABNUSE(DSABPTR),B'00000001'                    02S0076 00144000
         BNO   @RF00076                                         02S0076 00145000
         TM    DSABCATL(DSABPTR),B'00001000'                    02S0076 00146000
         BNZ   @RF00076                                         02S0076 00147000
*    DSABCNT=DSABCNT+1;                /*YES,INCREMENT COUNT OF DSABS*/ 00148000
         LA    @10,1                                            02S0077 00149000
         AL    @10,DSABCNT                                      02S0077 00150000
         ST    @10,DSABCNT                                      02S0077 00151000
*  ELSE;                               /*NO, DON'T PROCESS THIS DSAB */ 00152000
@RF00076 DS    0H                                               02S0079 00153000
*  DSABPTR=DSABFCHN;                   /*POINT TO NEXT DSAB ON CHAIN */ 00154000
         L     DSABPTR,DSABFCHN(,DSABPTR)                       02S0079 00155000
*  DO WHILE (DSABPTR ¬= 0 &            /*SKIP TO END OF DSAB CHAIN   */ 00156000
*            TIOEDDNM(1) = ' ');       /*OR TO END OF GROUP IF DSAB IS  00157000
*                                        CONCATENATED TO PRIOR DSAB  */ 00158000
         B     @DE00080                                         02S0080 00159000
@DL00080 DS    0H                                               02S0081 00160000
*    DSABPTR=DSABFCHN;                 /*POINT TO NEXT DSAB ON CHAIN */ 00161000
         L     DSABPTR,DSABFCHN(,DSABPTR)                       02S0081 00162000
*  END;                                /*END IF IN A CONCAT GROUP    */ 00163000
@DE00080 LTR   DSABPTR,DSABPTR                                  02S0082 00164000
         BZ    @DC00080                                         02S0082 00165000
         L     @10,DSABTIOT(,DSABPTR)                           02S0082 00166000
         CLI   TIOEDDNM(@10),C' '                               02S0082 00167000
         BE    @DL00080                                         02S0082 00168000
@DC00080 DS    0H                                               02S0083 00169000
*END;                                  /*END 1ST SCAN OF DSABS       */ 00170000
@DE00075 SLR   @10,@10                                          02S0083 00171000
         CR    DSABPTR,@10                                      02S0083 00172000
         BNE   @DL00075                                         02S0083 00173000
*IF DSABCNT ¬= 0 THEN                  /*ARE THERE DSABS TO PROCESS? */ 00174000
         L     @15,DSABCNT                                      02S0084 00175000
         CR    @15,@10                                          02S0084 00176000
         BE    @RF00084                                         02S0084 00177000
*  DO;                                 /*YES, BUILD LIST FOR THEM    */ 00178000
*    R0 = DSABCNT*4;                   /*LENGTH LIST CORE NEEDED     */ 00179000
         SLA   @15,2                                            02S0086 00180000
         LR    R0,@15                                           02S0086 00181000
*    R0 = R0 | SCHDSUBP;               /*GET FROM CORRECT SUBPOOL    */ 00182000
         O     R0,@CF00073                                      02S0087 00183000
*    GEN (GETMAIN R,LV=(0))            /*GET CORE FOR DSAB PTRS LIST */ 00184000
*         SETS(R1) REFS(R0);                                    02S0088 00185000
         GETMAIN R,LV=(0)                                               00186000
*    DSABLSTP=R1;                      /*SAVE ADDR OF LIST           */ 00187000
         ST    R1,DSABLSTP                                      02S0089 00188000
*    DSABPTR=DSQFRSTP;                 /*POINT BACK TO FIRST DSAB    */ 00189000
         L     @10,@PC00001+8                                   02S0090 00190000
         L     @10,JSCBPTR(,@10)                                02S0090 00191000
         L     @10,JSCDSABQ(,@10)                               02S0090 00192000
         L     DSABPTR,DSQFRSTP(,@10)                           02S0090 00193000
*    LISTINDX=1;                       /*INIT INDEX OF DSAB PTR LIST */ 00194000
         LA    LISTINDX,1                                       02S0091 00195000
*    DO WHILE LISTINDX<=DSABCNT;       /*BUILD LIST OF DSAB PTRS     */ 00196000
         B     @DE00092                                         02S0092 00197000
@DL00092 DS    0H                                               02S0093 00198000
*      IF(DSABTCBP=TEXTUPAR(1:4) &     /*DSAB HAVE SPECD TCB,ADDR AND*/ 00199000
*         DSABNUSE='1'B    &           /*DSAB MARKED IN USE AND      */ 00200000
*         DSABCATL='0'B) THEN          /*NOT FOR A CATALOG ?         */ 00201000
         L     @10,TCBADTUP                                     02S0093 00202000
         CLC   DSABTCBP(4,DSABPTR),TEXTUPAR(@10)                02S0093 00203000
         BNE   @RF00093                                         02S0093 00204000
         TM    DSABNUSE(DSABPTR),B'00000001'                    02S0093 00205000
         BNO   @RF00093                                         02S0093 00206000
         TM    DSABCATL(DSABPTR),B'00001000'                    02S0093 00207000
         BNZ   @RF00093                                         02S0093 00208000
*        DO;                           /*YES,DSAB TO BE PROCESSED    */ 00209000
*          DSABLIST(LISTINDX)=DSABPTR; /*ADD ADDR OF DSAB TO LIST    */ 00210000
         LR    @10,LISTINDX                                     02S0095 00211000
         SLA   @10,2                                            02S0095 00212000
         L     @05,DSABLSTP                                     02S0095 00213000
         AL    @05,@CF01315                                     02S0095 00214000
         ST    DSABPTR,DSABLIST(@10,@05)                        02S0095 00215000
*          LISTINDX=LISTINDX+1;        /*INCREMENT INDEX INTO LIST   */ 00216000
         AL    LISTINDX,@CF00064                                02S0096 00217000
*        END;                          /*END OF DSAB TO BE PROCESSED */ 00218000
*      ELSE;                           /*DSAB NOT TO BE PROCESSED    */ 00219000
@RF00093 DS    0H                                               02S0099 00220000
*      DSABPTR=DSABFCHN;               /*POINT TO NEXT DSAB ON CHAIN */ 00221000
         L     DSABPTR,DSABFCHN(,DSABPTR)                       02S0099 00222000
*      DO WHILE (DSABPTR ¬= 0 &        /*SKIP TO END OF DSAB CHAIN   */ 00223000
*                TIOEDDNM(1) = ' ');   /*OR TO END OF GROUP IF DSAB IS  00224000
*                                        CONCATENATED TO PRIOR DSAB  */ 00225000
         B     @DE00100                                         02S0100 00226000
@DL00100 DS    0H                                               02S0101 00227000
*        DSABPTR=DSABFCHN;             /*POINT TO NEXT DSAB IN CHAIN */ 00228000
         L     DSABPTR,DSABFCHN(,DSABPTR)                       02S0101 00229000
*      END;                            /*END IF IN A CONCAT GROUP    */ 00230000
@DE00100 LTR   DSABPTR,DSABPTR                                  02S0102 00231000
         BZ    @DC00100                                         02S0102 00232000
         L     @10,DSABTIOT(,DSABPTR)                           02S0102 00233000
         CLI   TIOEDDNM(@10),C' '                               02S0102 00234000
         BE    @DL00100                                         02S0102 00235000
@DC00100 DS    0H                                               02S0103 00236000
*    END;                              /*END OF LIST BUILD LOOP      */ 00237000
@DE00092 C     LISTINDX,DSABCNT                                 02S0103 00238000
         BNH   @DL00092                                         02S0103 00239000
*  END;                                /*END IF DSABS TO BE PROCESSED*/ 00240000
*ELSE;                                 /*NO DSABS FOR REMOVE IN-USE  */ 00241000
@RF00084 DS    0H                                               02S0106 00242000
*RFY TEXTUNIT BASED(TXTPLENT);         /*RESET TEXT UNIT BASE PTR.   */ 00243000
*          END;                        /*END TCB ADDR SEARCH OF DSABS*/ 00244000
*        ELSE                          /*NO,THEN CURRENT TASK OPTION */ 00245000
*          DO;                         /*BUILD LIST OF DSABS WITH TCB*/ 00246000
         B     @RC00072                                         01S0108 00247000
@RF00072 DS    0H                                               01S0109 00248000
*/********************************************************************/ 00249000
*/* SEGMENT NAME - CUTSKSCH                                          */ 00250000
*/*                                                                  */ 00251000
*/* DESCRIPTIVE NAME - CURRENT TASK SEARCH                           */ 00252000
*/*                                                                  */ 00253000
*/* FUNCTION  - SEARCH FOR THOSE DSABS WHOSE TCB ADDRESS IS NOT IN   */ 00254000
*/*             THE DIRECT ANCESTRAL CHAIN OF THE CURRENT TCB, AND   */ 00255000
*/*             WHICH ARE ELIGIBLE FOR REMOVE IN-USE PROCESSING      */ 00256000
*/*                                                                  */ 00257000
*/* OPERATION -THIS SEGMENT SCANS THE DSAB CHAIN TWICE, ONCE TO      */ 00258000
*/*            DETERMINE THE NUMBER OF DSABS ELIGIBLE FOR REMOVE     */ 00259000
*/*            IN-USE; AND A SECOND TIME TO PUT THEIR ADDRESSES IN   */ 00260000
*/*            A LIST. ON ENTRY, DSABPTR POINTS TO                   */ 00261000
*/*            THE FIRST DSAB ON THE CHAIN, AN EMPTY CHAIN ALREADY   */ 00262000
*/*            HAVING BEEN CHECKED FOR. IF A DSAB IS ALREADY NOT IN- */ 00263000
*/*            USE, OR IS FOR A PRIVATE CATALOG, IT IS NOT ELIGIBLE. */ 00264000
*/*            FOR EACH OTHER DSAB A DIRECT UPWARD SCAN OF THE TCB   */ 00265000
*/*            CHAIN FROM THE CURRENT TCB TO THE INITIATOR'S TCB IS  */ 00266000
*/*            MADE. (IF THE INITIATOR'S TCB ADDRESS IN THE JSCB IS  */ 00267000
*/*            ZERO, THE SCAN WILL BE UP TO THE JOB STEP TCB.) IF THE*/ 00268000
*/*            DSAB'S TCB ADDRESS IS NOT FOUND IN THIS TCB SCAN,IT IS*/ 00269000
*/*            ELIGIBLE FOR REMOVE IN-USE PROCESSING. ONLY THE FIRST */ 00270000
*/*            MEMBER OF A CONCATENATED GROUP WILL BE LOOKED AT IN   */ 00271000
*/*            THE DSAB SCANS. IF AFTER THE FIRST SCAN THE COUNT OF  */ 00272000
*/*            DSABS IS GREATER THAN ZERO, A GETMAIN IS ISSUED TO    */ 00273000
*/*            GET CORE FOR A LIST OF PTRS TO THE DSABS. THEN DSABPTR*/ 00274000
*/*            IS RESET TO THE FIRST DSAB AND THE SECOND DSAB SCAN   */ 00275000
*/*            IS MADE, BUILDING THE LIST OF PTRS TO ELIGIBLE DSABS  */ 00276000
*/*                                                                  */ 00277000
*/* ENTRY -                                                          */ 00278000
*/*   INPUT DATA  - DSABPTR - POINTS TO 1ST DSAB ON CHAIN            */ 00279000
*/*                 DSQFRSTP - POINTS TO 1ST DSAB ON CHAIN           */ 00280000
*/*                 DSABCNT - ZERO ON ENTRY                          */ 00281000
*/*                 DSABLSTP- ZERO ON ENTRY                          */ 00282000
*/*                 TCBPTR  - POINTS TO CURRENT TCB                  */ 00283000
*/*                 JSCBTCBP- POINTS TO INITIATOR'S TCB (OR ZERO)    */ 00284000
*/*                                                                  */ 00285000
*/* EXIT  -                                                          */ 00286000
*/*   OUTPUT DATA - DSABCNT - NO. OF DSABS FOR REMOVE IN-USE, IF ANY */ 00287000
*/*                 DSABLSTP- POINTS TO LIST OF DSAB PTRS,IF ANY     */ 00288000
*/*                 DSABLIST- LIST OF DSABS, IF ANY                  */ 00289000
*/*                                                                  */ 00290000
*/********************************************************************/ 00291000
*IF JSCBTCBP ¬= 0 THEN                 /*IF INITR.'S TCB IS NONZERO  */ 00292000
         L     @10,@PC00001+8                                   02S0109 00293000
         L     @10,JSCBPTR(,@10)                                02S0109 00294000
         L     @10,JSCBTCBP(,@10)                               02S0109 00295000
         LTR   @10,@10                                          02S0109 00296000
         BZ    @RF00109                                         02S0109 00297000
*  TOPTCBP = JSCBTCBP;                 /*MAKE IT TOP TCB IN SCAN     */ 00298000
         LR    TOPTCBP,@10                                      02S0110 00299000
*ELSE                                  /*INITIATOR'S TCB PTR IS ZER0 */ 00300000
*  TOPTCBP = TCBJSTCB;                 /*MAKE JOB STEP TCB TOP ONE   */ 00301000
         B     @RC00109                                         02S0111 00302000
@RF00109 L     @10,@PC00001+8                                   02S0111 00303000
         L     @10,TCBPTR(,@10)                                 02S0111 00304000
         L     TOPTCBP,TCBJSTCB(,@10)                           02S0111 00305000
*RFY TCB BASED(WKTCBPTR);              /*RESET TCB MAPPING BASE PTR  */ 00306000
*                                                               02S0112 00307000
@RC00109 DS    0H                                               02S0113 00308000
*DO WHILE DSABPTR ¬= 0;                /*SCAN DSABS TO END OF CHAIN  */ 00309000
         B     @DE00113                                         02S0113 00310000
@DL00113 DS    0H                                               02S0114 00311000
*  IF (DSABNUSE = '1'B   &             /*IS DSAB IN-USE AND          */ 00312000
*      DSABCATL='0'B) THEN             /*NOT FOR A CATALOG ?         */ 00313000
         TM    DSABNUSE(DSABPTR),B'00000001'                    02S0114 00314000
         BNO   @RF00114                                         02S0114 00315000
         TM    DSABCATL(DSABPTR),B'00001000'                    02S0114 00316000
         BNZ   @RF00114                                         02S0114 00317000
*    DO;                               /*YES,SEE IF SHOULD PROCESS IT*/ 00318000
*      CUTSKSWS='';                    /*ZERO OUT LOOP CTL SWITCHES  */ 00319000
         MVI   CUTSKSWS,X'00'                                   02S0116 00320000
*      WKTCBPTR=TCBPTR;                /*START WITH CURRENT TCB      */ 00321000
*                                                               02S0117 00322000
         L     @10,@PC00001+8                                   02S0117 00323000
         L     WKTCBPTR,TCBPTR(,@10)                            02S0117 00324000
*      DO WHILE (TOP='0'B & FOUND='0'B); /*SCAN UP TCBS TO TOPTCBP      00325000
*                                        OR UNTIL TCB MATCH IS FOUND */ 00326000
         B     @DE00118                                         02S0118 00327000
@DL00118 DS    0H                                               02S0119 00328000
*        IF DSABTCBP = WKTCBPTR THEN   /*DOES DSAB HAVE THIS TCB ADDR*/ 00329000
         C     WKTCBPTR,DSABTCBP(,DSABPTR)                      02S0119 00330000
         BNE   @RF00119                                         02S0119 00331000
*          FOUND='1'B;                 /*YES,THEN MATCH IS FOUND     */ 00332000
         OI    FOUND,B'10000000'                                02S0120 00333000
*        ELSE                          /*NO,SEE IF AT TOP OF TCBS    */ 00334000
*          IF WKTCBPTR¬=TOPTCBP THEN   /*ARE WE AT TOP TCB           */ 00335000
         B     @RC00119                                         02S0121 00336000
@RF00119 CR    WKTCBPTR,TOPTCBP                                 02S0121 00337000
         BE    @RF00121                                         02S0121 00338000
*            WKTCBPTR=TCBOTC;          /*NO,POINT TO MOTHER TCB      */ 00339000
         L     WKTCBPTR,TCBOTC(,WKTCBPTR)                       02S0122 00340000
*          ELSE                        /*YES;AT TOP TCB              */ 00341000
*            TOP='1'B;                 /*GET OUT OF TCB SCAN         */ 00342000
         B     @RC00121                                         02S0123 00343000
@RF00121 OI    TOP,B'01000000'                                  02S0123 00344000
*      END;                            /*END SCAN OF TCB CHAIN       */ 00345000
*                                                               02S0124 00346000
@RC00121 DS    0H                                               02S0124 00347000
@RC00119 DS    0H                                               02S0124 00348000
@DE00118 TM    TOP,B'11000000'                                  02S0124 00349000
         BZ    @DL00118                                         02S0124 00350000
*      IF FOUND='0'B THEN              /*IF DSAB'S TCB WAS NOT FOUND */ 00351000
         TM    FOUND,B'10000000'                                02S0125 00352000
         BNZ   @RF00125                                         02S0125 00353000
*        DSABCNT=DSABCNT+1;            /*INCREMENT COUNT OF DSABS    */ 00354000
         LA    @10,1                                            02S0126 00355000
         AL    @10,DSABCNT                                      02S0126 00356000
         ST    @10,DSABCNT                                      02S0126 00357000
*      ELSE;                           /*ELSE DON'T REMOVE IN-USE    */ 00358000
@RF00125 DS    0H                                               02S0128 00359000
*    END;                              /*END DSAB IN-USE, NON CTLG   */ 00360000
*  ELSE;                               /*ALREADY NOT IN-USE OR CTLG  */ 00361000
@RF00114 DS    0H                                               02S0130 00362000
*  DSABPTR=DSABFCHN;                   /*POINT TO NEXT DSAB ON CHAIN */ 00363000
         L     DSABPTR,DSABFCHN(,DSABPTR)                       02S0130 00364000
*  DO WHILE (DSABPTR ¬= 0 &            /*SKIP TO END OF DSAB CHAIN   */ 00365000
*            TIOEDDNM(1) = ' ');       /*OR TO END OF GROUP IF DSAB IS  00366000
*                                        CONCATENATED TO PRIOR DSAB  */ 00367000
         B     @DE00131                                         02S0131 00368000
@DL00131 DS    0H                                               02S0132 00369000
*    DSABPTR=DSABFCHN;                 /*POINT TO NEXT DSAB IN CHAIN */ 00370000
         L     DSABPTR,DSABFCHN(,DSABPTR)                       02S0132 00371000
*  END;                                /*END IF IN A CONCAT GROUP    */ 00372000
@DE00131 LTR   DSABPTR,DSABPTR                                  02S0133 00373000
         BZ    @DC00131                                         02S0133 00374000
         L     @10,DSABTIOT(,DSABPTR)                           02S0133 00375000
         CLI   TIOEDDNM(@10),C' '                               02S0133 00376000
         BE    @DL00131                                         02S0133 00377000
@DC00131 DS    0H                                               02S0134 00378000
*END;                                  /*END 1ST SCAN OF DSABS       */ 00379000
*                                                               02S0134 00380000
@DE00113 SLR   @10,@10                                          02S0134 00381000
         CR    DSABPTR,@10                                      02S0134 00382000
         BNE   @DL00113                                         02S0134 00383000
*IF DSABCNT ¬= 0 THEN                  /*ARE THERE DSABS TO PROCESS  */ 00384000
         L     @04,DSABCNT                                      02S0135 00385000
         CR    @04,@10                                          02S0135 00386000
         BE    @RF00135                                         02S0135 00387000
*  DO;                                 /*YES, BUILD DSABPTR LIST     */ 00388000
*    R0 = DSABCNT*4;                   /*AMN'T. OF CORE NEEDED       */ 00389000
         L     @10,DSABCNT                                      02S0137 00390000
         SLA   @10,2                                            02S0137 00391000
         LR    R0,@10                                           02S0137 00392000
*    R0 = R0 | SCHDSUBP;               /*GET FROM CORRECT SUBPOOL    */ 00393000
         O     R0,@CF00073                                      02S0138 00394000
*    GEN (GETMAIN R,LV=(0))            /*GET CORE FOR DSAB PTRS LIST */ 00395000
*         SETS(R1) REFS(R0);                                    02S0139 00396000
         GETMAIN R,LV=(0)                                               00397000
*    DSABLSTP=R1;                      /*SAVE ADDR OF LIST           */ 00398000
         ST    R1,DSABLSTP                                      02S0140 00399000
*    DSABPTR=DSQFRSTP;                 /*POINT BACK TO FIRST DSAB    */ 00400000
         L     @10,@PC00001+8                                   02S0141 00401000
         L     @10,JSCBPTR(,@10)                                02S0141 00402000
         L     @10,JSCDSABQ(,@10)                               02S0141 00403000
         L     DSABPTR,DSQFRSTP(,@10)                           02S0141 00404000
*    LISTINDX=1;                       /*INIT INDEX OF DSAB PTR LIST */ 00405000
*                                                               02S0142 00406000
         LA    LISTINDX,1                                       02S0142 00407000
*    DO WHILE LISTINDX<=DSABCNT;       /*BUILD LIST OF DSAB PTRS     */ 00408000
         B     @DE00143                                         02S0143 00409000
@DL00143 DS    0H                                               02S0144 00410000
*      IF (DSABNUSE = '1'B   &         /*IS DSAB IN-USE AND          */ 00411000
*          DSABCATL='0'B) THEN         /*NOT FOR A CATALOG ?         */ 00412000
         TM    DSABNUSE(DSABPTR),B'00000001'                    02S0144 00413000
         BNO   @RF00144                                         02S0144 00414000
         TM    DSABCATL(DSABPTR),B'00001000'                    02S0144 00415000
         BNZ   @RF00144                                         02S0144 00416000
*        DO;                           /*YES,SEE IF SHOULD PROCESS IT*/ 00417000
*          CUTSKSWS='';                /*ZERO OUT LOOP CTL SWITCHES  */ 00418000
         MVI   CUTSKSWS,X'00'                                   02S0146 00419000
*          WKTCBPTR=TCBPTR;            /*START WITH CURRENT TCB      */ 00420000
*                                                               02S0147 00421000
         L     @10,@PC00001+8                                   02S0147 00422000
         L     WKTCBPTR,TCBPTR(,@10)                            02S0147 00423000
*          DO WHILE (TOP='0'B & FOUND='0'B);                    02S0148 00424000
         B     @DE00148                                         02S0148 00425000
@DL00148 DS    0H                                               02S0149 00426000
*                                      /*SCAN UP TCB CHAIN TO TOPTCB    00427000
*                                        OR UNTIL TCB MATCH IS FOUND */ 00428000
*            IF DSABTCBP=WKTCBPTR THEN /*DSAB HAVE THIS TCB ADDR?    */ 00429000
         C     WKTCBPTR,DSABTCBP(,DSABPTR)                      02S0149 00430000
         BNE   @RF00149                                         02S0149 00431000
*              FOUND='1'B;             /*YES,THEN MATCH IS FOUND     */ 00432000
         OI    FOUND,B'10000000'                                02S0150 00433000
*            ELSE                      /*NO,SEE IF AT TOP OF TCBS    */ 00434000
*              IF WKTCBPTR¬=TOPTCBP THEN   /*ARE WE AT TOP TCB ?     */ 00435000
         B     @RC00149                                         02S0151 00436000
@RF00149 CR    WKTCBPTR,TOPTCBP                                 02S0151 00437000
         BE    @RF00151                                         02S0151 00438000
*                WKTCBPTR=TCBOTC;      /*NO; POINT TO MOTHER TCB     */ 00439000
         L     WKTCBPTR,TCBOTC(,WKTCBPTR)                       02S0152 00440000
*              ELSE                    /*YES,AT TOP TCB              */ 00441000
*                TOP='1'B;             /*GET OUT OF TCB SCAN         */ 00442000
         B     @RC00151                                         02S0153 00443000
@RF00151 OI    TOP,B'01000000'                                  02S0153 00444000
*          END;                        /*END SCAN OF TCB CHAIN       */ 00445000
*                                                               02S0154 00446000
@RC00151 DS    0H                                               02S0154 00447000
@RC00149 DS    0H                                               02S0154 00448000
@DE00148 TM    TOP,B'11000000'                                  02S0154 00449000
         BZ    @DL00148                                         02S0154 00450000
*          IF FOUND = '0'B THEN        /*IF DSAB'S TCB WAS NOT FOUND */ 00451000
         TM    FOUND,B'10000000'                                02S0155 00452000
         BNZ   @RF00155                                         02S0155 00453000
*            DO;                       /*THEN REMOVE IN-USE FOR DSAB */ 00454000
*              DSABLIST(LISTINDX)=DSABPTR; /*ADD DSAB TO LIST        */ 00455000
         LR    @10,LISTINDX                                     02S0157 00456000
         SLA   @10,2                                            02S0157 00457000
         L     @02,DSABLSTP                                     02S0157 00458000
         AL    @02,@CF01315                                     02S0157 00459000
         ST    DSABPTR,DSABLIST(@10,@02)                        02S0157 00460000
*              LISTINDX=LISTINDX+1;    /*INCREMENT INDEX INTO LIST   */ 00461000
         AL    LISTINDX,@CF00064                                02S0158 00462000
*            END;                      /*END IF DSAB TO BE PROCESSED */ 00463000
*          ELSE;                       /*ELSE DON'T REMOVE IN-USE    */ 00464000
@RF00155 DS    0H                                               02S0161 00465000
*        END;                          /*END DSAB IN-USE, NON CTLG   */ 00466000
*      ELSE;                           /*ALREADY NOT IN-USE OR CTLG  */ 00467000
@RF00144 DS    0H                                               02S0163 00468000
*      DSABPTR=DSABFCHN;               /*POINT TO NEXT DSAB ON CHAIN */ 00469000
         L     DSABPTR,DSABFCHN(,DSABPTR)                       02S0163 00470000
*      DO WHILE (DSABPTR ¬= 0 &        /*SKIP TO END OF DSAB CHAIN   */ 00471000
*                TIOEDDNM(1) = ' ');   /*OR TO END OF GROUP IF DSAB IS  00472000
*                                        CONCATENATED TO PRIOR DSAB  */ 00473000
         B     @DE00164                                         02S0164 00474000
@DL00164 DS    0H                                               02S0165 00475000
*        DSABPTR=DSABFCHN;             /*POINT TO NEXT DSAB IN CHAIN */ 00476000
         L     DSABPTR,DSABFCHN(,DSABPTR)                       02S0165 00477000
*      END;                            /*END IF IN CONCAT GROUP      */ 00478000
@DE00164 LTR   DSABPTR,DSABPTR                                  02S0166 00479000
         BZ    @DC00164                                         02S0166 00480000
         L     @10,DSABTIOT(,DSABPTR)                           02S0166 00481000
         CLI   TIOEDDNM(@10),C' '                               02S0166 00482000
         BE    @DL00164                                         02S0166 00483000
@DC00164 DS    0H                                               02S0167 00484000
*    END;                              /*END OF LIST BUILD LOOP      */ 00485000
*                                                               02S0167 00486000
@DE00143 C     LISTINDX,DSABCNT                                 02S0167 00487000
         BNH   @DL00143                                         02S0167 00488000
*  END;                                /*END OF DSABS TO BE PROCESSED*/ 00489000
*ELSE;                                 /*NO DSABS FOR REMOVE IN-USE  */ 00490000
@RF00135 DS    0H                                               02S0170 00491000
*RFY TCB BASED(TCBPTR);                /*RESET TCB MAPPING BASE PTR  */ 00492000
*                                      /*OF CURRENT TCB              */ 00493000
*          END;                        /*END CURRENT TASK DSAB SEARCH*/ 00494000
*        IF DSABLSTP ¬= 0  THEN        /*IF DSAB LIST IS NOT EMPTY   */ 00495000
@RC00072 L     @10,DSABLSTP                                     01S0172 00496000
         LTR   @10,@10                                          01S0172 00497000
         BZ    @RF00172                                         01S0172 00498000
*          DO;                         /*THEN REMOVE IN-USE PROCESS  */ 00499000
*            CALL IEFDB481(DSABLSTP,DSABCNT,RSNCODE,LASTEPAP,   01S0174 00500000
*                          CTLBLKPS,DEPARMS,SMFPARMS);          01S0174 00501000
         LA    @10,DSABLSTP                                     01S0174 00502000
         ST    @10,@AL00001                                     01S0174 00503000
         LA    @10,DSABCNT                                      01S0174 00504000
         ST    @10,@AL00001+4                                   01S0174 00505000
         L     @10,@PC00001+4                                   01S0174 00506000
         ST    @10,@AL00001+8                                   01S0174 00507000
         L     @10,@PC00001+20                                  01S0174 00508000
         ST    @10,@AL00001+12                                  01S0174 00509000
         L     @10,@PC00001+8                                   01S0174 00510000
         ST    @10,@AL00001+16                                  01S0174 00511000
         L     @10,@PC00001+16                                  01S0174 00512000
         ST    @10,@AL00001+20                                  01S0174 00513000
         L     @10,@PC00001+24                                  01S0174 00514000
         ST    @10,@AL00001+24                                  01S0174 00515000
         L     @15,@CV00075                                     01S0174 00516000
         LA    @01,@AL00001                                     01S0174 00517000
         BALR  @14,@15                                          01S0174 00518000
*                                      /*CALL REMOVE IN-USE PROCESSOR   00519000
*                                                            @ZA02706*/ 00520000
*            R0 = DSABCNT*4;           /*GET SIZE OF CORE TO FREE    */ 00521000
         L     R0,DSABCNT                                       01S0175 00522000
         SLA   R0,2                                             01S0175 00523000
*            R0 = R0 | SCHDSUBP;       /*FREE FROM CORRECT SUBPOOL   */ 00524000
         O     R0,@CF00073                                      01S0176 00525000
*            GEN (FREEMAIN R,LV=(0),A=DSABLSTP)                 01S0177 00526000
*                 REFS(DSABLSTP);      /*FREE DSAB PTRS. LIST        */ 00527000
         FREEMAIN R,LV=(0),A=DSABLSTP                                   00528000
*          END;                        /*END DSAB PTR LIST NOT EMPTY */ 00529000
*        ELSE;                         /*NO DSABS TO PROCESS         */ 00530000
@RF00172 DS    0H                                               01S0180 00531000
*      END;                            /*END THERE ARE DSABS IN CHAIN*/ 00532000
*    ELSE;                             /*NO DSABS IN CHAIN;NO PROCESS*/ 00533000
@RF00067 DS    0H                                               01S0182 00534000
*ELSE;                                 /*ERROR IN SYNTAX CHECKER     */ 00535000
@RF00064 DS    0H                                               01S0183 00536000
*RETURN CODE(0);                       /*RETURN TO CALLER            */ 00537000
@RC00064 L     @13,4(,@13)                                      01S0183 00538000
         L     @00,@SIZDATD                                     01S0183 00539000
         LR    @01,@11                                          01S0183 00540000
         FSPACE   R,LV=(0),A=(1)                                        00541000
         SLR   @15,@15                                          01S0183 00542000
         L     @14,12(,@13)                                     01S0183 00543000
         LM    @00,@12,20(@13)                                  01S0183 00544000
         BR    @14                                              01S0183 00545000
*END IEFDB480                                                   01S0184 00546000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00547000
*/*%INCLUDE SYSLIB  (RIUCTLSP)                                        * 00548000
*/*%INCLUDE SYSLIB  (RIUCTLDT)                                        * 00549000
*/*%INCLUDE SYSLIB  (IEFZB4D7)                                        * 00550000
*/*%INCLUDE SYSLIB  (IEFZB4D9)                                        * 00551000
*/*%INCLUDE SYSLIB  (IEFZB4D1)                                        * 00552000
*/*%INCLUDE SYSLIB  (IEFZB4D2)                                        * 00553000
*/*%INCLUDE SYSLIB  (IHAQDB  )                                        * 00554000
*/*%INCLUDE SYSLIB  (IEFZB4D5)                                        * 00555000
*/*%INCLUDE SYSLIB  (IHADSAB )                                        * 00556000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                        * 00557000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                        * 00558000
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                        * 00559000
*/*%INCLUDE SYSLIB  (IEFZB4DA)                                        * 00560000
*/*%INCLUDE SYSLIB  (TCBADSCH)                                        * 00561000
*/*%INCLUDE SYSLIB  (TCBADSPC)                                        * 00562000
*/*%INCLUDE SYSLIB  (CUTSKSCH)                                        * 00563000
*/*%INCLUDE SYSLIB  (CUTSKSPC)                                        * 00564000
*;                                                              01S0184 00565000
@DATA    DS    0H                                                       00566000
@CH01178 DC    XL2'0388'                                                00567000
@DATD    DSECT                                                          00568000
         DS    0F                                                       00569000
@SA00001 DS    18F                                                      00570000
@PC00001 DS    7F                                                       00571000
@AL00001 DS    7A                                                       00572000
@TF00001 DS    F                                                        00573000
@TF00002 DS    F                                                        00574000
@TF00003 DS    F                                                        00575000
@TF00004 DS    F                                                        00576000
IEFDB480 CSECT                                                          00577000
         DS    0F                                                       00578000
@CF00064 DC    F'1'                                                     00579000
@CF01315 DC    F'-4'                                                    00580000
@CF00073 DC    XL4'E6000000'                                            00581000
@DATD    DSECT                                                          00582000
         DS    0D                                                       00583000
DSABCNT  DS    F                                                        00584000
DSABLSTP DS    A                                                        00585000
TXTUFLDP DS    A                                                        00586000
QDBPTR   DS    A                                                        00587000
TIOTPTR  DS    A                                                        00588000
DUPMASK  DS    CL1                                                      00589000
MUTEXMSK DS    CL1                                                      00590000
         DS    CL2                                                      00591000
RIUKYTAB DS    CL8                                                      00592000
         ORG   RIUKYTAB                                                 00593000
TCBADTUP DS    AL4                                                      00594000
CUTSKTUP DS    AL4                                                      00595000
         ORG   RIUKYTAB+8                                               00596000
CUTSKSWS DS    BL1                                                      00597000
         ORG   CUTSKSWS                                                 00598000
FOUND    DS    BL1                                                      00599000
TOP      EQU   CUTSKSWS+0                                               00600000
@NM00001 EQU   CUTSKSWS+0                                               00601000
         ORG   CUTSKSWS+1                                               00602000
IEFDB480 CSECT                                                          00603000
         DS    0F                                                       00604000
@SIZDATD DC    AL1(230)                                                 00605000
         DC    AL3(@ENDDATD-@DATD)                                      00606000
@CV00074 DC    V(IEFDB4FF)                                              00607000
@CV00075 DC    V(IEFDB481)                                              00608000
         DS    0D                                                       00609000
RIUKYDIC DS    CL33                                                     00610000
         ORG   RIUKYDIC                                                 00611000
KYTCBAD  DS    CL15                                                     00612000
         ORG   KYTCBAD                                                  00613000
TCBADLEN DC    AL1(15)                                                  00614000
TCBADHEX DC    X'0001'                                                  00615000
TCBADMXL DC    X'0004'                                                  00616000
TCBADMNL DC    X'0004'                                                  00617000
TCBADMXN DC    X'0001'                                                  00618000
TCBADMNN DC    X'0001'                                                  00619000
TCBADKTB DC    X'0000'                                                  00620000
TCBADMEX DS    CL2                                                      00621000
         ORG   TCBADMEX                                                 00622000
TCBADME1 DC    X'0002'                                                  00623000
         ORG   RIUKYDIC+15                                              00624000
KYCURTSK DS    CL15                                                     00625000
         ORG   KYCURTSK                                                 00626000
CUTSKLEN DC    AL1(15)                                                  00627000
CUTSKHEX DC    X'0002'                                                  00628000
CUTSKMXL DC    X'0000'                                                  00629000
CUTSKMNL DC    X'0000'                                                  00630000
CUTSKMXN DC    X'0000'                                                  00631000
CUTSKMNN DC    X'0000'                                                  00632000
CUTSKKTB DC    X'0004'                                                  00633000
CUTSKMEX DS    CL2                                                      00634000
         ORG   CUTSKMEX                                                 00635000
CUTSKME1 DC    X'0001'                                                  00636000
         ORG   RIUKYDIC+30                                              00637000
KYENDDCT DS    CL3                                                      00638000
         ORG   KYENDDCT                                                 00639000
ENDDCLEN DC    AL1(3)                                                   00640000
ENDDCHEX DC    X'FFFF'                                                  00641000
         ORG   RIUKYDIC+33                                              00642000
IEFDB480 CSECT                                                          00643000
         DS   0H                                                        00644000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   00645000
@DATD    DSECT                                                          00646000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00647000
@ENDDATD EQU   *                                                        00648000
IEFDB480 CSECT                                                          00649000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00650000
@01      EQU   01                                                       00651000
@02      EQU   02                                                       00652000
@03      EQU   03                                                       00653000
@04      EQU   04                                                       00654000
@05      EQU   05                                                       00655000
@06      EQU   06                                                       00656000
@07      EQU   07                                                       00657000
@08      EQU   08                                                       00658000
@09      EQU   09                                                       00659000
@10      EQU   10                                                       00660000
@11      EQU   11                                                       00661000
@12      EQU   12                                                       00662000
@13      EQU   13                                                       00663000
@14      EQU   14                                                       00664000
@15      EQU   15                                                       00665000
TOPTCBP  EQU   @05                                                      00666000
WKTCBPTR EQU   @02                                                      00667000
LISTINDX EQU   @04                                                      00668000
DSABPTR  EQU   @03                                                      00669000
R0       EQU   @00                                                      00670000
R1       EQU   @01                                                      00671000
DSABLIST EQU   0                                                        00672000
TXTUPLST EQU   0                                                        00673000
TXTUNITP EQU   TXTUPLST                                                 00674000
TXTUPELM EQU   0                                                        00675000
TXTPLENT EQU   TXTUPELM                                                 00676000
TEXTUNIT EQU   0                                                        00677000
TEXTUENT EQU   TEXTUNIT+4                                               00678000
TEXTUPAR EQU   TEXTUENT+2                                               00679000
TEXTUFLD EQU   0                                                        00680000
QDB      EQU   0                                                        00681000
DSAB     EQU   0                                                        00682000
DSABFCHN EQU   DSAB+4                                                   00683000
DSABTIOT EQU   DSAB+16                                                  00684000
DSABGIDP EQU   DSAB+24                                                  00685000
DSABANMP EQU   DSAB+28                                                  00686000
DSABORG  EQU   DSAB+32                                                  00687000
DSABORG1 EQU   DSABORG                                                  00688000
DSABORG2 EQU   DSABORG+1                                                00689000
DSABFLG1 EQU   DSAB+34                                                  00690000
DSABNUSE EQU   DSABFLG1                                                 00691000
DSABFLG2 EQU   DSAB+35                                                  00692000
DSABFLG3 EQU   DSAB+36                                                  00693000
DSABCATL EQU   DSABFLG3                                                 00694000
DSABFLG4 EQU   DSAB+37                                                  00695000
DSABTCBP EQU   DSAB+40                                                  00696000
DSABANMI EQU   0                                                        00697000
DSABGIDL EQU   0                                                        00698000
IEZJSCB  EQU   0                                                        00699000
JSCBSEC1 EQU   IEZJSCB+188                                              00700000
JSCHPCE  EQU   JSCBSEC1+4                                               00701000
JSCBTCBP EQU   JSCBSEC1+20                                              00702000
JSCBDCB  EQU   JSCBSEC1+36                                              00703000
JSCBOPTS EQU   JSCBSEC1+48                                              00704000
JSCBSWT1 EQU   JSCBSEC1+55                                              00705000
JSCBWTP  EQU   JSCBSEC1+64                                              00706000
JSCBWTFG EQU   JSCBWTP                                                  00707000
JSCBEND1 EQU   IEZJSCB+260                                              00708000
TCBFIX   EQU   0                                                        00709000
TCBFRS   EQU   TCBFIX                                                   00710000
TCB      EQU   0                                                        00711000
TCBPIE   EQU   TCB+4                                                    00712000
TCBPMASK EQU   TCBPIE                                                   00713000
TCBCMP   EQU   TCB+16                                                   00714000
TCBCMPF  EQU   TCBCMP                                                   00715000
TCBCPP   EQU   TCBCMPF                                                  00716000
TCBSTCC  EQU   TCBCMPF                                                  00717000
TCBCDBL  EQU   TCBCMPF                                                  00718000
TCBCWTO  EQU   TCBCMPF                                                  00719000
TCBCIND  EQU   TCBCMPF                                                  00720000
TCBCMSG  EQU   TCBCMPF                                                  00721000
TCBTRN   EQU   TCB+20                                                   00722000
TCBABF   EQU   TCBTRN                                                   00723000
TCBMSS   EQU   TCB+24                                                   00724000
TCBPKF   EQU   TCB+28                                                   00725000
TCBFLGS  EQU   TCB+29                                                   00726000
TCBFLGS1 EQU   TCBFLGS                                                  00727000
TCBFLGS2 EQU   TCBFLGS+1                                                00728000
TCBFLGS3 EQU   TCBFLGS+2                                                00729000
TCBFLGS4 EQU   TCBFLGS+3                                                00730000
TCBFLGS5 EQU   TCBFLGS+4                                                00731000
TCBABWF  EQU   TCBFLGS5                                                 00732000
TCBJPQ   EQU   TCB+44                                                   00733000
TCBPURGE EQU   TCBJPQ                                                   00734000
TCBGRS   EQU   TCB+48                                                   00735000
TCBFSA   EQU   TCB+112                                                  00736000
TCBTME   EQU   TCB+120                                                  00737000
TCBJSTCB EQU   TCB+124                                                  00738000
TCBOTC   EQU   TCB+132                                                  00739000
TCBTSFLG EQU   TCB+148                                                  00740000
TCBTSTSK EQU   TCBTSFLG                                                 00741000
TCBSTAB  EQU   TCB+160                                                  00742000
TCBNSTAE EQU   TCBSTAB                                                  00743000
TCBTCT   EQU   TCB+164                                                  00744000
TCBTCTGF EQU   TCBTCT                                                   00745000
TCBSCNDY EQU   TCB+172                                                  00746000
TCBNDSP  EQU   TCBSCNDY                                                 00747000
TCBNDSP1 EQU   TCBNDSP+1                                                00748000
TCBNDSP2 EQU   TCBNDSP+2                                                00749000
TCBNDSP3 EQU   TCBNDSP+3                                                00750000
TCBJSCB  EQU   TCB+180                                                  00751000
TCBRECDE EQU   TCBJSCB                                                  00752000
TCBEXT1  EQU   TCB+196                                                  00753000
TCBBITS  EQU   TCB+200                                                  00754000
TCBNDSP4 EQU   TCBBITS                                                  00755000
TCBNDSP5 EQU   TCBBITS+1                                                00756000
TCBFLGS6 EQU   TCBBITS+2                                                00757000
TCBFLGS7 EQU   TCBBITS+3                                                00758000
TCBDAR   EQU   TCB+204                                                  00759000
TCBDARC  EQU   TCBDAR                                                   00760000
TCBEXT2  EQU   TCB+208                                                  00761000
TCBFOE   EQU   TCB+244                                                  00762000
TCBESTAE EQU   TCB+264                                                  00763000
TCBESTRM EQU   TCBESTAE+1                                               00764000
TCBFBYT1 EQU   TCB+276                                                  00765000
TCBFBYT2 EQU   TCB+277                                                  00766000
TCBRV124 EQU   TCB+278                                                  00767000
TCBRV133 EQU   TCB+279                                                  00768000
TCBXTNT2 EQU   0                                                        00769000
TCBGTF   EQU   TCBXTNT2                                                 00770000
TCBTFLG  EQU   TCBGTF                                                   00771000
TCBRV146 EQU   TCBXTNT2+28                                              00772000
TCBRV155 EQU   TCBXTNT2+29                                              00773000
TCBRV164 EQU   TCBXTNT2+30                                              00774000
TCBRV173 EQU   TCBXTNT2+31                                              00775000
TIOT1    EQU   0                                                        00776000
TIOENTRY EQU   0                                                        00777000
TIOESTTA EQU   TIOENTRY+1                                               00778000
TIOERLOC EQU   TIOENTRY+2                                               00779000
TIOELINK EQU   TIOERLOC+1                                               00780000
TIOESYOT EQU   TIOELINK                                                 00781000
TIOEDDNM EQU   TIOENTRY+4                                               00782000
TIOESTTC EQU   TIOENTRY+15                                              00783000
TIOESTTB EQU   TIOENTRY+16                                              00784000
POOLSTAR EQU   TIOENTRY+20                                              00785000
S99TXTPP EQU   0                                                        00786000
RSNCODE  EQU   0                                                        00787000
ERRCODE  EQU   RSNCODE                                                  00788000
CTLBLKPS EQU   0                                                        00789000
JSCBPTR  EQU   CTLBLKPS                                                 00790000
TCBPTR   EQU   CTLBLKPS+8                                               00791000
ALFNCMAP EQU   0                                                        00792000
INPUTSW  EQU   ALFNCMAP                                                 00793000
PROCESSW EQU   ALFNCMAP+6                                               00794000
ERRPROSW EQU   PROCESSW                                                 00795000
DEPARMS  EQU   0                                                        00796000
DENQRETN EQU   DEPARMS+232                                              00797000
DEDMYEPA EQU   DEPARMS+240                                              00798000
DEDMYAS  EQU   DEPARMS+260                                              00799000
LASTEPAP EQU   0                                                        00800000
SMFPARMS EQU   0                                                        00801000
DSABQDB  EQU   QDB                                                      00802000
DSQFRSTP EQU   DSABQDB+12                                               00803000
DSQLASTP EQU   DSABQDB+16                                               00804000
JSCBSEC2 EQU   JSCBEND1                                                 00805000
JSCBSEC3 EQU   JSCBEND1                                                 00806000
JSCBJCT  EQU   JSCBSEC3                                                 00807000
JSCBJCTA EQU   JSCBJCT+1                                                00808000
JSCBASID EQU   JSCBSEC3+8                                               00809000
JSCBJNL  EQU   JSCBSEC3+28                                              00810000
JSCBJJSB EQU   JSCBJNL                                                  00811000
JSCBSUB  EQU   JSCBSEC3+40                                              00812000
JSCDSABQ EQU   JSCBSEC3+60                                              00813000
JSCSCT   EQU   JSCBSEC3+68                                              00814000
JSCRSV35 EQU   JSCBSEC3+96                                              00815000
JSCRSV36 EQU   JSCRSV35                                                 00816000
JSCRSV37 EQU   JSCRSV35+2                                               00817000
JSCRSV45 EQU   JSCBSEC3+112                                             00818000
JSCRSV46 EQU   JSCRSV45                                                 00819000
JSCRSV47 EQU   JSCRSV45+2                                               00820000
TIOEDEVE EQU   TIOESTTB                                                 00821000
TIOSTTB  EQU   TIOEDEVE                                                 00822000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00823000
TIOUCBP  EQU   TIOEDEVE+1                                               00824000
TIOVERF  EQU   TIOSTTB                                                  00825000
TIOUNLD  EQU   TIOSTTB                                                  00826000
TIOMNTD  EQU   TIOSTTB                                                  00827000
TIOSETU  EQU   TIOSTTB                                                  00828000
TIOVLSR  EQU   TIOSTTB                                                  00829000
TIOPVIO  EQU   TIOSTTB                                                  00830000
TIOREQD  EQU   TIOSTTB                                                  00831000
TIOUSED  EQU   TIOSTTB                                                  00832000
JSCBEND3 EQU   JSCBSEC3+120                                             00833000
JSCRSV52 EQU   JSCBSEC3+116                                             00834000
JSCRSV51 EQU   JSCRSV47+1                                               00835000
JSCRSV50 EQU   JSCRSV47                                                 00836000
JSCRSV49 EQU   JSCRSV46+1                                               00837000
JSCRSV48 EQU   JSCRSV46                                                 00838000
JSCRSV44 EQU   JSCBSEC3+108                                             00839000
JSCRSV43 EQU   JSCBSEC3+104                                             00840000
JSCRSV42 EQU   JSCBSEC3+100                                             00841000
JSCRSV41 EQU   JSCRSV37+1                                               00842000
JSCRSV40 EQU   JSCRSV37                                                 00843000
JSCRSV39 EQU   JSCRSV36+1                                               00844000
JSCRSV38 EQU   JSCRSV36                                                 00845000
JSCBUFPT EQU   JSCBSEC3+92                                              00846000
JSCBACT  EQU   JSCBSEC3+88                                              00847000
JSCBSWSP EQU   JSCBSEC3+87                                              00848000
JSCRSV33 EQU   JSCBSEC3+86                                              00849000
JSCDDNUM EQU   JSCBSEC3+84                                              00850000
JSCRSV53 EQU   JSCBSEC3+82                                              00851000
JSCDDNNO EQU   JSCBSEC3+80                                              00852000
JSCBVATA EQU   JSCBSEC3+76                                              00853000
JSCTMCOR EQU   JSCBSEC3+72                                              00854000
JSCSCTP  EQU   JSCSCT+1                                                 00855000
JSCRSV55 EQU   JSCSCT                                                   00856000
JSCRSV54 EQU   JSCBSEC3+64                                              00857000
JSCBSSIB EQU   JSCBSEC3+56                                              00858000
JSCBFRBA EQU   JSCBSEC3+48                                              00859000
JSCRSV28 EQU   JSCBSEC3+46                                              00860000
JSCBSONO EQU   JSCBSEC3+44                                              00861000
JSCBSUBA EQU   JSCBSUB+1                                                00862000
JSCRSV31 EQU   JSCBSUB                                                  00863000
JSCBSMLR EQU   JSCBSEC3+36                                              00864000
JSCBJNLR EQU   JSCBSEC3+32                                              00865000
JSCBJNLA EQU   JSCBJNL+1                                                00866000
JSCBJSBT EQU   JSCBJJSB                                                 00867000
JSCBJSBX EQU   JSCBJJSB                                                 00868000
JSCBJSBA EQU   JSCBJJSB                                                 00869000
JSCBJSBI EQU   JSCBJJSB                                                 00870000
@NM00018 EQU   JSCBJJSB                                                 00871000
JSCBJNLE EQU   JSCBJJSB                                                 00872000
JSCBJNLF EQU   JSCBJJSB                                                 00873000
JSCBJNLN EQU   JSCBJJSB                                                 00874000
@NM00017 EQU   JSCBSEC3+24                                              00875000
JSCBJRBA EQU   JSCBSEC3+16                                              00876000
JSCBIECB EQU   JSCBSEC3+12                                              00877000
JSCRSV25 EQU   JSCBSEC3+10                                              00878000
JSCBTJID EQU   JSCBASID                                                 00879000
JSCBPSCB EQU   JSCBSEC3+4                                               00880000
JSCJCTP  EQU   JSCBJCTA                                                 00881000
JSCRSV24 EQU   JSCBJCT                                                  00882000
JSCBEND2 EQU   JSCBSEC2                                                 00883000
@NM00009 EQU   DSABQDB+24                                               00884000
DSQBDSP  EQU   DSABQDB+22                                               00885000
DSQFDSP  EQU   DSABQDB+20                                               00886000
DSQBADFC EQU   DSQLASTP                                                 00887000
DSQBADBC EQU   DSQFRSTP                                                 00888000
DSQNELMS EQU   DSABQDB+8                                                00889000
DSQDBLN  EQU   DSABQDB+6                                                00890000
DSQATTRS EQU   DSABQDB+4                                                00891000
DSQDBID  EQU   DSABQDB                                                  00892000
SMFBUFLP EQU   SMFPARMS+4                                               00893000
SMFBUF1P EQU   SMFPARMS                                                 00894000
@NM00008 EQU   DEPARMS+304                                              00895000
DETCTIOL EQU   DEPARMS+300                                              00896000
DETCTIOP EQU   DEPARMS+296                                              00897000
DETDQLST EQU   DEPARMS+280                                              00898000
DEALASTP EQU   DEPARMS+276                                              00899000
DEASGNP  EQU   DEDMYAS+12                                               00900000
@NM00007 EQU   DEDMYAS                                                  00901000
DEWLASTP EQU   DEPARMS+256                                              00902000
DEWRITP  EQU   DEDMYEPA+12                                              00903000
@NM00006 EQU   DEDMYEPA                                                 00904000
DEDSNQRC EQU   DENQRETN+4                                               00905000
DEDSNQEN EQU   DENQRETN                                                 00906000
DECPYLEN EQU   DEPARMS+228                                              00907000
DECPYLOC EQU   DEPARMS+224                                              00908000
DEJSCB   EQU   DEPARMS+220                                              00909000
DESCT    EQU   DEPARMS+216                                              00910000
DEJCT    EQU   DEPARMS+212                                              00911000
DESIOT   EQU   DEPARMS+208                                              00912000
DETCB    EQU   DEPARMS+204                                              00913000
DEALFMAP EQU   DEPARMS+200                                              00914000
DECORE   EQU   DEPARMS                                                  00915000
@NM00005 EQU   PROCESSW+1                                               00916000
HSKPDQSW EQU   PROCESSW+1                                               00917000
DISMSGSW EQU   PROCESSW+1                                               00918000
USERERSW EQU   PROCESSW+1                                               00919000
EPALSISW EQU   PROCESSW+1                                               00920000
EPASCTSW EQU   PROCESSW+1                                               00921000
EPAJCTSW EQU   PROCESSW                                                 00922000
FRRPERSW EQU   PROCESSW                                                 00923000
DCBSPCSW EQU   PROCESSW                                                 00924000
NQEXCLSW EQU   PROCESSW                                                 00925000
UNALOCSW EQU   ERRPROSW                                                 00926000
DEQDSNSW EQU   ERRPROSW                                                 00927000
COPYSW   EQU   PROCESSW                                                 00928000
@NM00004 EQU   PROCESSW                                                 00929000
@NM00003 EQU   INPUTSW+3                                                00930000
PCATINIT EQU   INPUTSW+3                                                00931000
UNITDEVT EQU   INPUTSW+3                                                00932000
MOUNTSW  EQU   INPUTSW+2                                                00933000
CATLOGSW EQU   INPUTSW+2                                                00934000
TIOTNQSW EQU   INPUTSW+2                                                00935000
OFFLINSW EQU   INPUTSW+2                                                00936000
WTUNTSW  EQU   INPUTSW+2                                                00937000
NORESSW  EQU   INPUTSW+2                                                00938000
WTDSNSW  EQU   INPUTSW+2                                                00939000
WTVOLSW  EQU   INPUTSW+2                                                00940000
@NM00002 EQU   INPUTSW                                                  00941000
JOBRLSYS EQU   INPUTSW                                                  00942000
NOMONTSW EQU   INPUTSW                                                  00943000
NOCNVTSW EQU   INPUTSW                                                  00944000
ONCNVTSW EQU   INPUTSW                                                  00945000
SCTPTR   EQU   CTLBLKPS+16                                              00946000
JCTPTR   EQU   CTLBLKPS+12                                              00947000
ASCBPTR  EQU   CTLBLKPS+4                                               00948000
INFOCODE EQU   RSNCODE+2                                                00949000
TIOTFEND EQU   POOLSTAR+16                                              00950000
TIOPSLOT EQU   POOLSTAR+13                                              00951000
TIOPSTTB EQU   POOLSTAR+12                                              00952000
TIOPPOOL EQU   POOLSTAR+4                                               00953000
TIOPNSRT EQU   POOLSTAR+3                                               00954000
@NM00024 EQU   POOLSTAR+2                                               00955000
TIOPNSLT EQU   POOLSTAR+1                                               00956000
@NM00023 EQU   POOLSTAR                                                 00957000
TIOEFSRT EQU   TIOENTRY+17                                              00958000
TIOSVERF EQU   TIOESTTB                                                 00959000
TIOSUNLD EQU   TIOESTTB                                                 00960000
TIOSMNTD EQU   TIOESTTB                                                 00961000
TIOSSETU EQU   TIOESTTB                                                 00962000
TIOSVLSR EQU   TIOESTTB                                                 00963000
TIOSPVIO EQU   TIOESTTB                                                 00964000
TIOSREQD EQU   TIOESTTB                                                 00965000
TIOSUSED EQU   TIOESTTB                                                 00966000
TIOSBALS EQU   TIOESTTC                                                 00967000
TIOSBALP EQU   TIOESTTC                                                 00968000
TIOSVOLS EQU   TIOESTTC                                                 00969000
TIOSVOLP EQU   TIOESTTC                                                 00970000
TIOSAFFS EQU   TIOESTTC                                                 00971000
TIOSAFFP EQU   TIOESTTC                                                 00972000
TIOSDEFR EQU   TIOESTTC                                                 00973000
TIOSDKCR EQU   TIOESTTC                                                 00974000
TIOEJFCB EQU   TIOENTRY+12                                              00975000
TIOTREM  EQU   TIOELINK                                                 00976000
TIOESSDS EQU   TIOESYOT                                                 00977000
TIOESYIN EQU   TIOELINK                                                 00978000
TIOEQNAM EQU   TIOELINK                                                 00979000
TIOEDYNM EQU   TIOELINK                                                 00980000
TIOTTERM EQU   TIOELINK                                                 00981000
TIOTRV01 EQU   TIOELINK                                                 00982000
TIOSYOUT EQU   TIOELINK                                                 00983000
TIOEWTCT EQU   TIOERLOC                                                 00984000
TIOSDSP2 EQU   TIOESTTA                                                 00985000
TIOSDSP1 EQU   TIOESTTA                                                 00986000
TIOSLABL EQU   TIOESTTA                                                 00987000
TIOSDADS EQU   TIOESTTA                                                 00988000
TIOSJBLB EQU   TIOESTTA                                                 00989000
TIOSPLTS EQU   TIOESTTA                                                 00990000
TIOSPLTP EQU   TIOESTTA                                                 00991000
TIOSLTYP EQU   TIOESTTA                                                 00992000
TIOELNGH EQU   TIOENTRY                                                 00993000
TIOCSTEP EQU   TIOT1+8                                                  00994000
TIOCNJOB EQU   TIOT1                                                    00995000
@NM00022 EQU   TCBXTNT2+32                                              00996000
TCBRV181 EQU   TCBRV173                                                 00997000
TCBRV180 EQU   TCBRV173                                                 00998000
TCBRV179 EQU   TCBRV173                                                 00999000
TCBRV178 EQU   TCBRV173                                                 01000000
TCBRV177 EQU   TCBRV173                                                 01001000
TCBRV176 EQU   TCBRV173                                                 01002000
TCBRV175 EQU   TCBRV173                                                 01003000
TCBRV174 EQU   TCBRV173                                                 01004000
TCBRV172 EQU   TCBRV164                                                 01005000
TCBRV171 EQU   TCBRV164                                                 01006000
TCBRV170 EQU   TCBRV164                                                 01007000
TCBRV169 EQU   TCBRV164                                                 01008000
TCBRV168 EQU   TCBRV164                                                 01009000
TCBRV167 EQU   TCBRV164                                                 01010000
TCBRV166 EQU   TCBRV164                                                 01011000
TCBRV165 EQU   TCBRV164                                                 01012000
TCBRV163 EQU   TCBRV155                                                 01013000
TCBRV162 EQU   TCBRV155                                                 01014000
TCBRV161 EQU   TCBRV155                                                 01015000
TCBRV160 EQU   TCBRV155                                                 01016000
TCBRV159 EQU   TCBRV155                                                 01017000
TCBRV158 EQU   TCBRV155                                                 01018000
TCBRV157 EQU   TCBRV155                                                 01019000
TCBRV156 EQU   TCBRV155                                                 01020000
TCBRV154 EQU   TCBRV146                                                 01021000
TCBRV153 EQU   TCBRV146                                                 01022000
TCBRV152 EQU   TCBRV146                                                 01023000
TCBRV151 EQU   TCBRV146                                                 01024000
TCBRV150 EQU   TCBRV146                                                 01025000
TCBRV149 EQU   TCBRV146                                                 01026000
TCBRV148 EQU   TCBRV146                                                 01027000
TCBRV147 EQU   TCBRV146                                                 01028000
TCBRV145 EQU   TCBXTNT2+26                                              01029000
TCBRV144 EQU   TCBXTNT2+24                                              01030000
TCBRV143 EQU   TCBXTNT2+20                                              01031000
TCBRV142 EQU   TCBXTNT2+16                                              01032000
TCBRSV49 EQU   TCBXTNT2+12                                              01033000
TCBEVENT EQU   TCBXTNT2+8                                               01034000
TCBRCMP  EQU   TCBXTNT2+5                                               01035000
TCBRSVAB EQU   TCBXTNT2+4                                               01036000
TCBGTFA  EQU   TCBGTF+1                                                 01037000
TCBRSV47 EQU   TCBTFLG                                                  01038000
TCBRSV46 EQU   TCBTFLG                                                  01039000
TCBRSV45 EQU   TCBTFLG                                                  01040000
TCBRSV44 EQU   TCBTFLG                                                  01041000
TCBRSV43 EQU   TCBTFLG                                                  01042000
TCBDSPIT EQU   TCBTFLG                                                  01043000
TCBERRTN EQU   TCBTFLG                                                  01044000
TCBASYNC EQU   TCBTFLG                                                  01045000
@NM00021 EQU   TCB+296                                                  01046000
TCBRV185 EQU   TCB+292                                                  01047000
TCBSWASA EQU   TCB+288                                                  01048000
TCBDBTB  EQU   TCB+284                                                  01049000
TCBRPT   EQU   TCB+280                                                  01050000
TCBRV141 EQU   TCBRV133                                                 01051000
TCBRV140 EQU   TCBRV133                                                 01052000
TCBRV139 EQU   TCBRV133                                                 01053000
TCBRV138 EQU   TCBRV133                                                 01054000
TCBRV137 EQU   TCBRV133                                                 01055000
TCBRV136 EQU   TCBRV133                                                 01056000
TCBRV135 EQU   TCBRV133                                                 01057000
TCBRV134 EQU   TCBRV133                                                 01058000
TCBRV132 EQU   TCBRV124                                                 01059000
TCBRV131 EQU   TCBRV124                                                 01060000
TCBRV130 EQU   TCBRV124                                                 01061000
TCBRV129 EQU   TCBRV124                                                 01062000
TCBRV128 EQU   TCBRV124                                                 01063000
TCBRV127 EQU   TCBRV124                                                 01064000
TCBRV126 EQU   TCBRV124                                                 01065000
TCBRV125 EQU   TCBRV124                                                 01066000
TCBRV123 EQU   TCBFBYT2                                                 01067000
TCBRV122 EQU   TCBFBYT2                                                 01068000
TCBECBNV EQU   TCBFBYT2                                                 01069000
TCBSSSYN EQU   TCBFBYT2                                                 01070000
TCBFPRAP EQU   TCBFBYT2                                                 01071000
TCBFDW   EQU   TCBFBYT2                                                 01072000
TCBFMW   EQU   TCBFBYT2                                                 01073000
TCBCNCB  EQU   TCBFBYT2                                                 01074000
TCBLLH   EQU   TCBFBYT1                                                 01075000
TCBRV113 EQU   TCBFBYT1                                                 01076000
TCBEOT   EQU   TCBFBYT1                                                 01077000
TCBRTM2  EQU   TCBFBYT1                                                 01078000
TCBPGNLY EQU   TCBFBYT1                                                 01079000
TCBNDIOS EQU   TCBFBYT1                                                 01080000
TCBACTIV EQU   TCBFBYT1                                                 01081000
TCBEOTFM EQU   TCBFBYT1                                                 01082000
TCBAFFN  EQU   TCB+274                                                  01083000
TCBCCPVI EQU   TCB+272                                                  01084000
TCBUKYSP EQU   TCB+268                                                  01085000
TCBMODE  EQU   TCBESTAE+3                                               01086000
TCBERTYP EQU   TCBESTAE+2                                               01087000
TCBRV314 EQU   TCBESTRM                                                 01088000
TCBRV313 EQU   TCBESTRM                                                 01089000
TCBRV312 EQU   TCBESTRM                                                 01090000
TCBRV311 EQU   TCBESTRM                                                 01091000
TCBRV310 EQU   TCBESTRM                                                 01092000
TCBRV309 EQU   TCBESTRM                                                 01093000
TCBRV308 EQU   TCBESTRM                                                 01094000
TCBETERM EQU   TCBESTRM                                                 01095000
TCBSCBKY EQU   TCBESTAE                                                 01096000
TCBRTM12 EQU   TCB+260                                                  01097000
TCBTCBID EQU   TCB+256                                                  01098000
TCBRSV96 EQU   TCB+252                                                  01099000
TCBSWA   EQU   TCB+248                                                  01100000
TCBFOEA  EQU   TCBFOE+1                                                 01101000
TCBRSV42 EQU   TCBFOE                                                   01102000
TCBRV306 EQU   TCB+240                                                  01103000
TCBRSV41 EQU   TCB+239                                                  01104000
TCBTID   EQU   TCB+238                                                  01105000
TCBRSVAA EQU   TCB+237                                                  01106000
TCBABCUR EQU   TCB+236                                                  01107000
TCBTMSAV EQU   TCB+232                                                  01108000
TCBIOTIM EQU   TCB+228                                                  01109000
TCBRTWA  EQU   TCB+224                                                  01110000
TCBBACK  EQU   TCB+220                                                  01111000
TCBTIRB  EQU   TCB+216                                                  01112000
TCBAECB  EQU   TCB+212                                                  01113000
TCBEXT2A EQU   TCBEXT2+1                                                01114000
TCBRSV39 EQU   TCBEXT2                                                  01115000
TCBSTMCT EQU   TCB+207                                                  01116000
TCBSYSCT EQU   TCB+206                                                  01117000
TCBRSV37 EQU   TCB+205                                                  01118000
TCBEXSVC EQU   TCBDAR                                                   01119000
TCBDARMS EQU   TCBDAR                                                   01120000
TCBDARWT EQU   TCBDAR                                                   01121000
TCBDARO  EQU   TCBDAR                                                   01122000
TCBDARMC EQU   TCBDARC                                                  01123000
TCBDARD  EQU   TCBDAR                                                   01124000
TCBDARS  EQU   TCBDAR                                                   01125000
TCBDARP  EQU   TCBDAR                                                   01126000
TCBGTOFM EQU   TCBFLGS7                                                 01127000
TCBADMP  EQU   TCBFLGS7                                                 01128000
TCBRSTSK EQU   TCBFLGS7                                                 01129000
TCBRSV35 EQU   TCBFLGS7                                                 01130000
TCBSTACK EQU   TCBFLGS7                                                 01131000
TCBRSV34 EQU   TCBFLGS7                                                 01132000
TCBRSV33 EQU   TCBFLGS7                                                 01133000
TCBGPECB EQU   TCBFLGS7                                                 01134000
TCBNTJS  EQU   TCBFLGS6                                                 01135000
TCBAPG   EQU   TCBFLGS6                                                 01136000
TCBMIGR  EQU   TCBFLGS6                                                 01137000
TCBRV303 EQU   TCBFLGS6                                                 01138000
TCBSPVLK EQU   TCBFLGS6                                                 01139000
TCBCPU   EQU   TCBFLGS6                                                 01140000
TCBPIE17 EQU   TCBFLGS6                                                 01141000
TCBRV    EQU   TCBFLGS6                                                 01142000
TCBRSV79 EQU   TCBNDSP5                                                 01143000
TCBRSV78 EQU   TCBNDSP5                                                 01144000
TCBRSV77 EQU   TCBNDSP5                                                 01145000
TCBRSV76 EQU   TCBNDSP5                                                 01146000
TCBRSV75 EQU   TCBNDSP5                                                 01147000
TCBRSV74 EQU   TCBNDSP5                                                 01148000
TCBRSV95 EQU   TCBNDSP5                                                 01149000
TCBRSV94 EQU   TCBNDSP5                                                 01150000
TCBRSV93 EQU   TCBNDSP4                                                 01151000
TCBRSV92 EQU   TCBNDSP4                                                 01152000
TCBRSV91 EQU   TCBNDSP4                                                 01153000
TCBRSV90 EQU   TCBNDSP4                                                 01154000
TCBRSV89 EQU   TCBNDSP4                                                 01155000
TCBRSV88 EQU   TCBNDSP4                                                 01156000
TCBRSV87 EQU   TCBNDSP4                                                 01157000
TCBRSV86 EQU   TCBNDSP4                                                 01158000
TCBEXT1A EQU   TCBEXT1+1                                                01159000
TCBRSV32 EQU   TCBEXT1                                                  01160000
TCBEXCPD EQU   TCB+192                                                  01161000
TCBIOBRC EQU   TCB+188                                                  01162000
TCBDDWTC EQU   TCB+186                                                  01163000
TCBDDEXC EQU   TCB+184                                                  01164000
TCBJSCBB EQU   TCBJSCB+1                                                01165000
@NM00020 EQU   TCBRECDE                                                 01166000
TCBREC   EQU   TCBRECDE                                                 01167000
TCBMDIDS EQU   TCB+176                                                  01168000
TCBNDINT EQU   TCBNDSP3                                                 01169000
TCBRSV27 EQU   TCBNDSP3                                                 01170000
TCBRSV26 EQU   TCBNDSP3                                                 01171000
TCBRSV25 EQU   TCBNDSP3                                                 01172000
TCBRSV24 EQU   TCBNDSP3                                                 01173000
TCBSRBND EQU   TCBNDSP3                                                 01174000
TCBRV302 EQU   TCBNDSP3                                                 01175000
TCBLJSND EQU   TCBNDSP3                                                 01176000
TCBABE   EQU   TCBNDSP2                                                 01177000
TCBDSS   EQU   TCBNDSP2                                                 01178000
TCBOWAIT EQU   TCBNDSP2                                                 01179000
TCBIWAIT EQU   TCBNDSP2                                                 01180000
TCBNDTS  EQU   TCBNDSP2                                                 01181000
TCBNDSVC EQU   TCBNDSP2                                                 01182000
TCBSTPP  EQU   TCBNDSP2                                                 01183000
TCBABD   EQU   TCBNDSP2                                                 01184000
TCBRSV22 EQU   TCBNDSP1                                                 01185000
TCBPIEND EQU   TCBNDSP1                                                 01186000
TCBTPSP  EQU   TCBNDSP1                                                 01187000
TCBDDRND EQU   TCBNDSP1                                                 01188000
TCBRSPND EQU   TCBNDSP1                                                 01189000
TCBRSTND EQU   TCBNDSP1                                                 01190000
TCBDARPN EQU   TCBNDSP1                                                 01191000
TCBDARTN EQU   TCBNDSP1                                                 01192000
TCBNDSP0 EQU   TCBNDSP                                                  01193000
TCBUSER  EQU   TCB+168                                                  01194000
TCBTCTB  EQU   TCBTCT+1                                                 01195000
TCBRSV9C EQU   TCBTCTGF                                                 01196000
TCBRSV9B EQU   TCBTCTGF                                                 01197000
TCBRSV9A EQU   TCBTCTGF                                                 01198000
TCBRSV99 EQU   TCBTCTGF                                                 01199000
TCBRSV98 EQU   TCBTCTGF                                                 01200000
TCBRSV97 EQU   TCBTCTGF                                                 01201000
TCBRSV20 EQU   TCBTCTGF                                                 01202000
TCBSMFGF EQU   TCBTCTGF                                                 01203000
TCBSTABB EQU   TCBSTAB+1                                                01204000
TCBSTCUR EQU   TCBNSTAE                                                 01205000
TCBRV301 EQU   TCBNSTAE                                                 01206000
TCBSYNCH EQU   TCBNSTAE                                                 01207000
TCBHALT  EQU   TCBNSTAE                                                 01208000
TCBPPSUP EQU   TCBNSTAE                                                 01209000
TCB33E   EQU   TCBNSTAE                                                 01210000
TCBQUIES EQU   TCBNSTAE                                                 01211000
TCBSTABE EQU   TCBNSTAE                                                 01212000
TCBAQE   EQU   TCB+156                                                  01213000
TCBPQE   EQU   TCB+152                                                  01214000
TCBTSDP  EQU   TCB+151                                                  01215000
TCBTSLP  EQU   TCB+150                                                  01216000
TCBSTPCT EQU   TCB+149                                                  01217000
TCBCPUBN EQU   TCBTSFLG                                                 01218000
TCBDYDSP EQU   TCBTSFLG                                                 01219000
TCBRSV18 EQU   TCBTSFLG                                                 01220000
TCBRSV17 EQU   TCBTSFLG                                                 01221000
TCBTIOTG EQU   TCBTSFLG                                                 01222000
TCBATT   EQU   TCBTSFLG                                                 01223000
TCBSTPPR EQU   TCBTSFLG                                                 01224000
TCBRV300 EQU   TCBTSTSK                                                 01225000
TCBECB   EQU   TCB+144                                                  01226000
TCBIQE   EQU   TCB+140                                                  01227000
TCBLTC   EQU   TCB+136                                                  01228000
TCBNTC   EQU   TCB+128                                                  01229000
TCBJSTCA EQU   TCBJSTCB+1                                               01230000
TCBRSV16 EQU   TCBJSTCB                                                 01231000
TCBTQET  EQU   TCBTME                                                   01232000
TCBTCB   EQU   TCB+116                                                  01233000
TCBFSAB  EQU   TCBFSA+1                                                 01234000
TCBQEL   EQU   TCBFSA                                                   01235000
TCBGRS15 EQU   TCBGRS+60                                                01236000
TCBGRS14 EQU   TCBGRS+56                                                01237000
TCBGRS13 EQU   TCBGRS+52                                                01238000
TCBGRS12 EQU   TCBGRS+48                                                01239000
TCBGRS11 EQU   TCBGRS+44                                                01240000
TCBGRS10 EQU   TCBGRS+40                                                01241000
TCBGRS9  EQU   TCBGRS+36                                                01242000
TCBGRS8  EQU   TCBGRS+32                                                01243000
TCBGRS7  EQU   TCBGRS+28                                                01244000
TCBGRS6  EQU   TCBGRS+24                                                01245000
TCBGRS5  EQU   TCBGRS+20                                                01246000
TCBGRS4  EQU   TCBGRS+16                                                01247000
TCBGRS3  EQU   TCBGRS+12                                                01248000
TCBGRS2  EQU   TCBGRS+8                                                 01249000
TCBGRS1  EQU   TCBGRS+4                                                 01250000
TCBGRS0  EQU   TCBGRS                                                   01251000
TCBJPQB  EQU   TCBJPQ+1                                                 01252000
TCBRSV15 EQU   TCBPURGE                                                 01253000
TCBRSV14 EQU   TCBPURGE                                                 01254000
TCBRSV13 EQU   TCBPURGE                                                 01255000
TCBRSV12 EQU   TCBPURGE                                                 01256000
TCBRSV11 EQU   TCBPURGE                                                 01257000
TCBRSV10 EQU   TCBPURGE                                                 01258000
TCBRSV09 EQU   TCBPURGE                                                 01259000
TCBJPQF  EQU   TCBPURGE                                                 01260000
TCBJLB   EQU   TCB+40                                                   01261000
TCBLLS   EQU   TCB+36                                                   01262000
TCBDSP   EQU   TCB+35                                                   01263000
TCBLMP   EQU   TCB+34                                                   01264000
TCBPNDSP EQU   TCBFLGS5                                                 01265000
TCBFCD1  EQU   TCBFLGS5                                                 01266000
TCBSTP   EQU   TCBFLGS5                                                 01267000
TCBSYS   EQU   TCBFLGS5                                                 01268000
TCBANDSP EQU   TCBFLGS5                                                 01269000
TCBPAGE  EQU   TCBFLGS5                                                 01270000
TCBUXNDF EQU   TCBABWF                                                  01271000
TCBFC    EQU   TCBFLGS5                                                 01272000
TCBONDSP EQU   TCBFLGS4                                                 01273000
TCBMPCND EQU   TCBFLGS4                                                 01274000
TCBMPCVQ EQU   TCBFLGS4                                                 01275000
TCBUXNDV EQU   TCBFLGS4                                                 01276000
TCBHNDSP EQU   TCBFLGS4                                                 01277000
TCBRQENA EQU   TCBFLGS4                                                 01278000
TCBSER   EQU   TCBFLGS4                                                 01279000
TCBNDUMP EQU   TCBFLGS4                                                 01280000
TCBDWSTA EQU   TCBFLGS3                                                 01281000
TCBRSV08 EQU   TCBFLGS3                                                 01282000
TCBRSV07 EQU   TCBFLGS3                                                 01283000
TCBRSV06 EQU   TCBFLGS3                                                 01284000
TCBABGM  EQU   TCBFLGS3                                                 01285000
TCBABTRM EQU   TCBFLGS3                                                 01286000
TCBADINP EQU   TCBFLGS3                                                 01287000
TCBFSM   EQU   TCBFLGS3                                                 01288000
TCBFTS   EQU   TCBFLGS2                                                 01289000
TCBFETXR EQU   TCBFLGS2                                                 01290000
TCBFDSOP EQU   TCBFLGS2                                                 01291000
TCBFJMC  EQU   TCBFLGS2                                                 01292000
TCBFSMC  EQU   TCBFLGS2                                                 01293000
TCBFABOP EQU   TCBFLGS2                                                 01294000
TCBFSTI  EQU   TCBFLGS2                                                 01295000
TCBFOINP EQU   TCBFLGS2                                                 01296000
TCBFX    EQU   TCBFLGS1                                                 01297000
TCBFS    EQU   TCBFLGS1                                                 01298000
TCBFT    EQU   TCBFLGS1                                                 01299000
TCBPDUMP EQU   TCBFLGS1                                                 01300000
TCBRSV04 EQU   TCBFLGS1                                                 01301000
TCBFERA  EQU   TCBFLGS1                                                 01302000
TCBFE    EQU   TCBFLGS1                                                 01303000
TCBFA    EQU   TCBFLGS1                                                 01304000
TCBZERO  EQU   TCBPKF                                                   01305000
TCBFLAG  EQU   TCBPKF                                                   01306000
TCBMSSB  EQU   TCBMSS+1                                                 01307000
TCBRSV03 EQU   TCBMSS                                                   01308000
TCBTRNB  EQU   TCBTRN+1                                                 01309000
TCBRSV02 EQU   TCBABF                                                   01310000
TCBOLTEP EQU   TCBABF                                                   01311000
TCBTCP   EQU   TCBABF                                                   01312000
TCBTCPP  EQU   TCBABF                                                   01313000
TCBRSV01 EQU   TCBABF                                                   01314000
TCBGRPH  EQU   TCBABF                                                   01315000
TCBNOCHK EQU   TCBABF                                                   01316000
TCBMOD91 EQU   TCBABF                                                   01317000
TCBCMPC  EQU   TCBCMP+1                                                 01318000
TCBRV318 EQU   TCBCMSG                                                  01319000
TCBRV317 EQU   TCBCIND                                                  01320000
TCBRV316 EQU   TCBCWTO                                                  01321000
TCBCASID EQU   TCBCDBL                                                  01322000
TCBNOCC  EQU   TCBSTCC                                                  01323000
TCBDMPO  EQU   TCBCPP                                                   01324000
TCBCSTEP EQU   TCBCMPF                                                  01325000
TCBCREQ  EQU   TCBCMPF                                                  01326000
TCBTIO   EQU   TCB+12                                                   01327000
TCBDEB   EQU   TCB+8                                                    01328000
TCBPIEA  EQU   TCBPIE+1                                                 01329000
TCBPM    EQU   TCBPMASK                                                 01330000
@NM00019 EQU   TCBPMASK                                                 01331000
TCBRBP   EQU   TCB                                                      01332000
TCBFRS6  EQU   TCBFRS+24                                                01333000
TCBFRS4  EQU   TCBFRS+16                                                01334000
TCBFRS2  EQU   TCBFRS+8                                                 01335000
TCBFRS0  EQU   TCBFRS                                                   01336000
JSCBCSCB EQU   JSCBSEC1+68                                              01337000
JSCBPMG  EQU   JSCBWTP+2                                                01338000
JSCBWTSP EQU   JSCBWTP+1                                                01339000
JSCRSV23 EQU   JSCBWTFG                                                 01340000
JSCRSV22 EQU   JSCBWTFG                                                 01341000
JSCRSV21 EQU   JSCBWTFG                                                 01342000
JSCRSV20 EQU   JSCBWTFG                                                 01343000
JSCRSV19 EQU   JSCBWTFG                                                 01344000
JSCRSV18 EQU   JSCBWTFG                                                 01345000
JSCBRET  EQU   JSCBWTFG                                                 01346000
JSCBIOFG EQU   JSCBWTFG                                                 01347000
@NM00016 EQU   JSCBSEC1+60                                              01348000
JSCBQMPI EQU   JSCBSEC1+56                                              01349000
JSCBPMSG EQU   JSCBSWT1                                                 01350000
JSCRSV16 EQU   JSCBSWT1                                                 01351000
JSCRSV15 EQU   JSCBSWT1                                                 01352000
JSCRSV14 EQU   JSCBSWT1                                                 01353000
JSCRSV13 EQU   JSCBSWT1                                                 01354000
JSCRSV12 EQU   JSCBSWT1                                                 01355000
JSCRSV11 EQU   JSCBSWT1                                                 01356000
JSCBPASS EQU   JSCBSWT1                                                 01357000
JSCBTTTR EQU   JSCBSEC1+52                                              01358000
JSCRSV10 EQU   JSCBSEC1+49                                              01359000
JSCBAUTH EQU   JSCBOPTS                                                 01360000
JSCSIOTS EQU   JSCBOPTS                                                 01361000
JSCRSV08 EQU   JSCBOPTS                                                 01362000
JSCRSV07 EQU   JSCBOPTS                                                 01363000
JSCRSV06 EQU   JSCBOPTS                                                 01364000
JSCBLONG EQU   JSCBOPTS                                                 01365000
JSCRSV05 EQU   JSCBOPTS                                                 01366000
JSCRSV04 EQU   JSCBOPTS                                                 01367000
JSCBSECB EQU   JSCBSEC1+44                                              01368000
JSCRSV03 EQU   JSCBSEC1+41                                              01369000
JSCBSTEP EQU   JSCBSEC1+40                                              01370000
JSCBDCBA EQU   JSCBDCB+1                                                01371000
JSCRSV02 EQU   JSCBDCB                                                  01372000
JSCBID   EQU   JSCBSEC1+32                                              01373000
JSCBDBTB EQU   JSCBSEC1+28                                              01374000
JSCBIJSC EQU   JSCBSEC1+24                                              01375000
JSCBPCC  EQU   JSCBSEC1+16                                              01376000
JSCBTCP  EQU   JSCBSEC1+12                                              01377000
JSCBSHR  EQU   JSCBSEC1+8                                               01378000
JSCHPCEA EQU   JSCHPCE+1                                                01379000
JSCRSV32 EQU   JSCHPCE                                                  01380000
JSCRSV01 EQU   JSCBSEC1                                                 01381000
@NM00015 EQU   IEZJSCB                                                  01382000
DSABGRID EQU   DSABGIDL+4                                               01383000
DSABLLEN EQU   DSABGIDL                                                 01384000
DSABANAM EQU   DSABANMI+1                                               01385000
DSABANML EQU   DSABANMI                                                 01386000
DSABRS04 EQU   DSAB+68                                                  01387000
DSABSIOT EQU   DSAB+64                                                  01388000
DSABRS03 EQU   DSAB+62                                                  01389000
DSABDCBM EQU   DSAB+56                                                  01390000
DSABSSCM EQU   DSAB+52                                                  01391000
DSABSSNM EQU   DSAB+48                                                  01392000
DSABPTTR EQU   DSAB+44                                                  01393000
DSABRS02 EQU   DSAB+38                                                  01394000
@NM00014 EQU   DSABFLG4                                                 01395000
DSABCKSI EQU   DSABFLG4                                                 01396000
DSABCKVL EQU   DSABFLG4                                                 01397000
DSABCKDS EQU   DSABFLG4                                                 01398000
@NM00013 EQU   DSABFLG3                                                 01399000
DSABJSCT EQU   DSABFLG3                                                 01400000
DSABVMSC EQU   DSABFLG3                                                 01401000
DSABVAM  EQU   DSABFLG3                                                 01402000
DSABPASS EQU   DSABFLG3                                                 01403000
DSABDEFR EQU   DSABFLG3                                                 01404000
@NM00012 EQU   DSABFLG2                                                 01405000
DSABUNAL EQU   DSABFLG2                                                 01406000
DSABIRM  EQU   DSABFLG2                                                 01407000
DSABOPEN EQU   DSABFLG2                                                 01408000
DSABCATM EQU   DSABFLG1                                                 01409000
DSABPCAT EQU   DSABFLG1                                                 01410000
DSABDCAT EQU   DSABFLG1                                                 01411000
DSABCONV EQU   DSABFLG1                                                 01412000
DSABDCNV EQU   DSABFLG1                                                 01413000
DSABPALC EQU   DSABFLG1                                                 01414000
DSABDALC EQU   DSABFLG1                                                 01415000
@NM00011 EQU   DSABORG2                                                 01416000
DSABTR   EQU   DSABORG2                                                 01417000
DSABAM   EQU   DSABORG2                                                 01418000
@NM00010 EQU   DSABORG2                                                 01419000
DSABTQ   EQU   DSABORG2                                                 01420000
DSABTX   EQU   DSABORG2                                                 01421000
DSABGS   EQU   DSABORG2                                                 01422000
DSABU    EQU   DSABORG1                                                 01423000
DSABPO   EQU   DSABORG1                                                 01424000
DSABMQ   EQU   DSABORG1                                                 01425000
DSABCQ   EQU   DSABORG1                                                 01426000
DSABCX   EQU   DSABORG1                                                 01427000
DSABDA   EQU   DSABORG1                                                 01428000
DSABPS   EQU   DSABORG1                                                 01429000
DSABIS   EQU   DSABORG1                                                 01430000
DSABSSVA EQU   DSAB+21                                                  01431000
DSABRS01 EQU   DSAB+20                                                  01432000
DSABOPCT EQU   DSAB+14                                                  01433000
DSABLNTH EQU   DSAB+12                                                  01434000
DSABBCHN EQU   DSAB+8                                                   01435000
DSABID   EQU   DSAB                                                     01436000
QDBRV002 EQU   QDB+28                                                   01437000
QDBPRDS  EQU   QDB+26                                                   01438000
QDBPRSZ  EQU   QDB+24                                                   01439000
QDBBPTDS EQU   QDB+22                                                   01440000
QDBFPTDS EQU   QDB+20                                                   01441000
QDBLELMP EQU   QDB+16                                                   01442000
QDBFELMP EQU   QDB+12                                                   01443000
QDBNELMS EQU   QDB+8                                                    01444000
QDBRV001 EQU   QDB+6                                                    01445000
QDBATTR  EQU   QDB+4                                                    01446000
QDBQDB   EQU   QDB                                                      01447000
TEXTUPRM EQU   TEXTUFLD+2                                               01448000
TEXTULEN EQU   TEXTUFLD                                                 01449000
TEXTULNG EQU   TEXTUENT                                                 01450000
TEXTUNUM EQU   TEXTUNIT+2                                               01451000
TEXTUKEY EQU   TEXTUNIT                                                 01452000
TXTPLEND EQU   TXTPLENT                                                 01453000
TXTUPEND EQU   TXTUNITP                                                 01454000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01455000
@RC00065 EQU   @RC00064                                                 01456000
@ENDDATA EQU   *                                                        01457000
         END   IEFDB480,(C'PLS0248',0603,75024)                         01458000
./  ADD  SSI=50230598,NAME=IEFDB481
         TITLE 'IEFDB481 - REMOVE IN-USE PROCESSOR                     *00001000
                        '                                               00002000
IEFDB481 CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IEFDB481  75.024'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @12,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@12                                      01S0001 00013000
         L     @00,@SIZDATD                                     01S0001 00014000
         GSPACE   R,LV=(0)                                              00015000
         LR    @11,@01                                          01S0001 00016000
         USING @DATD,@11                                        01S0001 00017000
         ST    @13,@SA00001+4                                   01S0001 00018000
         LM    @00,@01,20(@13)                                  01S0001 00019000
         ST    @11,8(,@13)                                      01S0001 00020000
         LR    @13,@11                                          01S0001 00021000
         MVC   @PC00001(28),0(@01)                              01S0001 00022000
JSCBDISP EQU 188                                                        00023000
JSCBAOS1 EQU  72                                                        00024000
JSCBAOS2 EQU 192                                                        00025000
*RLSTINDX=1;                           /*INIT LIST INDEX FOR RIU     */ 00026000
         LA    RLSTINDX,1                                       01S0045 00027000
*ULSTINDX=0;                           /*INIT LIST INDEX FOR UNALLOC */ 00028000
         SLR   @10,@10                                          01S0046 00029000
         ST    @10,ULSTINDX                                     01S0046 00030000
*DO WHILE RLSTINDX <= RDSABCNT;        /*PROCESS ALL DSABS IN LIST   */ 00031000
         B     @DE00047                                         01S0047 00032000
@DL00047 DS    0H                                               01S0048 00033000
*  DSABPTR=RDSABLST(RLSTINDX);         /*POINT TO DSAB TO PROCESS    */ 00034000
         LR    @10,RLSTINDX                                     01S0048 00035000
         SLA   @10,2                                            01S0048 00036000
         L     @05,@PC00001                                     01S0048 00037000
         L     @05,RDSABSP(,@05)                                01S0048 00038000
         AL    @05,@CF00594                                     01S0048 00039000
         L     DSABPTR,RDSABLST(@10,@05)                        01S0048 00040000
*  IF (DSABOPCT >  0   |               /*IS DATA SET OPEN OR         */ 00041000
*      DSABCATM = '1'B) THEN           /*IN A CONCATENATED GROUP?    */ 00042000
         LH    @10,DSABOPCT(,DSABPTR)                           01S0049 00043000
         LTR   @10,@10                                          01S0049 00044000
         BP    @RT00049                                         01S0049 00045000
         TM    DSABCATM(DSABPTR),B'00000010'                    01S0049 00046000
         BNO   @RF00049                                         01S0049 00047000
@RT00049 DS    0H                                               01S0050 00048000
*    CALL DSABCHNR;                    /*YES;IN-USE BIT OFF & RECHAIN*/ 00049000
         BAL   @14,DSABCHNR                                     01S0050 00050000
*  ELSE                                /*NO, CONTINUE PROCESSING     */ 00051000
*    IF (DSABPALC = '0'B &             /*IS D.S. NON-PERM ALLOCATED &*/ 00052000
*        SIOTDLET = '1'B) THEN         /*WITH A DISP OF DELETE ?     */ 00053000
         B     @RC00049                                         01S0051 00054000
@RF00049 TM    DSABPALC(DSABPTR),B'01000000'                    01S0051 00055000
         BNZ   @RF00051                                         01S0051 00056000
         L     @10,DSABSIOT(,DSABPTR)                           01S0051 00057000
         TM    SIOTDLET(@10),B'00000100'                        01S0051 00058000
         BNO   @RF00051                                         01S0051 00059000
*      IF (DSABANMP ¬= 0 &             /*IS THERE AN ALT. DSN FLD AND*/ 00060000
*          DSABANAM(1) = '&') THEN     /*IS IT AN &DSN ?             */ 00061000
         L     @10,DSABANMP(,DSABPTR)                           01S0052 00062000
         LTR   @10,@10                                          01S0052 00063000
         BZ    @RF00052                                         01S0052 00064000
         CLI   DSABANAM(@10),C'&&'                              01S0052 00065000
         BNE   @RF00052                                         01S0052 00066000
*        CALL DSABCHNR;                /*IN-USE BIT OFF & RECHAIN    */ 00067000
         BAL   @14,DSABCHNR                                     01S0053 00068000
*      ELSE                            /*NOT AN &DSN                 */ 00069000
*        DO;                           /*D.S. TO BE UNALLOCATED      */ 00070000
         B     @RC00052                                         01S0054 00071000
@RF00052 DS    0H                                               01S0055 00072000
*          ULSTINDX=ULSTINDX+1;        /*INCREMENT UNALLOC LIST INDEX*/ 00073000
         LA    @10,1                                            01S0055 00074000
         AL    @10,ULSTINDX                                     01S0055 00075000
         ST    @10,ULSTINDX                                     01S0055 00076000
*          UDSABLST(ULSTINDX)=DSABPTR; /*PUT INTO LIST FOR UNALLOC   */ 00077000
         SLA   @10,2                                            01S0056 00078000
         L     @05,@PC00001                                     01S0056 00079000
         L     @05,RDSABSP(,@05)                                01S0056 00080000
         AL    @05,@CF00594                                     01S0056 00081000
         ST    DSABPTR,UDSABLST(@10,@05)                        01S0056 00082000
*        END;                          /*END IF D.S. TO BE UNALLOC.  */ 00083000
*    ELSE                              /*D.S. PERM ALLOC OR NONDELETE*/ 00084000
*      DO;                             /*PROCESS THIS DSAB NORMALLY  */ 00085000
         B     @RC00051                                         01S0058 00086000
@RF00051 DS    0H                                               01S0059 00087000
*/********************************************************************/ 00088000
*/*                                                                  */ 00089000
*/* SEGMENT NAME - DISPPRCR                                          */ 00090000
*/*                                                                  */ 00091000
*/* DESCRIPTIVE NAME - CONDITIONAL DISPOSITION REMOVAL               */ 00092000
*/*                                                                  */ 00093000
*/* FUNCTION  - REMOVE CONDITIONAL DISPOSITION FROM A SIOT WHEN      */ 00094000
*/*             NECESSARY, AND CREATE AND ENCHAIN A WRITE EPA FOR THE*/ 00095000
*/*             UPDATED SIOT.                                        */ 00096000
*/*                                                                  */ 00097000
*/* OPERATION - A CHECK IS MADE TO ENSURE THAT A CONDITIONAL         */ 00098000
*/*             DISPOSITION WAS SPECIFIED ON THE ORIGINAL ALLOCATION */ 00099000
*/*             REQUEST. IF ONE WAS NOT, NO PROCESSING IS NECESSARY. */ 00100000
*/*             IF ONE WAS, IT IS CHECKED AGAINST THE NORMAL DISP TO */ 00101000
*/*             SEE IF THEY ARE DIFFERENT. IF NOT DIFFERENT, NO      */ 00102000
*/*             REMOVAL OF COND. DISP IS NECESSARY AS THE CORRECT    */ 00103000
*/*             NORMAL DISP PROCESSING WILL TAKE PLACE, EVEN IN CASE */ 00104000
*/*             OF ABEND. HOWEVER IF THEY ARE DIFFERENT, THE         */ 00105000
*/*             CONDITIONAL DISPOSITION FIELD OF THE SIOT IS CLEARED */ 00106000
*/*             AND A GETMAIN IS ISSUED FOR CORE FOR AN EPA. THIS EPA*/ 00107000
*/*             IS THEN FILLED IN APPROPRIATELY AND PLACED ON A CHAIN*/ 00108000
*/*             OF EPA'S FOR UPDATED SWA CONTROL BLOCKS TO BE WRITTEN*/ 00109000
*/* ENTRY -                                                          */ 00110000
*/*   INPUT  - SIOT TO BE PROCESSED                                  */ 00111000
*/*          - PTR TO LAST EPA ON CHAIN                              */ 00112000
*/*                                                                  */ 00113000
*/* EXIT -                                                           */ 00114000
*/*   OUTPUT - SIOTALTD CLEARED  IF NECESSARY                        */ 00115000
*/*          - SWAEPA CREATED AND CHAINED IF SIOTALTD WAS CLEARED    */ 00116000
*/*          - LASTEPAP UPDATED IF EPA WAS CREATED                   */ 00117000
*/*                                                                  */ 00118000
*/********************************************************************/ 00119000
*RFY SWAEPA BASED(LASTEPAP);           /*RESET BASE OF EPA MAP       */ 00120000
*IF SIOTALTD(5:8) ¬= '0000'B THEN      /*WAS ALT. DISP SPECD AT ALLOC*/ 00121000
         L     @10,DSABSIOT(,DSABPTR)                           02S0060 00122000
         TM    SIOTALTD(@10),B'00001111'                        02S0060 00123000
         BZ    @RF00060                                         02S0060 00124000
*  DO;                                 /*YES,COMPARE WITH NORMAL DISP*/ 00125000
*    WRKBITS=SCTSDISP && SIOTALTD;     /*SET BITS THAT ARE DIFFERENT */ 00126000
         MVC   WRKBITS(1),SCTSDISP(@10)                         02S0062 00127000
         XC    WRKBITS(1),SIOTALTD(@10)                         02S0062 00128000
*    IF WRKBITS(5:8) ¬='0000'B THEN    /*ARE NORMAL & COND DISPS DIFF*/ 00129000
         TM    WRKBITS,B'00001111'                              02S0063 00130000
         BZ    @RF00063                                         02S0063 00131000
*      DO;                             /*YES,REMOVE CONDITIONAL DISP */ 00132000
*        SIOTALTD(5:8)='0000'B;        /*CLEAR COND. DISP IN THE SIOT*/ 00133000
         NI    SIOTALTD(@10),B'11110000'                        02S0065 00134000
*        R0=LENGTH(SWAEPA);            /*SIZE OF EPA FROM            */ 00135000
         LA    R0,16                                            02S0066 00136000
*        R0 = R0 | SCHDSUBP;           /*GET FROM CORRECT SUBPOOL    */ 00137000
         O     R0,@CF00072                                      02S0067 00138000
*        GEN (GETMAIN R,LV=(0))        /*GET CORE FOR EPA            */ 00139000
*             SETS(R1) REFS(R0);                                02S0068 00140000
         GETMAIN R,LV=(0)                                               00141000
*        SWCHNPTR=R1;                  /*CHAIN INTO LAST EPA         */ 00142000
         L     @10,@PC00001+12                                  02S0069 00143000
         L     @05,LASTEPAP(,@10)                               02S0069 00144000
         ST    R1,SWCHNPTR(,@05)                                02S0069 00145000
*        LASTEPAP=SWCHNPTR;            /*UPDATE FOR NEW LAST EPA     */ 00146000
         L     @05,@PC00001+12                                  02S0070 00147000
         L     @05,LASTEPAP(,@05)                               02S0070 00148000
         L     @05,SWCHNPTR(,@05)                               02S0070 00149000
         ST    @05,LASTEPAP(,@10)                               02S0070 00150000
*        SWAEPA=SWAEPA && SWAEPA;      /*ZERO OUT NEW EPA            */ 00151000
         XC    SWAEPA(16,@05),SWAEPA(@05)                       02S0071 00152000
*        SWBLKPTR=DSABSIOT;            /*POINT TO UPDATED SIOT       */ 00153000
         L     @10,DSABSIOT(,DSABPTR)                           02S0072 00154000
         ST    @10,SWBLKPTR(,@05)                               02S0072 00155000
*        SWVA=SIOTDSKA;                /*PUT IN SIOT'S SVA           */ 00156000
         MVC   SWVA(3,@05),SIOTDSKA(@10)                        02S0073 00157000
*        SWBLKID=3;                    /*PUT IN BLOCK ID OF SIOT     */ 00158000
         MVI   SWBLKID(@05),X'03'                               02S0074 00159000
*        SWLNGTH=176;                  /*PUT IN LENGTH OF SIOT BLK   */ 00160000
         MVC   SWLNGTH(4,@05),@CF00585                          02S0075 00161000
*      END;                            /*END COND. DISP PROCESS      */ 00162000
*    ELSE;                             /*NORMAL AND COND. DISPS SAME */ 00163000
@RF00063 DS    0H                                               02S0078 00164000
*  END;                                /*END ALT. DISP SPECIFIED     */ 00165000
*ELSE;                                 /*COND. DISP NOT SPECIFIED    */ 00166000
@RF00060 DS    0H                                               02S0080 00167000
*RFY SWAEPA BASED(SWEPAPTR);           /*RESET BASE OF EPA MAP       */ 00168000
*        CALL DSABCHNR;                /*IN-USE BIT OFF & RECHAIN    */ 00169000
         BAL   @14,DSABCHNR                                     01S0081 00170000
*      END;                            /*END NORMAL PROCESS FOR DSAB */ 00171000
*  RLSTINDX=RLSTINDX+1;                /*INDEX TO NEXT DSAB IN LIST  */ 00172000
@RC00051 DS    0H                                               01S0083 00173000
@RC00049 AL    RLSTINDX,@CF00115                                01S0083 00174000
*END;                                  /*END INPUT LIST PROCESSING   */ 00175000
@DE00047 L     @10,@PC00001+4                                   01S0084 00176000
         C     RLSTINDX,RDSABCNT(,@10)                          01S0084 00177000
         BNH   @DL00047                                         01S0084 00178000
*IF ULSTINDX > 0 THEN                  /*ANY DSABS FOR UNALLOC ?     */ 00179000
         L     @10,ULSTINDX                                     01S0085 00180000
         LTR   @10,@10                                          01S0085 00181000
         BNP   @RF00085                                         01S0085 00182000
*  DO;                                 /*YES, PROCESS THEM           */ 00183000
*    UNALKEYT = UNALKEYT && UNALKEYT;  /*ZEROS FOR DUMMY UNALKEY TAB */ 00184000
         XC    UNALKEYT(40),UNALKEYT                            01S0087 00185000
*    DUMRSNCD = DUMRSNCD && DUMRSNCD;  /*ZERO OUT DUMMY RSNCODE 01S0088 00186000
*                                        UNALLOC                     */ 00187000
         XC    DUMRSNCD(4),DUMRSNCD                             01S0088 00188000
*    CALL IEFDB4A1 (RDSABSP,ULSTINDX,DUMRSNCD,LASTEPAP,         01S0089 00189000
*                   CTLBLKPS,ADDR(UNALKEYT),DEPARMS,SMFPARMS);  01S0089 00190000
         L     @10,@PC00001                                     01S0089 00191000
         ST    @10,@AL00001                                     01S0089 00192000
         LA    @10,ULSTINDX                                     01S0089 00193000
         ST    @10,@AL00001+4                                   01S0089 00194000
         LA    @10,DUMRSNCD                                     01S0089 00195000
         ST    @10,@AL00001+8                                   01S0089 00196000
         L     @10,@PC00001+12                                  01S0089 00197000
         ST    @10,@AL00001+12                                  01S0089 00198000
         L     @10,@PC00001+16                                  01S0089 00199000
         ST    @10,@AL00001+16                                  01S0089 00200000
         LA    @10,UNALKEYT                                     01S0089 00201000
         ST    @10,@TF00001                                     01S0089 00202000
         LA    @10,@TF00001                                     01S0089 00203000
         ST    @10,@AL00001+20                                  01S0089 00204000
         L     @10,@PC00001+20                                  01S0089 00205000
         ST    @10,@AL00001+24                                  01S0089 00206000
         L     @10,@PC00001+24                                  01S0089 00207000
         ST    @10,@AL00001+28                                  01S0089 00208000
         L     @15,@CV00075                                     01S0089 00209000
         LA    @01,@AL00001                                     01S0089 00210000
         BALR  @14,@15                                          01S0089 00211000
*                                      /*UNALLOC PROCESSING  @ZA02706*/ 00212000
*  END;                                /*END DSABS FOR UNALLOC       */ 00213000
*RETURN CODE(0);                       /*RETURN TO INVOKER           */ 00214000
@RF00085 L     @13,4(,@13)                                      01S0091 00215000
         L     @00,@SIZDATD                                     01S0091 00216000
         LR    @01,@11                                          01S0091 00217000
         FSPACE   R,LV=(0),A=(1)                                        00218000
         SLR   @15,@15                                          01S0091 00219000
         L     @14,12(,@13)                                     01S0091 00220000
         LM    @00,@12,20(@13)                                  01S0091 00221000
         BR    @14                                              01S0091 00222000
*/********************************************************************/ 00223000
*/*                                                                  */ 00224000
*/* SEGMENT NAME - DSABCHNR                                          */ 00225000
*/*                                                                  */ 00226000
*/* DESCRIPTIVE NAME - DSAB CHAINER SUBRTN                           */ 00227000
*/*                                                                  */ 00228000
*/* FUNCTION  - MARK DSABS NOT IN-USE AND RECHAIN THEM AT            */ 00229000
*/*             THE END OF THE DSAB CHAIN                            */ 00230000
*/*                                                                  */ 00231000
*/* OPERATION - THE INPUT DSAB IS MARKED NOT IN-USE. IF THE DSAB IS A*/ 00232000
*/*             MEMBER OF A CONCATENATED GROUP, THE LAST MEMBER OF   */ 00233000
*/*             THE GROUP IS DETERMINED, ITS ADDRESS PLACED IN       */ 00234000
*/*             DSABLAST, AND ALL MEMBERS OF THE GROUP ARE ALSO      */ 00235000
*/*             MARKED NOT IN-USE. (IF THE DSAB IS NOT CONCATENATED, */ 00236000
*/*             DSABLAST IS SET TO THE ADDRESS OF THE DSAB ITSELF.)  */ 00237000
*/*             IF THEY ARE NOT ALREADY LOCATED AT THE END OF THE    */ 00238000
*/*             CHAIN, THE DSABS FROM THE INPUT DSAB TO DSABLAST ARE */ 00239000
*/*             THEN MOVED TO THE END OF THE CHAIN IN THE FOLLOWING  */ 00240000
*/*             STEPS:                                               */ 00241000
*/*             - DSQBADFC IN THE DSABQDB IS SET SAYING THAT THE DSAB*/ 00242000
*/*               FORWARD CHAIN PTRS ARE NO LONGER VALID. IF THE     */ 00243000
*/*               ESTAE EXIT RTN (IEFDB402) GETS CONTROL, IT WILL    */ 00244000
*/*               USE THIS BIT, RECONSTRUCTING THE DSAB CHAIN FROM   */ 00245000
*/*               BACKWARD PTRS WHEN THIS BIT IS ON.                 */ 00246000
*/*             - THE NECESSARY FORWARD CHAIN PTRS ARE UPDATED,      */ 00247000
*/*               INCLUDING DSQFRSTP IF REQUIRED.                    */ 00248000
*/*             - DSQBADBC IN THE DSABQDB IS SET SAYING THAT THE     */ 00249000
*/*               DSAB BACKWARD CHAIN PTRS ARE NO LONGER VALID. THE  */ 00250000
*/*               ESTAE EXIT RTN (IEFDB402) WILL RECONSTRUCT THE     */ 00251000
*/*               DSAB CHAIN USING FORWARD PTRS IF THIS BIT IS ON    */ 00252000
*/*               AND DSQBADFC IS OFF. DSQBADFC IS THEN TURNED OFF.  */ 00253000
*/*             - THE NECESSARY BACKWARD CHAIN PTRS ARE UPDATED,     */ 00254000
*/*               INCLUDING DSQLASTP,AND DSQBADBC IS THEN TURNED OFF.*/ 00255000
*/*                                                                  */ 00256000
*/* ENTRY -                                                          */ 00257000
*/*   INPUT DATA - DSAB TO BE PROCESSED                              */ 00258000
*/*              - DSAB QBD                                          */ 00259000
*/*                                                                  */ 00260000
*/* EXIT -                                                           */ 00261000
*/*   OUTPUT DATA - DSABNUSE BIT SET OFF (FOR ALL MEMBERS OF A       */ 00262000
*/*                 CONCATENATED GROUP)                              */ 00263000
*/*               - DSAB(S) MOVED TO END OF CHAIN AND NECESSARY      */ 00264000
*/*                 PTRS IN DSABS AND QBD UPDATED TO REFLECT THIS    */ 00265000
*/*                 RECHAINING.                                      */ 00266000
*/*                                                                  */ 00267000
*/********************************************************************/ 00268000
*DSABCHNR: PROC;                                                02S0092 00269000
DSABCHNR STM   @14,@12,12(@13)                                  02S0092 00270000
*DSABNUSE = '0'B;                      /*SET DSAB NOT IN-USE         */ 00271000
         NI    DSABNUSE(DSABPTR),B'11111110'                    02S0093 00272000
*LASTDSAB = DSABPTR;                   /*INIT PTR TO LAST CONCAT DSAB*/ 00273000
         LR    LASTDSAB,DSABPTR                                 02S0094 00274000
*RFY DSAB BASED(LASTDSAB);             /*RESET DSAB BASE PTR         */ 00275000
*IF DSABCATM = '1'B THEN               /*IF DSAB IS IN CONCAT GROUP  */ 00276000
         TM    DSABCATM(LASTDSAB),B'00000010'                   02S0096 00277000
         BNO   @RF00096                                         02S0096 00278000
*  DO WHILE (DSABFCHN ¬= 0   &         /*PROCESS TO END OF CHAIN OR  */ 00279000
*           DSABFCHN->DSABTIOT->TIOEDDNM(1) = ' ');             02S0097 00280000
         B     @DE00097                                         02S0097 00281000
@DL00097 DS    0H                                               02S0098 00282000
*                                      /*TO END OF CONCAT GROUP      */ 00283000
*    LASTDSAB = LASTDSAB->DSABFCHN;    /*UPDATE LAST CONCAT DSABPTR  */ 00284000
         L     LASTDSAB,DSABFCHN(,LASTDSAB)                     02S0098 00285000
*    DSABNUSE = '0'B;                  /*SET THIS DSAB NOT IN-USE    */ 00286000
         NI    DSABNUSE(LASTDSAB),B'11111110'                   02S0099 00287000
*  END;                                /*END CONCAT DSAB PROCESS     */ 00288000
@DE00097 L     @10,DSABFCHN(,LASTDSAB)                          02S0100 00289000
         LTR   @10,@10                                          02S0100 00290000
         BZ    @DC00097                                         02S0100 00291000
         L     @10,DSABTIOT(,@10)                               02S0100 00292000
         CLI   TIOEDDNM(@10),C' '                               02S0100 00293000
         BE    @DL00097                                         02S0100 00294000
@DC00097 DS    0H                                               02S0101 00295000
*ELSE;                                 /*DSAB IS NOT CONCATENATED    */ 00296000
@RF00096 DS    0H                                               02S0102 00297000
*RFY DSAB BASED(DSABPTR);              /*RESET DSAB BASE PTR         */ 00298000
*IF LASTDSAB->DSABFCHN ¬= 0 THEN       /*IF DSAB (OR GROUP) IS NOT AT   00299000
*                                        END OF CHAIN ALREADY        */ 00300000
         SLR   @10,@10                                          02S0103 00301000
         L     @15,DSABFCHN(,LASTDSAB)                          02S0103 00302000
         CR    @15,@10                                          02S0103 00303000
         BE    @RF00103                                         02S0103 00304000
*  DO;                                 /*MOVE TO END OF DSAB CHAIN   */ 00305000
*    CHNRSAVP = LASTDSAB -> DSABFCHN;  /*SAVE PTR TO DSAB AFTER LAST    00306000
*                                        DSAB BEING MOVED            */ 00307000
         LR    CHNRSAVP,@15                                     02S0105 00308000
*    DSQBADFC = '1'B;                  /*SAY BAD FORWARD CHAIN PTRS  */ 00309000
         L     @05,@PC00001+16                                  02S0106 00310000
         L     @05,JSCBPTR(,@05)                                02S0106 00311000
         L     @05,JSCDSABQ(,@05)                               02S0106 00312000
         OI    DSQBADFC(@05),B'10000000'                        02S0106 00313000
*    IF DSABBCHN = 0 THEN              /*IF DSAB IS 1ST ON CHAIN     */ 00314000
         C     @10,DSABBCHN(,DSABPTR)                           02S0107 00315000
         BNE   @RF00107                                         02S0107 00316000
*      DSQFRSTP = LASTDSAB->DSABFCHN;  /*UPDATE NEW 1ST DSAB QDB PTR */ 00317000
         ST    @15,DSQFRSTP(,@05)                               02S0108 00318000
*    ELSE                              /*DSAB IS NOT 1ST ON CHAIN    */ 00319000
*      DSABBCHN->DSABFCHN = LASTDSAB->DSABFCHN; /*UPDATE FORWARD PTR    00320000
*                                        OF PRECEEDING DSAB ON CHAIN */ 00321000
         B     @RC00107                                         02S0109 00322000
@RF00107 L     @10,DSABBCHN(,DSABPTR)                           02S0109 00323000
         L     @05,DSABFCHN(,LASTDSAB)                          02S0109 00324000
         ST    @05,DSABFCHN(,@10)                               02S0109 00325000
*    DSQLASTP->DSABFCHN = DSABPTR;     /*UPDATE FORWARD PTR OF CURRENT  00326000
*                                        LAST DSAB ON CHAIN          */ 00327000
@RC00107 L     @10,@PC00001+16                                  02S0110 00328000
         L     @10,JSCBPTR(,@10)                                02S0110 00329000
         L     @10,JSCDSABQ(,@10)                               02S0110 00330000
         L     @05,DSQLASTP(,@10)                               02S0110 00331000
         ST    DSABPTR,DSABFCHN(,@05)                           02S0110 00332000
*    LASTDSAB->DSABFCHN = 0;           /*NEW LAST DSAB ON CHAIN HAS     00333000
*                                        FORWARD PTR OF ZERO         */ 00334000
         SLR   @05,@05                                          02S0111 00335000
         ST    @05,DSABFCHN(,LASTDSAB)                          02S0111 00336000
*    DSQBADBC = '1'B;                  /*SAY BAD BACKWARD CHAIN PTRS */ 00337000
         OI    DSQBADBC(@10),B'10000000'                        02S0112 00338000
*    DSQBADFC = '0'B;                  /*FORWARD PTRS ARE GOOD NOW   */ 00339000
         NI    DSQBADFC(@10),B'01111111'                        02S0113 00340000
*    CHNRSAVP->DSABBCHN = DSABBCHN;    /*UPDATE BACK PTR OF DSAB NEXT   00341000
*                                        AFTER LAST ONE MOVED        */ 00342000
         L     @05,DSABBCHN(,DSABPTR)                           02S0114 00343000
         ST    @05,DSABBCHN(,CHNRSAVP)                          02S0114 00344000
*    DSABBCHN = DSQLASTP;              /*NEW BACK PTR FOR 1ST DSAB      00345000
*                                        MOVED TO END OF CHAIN       */ 00346000
         L     @15,DSQLASTP(,@10)                               02S0115 00347000
         ST    @15,DSABBCHN(,DSABPTR)                           02S0115 00348000
*    DSQLASTP = LASTDSAB;              /*UPDATE NEW QDB LAST DSAB PTR*/ 00349000
         ST    LASTDSAB,DSQLASTP(,@10)                          02S0116 00350000
*    DSQBADBC = '0'B;                  /*DSAB BACK PTRS ARE GOOD NOW */ 00351000
         NI    DSQBADBC(@10),B'01111111'                        02S0117 00352000
*  END;                                /*END DSAB CHAINING PROCESS   */ 00353000
*ELSE;                                 /*DSAB (GROUP) ALREADY AT END OF 00354000
*                                        CHAIN; NO CHAINING REQUIRED */ 00355000
@RF00103 DS    0H                                               02S0120 00356000
*END DSABCHNR;                                                  02S0120 00357000
@EL00002 DS    0H                                               02S0120 00358000
@EF00002 DS    0H                                               02S0120 00359000
@ER00002 LM    @14,@12,12(@13)                                  02S0120 00360000
         BR    @14                                              02S0120 00361000
*END IEFDB481                                                   01S0121 00362000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00363000
*/*%INCLUDE SYSLIB  (RIUPCSSP)                                        * 00364000
*/*%INCLUDE SYSLIB  (RIUPCSDT)                                        * 00365000
*/*%INCLUDE SYSLIB  (IEFZB4D9)                                        * 00366000
*/*%INCLUDE SYSLIB  (IHADSAB )                                        * 00367000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                        * 00368000
*/*%INCLUDE SYSLIB  (IEFASIOT)                                        * 00369000
*/*%INCLUDE SYSLIB  (IEFZB505)                                        * 00370000
*/*%INCLUDE SYSLIB  (IHAQDB  )                                        * 00371000
*/*%INCLUDE SYSLIB  (IEFZB4D5)                                        * 00372000
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                        * 00373000
*/*%INCLUDE SYSLIB  (DISPPRCR)                                        * 00374000
*/*%INCLUDE SYSLIB  (DISPPRCS)                                        * 00375000
*/*%INCLUDE SYSLIB  (DSABCHNR)                                        * 00376000
*/*%INCLUDE SYSLIB  (DSABCHNS)                                        * 00377000
*;                                                              01S0121 00378000
@DATA    DS    0H                                                       00379000
@DATD    DSECT                                                          00380000
         DS    0F                                                       00381000
@SA00001 DS    18F                                                      00382000
@PC00001 DS    7F                                                       00383000
@AL00001 DS    8A                                                       00384000
@TF00001 DS    F                                                        00385000
IEFDB481 CSECT                                                          00386000
         DS    0F                                                       00387000
@CF00115 DC    F'1'                                                     00388000
@CF00585 DC    F'176'                                                   00389000
@CF00594 DC    F'-4'                                                    00390000
@CF00072 DC    XL4'E6000000'                                            00391000
@DATD    DSECT                                                          00392000
         DS    0D                                                       00393000
SWEPAPTR DS    A                                                        00394000
ULSTINDX DS    F                                                        00395000
TCBJSCB  DS    A                                                        00396000
SIOTPTR  DS    A                                                        00397000
QDBPTR   DS    A                                                        00398000
TIOTPTR  DS    A                                                        00399000
DUMRSNCD DS    CL4                                                      00400000
UNALKEYT DS    CL40                                                     00401000
WRKBITS  DS    BL1                                                      00402000
IEFDB481 CSECT                                                          00403000
         DS    0F                                                       00404000
@SIZDATD DC    AL1(230)                                                 00405000
         DC    AL3(@ENDDATD-@DATD)                                      00406000
@CV00075 DC    V(IEFDB4A1)                                              00407000
         DS    0D                                                       00408000
IEFDB481 CSECT                                                          00409000
         DS   0H                                                        00410000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   00411000
@DATD    DSECT                                                          00412000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00413000
@ENDDATD EQU   *                                                        00414000
IEFDB481 CSECT                                                          00415000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00416000
@01      EQU   01                                                       00417000
@02      EQU   02                                                       00418000
@03      EQU   03                                                       00419000
@04      EQU   04                                                       00420000
@05      EQU   05                                                       00421000
@06      EQU   06                                                       00422000
@07      EQU   07                                                       00423000
@08      EQU   08                                                       00424000
@09      EQU   09                                                       00425000
@10      EQU   10                                                       00426000
@11      EQU   11                                                       00427000
@12      EQU   12                                                       00428000
@13      EQU   13                                                       00429000
@14      EQU   14                                                       00430000
@15      EQU   15                                                       00431000
CHNRSAVP EQU   @04                                                      00432000
LASTDSAB EQU   @02                                                      00433000
RLSTINDX EQU   @04                                                      00434000
DSABPTR  EQU   @03                                                      00435000
R0       EQU   @00                                                      00436000
R1       EQU   @01                                                      00437000
RDSABLST EQU   0                                                        00438000
UDSABLST EQU   0                                                        00439000
DSAB     EQU   0                                                        00440000
DSABFCHN EQU   DSAB+4                                                   00441000
DSABBCHN EQU   DSAB+8                                                   00442000
DSABOPCT EQU   DSAB+14                                                  00443000
DSABTIOT EQU   DSAB+16                                                  00444000
DSABGIDP EQU   DSAB+24                                                  00445000
DSABANMP EQU   DSAB+28                                                  00446000
DSABORG  EQU   DSAB+32                                                  00447000
DSABORG1 EQU   DSABORG                                                  00448000
DSABORG2 EQU   DSABORG+1                                                00449000
DSABFLG1 EQU   DSAB+34                                                  00450000
DSABPALC EQU   DSABFLG1                                                 00451000
DSABCATM EQU   DSABFLG1                                                 00452000
DSABNUSE EQU   DSABFLG1                                                 00453000
DSABFLG2 EQU   DSAB+35                                                  00454000
DSABFLG3 EQU   DSAB+36                                                  00455000
DSABFLG4 EQU   DSAB+37                                                  00456000
DSABSIOT EQU   DSAB+64                                                  00457000
DSABANMI EQU   0                                                        00458000
DSABANAM EQU   DSABANMI+1                                               00459000
DSABGIDL EQU   0                                                        00460000
IEZJSCB  EQU   0                                                        00461000
JSCBSEC1 EQU   IEZJSCB+188                                              00462000
JSCHPCE  EQU   JSCBSEC1+4                                               00463000
JSCBDCB  EQU   JSCBSEC1+36                                              00464000
JSCBOPTS EQU   JSCBSEC1+48                                              00465000
JSCBSWT1 EQU   JSCBSEC1+55                                              00466000
JSCBWTP  EQU   JSCBSEC1+64                                              00467000
JSCBWTFG EQU   JSCBWTP                                                  00468000
JSCBEND1 EQU   IEZJSCB+260                                              00469000
INDMSIOT EQU   0                                                        00470000
SIOTDSKA EQU   INDMSIOT                                                 00471000
SCTUSADD EQU   INDMSIOT+20                                              00472000
SIOTBYT1 EQU   INDMSIOT+43                                              00473000
SIOTBYT3 EQU   INDMSIOT+46                                              00474000
SIOTTSTC EQU   INDMSIOT+47                                              00475000
SIOTBYT0 EQU   INDMSIOT+52                                              00476000
SCTSDISP EQU   INDMSIOT+55                                              00477000
SIOTDLET EQU   SCTSDISP                                                 00478000
SCTSBYT1 EQU   INDMSIOT+56                                              00479000
SCTSBYT2 EQU   INDMSIOT+57                                              00480000
SCTSBYT3 EQU   INDMSIOT+58                                              00481000
SCTSBYT4 EQU   INDMSIOT+59                                              00482000
SCTUTYPE EQU   INDMSIOT+60                                              00483000
SIOTDEVT EQU   SCTUTYPE                                                 00484000
SIOUBYT3 EQU   SIOTDEVT+2                                               00485000
SIOTALTD EQU   INDMSIOT+92                                              00486000
SIOTBYT2 EQU   INDMSIOT+103                                             00487000
SWAEPA   EQU   0                                                        00488000
SWBLKPTR EQU   SWAEPA                                                   00489000
SWVAFW   EQU   SWAEPA+4                                                 00490000
SWVA     EQU   SWVAFW                                                   00491000
SWBLKID  EQU   SWVAFW+3                                                 00492000
SWLNGTH  EQU   SWAEPA+8                                                 00493000
SWCHNPTR EQU   SWAEPA+12                                                00494000
QDB      EQU   0                                                        00495000
TIOT1    EQU   0                                                        00496000
TIOENTRY EQU   0                                                        00497000
TIOESTTA EQU   TIOENTRY+1                                               00498000
TIOERLOC EQU   TIOENTRY+2                                               00499000
TIOELINK EQU   TIOERLOC+1                                               00500000
TIOESYOT EQU   TIOELINK                                                 00501000
TIOEDDNM EQU   TIOENTRY+4                                               00502000
TIOESTTC EQU   TIOENTRY+15                                              00503000
TIOESTTB EQU   TIOENTRY+16                                              00504000
POOLSTAR EQU   TIOENTRY+20                                              00505000
RDSABSP  EQU   0                                                        00506000
RDSABCNT EQU   0                                                        00507000
RSNCODE  EQU   0                                                        00508000
LASTEPAP EQU   0                                                        00509000
CTLBLKPS EQU   0                                                        00510000
JSCBPTR  EQU   CTLBLKPS                                                 00511000
DEPARMS  EQU   0                                                        00512000
DENQRETN EQU   DEPARMS+232                                              00513000
DEDMYEPA EQU   DEPARMS+240                                              00514000
DEDMYAS  EQU   DEPARMS+260                                              00515000
SMFPARMS EQU   0                                                        00516000
JSCBSEC2 EQU   JSCBEND1                                                 00517000
JSCBSEC3 EQU   JSCBEND1                                                 00518000
JSCBJCT  EQU   JSCBSEC3                                                 00519000
JSCBJCTA EQU   JSCBJCT+1                                                00520000
JSCBASID EQU   JSCBSEC3+8                                               00521000
JSCBJNL  EQU   JSCBSEC3+28                                              00522000
JSCBJJSB EQU   JSCBJNL                                                  00523000
JSCBSUB  EQU   JSCBSEC3+40                                              00524000
JSCDSABQ EQU   JSCBSEC3+60                                              00525000
JSCSCT   EQU   JSCBSEC3+68                                              00526000
JSCRSV35 EQU   JSCBSEC3+96                                              00527000
JSCRSV36 EQU   JSCRSV35                                                 00528000
JSCRSV37 EQU   JSCRSV35+2                                               00529000
JSCRSV45 EQU   JSCBSEC3+112                                             00530000
JSCRSV46 EQU   JSCRSV45                                                 00531000
JSCRSV47 EQU   JSCRSV45+2                                               00532000
DSABQDB  EQU   QDB                                                      00533000
DSQFRSTP EQU   DSABQDB+12                                               00534000
DSQBADBC EQU   DSQFRSTP                                                 00535000
DSQLASTP EQU   DSABQDB+16                                               00536000
DSQBADFC EQU   DSQLASTP                                                 00537000
TIOEDEVE EQU   TIOESTTB                                                 00538000
TIOSTTB  EQU   TIOEDEVE                                                 00539000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00540000
TIOUCBP  EQU   TIOEDEVE+1                                               00541000
TIOVERF  EQU   TIOSTTB                                                  00542000
TIOUNLD  EQU   TIOSTTB                                                  00543000
TIOMNTD  EQU   TIOSTTB                                                  00544000
TIOSETU  EQU   TIOSTTB                                                  00545000
TIOVLSR  EQU   TIOSTTB                                                  00546000
TIOPVIO  EQU   TIOSTTB                                                  00547000
TIOREQD  EQU   TIOSTTB                                                  00548000
TIOUSED  EQU   TIOSTTB                                                  00549000
@NM00030 EQU   DSABQDB+24                                               00550000
DSQBDSP  EQU   DSABQDB+22                                               00551000
DSQFDSP  EQU   DSABQDB+20                                               00552000
DSQNELMS EQU   DSABQDB+8                                                00553000
DSQDBLN  EQU   DSABQDB+6                                                00554000
DSQATTRS EQU   DSABQDB+4                                                00555000
DSQDBID  EQU   DSABQDB                                                  00556000
JSCBEND3 EQU   JSCBSEC3+120                                             00557000
JSCRSV52 EQU   JSCBSEC3+116                                             00558000
JSCRSV51 EQU   JSCRSV47+1                                               00559000
JSCRSV50 EQU   JSCRSV47                                                 00560000
JSCRSV49 EQU   JSCRSV46+1                                               00561000
JSCRSV48 EQU   JSCRSV46                                                 00562000
JSCRSV44 EQU   JSCBSEC3+108                                             00563000
JSCRSV43 EQU   JSCBSEC3+104                                             00564000
JSCRSV42 EQU   JSCBSEC3+100                                             00565000
JSCRSV41 EQU   JSCRSV37+1                                               00566000
JSCRSV40 EQU   JSCRSV37                                                 00567000
JSCRSV39 EQU   JSCRSV36+1                                               00568000
JSCRSV38 EQU   JSCRSV36                                                 00569000
JSCBUFPT EQU   JSCBSEC3+92                                              00570000
JSCBACT  EQU   JSCBSEC3+88                                              00571000
JSCBSWSP EQU   JSCBSEC3+87                                              00572000
JSCRSV33 EQU   JSCBSEC3+86                                              00573000
JSCDDNUM EQU   JSCBSEC3+84                                              00574000
JSCRSV53 EQU   JSCBSEC3+82                                              00575000
JSCDDNNO EQU   JSCBSEC3+80                                              00576000
JSCBVATA EQU   JSCBSEC3+76                                              00577000
JSCTMCOR EQU   JSCBSEC3+72                                              00578000
JSCSCTP  EQU   JSCSCT+1                                                 00579000
JSCRSV55 EQU   JSCSCT                                                   00580000
JSCRSV54 EQU   JSCBSEC3+64                                              00581000
JSCBSSIB EQU   JSCBSEC3+56                                              00582000
JSCBFRBA EQU   JSCBSEC3+48                                              00583000
JSCRSV28 EQU   JSCBSEC3+46                                              00584000
JSCBSONO EQU   JSCBSEC3+44                                              00585000
JSCBSUBA EQU   JSCBSUB+1                                                00586000
JSCRSV31 EQU   JSCBSUB                                                  00587000
JSCBSMLR EQU   JSCBSEC3+36                                              00588000
JSCBJNLR EQU   JSCBSEC3+32                                              00589000
JSCBJNLA EQU   JSCBJNL+1                                                00590000
JSCBJSBT EQU   JSCBJJSB                                                 00591000
JSCBJSBX EQU   JSCBJJSB                                                 00592000
JSCBJSBA EQU   JSCBJJSB                                                 00593000
JSCBJSBI EQU   JSCBJJSB                                                 00594000
@NM00012 EQU   JSCBJJSB                                                 00595000
JSCBJNLE EQU   JSCBJJSB                                                 00596000
JSCBJNLF EQU   JSCBJJSB                                                 00597000
JSCBJNLN EQU   JSCBJJSB                                                 00598000
@NM00011 EQU   JSCBSEC3+24                                              00599000
JSCBJRBA EQU   JSCBSEC3+16                                              00600000
JSCBIECB EQU   JSCBSEC3+12                                              00601000
JSCRSV25 EQU   JSCBSEC3+10                                              00602000
JSCBTJID EQU   JSCBASID                                                 00603000
JSCBPSCB EQU   JSCBSEC3+4                                               00604000
JSCJCTP  EQU   JSCBJCTA                                                 00605000
JSCRSV24 EQU   JSCBJCT                                                  00606000
JSCBEND2 EQU   JSCBSEC2                                                 00607000
SMFBUFLP EQU   SMFPARMS+4                                               00608000
SMFBUF1P EQU   SMFPARMS                                                 00609000
@NM00003 EQU   DEPARMS+304                                              00610000
DETCTIOL EQU   DEPARMS+300                                              00611000
DETCTIOP EQU   DEPARMS+296                                              00612000
DETDQLST EQU   DEPARMS+280                                              00613000
DEALASTP EQU   DEPARMS+276                                              00614000
DEASGNP  EQU   DEDMYAS+12                                               00615000
@NM00002 EQU   DEDMYAS                                                  00616000
DEWLASTP EQU   DEPARMS+256                                              00617000
DEWRITP  EQU   DEDMYEPA+12                                              00618000
@NM00001 EQU   DEDMYEPA                                                 00619000
DEDSNQRC EQU   DENQRETN+4                                               00620000
DEDSNQEN EQU   DENQRETN                                                 00621000
DECPYLEN EQU   DEPARMS+228                                              00622000
DECPYLOC EQU   DEPARMS+224                                              00623000
DEJSCB   EQU   DEPARMS+220                                              00624000
DESCT    EQU   DEPARMS+216                                              00625000
DEJCT    EQU   DEPARMS+212                                              00626000
DESIOT   EQU   DEPARMS+208                                              00627000
DETCB    EQU   DEPARMS+204                                              00628000
DEALFMAP EQU   DEPARMS+200                                              00629000
DECORE   EQU   DEPARMS                                                  00630000
SCTPTR   EQU   CTLBLKPS+16                                              00631000
JCTPTR   EQU   CTLBLKPS+12                                              00632000
TCBPTR   EQU   CTLBLKPS+8                                               00633000
ASCBPTR  EQU   CTLBLKPS+4                                               00634000
INFOCODE EQU   RSNCODE+2                                                00635000
ERRCODE  EQU   RSNCODE                                                  00636000
TIOTFEND EQU   POOLSTAR+16                                              00637000
TIOPSLOT EQU   POOLSTAR+13                                              00638000
TIOPSTTB EQU   POOLSTAR+12                                              00639000
TIOPPOOL EQU   POOLSTAR+4                                               00640000
TIOPNSRT EQU   POOLSTAR+3                                               00641000
@NM00032 EQU   POOLSTAR+2                                               00642000
TIOPNSLT EQU   POOLSTAR+1                                               00643000
@NM00031 EQU   POOLSTAR                                                 00644000
TIOEFSRT EQU   TIOENTRY+17                                              00645000
TIOSVERF EQU   TIOESTTB                                                 00646000
TIOSUNLD EQU   TIOESTTB                                                 00647000
TIOSMNTD EQU   TIOESTTB                                                 00648000
TIOSSETU EQU   TIOESTTB                                                 00649000
TIOSVLSR EQU   TIOESTTB                                                 00650000
TIOSPVIO EQU   TIOESTTB                                                 00651000
TIOSREQD EQU   TIOESTTB                                                 00652000
TIOSUSED EQU   TIOESTTB                                                 00653000
TIOSBALS EQU   TIOESTTC                                                 00654000
TIOSBALP EQU   TIOESTTC                                                 00655000
TIOSVOLS EQU   TIOESTTC                                                 00656000
TIOSVOLP EQU   TIOESTTC                                                 00657000
TIOSAFFS EQU   TIOESTTC                                                 00658000
TIOSAFFP EQU   TIOESTTC                                                 00659000
TIOSDEFR EQU   TIOESTTC                                                 00660000
TIOSDKCR EQU   TIOESTTC                                                 00661000
TIOEJFCB EQU   TIOENTRY+12                                              00662000
TIOTREM  EQU   TIOELINK                                                 00663000
TIOESSDS EQU   TIOESYOT                                                 00664000
TIOESYIN EQU   TIOELINK                                                 00665000
TIOEQNAM EQU   TIOELINK                                                 00666000
TIOEDYNM EQU   TIOELINK                                                 00667000
TIOTTERM EQU   TIOELINK                                                 00668000
TIOTRV01 EQU   TIOELINK                                                 00669000
TIOSYOUT EQU   TIOELINK                                                 00670000
TIOEWTCT EQU   TIOERLOC                                                 00671000
TIOSDSP2 EQU   TIOESTTA                                                 00672000
TIOSDSP1 EQU   TIOESTTA                                                 00673000
TIOSLABL EQU   TIOESTTA                                                 00674000
TIOSDADS EQU   TIOESTTA                                                 00675000
TIOSJBLB EQU   TIOESTTA                                                 00676000
TIOSPLTS EQU   TIOESTTA                                                 00677000
TIOSPLTP EQU   TIOESTTA                                                 00678000
TIOSLTYP EQU   TIOESTTA                                                 00679000
TIOELNGH EQU   TIOENTRY                                                 00680000
TIOCSTEP EQU   TIOT1+8                                                  00681000
TIOCNJOB EQU   TIOT1                                                    00682000
QDBRV002 EQU   QDB+28                                                   00683000
QDBPRDS  EQU   QDB+26                                                   00684000
QDBPRSZ  EQU   QDB+24                                                   00685000
QDBBPTDS EQU   QDB+22                                                   00686000
QDBFPTDS EQU   QDB+20                                                   00687000
QDBLELMP EQU   QDB+16                                                   00688000
QDBFELMP EQU   QDB+12                                                   00689000
QDBNELMS EQU   QDB+8                                                    00690000
QDBRV001 EQU   QDB+6                                                    00691000
QDBATTR  EQU   QDB+4                                                    00692000
QDBQDB   EQU   QDB                                                      00693000
SIODDSNL EQU   INDMSIOT+173                                             00694000
SIOVDSNL EQU   INDMSIOT+172                                             00695000
SIOVDSNT EQU   INDMSIOT+170                                             00696000
SVOLUNNO EQU   INDMSIOT+168                                             00697000
SIOTVMVP EQU   INDMSIOT+164                                             00698000
SIOTJFX  EQU   INDMSIOT+160                                             00699000
SJFCBPTR EQU   INDMSIOT+156                                             00700000
SIOTNPTR EQU   INDMSIOT+152                                             00701000
SIOTETIO EQU   INDMSIOT+148                                             00702000
SIOTATE  EQU   INDMSIOT+144                                             00703000
SVOLUNAD EQU   INDMSIOT+140                                             00704000
SIOTEDLP EQU   INDMSIOT+136                                             00705000
SIOTEDLS EQU   INDMSIOT+132                                             00706000
SIOTRSNC EQU   INDMSIOT+130                                             00707000
SCTANAME EQU   INDMSIOT+122                                             00708000
@NM00029 EQU   INDMSIOT+108                                             00709000
SIOTSSNM EQU   INDMSIOT+104                                             00710000
SIODDQCR EQU   SIOTBYT2                                                 00711000
SIOVDQCR EQU   SIOTBYT2                                                 00712000
SIOTCVOL EQU   SIOTBYT2                                                 00713000
SIOTCNEW EQU   SIOTBYT2                                                 00714000
SIOTCALC EQU   SIOTBYT2                                                 00715000
SIOTGALL EQU   SIOTBYT2                                                 00716000
SIOTDSPD EQU   SIOTBYT2                                                 00717000
SIOTDMND EQU   SIOTBYT2                                                 00718000
SIOTOPUC EQU   INDMSIOT+99                                              00719000
SIOTOUTR EQU   INDMSIOT+97                                              00720000
SIOTOUTC EQU   INDMSIOT+96                                              00721000
@NM00028 EQU   INDMSIOT+93                                              00722000
SIOTAUNC EQU   SIOTALTD                                                 00723000
SIOTACAT EQU   SIOTALTD                                                 00724000
SIOTADEL EQU   SIOTALTD                                                 00725000
SIOTAKEP EQU   SIOTALTD                                                 00726000
SIOTNPRV EQU   SIOTALTD                                                 00727000
SIOJCATS EQU   SIOTALTD                                                 00728000
@NM00027 EQU   SIOTALTD                                                 00729000
@NM00026 EQU   SIOTALTD                                                 00730000
@NM00025 EQU   INDMSIOT+91                                              00731000
SIOTNDSB EQU   INDMSIOT+88                                              00732000
@NM00024 EQU   INDMSIOT+84                                              00733000
SIOTDPCD EQU   INDMSIOT+82                                              00734000
@NM00023 EQU   INDMSIOT+81                                              00735000
SCTOUTPN EQU   INDMSIOT+80                                              00736000
SCTOUTNO EQU   INDMSIOT+76                                              00737000
SCTOUTNM EQU   INDMSIOT+68                                              00738000
SIOUCBAD EQU   SCTUTYPE+5                                               00739000
SIOUCNVT EQU   SCTUTYPE+4                                               00740000
SIOUBYT4 EQU   SIOTDEVT+3                                               00741000
@NM00022 EQU   SIOUBYT3                                                 00742000
SIO3UREC EQU   SIOUBYT3                                                 00743000
SIO3DISP EQU   SIOUBYT3                                                 00744000
SIO3DACC EQU   SIOUBYT3                                                 00745000
SIO3COMM EQU   SIOUBYT3                                                 00746000
SIO3TAPE EQU   SIOUBYT3                                                 00747000
SIOUBYT2 EQU   SIOTDEVT+1                                               00748000
SIOUBYT1 EQU   SIOTDEVT                                                 00749000
SIOTOMN  EQU   SCTSBYT4                                                 00750000
SIOTIPDI EQU   SCTSBYT4                                                 00751000
SIOTVAFF EQU   SCTSBYT4                                                 00752000
SIOTSTEP EQU   SCTSBYT4                                                 00753000
SIOTASCI EQU   SCTSBYT4                                                 00754000
@NM00021 EQU   SCTSBYT4                                                 00755000
SIOTGDGA EQU   SCTSBYT4                                                 00756000
SCTSGDGS EQU   SCTSBYT4                                                 00757000
SCTSOLD  EQU   SCTSBYT3                                                 00758000
SCTSMOD  EQU   SCTSBYT3                                                 00759000
SCTSNEW  EQU   SCTSBYT3                                                 00760000
SCTSYSOU EQU   SCTSBYT3                                                 00761000
SCTVREF  EQU   SCTSBYT3                                                 00762000
@NM00020 EQU   SCTSBYT3                                                 00763000
SCTSYSNE EQU   SCTSBYT3                                                 00764000
SCTDSNRF EQU   SCTSBYT3                                                 00765000
SCTRECVD EQU   SCTSBYT2                                                 00766000
SCTDEFER EQU   SCTSBYT2                                                 00767000
SCTLABEL EQU   SCTSBYT2                                                 00768000
SCTUNLBD EQU   SCTSBYT2                                                 00769000
SCTJOBLB EQU   SCTSBYT2                                                 00770000
SCTVOLAF EQU   SCTSBYT2                                                 00771000
SIOTCATL EQU   SCTSBYT2                                                 00772000
SIOCLUNL EQU   SCTSBYT2                                                 00773000
SIOTJSCT EQU   SCTSBYT1                                                 00774000
SCTUNAFF EQU   SCTSBYT1                                                 00775000
SCTPARLM EQU   SCTSBYT1                                                 00776000
SIOTQDSN EQU   SCTSBYT1                                                 00777000
SIOTGDSN EQU   SCTSBYT1                                                 00778000
SIOTCCAT EQU   SCTSBYT1                                                 00779000
SCTSYSIN EQU   SCTSBYT1                                                 00780000
SCTDUMMY EQU   SCTSBYT1                                                 00781000
SIOTUNCT EQU   SCTSDISP                                                 00782000
SIOTCTLG EQU   SCTSDISP                                                 00783000
SIOTKEEP EQU   SCTSDISP                                                 00784000
SIOTPASS EQU   SCTSDISP                                                 00785000
SIOTPRIV EQU   SCTSDISP                                                 00786000
S3400DSP EQU   SCTSDISP                                                 00787000
@NM00019 EQU   SCTSDISP                                                 00788000
SIOTVLCT EQU   INDMSIOT+54                                              00789000
SCTNMBUT EQU   INDMSIOT+53                                              00790000
SIOTRTRY EQU   SIOTBYT0                                                 00791000
SIOTPUPV EQU   SIOTBYT0                                                 00792000
SIOTNOPV EQU   SIOTBYT0                                                 00793000
SIOTGIGN EQU   SIOTBYT0                                                 00794000
SPVTAMSG EQU   SIOTBYT0                                                 00795000
SIOTFUDA EQU   SIOTBYT0                                                 00796000
SIOTDYAL EQU   SIOTBYT0                                                 00797000
SIOTSSDS EQU   SIOTBYT0                                                 00798000
SIOTGIID EQU   INDMSIOT+50                                              00799000
SCTVOLCT EQU   INDMSIOT+49                                              00800000
SCTSPOOL EQU   INDMSIOT+48                                              00801000
SIOTQNAM EQU   SIOTTSTC                                                 00802000
@NM00018 EQU   SIOTTSTC                                                 00803000
SIOTTERM EQU   SIOTTSTC                                                 00804000
@NM00017 EQU   SIOTTSTC                                                 00805000
@NM00016 EQU   SIOTBYT3                                                 00806000
SIOTJES3 EQU   SIOTBYT3                                                 00807000
SIOCDEVT EQU   SIOTBYT3                                                 00808000
SIOALIAS EQU   SIOTBYT3                                                 00809000
SCTDDINO EQU   INDMSIOT+44                                              00810000
SIOTDDNT EQU   SIOTBYT1                                                 00811000
SIOTALCD EQU   SIOTBYT1                                                 00812000
SIODADSM EQU   SIOTBYT1                                                 00813000
SIOTDADR EQU   SIOTBYT1                                                 00814000
SIODUNAL EQU   SIOTBYT1                                                 00815000
SIOVAMDS EQU   SIOTBYT1                                                 00816000
SIOTHOLD EQU   SIOTBYT1                                                 00817000
SIOTOCKP EQU   SIOTBYT1                                                 00818000
SIOPSCNT EQU   INDMSIOT+42                                              00819000
SIOTREFN EQU   INDMSIOT+40                                              00820000
SIOTOTUN EQU   INDMSIOT+39                                              00821000
SIOTVRSB EQU   INDMSIOT+36                                              00822000
@NM00015 EQU   INDMSIOT+35                                              00823000
SCTPJFCB EQU   INDMSIOT+32                                              00824000
@NM00014 EQU   INDMSIOT+31                                              00825000
SCTPSIOT EQU   INDMSIOT+28                                              00826000
SIOTAFID EQU   INDMSIOT+26                                              00827000
@NM00013 EQU   INDMSIOT+24                                              00828000
SIODSNTE EQU   INDMSIOT+22                                              00829000
SIOTUNAF EQU   SCTUSADD                                                 00830000
SIOTDEST EQU   INDMSIOT+12                                              00831000
SCTDDNAM EQU   INDMSIOT+4                                               00832000
SIOTTYPE EQU   INDMSIOT+3                                               00833000
JSCBCSCB EQU   JSCBSEC1+68                                              00834000
JSCBPMG  EQU   JSCBWTP+2                                                00835000
JSCBWTSP EQU   JSCBWTP+1                                                00836000
JSCRSV23 EQU   JSCBWTFG                                                 00837000
JSCRSV22 EQU   JSCBWTFG                                                 00838000
JSCRSV21 EQU   JSCBWTFG                                                 00839000
JSCRSV20 EQU   JSCBWTFG                                                 00840000
JSCRSV19 EQU   JSCBWTFG                                                 00841000
JSCRSV18 EQU   JSCBWTFG                                                 00842000
JSCBRET  EQU   JSCBWTFG                                                 00843000
JSCBIOFG EQU   JSCBWTFG                                                 00844000
@NM00010 EQU   JSCBSEC1+60                                              00845000
JSCBQMPI EQU   JSCBSEC1+56                                              00846000
JSCBPMSG EQU   JSCBSWT1                                                 00847000
JSCRSV16 EQU   JSCBSWT1                                                 00848000
JSCRSV15 EQU   JSCBSWT1                                                 00849000
JSCRSV14 EQU   JSCBSWT1                                                 00850000
JSCRSV13 EQU   JSCBSWT1                                                 00851000
JSCRSV12 EQU   JSCBSWT1                                                 00852000
JSCRSV11 EQU   JSCBSWT1                                                 00853000
JSCBPASS EQU   JSCBSWT1                                                 00854000
JSCBTTTR EQU   JSCBSEC1+52                                              00855000
JSCRSV10 EQU   JSCBSEC1+49                                              00856000
JSCBAUTH EQU   JSCBOPTS                                                 00857000
JSCSIOTS EQU   JSCBOPTS                                                 00858000
JSCRSV08 EQU   JSCBOPTS                                                 00859000
JSCRSV07 EQU   JSCBOPTS                                                 00860000
JSCRSV06 EQU   JSCBOPTS                                                 00861000
JSCBLONG EQU   JSCBOPTS                                                 00862000
JSCRSV05 EQU   JSCBOPTS                                                 00863000
JSCRSV04 EQU   JSCBOPTS                                                 00864000
JSCBSECB EQU   JSCBSEC1+44                                              00865000
JSCRSV03 EQU   JSCBSEC1+41                                              00866000
JSCBSTEP EQU   JSCBSEC1+40                                              00867000
JSCBDCBA EQU   JSCBDCB+1                                                00868000
JSCRSV02 EQU   JSCBDCB                                                  00869000
JSCBID   EQU   JSCBSEC1+32                                              00870000
JSCBDBTB EQU   JSCBSEC1+28                                              00871000
JSCBIJSC EQU   JSCBSEC1+24                                              00872000
JSCBTCBP EQU   JSCBSEC1+20                                              00873000
JSCBPCC  EQU   JSCBSEC1+16                                              00874000
JSCBTCP  EQU   JSCBSEC1+12                                              00875000
JSCBSHR  EQU   JSCBSEC1+8                                               00876000
JSCHPCEA EQU   JSCHPCE+1                                                00877000
JSCRSV32 EQU   JSCHPCE                                                  00878000
JSCRSV01 EQU   JSCBSEC1                                                 00879000
@NM00009 EQU   IEZJSCB                                                  00880000
DSABGRID EQU   DSABGIDL+4                                               00881000
DSABLLEN EQU   DSABGIDL                                                 00882000
DSABANML EQU   DSABANMI                                                 00883000
DSABRS04 EQU   DSAB+68                                                  00884000
DSABRS03 EQU   DSAB+62                                                  00885000
DSABDCBM EQU   DSAB+56                                                  00886000
DSABSSCM EQU   DSAB+52                                                  00887000
DSABSSNM EQU   DSAB+48                                                  00888000
DSABPTTR EQU   DSAB+44                                                  00889000
DSABTCBP EQU   DSAB+40                                                  00890000
DSABRS02 EQU   DSAB+38                                                  00891000
@NM00008 EQU   DSABFLG4                                                 00892000
DSABCKSI EQU   DSABFLG4                                                 00893000
DSABCKVL EQU   DSABFLG4                                                 00894000
DSABCKDS EQU   DSABFLG4                                                 00895000
@NM00007 EQU   DSABFLG3                                                 00896000
DSABJSCT EQU   DSABFLG3                                                 00897000
DSABCATL EQU   DSABFLG3                                                 00898000
DSABVMSC EQU   DSABFLG3                                                 00899000
DSABVAM  EQU   DSABFLG3                                                 00900000
DSABPASS EQU   DSABFLG3                                                 00901000
DSABDEFR EQU   DSABFLG3                                                 00902000
@NM00006 EQU   DSABFLG2                                                 00903000
DSABUNAL EQU   DSABFLG2                                                 00904000
DSABIRM  EQU   DSABFLG2                                                 00905000
DSABOPEN EQU   DSABFLG2                                                 00906000
DSABPCAT EQU   DSABFLG1                                                 00907000
DSABDCAT EQU   DSABFLG1                                                 00908000
DSABCONV EQU   DSABFLG1                                                 00909000
DSABDCNV EQU   DSABFLG1                                                 00910000
DSABDALC EQU   DSABFLG1                                                 00911000
@NM00005 EQU   DSABORG2                                                 00912000
DSABTR   EQU   DSABORG2                                                 00913000
DSABAM   EQU   DSABORG2                                                 00914000
@NM00004 EQU   DSABORG2                                                 00915000
DSABTQ   EQU   DSABORG2                                                 00916000
DSABTX   EQU   DSABORG2                                                 00917000
DSABGS   EQU   DSABORG2                                                 00918000
DSABU    EQU   DSABORG1                                                 00919000
DSABPO   EQU   DSABORG1                                                 00920000
DSABMQ   EQU   DSABORG1                                                 00921000
DSABCQ   EQU   DSABORG1                                                 00922000
DSABCX   EQU   DSABORG1                                                 00923000
DSABDA   EQU   DSABORG1                                                 00924000
DSABPS   EQU   DSABORG1                                                 00925000
DSABIS   EQU   DSABORG1                                                 00926000
DSABSSVA EQU   DSAB+21                                                  00927000
DSABRS01 EQU   DSAB+20                                                  00928000
DSABLNTH EQU   DSAB+12                                                  00929000
DSABID   EQU   DSAB                                                     00930000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00931000
@RC00052 EQU   @RC00051                                                 00932000
@ENDDATA EQU   *                                                        00933000
         END   IEFDB481,(C'PLS0215',0603,75024)                         00934000
./  ADD  SSI=50230514,NAME=IEFDB490
         TITLE 'IEFDB490-DDNALLOC                                      *00001000
                        '                                               00002000
IEFDB490 CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IEFDB490  75.024'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @12,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@12                                      01S0001 00013000
         L     @00,@SIZDATD                                     01S0001 00014000
         GSPACE   R,LV=(0)                                              00015000
         LR    @11,@01                                          01S0001 00016000
         USING @DATD,@11                                        01S0001 00017000
         ST    @13,@SA00001+4                                   01S0001 00018000
         LM    @00,@01,20(@13)                                  01S0001 00019000
         ST    @11,8(,@13)                                      01S0001 00020000
         LR    @13,@11                                          01S0001 00021000
         MVC   @PC00001(28),0(@01)                              01S0001 00022000
JSCBDISP EQU 188                                                        00023000
JSCBAOS1 EQU  72                                                        00024000
JSCBAOS2 EQU 192                                                        00025000
*SWITCHES = SWITCHES && SWITCHES;      /*ZERO SWITCHES               */ 00026000
         XC    SWITCHES(1),SWITCHES                             01S0047 00027000
*/********************************************************************/ 00028000
*/*                                                                  */ 00029000
*/* SEGMENT NAME - DDNLCCHK                                          */ 00030000
*/*                                                                  */ 00031000
*/* DESCRIPTIVE NAME = ENVIRONMENTAL CHECK ROUTINE                   */ 00032000
*/*                                                                  */ 00033000
*/* FUNCTION - THIS ROUTINE DETERMINES IF THE TEXT ENTERED IS VALID, */ 00034000
*/*            IF THE DDNAME SPECIFIED IS IN THE DSAB CHAIN AND      */ 00035000
*/*            CHECKS THE ATTRIBUTES OF THE DSAB (OR FIRST DSAB OF A */ 00036000
*/*            CONCATENATED GROUP)                                   */ 00037000
*/*                                                                  */ 00038000
*/* OPERATION - IEFDB4FF IS INVOKED TO CHECK TEXT UNIT SYNTAX.       */ 00039000
*/*             IEFDB4FC IS INVOKED TO SEARCH DSAB CHAIN FOR         */ 00040000
*/*                      DSAB ASSOCIATED WITH SPECIFIED DDNAME       */ 00041000
*/*             IF THE SEARCH IS SUCCESSFUL THEN THE DSAB IS         */ 00042000
*/*             CHECKED FOR THE FOLLOWING:                           */ 00043000
*/*               1. DSAB MARKED IN-USE                              */ 00044000
*/*               2. DATA SET OPEN                                   */ 00045000
*/*               3. DSAB NOT MARKED PERMANENTLY CONCATENATED OR IS  */ 00046000
*/*                  CONVERTIBLE                                     */ 00047000
*/*             IF ANY OF THE ABOVE CONDITIONS ARE MET, THEN AN      */ 00048000
*/*             APPROPRIATE ERROR RETURN CODE IS SET.                */ 00049000
*/*                                                                  */ 00050000
*/* ENTRY - DDNLCCHK (INCLUDED SEGMENT)                              */ 00051000
*/*                                                                  */ 00052000
*/*  PURPOSE - SEE FUNCTION                                          */ 00053000
*/*                                                                  */ 00054000
*/*  INPUT DATA - TEXT UNIT PTRS - POINTER TO TEXT UNITS             */ 00055000
*/*                                                                  */ 00056000
*/* EXITS - ALL ARE TO NEXT SEQUENTIAL INSTRUCTION                   */ 00057000
*/*                                                                  */ 00058000
*/*  NORMAL - DSAB(S) ARE USABLE AND CAN BE MARKED IN-USE            */ 00059000
*/*                                                                  */ 00060000
*/*   RETURN CODE - ERRCODE = ZERO                                   */ 00061000
*/*                                                                  */ 00062000
*/*  ERROR - DSAB(S) ARE NOT USABLE OR TEXT IS INVALID               */ 00063000
*/*                                                                  */ 00064000
*/*  RETURN CODE - ERRCODE = ONE OF THE FOLLOWING HEX CODES:         */ 00065000
*/*                1. RCINVKEY - INVALID KEY SPECIFIED IN TEXT       */ 00066000
*/*                2. RCRSVDDN - JOBLIB/STEPLIB/JOBCAT/STEPCAT REQ   */ 00067000
*/*                3. RCINNUMB - INVALID NUMBER OF KEY PARAMETERS    */ 00068000
*/*                4. RCDUPKEY - DUPLICATE KEYS SPECIFIED IN TEXT    */ 00069000
*/*                5. RCINKEYL - INVALID KEY PARAMETER LENGTH        */ 00070000
*/*                6. RCKEYREQ - REQUIRED KEY NOT SPECIFIED          */ 00071000
*/*                7. RCDDUNAV - SPECIFIED DDNAME IN-USE             */ 00072000
*/*                8. RCOPENDS - SPECIFIED DDNAME ASSOCIATED WITH    */ 00073000
*/*                              OPEN DATA SET                       */ 00074000
*/*                9. RCDDCONV - SPECIFIED DDNAME CONVERTIBLE OR NOT */ 00075000
*/*                              PERMANENTLY CONCATENATED            */ 00076000
*/*               10. RCDDNFND - SPECIFIED DDNAME NOT FOUND          */ 00077000
*/*                                                                  */ 00078000
*/*                                                                  */ 00079000
*/********************************************************************/ 00080000
*KEYTABLE = KEYTABLE && KEYTABLE;      /*ZERO KEYTABLE               */ 00081000
         XC    KEYTABLE(8),KEYTABLE                             02S0048 00082000
*MASKS = MASKS && MASKS;               /*ZERO MUTUAL & DUPE MASKS    */ 00083000
         XC    MASKS(2),MASKS                                   02S0049 00084000
*CALL IEFDB4FF(DDNALCTP,ADDR(KEYDICT),ADDR(DUPEMASK),ADDR(MUTEMASK),    00085000
*              ADDR(KEYTABLE),DDNRETN);                         02S0050 00086000
         L     @10,@PC00001                                     02S0050 00087000
         ST    @10,@AL00001                                     02S0050 00088000
         LA    @10,KEYDICT                                      02S0050 00089000
         ST    @10,@TF00001                                     02S0050 00090000
         LA    @10,@TF00001                                     02S0050 00091000
         ST    @10,@AL00001+4                                   02S0050 00092000
         LA    @10,DUPEMASK                                     02S0050 00093000
         ST    @10,@TF00002                                     02S0050 00094000
         LA    @10,@TF00002                                     02S0050 00095000
         ST    @10,@AL00001+8                                   02S0050 00096000
         LA    @10,MUTEMASK                                     02S0050 00097000
         ST    @10,@TF00003                                     02S0050 00098000
         LA    @10,@TF00003                                     02S0050 00099000
         ST    @10,@AL00001+12                                  02S0050 00100000
         LA    @10,KEYTABLE                                     02S0050 00101000
         ST    @10,@TF00004                                     02S0050 00102000
         LA    @10,@TF00004                                     02S0050 00103000
         ST    @10,@AL00001+16                                  02S0050 00104000
         L     @10,@PC00001+4                                   02S0050 00105000
         ST    @10,@AL00001+20                                  02S0050 00106000
         L     @15,@CV00108                                     02S0050 00107000
         LA    @01,@AL00001                                     02S0050 00108000
         BALR  @14,@15                                          02S0050 00109000
*                                      /*CALL SYNTAX CHECKER         */ 00110000
*IF ERRCODE = ZERO THEN                /* IS SYNTAX GOOD ?           */ 00111000
         SLR   @10,@10                                          02S0051 00112000
         L     @15,@PC00001+4                                   02S0051 00113000
         SLR   @14,@14                                          02S0051 00114000
         ICM   @14,3,ERRCODE(@15)                               02S0051 00115000
         CR    @10,@14                                          02S0051 00116000
         BNE   @RF00051                                         02S0051 00117000
*  DO;                                 /*YES, PROCESS THE TEXT       */ 00118000
*    IF DDNAMTUP ¬= ZERO THEN          /*WAS KEY 0001 SPECIFIED ?    */ 00119000
         L     @15,DDNAMTUP                                     02S0053 00120000
         CR    @15,@10                                          02S0053 00121000
         BE    @RF00053                                         02S0053 00122000
*      DO;                             /*PROCESS KEY 0001            */ 00123000
*        TEXTPTR = DDNAMTUP;           /*GET TEXT KEY 0001 ADDRESS   */ 00124000
         LR    TEXTPTR,@15                                      02S0055 00125000
*        DDNAREA = '';                 /*BLANK DDNAME AREA           */ 00126000
         MVI   DDNAREA,C' '                                     02S0056 00127000
         MVC   DDNAREA+1(7),DDNAREA                             02S0056 00128000
*        DDNAREA(1:TEXTULNG) = TEXTUPAR(1:TEXTULNG); /* MOVE DDNAME  */ 00129000
         ICM   @10,12,TEXTULNG(TEXTPTR)                         02S0057 00130000
         SRA   @10,16                                           02S0057 00131000
         BCTR  @10,0                                            02S0057 00132000
         EX    @10,@SM00879                                     02S0057 00133000
*        IF DDNAREA = JOBLIB | DDNAREA = STEPLIB                02S0058 00134000
*        | DDNAREA = JOBCAT                                     02S0058 00135000
*        | DDNAREA = STEPCAT THEN      /*RESERVED DDNAME SPECIFIED ? */ 00136000
         CLC   DDNAREA(8),@CC00094                              02S0058 00137000
         BE    @RT00058                                         02S0058 00138000
         CLC   DDNAREA(8),@CC00104                              02S0058 00139000
         BE    @RT00058                                         02S0058 00140000
         CLC   DDNAREA(8),@CC00092                              02S0058 00141000
         BE    @RT00058                                         02S0058 00142000
         CLC   DDNAREA(8),@CC00102                              02S0058 00143000
         BNE   @RF00058                                         02S0058 00144000
@RT00058 DS    0H                                               02S0059 00145000
*          ERRCODE = RCRSVDDN;         /*SET RESERVED DDN ERROR CODE */ 00146000
         L     @10,@PC00001+4                                   02S0059 00147000
         MVC   ERRCODE(2,@10),@CB00520                          02S0059 00148000
*      END;                            /*END TEST FOR RESERVED DDN   */ 00149000
*    ELSE                              /* KEY 0001 NOT SPECIFIED     */ 00150000
*      ERRCODE = RCKEYREQ;             /* SET REQUIRED KEY NOT  02S0061 00151000
*                                         FOUND ERROR CODE           */ 00152000
         B     @RC00053                                         02S0061 00153000
@RF00053 L     @10,@PC00001+4                                   02S0061 00154000
         MVC   ERRCODE(2,@10),@CB00536                          02S0061 00155000
*  END;                                /*END TESTS FOR KEY 0001 02S0062 00156000
*                                        PRESENT AND RESERVED DDNAME */ 00157000
@RC00053 DS    0H                                               02S0063 00158000
*/********************************************************************/ 00159000
*/* IF ERRCODE IS ZERO AT THIS POINT, THEN CALL SEARCH ROUTINE TO    */ 00160000
*/* FIND THE DSAB ASSOCIATED WITH THE SPECIFIED DDNAME               */ 00161000
*/********************************************************************/ 00162000
*IF ERRCODE = ZERO THEN                /*IS RETURN CODE STILL ZERO?  */ 00163000
@RF00051 SLR   @10,@10                                          02S0063 00164000
         L     @15,@PC00001+4                                   02S0063 00165000
         SLR   @14,@14                                          02S0063 00166000
         ICM   @14,3,ERRCODE(@15)                               02S0063 00167000
         CR    @10,@14                                          02S0063 00168000
         BNE   @RF00063                                         02S0063 00169000
*  DO;                                 /*YES, CONTINUE               */ 00170000
*    DSABPTR = DSQFRSTP;               /*GET FIRST DSAB ADDRESS      */ 00171000
         L     @15,@PC00001+8                                   02S0065 00172000
         L     @01,DDNJSCBP(,@15)                               02S0065 00173000
         L     @01,JSCDSABQ(,@01)                               02S0065 00174000
         L     @15,DSQFRSTP(,@01)                               02S0065 00175000
         ST    @15,DSABPTR                                      02S0065 00176000
*    DDNAMEP = ADDR(DDNAREA);          /*GET ADDRESS OF DDNAME AREA  */ 00177000
         LA    @15,DDNAREA                                      02S0066 00178000
         ST    @15,DDNAMEP                                      02S0066 00179000
*    RTNDDNAD = ZERO;                  /*ZERO RETURN AREA            */ 00180000
         ST    @10,RTNDDNAD                                     02S0067 00181000
*    RTNAREAP = ADDR(RTNDDNAD);        /*GET RETURN AREA ADDRESS     */ 00182000
         LA    @10,RTNDDNAD                                     02S0068 00183000
         ST    @10,RTNAREAP                                     02S0068 00184000
*    CALL IEFDB4FC(DSABPTR,DDNAMEP,RTNAREAP); /*SEARCH FOR DDNAME    */ 00185000
         LA    @10,DSABPTR                                      02S0069 00186000
         ST    @10,@AL00001                                     02S0069 00187000
         LA    @10,DDNAMEP                                      02S0069 00188000
         ST    @10,@AL00001+4                                   02S0069 00189000
         LA    @10,RTNAREAP                                     02S0069 00190000
         ST    @10,@AL00001+8                                   02S0069 00191000
         L     @15,@CV00107                                     02S0069 00192000
         LA    @01,@AL00001                                     02S0069 00193000
         BALR  @14,@15                                          02S0069 00194000
*    IF RTNDDNAD = ZERO THEN           /*WAS DDNAME FOUND IN DSABS?  */ 00195000
         L     @10,RTNDDNAD                                     02S0070 00196000
         LTR   @10,@10                                          02S0070 00197000
         BNZ   @RF00070                                         02S0070 00198000
*      ERRCODE = RCDDNFND;             /*NO, SET DD NOT FND ERR CODE */ 00199000
         L     @10,@PC00001+4                                   02S0071 00200000
         MVC   ERRCODE(2,@10),@CB00556                          02S0071 00201000
*    ELSE                              /*DDNAME FOUND                */ 00202000
*      DSABPTR = RTNDDNAD;             /* SAVE DSAB ADDRESS FOR 02S0072 00203000
*                                         SPECIFIED DDNAME           */ 00204000
         B     @RC00070                                         02S0072 00205000
@RF00070 L     @10,RTNDDNAD                                     02S0072 00206000
         ST    @10,DSABPTR                                      02S0072 00207000
*  END;                                /*END SEARCH FOR DDNAME       */ 00208000
@RC00070 DS    0H                                               02S0074 00209000
*/********************************************************************/ 00210000
*/* IF ERRCODE IS ZERO AT THIS POINT, THEN CHECK DSAB ASSOCIATED     */ 00211000
*/* WITH THE SPECIFIED DDNAME FOR BEING IN-USE AND DATASET BEING OPEN*/ 00212000
*/********************************************************************/ 00213000
*IF ERRCODE = ZERO THEN                /*IS RETURN CODE STILL ZERO?  */ 00214000
@RF00063 L     @10,@PC00001+4                                   02S0074 00215000
         ICM   @15,3,ERRCODE(@10)                               02S0074 00216000
         BNZ   @RF00074                                         02S0074 00217000
*  DO;                                 /*YES, CONTINUE               */ 00218000
*    IF DSABNUSE = ON THEN             /*IS DSAB MARKED IN-USE?      */ 00219000
         L     @01,DSABPTR                                      02S0076 00220000
         TM    DSABNUSE(@01),B'00000001'                        02S0076 00221000
         BNO   @RF00076                                         02S0076 00222000
*      ERRCODE = RCDDUNAV;             /*YES, SET IN-USE ERROR CODE  */ 00223000
         MVC   ERRCODE(2,@10),@CB00548                          02S0077 00224000
*    ELSE;                             /*NOT IN USE                  */ 00225000
@RF00076 DS    0H                                               02S0079 00226000
*    IF DSABOPCT ¬= ZERO THEN          /*IS DATA SET OPEN ?          */ 00227000
         L     @10,DSABPTR                                      02S0079 00228000
         LH    @10,DSABOPCT(,@10)                               02S0079 00229000
         LTR   @10,@10                                          02S0079 00230000
         BZ    @RF00079                                         02S0079 00231000
*      ERRCODE = RCOPENDS;             /*YES, SET DS OPEN ERROR CODE */ 00232000
         L     @10,@PC00001+4                                   02S0080 00233000
         MVC   ERRCODE(2,@10),@CB00550                          02S0080 00234000
*  END;                                /*END TEST FOR IN-USE & OPEN  */ 00235000
@RF00079 DS    0H                                               02S0082 00236000
*/********************************************************************/ 00237000
*/* IF ERRCODE IS ZERO AT THIS POINT, THEN CHECK FOR PERMANENTLY     */ 00238000
*/* CONCATENATED OR DSAB NOT CONVERTIBLE.                            */ 00239000
*/********************************************************************/ 00240000
*IF ERRCODE = ZERO THEN                /*IS RETURN CODE STILL ZERO?  */ 00241000
@RF00074 L     @10,@PC00001+4                                   02S0082 00242000
         ICM   @15,3,ERRCODE(@10)                               02S0082 00243000
         BNZ   @RF00082                                         02S0082 00244000
*  DO;                                 /*YES, CONTINUE               */ 00245000
*    IF DSABPCAT = OFF & DSABCONV = ON THEN /*IS ENTRY USABLE ?      */ 00246000
         L     @01,DSABPTR                                      02S0084 00247000
         TM    DSABCONV(@01),B'00010000'                        02S0084 00248000
         BNO   @RF00084                                         02S0084 00249000
         TM    DSABPCAT(@01),B'00000100'                        02S0084 00250000
         BNZ   @RF00084                                         02S0084 00251000
*      ERRCODE = RCDDCONV;              /*NO, SET NOT PERM CONCAT &     00252000
*                                        ENTRY CONVERTIBLE ERR CODE  */ 00253000
         MVC   ERRCODE(2,@10),@CB00554                          02S0085 00254000
*  END;                                /*END FINAL ATTRIBUTE CHECKS  */ 00255000
@RF00084 DS    0H                                               02S0087 00256000
*/********************************************************************/ 00257000
*/* IF ERRCODE IS ZERO AT THIS POINT, THEN THE DSAB (OR DSABS FOR    */ 00258000
*/* A CONCATENATED GROUP) CAN BE MARKED IN-USE                       */ 00259000
*/********************************************************************/ 00260000
*IF ERRCODE = ZERO THEN                /*IS RETURN CODE STILL ZERO?  */ 00261000
@RF00082 L     @10,@PC00001+4                                   01S0087 00262000
         ICM   @15,3,ERRCODE(@10)                               01S0087 00263000
         BNZ   @RF00087                                         01S0087 00264000
*  DO;                                 /*YES, MARK DSAB(S) IN USE    */ 00265000
*    CONTINUE = ON;                    /*INIT LOOP CONTROL SWITCH    */ 00266000
         OI    CONTINUE,B'10000000'                             01S0089 00267000
*    DO WHILE CONTINUE = ON;           /*LOOP CONTROL                */ 00268000
         B     @DE00090                                         01S0090 00269000
@DL00090 DS    0H                                               01S0091 00270000
*      DSABNUSE = ON;                  /*TURN ON IN-USE ATTRIBUTE    */ 00271000
         L     @10,DSABPTR                                      01S0091 00272000
         OI    DSABNUSE(@10),B'00000001'                        01S0091 00273000
*      DSABTCBP = DDNTCBP;             /* STORE TCB ADDRESS IN DSAB  */ 00274000
         L     @15,@PC00001+8                                   01S0092 00275000
         L     @15,DDNTCBP(,@15)                                01S0092 00276000
         ST    @15,DSABTCBP(,@10)                               01S0092 00277000
*      IF DUMRETUP ¬= ZERO & REALDATA = OFF THEN /* RETURN DUMMY ?   */ 00278000
         L     @15,DUMRETUP                                     01S0093 00279000
         LTR   @15,@15                                          01S0093 00280000
         BZ    @RF00093                                         01S0093 00281000
         TM    REALDATA,B'01000000'                             01S0093 00282000
         BNZ   @RF00093                                         01S0093 00283000
*       DO;                            /* CHECK FOR DUMMY            */ 00284000
*         IF TIOEQNAM = ON | TIOTTERM = ON | TIOEFSRT ¬= 0      01S0095 00285000
*           | SCTDUMMY = OFF THEN      /* NON DUMMY ?                */ 00286000
         L     @15,DSABTIOT(,@10)                               01S0095 00287000
         TM    TIOEQNAM(@15),B'00101000'                        01S0095 00288000
         BNZ   @RT00095                                         01S0095 00289000
         L     @15,TIOEFSRT-1(,@15)                             01S0095 00290000
         LA    @15,0(,@15)                                      01S0095 00291000
         LTR   @15,@15                                          01S0095 00292000
         BNZ   @RT00095                                         01S0095 00293000
         L     @10,DSABSIOT(,@10)                               01S0095 00294000
         TM    SCTDUMMY(@10),B'10000000'                        01S0095 00295000
         BNZ   @RF00095                                         01S0095 00296000
@RT00095 DS    0H                                               01S0096 00297000
*         REALDATA = ON;               /* YES INDICATE NON-DUMMY     */ 00298000
         OI    REALDATA,B'01000000'                             01S0096 00299000
*       END;                           /* END TEST FOR DUMMY         */ 00300000
@RF00095 DS    0H                                               01S0098 00301000
*      IF DSABCATM = ON THEN           /* IS THIS A CONCAT GROUP ?   */ 00302000
@RF00093 L     @10,DSABPTR                                      01S0098 00303000
         TM    DSABCATM(@10),B'00000010'                        01S0098 00304000
         BNO   @RF00098                                         01S0098 00305000
*        DO;                           /* YES                        */ 00306000
*          IF DSABFCHN = ZERO THEN     /*MORE DSABS TO PROCESS ?     */ 00307000
         L     @10,DSABFCHN(,@10)                               01S0100 00308000
         LTR   @10,@10                                          01S0100 00309000
         BNZ   @RF00100                                         01S0100 00310000
*            CONTINUE = OFF;           /*NO, END PROCESSING          */ 00311000
         NI    CONTINUE,B'01111111'                             01S0101 00312000
*          ELSE                        /*YES, MORE DSABS             */ 00313000
*            DO;                       /* UPDATE DSABPTR             */ 00314000
         B     @RC00100                                         01S0102 00315000
@RF00100 DS    0H                                               01S0103 00316000
*              DSABPTR = DSABFCHN;     /*GET NEXT DSAB ADDRESS       */ 00317000
         L     @10,DSABPTR                                      01S0103 00318000
         L     @10,DSABFCHN(,@10)                               01S0103 00319000
         ST    @10,DSABPTR                                      01S0103 00320000
*              IF TIOEDDNM(1) ¬= BLANK THEN                     01S0104 00321000
         L     @10,DSABTIOT(,@10)                               01S0104 00322000
         CLI   TIOEDDNM(@10),C' '                               01S0104 00323000
         BE    @RF00104                                         01S0104 00324000
*                CONTINUE = OFF;       /*STOP IF NON-BLANK DDNAME    */ 00325000
         NI    CONTINUE,B'01111111'                             01S0105 00326000
*              ELSE;                   /* FALL THROUGH               */ 00327000
@RF00104 DS    0H                                               01S0107 00328000
*            END;                      /*END UPDATE OF DSAB PTR      */ 00329000
*        END;                          /*END CONCAT GROUP PROCESSING */ 00330000
*      ELSE                            /* STOP PROCESSING            */ 00331000
*        CONTINUE = OFF;               /* TURN OFF SWITCH,END LOOP   */ 00332000
         B     @RC00098                                         01S0109 00333000
@RF00098 NI    CONTINUE,B'01111111'                             01S0109 00334000
*     END;                             /* END MARK IN-USE LOOP       */ 00335000
@RC00098 DS    0H                                               01S0110 00336000
@DE00090 TM    CONTINUE,B'10000000'                             01S0110 00337000
         BO    @DL00090                                         01S0110 00338000
*    IF DUMRETUP ¬= ZERO THEN          /* RETURN DUMMY INDICATOR ?   */ 00339000
         L     @10,DUMRETUP                                     01S0111 00340000
         LTR   @10,@10                                          01S0111 00341000
         BZ    @RF00111                                         01S0111 00342000
*      DO;                             /* YES                        */ 00343000
*        TEXTPTR = DUMRETUP;           /* POINT TO TEXT UNIT         */ 00344000
         LR    TEXTPTR,@10                                      01S0113 00345000
*        IF REALDATA = ON THEN         /* WAS A NON-DUMMY DATASET FND*/ 00346000
         TM    REALDATA,B'01000000'                             01S0114 00347000
         BNO   @RF00114                                         01S0114 00348000
*          TEXTUPAR(1) = NONDUMMY;     /* YES, INDICATE NON-DUMMY    */ 00349000
         MVI   TEXTUPAR(TEXTPTR),X'00'                          01S0115 00350000
*        ELSE                          /* OTHERWISE DUMMY FOUND      */ 00351000
*          TEXTUPAR(1) = DUMMY;        /* INDICATE DUMMY DATASET     */ 00352000
         B     @RC00114                                         01S0116 00353000
@RF00114 MVI   TEXTUPAR(TEXTPTR),X'80'                          01S0116 00354000
*      END;                            /* END DUMMY INDICATOR PROCESS*/ 00355000
*    ELSE;                             /* NO INDICATOR REQUESTED     */ 00356000
@RF00111 DS    0H                                               01S0119 00357000
*  END;                                /*END SUCCESSFUL PROCESSING   */ 00358000
*ELSE;                                 /*ERRCODE NOT ZERO            */ 00359000
@RF00087 DS    0H                                               01S0121 00360000
*RETURN CODE(0);                       /*PASS RETURN CODE            */ 00361000
@RC00087 L     @13,4(,@13)                                      01S0121 00362000
         L     @00,@SIZDATD                                     01S0121 00363000
         LR    @01,@11                                          01S0121 00364000
         FSPACE   R,LV=(0),A=(1)                                        00365000
         SLR   @15,@15                                          01S0121 00366000
         L     @14,12(,@13)                                     01S0121 00367000
         LM    @00,@12,20(@13)                                  01S0121 00368000
         BR    @14                                              01S0121 00369000
*END IEFDB490                                                   01S0122 00370000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00371000
*/*%INCLUDE SYSLIB  (DDNALCSP)                                        * 00372000
*/*%INCLUDE SYSLIB  (DDNALCDT)                                        * 00373000
*/*%INCLUDE SYSLIB  (IEFASIOT)                                        * 00374000
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                        * 00375000
*/*%INCLUDE SYSLIB  (IEFZB436)                                        * 00376000
*/*%INCLUDE SYSLIB  (IEFZB4D1)                                        * 00377000
*/*%INCLUDE SYSLIB  (IEFZB4D5)                                        * 00378000
*/*%INCLUDE SYSLIB  (IEFZB4D7)                                        * 00379000
*/*%INCLUDE SYSLIB  (IEFZB4D9)                                        * 00380000
*/*%INCLUDE SYSLIB  (IEFZB4DA)                                        * 00381000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                        * 00382000
*/*%INCLUDE SYSLIB  (IHADSAB )                                        * 00383000
*/*%INCLUDE SYSLIB  (IHAQDB  )                                        * 00384000
*/*%INCLUDE SYSLIB  (DDNLCCHK)                                        * 00385000
*/*%INCLUDE SYSLIB  (DDNCHKSP)                                        * 00386000
*;                                                              01S0122 00387000
@DATA    DS    0H                                                       00388000
@SM00879 MVC   DDNAREA(0),TEXTUPAR(TEXTPTR)                             00389000
@DATD    DSECT                                                          00390000
         DS    0F                                                       00391000
@SA00001 DS    18F                                                      00392000
@PC00001 DS    7F                                                       00393000
@AL00001 DS    6A                                                       00394000
@TF00001 DS    F                                                        00395000
@TF00002 DS    F                                                        00396000
@TF00003 DS    F                                                        00397000
@TF00004 DS    F                                                        00398000
IEFDB490 CSECT                                                          00399000
         DS    0F                                                       00400000
@DATD    DSECT                                                          00401000
         DS    0D                                                       00402000
DDNAMEP  DS    A                                                        00403000
DSABPTR  DS    A                                                        00404000
RTNAREAP DS    A                                                        00405000
RTNDDNAD DS    A                                                        00406000
TIOTPTR  DS    A                                                        00407000
S99TXTPP DS    A                                                        00408000
TXTUFLDP DS    A                                                        00409000
TCBJSCB  DS    A                                                        00410000
QDBPTR   DS    A                                                        00411000
SWACTLS  DS    FL2                                                      00412000
         ORG   SWACTLS                                                  00413000
SWASN    DS    BL1                                                      00414000
SWDEL    EQU   SWACTLS+0                                                00415000
SWREAD   EQU   SWACTLS+0                                                00416000
SWWRT    EQU   SWACTLS+0                                                00417000
SWNEW    EQU   SWACTLS+0                                                00418000
SWFREE   EQU   SWACTLS+0                                                00419000
SWMOD    EQU   SWACTLS+0                                                00420000
SWOLD    EQU   SWACTLS+0                                                00421000
SWCHN    DS    BL1                                                      00422000
@NM00022 EQU   SWACTLS+1                                                00423000
         ORG   SWACTLS+2                                                00424000
DDNAREA  DS    CL8                                                      00425000
MASKS    DS    CL2                                                      00426000
         ORG   MASKS                                                    00427000
DUPEMASK DS    CL1                                                      00428000
MUTEMASK DS    CL1                                                      00429000
         ORG   MASKS+2                                                  00430000
SVALIST  DS    CL4                                                      00431000
         ORG   SVALIST                                                  00432000
SVAONE   DS    AL4                                                      00433000
         ORG   SVAONE                                                   00434000
SVA01PTR DS    AL3                                                      00435000
@NM00001 DS    BL1                                                      00436000
         ORG   SVALIST+4                                                00437000
SVABLIST DS    CL4                                                      00438000
         ORG   SVABLIST                                                 00439000
SIOTPTR  DS    AL4                                                      00440000
         ORG   SVABLIST+4                                               00441000
SWITCHES DS    BL1                                                      00442000
         ORG   SWITCHES                                                 00443000
CONTINUE DS    BL1                                                      00444000
REALDATA EQU   SWITCHES+0                                               00445000
@NM00002 EQU   SWITCHES+0                                               00446000
         ORG   SWITCHES+1                                               00447000
         DS    CL3                                                      00448000
KEYTABLE DS    CL8                                                      00449000
         ORG   KEYTABLE                                                 00450000
DDNAMTUP DS    AL4                                                      00451000
DUMRETUP DS    AL4                                                      00452000
         ORG   KEYTABLE+8                                               00453000
IEFDB490 CSECT                                                          00454000
         DS    0F                                                       00455000
@SIZDATD DC    AL1(230)                                                 00456000
         DC    AL3(@ENDDATD-@DATD)                                      00457000
@CV00107 DC    V(IEFDB4FC)                                              00458000
@CV00108 DC    V(IEFDB4FF)                                              00459000
         DS    0D                                                       00460000
@CC00092 DC    C'JOBCAT  '                                              00461000
@CC00094 DC    C'JOBLIB  '                                              00462000
@CC00102 DC    C'STEPCAT '                                              00463000
@CC00104 DC    C'STEPLIB '                                              00464000
@CB00520 DC    X'0364'                                                  00465000
@CB00536 DC    X'0388'                                                  00466000
@CB00548 DC    X'0410'                                                  00467000
@CB00550 DC    X'0420'                                                  00468000
@CB00554 DC    X'0434'                                                  00469000
@CB00556 DC    X'0438'                                                  00470000
KEYDICT  DS    CL29                                                     00471000
         ORG   KEYDICT                                                  00472000
KYDDNAME DS    CL13                                                     00473000
         ORG   KYDDNAME                                                 00474000
DDNAMLEN DC    AL1(13)                                                  00475000
DDNAMHEX DC    X'0001'                                                  00476000
DDNAMMXL DC    X'0008'                                                  00477000
DDNAMMNL DC    X'0001'                                                  00478000
DDNAMMXN DC    X'0001'                                                  00479000
DDNAMMNN DC    X'0001'                                                  00480000
DDNAMKTB DC    X'0000'                                                  00481000
         ORG   KEYDICT+13                                               00482000
KYDUMRET DS    CL13                                                     00483000
         ORG   KYDUMRET                                                 00484000
DUMRTLEN DC    AL1(13)                                                  00485000
DUMRTHEX DC    X'0002'                                                  00486000
DUMRTMXL DC    X'0001'                                                  00487000
DUMRTMNL DC    X'0001'                                                  00488000
DUMRTMXN DC    X'0001'                                                  00489000
DUMRTMNN DC    X'0001'                                                  00490000
DUMRTKTB DC    X'0004'                                                  00491000
         ORG   KEYDICT+26                                               00492000
KYENDDCT DS    CL3                                                      00493000
         ORG   KYENDDCT                                                 00494000
ENDDCLEN DC    AL1(3)                                                   00495000
ENDDCHEX DC    X'FFFF'                                                  00496000
         ORG   KEYDICT+29                                               00497000
IEFDB490 CSECT                                                          00498000
         DS   0H                                                        00499000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   00500000
@DATD    DSECT                                                          00501000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00502000
@ENDDATD EQU   *                                                        00503000
IEFDB490 CSECT                                                          00504000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00505000
@01      EQU   01                                                       00506000
@02      EQU   02                                                       00507000
@03      EQU   03                                                       00508000
@04      EQU   04                                                       00509000
@05      EQU   05                                                       00510000
@06      EQU   06                                                       00511000
@07      EQU   07                                                       00512000
@08      EQU   08                                                       00513000
@09      EQU   09                                                       00514000
@10      EQU   10                                                       00515000
@11      EQU   11                                                       00516000
@12      EQU   12                                                       00517000
@13      EQU   13                                                       00518000
@14      EQU   14                                                       00519000
@15      EQU   15                                                       00520000
TEXTPTR  EQU   @02                                                      00521000
INDMSIOT EQU   0                                                        00522000
SCTUSADD EQU   INDMSIOT+20                                              00523000
SIOTBYT1 EQU   INDMSIOT+43                                              00524000
SIOTBYT3 EQU   INDMSIOT+46                                              00525000
SIOTTSTC EQU   INDMSIOT+47                                              00526000
SIOTBYT0 EQU   INDMSIOT+52                                              00527000
SCTSDISP EQU   INDMSIOT+55                                              00528000
SCTSBYT1 EQU   INDMSIOT+56                                              00529000
SCTDUMMY EQU   SCTSBYT1                                                 00530000
SCTSBYT2 EQU   INDMSIOT+57                                              00531000
SCTSBYT3 EQU   INDMSIOT+58                                              00532000
SCTSBYT4 EQU   INDMSIOT+59                                              00533000
SCTUTYPE EQU   INDMSIOT+60                                              00534000
SIOTDEVT EQU   SCTUTYPE                                                 00535000
SIOUBYT3 EQU   SIOTDEVT+2                                               00536000
SIOTALTD EQU   INDMSIOT+92                                              00537000
SIOTBYT2 EQU   INDMSIOT+103                                             00538000
TIOT1    EQU   0                                                        00539000
TIOENTRY EQU   0                                                        00540000
TIOESTTA EQU   TIOENTRY+1                                               00541000
TIOERLOC EQU   TIOENTRY+2                                               00542000
TIOELINK EQU   TIOERLOC+1                                               00543000
TIOTTERM EQU   TIOELINK                                                 00544000
TIOEQNAM EQU   TIOELINK                                                 00545000
TIOESYOT EQU   TIOELINK                                                 00546000
TIOEDDNM EQU   TIOENTRY+4                                               00547000
TIOESTTC EQU   TIOENTRY+15                                              00548000
TIOESTTB EQU   TIOENTRY+16                                              00549000
TIOEFSRT EQU   TIOENTRY+17                                              00550000
POOLSTAR EQU   TIOENTRY+20                                              00551000
TEXTUNIT EQU   0                                                        00552000
TEXTUENT EQU   TEXTUNIT+4                                               00553000
TEXTULNG EQU   TEXTUENT                                                 00554000
TEXTUPAR EQU   TEXTUENT+2                                               00555000
TXTUPLST EQU   0                                                        00556000
TXTUNITP EQU   TXTUPLST                                                 00557000
TXTUPELM EQU   0                                                        00558000
TXTPLENT EQU   TXTUPELM                                                 00559000
TEXTUFLD EQU   0                                                        00560000
QDB      EQU   0                                                        00561000
IEZJSCB  EQU   0                                                        00562000
JSCBSEC1 EQU   IEZJSCB+188                                              00563000
JSCHPCE  EQU   JSCBSEC1+4                                               00564000
JSCBDCB  EQU   JSCBSEC1+36                                              00565000
JSCBOPTS EQU   JSCBSEC1+48                                              00566000
JSCBSWT1 EQU   JSCBSEC1+55                                              00567000
JSCBWTP  EQU   JSCBSEC1+64                                              00568000
JSCBWTFG EQU   JSCBWTP                                                  00569000
JSCBEND1 EQU   IEZJSCB+260                                              00570000
DSAB     EQU   0                                                        00571000
DSABFCHN EQU   DSAB+4                                                   00572000
DSABOPCT EQU   DSAB+14                                                  00573000
DSABTIOT EQU   DSAB+16                                                  00574000
DSABGIDP EQU   DSAB+24                                                  00575000
DSABANMP EQU   DSAB+28                                                  00576000
DSABORG  EQU   DSAB+32                                                  00577000
DSABORG1 EQU   DSABORG                                                  00578000
DSABORG2 EQU   DSABORG+1                                                00579000
DSABFLG1 EQU   DSAB+34                                                  00580000
DSABCONV EQU   DSABFLG1                                                 00581000
DSABPCAT EQU   DSABFLG1                                                 00582000
DSABCATM EQU   DSABFLG1                                                 00583000
DSABNUSE EQU   DSABFLG1                                                 00584000
DSABFLG2 EQU   DSAB+35                                                  00585000
DSABFLG3 EQU   DSAB+36                                                  00586000
DSABFLG4 EQU   DSAB+37                                                  00587000
DSABTCBP EQU   DSAB+40                                                  00588000
DSABSIOT EQU   DSAB+64                                                  00589000
DSABANMI EQU   0                                                        00590000
DSABGIDL EQU   0                                                        00591000
DDNALCTP EQU   0                                                        00592000
DDNRETN  EQU   0                                                        00593000
ERRCODE  EQU   DDNRETN                                                  00594000
DDNCTRLP EQU   0                                                        00595000
DDNJSCBP EQU   DDNCTRLP                                                 00596000
DDNTCBP  EQU   DDNCTRLP+8                                               00597000
ALFNCMAP EQU   0                                                        00598000
INPUTSW  EQU   ALFNCMAP                                                 00599000
PROCESSW EQU   ALFNCMAP+6                                               00600000
ERRPROSW EQU   PROCESSW                                                 00601000
DEPARMS  EQU   0                                                        00602000
DENQRETN EQU   DEPARMS+232                                              00603000
DEDMYEPA EQU   DEPARMS+240                                              00604000
DEDMYAS  EQU   DEPARMS+260                                              00605000
LASTEPAP EQU   0                                                        00606000
SMFPARMS EQU   0                                                        00607000
TIOEDEVE EQU   TIOESTTB                                                 00608000
TIOSTTB  EQU   TIOEDEVE                                                 00609000
DSABQDB  EQU   QDB                                                      00610000
DSQFRSTP EQU   DSABQDB+12                                               00611000
DSQLASTP EQU   DSABQDB+16                                               00612000
JSCBSEC2 EQU   JSCBEND1                                                 00613000
JSCBSEC3 EQU   JSCBEND1                                                 00614000
JSCBJCT  EQU   JSCBSEC3                                                 00615000
JSCBJCTA EQU   JSCBJCT+1                                                00616000
JSCBASID EQU   JSCBSEC3+8                                               00617000
JSCBJNL  EQU   JSCBSEC3+28                                              00618000
JSCBJJSB EQU   JSCBJNL                                                  00619000
JSCBSUB  EQU   JSCBSEC3+40                                              00620000
JSCDSABQ EQU   JSCBSEC3+60                                              00621000
JSCSCT   EQU   JSCBSEC3+68                                              00622000
JSCRSV35 EQU   JSCBSEC3+96                                              00623000
JSCRSV36 EQU   JSCRSV35                                                 00624000
JSCRSV37 EQU   JSCRSV35+2                                               00625000
JSCRSV45 EQU   JSCBSEC3+112                                             00626000
JSCRSV46 EQU   JSCRSV45                                                 00627000
JSCRSV47 EQU   JSCRSV45+2                                               00628000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00629000
JSCBEND3 EQU   JSCBSEC3+120                                             00630000
JSCRSV52 EQU   JSCBSEC3+116                                             00631000
JSCRSV51 EQU   JSCRSV47+1                                               00632000
JSCRSV50 EQU   JSCRSV47                                                 00633000
JSCRSV49 EQU   JSCRSV46+1                                               00634000
JSCRSV48 EQU   JSCRSV46                                                 00635000
JSCRSV44 EQU   JSCBSEC3+108                                             00636000
JSCRSV43 EQU   JSCBSEC3+104                                             00637000
JSCRSV42 EQU   JSCBSEC3+100                                             00638000
JSCRSV41 EQU   JSCRSV37+1                                               00639000
JSCRSV40 EQU   JSCRSV37                                                 00640000
JSCRSV39 EQU   JSCRSV36+1                                               00641000
JSCRSV38 EQU   JSCRSV36                                                 00642000
JSCBUFPT EQU   JSCBSEC3+92                                              00643000
JSCBACT  EQU   JSCBSEC3+88                                              00644000
JSCBSWSP EQU   JSCBSEC3+87                                              00645000
JSCRSV33 EQU   JSCBSEC3+86                                              00646000
JSCDDNUM EQU   JSCBSEC3+84                                              00647000
JSCRSV53 EQU   JSCBSEC3+82                                              00648000
JSCDDNNO EQU   JSCBSEC3+80                                              00649000
JSCBVATA EQU   JSCBSEC3+76                                              00650000
JSCTMCOR EQU   JSCBSEC3+72                                              00651000
JSCSCTP  EQU   JSCSCT+1                                                 00652000
JSCRSV55 EQU   JSCSCT                                                   00653000
JSCRSV54 EQU   JSCBSEC3+64                                              00654000
JSCBSSIB EQU   JSCBSEC3+56                                              00655000
JSCBFRBA EQU   JSCBSEC3+48                                              00656000
JSCRSV28 EQU   JSCBSEC3+46                                              00657000
JSCBSONO EQU   JSCBSEC3+44                                              00658000
JSCBSUBA EQU   JSCBSUB+1                                                00659000
JSCRSV31 EQU   JSCBSUB                                                  00660000
JSCBSMLR EQU   JSCBSEC3+36                                              00661000
JSCBJNLR EQU   JSCBSEC3+32                                              00662000
JSCBJNLA EQU   JSCBJNL+1                                                00663000
JSCBJSBT EQU   JSCBJJSB                                                 00664000
JSCBJSBX EQU   JSCBJJSB                                                 00665000
JSCBJSBA EQU   JSCBJJSB                                                 00666000
JSCBJSBI EQU   JSCBJJSB                                                 00667000
@NM00034 EQU   JSCBJJSB                                                 00668000
JSCBJNLE EQU   JSCBJJSB                                                 00669000
JSCBJNLF EQU   JSCBJJSB                                                 00670000
JSCBJNLN EQU   JSCBJJSB                                                 00671000
@NM00033 EQU   JSCBSEC3+24                                              00672000
JSCBJRBA EQU   JSCBSEC3+16                                              00673000
JSCBIECB EQU   JSCBSEC3+12                                              00674000
JSCRSV25 EQU   JSCBSEC3+10                                              00675000
JSCBTJID EQU   JSCBASID                                                 00676000
JSCBPSCB EQU   JSCBSEC3+4                                               00677000
JSCJCTP  EQU   JSCBJCTA                                                 00678000
JSCRSV24 EQU   JSCBJCT                                                  00679000
JSCBEND2 EQU   JSCBSEC2                                                 00680000
@NM00023 EQU   DSABQDB+24                                               00681000
DSQBDSP  EQU   DSABQDB+22                                               00682000
DSQFDSP  EQU   DSABQDB+20                                               00683000
DSQBADFC EQU   DSQLASTP                                                 00684000
DSQBADBC EQU   DSQFRSTP                                                 00685000
DSQNELMS EQU   DSABQDB+8                                                00686000
DSQDBLN  EQU   DSABQDB+6                                                00687000
DSQATTRS EQU   DSABQDB+4                                                00688000
DSQDBID  EQU   DSABQDB                                                  00689000
TIOUCBP  EQU   TIOEDEVE+1                                               00690000
TIOVERF  EQU   TIOSTTB                                                  00691000
TIOUNLD  EQU   TIOSTTB                                                  00692000
TIOMNTD  EQU   TIOSTTB                                                  00693000
TIOSETU  EQU   TIOSTTB                                                  00694000
TIOVLSR  EQU   TIOSTTB                                                  00695000
TIOPVIO  EQU   TIOSTTB                                                  00696000
TIOREQD  EQU   TIOSTTB                                                  00697000
TIOUSED  EQU   TIOSTTB                                                  00698000
SMFBUFLP EQU   SMFPARMS+4                                               00699000
SMFBUF1P EQU   SMFPARMS                                                 00700000
@NM00030 EQU   DEPARMS+304                                              00701000
DETCTIOL EQU   DEPARMS+300                                              00702000
DETCTIOP EQU   DEPARMS+296                                              00703000
DETDQLST EQU   DEPARMS+280                                              00704000
DEALASTP EQU   DEPARMS+276                                              00705000
DEASGNP  EQU   DEDMYAS+12                                               00706000
@NM00029 EQU   DEDMYAS                                                  00707000
DEWLASTP EQU   DEPARMS+256                                              00708000
DEWRITP  EQU   DEDMYEPA+12                                              00709000
@NM00028 EQU   DEDMYEPA                                                 00710000
DEDSNQRC EQU   DENQRETN+4                                               00711000
DEDSNQEN EQU   DENQRETN                                                 00712000
DECPYLEN EQU   DEPARMS+228                                              00713000
DECPYLOC EQU   DEPARMS+224                                              00714000
DEJSCB   EQU   DEPARMS+220                                              00715000
DESCT    EQU   DEPARMS+216                                              00716000
DEJCT    EQU   DEPARMS+212                                              00717000
DESIOT   EQU   DEPARMS+208                                              00718000
DETCB    EQU   DEPARMS+204                                              00719000
DEALFMAP EQU   DEPARMS+200                                              00720000
DECORE   EQU   DEPARMS                                                  00721000
@NM00027 EQU   PROCESSW+1                                               00722000
HSKPDQSW EQU   PROCESSW+1                                               00723000
DISMSGSW EQU   PROCESSW+1                                               00724000
USERERSW EQU   PROCESSW+1                                               00725000
EPALSISW EQU   PROCESSW+1                                               00726000
EPASCTSW EQU   PROCESSW+1                                               00727000
EPAJCTSW EQU   PROCESSW                                                 00728000
FRRPERSW EQU   PROCESSW                                                 00729000
DCBSPCSW EQU   PROCESSW                                                 00730000
NQEXCLSW EQU   PROCESSW                                                 00731000
UNALOCSW EQU   ERRPROSW                                                 00732000
DEQDSNSW EQU   ERRPROSW                                                 00733000
COPYSW   EQU   PROCESSW                                                 00734000
@NM00026 EQU   PROCESSW                                                 00735000
@NM00025 EQU   INPUTSW+3                                                00736000
PCATINIT EQU   INPUTSW+3                                                00737000
UNITDEVT EQU   INPUTSW+3                                                00738000
MOUNTSW  EQU   INPUTSW+2                                                00739000
CATLOGSW EQU   INPUTSW+2                                                00740000
TIOTNQSW EQU   INPUTSW+2                                                00741000
OFFLINSW EQU   INPUTSW+2                                                00742000
WTUNTSW  EQU   INPUTSW+2                                                00743000
NORESSW  EQU   INPUTSW+2                                                00744000
WTDSNSW  EQU   INPUTSW+2                                                00745000
WTVOLSW  EQU   INPUTSW+2                                                00746000
@NM00024 EQU   INPUTSW                                                  00747000
JOBRLSYS EQU   INPUTSW                                                  00748000
NOMONTSW EQU   INPUTSW                                                  00749000
NOCNVTSW EQU   INPUTSW                                                  00750000
ONCNVTSW EQU   INPUTSW                                                  00751000
DDNSCTP  EQU   DDNCTRLP+16                                              00752000
DDNJCTP  EQU   DDNCTRLP+12                                              00753000
DDNASCBP EQU   DDNCTRLP+4                                               00754000
INFOCODE EQU   DDNRETN+2                                                00755000
DSABGRID EQU   DSABGIDL+4                                               00756000
DSABLLEN EQU   DSABGIDL                                                 00757000
DSABANAM EQU   DSABANMI+1                                               00758000
DSABANML EQU   DSABANMI                                                 00759000
DSABRS04 EQU   DSAB+68                                                  00760000
DSABRS03 EQU   DSAB+62                                                  00761000
DSABDCBM EQU   DSAB+56                                                  00762000
DSABSSCM EQU   DSAB+52                                                  00763000
DSABSSNM EQU   DSAB+48                                                  00764000
DSABPTTR EQU   DSAB+44                                                  00765000
DSABRS02 EQU   DSAB+38                                                  00766000
@NM00039 EQU   DSABFLG4                                                 00767000
DSABCKSI EQU   DSABFLG4                                                 00768000
DSABCKVL EQU   DSABFLG4                                                 00769000
DSABCKDS EQU   DSABFLG4                                                 00770000
@NM00038 EQU   DSABFLG3                                                 00771000
DSABJSCT EQU   DSABFLG3                                                 00772000
DSABCATL EQU   DSABFLG3                                                 00773000
DSABVMSC EQU   DSABFLG3                                                 00774000
DSABVAM  EQU   DSABFLG3                                                 00775000
DSABPASS EQU   DSABFLG3                                                 00776000
DSABDEFR EQU   DSABFLG3                                                 00777000
@NM00037 EQU   DSABFLG2                                                 00778000
DSABUNAL EQU   DSABFLG2                                                 00779000
DSABIRM  EQU   DSABFLG2                                                 00780000
DSABOPEN EQU   DSABFLG2                                                 00781000
DSABDCAT EQU   DSABFLG1                                                 00782000
DSABDCNV EQU   DSABFLG1                                                 00783000
DSABPALC EQU   DSABFLG1                                                 00784000
DSABDALC EQU   DSABFLG1                                                 00785000
@NM00036 EQU   DSABORG2                                                 00786000
DSABTR   EQU   DSABORG2                                                 00787000
DSABAM   EQU   DSABORG2                                                 00788000
@NM00035 EQU   DSABORG2                                                 00789000
DSABTQ   EQU   DSABORG2                                                 00790000
DSABTX   EQU   DSABORG2                                                 00791000
DSABGS   EQU   DSABORG2                                                 00792000
DSABU    EQU   DSABORG1                                                 00793000
DSABPO   EQU   DSABORG1                                                 00794000
DSABMQ   EQU   DSABORG1                                                 00795000
DSABCQ   EQU   DSABORG1                                                 00796000
DSABCX   EQU   DSABORG1                                                 00797000
DSABDA   EQU   DSABORG1                                                 00798000
DSABPS   EQU   DSABORG1                                                 00799000
DSABIS   EQU   DSABORG1                                                 00800000
DSABSSVA EQU   DSAB+21                                                  00801000
DSABRS01 EQU   DSAB+20                                                  00802000
DSABLNTH EQU   DSAB+12                                                  00803000
DSABBCHN EQU   DSAB+8                                                   00804000
DSABID   EQU   DSAB                                                     00805000
JSCBCSCB EQU   JSCBSEC1+68                                              00806000
JSCBPMG  EQU   JSCBWTP+2                                                00807000
JSCBWTSP EQU   JSCBWTP+1                                                00808000
JSCRSV23 EQU   JSCBWTFG                                                 00809000
JSCRSV22 EQU   JSCBWTFG                                                 00810000
JSCRSV21 EQU   JSCBWTFG                                                 00811000
JSCRSV20 EQU   JSCBWTFG                                                 00812000
JSCRSV19 EQU   JSCBWTFG                                                 00813000
JSCRSV18 EQU   JSCBWTFG                                                 00814000
JSCBRET  EQU   JSCBWTFG                                                 00815000
JSCBIOFG EQU   JSCBWTFG                                                 00816000
@NM00032 EQU   JSCBSEC1+60                                              00817000
JSCBQMPI EQU   JSCBSEC1+56                                              00818000
JSCBPMSG EQU   JSCBSWT1                                                 00819000
JSCRSV16 EQU   JSCBSWT1                                                 00820000
JSCRSV15 EQU   JSCBSWT1                                                 00821000
JSCRSV14 EQU   JSCBSWT1                                                 00822000
JSCRSV13 EQU   JSCBSWT1                                                 00823000
JSCRSV12 EQU   JSCBSWT1                                                 00824000
JSCRSV11 EQU   JSCBSWT1                                                 00825000
JSCBPASS EQU   JSCBSWT1                                                 00826000
JSCBTTTR EQU   JSCBSEC1+52                                              00827000
JSCRSV10 EQU   JSCBSEC1+49                                              00828000
JSCBAUTH EQU   JSCBOPTS                                                 00829000
JSCSIOTS EQU   JSCBOPTS                                                 00830000
JSCRSV08 EQU   JSCBOPTS                                                 00831000
JSCRSV07 EQU   JSCBOPTS                                                 00832000
JSCRSV06 EQU   JSCBOPTS                                                 00833000
JSCBLONG EQU   JSCBOPTS                                                 00834000
JSCRSV05 EQU   JSCBOPTS                                                 00835000
JSCRSV04 EQU   JSCBOPTS                                                 00836000
JSCBSECB EQU   JSCBSEC1+44                                              00837000
JSCRSV03 EQU   JSCBSEC1+41                                              00838000
JSCBSTEP EQU   JSCBSEC1+40                                              00839000
JSCBDCBA EQU   JSCBDCB+1                                                00840000
JSCRSV02 EQU   JSCBDCB                                                  00841000
JSCBID   EQU   JSCBSEC1+32                                              00842000
JSCBDBTB EQU   JSCBSEC1+28                                              00843000
JSCBIJSC EQU   JSCBSEC1+24                                              00844000
JSCBTCBP EQU   JSCBSEC1+20                                              00845000
JSCBPCC  EQU   JSCBSEC1+16                                              00846000
JSCBTCP  EQU   JSCBSEC1+12                                              00847000
JSCBSHR  EQU   JSCBSEC1+8                                               00848000
JSCHPCEA EQU   JSCHPCE+1                                                00849000
JSCRSV32 EQU   JSCHPCE                                                  00850000
JSCRSV01 EQU   JSCBSEC1                                                 00851000
@NM00031 EQU   IEZJSCB                                                  00852000
QDBRV002 EQU   QDB+28                                                   00853000
QDBPRDS  EQU   QDB+26                                                   00854000
QDBPRSZ  EQU   QDB+24                                                   00855000
QDBBPTDS EQU   QDB+22                                                   00856000
QDBFPTDS EQU   QDB+20                                                   00857000
QDBLELMP EQU   QDB+16                                                   00858000
QDBFELMP EQU   QDB+12                                                   00859000
QDBNELMS EQU   QDB+8                                                    00860000
QDBRV001 EQU   QDB+6                                                    00861000
QDBATTR  EQU   QDB+4                                                    00862000
QDBQDB   EQU   QDB                                                      00863000
TEXTUPRM EQU   TEXTUFLD+2                                               00864000
TEXTULEN EQU   TEXTUFLD                                                 00865000
TXTPLEND EQU   TXTPLENT                                                 00866000
TXTUPEND EQU   TXTUNITP                                                 00867000
TEXTUNUM EQU   TEXTUNIT+2                                               00868000
TEXTUKEY EQU   TEXTUNIT                                                 00869000
TIOTFEND EQU   POOLSTAR+16                                              00870000
TIOPSLOT EQU   POOLSTAR+13                                              00871000
TIOPSTTB EQU   POOLSTAR+12                                              00872000
TIOPPOOL EQU   POOLSTAR+4                                               00873000
TIOPNSRT EQU   POOLSTAR+3                                               00874000
@NM00021 EQU   POOLSTAR+2                                               00875000
TIOPNSLT EQU   POOLSTAR+1                                               00876000
@NM00020 EQU   POOLSTAR                                                 00877000
TIOSVERF EQU   TIOESTTB                                                 00878000
TIOSUNLD EQU   TIOESTTB                                                 00879000
TIOSMNTD EQU   TIOESTTB                                                 00880000
TIOSSETU EQU   TIOESTTB                                                 00881000
TIOSVLSR EQU   TIOESTTB                                                 00882000
TIOSPVIO EQU   TIOESTTB                                                 00883000
TIOSREQD EQU   TIOESTTB                                                 00884000
TIOSUSED EQU   TIOESTTB                                                 00885000
TIOSBALS EQU   TIOESTTC                                                 00886000
TIOSBALP EQU   TIOESTTC                                                 00887000
TIOSVOLS EQU   TIOESTTC                                                 00888000
TIOSVOLP EQU   TIOESTTC                                                 00889000
TIOSAFFS EQU   TIOESTTC                                                 00890000
TIOSAFFP EQU   TIOESTTC                                                 00891000
TIOSDEFR EQU   TIOESTTC                                                 00892000
TIOSDKCR EQU   TIOESTTC                                                 00893000
TIOEJFCB EQU   TIOENTRY+12                                              00894000
TIOTREM  EQU   TIOELINK                                                 00895000
TIOESSDS EQU   TIOESYOT                                                 00896000
TIOESYIN EQU   TIOELINK                                                 00897000
TIOEDYNM EQU   TIOELINK                                                 00898000
TIOTRV01 EQU   TIOELINK                                                 00899000
TIOSYOUT EQU   TIOELINK                                                 00900000
TIOEWTCT EQU   TIOERLOC                                                 00901000
TIOSDSP2 EQU   TIOESTTA                                                 00902000
TIOSDSP1 EQU   TIOESTTA                                                 00903000
TIOSLABL EQU   TIOESTTA                                                 00904000
TIOSDADS EQU   TIOESTTA                                                 00905000
TIOSJBLB EQU   TIOESTTA                                                 00906000
TIOSPLTS EQU   TIOESTTA                                                 00907000
TIOSPLTP EQU   TIOESTTA                                                 00908000
TIOSLTYP EQU   TIOESTTA                                                 00909000
TIOELNGH EQU   TIOENTRY                                                 00910000
TIOCSTEP EQU   TIOT1+8                                                  00911000
TIOCNJOB EQU   TIOT1                                                    00912000
SIODDSNL EQU   INDMSIOT+173                                             00913000
SIOVDSNL EQU   INDMSIOT+172                                             00914000
SIOVDSNT EQU   INDMSIOT+170                                             00915000
SVOLUNNO EQU   INDMSIOT+168                                             00916000
SIOTVMVP EQU   INDMSIOT+164                                             00917000
SIOTJFX  EQU   INDMSIOT+160                                             00918000
SJFCBPTR EQU   INDMSIOT+156                                             00919000
SIOTNPTR EQU   INDMSIOT+152                                             00920000
SIOTETIO EQU   INDMSIOT+148                                             00921000
SIOTATE  EQU   INDMSIOT+144                                             00922000
SVOLUNAD EQU   INDMSIOT+140                                             00923000
SIOTEDLP EQU   INDMSIOT+136                                             00924000
SIOTEDLS EQU   INDMSIOT+132                                             00925000
SIOTRSNC EQU   INDMSIOT+130                                             00926000
SCTANAME EQU   INDMSIOT+122                                             00927000
@NM00019 EQU   INDMSIOT+108                                             00928000
SIOTSSNM EQU   INDMSIOT+104                                             00929000
SIODDQCR EQU   SIOTBYT2                                                 00930000
SIOVDQCR EQU   SIOTBYT2                                                 00931000
SIOTCVOL EQU   SIOTBYT2                                                 00932000
SIOTCNEW EQU   SIOTBYT2                                                 00933000
SIOTCALC EQU   SIOTBYT2                                                 00934000
SIOTGALL EQU   SIOTBYT2                                                 00935000
SIOTDSPD EQU   SIOTBYT2                                                 00936000
SIOTDMND EQU   SIOTBYT2                                                 00937000
SIOTOPUC EQU   INDMSIOT+99                                              00938000
SIOTOUTR EQU   INDMSIOT+97                                              00939000
SIOTOUTC EQU   INDMSIOT+96                                              00940000
@NM00018 EQU   INDMSIOT+93                                              00941000
SIOTAUNC EQU   SIOTALTD                                                 00942000
SIOTACAT EQU   SIOTALTD                                                 00943000
SIOTADEL EQU   SIOTALTD                                                 00944000
SIOTAKEP EQU   SIOTALTD                                                 00945000
SIOTNPRV EQU   SIOTALTD                                                 00946000
SIOJCATS EQU   SIOTALTD                                                 00947000
@NM00017 EQU   SIOTALTD                                                 00948000
@NM00016 EQU   SIOTALTD                                                 00949000
@NM00015 EQU   INDMSIOT+91                                              00950000
SIOTNDSB EQU   INDMSIOT+88                                              00951000
@NM00014 EQU   INDMSIOT+84                                              00952000
SIOTDPCD EQU   INDMSIOT+82                                              00953000
@NM00013 EQU   INDMSIOT+81                                              00954000
SCTOUTPN EQU   INDMSIOT+80                                              00955000
SCTOUTNO EQU   INDMSIOT+76                                              00956000
SCTOUTNM EQU   INDMSIOT+68                                              00957000
SIOUCBAD EQU   SCTUTYPE+5                                               00958000
SIOUCNVT EQU   SCTUTYPE+4                                               00959000
SIOUBYT4 EQU   SIOTDEVT+3                                               00960000
@NM00012 EQU   SIOUBYT3                                                 00961000
SIO3UREC EQU   SIOUBYT3                                                 00962000
SIO3DISP EQU   SIOUBYT3                                                 00963000
SIO3DACC EQU   SIOUBYT3                                                 00964000
SIO3COMM EQU   SIOUBYT3                                                 00965000
SIO3TAPE EQU   SIOUBYT3                                                 00966000
SIOUBYT2 EQU   SIOTDEVT+1                                               00967000
SIOUBYT1 EQU   SIOTDEVT                                                 00968000
SIOTOMN  EQU   SCTSBYT4                                                 00969000
SIOTIPDI EQU   SCTSBYT4                                                 00970000
SIOTVAFF EQU   SCTSBYT4                                                 00971000
SIOTSTEP EQU   SCTSBYT4                                                 00972000
SIOTASCI EQU   SCTSBYT4                                                 00973000
@NM00011 EQU   SCTSBYT4                                                 00974000
SIOTGDGA EQU   SCTSBYT4                                                 00975000
SCTSGDGS EQU   SCTSBYT4                                                 00976000
SCTSOLD  EQU   SCTSBYT3                                                 00977000
SCTSMOD  EQU   SCTSBYT3                                                 00978000
SCTSNEW  EQU   SCTSBYT3                                                 00979000
SCTSYSOU EQU   SCTSBYT3                                                 00980000
SCTVREF  EQU   SCTSBYT3                                                 00981000
@NM00010 EQU   SCTSBYT3                                                 00982000
SCTSYSNE EQU   SCTSBYT3                                                 00983000
SCTDSNRF EQU   SCTSBYT3                                                 00984000
SCTRECVD EQU   SCTSBYT2                                                 00985000
SCTDEFER EQU   SCTSBYT2                                                 00986000
SCTLABEL EQU   SCTSBYT2                                                 00987000
SCTUNLBD EQU   SCTSBYT2                                                 00988000
SCTJOBLB EQU   SCTSBYT2                                                 00989000
SCTVOLAF EQU   SCTSBYT2                                                 00990000
SIOTCATL EQU   SCTSBYT2                                                 00991000
SIOCLUNL EQU   SCTSBYT2                                                 00992000
SIOTJSCT EQU   SCTSBYT1                                                 00993000
SCTUNAFF EQU   SCTSBYT1                                                 00994000
SCTPARLM EQU   SCTSBYT1                                                 00995000
SIOTQDSN EQU   SCTSBYT1                                                 00996000
SIOTGDSN EQU   SCTSBYT1                                                 00997000
SIOTCCAT EQU   SCTSBYT1                                                 00998000
SCTSYSIN EQU   SCTSBYT1                                                 00999000
SIOTUNCT EQU   SCTSDISP                                                 01000000
SIOTCTLG EQU   SCTSDISP                                                 01001000
SIOTDLET EQU   SCTSDISP                                                 01002000
SIOTKEEP EQU   SCTSDISP                                                 01003000
SIOTPASS EQU   SCTSDISP                                                 01004000
SIOTPRIV EQU   SCTSDISP                                                 01005000
S3400DSP EQU   SCTSDISP                                                 01006000
@NM00009 EQU   SCTSDISP                                                 01007000
SIOTVLCT EQU   INDMSIOT+54                                              01008000
SCTNMBUT EQU   INDMSIOT+53                                              01009000
SIOTRTRY EQU   SIOTBYT0                                                 01010000
SIOTPUPV EQU   SIOTBYT0                                                 01011000
SIOTNOPV EQU   SIOTBYT0                                                 01012000
SIOTGIGN EQU   SIOTBYT0                                                 01013000
SPVTAMSG EQU   SIOTBYT0                                                 01014000
SIOTFUDA EQU   SIOTBYT0                                                 01015000
SIOTDYAL EQU   SIOTBYT0                                                 01016000
SIOTSSDS EQU   SIOTBYT0                                                 01017000
SIOTGIID EQU   INDMSIOT+50                                              01018000
SCTVOLCT EQU   INDMSIOT+49                                              01019000
SCTSPOOL EQU   INDMSIOT+48                                              01020000
SIOTQNAM EQU   SIOTTSTC                                                 01021000
@NM00008 EQU   SIOTTSTC                                                 01022000
SIOTTERM EQU   SIOTTSTC                                                 01023000
@NM00007 EQU   SIOTTSTC                                                 01024000
@NM00006 EQU   SIOTBYT3                                                 01025000
SIOTJES3 EQU   SIOTBYT3                                                 01026000
SIOCDEVT EQU   SIOTBYT3                                                 01027000
SIOALIAS EQU   SIOTBYT3                                                 01028000
SCTDDINO EQU   INDMSIOT+44                                              01029000
SIOTDDNT EQU   SIOTBYT1                                                 01030000
SIOTALCD EQU   SIOTBYT1                                                 01031000
SIODADSM EQU   SIOTBYT1                                                 01032000
SIOTDADR EQU   SIOTBYT1                                                 01033000
SIODUNAL EQU   SIOTBYT1                                                 01034000
SIOVAMDS EQU   SIOTBYT1                                                 01035000
SIOTHOLD EQU   SIOTBYT1                                                 01036000
SIOTOCKP EQU   SIOTBYT1                                                 01037000
SIOPSCNT EQU   INDMSIOT+42                                              01038000
SIOTREFN EQU   INDMSIOT+40                                              01039000
SIOTOTUN EQU   INDMSIOT+39                                              01040000
SIOTVRSB EQU   INDMSIOT+36                                              01041000
@NM00005 EQU   INDMSIOT+35                                              01042000
SCTPJFCB EQU   INDMSIOT+32                                              01043000
@NM00004 EQU   INDMSIOT+31                                              01044000
SCTPSIOT EQU   INDMSIOT+28                                              01045000
SIOTAFID EQU   INDMSIOT+26                                              01046000
@NM00003 EQU   INDMSIOT+24                                              01047000
SIODSNTE EQU   INDMSIOT+22                                              01048000
SIOTUNAF EQU   SCTUSADD                                                 01049000
SIOTDEST EQU   INDMSIOT+12                                              01050000
SCTDDNAM EQU   INDMSIOT+4                                               01051000
SIOTTYPE EQU   INDMSIOT+3                                               01052000
SIOTDSKA EQU   INDMSIOT                                                 01053000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01054000
@RF00058 EQU   @RC00053                                                 01055000
@RC00100 EQU   @RC00098                                                 01056000
@RC00111 EQU   @RC00087                                                 01057000
@RC00114 EQU   @RC00111                                                 01058000
@ENDDATA EQU   *                                                        01059000
         END   IEFDB490,(C'PLS0114',0603,75024)                         01060000
./  ADD  SSI=32300164,NAME=IEFDPOST
         TITLE 'IEFDPOST - DEVICE INTERRUPT RTN                        *00001000
                       '                                                00002000
IEFDPOST CSECT                                                          00003000
*                                           STACK SAVED BY RESTART      00004000
*                                           FLIH               MDC078*/ 00005000
*REG9 = REG13;                         /*ADDRESS LOCAL LOCK SAVE AREA*/ 00006000
         LR    REG9,REG13                                       01S0031 00007000
*GEN;                                                           01S0032 00008000
        STM   14,12,12(9)         SAVE REGISTERS IN IOS SAVE AREA       00009000
        BALR  5,0                 SET UP ADDRESSABILITY                 00010000
START   DS    0H                                                        00011000
        USING START,5                                                   00012000
* DO; /* SETLOCK (OBTAIN) MODE(UNCOND) TYPE(CMS) REGS(USE) RELATED(MVCA 00013000
*IEFDPOST(IEFDPOST)) */                                         01S0033 00014000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) RSTD;                     01S0034 00015000
*   RFY (GPR15P,GPR00P,GPR01P) RSTD;                            01S0035 00016000
*   GPR15P = GPR11P; /* SAVE REG. 11 IN REG. 15. */             01S0036 00017000
         LR    GPR15P,GPR11P                                    01S0036 00018000
*   GPR00P = GPR12P; /* SAVE REG. 12 IN REG. 0. */              01S0037 00019000
         LR    GPR00P,GPR12P                                    01S0037 00020000
*   GPR01P = GPR13P; /* SAVE REG. 13 IN REG. 1. */              01S0038 00021000
         LR    GPR01P,GPR13P                                    01S0038 00022000
*   GPR13P = PSALITA; /* ADDRESS OF LOCK INTERFACE TABLE. */    01S0039 00023000
         L     GPR13P,PSALITA                                   01S0039 00024000
*   GEN(LM GPR11P,GPR13P,540(GPR13P)); /* LOAD LOCKWORD, CLHT AND ENTRY 00025000
*ADRS. */                                                       01S0040 00026000
         LM GPR11P,GPR13P,540(GPR13P)                                   00027000
*   GEN(BALR GPR14P,GPR13P); /* BALR TO SETLOCK RTN. */         01S0041 00028000
         BALR GPR14P,GPR13P                                             00029000
*   GPR11P = GPR15P; /* RESTORE REG. 11. */                     01S0042 00030000
         LR    GPR11P,GPR15P                                    01S0042 00031000
*   GPR15P = GPR13P; /* SAVE RETURN CODE. */                    01S0043 00032000
         LR    GPR15P,GPR13P                                    01S0043 00033000
*   GPR12P = GPR00P; /* RESTORE REG. 12 */                      01S0044 00034000
         LR    GPR12P,GPR00P                                    01S0044 00035000
*   GPR13P = GPR01P; /* RESTORE REG. 13. */                     01S0045 00036000
         LR    GPR13P,GPR01P                                    01S0045 00037000
*   RFY(GPR15P,GPR00P,GPR01P) UNRSTD;                           01S0046 00038000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) UNRSTD;                   01S0047 00039000
* END; /* SETLOCK (OBTAIN) MODE(UNCOND) TYPE(CMS) REGS(USE) RELATED(MVC 00040000
*,IEFDPOST(IEFDPOST)) */                                        01S0048 00041000
*ATCAPTR = CVTQMWR;                    /*ADDRESS ATCA                */ 00042000
         L     @12,CVTPTR                                       01S0049 00043000
         L     ATCAPTR,CVTQMWR(,@12)                            01S0049 00044000
*MVCAPTR = ATCAMVCP;                   /*ADDRESS FIRST MVCA          */ 00045000
         L     MVCAPTR,ATCAMVCP(,ATCAPTR)                       01S0050 00046000
*DO WHILE(MVCAPTR ¬= ZERO);            /*PROCESS MVCA CHAIN          */ 00047000
         B     @DE00051                                         01S0051 00048000
@DL00051 DS    0H                                               01S0052 00049000
*  ASVTPTR = CVTASVT;                  /*ADDRESS ASVT                */ 00050000
         L     @12,CVTPTR                                       01S0052 00051000
         L     ASVTPTR,CVTASVT(,@12)                            01S0052 00052000
*  ASCBENTP = ADDR(ASVTENTY) + (LENGTH(ASVTENTY)                01S0053 00053000
*             * (MVCAASID - ONE));     /*PTR TO CURRENT ASCB PTR     */ 00054000
         LA    ASCBENTP,ASVTENTY(,ASVTPTR)                      01S0053 00055000
         LH    @04,MVCAASID(,MVCAPTR)                           01S0053 00056000
         BCTR  @04,0                                            01S0053 00057000
         SLA   @04,2                                            01S0053 00058000
         AR    ASCBENTP,@04                                     01S0053 00059000
*  ASCBPTR = ASCBADDP;                 /*ASCB PTR                    */ 00060000
         L     ASCBPTR,ASCBADDP(,ASCBENTP)                      01S0054 00061000
*  TEMPSAV = MVCAPTR;                  /*SAVE MVCAPTR                */ 00062000
         ST    MVCAPTR,TEMPSAV(,REG9)                           01S0055 00063000
*  RFY (REG10,REG11,REG12) RSTD;                                01S0056 00064000
*  REG12 = ADDR(ERRET);                /*ADDRESS OF POST FAILURE RTN */ 00065000
         LA    REG12,ERRET                                      01S0057 00066000
*  REG11 = ADDR(MVDEVECB);             /*ADDRESS DEVICE END ECB      */ 00067000
         L     REG11,MVCAXPTR(,MVCAPTR)                         01S0058 00068000
*  REG11 = REG11 | HIGHORDR;           /*INDICATE XMPOST             */ 00069000
         O     REG11,@CF00078                                   01S0059 00070000
*  REG10 = REG10 && REG10;             /*CLEAR COMPLETION CODE       */ 00071000
         XR    REG10,REG10                                      01S0060 00072000
*  CALL IEA0PT01;                      /*BRANCH TO POST ROUTINE      */ 00073000
         L     @15,@CV01085                                     01S0061 00074000
         BALR  @14,@15                                          01S0061 00075000
*  GEN (USING *,14);                                            01S0062 00076000
         USING *,14                                                     00077000
*  REG5 = STARTP;                      /*RESTORE BASE REG ADDRABILITY*/ 00078000
         L     REG5,STARTP                                      01S0063 00079000
*  GEN (DROP 14);                                               01S0064 00080000
         DROP 14                                                        00081000
*  RFY (REG10,REG11,REG12) UNRSTD;                              01S0065 00082000
*  MVCAPTR = TEMPSAV;                  /*RESTORE MVCAPTR             */ 00083000
         L     MVCAPTR,TEMPSAV(,REG9)                           01S0066 00084000
*  MVCAPTR = MVCANXTP;                 /*PTR TO NEXT MVCA            */ 00085000
         L     MVCAPTR,MVCANXTP(,MVCAPTR)                       01S0067 00086000
*END;                                                           01S0068 00087000
@DE00051 LTR   MVCAPTR,MVCAPTR                                  01S0068 00088000
         BNZ   @DL00051                                         01S0068 00089000
* DO; /* SETLOCK (RELEASE) TYPE(CMS) REGS(USE) RELATED(MVCA,IEFDPOST(IE 00090000
*DPOST)) */                                                     01S0069 00091000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) RSTD;                     01S0070 00092000
*   RFY (GPR15P,GPR00P,GPR01P) RSTD;                            01S0071 00093000
*   GPR15P = GPR11P; /* SAVE REG. 11 IN REG. 15. */             01S0072 00094000
         LR    GPR15P,GPR11P                                    01S0072 00095000
*   GPR00P = GPR12P; /* SAVE REG. 12 IN REG. 0. */              01S0073 00096000
         LR    GPR00P,GPR12P                                    01S0073 00097000
*   GPR01P = GPR13P; /* SAVE REG. 13 IN REG. 1. */              01S0074 00098000
         LR    GPR01P,GPR13P                                    01S0074 00099000
*   GPR13P = PSALITA; /* ADDRESS OF LOCK INTERFACE TABLE. */    01S0075 00100000
         L     GPR13P,PSALITA                                   01S0075 00101000
*   GEN(LM GPR11P,GPR13P,552(GPR13P)); /* LOAD LOCKWORD, CLHT AND ENTRY 00102000
*ADRS. */                                                       01S0076 00103000
         LM GPR11P,GPR13P,552(GPR13P)                                   00104000
*   GEN(BALR GPR14P,GPR13P); /* BALR TO SETLOCK RTN. */         01S0077 00105000
         BALR GPR14P,GPR13P                                             00106000
*   GPR11P = GPR15P; /* RESTORE REG. 11. */                     01S0078 00107000
         LR    GPR11P,GPR15P                                    01S0078 00108000
*   GPR15P = GPR13P; /* SAVE RETURN CODE. */                    01S0079 00109000
         LR    GPR15P,GPR13P                                    01S0079 00110000
*   GPR12P = GPR00P; /* RESTORE REG. 12 */                      01S0080 00111000
         LR    GPR12P,GPR00P                                    01S0080 00112000
*   GPR13P = GPR01P; /* RESTORE REG. 13. */                     01S0081 00113000
         LR    GPR13P,GPR01P                                    01S0081 00114000
*   RFY(GPR15P,GPR00P,GPR01P) UNRSTD;                           01S0082 00115000
*   RFY (GPR11P,GPR12P,GPR13P,GPR14P) UNRSTD;                   01S0083 00116000
* END; /* SETLOCK (RELEASE) TYPE(CMS) REGS(USE) RELATED(MVCA,IEFDPOST(I 00117000
*FDPOST)) */                                                    01S0084 00118000
*REG13 = REG9;                         /*RESTORE REG13               */ 00119000
         LR    REG13,REG9                                       01S0085 00120000
*GEN;                                                           01S0086 00121000
        LM    14,12,12(13)        RESTORE CALLER REGISTERS              00122000
        BR    14                  RETURN TO CALLER                      00123000
*END IEFDPOST                                                   01S0087 00124000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00125000
*/*%INCLUDE SYSLIB  (POSTSPEC)                                        * 00126000
*/*%INCLUDE SYSLIB  (POSTDATA)                                        * 00127000
*/*%INCLUDE SYSLIB  (IHAASVT )                                        * 00128000
*/*%INCLUDE SYSLIB  (CVT     )                                        * 00129000
*/*%INCLUDE SYSLIB  (IEFZB432)                                        * 00130000
*/*%INCLUDE SYSLIB  (IEFZB433)                                        * 00131000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                        * 00132000
*;                                                              01S0087 00133000
@DATA    DS    0H                                                       00134000
         DS    0F                                                       00135000
         DS    0F                                                       00136000
@CF00078 DC    XL4'80000000'                                            00137000
@CV01085 DC    V(IEA0PT01)                                              00138000
         DS    0D                                                       00139000
STARTP   DC    AL4(START)                                               00140000
MTENTPTR DS    A                                                        00141000
ERRET    DC    X'07FE'                                                  00142000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00143000
@01      EQU   01                                                       00144000
@02      EQU   02                                                       00145000
@03      EQU   03                                                       00146000
@04      EQU   04                                                       00147000
@05      EQU   05                                                       00148000
@06      EQU   06                                                       00149000
@07      EQU   07                                                       00150000
@08      EQU   08                                                       00151000
@09      EQU   09                                                       00152000
@10      EQU   10                                                       00153000
@11      EQU   11                                                       00154000
@12      EQU   12                                                       00155000
@13      EQU   13                                                       00156000
@14      EQU   14                                                       00157000
@15      EQU   15                                                       00158000
REG13    EQU   @13                                                      00159000
ASCBENTP EQU   @13                                                      00160000
ASCBPTR  EQU   @13                                                      00161000
ASVTPTR  EQU   @08                                                      00162000
ATCAPTR  EQU   @06                                                      00163000
MVCAPTR  EQU   @07                                                      00164000
REG5     EQU   @05                                                      00165000
REG9     EQU   @09                                                      00166000
REG10    EQU   @10                                                      00167000
REG11    EQU   @11                                                      00168000
REG12    EQU   @12                                                      00169000
GPR00P   EQU   @00                                                      00170000
GPR01P   EQU   @01                                                      00171000
GPR14P   EQU   @14                                                      00172000
GPR15P   EQU   @15                                                      00173000
GPR13P   EQU   @13                                                      00174000
GPR12P   EQU   @12                                                      00175000
GPR11P   EQU   @11                                                      00176000
GPR00F   EQU   @00                                                      00177000
GPR01F   EQU   @01                                                      00178000
GPR11F   EQU   @11                                                      00179000
GPR12F   EQU   @12                                                      00180000
GPR13F   EQU   @13                                                      00181000
GPR14F   EQU   @14                                                      00182000
GPR15F   EQU   @15                                                      00183000
CVTPTR   EQU   16                                                       00184000
PSA      EQU   0                                                        00185000
FLCRNPSW EQU   PSA                                                      00186000
FLCROPSW EQU   PSA+8                                                    00187000
FLCICCW2 EQU   PSA+16                                                   00188000
PSAEEPSW EQU   PSA+132                                                  00189000
PSAESPSW EQU   PSA+136                                                  00190000
FLCSVILC EQU   PSAESPSW+1                                               00191000
PSAEPPSW EQU   PSA+140                                                  00192000
FLCPIILC EQU   PSAEPPSW+1                                               00193000
FLCPICOD EQU   PSAEPPSW+2                                               00194000
PSAPICOD EQU   FLCPICOD+1                                               00195000
FLCTEA   EQU   PSAEPPSW+4                                               00196000
FLCPER   EQU   PSA+152                                                  00197000
FLCMCLA  EQU   PSA+168                                                  00198000
FLCIOEL  EQU   FLCMCLA+4                                                00199000
FLCIOA   EQU   FLCMCLA+16                                               00200000
FLCFSA   EQU   FLCMCLA+80                                               00201000
PSASUPER EQU   PSA+552                                                  00202000
PSASUP1  EQU   PSASUPER                                                 00203000
PSASUP2  EQU   PSASUPER+1                                               00204000
PSASUP3  EQU   PSASUPER+2                                               00205000
PSASUP4  EQU   PSASUPER+3                                               00206000
PSACLHT  EQU   PSA+640                                                  00207000
PSALKSA  EQU   PSA+696                                                  00208000
PSAHLHI  EQU   PSA+760                                                  00209000
PSALITA  EQU   PSA+764                                                  00210000
PSADSSFL EQU   PSA+836                                                  00211000
PSADSSF1 EQU   PSADSSFL                                                 00212000
PSADSSF3 EQU   PSADSSFL+2                                               00213000
PSADSSF4 EQU   PSADSSFL+3                                               00214000
PSARSVT  EQU   PSA+896                                                  00215000
ASCBADDP EQU   0                                                        00216000
TEMPSAV  EQU   0                                                        00217000
ASVT     EQU   0                                                        00218000
ASVTFRST EQU   ASVT+524                                                 00219000
ASVTENTY EQU   ASVT+528                                                 00220000
CVTMAP   EQU   0                                                        00221000
CVTDAR   EQU   CVTMAP+72                                                00222000
CVTFLGS1 EQU   CVTDAR                                                   00223000
CVTDCB   EQU   CVTMAP+116                                               00224000
CVTQMWR  EQU   CVTMAP+176                                               00225000
CVTOPTA  EQU   CVTMAP+182                                               00226000
CVTOPTB  EQU   CVTMAP+183                                               00227000
CVTTSCVT EQU   CVTMAP+228                                               00228000
CVTTSFLG EQU   CVTTSCVT                                                 00229000
CVTGTF   EQU   CVTMAP+236                                               00230000
CVTGTFST EQU   CVTGTF                                                   00231000
CVTGTFS  EQU   CVTGTFST                                                 00232000
CVTSTATE EQU   CVTGTFST                                                 00233000
CVTTMODE EQU   CVTGTFST                                                 00234000
CVTFORM  EQU   CVTGTFST                                                 00235000
CVTUSR   EQU   CVTGTFST                                                 00236000
CVTAQAVT EQU   CVTMAP+240                                               00237000
CVTTCMFG EQU   CVTAQAVT                                                 00238000
CVTVOLM2 EQU   CVTMAP+244                                               00239000
CVTTATA  EQU   CVTVOLM2                                                 00240000
CVTTSKS  EQU   CVTTATA                                                  00241000
CVTVOLF2 EQU   CVTTSKS                                                  00242000
CVTTAT   EQU   CVTTATA+1                                                00243000
CVTATER  EQU   CVTMAP+248                                               00244000
CVTEXT1  EQU   CVTMAP+252                                               00245000
CVTPURG  EQU   CVTMAP+260                                               00246000
CVTQMSG  EQU   CVTMAP+268                                               00247000
CVTDMSR  EQU   CVTMAP+272                                               00248000
CVTAPF   EQU   CVTMAP+324                                               00249000
CVTEXT2  EQU   CVTMAP+328                                               00250000
CVTHJES  EQU   CVTMAP+332                                               00251000
CVTPGSIA EQU   CVTMAP+348                                               00252000
CVTA1F1  EQU   CVTMAP+356                                               00253000
CVTSYSK  EQU   CVTMAP+357                                               00254000
CVTVOLM1 EQU   CVTMAP+380                                               00255000
CVTVOLF1 EQU   CVTVOLM1                                                 00256000
CVTATMCT EQU   CVTMAP+388                                               00257000
CVTXTNT1 EQU   0                                                        00258000
CVTXTNT2 EQU   0                                                        00259000
CVTDSSV  EQU   CVTXTNT2                                                 00260000
CVTRSV90 EQU   CVTXTNT2+5                                               00261000
CVTQID   EQU   CVTXTNT2+24                                              00262000
CVTRV400 EQU   CVTXTNT2+52                                              00263000
CVTRV409 EQU   CVTXTNT2+53                                              00264000
CVTATCVT EQU   CVTXTNT2+64                                              00265000
CVTRV429 EQU   CVTXTNT2+84                                              00266000
CVTRV438 EQU   CVTXTNT2+85                                              00267000
CVTRV457 EQU   CVTXTNT2+112                                             00268000
CVTRV466 EQU   CVTXTNT2+113                                             00269000
CVTFIX   EQU   0                                                        00270000
CVTRELNO EQU   CVTFIX+252                                               00271000
ATCA     EQU   0                                                        00272000
ATCA438P EQU   ATCA                                                     00273000
ATCAMVCP EQU   ATCA+12                                                  00274000
MVCA     EQU   0                                                        00275000
MVCAASID EQU   MVCA+2                                                   00276000
MVCANXTP EQU   MVCA+8                                                   00277000
MVCAXPTR EQU   MVCA+12                                                  00278000
MVCAX    EQU   0                                                        00279000
MVDEVECB EQU   MVCAX                                                    00280000
MVSWITCH EQU   MVCAX+4                                                  00281000
MTENTRY  EQU   0                                                        00282000
MTENBASE EQU   MTENTRY                                                  00283000
MTDEVPTR EQU   MTENBASE+12                                              00284000
MTDOMPTR EQU   MTENBASE+16                                              00285000
MTDEVENT EQU   0                                                        00286000
MTSTATUS EQU   MTDEVENT                                                 00287000
IEFAB438 EQU   0                                                        00288000
IKEBC    EQU   0                                                        00289000
IKEBF15  EQU   0                                                        00290000
IKEBF31  EQU   0                                                        00291000
IKEBP15  EQU   0                                                        00292000
IKEBP31  EQU   0                                                        00293000
IKEBP8   EQU   0                                                        00294000
MTDOMIDS EQU   0                                                        00295000
CVTS01   EQU   CVTPGSIA                                                 00296000
CVTLPDIA EQU   CVTS01+12                                                00297000
CVTDIRST EQU   CVTLPDIA                                                 00298000
CVTSLIDA EQU   CVTS01+24                                                00299000
CVTCTLFG EQU   CVTS01+50                                                00300000
CVTRV100 EQU   CVTS01+116                                               00301000
CVTRV109 EQU   CVTS01+117                                               00302000
CVTRV118 EQU   CVTS01+118                                               00303000
CVTRV127 EQU   CVTS01+119                                               00304000
CVTASVT  EQU   CVTS01+208                                               00305000
CVTRV210 EQU   CVTS01+424                                               00306000
CVTRV219 EQU   CVTS01+425                                               00307000
CVTRV228 EQU   CVTS01+426                                               00308000
CVTRV237 EQU   CVTS01+427                                               00309000
CVTMFRTR EQU   CVTS01+452                                               00310000
CVTRV262 EQU   CVTS01+468                                               00311000
CVTRV271 EQU   CVTS01+469                                               00312000
CVTRV280 EQU   CVTS01+470                                               00313000
CVTRV289 EQU   CVTS01+471                                               00314000
CVTGSDA  EQU   CVTS01+600                                               00315000
PSARSVTE EQU   PSARSVT                                                  00316000
FLC      EQU   PSA                                                      00317000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00318000
PSARSAV  EQU   PSARSVTE+60                                              00319000
PSARSTK  EQU   PSARSVTE+56                                              00320000
PSAESAV3 EQU   PSARSVTE+52                                              00321000
PSAESTK3 EQU   PSARSVTE+48                                              00322000
PSAESAV2 EQU   PSARSVTE+44                                              00323000
PSAESTK2 EQU   PSARSVTE+40                                              00324000
PSAESAV1 EQU   PSARSVTE+36                                              00325000
PSAESTK1 EQU   PSARSVTE+32                                              00326000
PSAPSAV  EQU   PSARSVTE+28                                              00327000
PSAPSTK  EQU   PSARSVTE+24                                              00328000
PSAMSAV  EQU   PSARSVTE+20                                              00329000
PSAMSTK  EQU   PSARSVTE+16                                              00330000
PSASSAV  EQU   PSARSVTE+12                                              00331000
PSASSTK  EQU   PSARSVTE+8                                               00332000
PSANSTK  EQU   PSARSVTE+4                                               00333000
PSACSTK  EQU   PSARSVTE                                                 00334000
CVTTPIO  EQU   CVTS01+608                                               00335000
CVTADV   EQU   CVTS01+604                                               00336000
CVTGSDAB EQU   CVTGSDA                                                  00337000
CVTQV3   EQU   CVTS01+596                                               00338000
CVTQV2   EQU   CVTS01+592                                               00339000
CVTQV1   EQU   CVTS01+588                                               00340000
CVTRPT   EQU   CVTS01+584                                               00341000
CVTSSRB  EQU   CVTS01+580                                               00342000
CVTCSDRL EQU   CVTS01+576                                               00343000
CVTEXP1  EQU   CVTS01+572                                               00344000
CVTRMPMT EQU   CVTS01+568                                               00345000
CVTRMPTT EQU   CVTS01+564                                               00346000
CVTVPSA  EQU   CVTS01+560                                               00347000
CVTVSTOP EQU   CVTS01+556                                               00348000
CVTGTFR8 EQU   CVTS01+552                                               00349000
CVTQUIT  EQU   CVTS01+548                                               00350000
CVTVACR  EQU   CVTS01+544                                               00351000
CVTWTCB  EQU   CVTS01+540                                               00352000
CVTSTPRS EQU   CVTS01+536                                               00353000
CVT0PT02 EQU   CVTS01+532                                               00354000
CVTDARCM EQU   CVTS01+528                                               00355000
CVTIRECM EQU   CVTS01+524                                               00356000
CVTJRECM EQU   CVTS01+520                                               00357000
CVTVEMS0 EQU   CVTS01+516                                               00358000
CVTSPFRR EQU   CVTS01+512                                               00359000
CVTRLSTG EQU   CVTS01+508                                               00360000
CVT0TC0A EQU   CVTS01+504                                               00361000
CVTGMBR  EQU   CVTS01+500                                               00362000
CVTLFRM  EQU   CVTS01+496                                               00363000
CVTRMBR  EQU   CVTS01+492                                               00364000
CVTVIOP  EQU   CVTS01+488                                               00365000
CVTRV307 EQU   CVTS01+486                                               00366000
CVTRV306 EQU   CVTS01+484                                               00367000
CVTRV305 EQU   CVTS01+482                                               00368000
CVTRV304 EQU   CVTS01+480                                               00369000
CVTRV303 EQU   CVTS01+478                                               00370000
CVTRV302 EQU   CVTS01+476                                               00371000
CVTRV301 EQU   CVTS01+475                                               00372000
CVTRV300 EQU   CVTS01+474                                               00373000
CVTRV299 EQU   CVTS01+473                                               00374000
CVTRV298 EQU   CVTS01+472                                               00375000
CVTRV297 EQU   CVTRV289                                                 00376000
CVTRV296 EQU   CVTRV289                                                 00377000
CVTRV295 EQU   CVTRV289                                                 00378000
CVTRV294 EQU   CVTRV289                                                 00379000
CVTRV293 EQU   CVTRV289                                                 00380000
CVTRV292 EQU   CVTRV289                                                 00381000
CVTRV291 EQU   CVTRV289                                                 00382000
CVTRV290 EQU   CVTRV289                                                 00383000
CVTRV288 EQU   CVTRV280                                                 00384000
CVTRV287 EQU   CVTRV280                                                 00385000
CVTRV286 EQU   CVTRV280                                                 00386000
CVTRV285 EQU   CVTRV280                                                 00387000
CVTRV284 EQU   CVTRV280                                                 00388000
CVTRV283 EQU   CVTRV280                                                 00389000
CVTRV282 EQU   CVTRV280                                                 00390000
CVTRV281 EQU   CVTRV280                                                 00391000
CVTRV279 EQU   CVTRV271                                                 00392000
CVTRV278 EQU   CVTRV271                                                 00393000
CVTRV277 EQU   CVTRV271                                                 00394000
CVTRV276 EQU   CVTRV271                                                 00395000
CVTRV275 EQU   CVTRV271                                                 00396000
CVTRV274 EQU   CVTRV271                                                 00397000
CVTRV273 EQU   CVTRV271                                                 00398000
CVTRV272 EQU   CVTRV271                                                 00399000
CVTRV270 EQU   CVTRV262                                                 00400000
CVTRV269 EQU   CVTRV262                                                 00401000
CVTRV268 EQU   CVTRV262                                                 00402000
CVTRV267 EQU   CVTRV262                                                 00403000
CVTRV266 EQU   CVTRV262                                                 00404000
CVTRV265 EQU   CVTRV262                                                 00405000
CVTRV264 EQU   CVTRV262                                                 00406000
CVTRV263 EQU   CVTRV262                                                 00407000
CVTVFP   EQU   CVTS01+464                                               00408000
CVTVSI   EQU   CVTS01+460                                               00409000
CVTVPSIB EQU   CVTS01+456                                               00410000
CVTMFACT EQU   CVTMFRTR                                                 00411000
CVTMFCTL EQU   CVTS01+448                                               00412000
CVTPVBP  EQU   CVTS01+444                                               00413000
CVTPWI   EQU   CVTS01+440                                               00414000
CVTRV254 EQU   CVTS01+438                                               00415000
CVTRV253 EQU   CVTS01+436                                               00416000
CVTRV252 EQU   CVTS01+434                                               00417000
CVTRV251 EQU   CVTS01+433                                               00418000
CVTRV250 EQU   CVTS01+432                                               00419000
CVTRV249 EQU   CVTS01+431                                               00420000
CVTRV248 EQU   CVTS01+430                                               00421000
CVTRV247 EQU   CVTS01+429                                               00422000
CVTRV246 EQU   CVTS01+428                                               00423000
CVTRV245 EQU   CVTRV237                                                 00424000
CVTRV244 EQU   CVTRV237                                                 00425000
CVTRV243 EQU   CVTRV237                                                 00426000
CVTRV242 EQU   CVTRV237                                                 00427000
CVTRV241 EQU   CVTRV237                                                 00428000
CVTRV240 EQU   CVTRV237                                                 00429000
CVTRV239 EQU   CVTRV237                                                 00430000
CVTRV238 EQU   CVTRV237                                                 00431000
CVTRV236 EQU   CVTRV228                                                 00432000
CVTRV235 EQU   CVTRV228                                                 00433000
CVTRV234 EQU   CVTRV228                                                 00434000
CVTRV233 EQU   CVTRV228                                                 00435000
CVTRV232 EQU   CVTRV228                                                 00436000
CVTRV231 EQU   CVTRV228                                                 00437000
CVTRV230 EQU   CVTRV228                                                 00438000
CVTRV229 EQU   CVTRV228                                                 00439000
CVTRV227 EQU   CVTRV219                                                 00440000
CVTRV226 EQU   CVTRV219                                                 00441000
CVTRV225 EQU   CVTRV219                                                 00442000
CVTRV224 EQU   CVTRV219                                                 00443000
CVTRV223 EQU   CVTRV219                                                 00444000
CVTRV222 EQU   CVTRV219                                                 00445000
CVTRV221 EQU   CVTRV219                                                 00446000
CVTRV220 EQU   CVTRV219                                                 00447000
CVTRV218 EQU   CVTRV210                                                 00448000
CVTRV217 EQU   CVTRV210                                                 00449000
CVTRV216 EQU   CVTRV210                                                 00450000
CVTRV215 EQU   CVTRV210                                                 00451000
CVTRV214 EQU   CVTRV210                                                 00452000
CVTRV213 EQU   CVTRV210                                                 00453000
CVTRV212 EQU   CVTRV210                                                 00454000
CVTRV211 EQU   CVTRV210                                                 00455000
CVTLCCAT EQU   CVTS01+420                                               00456000
CVTPCCAT EQU   CVTS01+416                                               00457000
CVTIPCRP EQU   CVTS01+412                                               00458000
CVTIPCRI EQU   CVTS01+408                                               00459000
CVTIPCDS EQU   CVTS01+404                                               00460000
CVTAIDVT EQU   CVTS01+400                                               00461000
CVTSSAP  EQU   CVTS01+396                                               00462000
CVTRV202 EQU   CVTS01+394                                               00463000
CVTRV201 EQU   CVTS01+392                                               00464000
CVTRV200 EQU   CVTS01+390                                               00465000
CVTRV199 EQU   CVTS01+388                                               00466000
CVTRV198 EQU   CVTS01+386                                               00467000
CVTRV197 EQU   CVTS01+384                                               00468000
CVTRV196 EQU   CVTS01+383                                               00469000
CVTRV195 EQU   CVTS01+382                                               00470000
CVTRV194 EQU   CVTS01+381                                               00471000
CVTRV193 EQU   CVTS01+380                                               00472000
CVT044R2 EQU   CVTS01+376                                               00473000
CVTFETCH EQU   CVTS01+372                                               00474000
CVTRSTWD EQU   CVTS01+368                                               00475000
CVTSPOST EQU   CVTS01+364                                               00476000
CVTIOBP  EQU   CVTS01+360                                               00477000
CVTASMVT EQU   CVTS01+356                                               00478000
CVTRECRQ EQU   CVTS01+352                                               00479000
CVTWSAC  EQU   CVTS01+348                                               00480000
CVTWSAG  EQU   CVTS01+344                                               00481000
CVTWSAL  EQU   CVTS01+340                                               00482000
CVTSPSA  EQU   CVTS01+336                                               00483000
CVTGLMN  EQU   CVTS01+332                                               00484000
CVTVEAC0 EQU   CVTS01+328                                               00485000
CVT062R1 EQU   CVTS01+324                                               00486000
CVTRPOST EQU   CVTS01+320                                               00487000
CVTDQIQE EQU   CVTS01+316                                               00488000
CVTCSD   EQU   CVTS01+312                                               00489000
CVTLKRMA EQU   CVTS01+308                                               00490000
CVTRSPIE EQU   CVTS01+304                                               00491000
CVTRENQ  EQU   CVTS01+300                                               00492000
CVTLQCB  EQU   CVTS01+296                                               00493000
CVTFQCB  EQU   CVTS01+292                                               00494000
CVTQCS01 EQU   CVTS01+288                                               00495000
CVTAPFT  EQU   CVTS01+284                                               00496000
CVTPARRL EQU   CVTS01+280                                               00497000
CVTVWAIT EQU   CVTS01+276                                               00498000
CVTGSPL  EQU   CVTS01+272                                               00499000
CVTLSMQ  EQU   CVTS01+268                                               00500000
CVTGSMQ  EQU   CVTS01+264                                               00501000
CVTEXPRO EQU   CVTS01+260                                               00502000
CVTOPCTP EQU   CVTS01+256                                               00503000
CVTSIC   EQU   CVTS01+252                                               00504000
CVTTPIOS EQU   CVTS01+248                                               00505000
CVTRTMS  EQU   CVTS01+244                                               00506000
CVTSDBF  EQU   CVTS01+240                                               00507000
CVTSCBP  EQU   CVTS01+236                                               00508000
CVTSDMP  EQU   CVTS01+232                                               00509000
CVTSV60  EQU   CVTS01+228                                               00510000
CVTRTMCT EQU   CVTS01+224                                               00511000
CVTASCBL EQU   CVTS01+220                                               00512000
CVTASCBH EQU   CVTS01+216                                               00513000
CVTGDA   EQU   CVTS01+212                                               00514000
CVTVVMDI EQU   CVTS01+204                                               00515000
CVTAQTOP EQU   CVTS01+200                                               00516000
CVTIOSCS EQU   CVTS01+196                                               00517000
CVTSDRM  EQU   CVTS01+192                                               00518000
CVTOPTE  EQU   CVTS01+188                                               00519000
CVTSTXU  EQU   CVTS01+184                                               00520000
CVTQUIS  EQU   CVTS01+180                                               00521000
CVTRV514 EQU   CVTS01+176                                               00522000
CVTS1EE  EQU   CVTS01+172                                               00523000
CVTFRAS  EQU   CVTS01+168                                               00524000
CVTQSAS  EQU   CVTS01+164                                               00525000
CVTCRAS  EQU   CVTS01+160                                               00526000
CVTCRMN  EQU   CVTS01+156                                               00527000
CVTDELCP EQU   CVTS01+152                                               00528000
CVTFRECL EQU   CVTS01+148                                               00529000
CVTGETCL EQU   CVTS01+144                                               00530000
CVTBLDCP EQU   CVTS01+140                                               00531000
CVTAUTHL EQU   CVTS01+136                                               00532000
CVTRV146 EQU   CVTS01+134                                               00533000
CVTRV145 EQU   CVTS01+132                                               00534000
CVTRV144 EQU   CVTS01+130                                               00535000
CVTMAXMP EQU   CVTS01+128                                               00536000
CVTRV142 EQU   CVTS01+126                                               00537000
CVTRV141 EQU   CVTS01+125                                               00538000
CVTRV140 EQU   CVTS01+124                                               00539000
CVTRV139 EQU   CVTS01+123                                               00540000
CVTDSSAC EQU   CVTS01+122                                               00541000
CVTRV513 EQU   CVTS01+121                                               00542000
CVTIOSPL EQU   CVTS01+120                                               00543000
CVTRV135 EQU   CVTRV127                                                 00544000
CVTRV134 EQU   CVTRV127                                                 00545000
CVTRV133 EQU   CVTRV127                                                 00546000
CVTRV132 EQU   CVTRV127                                                 00547000
CVTRV131 EQU   CVTRV127                                                 00548000
CVTRV130 EQU   CVTRV127                                                 00549000
CVTRV129 EQU   CVTRV127                                                 00550000
CVTRV128 EQU   CVTRV127                                                 00551000
CVTRV126 EQU   CVTRV118                                                 00552000
CVTRV125 EQU   CVTRV118                                                 00553000
CVTRV124 EQU   CVTRV118                                                 00554000
CVTRV123 EQU   CVTRV118                                                 00555000
CVTRV122 EQU   CVTRV118                                                 00556000
CVTRV121 EQU   CVTRV118                                                 00557000
CVTRV120 EQU   CVTRV118                                                 00558000
CVTRV119 EQU   CVTRV118                                                 00559000
CVTRV117 EQU   CVTRV109                                                 00560000
CVTRV116 EQU   CVTRV109                                                 00561000
CVTRV115 EQU   CVTRV109                                                 00562000
CVTRV114 EQU   CVTRV109                                                 00563000
CVTRV113 EQU   CVTRV109                                                 00564000
CVTRV112 EQU   CVTRV109                                                 00565000
CVTRV111 EQU   CVTRV109                                                 00566000
CVTRV110 EQU   CVTRV109                                                 00567000
CVTRV108 EQU   CVTRV100                                                 00568000
CVTRV107 EQU   CVTRV100                                                 00569000
CVTRV106 EQU   CVTRV100                                                 00570000
CVTRV105 EQU   CVTRV100                                                 00571000
CVTRV104 EQU   CVTRV100                                                 00572000
CVTRV103 EQU   CVTRV100                                                 00573000
CVTRV102 EQU   CVTRV100                                                 00574000
CVTRV101 EQU   CVTRV100                                                 00575000
CVTCSPIE EQU   CVTS01+112                                               00576000
CVTSMFEX EQU   CVTS01+108                                               00577000
CVTOLT0A EQU   CVTS01+104                                               00578000
CVTSRBRT EQU   CVTS01+100                                               00579000
CVTRSV82 EQU   CVTS01+98                                                00580000
CVTRSV81 EQU   CVTS01+96                                                00581000
CVTSYSWT EQU   CVTS01+92                                                00582000
CVTRV327 EQU   CVTS01+88                                                00583000
CVTRV326 EQU   CVTS01+84                                                00584000
CVTRV325 EQU   CVTS01+80                                                00585000
CVTRV324 EQU   CVTS01+76                                                00586000
CVT0VL01 EQU   CVTS01+72                                                00587000
CVTSHRVM EQU   CVTS01+68                                                00588000
CVTRV332 EQU   CVTS01+64                                                00589000
CVTTAS   EQU   CVTS01+60                                                00590000
CVTRSCN  EQU   CVTS01+56                                                00591000
CVTTRAC2 EQU   CVTS01+54                                                00592000
CVTTRACE EQU   CVTS01+52                                                00593000
CVTAPG   EQU   CVTS01+51                                                00594000
CVTSDTRC EQU   CVTCTLFG                                                 00595000
CVTGTRCE EQU   CVTCTLFG                                                 00596000
CVTNOMP  EQU   CVTCTLFG                                                 00597000
CVTRSV79 EQU   CVTCTLFG                                                 00598000
CVTDSTAT EQU   CVTCTLFG                                                 00599000
CVTRSV78 EQU   CVTCTLFG                                                 00600000
CVTRV333 EQU   CVTCTLFG                                                 00601000
CVTRV323 EQU   CVTCTLFG                                                 00602000
CVTSPVLK EQU   CVTS01+49                                                00603000
CVTRSV77 EQU   CVTS01+48                                                00604000
CVTRV331 EQU   CVTS01+44                                                00605000
CVTRV330 EQU   CVTS01+40                                                00606000
CVTRV329 EQU   CVTS01+36                                                00607000
CVTRV328 EQU   CVTS01+32                                                00608000
CVTRV322 EQU   CVTS01+28                                                00609000
CVTSLID  EQU   CVTSLIDA+1                                               00610000
CVTSYLK  EQU   CVTSLIDA                                                 00611000
CVTRV321 EQU   CVTS01+20                                                00612000
CVTRV320 EQU   CVTS01+16                                                00613000
CVTLPDIR EQU   CVTLPDIA+1                                               00614000
CVTRSV69 EQU   CVTDIRST                                                 00615000
CVTRSV68 EQU   CVTDIRST                                                 00616000
CVTRSV67 EQU   CVTDIRST                                                 00617000
CVTRSV66 EQU   CVTDIRST                                                 00618000
CVTRSV65 EQU   CVTDIRST                                                 00619000
CVTRSV64 EQU   CVTDIRST                                                 00620000
CVTRSV63 EQU   CVTDIRST                                                 00621000
CVTDICOM EQU   CVTDIRST                                                 00622000
CVTPVTP  EQU   CVTS01+8                                                 00623000
CVTLPDSR EQU   CVTS01+4                                                 00624000
CVTRSVA2 EQU   CVTS01                                                   00625000
MTDSNMP  EQU   MTDEVENT+4                                               00626000
MTUCBPTR EQU   MTDEVENT+1                                               00627000
MTVRSVRD EQU   MTSTATUS                                                 00628000
MTVRYVFY EQU   MTSTATUS                                                 00629000
MTVRYLBL EQU   MTSTATUS                                                 00630000
MTVRYPND EQU   MTSTATUS                                                 00631000
MTNXTPTR EQU   MTENBASE+8                                               00632000
MTPRVPTR EQU   MTENBASE+4                                               00633000
@NM00007 EQU   MTENBASE+2                                               00634000
MTLENGTH EQU   MTENBASE                                                 00635000
MVTPECB  EQU   MVCAX+20                                                 00636000
MVDAECB  EQU   MVCAX+16                                                 00637000
MVNODEVE EQU   MVCAX+14                                                 00638000
MVWTORRA EQU   MVCAX+12                                                 00639000
MVENTRYP EQU   MVCAX+8                                                  00640000
MVNUMWTS EQU   MVCAX+6                                                  00641000
MVWTORSW EQU   MVSWITCH                                                 00642000
MVDISDSN EQU   MVSWITCH                                                 00643000
MVCAPRVP EQU   MVCA+4                                                   00644000
@NM00006 EQU   MVCA                                                     00645000
@NM00005 EQU   ATCA+8                                                   00646000
@NM00004 EQU   ATCA+4                                                   00647000
CVTLEVL  EQU   CVTRELNO+2                                               00648000
CVTNUMB  EQU   CVTRELNO                                                 00649000
CVTMDL   EQU   CVTFIX+250                                               00650000
@NM00003 EQU   CVTFIX+248                                               00651000
@NM00002 EQU   CVTFIX                                                   00652000
CVTRV482 EQU   CVTXTNT2+128                                             00653000
CVTRV481 EQU   CVTXTNT2+124                                             00654000
CVTRV480 EQU   CVTXTNT2+120                                             00655000
CVTRV479 EQU   CVTXTNT2+118                                             00656000
CVTRV478 EQU   CVTXTNT2+117                                             00657000
CVTRV477 EQU   CVTXTNT2+116                                             00658000
CVTRV476 EQU   CVTXTNT2+115                                             00659000
CVTRV475 EQU   CVTXTNT2+114                                             00660000
CVTRV474 EQU   CVTRV466                                                 00661000
CVTRV473 EQU   CVTRV466                                                 00662000
CVTRV472 EQU   CVTRV466                                                 00663000
CVTRV471 EQU   CVTRV466                                                 00664000
CVTRV470 EQU   CVTRV466                                                 00665000
CVTRV469 EQU   CVTRV466                                                 00666000
CVTRV468 EQU   CVTRV466                                                 00667000
CVTRV467 EQU   CVTRV466                                                 00668000
CVTRV465 EQU   CVTRV457                                                 00669000
CVTRV464 EQU   CVTRV457                                                 00670000
CVTRV463 EQU   CVTRV457                                                 00671000
CVTRV462 EQU   CVTRV457                                                 00672000
CVTRV461 EQU   CVTRV457                                                 00673000
CVTRV460 EQU   CVTRV457                                                 00674000
CVTRV459 EQU   CVTRV457                                                 00675000
CVTRV458 EQU   CVTRV457                                                 00676000
CVTRV456 EQU   CVTXTNT2+108                                             00677000
CVTRV455 EQU   CVTXTNT2+104                                             00678000
CVTRV454 EQU   CVTXTNT2+100                                             00679000
CVTRV453 EQU   CVTXTNT2+96                                              00680000
CVTRV452 EQU   CVTXTNT2+94                                              00681000
CVTRV451 EQU   CVTXTNT2+92                                              00682000
CVTRV450 EQU   CVTXTNT2+90                                              00683000
CVTRV449 EQU   CVTXTNT2+88                                              00684000
CVTRV448 EQU   CVTXTNT2+87                                              00685000
CVTRV447 EQU   CVTXTNT2+86                                              00686000
CVTRV446 EQU   CVTRV438                                                 00687000
CVTRV445 EQU   CVTRV438                                                 00688000
CVTRV444 EQU   CVTRV438                                                 00689000
CVTRV443 EQU   CVTRV438                                                 00690000
CVTRV442 EQU   CVTRV438                                                 00691000
CVTRV441 EQU   CVTRV438                                                 00692000
CVTRV440 EQU   CVTRV438                                                 00693000
CVTRV439 EQU   CVTRV438                                                 00694000
CVTRV437 EQU   CVTRV429                                                 00695000
CVTRV436 EQU   CVTRV429                                                 00696000
CVTRV435 EQU   CVTRV429                                                 00697000
CVTRV434 EQU   CVTRV429                                                 00698000
CVTRV433 EQU   CVTRV429                                                 00699000
CVTRV432 EQU   CVTRV429                                                 00700000
CVTRV431 EQU   CVTRV429                                                 00701000
CVTRV430 EQU   CVTRV429                                                 00702000
CVTRV428 EQU   CVTXTNT2+80                                              00703000
CVTRV427 EQU   CVTXTNT2+76                                              00704000
CVTRV426 EQU   CVTXTNT2+72                                              00705000
CVTRV425 EQU   CVTXTNT2+68                                              00706000
CVTATACT EQU   CVTATCVT                                                 00707000
CVTRV423 EQU   CVTXTNT2+62                                              00708000
CVTRV422 EQU   CVTXTNT2+60                                              00709000
CVTRV421 EQU   CVTXTNT2+58                                              00710000
CVTRV420 EQU   CVTXTNT2+56                                              00711000
CVTRV419 EQU   CVTXTNT2+55                                              00712000
CVTRV418 EQU   CVTXTNT2+54                                              00713000
CVTRV417 EQU   CVTRV409                                                 00714000
CVTRV416 EQU   CVTRV409                                                 00715000
CVTRV415 EQU   CVTRV409                                                 00716000
CVTRV414 EQU   CVTRV409                                                 00717000
CVTRV413 EQU   CVTRV409                                                 00718000
CVTRV412 EQU   CVTRV409                                                 00719000
CVTRV411 EQU   CVTRV409                                                 00720000
CVTRV410 EQU   CVTRV409                                                 00721000
CVTRV408 EQU   CVTRV400                                                 00722000
CVTRV407 EQU   CVTRV400                                                 00723000
CVTRV406 EQU   CVTRV400                                                 00724000
CVTRV405 EQU   CVTRV400                                                 00725000
CVTRV404 EQU   CVTRV400                                                 00726000
CVTRV403 EQU   CVTRV400                                                 00727000
CVTRV402 EQU   CVTRV400                                                 00728000
CVTRV401 EQU   CVTRV400                                                 00729000
CVTRSVA1 EQU   CVTXTNT2+48                                              00730000
CVTRSVA0 EQU   CVTXTNT2+44                                              00731000
CVTRSV99 EQU   CVTXTNT2+40                                              00732000
CVTRSV98 EQU   CVTXTNT2+36                                              00733000
CVTRSV97 EQU   CVTXTNT2+34                                              00734000
CVTRSV96 EQU   CVTXTNT2+32                                              00735000
CVTOLTEP EQU   CVTXTNT2+28                                              00736000
CVTQIDA  EQU   CVTQID+1                                                 00737000
CVTRSV95 EQU   CVTQID                                                   00738000
CVTRSV94 EQU   CVTXTNT2+20                                              00739000
CVTRSV93 EQU   CVTXTNT2+16                                              00740000
CVTRSV92 EQU   CVTXTNT2+12                                              00741000
CVTDEBVR EQU   CVTXTNT2+8                                               00742000
CVTRSV91 EQU   CVTXTNT2+6                                               00743000
CVTRSV9H EQU   CVTRSV90                                                 00744000
CVTRSV9G EQU   CVTRSV90                                                 00745000
CVTRSV9F EQU   CVTRSV90                                                 00746000
CVTRSV9E EQU   CVTRSV90                                                 00747000
CVTRSV9D EQU   CVTRSV90                                                 00748000
CVTRSV9C EQU   CVTRSV90                                                 00749000
CVTRSV9B EQU   CVTRSV90                                                 00750000
CVTRSV9A EQU   CVTRSV90                                                 00751000
CVTNUCLS EQU   CVTXTNT2+4                                               00752000
CVTDSSVA EQU   CVTDSSV+1                                                00753000
CVTRSV89 EQU   CVTDSSV                                                  00754000
CVTRSV88 EQU   CVTXTNT1+8                                               00755000
CVTRSV87 EQU   CVTXTNT1+4                                               00756000
CVTFACHN EQU   CVTXTNT1                                                 00757000
CVTRV488 EQU   CVTMAP+412                                               00758000
CVTRV487 EQU   CVTMAP+408                                               00759000
CVTRV486 EQU   CVTMAP+404                                               00760000
CVTRV485 EQU   CVTMAP+400                                               00761000
CVTRV484 EQU   CVTMAP+396                                               00762000
CVTAUTH  EQU   CVTMAP+392                                               00763000
CVTATMCA EQU   CVTATMCT+1                                               00764000
CVTATMST EQU   CVTATMCT                                                 00765000
CVTRSV61 EQU   CVTMAP+384                                               00766000
CVTVOLT1 EQU   CVTVOLM1+1                                               00767000
CVTVOLI1 EQU   CVTVOLF1                                                 00768000
CVTSTOA  EQU   CVTMAP+376                                               00769000
CVTRSV58 EQU   CVTMAP+374                                               00770000
CVTRSV57 EQU   CVTMAP+372                                               00771000
CVTDDCE  EQU   CVTMAP+368                                               00772000
CVTPNWFR EQU   CVTMAP+364                                               00773000
CVTSMF   EQU   CVTMAP+360                                               00774000
CVTSULK  EQU   CVTMAP+358                                               00775000
CVTSLKO  EQU   CVTSYSK                                                  00776000
CVTSLKP  EQU   CVTSYSK                                                  00777000
CVTSLKQ  EQU   CVTSYSK                                                  00778000
CVTSLKR  EQU   CVTSYSK                                                  00779000
CVTRSV56 EQU   CVTSYSK                                                  00780000
CVTRSV55 EQU   CVTSYSK                                                  00781000
CVTRSV54 EQU   CVTSYSK                                                  00782000
CVTRSV53 EQU   CVTSYSK                                                  00783000
CVTRSV52 EQU   CVTA1F1                                                  00784000
CVTRSV51 EQU   CVTA1F1                                                  00785000
CVTRSV50 EQU   CVTA1F1                                                  00786000
CVTRSV49 EQU   CVTA1F1                                                  00787000
CVTRSV48 EQU   CVTA1F1                                                  00788000
CVTRSV47 EQU   CVTA1F1                                                  00789000
CVTSRSW  EQU   CVTA1F1                                                  00790000
CVTPFSW  EQU   CVTA1F1                                                  00791000
CVTPCVT  EQU   CVTMAP+352                                               00792000
CVTRSV46 EQU   CVTMAP+344                                               00793000
CVTRSV45 EQU   CVTMAP+340                                               00794000
CVTRSV44 EQU   CVTMAP+338                                               00795000
CVTRSV43 EQU   CVTMAP+336                                               00796000
CVTHJESA EQU   CVTHJES+1                                                00797000
CVTRSV42 EQU   CVTHJES                                                  00798000
CVTEXT2A EQU   CVTEXT2+1                                                00799000
CVTRSV41 EQU   CVTEXT2                                                  00800000
CVTAPFA  EQU   CVTAPF+1                                                 00801000
CVTRSV40 EQU   CVTAPF                                                   00802000
CVTINTLA EQU   CVTMAP+320                                               00803000
CVTERPV  EQU   CVTMAP+316                                               00804000
CVTEORM  EQU   CVTMAP+312                                               00805000
CVTMCHPR EQU   CVTMAP+308                                               00806000
CVTTZ    EQU   CVTMAP+304                                               00807000
CVTJEPS  EQU   CVTMAP+300                                               00808000
CVTJESCT EQU   CVTMAP+296                                               00809000
CVTMODE  EQU   CVTMAP+292                                               00810000
CVTPTRV  EQU   CVTMAP+288                                               00811000
CVTREAL  EQU   CVTMAP+284                                               00812000
CVTRSV39 EQU   CVTMAP+280                                               00813000
CVTRSV38 EQU   CVTMAP+276                                               00814000
CVTDMSRA EQU   CVTDMSR+1                                                00815000
CVTRSV37 EQU   CVTDMSR                                                  00816000
CVTQMSGA EQU   CVTQMSG+1                                                00817000
CVTRSV36 EQU   CVTQMSG                                                  00818000
CVTAMFF  EQU   CVTMAP+264                                               00819000
CVTPURGA EQU   CVTPURG+1                                                00820000
CVTRSV35 EQU   CVTPURG                                                  00821000
CVTCBSP  EQU   CVTMAP+256                                               00822000
CVTATERA EQU   CVTATER+1                                                00823000
CVTSYST  EQU   CVTATER                                                  00824000
CVTVOLT2 EQU   CVTTAT                                                   00825000
CVTVOLI2 EQU   CVTVOLF2                                                 00826000
CVTAQAVB EQU   CVTAQAVT+1                                               00827000
CVTRSV34 EQU   CVTTCMFG                                                 00828000
CVTRSV33 EQU   CVTTCMFG                                                 00829000
CVTRSV32 EQU   CVTTCMFG                                                 00830000
CVTRSV31 EQU   CVTTCMFG                                                 00831000
CVTRSV30 EQU   CVTTCMFG                                                 00832000
CVTRSV29 EQU   CVTTCMFG                                                 00833000
CVTRSV28 EQU   CVTTCMFG                                                 00834000
CVTTCRDY EQU   CVTTCMFG                                                 00835000
CVTGTFA  EQU   CVTGTF+1                                                 00836000
CVTRSV27 EQU   CVTGTFST                                                 00837000
CVTRNIO  EQU   CVTGTFST                                                 00838000
CVTRV319 EQU   CVTUSR                                                   00839000
CVTRV318 EQU   CVTFORM                                                  00840000
CVTRV317 EQU   CVTTMODE                                                 00841000
CVTRV316 EQU   CVTSTATE                                                 00842000
CVTRV315 EQU   CVTGTFS                                                  00843000
CVTGTFAV EQU   CVTGTFS                                                  00844000
CVT0SCR1 EQU   CVTMAP+232                                               00845000
CVTTSCVB EQU   CVTTSCVT+1                                               00846000
CVTRSV25 EQU   CVTTSFLG                                                 00847000
CVTRSV24 EQU   CVTTSFLG                                                 00848000
CVTRSV23 EQU   CVTTSFLG                                                 00849000
CVTRSV22 EQU   CVTTSFLG                                                 00850000
CVTRSV21 EQU   CVTTSFLG                                                 00851000
CVTRSV20 EQU   CVTTSFLG                                                 00852000
CVTRSV19 EQU   CVTTSFLG                                                 00853000
CVTTSRDY EQU   CVTTSFLG                                                 00854000
CVTRMS   EQU   CVTMAP+224                                               00855000
CVTPATCH EQU   CVTMAP+220                                               00856000
CVTTSCE  EQU   CVTMAP+216                                               00857000
CVTLNKSC EQU   CVTMAP+214                                               00858000
CVTQABST EQU   CVTMAP+212                                               00859000
CVTMDLDS EQU   CVTMAP+208                                               00860000
CVTUSER  EQU   CVTMAP+204                                               00861000
CVTABEND EQU   CVTMAP+200                                               00862000
CVTSMCA  EQU   CVTMAP+196                                               00863000
CVTRSV18 EQU   CVTMAP+192                                               00864000
CVTQLPAQ EQU   CVTMAP+188                                               00865000
CVTQCDSR EQU   CVTMAP+184                                               00866000
CVTRSV17 EQU   CVTOPTB                                                  00867000
CVTRSV16 EQU   CVTOPTB                                                  00868000
CVTFP    EQU   CVTOPTB                                                  00869000
CVTAPTHR EQU   CVTOPTB                                                  00870000
CVTNLOG  EQU   CVTOPTB                                                  00871000
CVTTOD   EQU   CVTOPTB                                                  00872000
CVTCTIMS EQU   CVTOPTB                                                  00873000
CVTPROT  EQU   CVTOPTB                                                  00874000
CVTXPFP  EQU   CVTOPTA                                                  00875000
CVTASCII EQU   CVTOPTA                                                  00876000
CVTRSV13 EQU   CVTOPTA                                                  00877000
CVTRSV12 EQU   CVTOPTA                                                  00878000
CVTNIP   EQU   CVTOPTA                                                  00879000
CVTDDR   EQU   CVTOPTA                                                  00880000
CVTAPR   EQU   CVTOPTA                                                  00881000
CVTCCH   EQU   CVTOPTA                                                  00882000
CVTSNCTR EQU   CVTMAP+180                                               00883000
CVTQOCR  EQU   CVTMAP+172                                               00884000
CVT1EF00 EQU   CVTMAP+168                                               00885000
CVTMZ00  EQU   CVTMAP+164                                               00886000
CVTHEAD  EQU   CVTMAP+160                                               00887000
CVTRSV11 EQU   CVTMAP+156                                               00888000
CVT0PT01 EQU   CVTMAP+152                                               00889000
CVTMSER  EQU   CVTMAP+148                                               00890000
CVTIERLC EQU   CVTMAP+144                                               00891000
CVTILCH  EQU   CVTMAP+140                                               00892000
CVT0DS   EQU   CVTMAP+136                                               00893000
CVTFBOSV EQU   CVTMAP+132                                               00894000
CVTNUCB  EQU   CVTMAP+128                                               00895000
CVTIXAVL EQU   CVTMAP+124                                               00896000
CVTIOQET EQU   CVTMAP+120                                               00897000
CVTDCBA  EQU   CVTMAP+117                                               00898000
CVTMVS2  EQU   CVTDCB                                                   00899000
CVT6DAT  EQU   CVTDCB                                                   00900000
CVT4MPS  EQU   CVTDCB                                                   00901000
CVTRSV09 EQU   CVTDCB                                                   00902000
CVT4MS1  EQU   CVTDCB                                                   00903000
CVT2SPS  EQU   CVTDCB                                                   00904000
CVT1SSS  EQU   CVTDCB                                                   00905000
CVTRSV08 EQU   CVTDCB                                                   00906000
CVTSTB   EQU   CVTMAP+112                                               00907000
CVTQTD00 EQU   CVTMAP+108                                               00908000
CVTQTE00 EQU   CVTMAP+104                                               00909000
CVTCUCB  EQU   CVTMAP+100                                               00910000
CVTSJQ   EQU   CVTMAP+96                                                00911000
CVTPBLDL EQU   CVTMAP+92                                                00912000
CVTTPC   EQU   CVTMAP+88                                                00913000
CVTSVDCB EQU   CVTMAP+84                                                00914000
CVTBRET  EQU   CVTMAP+82                                                00915000
CVTEXIT  EQU   CVTMAP+80                                                00916000
CVT0FN00 EQU   CVTMAP+76                                                00917000
CVTDARA  EQU   CVTDAR+1                                                 00918000
CVTRSV07 EQU   CVTFLGS1                                                 00919000
CVTRSV06 EQU   CVTFLGS1                                                 00920000
CVTRSV05 EQU   CVTFLGS1                                                 00921000
CVTRSV04 EQU   CVTFLGS1                                                 00922000
CVTRSV03 EQU   CVTFLGS1                                                 00923000
CVTRSV02 EQU   CVTFLGS1                                                 00924000
CVTRSV01 EQU   CVTFLGS1                                                 00925000
CVTDMPLK EQU   CVTFLGS1                                                 00926000
CVTXITP  EQU   CVTMAP+68                                                00927000
CVTZDTAB EQU   CVTMAP+64                                                00928000
CVTMSLT  EQU   CVTMAP+60                                                00929000
CVTDATE  EQU   CVTMAP+56                                                00930000
CVTBTERM EQU   CVTMAP+52                                                00931000
CVTSYSAD EQU   CVTMAP+48                                                00932000
CVTXTLER EQU   CVTMAP+44                                                00933000
CVTILK2  EQU   CVTMAP+40                                                00934000
CVTILK1  EQU   CVTMAP+36                                                00935000
CVTPRLTV EQU   CVTMAP+32                                                00936000
CVTPCNVT EQU   CVTMAP+28                                                00937000
CVT0VL00 EQU   CVTMAP+24                                                00938000
CVTXAPG  EQU   CVTMAP+20                                                00939000
CVTBUF   EQU   CVTMAP+16                                                00940000
CVTJOB   EQU   CVTMAP+12                                                00941000
CVTLINK  EQU   CVTMAP+8                                                 00942000
CVT0EF00 EQU   CVTMAP+4                                                 00943000
CVTTCBP  EQU   CVTMAP                                                   00944000
CVT      EQU   CVTMAP                                                   00945000
ASVTEND  EQU   ASVT+528                                                 00946000
ASVTAVAL EQU   ASVTENTY                                                 00947000
ASVTAVAI EQU   ASVTFRST                                                 00948000
ASVTRS00 EQU   ASVT+520                                                 00949000
ASVTMAXU EQU   ASVT+516                                                 00950000
ASVTASVT EQU   ASVT+512                                                 00951000
ASVTBEGN EQU   ASVT+512                                                 00952000
@NM00001 EQU   ASVT                                                     00953000
@NM00031 EQU   PSA+3412                                                 00954000
PSASTAK  EQU   PSA+3072                                                 00955000
@NM00030 EQU   PSA+1024                                                 00956000
PSAUSEND EQU   PSA+1024                                                 00957000
PSARV060 EQU   PSA+1020                                                 00958000
PSARV059 EQU   PSA+1018                                                 00959000
PSASVC13 EQU   PSA+1016                                                 00960000
PSALSFCC EQU   PSA+1012                                                 00961000
PSASFACC EQU   PSA+1008                                                 00962000
PSASTOP  EQU   PSA+992                                                  00963000
PSASTART EQU   PSA+976                                                  00964000
PSARSPSW EQU   PSA+968                                                  00965000
PSASRPSW EQU   PSA+960                                                  00966000
PSARV045 EQU   PSA+892                                                  00967000
PSARV044 EQU   PSA+888                                                  00968000
PSARV043 EQU   PSA+884                                                  00969000
PSARV042 EQU   PSA+880                                                  00970000
PSARV041 EQU   PSA+876                                                  00971000
PSARV040 EQU   PSA+872                                                  00972000
PSARV025 EQU   PSA+868                                                  00973000
PSADSSED EQU   PSA+868                                                  00974000
PSADSSPR EQU   PSA+864                                                  00975000
PSADSSFW EQU   PSA+860                                                  00976000
PSADSS14 EQU   PSA+856                                                  00977000
PSADSSPP EQU   PSA+848                                                  00978000
PSADSSRP EQU   PSA+840                                                  00979000
PSADSS05 EQU   PSADSSF4                                                 00980000
PSADSS10 EQU   PSADSSF4                                                 00981000
PSADSSVE EQU   PSADSSF4                                                 00982000
PSADSSDE EQU   PSADSSF4                                                 00983000
PSADSSC0 EQU   PSADSSF4                                                 00984000
PSADSSIE EQU   PSADSSF4                                                 00985000
PSADSS12 EQU   PSADSSF4                                                 00986000
PSADSSRC EQU   PSADSSF4                                                 00987000
PSARV057 EQU   PSADSSF3                                                 00988000
PSARV056 EQU   PSADSSF3                                                 00989000
PSARV055 EQU   PSADSSF3                                                 00990000
PSARV054 EQU   PSADSSF3                                                 00991000
PSADSSRW EQU   PSADSSF3                                                 00992000
PSADSSNM EQU   PSADSSF3                                                 00993000
PSADSSES EQU   PSADSSF3                                                 00994000
PSADSSGP EQU   PSADSSF3                                                 00995000
PSADSSF2 EQU   PSADSSFL+1                                               00996000
PSADSSPI EQU   PSADSSF1                                                 00997000
PSADSSOI EQU   PSADSSF1                                                 00998000
PSADSSSP EQU   PSADSSF1                                                 00999000
PSADSSTP EQU   PSADSSF1                                                 01000000
PSADSSDW EQU   PSADSSF1                                                 01001000
PSADSSDD EQU   PSADSSF1                                                 01002000
PSADSSDM EQU   PSADSSF1                                                 01003000
PSADSSMV EQU   PSADSSF1                                                 01004000
PSADSSTS EQU   PSA+816                                                  01005000
PSADSSWK EQU   PSA+812                                                  01006000
PSADSSR3 EQU   PSA+808                                                  01007000
PSADSSR2 EQU   PSA+804                                                  01008000
PSADSSRS EQU   PSA+800                                                  01009000
PSASTOR  EQU   PSA+796                                                  01010000
PSARV058 EQU   PSA+794                                                  01011000
PSAVSTAP EQU   PSA+792                                                  01012000
PSAWKVAP EQU   PSA+788                                                  01013000
PSAWKRAP EQU   PSA+784                                                  01014000
PSAMCHIC EQU   PSA+783                                                  01015000
PSAMODE  EQU   PSA+782                                                  01016000
PSASYMSK EQU   PSA+781                                                  01017000
PSAMCHFL EQU   PSA+780                                                  01018000
PSACR0   EQU   PSA+776                                                  01019000
PSAPSWSV EQU   PSA+768                                                  01020000
PSACLHS  EQU   PSAHLHI                                                  01021000
PSALKR15 EQU   PSALKSA+60                                               01022000
PSALKR14 EQU   PSALKSA+56                                               01023000
PSALKR13 EQU   PSALKSA+52                                               01024000
PSALKR12 EQU   PSALKSA+48                                               01025000
PSALKR11 EQU   PSALKSA+44                                               01026000
PSALKR10 EQU   PSALKSA+40                                               01027000
PSALKR9  EQU   PSALKSA+36                                               01028000
PSALKR8  EQU   PSALKSA+32                                               01029000
PSALKR7  EQU   PSALKSA+28                                               01030000
PSALKR6  EQU   PSALKSA+24                                               01031000
PSALKR5  EQU   PSALKSA+20                                               01032000
PSALKR4  EQU   PSALKSA+16                                               01033000
PSALKR3  EQU   PSALKSA+12                                               01034000
PSALKR2  EQU   PSALKSA+8                                                01035000
PSALKR1  EQU   PSALKSA+4                                                01036000
PSALKR0  EQU   PSALKSA                                                  01037000
PSARV023 EQU   PSACLHT+52                                               01038000
PSALOCAL EQU   PSACLHT+48                                               01039000
PSACMSL  EQU   PSACLHT+44                                               01040000
PSAOPTL  EQU   PSACLHT+40                                               01041000
PSATPACL EQU   PSACLHT+36                                               01042000
PSATPDNL EQU   PSACLHT+32                                               01043000
PSATPNCL EQU   PSACLHT+28                                               01044000
PSAIOSLL EQU   PSACLHT+24                                               01045000
PSAIOSUL EQU   PSACLHT+20                                               01046000
PSAIOSCL EQU   PSACLHT+16                                               01047000
PSAIOSSL EQU   PSACLHT+12                                               01048000
PSASALCL EQU   PSACLHT+8                                                01049000
PSAASML  EQU   PSACLHT+4                                                01050000
PSADISPL EQU   PSACLHT                                                  01051000
PSASRSA  EQU   PSA+636                                                  01052000
PSARV050 EQU   PSA+634                                                  01053000
PSADSSGO EQU   PSA+633                                                  01054000
PSARECUR EQU   PSA+632                                                  01055000
PSAHLHIS EQU   PSA+628                                                  01056000
PSAIPCSA EQU   PSA+624                                                  01057000
@NM00029 EQU   PSA+621                                                  01058000
PSAIPCDM EQU   PSA+620                                                  01059000
PSAIPCD  EQU   PSA+616                                                  01060000
@NM00028 EQU   PSA+613                                                  01061000
PSAIPCRM EQU   PSA+612                                                  01062000
PSAIPCR  EQU   PSA+608                                                  01063000
PSAMCHEX EQU   PSA+600                                                  01064000
PSAMPSW  EQU   PSA+592                                                  01065000
PSAEXPS2 EQU   PSA+584                                                  01066000
PSAEXPS1 EQU   PSA+576                                                  01067000
PSAPIREG EQU   PSA+572                                                  01068000
PSARSREG EQU   PSA+568                                                  01069000
PSAGPREG EQU   PSA+556                                                  01070000
PSARV022 EQU   PSASUP4                                                  01071000
PSARV021 EQU   PSASUP4                                                  01072000
PSARV020 EQU   PSASUP4                                                  01073000
PSARV019 EQU   PSASUP4                                                  01074000
PSARV018 EQU   PSASUP4                                                  01075000
PSARV017 EQU   PSASUP4                                                  01076000
PSARV016 EQU   PSASUP4                                                  01077000
PSARV015 EQU   PSASUP4                                                  01078000
PSARV014 EQU   PSASUP3                                                  01079000
PSARV013 EQU   PSASUP3                                                  01080000
PSARV012 EQU   PSASUP3                                                  01081000
PSARV011 EQU   PSASUP3                                                  01082000
PSARV010 EQU   PSASUP3                                                  01083000
PSARV009 EQU   PSASUP3                                                  01084000
PSARV008 EQU   PSASUP3                                                  01085000
PSAIOSUP EQU   PSASUP3                                                  01086000
PSALCR   EQU   PSASUP2                                                  01087000
PSARTM   EQU   PSASUP2                                                  01088000
PSAACR   EQU   PSASUP2                                                  01089000
PSAIPCE2 EQU   PSASUP2                                                  01090000
PSAIPCES EQU   PSASUP2                                                  01091000
PSAIPCEC EQU   PSASUP2                                                  01092000
PSAGTF   EQU   PSASUP2                                                  01093000
PSAIPCRI EQU   PSASUP2                                                  01094000
PSAIPCRP EQU   PSASUP1                                                  01095000
PSAIPCDR EQU   PSASUP1                                                  01096000
PSADISP  EQU   PSASUP1                                                  01097000
PSALOCK  EQU   PSASUP1                                                  01098000
PSAPI    EQU   PSASUP1                                                  01099000
PSAEXT   EQU   PSASUP1                                                  01100000
PSASVC   EQU   PSASUP1                                                  01101000
PSAIO    EQU   PSASUP1                                                  01102000
PSAAOLD  EQU   PSA+548                                                  01103000
PSAANEW  EQU   PSA+544                                                  01104000
PSATOLD  EQU   PSA+540                                                  01105000
PSATNEW  EQU   PSA+536                                                  01106000
PSALCCAR EQU   PSA+532                                                  01107000
PSALCCAV EQU   PSA+528                                                  01108000
PSAPCCAR EQU   PSA+524                                                  01109000
PSAPCCAV EQU   PSA+520                                                  01110000
PSACPULA EQU   PSA+518                                                  01111000
PSACPUPA EQU   PSA+516                                                  01112000
PSAPSA   EQU   PSA+512                                                  01113000
FLCHDEND EQU   PSA+512                                                  01114000
FLCCRSAV EQU   FLCMCLA+280                                              01115000
FLCGRSAV EQU   FLCMCLA+216                                              01116000
FLCFPSAV EQU   FLCMCLA+184                                              01117000
FLCFLA   EQU   FLCMCLA+88                                               01118000
FLCRGNCD EQU   FLCMCLA+84                                               01119000
FLCFSAA  EQU   FLCFSA+1                                                 01120000
@NM00027 EQU   FLCFSA                                                   01121000
@NM00026 EQU   FLCMCLA+72                                               01122000
FLCMCIC  EQU   FLCMCLA+64                                               01123000
@NM00025 EQU   FLCMCLA+20                                               01124000
FLCIOAA  EQU   FLCIOA+1                                                 01125000
@NM00024 EQU   FLCIOA                                                   01126000
@NM00023 EQU   FLCMCLA+15                                               01127000
@NM00022 EQU   FLCMCLA+14                                               01128000
@NM00021 EQU   FLCMCLA+12                                               01129000
FLCLCL   EQU   FLCMCLA+8                                                01130000
FLCIOELA EQU   FLCIOEL+1                                                01131000
@NM00020 EQU   FLCIOEL                                                  01132000
FLCCHNID EQU   FLCMCLA                                                  01133000
@NM00019 EQU   PSA+160                                                  01134000
FLCMTRCD EQU   PSA+157                                                  01135000
@NM00018 EQU   PSA+156                                                  01136000
FLCPERA  EQU   FLCPER+1                                                 01137000
@NM00017 EQU   FLCPER                                                   01138000
@NM00016 EQU   PSA+151                                                  01139000
FLCPERCD EQU   PSA+150                                                  01140000
FLCMCNUM EQU   PSA+149                                                  01141000
@NM00015 EQU   PSA+148                                                  01142000
FLCTEAA  EQU   FLCTEA+1                                                 01143000
@NM00014 EQU   FLCTEA                                                   01144000
PSAPIPC  EQU   PSAPICOD                                                 01145000
PSAPIMC  EQU   PSAPICOD                                                 01146000
PSAPIPER EQU   PSAPICOD                                                 01147000
PSARV049 EQU   FLCPICOD                                                 01148000
FLCPILCB EQU   FLCPIILC                                                 01149000
@NM00013 EQU   FLCPIILC                                                 01150000
@NM00012 EQU   PSAEPPSW                                                 01151000
FLCSVCN  EQU   PSAESPSW+2                                               01152000
FLCSILCB EQU   FLCSVILC                                                 01153000
@NM00011 EQU   FLCSVILC                                                 01154000
@NM00010 EQU   PSAESPSW                                                 01155000
FLCEICOD EQU   PSAEEPSW+2                                               01156000
PSASPAD  EQU   PSAEEPSW                                                 01157000
@NM00009 EQU   PSA+128                                                  01158000
FLCINPSW EQU   PSA+120                                                  01159000
FLCMNPSW EQU   PSA+112                                                  01160000
FLCPNPSW EQU   PSA+104                                                  01161000
FLCSNPSW EQU   PSA+96                                                   01162000
FLCENPSW EQU   PSA+88                                                   01163000
FLCTRACE EQU   PSA+84                                                   01164000
FLCTIMER EQU   PSA+80                                                   01165000
FLCCVT2  EQU   PSA+76                                                   01166000
FLCCAW   EQU   PSA+72                                                   01167000
FLCCSW   EQU   PSA+64                                                   01168000
FLCIOPSW EQU   PSA+56                                                   01169000
FLCMOPSW EQU   PSA+48                                                   01170000
FLCPOPSW EQU   PSA+40                                                   01171000
FLCSOPSW EQU   PSA+32                                                   01172000
FLCEOPSW EQU   PSA+24                                                   01173000
@NM00008 EQU   FLCICCW2+4                                               01174000
FLCCVT   EQU   FLCICCW2                                                 01175000
FLCICCW1 EQU   FLCROPSW                                                 01176000
FLCIPPSW EQU   FLCRNPSW                                                 01177000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01178000
@ENDDATA EQU   *                                                        01179000
         END   IEFDPOST                                                 01180000
./  ADD  SSI=42100971,NAME=IEFIB660
         TITLE 'IEFIB660 - BUILD TCTIOT RTN                            *00001000
                        '                                               00002000
IEFIB660 CSECT ,                                                01S0001 00003000
@MAINENT DS    0H                                               01S0001 00004000
         USING *,@15                                            01S0001 00005000
         B     @PROLOG                                          01S0001 00006000
         DC    AL1(16)                                          01S0001 00007000
         DC    C'IEFIB660  74.211'                              01S0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00010000
         BALR  @12,0                                            01S0001 00011000
@PSTART  DS    0H                                               01S0001 00012000
         USING @PSTART,@12                                      01S0001 00013000
         L     @00,@SIZDATD                                     01S0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @11,@01                                          01S0001 00016000
         USING @DATD,@11                                        01S0001 00017000
         ST    @13,@SA00001+4                                   01S0001 00018000
         LM    @00,@01,20(@13)                                  01S0001 00019000
         ST    @11,8(,@13)                                      01S0001 00020000
         LR    @13,@11                                          01S0001 00021000
         MVC   @PC00001(12),0(@01)                              01S0001 00022000
JSCBDISP EQU 188                                                        00023000
JSCBAOS1 EQU  72                                                        00024000
JSCBAOS2 EQU 192                                                        00025000
*                                                               01S0035 00026000
*                                                               01S0035 00027000
* /*                   END OF TCB                                    */ 00028000
*/* EXTERNAL REFERENCES                                              */ 00029000
*IF TCTIOTBL ¬= ZERO THEN              /*IF A TCTIOT ALREADY EXISTS  */ 00030000
         L     @10,@PC00001+8                                   01S0036 00031000
         L     @10,TCBPTR(,@10)                                 01S0036 00032000
         L     @10,TCBTCT(,@10)                                 01S0036 00033000
         L     @15,TCTIOTBL(,@10)                               01S0036 00034000
         LTR   @15,@15                                          01S0036 00035000
         BZ    @RF00036                                         01S0036 00036000
*  DO;                                                          01S0037 00037000
*    RFY (REG0,REG1) RSTD;                                      01S0038 00038000
*    REG0 = TCTPLEXT;                  /*LEN CORE AND SUBPOOL TO FREE*/ 00039000
         L     REG0,TCTPLEXT(,@15)                              01S0039 00040000
*    REG1 = TCTIOTBL;                  /*PTR TO CORE TO FREE         */ 00041000
         LR    REG1,@15                                         01S0040 00042000
*    TCTIOTBL = TCTIOTBL && TCTIOTBL;  /*CLEAR TCTIOT PTR IN TCT     */ 00043000
         LR    @14,@15                                          01S0041 00044000
         XR    @14,@15                                          01S0041 00045000
         ST    @14,TCTIOTBL(,@10)                               01S0041 00046000
*    GEN ( FREEMAIN R,LV=(0),A=(1) );  /*FREE OLD TCTIOT             */ 00047000
          FREEMAIN R,LV=(0),A=(1)                                       00048000
*    RFY (REG1,REG0) UNRSTD;                                    01S0043 00049000
*  END;                                                         01S0044 00050000
*ELSE;                                 /*NO OLD TCTIOT EXISTS        */ 00051000
@RF00036 DS    0H                                               01S0046 00052000
*RFY IEZJSCB BASED(JSCBPTR);                                    01S0046 00053000
*DEVENTNO = DEVENTNO && DEVENTNO;      /*INITIALIZE DEVICE COUNTER   */ 00054000
         L     @10,DEVENTNO                                     01S0047 00055000
         LR    @09,@10                                          01S0047 00056000
         XR    @09,@10                                          01S0047 00057000
         ST    @09,DEVENTNO                                     01S0047 00058000
*DSABPTR = QDBFELMP;                   /*POINT TO FIRST DSAB         */ 00059000
         L     @10,@PC00001                                     01S0048 00060000
         L     @10,JSCBPTR(,@10)                                01S0048 00061000
         L     @10,JSCDSABQ(,@10)                               01S0048 00062000
         L     DSABPTR,QDBFELMP(,@10)                           01S0048 00063000
*DDCOUNT = DDCOUNT && DDCOUNT;         /*INITIALIZE COUNTER          */ 00064000
         LH    @10,DDCOUNT                                      01S0049 00065000
         LR    @09,@10                                          01S0049 00066000
         XR    @09,@10                                          01S0049 00067000
         STH   @09,DDCOUNT                                      01S0049 00068000
*DO                                    /*SCAN DSAB CHAIN             */ 00069000
*   WHILE(DSABPTR ¬= ZERO);            /*UNTIL LAST DSAB             */ 00070000
         B     @DE00050                                         01S0050 00071000
@DL00050 DS    0H                                               01S0051 00072000
*   DEVENTNO = DEVENTNO + TIOEWTCT;    /*COUNT DEVICE ENTRIES        */ 00073000
         L     @10,DSABTIOT(,DSABPTR)                           01S0051 00074000
         SLR   @09,@09                                          01S0051 00075000
         IC    @09,TIOEWTCT(,@10)                               01S0051 00076000
         AL    @09,DEVENTNO                                     01S0051 00077000
         ST    @09,DEVENTNO                                     01S0051 00078000
*   DSABPTR = DSABFCHN;                /*POINT TO NEXT DSAB          */ 00079000
         L     DSABPTR,DSABFCHN(,DSABPTR)                       01S0052 00080000
*   DDCOUNT = DDCOUNT + ONE;           /*NO. OF DD ENTRIES           */ 00081000
         LA    @10,1                                            01S0053 00082000
         AH    @10,DDCOUNT                                      01S0053 00083000
         STH   @10,DDCOUNT                                      01S0053 00084000
*END;                                                           01S0054 00085000
@DE00050 SLR   @10,@10                                          01S0054 00086000
         CR    DSABPTR,@10                                      01S0054 00087000
         BNE   @DL00050                                         01S0054 00088000
*IF DDCOUNT ¬= ZERO THEN               /*AND THERE ARE DD'S IN TIOT  */ 00089000
         LH    @15,DDCOUNT                                      01S0055 00090000
         CR    @15,@10                                          01S0055 00091000
         BE    @RF00055                                         01S0055 00092000
*  DO;                                                          01S0056 00093000
*    GETSIZE =                         /*SIZE OF NEW TCTIOT          */ 00094000
*              LENGTH(TCTTIOT)         /*TCTIOT HEADER               */ 00095000
*            + (LENGTH(TCTLUENT) * DDCOUNT) /*LEN.L/U TABLE ENTRIES  */ 00096000
*            + LENGTH(TCTDCBLE)        /*END L/U TABLE FIELD         */ 00097000
*            + (DEVENTNO * LENGTH(TCTDVENT)) /*LEN.DEVICE ENTRIES    */ 00098000
*            + (DDCOUNT * LENGTH(TCTOUTLM)); /*LEN.OUTLIM FIELDS     */ 00099000
         LR    GETSIZE,@15                                      01S0057 00100000
         SLA   GETSIZE,2                                        01S0057 00101000
         AH    GETSIZE,@CH00871                                 01S0057 00102000
         L     @03,DEVENTNO                                     01S0057 00103000
         SLA   @03,3                                            01S0057 00104000
         ALR   GETSIZE,@03                                      01S0057 00105000
         LR    @14,@15                                          01S0057 00106000
         SLA   @14,3                                            01S0057 00107000
         ALR   GETSIZE,@14                                      01S0057 00108000
*    IF(TIOINUSL - DDCOUNT)            /*IF EXTRA EXPANSION SPACE    */ 00109000
*       > ZERO THEN                    /*REQUIRED                    */ 00110000
         L     @03,@PC00001                                     01S0058 00111000
         L     @03,JSCBPTR(,@03)                                01S0058 00112000
         L     @03,JSCTMCOR(,@03)                               01S0058 00113000
         LCR   @15,@15                                          01S0058 00114000
         AH    @15,TIOINUSL(,@03)                               01S0058 00115000
         CR    @15,@10                                          01S0058 00116000
         BNH   @RF00058                                         01S0058 00117000
*      DO;                                                      01S0059 00118000
*        GETSIZE = GETSIZE + EXRASPAC; /*ALSO GET EXTRA SPACE        */ 00119000
         AH    GETSIZE,@CH00094                                 01S0060 00120000
*      END;                                                     01S0061 00121000
*    ELSE;                             /*NO EXTRA SPACE              */ 00122000
@RF00058 DS    0H                                               01S0063 00123000
*    RFY (REG0,REG1) RSTD;                                      01S0063 00124000
*    REG0 = GETSIZE;                  /*SIZE NEEDED                  */ 00125000
         LR    REG0,GETSIZE                                     01S0064 00126000
*    REG0 = REG0 | SUBPOOLN;          /*SUBPOOL                      */ 00127000
         O     REG0,@CF00102                                    01S0065 00128000
*    TCTPLSAV = REG0;                 /*SAVE SUBPOOL AND SIZE        */ 00129000
         ST    REG0,TCTPLSAV                                    01S0066 00130000
*    GEN (GETMAIN R,LV=(0));          /*GET TCTIOT                   */ 00131000
         GETMAIN R,LV=(0)                                               00132000
*    TCTIOTP = REG1;                  /*PICK UP TCTIOT PTR           */ 00133000
         LR    TCTIOTP,REG1                                     01S0068 00134000
*    RFY (REG0,REG1) UNRSTD;                                    01S0069 00135000
*/********************************************************************/ 00136000
*/*                                                                  */ 00137000
*/* SEGMENT NAME - INITBLCK                                          */ 00138000
*/*                                                                  */ 00139000
*/* DESCRIPTIVE NAME - INITIALIZE TCTIOT                             */ 00140000
*/*                                                                  */ 00141000
*/* FUNCTION - THIS SEGMENT INITIALIZES THE TCTIOT WITH DD AND       */ 00142000
*/*            DEVICE ENTRY INFORMATION OBTAINED FROM ALL THE TIOT   */ 00143000
*/*            ENTRIES POINTED TO BY DSABS ON THE DSAB CHAIN.        */ 00144000
*/*                                                                  */ 00145000
*/*   OPERATION - OPERATION IS DOCUMENTED BY THE CODE                */ 00146000
*/*                                                                  */ 00147000
*/* ENTRY POINT -(INLINE SUBROUTINE - ENTERED AT THE TOP)            */ 00148000
*/*                                                                  */ 00149000
*/*   PURPOSE - SEE FUNCTION                                         */ 00150000
*/*                                                                  */ 00151000
*/*   INPUT -                                                        */ 00152000
*/*             TCTIOTP  -TCTIOT PTR OF NEW TCTIOT JUST GOTTEN.      */ 00153000
*/*             DDCOUNT - NO. OF DD ENTRIES                          */ 00154000
*/*             DEVENTNO - NO. OF DEVICE ENTRIES                     */ 00155000
*/*             TCTPLSAV - SUBPOOL AND SIZE TCTIOT                   */ 00156000
*/*                                                                  */ 00157000
*/* EXIT - NORMAL - (INLINE SUBROUTINE - EXITS AT BOTTOM)            */ 00158000
*/*                                                                  */ 00159000
*/*   CONDITION - TCTIOT INITIALIZED                                 */ 00160000
*/*                                                                  */ 00161000
*/*   OUTPUT - TCTIOT L/U TABLE ENTRIES AND COUNTER TABLE            */ 00162000
*/*              ENTRIES INITIALIZED.                                */ 00163000
*/*            TCTSZLKP FIELD - LENGTH OF DEVICE ENTRIES             */ 00164000
*/*            TCTPLEXT - TCTIOT SUBPOOL AND SIZE                    */ 00165000
*/*            TCTIOTBL - TCT PTR TO TCTIOT                          */ 00166000
*/*                                                                  */ 00167000
*/*   RETURN CODE - NONE                                             */ 00168000
*/*                                                                  */ 00169000
*/********************************************************************/ 00170000
*RFY (REG2,REG3,REG4,REG5) RSTD;                                02S0070 00171000
*REG2 = TCTIOTP;                       /*PTR TCTIOT                  */ 00172000
         LR    REG2,TCTIOTP                                     02S0071 00173000
*REG3 = SAVSIZE;                       /*TCTIOT SIZE                 */ 00174000
         LH    REG3,SAVSIZE                                     02S0072 00175000
*REG4 = REG4 && REG4;                                           02S0073 00176000
         XR    REG4,REG4                                        02S0073 00177000
*REG5 = REG5 && REG5;                                           02S0074 00178000
         XR    REG5,REG5                                        02S0074 00179000
*GEN (MVCL 2,4);                       /*ZERO TCTIOT CORE            */ 00180000
         MVCL 2,4                                                       00181000
*RFY (REG2,REG3,REG4,REG5) UNRSTD;                              02S0076 00182000
*TCTLUENP = TCTIOTP + LENGTH(TCTTIOT); /*PTR TO FIRST L/U ENTRY      */ 00183000
         LA    @15,8                                            02S0077 00184000
         ALR   @15,TCTIOTP                                      02S0077 00185000
         ST    @15,TCTLUENP                                     02S0077 00186000
*TCTDVENP =                            /*PTR TO FIRST TCTIOT DEV.ENT */ 00187000
*           TCTLUENP                   /*FIRST L/U ENTRY LOCATION    */ 00188000
*           + LENGTH(TCTDCBLE)         /*END L/U TABLE FIELD         */ 00189000
*           + (LENGTH(TCTLUENT)        /*PLUS SIZE L/U ENTRY SECTION */ 00190000
*                 * DDCOUNT);                                   02S0078 00191000
         AH    @15,@CH00073                                     02S0078 00192000
         LH    TCTDVENP,DDCOUNT                                 02S0078 00193000
         SLA   TCTDVENP,2                                       02S0078 00194000
         ALR   @15,TCTDVENP                                     02S0078 00195000
         LR    TCTDVENP,@15                                     02S0078 00196000
*DSABPTR = QDBFELMP;                   /*PTR TO FIRST DSAB ON CHAIN  */ 00197000
         L     @15,@PC00001                                     02S0079 00198000
         L     @01,JSCBPTR(,@15)                                02S0079 00199000
         L     @01,JSCDSABQ(,@01)                               02S0079 00200000
         L     DSABPTR,QDBFELMP(,@01)                           02S0079 00201000
*DO I = ONE TO DDCOUNT BY ONE;         /*UPDATE TCTIOT               */ 00202000
         LA    I,1                                              02S0080 00203000
         B     @DE00080                                         02S0080 00204000
@DL00080 DS    0H                                               02S0081 00205000
*  TCTIOTO(I) = DSABTIOT - TIOTPTR;    /*OFFSET TIOT DD ENTRY FROM      00206000
*                                        BEGINNING OF TIOT           */ 00207000
         L     @02,TCTLUENP                                     02S0081 00208000
         LR    @15,I                                            02S0081 00209000
         SLA   @15,2                                            02S0081 00210000
         L     @14,DSABTIOT(,DSABPTR)                           02S0081 00211000
         L     @07,@PC00001+4                                   02S0081 00212000
         LR    @06,@14                                          02S0081 00213000
         SL    @06,TIOTPTR(,@07)                                02S0081 00214000
         LA    @07,0(@15,@02)                                   02S0081 00215000
         AL    @07,@CF00872                                     02S0081 00216000
         STH   @06,TCTIOTO(,@07)                                02S0081 00217000
*  TCTCNTEO(I) = ADDR(TCTDVENT(1))     /*OFFSET TCTIOT DD ENTRY FROM */ 00218000
*               - TCTIOTP;             /*BEGINNING TCTIOT            */ 00219000
         LR    @07,TCTDVENP                                     02S0082 00220000
         SLR   @07,TCTIOTP                                      02S0082 00221000
         AL    @02,@CF00873                                     02S0082 00222000
         STH   @07,TCTCNTEO-2(@15,@02)                          02S0082 00223000
*  TCTDSCTR(1) = TIOEWTCT;             /*NO.DEVICES THIS DD          */ 00224000
         MVC   TCTDSCTR(1,TCTDVENP),TIOEWTCT(@14)               02S0083 00225000
*  DO COUNT = ONE TO TIOEWTCT BY ONE;  /*PROCESS TCTIOT DD ENTRY     */ 00226000
         LA    COUNT,1                                          02S0084 00227000
         B     @DE00084                                         02S0084 00228000
@DL00084 DS    0H                                               02S0085 00229000
*    IF DSABVAM = OFF THEN             /*IF NOT VAM DATA SET         */ 00230000
         TM    DSABVAM(DSABPTR),B'00100000'                     02S0085 00231000
         BNZ   @RF00085                                         02S0085 00232000
*      TCTDUCBP(COUNT) = TIOUCBP(COUNT); /*ASSIGN TIOT UCB TO TCTIOT */ 00233000
         LR    @15,COUNT                                        02S0086 00234000
         SLA   @15,3                                            02S0086 00235000
         LR    @14,COUNT                                        02S0086 00236000
         SLA   @14,2                                            02S0086 00237000
         L     @01,DSABTIOT(,DSABPTR)                           02S0086 00238000
         L     @14,TIOUCBP-5(@14,@01)                           02S0086 00239000
         LA    @14,0(,@14)                                      02S0086 00240000
         AL    @15,@CF00874                                     02S0086 00241000
         STH   @14,TCTDUCBP(@15,TCTDVENP)                       02S0086 00242000
*    ELSE                              /*VAM DATA SET                */ 00243000
*      DO;                                                      02S0087 00244000
         B     @RC00085                                         02S0087 00245000
@RF00085 DS    0H                                               02S0088 00246000
*        TCTDUCBP(COUNT) =               /*VAM UCB INDICATOR         */ 00247000
*        TCTDUCBP(COUNT) && TCTDUCBP(COUNT);                    02S0088 00248000
         LR    @15,COUNT                                        02S0088 00249000
         SLA   @15,3                                            02S0088 00250000
         ST    @15,@TF00001                                     02S0088 00251000
         ALR   @15,TCTDVENP                                     02S0088 00252000
         AL    @15,@CF00874                                     02S0088 00253000
         XC    TCTDUCBP(2,@15),TCTDUCBP(@15)                    02S0088 00254000
*        TCTFLAG3(COUNT) = ON;           /*VAM INDICATOR IN DD ENTRY */ 00255000
         LR    @01,TCTDVENP                                     02S0089 00256000
         AL    @01,@TF00001                                     02S0089 00257000
         AL    @01,@CF00875                                     02S0089 00258000
         OI    TCTFLAG3-3(@01),B'01000000'                      02S0089 00259000
*      END;                                                     02S0090 00260000
*  END;                                                         02S0091 00261000
@RC00085 AH    COUNT,@CH00065                                   02S0091 00262000
@DE00084 L     @01,DSABTIOT(,DSABPTR)                           02S0091 00263000
         SLR   @00,@00                                          02S0091 00264000
         IC    @00,TIOEWTCT(,@01)                               02S0091 00265000
         CR    COUNT,@00                                        02S0091 00266000
         BNH   @DL00084                                         02S0091 00267000
*  TCTDVENP = TCTDVENP                 /*UPDATE DD ENTRY PTR BY      */ 00268000
*            + LENGTH(TCTOUTLM)        /*LEN. OUTLIM FIELD           */ 00269000
*            + (TIOEWTCT               /*LENGTH DEVICE ENTRIES       */ 00270000
*            * LENGTH(TCTDVENT));                               02S0092 00271000
         LA    @02,8                                            02S0092 00272000
         ALR   @02,TCTDVENP                                     02S0092 00273000
         L     @01,DSABTIOT(,DSABPTR)                           02S0092 00274000
         SLR   @00,@00                                          02S0092 00275000
         IC    @00,TIOEWTCT(,@01)                               02S0092 00276000
         SLA   @00,3                                            02S0092 00277000
         ALR   @02,@00                                          02S0092 00278000
         LR    TCTDVENP,@02                                     02S0092 00279000
*  DSABPTR = DSABFCHN;                 /*POINT TO NEXT DSAB ENTRY    */ 00280000
         L     DSABPTR,DSABFCHN(,DSABPTR)                       02S0093 00281000
*END;                                                           02S0094 00282000
         AH    I,@CH00065                                       02S0094 00283000
@DE00080 CH    I,DDCOUNT                                        02S0094 00284000
         BNH   @DL00080                                         02S0094 00285000
*TCTIOTBL = TCTIOTP;                   /*CHAIN IN NEW TCTIOT         */ 00286000
         L     @15,@PC00001+8                                   02S0095 00287000
         L     @01,TCBPTR(,@15)                                 02S0095 00288000
         L     @01,TCBTCT(,@01)                                 02S0095 00289000
         ST    TCTIOTP,TCTIOTBL(,@01)                           02S0095 00290000
*TCTSZLKP = DEVENTNO * LENGTH(TCTDVENT); /*LEN DEVICE ENTRIES        */ 00291000
         L     @10,@PC00001+8                                   02S0096 00292000
         L     @10,TCBPTR(,@10)                                 02S0096 00293000
         L     @10,TCBTCT(,@10)                                 02S0096 00294000
         L     @10,TCTIOTBL(,@10)                               02S0096 00295000
         L     @15,DEVENTNO                                     02S0096 00296000
         SLA   @15,3                                            02S0096 00297000
         STH   @15,TCTSZLKP(,@10)                               02S0096 00298000
*TCTPLEXT = TCTPLSAV;                  /*ASSIGN SUBPOOL & SIZE TCTIOT*/ 00299000
         MVC   TCTPLEXT(4,@10),TCTPLSAV                         02S0097 00300000
*  END;                                                         01S0098 00301000
*ELSE;                                 /*NO DDS IN TIOT              */ 00302000
@RF00055 DS    0H                                               01S0100 00303000
*RETURN CODE(ZERO);                                             01S0100 00304000
         L     @13,4(,@13)                                      01S0100 00305000
         L     @00,@SIZDATD                                     01S0100 00306000
         LR    @01,@11                                          01S0100 00307000
         FREEMAIN R,LV=(0),A=(1)                                        00308000
         SLR   @15,@15                                          01S0100 00309000
         L     @14,12(,@13)                                     01S0100 00310000
         LM    @00,@12,20(@13)                                  01S0100 00311000
         BR    @14                                              01S0100 00312000
*END IEFIB660                                                   01S0101 00313000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00314000
*/*%INCLUDE SYSLIB  (I660SPEC)                                        * 00315000
*/*%INCLUDE SYSLIB  (I660DATA)                                        * 00316000
*/*%INCLUDE SYSLIB  (IHADSAB )                                        * 00317000
*/*%INCLUDE SYSLIB  (IEFTCT  )                                        * 00318000
*/*%INCLUDE SYSLIB  (IEFTIOT1)                                        * 00319000
*/*%INCLUDE SYSLIB  (IEZJSCB )                                        * 00320000
*/*%INCLUDE SYSLIB  (IHAQDB  )                                        * 00321000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                        * 00322000
*/*%INCLUDE SYSLIB  (INITBLCK)                                        * 00323000
*/*%INCLUDE SYSLIB  (INITSPEC)                                        * 00324000
*;                                                              01S0101 00325000
@DATA    DS    0H                                                       00326000
@CH00065 DC    H'1'                                                     00327000
@CH00073 DC    H'4'                                                     00328000
@CH00871 DC    H'12'                                                    00329000
@CH00094 DC    H'200'                                                   00330000
@DATD    DSECT                                                          00331000
         DS    0F                                                       00332000
@SA00001 DS    18F                                                      00333000
@PC00001 DS    3F                                                       00334000
@TF00001 DS    F                                                        00335000
IEFIB660 CSECT                                                          00336000
         DS    0F                                                       00337000
@CF00874 DC    F'-8'                                                    00338000
@CF00875 DC    F'-5'                                                    00339000
@CF00872 DC    F'-4'                                                    00340000
@CF00873 DC    F'-2'                                                    00341000
@CF00102 DC    XL4'FF000000'                                            00342000
@DATD    DSECT                                                          00343000
         DS    0D                                                       00344000
TCTLUENP DS    A                                                        00345000
DEVENTNO DS    F                                                        00346000
TCTPLSAV DS    FL4                                                      00347000
         ORG   TCTPLSAV                                                 00348000
@NM00003 DS    FL2                                                      00349000
SAVSIZE  DS    FL2                                                      00350000
         ORG   TCTPLSAV+4                                               00351000
QDBPTR   DS    A                                                        00352000
DDCOUNT  DS    H                                                        00353000
TCTOUTLM DS    CL8                                                      00354000
IEFIB660 CSECT                                                          00355000
         DS    0F                                                       00356000
@SIZDATD DC    AL1(230)                                                 00357000
         DC    AL3(@ENDDATD-@DATD)                                      00358000
         DS    0D                                                       00359000
IEFIB660 CSECT                                                          00360000
         DS   0H                                                        00361000
PATCHLOC DC ((@DATA-@PSTART)/20)X'00'                                   00362000
@DATD    DSECT                                                          00363000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00364000
@ENDDATD EQU   *                                                        00365000
IEFIB660 CSECT                                                          00366000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00367000
@01      EQU   01                                                       00368000
@02      EQU   02                                                       00369000
@03      EQU   03                                                       00370000
@04      EQU   04                                                       00371000
@05      EQU   05                                                       00372000
@06      EQU   06                                                       00373000
@07      EQU   07                                                       00374000
@08      EQU   08                                                       00375000
@09      EQU   09                                                       00376000
@10      EQU   10                                                       00377000
@11      EQU   11                                                       00378000
@12      EQU   12                                                       00379000
@13      EQU   13                                                       00380000
@14      EQU   14                                                       00381000
@15      EQU   15                                                       00382000
I        EQU   @03                                                      00383000
GETSIZE  EQU   @02                                                      00384000
COUNT    EQU   @02                                                      00385000
TCTIOTP  EQU   @10                                                      00386000
TCTDVENP EQU   @09                                                      00387000
DSABPTR  EQU   @08                                                      00388000
REG0     EQU   @00                                                      00389000
REG1     EQU   @01                                                      00390000
REG2     EQU   @02                                                      00391000
REG3     EQU   @03                                                      00392000
REG4     EQU   @04                                                      00393000
REG5     EQU   @05                                                      00394000
REG15    EQU   @15                                                      00395000
TCTDVENT EQU   0                                                        00396000
TCTDUCBP EQU   TCTDVENT                                                 00397000
TCTDSCTR EQU   TCTDVENT+2                                               00398000
TCTFLAGS EQU   TCTDVENT+3                                               00399000
TCTFLAG3 EQU   TCTFLAGS                                                 00400000
TCTLUENT EQU   0                                                        00401000
TCTIOTO  EQU   TCTLUENT                                                 00402000
TCTCNTEO EQU   TCTLUENT+2                                               00403000
TIOPREFX EQU   0                                                        00404000
TIOINUSL EQU   TIOPREFX+22                                              00405000
DSAB     EQU   0                                                        00406000
DSABFCHN EQU   DSAB+4                                                   00407000
DSABTIOT EQU   DSAB+16                                                  00408000
DSABGIDP EQU   DSAB+24                                                  00409000
DSABANMP EQU   DSAB+28                                                  00410000
DSABORG  EQU   DSAB+32                                                  00411000
DSABORG1 EQU   DSABORG                                                  00412000
DSABORG2 EQU   DSABORG+1                                                00413000
DSABFLG1 EQU   DSAB+34                                                  00414000
DSABFLG2 EQU   DSAB+35                                                  00415000
DSABFLG3 EQU   DSAB+36                                                  00416000
DSABVAM  EQU   DSABFLG3                                                 00417000
DSABFLG4 EQU   DSAB+37                                                  00418000
DSABANMI EQU   0                                                        00419000
DSABGIDL EQU   0                                                        00420000
SMFTCT   EQU   0                                                        00421000
TCTSW    EQU   SMFTCT+3                                                 00422000
TCTCRTBL EQU   SMFTCT+8                                                 00423000
TCTIOTBL EQU   SMFTCT+12                                                00424000
TCTPOOL  EQU   SMFTCT+16                                                00425000
TCTJSTX  EQU   SMFTCT+36                                                00426000
TCTTJLM  EQU   SMFTCT+40                                                00427000
TCTPGSMF EQU   SMFTCT+64                                                00428000
TCTPGIN  EQU   TCTPGSMF                                                 00429000
TCTPGOUT EQU   TCTPGSMF+4                                               00430000
TCTCORE  EQU   0                                                        00431000
TCTTIOT  EQU   0                                                        00432000
TCTPLEXT EQU   TCTTIOT                                                  00433000
TCTSZLKP EQU   TCTTIOT+4                                                00434000
TIOT1    EQU   0                                                        00435000
TIOENTRY EQU   0                                                        00436000
TIOESTTA EQU   TIOENTRY+1                                               00437000
TIOERLOC EQU   TIOENTRY+2                                               00438000
TIOEWTCT EQU   TIOERLOC                                                 00439000
TIOELINK EQU   TIOERLOC+1                                               00440000
TIOESYOT EQU   TIOELINK                                                 00441000
TIOESTTC EQU   TIOENTRY+15                                              00442000
TIOESTTB EQU   TIOENTRY+16                                              00443000
POOLSTAR EQU   TIOENTRY+20                                              00444000
IEZJSCB  EQU   0                                                        00445000
JSCBSEC1 EQU   IEZJSCB+188                                              00446000
JSCHPCE  EQU   JSCBSEC1+4                                               00447000
JSCBDCB  EQU   JSCBSEC1+36                                              00448000
JSCBOPTS EQU   JSCBSEC1+48                                              00449000
JSCBSWT1 EQU   JSCBSEC1+55                                              00450000
JSCBWTP  EQU   JSCBSEC1+64                                              00451000
JSCBWTFG EQU   JSCBWTP                                                  00452000
JSCBEND1 EQU   IEZJSCB+260                                              00453000
QDB      EQU   0                                                        00454000
QDBFELMP EQU   QDB+12                                                   00455000
TCBFIX   EQU   0                                                        00456000
TCBFRS   EQU   TCBFIX                                                   00457000
TCB      EQU   0                                                        00458000
TCBPIE   EQU   TCB+4                                                    00459000
TCBPMASK EQU   TCBPIE                                                   00460000
TCBCMP   EQU   TCB+16                                                   00461000
TCBCMPF  EQU   TCBCMP                                                   00462000
TCBCPP   EQU   TCBCMPF                                                  00463000
TCBSTCC  EQU   TCBCMPF                                                  00464000
TCBCDBL  EQU   TCBCMPF                                                  00465000
TCBCWTO  EQU   TCBCMPF                                                  00466000
TCBCIND  EQU   TCBCMPF                                                  00467000
TCBCMSG  EQU   TCBCMPF                                                  00468000
TCBTRN   EQU   TCB+20                                                   00469000
TCBABF   EQU   TCBTRN                                                   00470000
TCBMSS   EQU   TCB+24                                                   00471000
TCBPKF   EQU   TCB+28                                                   00472000
TCBFLGS  EQU   TCB+29                                                   00473000
TCBFLGS1 EQU   TCBFLGS                                                  00474000
TCBFLGS2 EQU   TCBFLGS+1                                                00475000
TCBFLGS3 EQU   TCBFLGS+2                                                00476000
TCBFLGS4 EQU   TCBFLGS+3                                                00477000
TCBFLGS5 EQU   TCBFLGS+4                                                00478000
TCBABWF  EQU   TCBFLGS5                                                 00479000
TCBJPQ   EQU   TCB+44                                                   00480000
TCBPURGE EQU   TCBJPQ                                                   00481000
TCBGRS   EQU   TCB+48                                                   00482000
TCBFSA   EQU   TCB+112                                                  00483000
TCBTME   EQU   TCB+120                                                  00484000
TCBJSTCB EQU   TCB+124                                                  00485000
TCBTSFLG EQU   TCB+148                                                  00486000
TCBTSTSK EQU   TCBTSFLG                                                 00487000
TCBSTAB  EQU   TCB+160                                                  00488000
TCBNSTAE EQU   TCBSTAB                                                  00489000
TCBTCT   EQU   TCB+164                                                  00490000
TCBTCTGF EQU   TCBTCT                                                   00491000
TCBSCNDY EQU   TCB+172                                                  00492000
TCBNDSP  EQU   TCBSCNDY                                                 00493000
TCBNDSP1 EQU   TCBNDSP+1                                                00494000
TCBNDSP2 EQU   TCBNDSP+2                                                00495000
TCBNDSP3 EQU   TCBNDSP+3                                                00496000
TCBJSCB  EQU   TCB+180                                                  00497000
TCBRECDE EQU   TCBJSCB                                                  00498000
TCBEXT1  EQU   TCB+196                                                  00499000
TCBBITS  EQU   TCB+200                                                  00500000
TCBNDSP4 EQU   TCBBITS                                                  00501000
TCBNDSP5 EQU   TCBBITS+1                                                00502000
TCBFLGS6 EQU   TCBBITS+2                                                00503000
TCBFLGS7 EQU   TCBBITS+3                                                00504000
TCBDAR   EQU   TCB+204                                                  00505000
TCBDARC  EQU   TCBDAR                                                   00506000
TCBEXT2  EQU   TCB+208                                                  00507000
TCBFOE   EQU   TCB+244                                                  00508000
TCBESTAE EQU   TCB+264                                                  00509000
TCBESTRM EQU   TCBESTAE+1                                               00510000
TCBFBYT1 EQU   TCB+276                                                  00511000
TCBFBYT2 EQU   TCB+277                                                  00512000
TCBRV124 EQU   TCB+278                                                  00513000
TCBRV133 EQU   TCB+279                                                  00514000
TCBXTNT2 EQU   0                                                        00515000
TCBGTF   EQU   TCBXTNT2                                                 00516000
TCBTFLG  EQU   TCBGTF                                                   00517000
TCBRV146 EQU   TCBXTNT2+28                                              00518000
TCBRV155 EQU   TCBXTNT2+29                                              00519000
TCBRV164 EQU   TCBXTNT2+30                                              00520000
TCBRV173 EQU   TCBXTNT2+31                                              00521000
JSCBPTR  EQU   0                                                        00522000
TIOTPTR  EQU   0                                                        00523000
TCBPTR   EQU   0                                                        00524000
TCTIODSP EQU   TCTPLEXT+8                                               00525000
TCTDCBTD EQU   TCTIODSP                                                 00526000
TCTIOTSD EQU   TCTIODSP+2                                               00527000
TCTDCBLE EQU   TCTIODSP+4                                               00528000
TCTDDENT EQU   TCTDCBLE+4                                               00529000
TCTUCBP  EQU   TCTDDENT                                                 00530000
TCTSCTR  EQU   TCTDDENT+2                                               00531000
TCTFLGS  EQU   TCTDDENT+3                                               00532000
TCTDCTR  EQU   TCTDDENT+4                                               00533000
TIOEDEVE EQU   TIOESTTB                                                 00534000
TIOSTTB  EQU   TIOEDEVE                                                 00535000
TIOUCBP  EQU   TIOEDEVE+1                                               00536000
JSCBSEC2 EQU   JSCBEND1                                                 00537000
JSCBSEC3 EQU   JSCBEND1                                                 00538000
JSCBJCT  EQU   JSCBSEC3                                                 00539000
JSCBJCTA EQU   JSCBJCT+1                                                00540000
JSCBASID EQU   JSCBSEC3+8                                               00541000
JSCBJNL  EQU   JSCBSEC3+28                                              00542000
JSCBJJSB EQU   JSCBJNL                                                  00543000
JSCBSUB  EQU   JSCBSEC3+40                                              00544000
JSCDSABQ EQU   JSCBSEC3+60                                              00545000
JSCSCT   EQU   JSCBSEC3+68                                              00546000
JSCTMCOR EQU   JSCBSEC3+72                                              00547000
JSCRSV35 EQU   JSCBSEC3+96                                              00548000
JSCRSV36 EQU   JSCRSV35                                                 00549000
JSCRSV37 EQU   JSCRSV35+2                                               00550000
JSCRSV45 EQU   JSCBSEC3+112                                             00551000
JSCRSV46 EQU   JSCRSV45                                                 00552000
JSCRSV47 EQU   JSCRSV45+2                                               00553000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00554000
JSCBEND3 EQU   JSCBSEC3+120                                             00555000
JSCRSV52 EQU   JSCBSEC3+116                                             00556000
JSCRSV51 EQU   JSCRSV47+1                                               00557000
JSCRSV50 EQU   JSCRSV47                                                 00558000
JSCRSV49 EQU   JSCRSV46+1                                               00559000
JSCRSV48 EQU   JSCRSV46                                                 00560000
JSCRSV44 EQU   JSCBSEC3+108                                             00561000
JSCRSV43 EQU   JSCBSEC3+104                                             00562000
JSCRSV42 EQU   JSCBSEC3+100                                             00563000
JSCRSV41 EQU   JSCRSV37+1                                               00564000
JSCRSV40 EQU   JSCRSV37                                                 00565000
JSCRSV39 EQU   JSCRSV36+1                                               00566000
JSCRSV38 EQU   JSCRSV36                                                 00567000
JSCBUFPT EQU   JSCBSEC3+92                                              00568000
JSCBACT  EQU   JSCBSEC3+88                                              00569000
JSCBSWSP EQU   JSCBSEC3+87                                              00570000
JSCRSV33 EQU   JSCBSEC3+86                                              00571000
JSCDDNUM EQU   JSCBSEC3+84                                              00572000
JSCRSV53 EQU   JSCBSEC3+82                                              00573000
JSCDDNNO EQU   JSCBSEC3+80                                              00574000
JSCBVATA EQU   JSCBSEC3+76                                              00575000
JSCSCTP  EQU   JSCSCT+1                                                 00576000
JSCRSV55 EQU   JSCSCT                                                   00577000
JSCRSV54 EQU   JSCBSEC3+64                                              00578000
JSCBSSIB EQU   JSCBSEC3+56                                              00579000
JSCBFRBA EQU   JSCBSEC3+48                                              00580000
JSCRSV28 EQU   JSCBSEC3+46                                              00581000
JSCBSONO EQU   JSCBSEC3+44                                              00582000
JSCBSUBA EQU   JSCBSUB+1                                                00583000
JSCRSV31 EQU   JSCBSUB                                                  00584000
JSCBSMLR EQU   JSCBSEC3+36                                              00585000
JSCBJNLR EQU   JSCBSEC3+32                                              00586000
JSCBJNLA EQU   JSCBJNL+1                                                00587000
JSCBJSBT EQU   JSCBJJSB                                                 00588000
JSCBJSBX EQU   JSCBJJSB                                                 00589000
JSCBJSBA EQU   JSCBJJSB                                                 00590000
JSCBJSBI EQU   JSCBJJSB                                                 00591000
@NM00022 EQU   JSCBJJSB                                                 00592000
JSCBJNLE EQU   JSCBJJSB                                                 00593000
JSCBJNLF EQU   JSCBJJSB                                                 00594000
JSCBJNLN EQU   JSCBJJSB                                                 00595000
@NM00021 EQU   JSCBSEC3+24                                              00596000
JSCBJRBA EQU   JSCBSEC3+16                                              00597000
JSCBIECB EQU   JSCBSEC3+12                                              00598000
JSCRSV25 EQU   JSCBSEC3+10                                              00599000
JSCBTJID EQU   JSCBASID                                                 00600000
JSCBPSCB EQU   JSCBSEC3+4                                               00601000
JSCJCTP  EQU   JSCBJCTA                                                 00602000
JSCRSV24 EQU   JSCBJCT                                                  00603000
JSCBEND2 EQU   JSCBSEC2                                                 00604000
TIOVERF  EQU   TIOSTTB                                                  00605000
TIOUNLD  EQU   TIOSTTB                                                  00606000
TIOMNTD  EQU   TIOSTTB                                                  00607000
TIOSETU  EQU   TIOSTTB                                                  00608000
TIOVLSR  EQU   TIOSTTB                                                  00609000
TIOPVIO  EQU   TIOSTTB                                                  00610000
TIOREQD  EQU   TIOSTTB                                                  00611000
TIOUSED  EQU   TIOSTTB                                                  00612000
TCTTKRLD EQU   TCTDDENT+13                                              00613000
TCTEXRLD EQU   TCTDDENT+12                                              00614000
TCTRSV10 EQU   TCTDDENT+8                                               00615000
TCTRSV26 EQU   TCTFLGS                                                  00616000
TCTRSV25 EQU   TCTFLGS                                                  00617000
TCTRSV24 EQU   TCTFLGS                                                  00618000
TCTRSV23 EQU   TCTFLGS                                                  00619000
TCTRSV22 EQU   TCTFLGS                                                  00620000
TCTRSV21 EQU   TCTFLGS                                                  00621000
TCTVAMDS EQU   TCTFLGS                                                  00622000
TCTDDIND EQU   TCTFLGS                                                  00623000
@NM00026 EQU   TCBXTNT2+32                                              00624000
TCBRV181 EQU   TCBRV173                                                 00625000
TCBRV180 EQU   TCBRV173                                                 00626000
TCBRV179 EQU   TCBRV173                                                 00627000
TCBRV178 EQU   TCBRV173                                                 00628000
TCBRV177 EQU   TCBRV173                                                 00629000
TCBRV176 EQU   TCBRV173                                                 00630000
TCBRV175 EQU   TCBRV173                                                 00631000
TCBRV174 EQU   TCBRV173                                                 00632000
TCBRV172 EQU   TCBRV164                                                 00633000
TCBRV171 EQU   TCBRV164                                                 00634000
TCBRV170 EQU   TCBRV164                                                 00635000
TCBRV169 EQU   TCBRV164                                                 00636000
TCBRV168 EQU   TCBRV164                                                 00637000
TCBRV167 EQU   TCBRV164                                                 00638000
TCBRV166 EQU   TCBRV164                                                 00639000
TCBRV165 EQU   TCBRV164                                                 00640000
TCBRV163 EQU   TCBRV155                                                 00641000
TCBRV162 EQU   TCBRV155                                                 00642000
TCBRV161 EQU   TCBRV155                                                 00643000
TCBRV160 EQU   TCBRV155                                                 00644000
TCBRV159 EQU   TCBRV155                                                 00645000
TCBRV158 EQU   TCBRV155                                                 00646000
TCBRV157 EQU   TCBRV155                                                 00647000
TCBRV156 EQU   TCBRV155                                                 00648000
TCBRV154 EQU   TCBRV146                                                 00649000
TCBRV153 EQU   TCBRV146                                                 00650000
TCBRV152 EQU   TCBRV146                                                 00651000
TCBRV151 EQU   TCBRV146                                                 00652000
TCBRV150 EQU   TCBRV146                                                 00653000
TCBRV149 EQU   TCBRV146                                                 00654000
TCBRV148 EQU   TCBRV146                                                 00655000
TCBRV147 EQU   TCBRV146                                                 00656000
TCBRV145 EQU   TCBXTNT2+26                                              00657000
TCBRV144 EQU   TCBXTNT2+24                                              00658000
TCBRV143 EQU   TCBXTNT2+20                                              00659000
TCBRV142 EQU   TCBXTNT2+16                                              00660000
TCBRSV49 EQU   TCBXTNT2+12                                              00661000
TCBEVENT EQU   TCBXTNT2+8                                               00662000
TCBRCMP  EQU   TCBXTNT2+5                                               00663000
TCBRSVAB EQU   TCBXTNT2+4                                               00664000
TCBGTFA  EQU   TCBGTF+1                                                 00665000
TCBRSV47 EQU   TCBTFLG                                                  00666000
TCBRSV46 EQU   TCBTFLG                                                  00667000
TCBRSV45 EQU   TCBTFLG                                                  00668000
TCBRSV44 EQU   TCBTFLG                                                  00669000
TCBRSV43 EQU   TCBTFLG                                                  00670000
TCBDSPIT EQU   TCBTFLG                                                  00671000
TCBERRTN EQU   TCBTFLG                                                  00672000
TCBASYNC EQU   TCBTFLG                                                  00673000
@NM00025 EQU   TCB+296                                                  00674000
TCBSCBQ  EQU   TCB+292                                                  00675000
TCBSWASA EQU   TCB+288                                                  00676000
TCBDBTB  EQU   TCB+284                                                  00677000
TCBRPT   EQU   TCB+280                                                  00678000
TCBRV141 EQU   TCBRV133                                                 00679000
TCBRV140 EQU   TCBRV133                                                 00680000
TCBRV139 EQU   TCBRV133                                                 00681000
TCBRV138 EQU   TCBRV133                                                 00682000
TCBRV137 EQU   TCBRV133                                                 00683000
TCBRV136 EQU   TCBRV133                                                 00684000
TCBRV135 EQU   TCBRV133                                                 00685000
TCBRV134 EQU   TCBRV133                                                 00686000
TCBRV132 EQU   TCBRV124                                                 00687000
TCBRV131 EQU   TCBRV124                                                 00688000
TCBRV130 EQU   TCBRV124                                                 00689000
TCBRV129 EQU   TCBRV124                                                 00690000
TCBRV128 EQU   TCBRV124                                                 00691000
TCBRV127 EQU   TCBRV124                                                 00692000
TCBRV126 EQU   TCBRV124                                                 00693000
TCBRV125 EQU   TCBRV124                                                 00694000
TCBRV123 EQU   TCBFBYT2                                                 00695000
TCBRV122 EQU   TCBFBYT2                                                 00696000
TCBECBNV EQU   TCBFBYT2                                                 00697000
TCBSSSYN EQU   TCBFBYT2                                                 00698000
TCBFPRAP EQU   TCBFBYT2                                                 00699000
TCBFDW   EQU   TCBFBYT2                                                 00700000
TCBFMW   EQU   TCBFBYT2                                                 00701000
TCBCNCB  EQU   TCBFBYT2                                                 00702000
TCBLLH   EQU   TCBFBYT1                                                 00703000
TCBRV113 EQU   TCBFBYT1                                                 00704000
TCBEOT   EQU   TCBFBYT1                                                 00705000
TCBRTM2  EQU   TCBFBYT1                                                 00706000
TCBPGNLY EQU   TCBFBYT1                                                 00707000
TCBNDIOS EQU   TCBFBYT1                                                 00708000
TCBACTIV EQU   TCBFBYT1                                                 00709000
TCBEOTFM EQU   TCBFBYT1                                                 00710000
TCBAFFN  EQU   TCB+274                                                  00711000
TCBCCPVI EQU   TCB+272                                                  00712000
TCBUKYSP EQU   TCB+268                                                  00713000
TCBMODE  EQU   TCBESTAE+3                                               00714000
TCBERTYP EQU   TCBESTAE+2                                               00715000
TCBRV314 EQU   TCBESTRM                                                 00716000
TCBRV313 EQU   TCBESTRM                                                 00717000
TCBRV312 EQU   TCBESTRM                                                 00718000
TCBRV311 EQU   TCBESTRM                                                 00719000
TCBRV310 EQU   TCBESTRM                                                 00720000
TCBRV309 EQU   TCBESTRM                                                 00721000
TCBRV308 EQU   TCBESTRM                                                 00722000
TCBETERM EQU   TCBESTRM                                                 00723000
TCBSCBKY EQU   TCBESTAE                                                 00724000
TCBRTM12 EQU   TCB+260                                                  00725000
TCBTCBID EQU   TCB+256                                                  00726000
TCBRSV96 EQU   TCB+252                                                  00727000
TCBSWA   EQU   TCB+248                                                  00728000
TCBFOEA  EQU   TCBFOE+1                                                 00729000
TCBRSV42 EQU   TCBFOE                                                   00730000
TCBRV306 EQU   TCB+240                                                  00731000
TCBRSV41 EQU   TCB+239                                                  00732000
TCBTID   EQU   TCB+238                                                  00733000
TCBRSVAA EQU   TCB+237                                                  00734000
TCBABCUR EQU   TCB+236                                                  00735000
TCBTMSAV EQU   TCB+232                                                  00736000
TCBIOTIM EQU   TCB+228                                                  00737000
TCBRTWA  EQU   TCB+224                                                  00738000
TCBBACK  EQU   TCB+220                                                  00739000
TCBTIRB  EQU   TCB+216                                                  00740000
TCBAECB  EQU   TCB+212                                                  00741000
TCBEXT2A EQU   TCBEXT2+1                                                00742000
TCBRSV39 EQU   TCBEXT2                                                  00743000
TCBSTMCT EQU   TCB+207                                                  00744000
TCBSYSCT EQU   TCB+206                                                  00745000
TCBRSV37 EQU   TCB+205                                                  00746000
TCBEXSVC EQU   TCBDAR                                                   00747000
TCBRSV36 EQU   TCBDAR                                                   00748000
TCBDARWT EQU   TCBDAR                                                   00749000
TCBDARO  EQU   TCBDAR                                                   00750000
TCBDARMC EQU   TCBDARC                                                  00751000
TCBDARD  EQU   TCBDAR                                                   00752000
TCBDARS  EQU   TCBDAR                                                   00753000
TCBDARP  EQU   TCBDAR                                                   00754000
TCBGTOFM EQU   TCBFLGS7                                                 00755000
TCBADMP  EQU   TCBFLGS7                                                 00756000
TCBRSTSK EQU   TCBFLGS7                                                 00757000
TCBRSV35 EQU   TCBFLGS7                                                 00758000
TCBSTACK EQU   TCBFLGS7                                                 00759000
TCBRSV34 EQU   TCBFLGS7                                                 00760000
TCBRSV33 EQU   TCBFLGS7                                                 00761000
TCBGPECB EQU   TCBFLGS7                                                 00762000
TCBNTJS  EQU   TCBFLGS6                                                 00763000
TCBAPG   EQU   TCBFLGS6                                                 00764000
TCBMIGR  EQU   TCBFLGS6                                                 00765000
TCBRV303 EQU   TCBFLGS6                                                 00766000
TCBSPVLK EQU   TCBFLGS6                                                 00767000
TCBCPU   EQU   TCBFLGS6                                                 00768000
TCBPIE17 EQU   TCBFLGS6                                                 00769000
TCBRV    EQU   TCBFLGS6                                                 00770000
TCBRSV79 EQU   TCBNDSP5                                                 00771000
TCBRSV78 EQU   TCBNDSP5                                                 00772000
TCBRSV77 EQU   TCBNDSP5                                                 00773000
TCBRSV76 EQU   TCBNDSP5                                                 00774000
TCBRSV75 EQU   TCBNDSP5                                                 00775000
TCBRSV74 EQU   TCBNDSP5                                                 00776000
TCBRSV95 EQU   TCBNDSP5                                                 00777000
TCBRSV94 EQU   TCBNDSP5                                                 00778000
TCBRSV93 EQU   TCBNDSP4                                                 00779000
TCBRSV92 EQU   TCBNDSP4                                                 00780000
TCBRSV91 EQU   TCBNDSP4                                                 00781000
TCBRSV90 EQU   TCBNDSP4                                                 00782000
TCBRSV89 EQU   TCBNDSP4                                                 00783000
TCBRSV88 EQU   TCBNDSP4                                                 00784000
TCBRSV87 EQU   TCBNDSP4                                                 00785000
TCBRSV86 EQU   TCBNDSP4                                                 00786000
TCBEXT1A EQU   TCBEXT1+1                                                00787000
TCBRSV32 EQU   TCBEXT1                                                  00788000
TCBEXCPD EQU   TCB+192                                                  00789000
TCBIOBRC EQU   TCB+188                                                  00790000
TCBDDWTC EQU   TCB+186                                                  00791000
TCBDDEXC EQU   TCB+184                                                  00792000
TCBJSCBB EQU   TCBJSCB+1                                                00793000
@NM00024 EQU   TCBRECDE                                                 00794000
TCBREC   EQU   TCBRECDE                                                 00795000
TCBMDIDS EQU   TCB+176                                                  00796000
TCBNDINT EQU   TCBNDSP3                                                 00797000
TCBRSV27 EQU   TCBNDSP3                                                 00798000
TCBRSV26 EQU   TCBNDSP3                                                 00799000
TCBRSV25 EQU   TCBNDSP3                                                 00800000
TCBRSV24 EQU   TCBNDSP3                                                 00801000
TCBSRBND EQU   TCBNDSP3                                                 00802000
TCBRV302 EQU   TCBNDSP3                                                 00803000
TCBLJSND EQU   TCBNDSP3                                                 00804000
TCBABE   EQU   TCBNDSP2                                                 00805000
TCBDSS   EQU   TCBNDSP2                                                 00806000
TCBOWAIT EQU   TCBNDSP2                                                 00807000
TCBIWAIT EQU   TCBNDSP2                                                 00808000
TCBNDTS  EQU   TCBNDSP2                                                 00809000
TCBNDSVC EQU   TCBNDSP2                                                 00810000
TCBSTPP  EQU   TCBNDSP2                                                 00811000
TCBABD   EQU   TCBNDSP2                                                 00812000
TCBRSV22 EQU   TCBNDSP1                                                 00813000
TCBPIEND EQU   TCBNDSP1                                                 00814000
TCBTPSP  EQU   TCBNDSP1                                                 00815000
TCBDDRND EQU   TCBNDSP1                                                 00816000
TCBRSPND EQU   TCBNDSP1                                                 00817000
TCBRSTND EQU   TCBNDSP1                                                 00818000
TCBDARPN EQU   TCBNDSP1                                                 00819000
TCBDARTN EQU   TCBNDSP1                                                 00820000
TCBNDSP0 EQU   TCBNDSP                                                  00821000
TCBUSER  EQU   TCB+168                                                  00822000
TCBTCTB  EQU   TCBTCT+1                                                 00823000
TCBRSV9C EQU   TCBTCTGF                                                 00824000
TCBRSV9B EQU   TCBTCTGF                                                 00825000
TCBRSV9A EQU   TCBTCTGF                                                 00826000
TCBRSV99 EQU   TCBTCTGF                                                 00827000
TCBRSV98 EQU   TCBTCTGF                                                 00828000
TCBRSV97 EQU   TCBTCTGF                                                 00829000
TCBRSV20 EQU   TCBTCTGF                                                 00830000
TCBSMFGF EQU   TCBTCTGF                                                 00831000
TCBSTABB EQU   TCBSTAB+1                                                00832000
TCBSTCUR EQU   TCBNSTAE                                                 00833000
TCBRV301 EQU   TCBNSTAE                                                 00834000
TCBSYNCH EQU   TCBNSTAE                                                 00835000
TCBHALT  EQU   TCBNSTAE                                                 00836000
TCBPPSUP EQU   TCBNSTAE                                                 00837000
TCB33E   EQU   TCBNSTAE                                                 00838000
TCBQUIES EQU   TCBNSTAE                                                 00839000
TCBSTABE EQU   TCBNSTAE                                                 00840000
TCBAQE   EQU   TCB+156                                                  00841000
TCBPQE   EQU   TCB+152                                                  00842000
TCBTSDP  EQU   TCB+151                                                  00843000
TCBTSLP  EQU   TCB+150                                                  00844000
TCBSTPCT EQU   TCB+149                                                  00845000
TCBCPUBN EQU   TCBTSFLG                                                 00846000
TCBDYDSP EQU   TCBTSFLG                                                 00847000
TCBRSV18 EQU   TCBTSFLG                                                 00848000
TCBRSV17 EQU   TCBTSFLG                                                 00849000
TCBTIOTG EQU   TCBTSFLG                                                 00850000
TCBATT   EQU   TCBTSFLG                                                 00851000
TCBSTPPR EQU   TCBTSFLG                                                 00852000
TCBRV300 EQU   TCBTSTSK                                                 00853000
TCBECB   EQU   TCB+144                                                  00854000
TCBIQE   EQU   TCB+140                                                  00855000
TCBLTC   EQU   TCB+136                                                  00856000
TCBOTC   EQU   TCB+132                                                  00857000
TCBNTC   EQU   TCB+128                                                  00858000
TCBJSTCA EQU   TCBJSTCB+1                                               00859000
TCBRSV16 EQU   TCBJSTCB                                                 00860000
TCBTQET  EQU   TCBTME                                                   00861000
TCBTCB   EQU   TCB+116                                                  00862000
TCBFSAB  EQU   TCBFSA+1                                                 00863000
TCBQEL   EQU   TCBFSA                                                   00864000
TCBGRS15 EQU   TCBGRS+60                                                00865000
TCBGRS14 EQU   TCBGRS+56                                                00866000
TCBGRS13 EQU   TCBGRS+52                                                00867000
TCBGRS12 EQU   TCBGRS+48                                                00868000
TCBGRS11 EQU   TCBGRS+44                                                00869000
TCBGRS10 EQU   TCBGRS+40                                                00870000
TCBGRS9  EQU   TCBGRS+36                                                00871000
TCBGRS8  EQU   TCBGRS+32                                                00872000
TCBGRS7  EQU   TCBGRS+28                                                00873000
TCBGRS6  EQU   TCBGRS+24                                                00874000
TCBGRS5  EQU   TCBGRS+20                                                00875000
TCBGRS4  EQU   TCBGRS+16                                                00876000
TCBGRS3  EQU   TCBGRS+12                                                00877000
TCBGRS2  EQU   TCBGRS+8                                                 00878000
TCBGRS1  EQU   TCBGRS+4                                                 00879000
TCBGRS0  EQU   TCBGRS                                                   00880000
TCBJPQB  EQU   TCBJPQ+1                                                 00881000
TCBRSV15 EQU   TCBPURGE                                                 00882000
TCBRSV14 EQU   TCBPURGE                                                 00883000
TCBRSV13 EQU   TCBPURGE                                                 00884000
TCBRSV12 EQU   TCBPURGE                                                 00885000
TCBRSV11 EQU   TCBPURGE                                                 00886000
TCBRSV10 EQU   TCBPURGE                                                 00887000
TCBRSV09 EQU   TCBPURGE                                                 00888000
TCBJPQF  EQU   TCBPURGE                                                 00889000
TCBJLB   EQU   TCB+40                                                   00890000
TCBLLS   EQU   TCB+36                                                   00891000
TCBDSP   EQU   TCB+35                                                   00892000
TCBLMP   EQU   TCB+34                                                   00893000
TCBPNDSP EQU   TCBFLGS5                                                 00894000
TCBFCD1  EQU   TCBFLGS5                                                 00895000
TCBSTP   EQU   TCBFLGS5                                                 00896000
TCBSYS   EQU   TCBFLGS5                                                 00897000
TCBANDSP EQU   TCBFLGS5                                                 00898000
TCBPAGE  EQU   TCBFLGS5                                                 00899000
TCBUXNDF EQU   TCBABWF                                                  00900000
TCBFC    EQU   TCBFLGS5                                                 00901000
TCBONDSP EQU   TCBFLGS4                                                 00902000
TCBMPCND EQU   TCBFLGS4                                                 00903000
TCBMPCVQ EQU   TCBFLGS4                                                 00904000
TCBUXNDV EQU   TCBFLGS4                                                 00905000
TCBHNDSP EQU   TCBFLGS4                                                 00906000
TCBRQENA EQU   TCBFLGS4                                                 00907000
TCBSER   EQU   TCBFLGS4                                                 00908000
TCBNDUMP EQU   TCBFLGS4                                                 00909000
TCBDWSTA EQU   TCBFLGS3                                                 00910000
TCBRSV08 EQU   TCBFLGS3                                                 00911000
TCBRSV07 EQU   TCBFLGS3                                                 00912000
TCBRSV06 EQU   TCBFLGS3                                                 00913000
TCBABGM  EQU   TCBFLGS3                                                 00914000
TCBABTRM EQU   TCBFLGS3                                                 00915000
TCBADINP EQU   TCBFLGS3                                                 00916000
TCBFSM   EQU   TCBFLGS3                                                 00917000
TCBFTS   EQU   TCBFLGS2                                                 00918000
TCBFETXR EQU   TCBFLGS2                                                 00919000
TCBFDSOP EQU   TCBFLGS2                                                 00920000
TCBFJMC  EQU   TCBFLGS2                                                 00921000
TCBFSMC  EQU   TCBFLGS2                                                 00922000
TCBFABOP EQU   TCBFLGS2                                                 00923000
TCBFSTI  EQU   TCBFLGS2                                                 00924000
TCBFOINP EQU   TCBFLGS2                                                 00925000
TCBFX    EQU   TCBFLGS1                                                 00926000
TCBFS    EQU   TCBFLGS1                                                 00927000
TCBFT    EQU   TCBFLGS1                                                 00928000
TCBPDUMP EQU   TCBFLGS1                                                 00929000
TCBRSV04 EQU   TCBFLGS1                                                 00930000
TCBFERA  EQU   TCBFLGS1                                                 00931000
TCBFE    EQU   TCBFLGS1                                                 00932000
TCBFA    EQU   TCBFLGS1                                                 00933000
TCBZERO  EQU   TCBPKF                                                   00934000
TCBFLAG  EQU   TCBPKF                                                   00935000
TCBMSSB  EQU   TCBMSS+1                                                 00936000
TCBRSV03 EQU   TCBMSS                                                   00937000
TCBTRNB  EQU   TCBTRN+1                                                 00938000
TCBRSV02 EQU   TCBABF                                                   00939000
TCBOLTEP EQU   TCBABF                                                   00940000
TCBTCP   EQU   TCBABF                                                   00941000
TCBTCPP  EQU   TCBABF                                                   00942000
TCBRSV01 EQU   TCBABF                                                   00943000
TCBGRPH  EQU   TCBABF                                                   00944000
TCBNOCHK EQU   TCBABF                                                   00945000
TCBMOD91 EQU   TCBABF                                                   00946000
TCBCMPC  EQU   TCBCMP+1                                                 00947000
TCBRV318 EQU   TCBCMSG                                                  00948000
TCBRV317 EQU   TCBCIND                                                  00949000
TCBRV316 EQU   TCBCWTO                                                  00950000
TCBCASID EQU   TCBCDBL                                                  00951000
TCBNOCC  EQU   TCBSTCC                                                  00952000
TCBDMPO  EQU   TCBCPP                                                   00953000
TCBCSTEP EQU   TCBCMPF                                                  00954000
TCBCREQ  EQU   TCBCMPF                                                  00955000
TCBTIO   EQU   TCB+12                                                   00956000
TCBDEB   EQU   TCB+8                                                    00957000
TCBPIEA  EQU   TCBPIE+1                                                 00958000
TCBPM    EQU   TCBPMASK                                                 00959000
@NM00023 EQU   TCBPMASK                                                 00960000
TCBRBP   EQU   TCB                                                      00961000
TCBFRS6  EQU   TCBFRS+24                                                00962000
TCBFRS4  EQU   TCBFRS+16                                                00963000
TCBFRS2  EQU   TCBFRS+8                                                 00964000
TCBFRS0  EQU   TCBFRS                                                   00965000
QDBRV002 EQU   QDB+28                                                   00966000
QDBPRDS  EQU   QDB+26                                                   00967000
QDBPRSZ  EQU   QDB+24                                                   00968000
QDBBPTDS EQU   QDB+22                                                   00969000
QDBFPTDS EQU   QDB+20                                                   00970000
QDBLELMP EQU   QDB+16                                                   00971000
QDBNELMS EQU   QDB+8                                                    00972000
QDBRV001 EQU   QDB+6                                                    00973000
QDBATTR  EQU   QDB+4                                                    00974000
QDBQDB   EQU   QDB                                                      00975000
JSCBCSCB EQU   JSCBSEC1+68                                              00976000
JSCBPMG  EQU   JSCBWTP+2                                                00977000
JSCBWTSP EQU   JSCBWTP+1                                                00978000
JSCRSV23 EQU   JSCBWTFG                                                 00979000
JSCRSV22 EQU   JSCBWTFG                                                 00980000
JSCRSV21 EQU   JSCBWTFG                                                 00981000
JSCRSV20 EQU   JSCBWTFG                                                 00982000
JSCRSV19 EQU   JSCBWTFG                                                 00983000
JSCRSV18 EQU   JSCBWTFG                                                 00984000
JSCBRET  EQU   JSCBWTFG                                                 00985000
JSCBIOFG EQU   JSCBWTFG                                                 00986000
@NM00020 EQU   JSCBSEC1+60                                              00987000
JSCBQMPI EQU   JSCBSEC1+56                                              00988000
JSCBPMSG EQU   JSCBSWT1                                                 00989000
JSCRSV16 EQU   JSCBSWT1                                                 00990000
JSCRSV15 EQU   JSCBSWT1                                                 00991000
JSCRSV14 EQU   JSCBSWT1                                                 00992000
JSCRSV13 EQU   JSCBSWT1                                                 00993000
JSCRSV12 EQU   JSCBSWT1                                                 00994000
JSCRSV11 EQU   JSCBSWT1                                                 00995000
JSCBPASS EQU   JSCBSWT1                                                 00996000
JSCBTTTR EQU   JSCBSEC1+52                                              00997000
JSCRSV10 EQU   JSCBSEC1+49                                              00998000
JSCBAUTH EQU   JSCBOPTS                                                 00999000
JSCSIOTS EQU   JSCBOPTS                                                 01000000
JSCRSV08 EQU   JSCBOPTS                                                 01001000
JSCRSV07 EQU   JSCBOPTS                                                 01002000
JSCRSV06 EQU   JSCBOPTS                                                 01003000
JSCBLONG EQU   JSCBOPTS                                                 01004000
JSCRSV05 EQU   JSCBOPTS                                                 01005000
JSCRSV04 EQU   JSCBOPTS                                                 01006000
JSCBSECB EQU   JSCBSEC1+44                                              01007000
JSCRSV03 EQU   JSCBSEC1+41                                              01008000
JSCBSTEP EQU   JSCBSEC1+40                                              01009000
JSCBDCBA EQU   JSCBDCB+1                                                01010000
JSCRSV02 EQU   JSCBDCB                                                  01011000
JSCBID   EQU   JSCBSEC1+32                                              01012000
JSCBDBTB EQU   JSCBSEC1+28                                              01013000
JSCBIJSC EQU   JSCBSEC1+24                                              01014000
JSCBTCBP EQU   JSCBSEC1+20                                              01015000
JSCBPCC  EQU   JSCBSEC1+16                                              01016000
JSCBTCP  EQU   JSCBSEC1+12                                              01017000
JSCBSHR  EQU   JSCBSEC1+8                                               01018000
JSCHPCEA EQU   JSCHPCE+1                                                01019000
JSCRSV32 EQU   JSCHPCE                                                  01020000
JSCRSV01 EQU   JSCBSEC1                                                 01021000
@NM00019 EQU   IEZJSCB                                                  01022000
TIOTFEND EQU   POOLSTAR+16                                              01023000
TIOPSLOT EQU   POOLSTAR+13                                              01024000
TIOPSTTB EQU   POOLSTAR+12                                              01025000
TIOPPOOL EQU   POOLSTAR+4                                               01026000
TIOPNSRT EQU   POOLSTAR+3                                               01027000
@NM00018 EQU   POOLSTAR+2                                               01028000
TIOPNSLT EQU   POOLSTAR+1                                               01029000
@NM00017 EQU   POOLSTAR                                                 01030000
TIOEFSRT EQU   TIOENTRY+17                                              01031000
TIOSVERF EQU   TIOESTTB                                                 01032000
TIOSUNLD EQU   TIOESTTB                                                 01033000
TIOSMNTD EQU   TIOESTTB                                                 01034000
TIOSSETU EQU   TIOESTTB                                                 01035000
TIOSVLSR EQU   TIOESTTB                                                 01036000
TIOSPVIO EQU   TIOESTTB                                                 01037000
TIOSREQD EQU   TIOESTTB                                                 01038000
TIOSUSED EQU   TIOESTTB                                                 01039000
TIOSBALS EQU   TIOESTTC                                                 01040000
TIOSBALP EQU   TIOESTTC                                                 01041000
TIOSVOLS EQU   TIOESTTC                                                 01042000
TIOSVOLP EQU   TIOESTTC                                                 01043000
TIOSAFFS EQU   TIOESTTC                                                 01044000
TIOSAFFP EQU   TIOESTTC                                                 01045000
TIOSDEFR EQU   TIOESTTC                                                 01046000
TIOSDKCR EQU   TIOESTTC                                                 01047000
TIOEJFCB EQU   TIOENTRY+12                                              01048000
TIOEDDNM EQU   TIOENTRY+4                                               01049000
TIOTREM  EQU   TIOELINK                                                 01050000
TIOESSDS EQU   TIOESYOT                                                 01051000
TIOESYIN EQU   TIOELINK                                                 01052000
TIOEQNAM EQU   TIOELINK                                                 01053000
TIOEDYNM EQU   TIOELINK                                                 01054000
TIOTTERM EQU   TIOELINK                                                 01055000
TIOTRV01 EQU   TIOELINK                                                 01056000
TIOSYOUT EQU   TIOELINK                                                 01057000
TIOSDSP2 EQU   TIOESTTA                                                 01058000
TIOSDSP1 EQU   TIOESTTA                                                 01059000
TIOSLABL EQU   TIOESTTA                                                 01060000
TIOSDADS EQU   TIOESTTA                                                 01061000
TIOSJBLB EQU   TIOESTTA                                                 01062000
TIOSPLTS EQU   TIOESTTA                                                 01063000
TIOSPLTP EQU   TIOESTTA                                                 01064000
TIOSLTYP EQU   TIOESTTA                                                 01065000
TIOELNGH EQU   TIOENTRY                                                 01066000
TIOCSTEP EQU   TIOT1+8                                                  01067000
TIOCNJOB EQU   TIOT1                                                    01068000
TCTRSV11 EQU   TCTTIOT+6                                                01069000
TCTSZEXT EQU   TCTPLEXT+2                                               01070000
@NM00016 EQU   TCTPLEXT                                                 01071000
TCTLCS   EQU   TCTCORE+16                                               01072000
TCTRBA   EQU   TCTCORE+12                                               01073000
TCTRSZ   EQU   TCTCORE+10                                               01074000
TCTMINC  EQU   TCTCORE+8                                                01075000
TCTHWM   EQU   TCTCORE+4                                                01076000
TCTLWM   EQU   TCTCORE                                                  01077000
TCTSOUT  EQU   TCTPGSMF+16                                              01078000
TCTSIN   EQU   TCTPGSMF+12                                              01079000
TCTRGNS  EQU   TCTPGSMF+8                                               01080000
TCTACT   EQU   TCTPGOUT                                                 01081000
TCTAJS   EQU   TCTPGIN                                                  01082000
TCTPPST  EQU   SMFTCT+60                                                01083000
TCTAST   EQU   SMFTCT+56                                                01084000
TCTLOUT  EQU   SMFTCT+52                                                01085000
TCTLIN   EQU   SMFTCT+48                                                01086000
TCTWLMT  EQU   SMFTCT+44                                                01087000
TCTSACT  EQU   TCTTJLM                                                  01088000
TCTSTOF  EQU   TCTJSTX                                                  01089000
TCTRSV08 EQU   SMFTCT+32                                                01090000
TCTJMR   EQU   SMFTCT+28                                                01091000
TCTUDATA EQU   SMFTCT+24                                                01092000
TCTUTL   EQU   SMFTCT+20                                                01093000
TCTSZE   EQU   TCTPOOL+2                                                01094000
@NM00015 EQU   TCTPOOL                                                  01095000
TCTTCB   EQU   SMFTCT+4                                                 01096000
TCTRSV07 EQU   TCTSW                                                    01097000
TCTRSV06 EQU   TCTSW                                                    01098000
TCTRSV05 EQU   TCTSW                                                    01099000
TCTRSV04 EQU   TCTSW                                                    01100000
TCTRSV03 EQU   TCTSW                                                    01101000
TCTRSV02 EQU   TCTSW                                                    01102000
TCTIEX   EQU   TCTSW                                                    01103000
TCTJSTI  EQU   TCTSW                                                    01104000
TCTQA    EQU   SMFTCT                                                   01105000
DSABGRID EQU   DSABGIDL+4                                               01106000
DSABLLEN EQU   DSABGIDL                                                 01107000
DSABANAM EQU   DSABANMI+1                                               01108000
DSABANML EQU   DSABANMI                                                 01109000
DSABRS04 EQU   DSAB+68                                                  01110000
DSABSIOT EQU   DSAB+64                                                  01111000
DSABRS03 EQU   DSAB+62                                                  01112000
DSABDCBM EQU   DSAB+56                                                  01113000
DSABSSCM EQU   DSAB+52                                                  01114000
DSABSSNM EQU   DSAB+48                                                  01115000
DSABPTTR EQU   DSAB+44                                                  01116000
DSABTCBP EQU   DSAB+40                                                  01117000
DSABRS02 EQU   DSAB+38                                                  01118000
@NM00014 EQU   DSABFLG4                                                 01119000
DSABCKSI EQU   DSABFLG4                                                 01120000
DSABCKVL EQU   DSABFLG4                                                 01121000
DSABCKDS EQU   DSABFLG4                                                 01122000
@NM00013 EQU   DSABFLG3                                                 01123000
DSABJSCT EQU   DSABFLG3                                                 01124000
DSABCATL EQU   DSABFLG3                                                 01125000
DSABVMSC EQU   DSABFLG3                                                 01126000
DSABPASS EQU   DSABFLG3                                                 01127000
DSABDEFR EQU   DSABFLG3                                                 01128000
@NM00012 EQU   DSABFLG2                                                 01129000
DSABUNAL EQU   DSABFLG2                                                 01130000
DSABIRM  EQU   DSABFLG2                                                 01131000
DSABOPEN EQU   DSABFLG2                                                 01132000
DSABNUSE EQU   DSABFLG1                                                 01133000
DSABCATM EQU   DSABFLG1                                                 01134000
DSABPCAT EQU   DSABFLG1                                                 01135000
DSABDCAT EQU   DSABFLG1                                                 01136000
DSABCONV EQU   DSABFLG1                                                 01137000
DSABDCNV EQU   DSABFLG1                                                 01138000
DSABPALC EQU   DSABFLG1                                                 01139000
DSABDALC EQU   DSABFLG1                                                 01140000
@NM00011 EQU   DSABORG2                                                 01141000
DSABTR   EQU   DSABORG2                                                 01142000
DSABAM   EQU   DSABORG2                                                 01143000
@NM00010 EQU   DSABORG2                                                 01144000
DSABTQ   EQU   DSABORG2                                                 01145000
DSABTX   EQU   DSABORG2                                                 01146000
DSABGS   EQU   DSABORG2                                                 01147000
DSABU    EQU   DSABORG1                                                 01148000
DSABPO   EQU   DSABORG1                                                 01149000
DSABMQ   EQU   DSABORG1                                                 01150000
DSABCQ   EQU   DSABORG1                                                 01151000
DSABCX   EQU   DSABORG1                                                 01152000
DSABDA   EQU   DSABORG1                                                 01153000
DSABPS   EQU   DSABORG1                                                 01154000
DSABIS   EQU   DSABORG1                                                 01155000
DSABSSVA EQU   DSAB+21                                                  01156000
DSABRS01 EQU   DSAB+20                                                  01157000
DSABOPCT EQU   DSAB+14                                                  01158000
DSABLNTH EQU   DSAB+12                                                  01159000
DSABBCHN EQU   DSAB+8                                                   01160000
DSABID   EQU   DSAB                                                     01161000
@NM00009 EQU   TIOPREFX+20                                              01162000
@NM00008 EQU   TIOPREFX+16                                              01163000
@NM00007 EQU   TIOPREFX+12                                              01164000
@NM00006 EQU   TIOPREFX+8                                               01165000
@NM00005 EQU   TIOPREFX+4                                               01166000
@NM00004 EQU   TIOPREFX                                                 01167000
TCTDDCTR EQU   TCTDVENT+4                                               01168000
@NM00002 EQU   TCTFLAGS                                                 01169000
@NM00001 EQU   TCTFLAGS                                                 01170000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01171000
@ENDDATA EQU   *                                                        01172000
         END   IEFIB660,(C'PLS0747',0603,74211)                         01173000
./  ADD  SSI=42100901,NAME=IEFSCAN
         TITLE  'IEFSCAN-BIT PATTERN SCAN ROUTINE'                      00900019
IEFSCAN  CSECT                                                          01800019
*********************************************************************** 02700019
*                                                                     * 03600019
*  FUNCTION: 1.SCAN BIT PATTERN AND RETURN A UCB ADDRESS TO THE       * 04500019
*              CALLER WHEN A REAL UCB (BIT=1) IS FOUND                * 05400019
*            2.CONTINUE SCAN IF CALLER WISHES TO                      * 06300019
*                                                                     * 07200019
*  INPUT:                                                             * 08100019
*            R1 PTS TO LUT                                            * 09000019
*                                                                     * 09900019
*  OUTPUT:                                                            * 10800019
*            R1  CONTAINS UCB ADDR                                    * 11700019
*                      OR 0 IF UCB'S HAVE BEEN SEARCHED               * 12600019
*                                                                     * 13500019
*********************************************************************** 14400019
          ENTRY UCBSCAN                                                 15300019
         ENTRY  UCBCONT                                                 16200019
WORDSIZE EQU   32                                                       17100019
BYTESIZE EQU   7                                                        18000019
R0       EQU   0                                                        18900019
R1       EQU   1                                                        19800019
R2       EQU   2                                                        20700019
R3       EQU   3                                                        21600019
R4       EQU   4                                                        22500019
R5       EQU   5                                                        23400019
R6       EQU   6                                                        24300019
R7       EQU   7                                                        25200019
R8       EQU   8                                                        26100019
R9       EQU   9                                                        27000019
R10      EQU   10                                                       27900019
R11      EQU   11                                                       28800019
R12      EQU   12                      LCT BASE                         29700019
R13      EQU   13                                                       30600019
R14      EQU   14                                                       31500019
R15      EQU   15                                                       32400019
X0       EQU   0                                                        33300019
ONE      EQU   1                                                        34200019
THREE    EQU   3                                                        35100019
OFFSET   EQU   12                                                       36000019
FOUR     EQU   4                                                        36900019
EIGHT    EQU   8                                                        37800019
         SAVE  (14,12)                 SAVE CALLER'S ENVIRONMENT        38700001
         USING DEVINFO,R8              DEVICE INFORMATION TABLE BASE    39600019
         BALR  R9,R0                   ESTABLISH BASE                   40500019
         USING *,R9                    **                               41400019
         MODID BR=YES                                            Y01886 41450001
         LA    R11,SCANSAVE            INCREMENT TO NEXT SAVE AREA      42300019
         ST    R11,EIGHT(R13)          SAVE FORWARD LINK                43200019
         ST    13,FOUR(R11)        SAVE BACKWARD LINK                   44100019
         LR    R13,R11                 PT TO THIS ROUTINES SAVE AREA    45000019
         LR    R12,R1               SAVE PTR TO LUT                     45900019
         L     R8,VCONBP               **                               46800019
*                                                                       47700019
         LA    R2,ONE              INCREMENT FOR OUTER LOOP             48600019
         SR    R3,R3                                                    49500019
         LH    R3,DVPTSIZE         COMPARAND-SIZE BIT PATTERN           50400019
         BCTR  R3,0                                                     51300019
         SR    R7,R7               INDEX FOR OUTER LOOP                 52200019
         SR    R10,R10             INITIALIZE WORD POINTER              53100019
         B     SC002                                                    54000019
SC001    LA    R10,4(R10)          INCREMENT TO NEXT WORD               54900019
SC002    LA    R5,WORDSIZE         COMPARAND FOR INNER LOOP             55800019
         L     R6,DVBITS(R10)      WORD FROM BIT PAT FOR TEST           56700019
SC003    LTR   R6,R6               TEST IF BIT IS ON (HIGH BIT)         57600019
         BM    SC004               YES-BRANCH                           58500019
SC006    EQU   *                                                        59400019
         BXH   R7,R2,SC005         OUTER LOOP CONTROL                   60300019
         SLL   R6,ONE              NO-GET NEXT BIT                      61200019
         BCT   R5,SC003            INNER LOOP CONTROL                   62100019
         B     SC001               GET NEXT WORD IN PATTERN             63000019
SC004    LR    R1,R7               GET ENTRY NUMBER                     63900019
         SLL   R1,ONE             ENTRIES TWO BYTES LONG                64800019
         AR    R1,R12              ADD START OF LUT                     65700019
         LH    R1,X0(R1)               PLACE UCB ADDR IN PARM REG       66600019
         N     R1,UCBMASK         TURN OFF PROPAGATED SIGN OF   Z30ANPE 66900003
*                                 16 BIT UCB ADDR               Z30ANPE 67200003
         B     RETURN             RETURN                                67500019
SC005    EQU   *                                                        68400019
         SR    R1,R1              INDICATE END OF SCAN                  69300019
RETURN   STM   R14,R12,OFFSET(R13)     SAVE SUBRTNS RGS                 70200019
         LR    R15,R7                                                   71100019
         L     R13,FOUR(R13)           RETURN TO CALLER'S SAVE AREA     72000019
         LM    R2,R12,28(R13)          **                               72900019
          L    R14,12(R13)                                              73800019
         BR    R14                     RETURN                           74700019
*                                                                       75600019
* ENTRY TO CONTINUE SCAN                                                76500019
UCBSCAN  EQU  *                                                         77400019
         USING *,R15                                                    78300019
UCBCONT  STM   R14,R12,OFFSET(R13)     SAVE CALLERS REGS                79200019
         LA    R11,SCANSAVE        GET ADDR OF SAVE AREA                80100019
         ST    13,FOUR(R11)        SAVE BACKWARD LINK                   81000019
         LR    R13,R11             POINT TO CURRENT SAVEAREA            81900019
         LM    R14,R12,OFFSET(R13)     RESTORE SUBRTN'S REGS            82800019
         DROP R15                                                       83700019
         B     SC006               RETURN TO PROCESSING                 84600019
* CONSTANTS                                                             85500019
         DS    0F                                                       85700003
UCBMASK  DC    XL4'0000FFFF'                                    Z30ANPE 85900003
SCANSAVE DS    18F                                                      86400019
VCONBP   DC    V(IEFDEVPT)                                              87300019
DEVINFO  DSECT                                                          88200019
DVPTLEN  DS    CL2           NUMBER OF BYTES CONTAINED IN BIT PATRN     89100019
DVPTSIZE DS    CL2                 NUMBER OF BITS IN MAIN PAT           90000019
DVPTDEV  DS    CL2           NUMBER OF REAL DEVICES SYSGENNED           90900019
DVPT2321 DS    CL2           NUMBER OF DATACELLS GENNED                 91800019
DVPT     DS    CL4           RESERVED                                   92700019
DVBITS   DS    CL1           BIT PATTERN (VARIABLE LENGTH)              93600019
         END                                                            94500019
./  ADD  SSI=32300172,NAME=IEFXVNSL
 TITLE  'NON STANDARD LABEL ROUTINE MODULE '                            00050002
*********************************************************************** 00070002
*                                                                       00090002
* MODULE NAME - IEFXVNSL                                                00110002
*                                                                       00130002
* DESCRIPTIVE NAME - USER-REPLACEABLE READ NON-STANDARD LABEL RTN       00150002
*                                                                       00170002
* COPYRIGHT - N/A                                                       00190002
*                                                                       00210002
* STATUS - OS/VS2, RELEASE 2, CHANGE LEVEL 12                           00230002
*                                                                       00250002
* FUNCTION -                                                            00270002
*   THE PURPOSE OF THIS ROUTINE IS TO TAKE THE PLACE OF THE USER        00290002
*   AVR NON-STANDARD LABEL PROCESSING ROUTINE WHEN NONE IS SUPPLIED.    00310002
*   THE ROUTINE IS CALLED BY AVR ROUTINE IEFAB473. THIS ROUTINE PUTS    00330002
*   A RETURN CODE OF 4 INTO REGISTER 15 AND THEN RETURNS TO IEFAB473.   00350002
*                                                                       00370002
*   OPERATION - SEE FUNCTION                                            00390002
*                                                                       00400002
* NOTES                                                                 00410002
*   DEPENDENCIES - THIS ROUTINE MUST BE REPLACED BY THE USER IF NON-    00430002
*                  STANDARD LABEL VOLUMES ARE TO BE SUCCESSFULLY        00450002
*                  PROCESSED.                                           00470002
*     CHARACTER CODE DEPENDENCIES - NONE                                00490002
*   RESTRICTIONS - NONE                                                 00510002
*   REGISTER CONVENTIONS - N/A                                          00530002
*   PATCH LABEL - NONE                                                  00550002
*                                                                       00570002
* MODULE TYPE -                                                         00590002
*   PROCESSOR - ASSEMBLER                                               00610002
*   MODULE SIZE - N/A                                                   00630002
*   ATTRIBUTES  - PAGED LPA, REENTRANT,SUPERVISOR STATE,SCHEDULER KEY   00650002
*                                                                       00670002
* ENTRY POINT - IEFXVNSL                                                00690002
*   PURPOSE - SEE FUNCTION                                              00710002
*   LINKAGE - FROM PL/S ROUTINE                                         00730002
*     CALL IEFXVNSL(PARM1,PARM2)                                        01050002
*   INPUT -                                                             01060002
*     REGISTER 1 POINTS TO A 2 WORD LIST CONTAINING:                    01070002
*       1) PTR TO START OF LABEL                                        01080002
*       2) PTR TO 1-WORD RETURN AREA WHERE USER IS TO STORE A PTR       01090002
*          TO THE VOLUME SERIAL                                         01100002
*     NOTE: THIS INPUT IS NOT USED BY THIS ROUTINE. IT IS FOR USE       01110002
*           BY THE USER ROUTINE REPLACEMENT.                            01120002
*   REGISTERS SAVED - NONE                                              01130002
*   REGISTER USAGE - N/A                                                01140002
*   REGISTERS RESTORED - NONE                                           01150002
*                                                                       01160002
* EXIT-NORMAL - NONE                                                    01170002
*                                                                       01180002
* EXIT-ERROR                                                            01190002
*   CONDITION - THIS ROUTINE HAS BEEN CALLED TO READ A NON-STANDARD     01200002
*               LABEL                                                   01210002
*   OUTPUT - NONE                                                       01220002
*   RETURN CODE - 4                                                     01230002
*                                                                       01240002
* EXTERNAL REFERENCES - NONE                                            01250002
*                                                                       01260002
* MACROS -                                                              01270002
*   RETURN                                                              01280002
*                                                                       01290002
*   SERIALIZATION - NONE                                                01300002
*                                                                       01310002
* CHANGE ACTIVITY - SUPPORT CODE Y02670                                 01320002
*                                                                       01330002
* MESSAGES - NONE                                                       01340002
*                                                                       01350002
* ABEND CODES - NONE                                                    01360002
*                                                                       01370002
*********************************************************************** 01380002
IEFXVNSL CSECT                                                          01390002
         RETURN ,RC=4                                                   01600002
         END                                                            01650002
